[{"review_id":"WcMnK1Tn-Kx1iDt8qmU5SA","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"5KBbN8dV8_bGHxqEhkn31A","stars":5,"date":"2011-03-19","text":"Fantastic little Ma & Pa's place!  I've been here many times and have never been disappointed.  The meals are a great portion size, and not expensive.  The pizza's are probably the biggest hit and definitely better than franchised businesses like Dominoes or Pizza Pizza.\nI've taken out-of-town friends here too, and now when I see them again they always want to go back to MK's!\nCheers!","useful":1,"funny":0,"cool":0},
{"review_id":"EnOyvVCgPfG8Ld40JgDvBg","user_id":"Qzd8moQnuzdgxE87tTTqNw","business_id":"1_Bwp-442E_YWFimEEzhVw","stars":1,"date":"2015-05-20","text":"I've been getting haircuts here in the past 6 months and I have to say that today killed my experience and I'm never walking in here again. \n\nHorrible customer service. The barber told me to quit being a cry baby because I told him how I disliked my previous barber at the same place for making my head bleed several times. It's a haircut, not a head cut. Yes, even professionals make mistakes but that's not something you tell a customer.","useful":0,"funny":4,"cool":0},
{"review_id":"DyhpfNtTLgQgOngQBt9WvA","user_id":"_2i48QzZ3zkRvyrFsWtUTA","business_id":"OjZOslwG6DjZ6tKzve_t9Q","stars":5,"date":"2012-05-01","text":"I first came into Fabulous cuts about 5 months ago would honestly have to say one of the best hair cuts I've gotten in Scottsdale with prices you can't beat. \n\n     A lot has to be said about the staff as well, the first time I went in Val did an awesome job on my hair, but it was my second time in that I met Boris the owner. I started talking to him and got the impression that he is extremely business oriented with a steady hand and a good head on his shoulders. If Boris keeps it up his business will go far... I've been there countless times since and I will continue far into the future.... Fabulous cuts keeps me lookin fly!","useful":1,"funny":0,"cool":0},
{"review_id":"Ajo_vY4L0ypZ4nrKvmSrcg","user_id":"JOekaeqamSlOj5H-787XvQ","business_id":"av_-ePHJwSSqMtTQbNoL7g","stars":5,"date":"2017-01-26","text":"Friendly and helpful staff - they take care of you here! We only had appetizers and a beer at the bar, but apps were hot and tasty and good beer variety (we are craft snobs). Ran out of one app, manager (owner?) apologized up and down. Super nice folks. Will come back again.","useful":0,"funny":0,"cool":0},
{"review_id":"U3q10zlpKlM5EOMixMl5aA","user_id":"JOekaeqamSlOj5H-787XvQ","business_id":"_CnQ9snaSz8IIuKpNGj7KA","stars":2,"date":"2016-10-08","text":"My experience was mixed. First encounter with a salesman was positive. I was replacing a 25 yo bike due to discomfort on long tours, and didn't want to pay for things that I didn't need. He listened well and narrowed the choices, and suggested that I start with a fitting to ensure best comfort. I did have my old bike fitted (prepurchase fitting), even though I thought it expensive (a second fitting would also be needed for the new bike for seat mapping, etc). The appointment started 30 min late, and a second salesman was a bit awkward with me in the store, but the fitting was thorough, and the tech spent a lot of time making sure that it was exactly right. This did not help me with selection- she directed me to a website - but I figured I would come back and talk to the original salesman. The change of my old bike did make a huge difference. I was able to extend my range the following day and was much more comfortable...until I had a minor crash when my handle bars came loose. Turns out all the changed settings were not tightened down completely (protective caps were also left off). Luckily we were in the last 2-1\/2 miles of a 40 mile ride so the walk back was only a mild annoyance - some responsibility is mine for not checking the bike first. My husband was much more frustrated about the lack of attention to detail and vowed never to return.","useful":0,"funny":0,"cool":0},
{"review_id":"pcn01EMERpCpHEcoaohdEg","user_id":"RTiaaHSN80VRTLSdNK5rfQ","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":5,"date":"2014-12-30","text":"This SECRET  PIZZA was a secret for about 5 stays at the Cosmo. Now that I know where it is its my favorite late night snack. Ask for it well done and the crust will be perfect. The staff was great, they actually recognized me from the night before....I guess I've become a regular.","useful":0,"funny":0,"cool":0},
{"review_id":"lfoPcD8nz38wNw573mX82g","user_id":"53CTWKld1HrEZLAJKbEhqQ","business_id":"hcWabsa9YZDSCqrgwjPRKg","stars":5,"date":"2016-03-11","text":"I've been a customer for over 15 years and have taken many different kinds of vehicles to their shop.  Always honest, fair pricing and great to work with, and I've worked with everyone in the shop.  No doubt that I would absolutely recommend them for tires or service.","useful":0,"funny":0,"cool":0},
{"review_id":"N57KAGpod95_Oq-DSSeSXA","user_id":"53CTWKld1HrEZLAJKbEhqQ","business_id":"lc638f5kBdOq9yAMyoURWg","stars":5,"date":"2016-09-15","text":"Exceptional from start to finish buying two new cars.  The cars were brought to us as we waited in the waiting room with cold water by Jacob Kannaga and he answered numerous questions on his cell phone afterward.  Sean Hornbeck reviewed pricing and inventory multiple times and guided us through the purchase with ease.  Jon Faris was respectful, quick and no surprises during the financing.  Overall I will be back to purchase another car from Right Honda.","useful":0,"funny":0,"cool":0},
{"review_id":"t_mpWBAUiS4vdLOWYnyG-Q","user_id":"oHPnc_fZOKlJLOligmwl-g","business_id":"DizSoX0FqH_EvXSHW6wEIQ","stars":4,"date":"2017-04-27","text":"The place was good, the wait was bit long, service was nice( she was very pleasant) . The order did take a bit longer than others. I had ordered the vegetarian omelette. The omelettes are super fluffy ( I wonder how they make it ) and the toast ( from homemade bread) was the other best thing. I loved the place. And again the eggs were super fluffy","useful":0,"funny":0,"cool":0},
{"review_id":"OZ5EK5ux1-6gA6N7BFa8UQ","user_id":"oHPnc_fZOKlJLOligmwl-g","business_id":"7Gl_h0Dz4r3xEILhe6taNA","stars":4,"date":"2017-04-27","text":"We had the Bombay Chicken dry , as the all reviews were high for it. And it did turn out the Best Buy and did justice to all the reviews. It was spicy and full of flavours, for a person who started eating chicken recently, this was a good bet . Oh it was a take out,am yet to visit the place.","useful":0,"funny":0,"cool":0},
{"review_id":"F33jNjLCyZZX7dRAdcuhCg","user_id":"9IG2N_SMNFEKsD7cM6KzBA","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":3,"date":"2015-06-26","text":"This was a little bit of a disappointment. The food is very over priced for what it is. We had the fish and chips and lamb burger, both were good but not worth $70.00 and the flavor was nothing out of the normal - I've had similar good with better flavor a for a third of the price. The service was pretty poor as well, I had to ask 3 times for drink refills which can be frustrating when you are spending so much money... If your going just for the experience, just expect to pay more then it's worth. Cool looking restaurant though...","useful":0,"funny":0,"cool":0},
{"review_id":"JtteV40xxuG3AolqgKES-w","user_id":"1nSm5FGzBQI8RYNWml1DVQ","business_id":"rIHt5dCEPotEn-gy6IUT_A","stars":5,"date":"2015-08-03","text":"Great location, great staff, and the General Manager helped immensely. The room was perfect and my only regret is not using the pool or enjoying the lounge area before my trip was over. Looking forward to another stay sometime soon.","useful":0,"funny":0,"cool":0},
{"review_id":"cz7NMRYU08ib1Xm-Eo8yyg","user_id":"hjfUdZC218wZjhw_JLHqgA","business_id":"_ax_jfISiBZ4JSTHrI4xJA","stars":5,"date":"2014-06-15","text":"Wonderful place to eat. The food was terrific  and the service Great! If you have food allergies, they will accommodate you. Take a risk and eat at Copper Still Moonshine Grill.","useful":0,"funny":0,"cool":0},
{"review_id":"hBweJAWIflxwW0v7UoiSwQ","user_id":"hjfUdZC218wZjhw_JLHqgA","business_id":"AabR8NEwbwoGhQxJohs0OQ","stars":5,"date":"2014-03-15","text":"The best breakfast place ever! The food is always delicious and the service is great. I have dealt with stomach issues for years but I can eat here and have no issues. They also have gluten free food that tastes GREAT!  For a wonderful breakfast experience come and eat at JP Pancake.","useful":0,"funny":0,"cool":0},
{"review_id":"GrvqWrfY1DCNnCRcBYesbg","user_id":"hjfUdZC218wZjhw_JLHqgA","business_id":"zRn21C-gM2JOC6W8KoqVgQ","stars":5,"date":"2014-09-27","text":"Just love coming to this friendly place. The atmosphere and workers are great! Love my black tea and organic decaf Peruvian coffee. So relaxing and comfortable.","useful":1,"funny":0,"cool":1},
{"review_id":"YHOs2mRYh3nxbFXm8GaWiQ","user_id":"ZcSQVbrIjIxuWvSAMN9kfQ","business_id":"5Vt4PqzWwObmQeuhgMNsDQ","stars":1,"date":"2013-08-11","text":"I actually made a yelp account just so I can leave this comment this is how bad she was she came to my room drunk and high my room smells like weed my husband walked in our room  and went wtf this room smells like weed and she said oh my God you guys caught me I have a leftover joint in my pocket you guys want some. It was literally a freaking joke She didn't even do Me and my Sister-in-law's make up and hair all she did was put eyeliner on me all I gave her was $25 we were late for our concert to Celine Dion She ruined our night And I would never think it from her with all her reviews on here. for her to do something so stupid to be high and drunk to do somebody's make up and hair? And she also wanted my room key so she can go in the pool I was so scared I told her no","useful":2,"funny":4,"cool":0},
{"review_id":"cUxiVjhCZux_BCGZ9szvIg","user_id":"iiI7uMD7wT88OKVXEXbEyg","business_id":"nUfeYJ_YEaDzggPKnYry3g","stars":5,"date":"2017-01-10","text":"Excellent food and terrific service! Wait staff was attentive to us throughout our meal. Will be back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"m6NyL49g3yrFI6CDyoZZ4w","user_id":"JPgraaVYIhYmZClRIxRBjQ","business_id":"j4jsgp-e315s11ehJfRzAA","stars":5,"date":"2016-12-31","text":"Wow!! Our experience here was nothing short of amazing. Our server, George, went above and beyond for us. He was very entertaining and went out of his way to make sure we were all happy. Everyone at our table had something different - pork chop, fish, steaks, and chicken. Everything came out perfectly and was delicious! The dessert was very good too - especially the Tollhouse Cookie dish. This was a great place to come to celebrate an early New Years dinner and will definitely be back if I am in the area!","useful":0,"funny":0,"cool":0},
{"review_id":"Jrxt5THofquAbxCv8UxyNw","user_id":"JPgraaVYIhYmZClRIxRBjQ","business_id":"SvCjBtbN1cKElDKPTw9dOA","stars":5,"date":"2016-12-30","text":"Excellent service and everything from the starters to the dessert was absolutely fantastic! Everyone in our party of 8 tried a different type of fish and the vegetarian ravioli and nothing disappointed. The best part of the meal was the angel food grilled cheese for dessert. Our waiter recommended it and he was spot on. I would highly recommend it as well!","useful":0,"funny":0,"cool":0},
{"review_id":"eM196oN2TckwLtN3leo8Wg","user_id":"JPgraaVYIhYmZClRIxRBjQ","business_id":"sc__kdcFV4IcNTfBx1707w","stars":5,"date":"2016-12-30","text":"The hot cakes are delicious! We came here on a Thursday morning and had to wait about 30 minutes but the wait was well worth it. The service was quick and friendly for our group of 8 and the food was very yummy! The hot cakes did not disappoint. We also had the croissant French toast and some different egg dishes that were very good too. This is a great little place for breakfast if you're in the area and don't mind a wait!","useful":0,"funny":0,"cool":0},
{"review_id":"H-hLHGXXtppF-CNFX0ywxw","user_id":"JPgraaVYIhYmZClRIxRBjQ","business_id":"WOuE6HtLVTRothIN-zy4Pw","stars":4,"date":"2016-12-30","text":"Really nice hotel! The room is spacious and the bed is very comfortable. The housekeeping does a wonderful job - they come in twice a day and leave little chocolates for you before bed. The decor of the room is very colorful and interesting to look at. The security in the hotel is also very comforting - no using the elevators without your room key. The only downfall was that the room has no coffee maker and they only serve complimentary coffee from 7-9am. The shower head in our room also had poor pressure no matter how we adjusted the nozzle. But overall we had a very good experience and I would definitely come back!","useful":0,"funny":0,"cool":0},
{"review_id":"s6T3UwBL3z-0rPjXZeYyog","user_id":"iffbr4J2vwXGZmdD8kCbXg","business_id":"OUGkiDkzWXitisRL-MkmKQ","stars":1,"date":"2015-04-09","text":"The first reviewer is crap screen came loose 2 days later than it cracked David refused to warranty it because it had a crack not happy at all","useful":1,"funny":0,"cool":0},
{"review_id":"mibiVQ4FTcVo6Zbjizg46Q","user_id":"iffbr4J2vwXGZmdD8kCbXg","business_id":"v3o0mPMONSQDfvaFl0iwwg","stars":5,"date":"2015-04-09","text":"Girl at the front was super nice had a great attitude and smile lol service was also great had my severely crack windshield (big stone on deer foot ) of my Honda replaced in less than 2 hours","useful":0,"funny":0,"cool":0},
{"review_id":"BMH3tbTRcxLsh6H7ZE92uQ","user_id":"wYvehWUxiXETOSNu5Kd6Cg","business_id":"Kx0MUrNQ737s-VVElk6Vig","stars":4,"date":"2016-10-29","text":"Very authentic food with great prices. I had the chilaquiles with green sauce with both meat and fried egg on the side. The meat was thought to my taste but the chilaquiles with green sauce tasty as ever. My fiancé has the huevos con carne with chorizo which was awesome. The hitch ate that I had was on point and not to sweet.","useful":0,"funny":0,"cool":0},
{"review_id":"DId4CNUIFttzU6WpbgbDVQ","user_id":"wYvehWUxiXETOSNu5Kd6Cg","business_id":"CoyeXg8FBsS_d20QzNIy-A","stars":5,"date":"2016-11-09","text":"Makers and finders was a hidden gym located in the Fremont District of downtown Las Vegas. The food was very good as well as the different products an atmosphere that we were privy to. I will definitely frequent this location in my near travels to the Las Vegas area and look forward to it.","useful":0,"funny":0,"cool":0},
{"review_id":"t87PjIZcbxX05WT9VPwUFA","user_id":"wYvehWUxiXETOSNu5Kd6Cg","business_id":"I8j1gHLKNJVN4dNVUOsedw","stars":4,"date":"2016-11-09","text":"Vicky's diner is a hidden gem you definitely get everything that you see in the pictures that are posted to the yelp site. The breakfast food was definitely what we expected and needed although the orange shoes was not fresh squeezed it help with my hangover that I was having at the time. I will definitely frequent this location when I come back to Vegas the service was pleasant.","useful":0,"funny":0,"cool":0},
{"review_id":"0iJDvw1xhRf6PoaVt8VjAQ","user_id":"bcqFe1U3J_JNzNYHjOrBzA","business_id":"1flKw3TnAJKvyZ_uAP1KKA","stars":5,"date":"2013-02-25","text":"Great store with a friendly staff.  They answered all our questions and even provided some great entertainment.  Hope they open up soon in San Diego.","useful":0,"funny":0,"cool":0},
{"review_id":"0vxf9OTTNsMoZShj-myEvw","user_id":"dZ0P-Bjwww5WcuSd5U951A","business_id":"wQWhzyZNzFQKAOiSVEXCwA","stars":5,"date":"2015-07-10","text":"Vladimir was great. Our fridge \"died\" and we called him at 8am. He rang our doorbell at 9. He walked in, opened the refrigerator and knew exactly what it was in about 2 seconds. He fixed the problem, took a quick break to play with our dog, and gave us great prices. Vlad is a true professional with fast and friendly service. I'll never need to go anywhere else again.","useful":0,"funny":0,"cool":0},
{"review_id":"6_ht9d7Y6n0GIshj89NS-g","user_id":"LTmfDekUHgSCf9TeQoQi1w","business_id":"6gPcuK1mTlJDb3SG7d0q7A","stars":5,"date":"2017-09-05","text":"Excellent place. We recently had food catered from this place. Many of our non- Indian guests, some of whom, don't care for spicy food, simply loved the items and many went for more. The owner partners are very accommodating and truly care. This is the place I choose whenever someone asks me to suggest an Indian restaurant and I enjoy taking friends who show an interest. 6 Flavors has excellent buffets most days. Indian food of South India. Well prepared and tasty.","useful":0,"funny":0,"cool":0},
{"review_id":"D0D9QgDHoTrlUFmTql_FbQ","user_id":"LTmfDekUHgSCf9TeQoQi1w","business_id":"oJTSBiliPgkIhss2ZqJ_xA","stars":5,"date":"2017-09-23","text":"One of the better places for Happy Hour in Solon. Great appetizers and drinks. Best was to be served by Sarina. She is so good and has a pleasant personality. The calamari appetizer was average. I have had better calamari. The blackened shrimp tacos were the best. We asked for lettuce wrap instead of taco shell. Super tasty.","useful":0,"funny":0,"cool":0},
{"review_id":"t70G4g_N4nf7jSKBmYh0kA","user_id":"LTmfDekUHgSCf9TeQoQi1w","business_id":"zG3GJiIrF01bwgP0tQdkZg","stars":5,"date":"2016-12-30","text":"Great place for anything Asian-- sushi, sashimi, chinese you name it. Food is very flavorful. Megan Stone is great. Our server Jenn was flustered a bit at the start. Got me the wrong beer and wrong sashimi dish as well. As the evening progressed, she showed a bit of humor. Drunken fish very tasty. Seaweed salad another winner.","useful":0,"funny":0,"cool":0},
{"review_id":"vWSuB7BT9QRZuljTMNcMlA","user_id":"LTmfDekUHgSCf9TeQoQi1w","business_id":"_6n27rKvvDiPzWjcF24onA","stars":5,"date":"2017-09-12","text":"Great place. Best hidden secret in Solon Ohio. The service and atmosphere are second to none. Happy Hour so good you would want it to never end. Russ is so courteous and pleasant. Makes great drinks. Every food item is tasty.","useful":0,"funny":0,"cool":0},
{"review_id":"kGXjk8buVst1BFSEeNyxzg","user_id":"1YWcVE0J2yeUPDn_iFbcmg","business_id":"CHjmzfE0PhHhetuQLEEE6g","stars":5,"date":"2013-05-22","text":"I have never gotten a perm but desperately wanted a digital perm.  I currently live in Ohio and there are NO salons here that offer it, so on one of my Vegas trips I looked up Marshall on Yelp.  I was concerned because I'm caucasian and was worried my hair wouldn't take the perm.  My stylist assured me it'd be alright, that they knew how to handle it.  And they did!  I saw Jong Seok Won and will go back to him every 6 months to re-up!  It's worth a trip to Vegas to get this beautiful perm.  I've gotten SO many compliments on my hair ever since I got it done, and Jong showed me all the different ways to style it.  I also greatly appreciated Jong's patience with me, as there was a bit of a language barrier, and he was patient and worked wonderfully with me, and was the kindest of men.  Can't wait to get it done again!\nThe perm took about 2 1\/2 hours (which I liked because the salons in LA and SoCal said the digital perm would take 4 hours!!!) and I was comfortable and the process was smooth and easy.  The price was wonderful also,  the quote I was given was $200 for the perm (I have very long hair) and that came also with a cut before the perm and also styling (and styling lessons) after.  I highly recommend Marshall Salon and Jong Seok Won!","useful":4,"funny":0,"cool":0},
{"review_id":"7NXejzb_jYd_pwgjlpSSfA","user_id":"vw5nHgw22uqu88t_q2A7pg","business_id":"IbiPt7jzF8Wsu82nHXaJPA","stars":5,"date":"2016-12-17","text":"Buffet is great deal for the price with a good range of vegeterian ,chicken and goat items - especially liked were the Himalayan chicken and goat curry.  We are a non vegetarian family originally from India visiting from Austin, tx. Son and I ordered off the menu while the hubby and daughter went for the buffet. We ordered lassi, tomato soup, alu paratha and chai off the menu. Food is fresh hot and nicely spiced and came quickly to our table. Our server was friendly and chatty.","useful":0,"funny":0,"cool":0},
{"review_id":"hex5TeZQfH8zjtUf2HgDKQ","user_id":"3fUhQhk1bsbCMBi500UljQ","business_id":"vjaHGc25CcyNPZTbjDa7Ww","stars":5,"date":"2014-01-03","text":"This team remembers the basics--good food and good service. The mahi tacos were great! The sliders were tasty! As for service, ask for Thomas, a top-notch server. GSW","useful":2,"funny":0,"cool":0},
{"review_id":"xC7PYD4iAR9dqv8XiXBk2w","user_id":"AycU7KgRvjVnukAiV7lTRQ","business_id":"n3cFalLLuMyAy3Oe2dcwQw","stars":5,"date":"2016-12-17","text":"I've been to 8 different BonChon Chicken restaurants throughout the country. This is by far the best. I don't care how long I have to wait, better than driving to Columbus or DC to get this chicken. Trust me it is worth it. \n\nI don't normally write reviews, but it is needed. These other reviewers are absolutely ridiculous. Yes, I am calling you out. Why don't you open your own restaurant and see how hard it is to get everything right in the first 2 months of opening.  Whiny bitches.","useful":0,"funny":0,"cool":0},
{"review_id":"ZIWAtblJb5SVRup7nJ3oiA","user_id":"v0v8OQnrFG3seCWKWw1gbQ","business_id":"MgPbFjdTZUo9L_fziqKB4g","stars":5,"date":"2015-04-14","text":"My husband and I love action packed adventures and nature, and let me tell you this was perfect for us. The ladies in the office were very nice and our guide, Jonathan, was very attentive and knowledgeable. Someone on our group got stuck in the sand a couple of times and Jonathan was able to get us back on track in a few minutes. During my turn to drive I kept looking up at the scenery because it was breathtaking. Jonathan offered to take pictures of us along the way to protect out phones. Be prepared to get dirty and if you are like me and like to drive fast be prepared to eat a little bit of sand. I screamed a lot. If you are going to visit Vegas you must take a ride with SunBuggy. You won't forget it or regret it.","useful":0,"funny":0,"cool":0},
{"review_id":"-aejy-cJFPc-oFnm4BmBYA","user_id":"Lv3MAuP_0yVNZFj3jl9nPQ","business_id":"Y_SKyssv8ClQ_p25lCsbAQ","stars":4,"date":"2017-07-31","text":"Im always looking for a good spot for a family dinner that has great food at a reasonable price.  This fits the bill.  I have been here twice with my wife and my 2 year old.  Both times the food was excellent.  I hold back the fifth star because the service could be better.  There is only two waitresses working on a friday night and they are responsible for seating guests, taking drink orders, clearing tables and delivering the food.  A hostess and a bus boy would really improve this restaurant experince.  \nThe roasted vegetables are amazing as well as the greens and beans.  Ive also been impressed with the chicken milanese.  I really enjoyed it and the pasta that came with it.\nI will definitely be back to this restaurant in the future.  The portions are huge.  Ive taken food home both visits.","useful":0,"funny":0,"cool":0},
{"review_id":"LKuoZAjX4ZdTcptc9CuuMQ","user_id":"Lv3MAuP_0yVNZFj3jl9nPQ","business_id":"vXhlnFw9k5ch1GVFOlddgQ","stars":5,"date":"2017-05-23","text":"Just had a simple lunch.  Spicy tuna roll, salmon and yellow tail.  I was amazed at how fresh the fish was.  I have tried alot of places around Pittsburgh, so far this has had the best quality fish.  I will definitely be back","useful":0,"funny":0,"cool":0},
{"review_id":"VcHzPcj6lSEiPG0YuTk1dA","user_id":"Lv3MAuP_0yVNZFj3jl9nPQ","business_id":"yrQyg1Ap8EyxQ1ulu3QStg","stars":4,"date":"2017-07-31","text":"Stopped here on a sunday morning with the family.  Nice small traditional diner.  All the food was very good, nothing fancy just basic omelettes and pancakes.  The service was great.  Im sure to be back.","useful":0,"funny":0,"cool":0},
{"review_id":"20O1wrPUJGCzYRJs976lZg","user_id":"4UwAodS7ydEaY0cnn9mzTA","business_id":"5RVbdMA1oVz7GCOIwn1Z3Q","stars":4,"date":"2015-12-16","text":"There are days where I crave Peppi's. On the same day that Pittsburgh came out as one of the 17 best foodie cities in the country, I'm at Peppi's. And I am ok with that.","useful":2,"funny":0,"cool":0},
{"review_id":"ZAMh4UbOoVeyvvwQrtFu8g","user_id":"4UwAodS7ydEaY0cnn9mzTA","business_id":"7pyBqVHSq9uE3aODO_hhTA","stars":4,"date":"2017-06-07","text":"This is my go to place for breakfast or lunch when close to downtown. Very unassuming place. Very Pittsburgh. Dive bar\/restaurant with really good food. Excellent service always.","useful":0,"funny":0,"cool":0},
{"review_id":"Ki7M-nkUu4s8W-gcx7DNZA","user_id":"4UwAodS7ydEaY0cnn9mzTA","business_id":"dLc1d1zwd1Teu2QED5TmlA","stars":4,"date":"2015-05-06","text":"Got take out tonight. Trust me when I say Level 1 spicy is pretty damn spicy. Had the Street Noodle 2. Good choice. VERY limited menu. Don't go expecting to peruse lots of options. CASH ONLY. Good service.","useful":0,"funny":0,"cool":0},
{"review_id":"NtWuZRgmKq_qEQjh3EBFXg","user_id":"u20ENY85dR1WffJnhG8H7w","business_id":"e6d50rwRTU-fONeSBJmOHQ","stars":4,"date":"2017-06-25","text":"I will eat there 2x a month and always get\nThe Pork Ramen.  Its pretty tasty,and such \nComfort food for me. Normally pork doesn't do anything for me, but this was ok","useful":0,"funny":0,"cool":0},
{"review_id":"UPzRkYjXo42KjwkF8YorXA","user_id":"u20ENY85dR1WffJnhG8H7w","business_id":"ha_mea2KXpVgHwxD0RDLGQ","stars":1,"date":"2017-05-14","text":"I never thought i would say this about really any restaurant, but We Will not be going back to Jc's. Horriable! Horriable!\nWe ordered,the 32oz , my husband & i, got everything set, and when the dinner actually showed up, it wasnt cooked AT ALL to what we ordered.\nSent it back ( total mistake), the manager threw it on our table,never said Sorry \" OUR MISTAKE\" instead she said,\" Here you go,we even put on new plates\" and walked off.\nMeat was worst the 2nd time around!!!\nReceived bill ( 94.00$)\nNo discount, nothing!....for a mistake They made!...\nWe could of made soo many other choices that night, but we didn't. \n$94.00 out the window, but trust me we will never will make that mistake again!","useful":3,"funny":0,"cool":0},
{"review_id":"lznl_yMrWhmD9YUZNHswYQ","user_id":"aqrW1tLMCGBJUoMp5ts-lg","business_id":"QjpSzBvyLHmsj8jR6ijq6w","stars":1,"date":"2016-01-16","text":"Les dumplings sont excellents mais l'accueil et le service, excessivement mauvais. Le propriétaire\/serveur est rude et n'a aucune aptitude pour le service à la clientèle. À éviter.","useful":0,"funny":0,"cool":0},
{"review_id":"LZX-Lt4_9T-FrDlHOWcsbw","user_id":"oVswGR73HLi_UfNC4Ut0dA","business_id":"VAmT8trxVTU6EJAgHqhpuw","stars":1,"date":"2016-12-03","text":"Do not support this store. As you can see from reviews their customer service and the way they do business is a scam. \n\nI wanted to return merchandise and I didn't have the actual receipt in front of me, but had the transactions from my card. I had bought over $800 on a work trip 2 weeks prior with no time to try them on, had planned on bringing them back. \n\nI spent 90minutes in the store and was in hold with customer service for 25min on hold until they hung up on me without ever getting to talk to someone. \n\nThe store manager said to email customer service, but they told me they don't deal with stores and sent me back to the store.\n\nLong story short, the store took back my merchandise but never gave me store credit or my money back. Is that legal? \n\nYes the clothes are beautiful at a great price, but all they want is your money and don't care about screwing customers over.","useful":0,"funny":4,"cool":0},
{"review_id":"tN79hN2-xitJ7Kko28u2kg","user_id":"oVswGR73HLi_UfNC4Ut0dA","business_id":"p1XLB4zo6sI09Pb4-IA23Q","stars":1,"date":"2016-09-14","text":"Do not order. They got my order wrong and when I told the man who delivered he told me they didn't have the item I their menu. He never said sorry and was implement unapologetic. He just looked away and said no no no. When I told him it was on their website he just said no.","useful":0,"funny":2,"cool":0},
{"review_id":"9QVw5AsgD2YmRovfTIBGuQ","user_id":"1PbzWjuxnLf7y9LDrMLdFg","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":4,"date":"2011-09-21","text":"The food has a wonderful  blending of flavors.  Craig was our server and he was very attentive.  My husband has allergies and the kitchen was very careful on the ingredients in each dish.  It is  more than we normally pay for burgers - but these are gourmet, a real treat.  We would definitely come back.","useful":1,"funny":0,"cool":0},
{"review_id":"tKouYsOOiTxuGYSUwSQiYw","user_id":"IkD4s3sw8eU_DC1rTFidiA","business_id":"HTaA1mo9cB1dXMwfJC6yKg","stars":1,"date":"2014-07-27","text":"I have lunch at this location once a week. Although today I had the worst service i could imagine. Our server was LEESON, & he\/she was the most awful server ever. After bringing us drinks he made us wait 25 minutes before taking our order (we had to call him over.) once my friend called him over he said \"girl don't get attitude with me.\"  Once ordering, my friend asked the difference between seasoning and sauce for her wings and he began to yell at her like she was stupid. Still, she still didn't get it, so he began to act like a smart ass and rolled his eyes. At that moment, the tip didn't even exist anymore. After our meal I tipped him but she didn't (her meal was 12$.) He\/she later decided to come over to her face  saying \"Thank you for tipping me, I really appreciate it\" with a huge smile while walking away. After calling over the manager, he looked like he truly didn't give a shit about his disloyal employee. So sad to see this happen. Please beg to not have LEESON as your server.","useful":0,"funny":0,"cool":0},
{"review_id":"i8gCYZYC1We5zpA5kH0E3g","user_id":"IkD4s3sw8eU_DC1rTFidiA","business_id":"OgJ0KxwJcJ9R5bUK0ixCbg","stars":5,"date":"2014-10-14","text":"Drove 30 minutes to Lux tonight, and I will do it again. The vibe is so relaxing, it's a real coffee house. Although it was packed for a Monday night, the customers were all there for coffee, chatting, and homework. It's not pricey at all. I had 2 drinks for a total of $9.00. I recommend Lux","useful":0,"funny":0,"cool":0},
{"review_id":"8AcGIK6AYNg_7-mIWPkTYA","user_id":"l7_2UjbiVsxqGPHEYGF6wQ","business_id":"e98cGitxz3zABXZBh5K7Ew","stars":5,"date":"2014-06-05","text":"He helped un-clog our pipes and had great service! I would highly recommend this company to anyone! I can't wait for them to move a little bit more west so I can setup a regular cleaning schedule with them! Thx Roger!","useful":0,"funny":0,"cool":0},
{"review_id":"tLdBsLSyK1Xh5QSUf6LiwQ","user_id":"25WcF33aZjwWsQc5QAONug","business_id":"ko2Dc_aY-rSoVon5X3YLEA","stars":5,"date":"2016-08-05","text":"First time at Sol. Very clean facility and the staff extremely friendly. Was cautious going to a sports massage place considering I wanted a relaxing massage but Ms. Carolina was very accommodating. I will be back again!","useful":1,"funny":1,"cool":1},
{"review_id":"BtyQvmKii1SPgNkNPlV04Q","user_id":"25WcF33aZjwWsQc5QAONug","business_id":"b_8jCti0vuouJ_fjZpdmZw","stars":5,"date":"2016-03-18","text":"This place rocks!  My clients and I were looking for a place to eat dinner this week and Soul Cafe came up.  They have eaten there many times and were complimenting the uniqueness of some of their dishes.  We all decided this had to be the choice if I have never been.\nWhat a neat colorful place tucked up in North Scottsdale.  Lots of color and beautiful artwork.  Food with a Mexican flair!  I had one of the best Bloody Mary's in my life!  Served with jalapeno vodka and hot bacon, unbelievable!  And for dinner a Mexaloaf (meatloaf) with a kick.  More bacon, corn chips and salsa mixed in topped with chipotle sauce on a bed of mashed potatoes.  This is now one of my monthly returns when i come to town.","useful":2,"funny":1,"cool":2},
{"review_id":"HV11dM4ImC-CZj1FhpeSgA","user_id":"cVfHPzKEbn6Fg9UuKvmGBw","business_id":"tvwDuDypJDl16icfZDpULg","stars":5,"date":"2015-05-25","text":"My Mom and I went to Dutch Bros almost daily when I lived in Tualatin, Oregon, right outside of Portland. It was my me and my Mom's favorite afternoon break, and It was ALWAYS a treat. The customer service was outstanding and the drinks the best ever. When I moved to Scottsdale, I was so sad leaving my family, and Dutch Bros. I tried other places here, but no other coffee places could match Dutch Bros, their drinks and the consistent warm welcome we always received. I got the Verissimo, then the Keurig, but I couldn't make my coffees the same. Maybe it was the employees wonderful attitudes that helped it be so good...so uplifting. .and such a daily treat and pick me up. One day we were riding and I spotted a Ditch Bros. I hollered \"DUTCH BROS\". I almost went balistic in the car hollering to \"turn around, turn around theirs a DUTCH BROS...THEY HAVE THEM HERE\"!!! I miss Oregon, the rainy days and my family, but having Dutch Bros here gave me a little bit of home and I mean that seriously. Not only that, but now they built a new one, right down the street from me...not even a mile.  It makes a nice walk. Now I'm trying to get back in shape, so I will start walking to Dutch Bros and defeating my progress on my walk home with a large Dutch Freeze Pocahontas with an extra shot, thick Carmel sauce blended in, and whip cream. What a treat. . What a lift... What a wonderful memory I will always have that I did with my Mom on those cold rainy days. Thanks Dutch Bros...\nP.S. Check out their moto\/creed and wisdom in life sometime on one of their cups. It's one of the best I've seen for incorporating positivity, happiness, and respect of others throughout life. It reminds me of a poster I still love and have called 'The Desiderata'.","useful":0,"funny":0,"cool":0},
{"review_id":"6XJLxMoOIt_1DoXmYUVtjA","user_id":"Eb1SC0uXcyqKRguNVFnMvw","business_id":"hl3SvWdVqOI8mSbeXHGGZQ","stars":5,"date":"2017-08-25","text":"Crystal and Cardell were unbelieveably helpful and went out of their way to assist us with a last minute project\/deadline. Their other two team members who were there on 19th of August  ALSO went the extra mile. Everyone at the convention was ranting and raving about these 4 indviduals at the Fedex in Cosmoplitan Hotel. You guys deserve recognition from your company. THANK YOU all once again. You guys Rock!","useful":0,"funny":0,"cool":0},
{"review_id":"_fC7hHbsvIpeuLEMUk2mjg","user_id":"v4W1zLelbCeHXUrgw8eYIA","business_id":"-wCtRhzWJ40Z4F8mmg7kWg","stars":5,"date":"2017-11-10","text":"The atmosphere, wait staff and the food all fabulous. Let's not forget the DJ great music. \nFirst time in Vegas and was not loving it but Herringbone had class, trend and style. I would definitely recommend it","useful":1,"funny":0,"cool":0},
{"review_id":"JvJaSnLz-KF28hA0yJ6TGw","user_id":"iRLsvKQZSVsHh2acv3cyuw","business_id":"iTwYEwBqer2O4OkI_7Ef9A","stars":5,"date":"2016-09-27","text":"The best restaurant in Boulder City for a quick meal and friendly service. Best French frys in town.","useful":0,"funny":0,"cool":0},
{"review_id":"dlUAGhve0LUF8t-8aF1jrg","user_id":"ULGNjb6-YBQ-GcYqYMw6DQ","business_id":"17YtgBVmE_-XwCtLz6anFA","stars":3,"date":"2016-02-26","text":"The good news is that we got the entry door we ordered and we're happy with it. After waiting three weeks for the door, the one that arrived was the wrong size, but the installer tore our existing door out before measuring. They patched it up for temporary security and got us another door in two days, so that was fine. The salesman said he would get us gift cards for the inconvenience, but those didn't arrive.","useful":0,"funny":0,"cool":0},
{"review_id":"1saIV1OKwvZRXFPebEiiNg","user_id":"ULGNjb6-YBQ-GcYqYMw6DQ","business_id":"nwP8kik0wnIMWvFhBe_rng","stars":5,"date":"2017-04-13","text":"Kent and his crew did an excellent job installing our new tile flooring and baseboards. I was expecting the work to take a full week, but it was completed in half the time and on budget. I would highly recommend Details Remodeling.","useful":0,"funny":0,"cool":1},
{"review_id":"Rysz0ywxIMrI1Jt7uJzM1A","user_id":"ULGNjb6-YBQ-GcYqYMw6DQ","business_id":"c_a2KzQOrR-0SJfoPPGHXA","stars":5,"date":"2017-04-13","text":"Active Movers did a great job moving our furniture so that we could have new flooring installed. They're returning tomorrow to move everything back. I would highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"g2PJgcFSpYpFYfhR13QXKA","user_id":"NiqL6t09VcOcbsMYhQW8YA","business_id":"xkQbR-kCCy-5Z1w1IrhvWg","stars":5,"date":"2016-06-22","text":"My business partner and I bought two Denali's from Sebouh and Daniel and they were bought experienced and professional to deal with. We will be back for future vehicle purchases.\nBen L","useful":0,"funny":0,"cool":0},
{"review_id":"KIRFgWeS5rU4IU6-ICfjaA","user_id":"XNAnhAEaG88QUAxanpmrIg","business_id":"Qa3CAciWwIUXM-KzwTv4Wg","stars":5,"date":"2015-10-20","text":"5 stars for sure! Charlie came same day. I had bought my house, painted, and was ready to move in over the weekend. Charlie did a great job on the carpets and was a solid pro. I recommend Greenway without any reservations.","useful":1,"funny":0,"cool":0},
{"review_id":"0PKCxEbVdLXLh8U_M36Umg","user_id":"mfw_hVHaMDHViogw135Swg","business_id":"AktuBx1W7c3ZdzwuaOp8xg","stars":5,"date":"2016-11-20","text":"Definitely my go to Asian cuisine spot for quick and easy and delicious dining! And they have an amazing lunch special menu!","useful":0,"funny":0,"cool":0},
{"review_id":"h5N_Kw2nECMhFfx9uF6dTQ","user_id":"mfw_hVHaMDHViogw135Swg","business_id":"wdYzA18nnhA_q_gGEZyMgQ","stars":5,"date":"2017-04-20","text":"Pup is fresh! Excellent service from Lamar! Just gained repeat customers! \n\nLamar even gave me some tips towards getting my pup more comfortable with the grooming process. Thank you for the clean cut, and help! 5 stars for Lamar and his service for sure! See him for all your grooming needs!","useful":0,"funny":0,"cool":0},
{"review_id":"g6a1ieIvqageOf_rOdFKyw","user_id":"mfw_hVHaMDHViogw135Swg","business_id":"xwIJGDiwUz5aorokYKfxIQ","stars":5,"date":"2016-11-20","text":"Love poke express! Lived down the street from the location on Craig and revere since they opened. And now that I live on the southeast right next to their new location off Stephanie and 215... Finally got my poke fix! From my favorite peoples at that!","useful":0,"funny":0,"cool":0},
{"review_id":"0bMc-mLFsaLbDmg3dt8zTQ","user_id":"mfw_hVHaMDHViogw135Swg","business_id":"KW5edXlPGeZ0cx7MiJyamw","stars":5,"date":"2016-11-20","text":"Great place for some great coffee! Kona!!!! Was excited to finally try this place out! And they're right around the corner from me! Definitely my new fav afternoon cup of coffee spot!","useful":0,"funny":0,"cool":0},
{"review_id":"vZF88kkvn2nVzkekP7wL5A","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"Ape3SLOZJ9z_mysKVPh25w","stars":1,"date":"2017-11-08","text":"word to the wise,  do not remove tags, after spending a few hundred dollars they refuse to return one item because the tags were removed.  It was clearly new and unused, it was just a simple rude no store policy.","useful":0,"funny":0,"cool":0},
{"review_id":"cM7TxyWXLKKRhHcsxGOrbw","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"36iwylAHEgg8YfL139TJhA","stars":5,"date":"2017-11-08","text":"I'm not someone who typically feels moved to write reviews. I feel moved to write a review for CKBR, especially because I see some negative reviews. I have so much respect for this company. They completed a kitchen and bathroom remodel for us. My husband worked as a project manager for much of his career in residential remodel. With this being said, we had high expectations but also realistic expectations. I think it is very important to have realistic expectations when endeavoring on a home remodel project and I think some of the bad reviews on here stem from people who had\/have unrealistic expectations. When you are doing a remodel, your home turns into a construction zone. A delay is enough to make you want to pull your hair out and scream at somebody. You want nothing more than to have your home back in a timely manner. We are all human and probably would all feel similarly in this situation. But the reality is, in the construction industry - delays happen, ALL THE TIME. My husband says, \"it's not IF there will be a delay, it's what the delay will be\". If you are not prepared to deal with a delay or a hiccup along the way, then you should probably not get your home remodeled. I do not say that to be snarky, I say that to save you your sanity.\n\nFor our project, we had two delays. We had a delay regarding countertops and then another delay that was actually caused by us. We changed our mind on the deco tile we selected. CKBR began the installation of our deco tile in our bathroom and I did not like how it looked. I chose the tile myself and it wasn't until I saw it go up in the bathroom that I decided it wasn't what I wanted. Don and Ray were beyond accommodating and arranged to have the interior designer make a home visit with samples to reselect my deco tile. They didn't charge me for this (even though I gladly would have paid). The designer came out and I selected a new tile that I LOVED. We completed a change order for the cost of the new tile and I paid it on the spot. They did not charge me for the extra labor to tear out what they had done which was nice. I then got a phone call a few days later from the designer who let me know they had a bunch of the deco tile I selected in stock from something they mis-ordered months ago. She informed me that since they already had the tile in stock and paid for - it wouldn't be as expensive as expensive as the change order I paid for. They ended up putting a credit on my account for the difference. That blew me away because I would have never know this if they were not forthcoming and they could have EASILY kept the additional money. I gained a lot of trust for them from that. Fast forward to the completion of the project, my kitchen and bathroom were completed and looked amazing. About a week after the job was done, I noticed there was some sealing that was missed on an area on the kitchen countertop. I called the office to let them know and within 3 days they had a guy out there to fix it. Everyone I dealt with was extremely pleasant and they just left a great taste in my mouth. Since then, I have recommended them to several people, one of whom (my neighbor) has actually hired them to do her kitchen. The project is currently in process and she is pleased with them as well. \n\nI wanted to show you guys some love and give you a good review because you deserve it. I will continue recommending you to all my friends and family.","useful":3,"funny":5,"cool":0},
{"review_id":"8NsE7Vyb8yzG6rCdEyxdaQ","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"27OH0hv4jhwKDk-hKgqw_A","stars":5,"date":"2017-03-31","text":"Always courteous and clean! great tostinachos and raspados with ice cream","useful":0,"funny":0,"cool":0},
{"review_id":"StybagZwpCh-8DeDZOEUlQ","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"fHm_Zxjdyl6D1CdsYPIR1A","stars":1,"date":"2017-01-22","text":"I wanted to try this place out because it was open on weekends with great availability.  I called to make an appointment; I was quoted $40 oh wait  $45 \"minimum wage increase \" ok still I understand . This place smells horrible. I understand it's a dog grooming but I've never visited a dog groomer that smelled so bad. Upon picking my dog up I was told it was 50 because it was a scissor cut (not my dogs first grooming). The haircut is ugly and uneven , and his man parts are swollen, cut and he has a rash.","useful":1,"funny":0,"cool":0},
{"review_id":"_be7hU5Yhm5c4TIcmB5-0Q","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"quNsF2gdqKulu5D6pvZI0w","stars":5,"date":"2017-03-31","text":"great service, ladies were very friendly. Trending with the preteens.","useful":1,"funny":0,"cool":1},
{"review_id":"z63Tn9PzoVbymtACYNA_RA","user_id":"x2GZzvYEae7uqOx_XpwOMw","business_id":"6OjvwgCocqmghcnau69upA","stars":5,"date":"2017-11-08","text":"my family and i love the food, the staff is always courteous, accommodating and just awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"ur4smnq2TnkaYkdrrJV3rA","user_id":"4AU7c30UrkaAOmCM8WTBtA","business_id":"wKwUYKjU3odzssIf8UfAaw","stars":5,"date":"2013-07-29","text":"I used Bust a Move Moving for my last Montreal move. I would absolutely use them again and recommend them to anyone looking for courteous professionals. \n\nThey got there on time. They took great care in loading and unloading everything. And they finished the job quickly. It doesn't get much better than that.","useful":1,"funny":0,"cool":0},
{"review_id":"1o7KJpa0sBiyWK5hnadw2Q","user_id":"rbYAa1xFoxVWlgvw6lLdxg","business_id":"UlYw27BpVYzlvTvufbnqmA","stars":5,"date":"2014-05-30","text":"If you are looking for a '5 star' trainer, look no further; Petro is your guy.  I am currently working out with Petro in his boot camp class.  It was amazing to me, that Petro took 'simple' movements and made them ASS-KICKING challenging exercises.  There is an element of fun, which is always a plus.  I have been impressed with other clients of Petro in regards to their drive, focus, and being proud of themselves; all of this is a reflection of my trainer, Petro; period.  I plan to continue to work out with Petro until I reach my personal goal.","useful":0,"funny":0,"cool":0},
{"review_id":"syR7bDO3Lv8AprYE5Kj21A","user_id":"Hcg2-AtcCi6yrcJ3FoVOzg","business_id":"YmFkrylzWy4vmNFkWk-I0g","stars":5,"date":"2016-11-25","text":"Amazing stuff. Really great burger and classic Mediterranean food. Can't wait to come back!","useful":0,"funny":0,"cool":0},
{"review_id":"TVsahoxFzGD7CDdZSFWjsg","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"_BinpQSjqtEgycxQxKHIGg","stars":3,"date":"2013-06-03","text":"I worked at a self service \/ automatic car wash for years till I moved out the AZ So I normally wash the truck myself (yes it takes more time but there is never a spot that gets missed)\n\nThat's said ... This place is fast and an ok wash. First time I went I got the Ultimate Plus wash and the guys doing the trim missed some big spots (probably because the plastic has to be dry before you apply anything, and that takes time) So my bumper looked half shiny and half dull. When I brought the truck back in, I told the guy what happened and he did my trim for free and it was a better job this time.\n\nOther than that if you want a fast wash it's not a bad place,","useful":0,"funny":0,"cool":0},
{"review_id":"mLvWjDW3t32ASRDOkmtQHQ","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"_cA8tCqZgTDQe9EPNmzp4w","stars":5,"date":"2013-06-04","text":"I was referred to KORE by some friends  and I was really impressed with how these guys were. I bought a new crank , forks and a new cruiser for my wife and I felt that I got the best price and assistance compared to other bike shops (here or in other states)","useful":0,"funny":0,"cool":0},
{"review_id":"MA_yyYeN1P8b2OqJOQFuEA","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"P1l18B3iHQkM2deVti216Q","stars":4,"date":"2016-09-24","text":"I worked at a car wash like this for years until I moved here to AZ. For the part of Chandler it's in the owners keep it pretty clean. Everything in the bays work. Wand and brushes are always in good condition. Between the other 2 self service car washes that are close to me I'll go to this one every time","useful":0,"funny":0,"cool":0},
{"review_id":"UhaMM0jfm7OwfZA5_4SJGQ","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"0xyqLvtr0Zbr4G-gML-QmQ","stars":3,"date":"2015-06-05","text":"The first time I went to Flemmings was a few months ago in Glendale. We went with some friends for 5 6 before 7. My wife and I thought I was pretty good. We had bought some gift cards at Costco and got some more gift cards as a gift and had intended to visit the Flemmings in chandler\nMy wife snd I went here this week to celebrate our 3 year anniversary.  The only reason I'm giving this place 3 stars is because of the atmosphere.  It was very loud. So loud the waiter had to talk even louder and I could still barely hear him. 2 things I noticed that caused this situation was 1 the music in the restaurant was loud and more pop style (It could have been any style of music) and 2 the seating.  Not that full of a night but everyone was seated close together and that makes it so everyone had to talk louder. \nOur waiter was just fine and the food was really good. Still though for the price of it I don't want to feel like I'm at a normal family restaurant where I expect it to be loud.\nMy wife and I decided that we would do the specials before dinner time but not eat dinner here again","useful":3,"funny":0,"cool":0},
{"review_id":"g9__SjrCEdV_ICwqsl89kg","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"6Q9iSOyR8JUFp9HW07o7GA","stars":5,"date":"2016-11-09","text":"I recently had Steve's work on my 02 ATV after taking it to apache motorcycles in mesa. Steve's seemed more willing to work on my carbs. I was happy with the end result.  They had my quad running perfect and out of the shop in under a week (had to order a part) they even called to ask me what I wanted to do with what they found and invited me to come in to see for myself.  I would suggest Steve's to anyone","useful":1,"funny":0,"cool":0},
{"review_id":"hImu4DljDa9W3h4_fAaL4A","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"G08JhVHKBexdzkezTM1rUQ","stars":5,"date":"2014-08-01","text":"My friends from California always go to bevmo and then a buddy from here in Phoenix told me to go there and get some specialty drinks. I was pretty amazed at the selection.  Including the soda selection. I also buy all my beer mugs there. They have a good amount of drinking glasses to choose from as well","useful":0,"funny":0,"cool":0},
{"review_id":"_SDG8SPhLex9qCsmhGK9IA","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"_tFxVaakWa4c2pViRBjqeA","stars":5,"date":"2015-11-20","text":"I've been going to this place since 2009. Never had a problem  with staff bugging  me or not knowing  what they're talking about. I've even  had them work on an old quad I had. They told me when would be best to bring it in to get it out next day. They have plenty of parts on the shelf like oil \/filters\/ handle  bars. I'll  continue  to buy from these guys when I'm on their side of town. Otherwise  I will go to the Apache cycle  close to work in Phoenix","useful":0,"funny":0,"cool":0},
{"review_id":"dDnHpAGE7lEPXiE6JuYkXw","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"BDP_o_-lqXfBpKVBvImFjQ","stars":5,"date":"2014-08-04","text":"I like this car wash.  It reminds me of the one back home I used to go to. The owner is a really nice guy. The car wash is clean and everything thing in the bays works. It's nice that they have self service carpet shampooing.  I also had my truck window tint done here. I was happy with the price and quality of work. I will take my new car here to have the tint done.\n  If you want him to detail your car, I've watched him work and he was pretty meticulous.  I've seen a few guys bring in their classic cars to be detailed","useful":2,"funny":0,"cool":0},
{"review_id":"DfsnqZjM6SIT8m3kzwjoAg","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"CqCLZEeMWBAsOzAQQLm71Q","stars":5,"date":"2016-03-18","text":"Upon finding termites on \/ in the side of my house I asked around as to what companies some of my friends have used for termites. I called around and found these guys to have the best price and still use the same products that the more expensive companies use. (Although these was another company that charged more but also did  the most thorough  inspection and we would have no problem suggesting to friends ) the guys that came were very professional, honest. I would suggest them to anyone","useful":2,"funny":0,"cool":0},
{"review_id":"8uNZ6RybuLEsNhOPApsueA","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"4a0DEFs30nEIEtF5bHVn7w","stars":5,"date":"2014-10-07","text":"I was referred here by my dentist to have a wisdom tooth pulled. This team doesn't waste time.  The girls at the front desk helped me out and got me an appointment to pull my tooth the day after my first exam because it hurt so bad I couldn't sleep. Dr. Shah had me in and out in a matter of minutes. AMAZING!","useful":1,"funny":0,"cool":0},
{"review_id":"5mC7t8HizhNDORX5MafoNA","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"7QAwB7CV5BmSpU3uCWlfeA","stars":5,"date":"2015-11-20","text":"My work isn't  too far from this apache cycle center. I like them more than Ridenow. The staff seems more knowledgeable and quick to help me out. They had the part I needed for my yamaha  raptor in stock. They also had quite a few items on out on the floor like oil, uni filters and other stuff. I've never had a problem  buying or getting  help from this one or the apache  cycle in Mesa. I'll  continue  to buy from them","useful":0,"funny":0,"cool":0},
{"review_id":"mSVkhOgcD8oTJqyccmqfdA","user_id":"AyDttfc_nA5rAJY-63hH1Q","business_id":"fSmIQUcriQNu6hKkEoGgOQ","stars":1,"date":"2014-10-05","text":"So tonight was the first time trying to eat here. Trying being the key word. Got in line. Ordered 1 beef taco and one beef enchilada and sat down with our party. The guys in our party that came after us and ordered some time after us got their food before me. I saw at least 15 people get their food before my friend and myself (we ordered at the same time 2 different orders). So I went up and asked for a refund.  They looked at my recipe and said oh yours is coming up soon. So I said soon was 20 people ago. I want a refund.  well my friend was still waiting on his food, his order was before mine.... He waited another 3-4 minutes before his food came.","useful":1,"funny":3,"cool":1},
{"review_id":"MB-Zi2uuwA2x2eiZ1oKBKQ","user_id":"nz_Bt0D_NF40sIYK3LLLow","business_id":"vl1aHp6pvnSmpoRQShWLjg","stars":5,"date":"2015-01-06","text":"One my favorite dining places in the red rock Hotel in my personal opinion better today no doubt this is the best restaurant get burgers I ordered the mushroom burger and it was the best decision I've ever made in my restaurant eating life is so goodthat after I was done my mouth is still watering I definitely recommend that you should come here and order the mushroom burger you won't be disappointed but it did take a while for the water to come so if you're thirsty bring yourself a water and welcome to the new age to the new age I'm radioactive radioactive","useful":0,"funny":0,"cool":1},
{"review_id":"9R3QN1NGFgnGSsxRPdygEQ","user_id":"iKJn3PDGt4gTjs2NewDpyg","business_id":"9fBwxdHyJRS1nLkMJ8cavw","stars":5,"date":"2015-03-31","text":"I stopped in to see about brakes on my 3+ yr old hybrid Lexus.  Instead of selling me something I didn't need...the service rep quickly ran out and assessed the car and said I was good for another 15,000 miles!  I appreciated the honesty and will even drive across town to come back when I do need them.  Thanks so much!  :)","useful":1,"funny":1,"cool":0},
{"review_id":"w95jlKIuR_48NG7vTXpjAw","user_id":"-w33mxOMcpT_eZB81RdpaQ","business_id":"lQ9VmIWvM6v-rONPkYX8aQ","stars":5,"date":"2009-02-12","text":"As the owner of an upscale restaurant I told myself I would not write reviews for other restaurants.  That being said I feel my expereince at Alex was the finest dining experience of my life.  \n\nEvery aspect of the restaurant from the service, food. and decor was nothing less then impressive.  The GM went out of his way to give us a personal tour and the Chef sent us all sorts delights above beyond what we had ordered.\n\nI also enjoyed dining in a restaurant where I did not feel out of place by wearing a suit.  As my grandma would say \"it aint cheap\" but definalty a restaurant that everyone should experience.","useful":0,"funny":0,"cool":0},
{"review_id":"YgEPQix6mS2nlaxdm1AcTA","user_id":"s_-Ig-T7Boy1Uq09kV04RQ","business_id":"aKcqbWSFjoz8BoBEs4UemQ","stars":5,"date":"2011-04-08","text":"Great perch dinners Wed and Fridays","useful":0,"funny":0,"cool":0},
{"review_id":"-CZ_8xKlFex1u6N_9tA1NQ","user_id":"s_-Ig-T7Boy1Uq09kV04RQ","business_id":"YktNvzWjfkGB_PujtdYPaA","stars":4,"date":"2015-01-09","text":"Arrived to a cold Ray's. Apparently a heater was broken. Stayed anyway as was meeting 3 friends to spend gift cards we received from Jimmy DeLagottie (Thanks Jimmie). \n\nThe place was half full of  Millenniums having a good time. We had a table for four and were waited on in a timely manner. The waiters were very good and kept asking  if we needed anything. They were well tipped for their efforts. \n\nWe all had burgers and they were very good with any type of condiment imaginable. The burgers downfall was the bun. It was not toasted and was the type closely related to Wonder bread. \n\nWe had very good fries that were nice and hot and well priced for a big basket of them. \n\nAll in all a decent meal, well priced. \n\nOh, and the draft beer selection was gigantic. I had a nice fresh Guinness and others guys had local craft beers. \n\nWe had gift cards that could only be used in the Fairlawn Ray's and not the Kent Ray's. What's with that?","useful":3,"funny":0,"cool":0},
{"review_id":"SQ5kM9oQ4PUCgjS4XAKkFg","user_id":"s_-Ig-T7Boy1Uq09kV04RQ","business_id":"JU7xlxQ4PMl5gAUkPk4uDw","stars":2,"date":"2013-03-27","text":"Wow, what a disappointment. It was over 10 minutes after being seated before a waiter asked what we wanted. \nWe were there at lunch time but there was no lunch menu. We had to pay dinner prices at a Bistro! \nThe fish & chips cost $15.95 and when they came there wasn't even a side of cole slaw. The tartar sauce was thousand island dressing, what's with that? The waiter said that's the only kind they had. \nThe fish had a very strong flavor and the batter was an 3\/4 of an inch thick all around. \nWe won't be back.","useful":1,"funny":0,"cool":0},
{"review_id":"43vkfRC60eBhDFDMvmYXpg","user_id":"s_-Ig-T7Boy1Uq09kV04RQ","business_id":"0W4lkclzZThpx3V65bVgig","stars":3,"date":"2011-09-21","text":"Yes, this place is just OK. Unique ambiance depends on if you like to share a table with strangers. I can't believe they had no horseradish for their sandwiches. Quality is what you would expect of a deli that was not in New York city.","useful":0,"funny":0,"cool":0},
{"review_id":"GXEx83vtMu5xhf_dXQMsNQ","user_id":"xYp-9qIv5mazvLhNu7L_IA","business_id":"3-aEgS7X2jrbxA7sA1nARw","stars":5,"date":"2014-05-19","text":"La flor de Calabaza es un lugar como ningun otro en Phoenix. Musica en vivo, bebidas y deliciosos aperitivos. Excelente servicio, la chica que nos atendio nos ofrecio muy buenas sugerencias en cuanto a bebidas y los aperitivos. la musica es Rock en espanol. Es un lugar donde te puedes divertir y estar en un ambiente tan padre entre amigos. Definitivamente regreseramos.","useful":0,"funny":0,"cool":0},
{"review_id":"9H6z2aedsCbEwNlcx2LAXQ","user_id":"xYp-9qIv5mazvLhNu7L_IA","business_id":"JKsYM4eFoRtftDHbEf2j9g","stars":5,"date":"2014-05-20","text":"the crepes were really good, i loved the whole wheat crepe. Great place","useful":1,"funny":0,"cool":1},
{"review_id":"iXbdIIvflA12DiOed1K1cw","user_id":"LAX0IUpOKLHxUEo0mZW2_w","business_id":"3dG81ZT3TjPdRARfClWMkw","stars":1,"date":"2013-10-15","text":"Bathrooms were very dirty and toilets were all clogged.\nBuffets items had lots of deep fried very oily choices.\nButter chicken was pretty tasty until I noticed a COCKROACH on my plate. I nearly \"Ralphed\" right there in the restaurant.  I asked the waiter for the Bill not sure how to even describe the event without wanting to hack. The waiter was confused to why we wanted to leave so quickly with our plates full of food. My husband politely said we kinda lost our appetite because we found a bug in our food. The waiter apologized and took our plates and went to the kitchen. He can back saying that 2 days ago the fumigated for roaches and that possibly one could have fallen in that was dead already. He also said that he wasn't going to charge us. He apologized again and we left. All the servers were super friendly, kind and understanding. I even feel bad about writing this review. Although I thought I still should... I think they need to close down and ensure the kitchen is up to code before re-opening.","useful":6,"funny":0,"cool":0},
{"review_id":"orP-EEhQojXcJHCC9b4TpQ","user_id":"ayZWr5fCt6rbzICSuYz0vg","business_id":"ZjYOIMcLTWFPa4jGC-YFwQ","stars":5,"date":"2014-08-17","text":"Loved this place! First visit to Toronto and after walking around all day, decided to eat here on a whim. We sat on the patio which was very nice, good people watching view, and not too loud. I had the coronation chicken curry wrap which was AMAZING! Very unique twist on a wrap and I loved it. Hubby had some kind of brisket sandwich with au ju sauce which he also really liked. We had great service, a very friendly and attentive waitress who did a great job. Really liked this place and would recommend it and return!","useful":0,"funny":0,"cool":0},
{"review_id":"S43iD3swM0XX-nKei9Bi3w","user_id":"ayZWr5fCt6rbzICSuYz0vg","business_id":"mG71gQ5HWl7ut9OCN6NJKA","stars":3,"date":"2014-08-17","text":"After all the hype - just ok. View was FANTASTIC and the revolving part was really great. We dined about an hour before sunset so we saw the city in the day, dusk, and after dark, all lit up. Service wasn't very good - I think it was kind of busy, but that's not really an excuse. It seemed like they wanted it to be a very fancy dining experience (prices, decor) but it came off as pretty touristy. There were lots of families there with loud children and people wearing jeans. For ~$100\/person I would have expected better service, food, and atmosphere. The food was alright - ate from the pre fixe menu and it was normal 'fancy food' salmon, small salads, chocolate cakes, etc. The worst part was that near our side of the restaurant, we happened to have a great view as the sun was disappearing, so lots of other people crowded around our table to take pictures of the sunset against the glass - rude. Good for the view, but maybe just go up there to have drinks? Much better view that the observation deck (which we stopped at on the way down) TERRIBLE view..it was all fenced in for safety I assume, but it made for an awful view.","useful":0,"funny":0,"cool":0},
{"review_id":"j8GYCjIl9jiI6vtahESQLQ","user_id":"ayZWr5fCt6rbzICSuYz0vg","business_id":"Kal1hFMTEzdXYpa5MNzUPw","stars":4,"date":"2014-08-17","text":"Really enjoyed this place! I love ping pong so it was fun to go and play with my husband. Seemed a little bit expensive ($35\/hour) but you can play for a half hour, which is only $17 (not bad). Kind of a clubby atmosphere - loud music (DJ) and low lighting, but it definitely gave off the aura of being trendy and for a younger crowd. We only had drinks there (kind of expensive, but it's Toronto), but our bartender, server, and all the employees there were very friendly. They also had a promo going on - a game of 'around the world' ping pong that anyone could play for free - so that was nice to get a little more bang for your buck while there. I would recommend it for groups of friends (this would drive the price down) and would be more fun for doubles, or rotating around players. Would LOVE to go back if I lived closer :)","useful":0,"funny":0,"cool":0},
{"review_id":"G5si735PMbQcLE760HRu-g","user_id":"ayZWr5fCt6rbzICSuYz0vg","business_id":"YbpP_ZlcZs1RKY6O--_Ecg","stars":5,"date":"2016-03-07","text":"Awesome office! Had several great experiences here - very friendly, thorough, explain everything - great customer service. I'm always a happy customer!","useful":0,"funny":0,"cool":0},
{"review_id":"qoO1FzBK_y7gy24Xhz20Nw","user_id":"ayZWr5fCt6rbzICSuYz0vg","business_id":"73_UT7fZ7mzXcguX8-oSuQ","stars":3,"date":"2014-08-17","text":"The best part of this place is the view. We sat close to the open doors and could watch people walk by and a great view of the water all afternoon. The service was good, but the food was pretty pricey. We both had salads (no meat) and they were around $15 and pretty small. Unique options, with sandwiches, salads, pizzas, etc. Hubby thought the beer was alright, but go on a nice sunny day for the view.","useful":0,"funny":0,"cool":0},
{"review_id":"HEkf96DGv2Bv_CRihV0Hzw","user_id":"2cSiicwntJaVJ1J_qV7PXg","business_id":"UtWngqS-WloIY_A53W5K-Q","stars":1,"date":"2014-08-09","text":"I had gone to a Dignity Health Urgent Care that had sent me to the emergency room right away. I arrived at the ER about 7pm and wasn't discharged until 4am. I was in the waiting room until 2am, then the doctor came in to tell me that I needed to change my birth control and to go home. I was and still am in intense pain and bleeding abnormally. Then the hospital called to follow up the day after and after I told them that I was still having the symptoms, they said \"oh, well go see your doctor. have a great day!\" and clicked. \nI'm new to the east valley, and if this is their healthcare, I'd rather risk driving back to the west valley for my emergencies.","useful":4,"funny":0,"cool":0},
{"review_id":"G_zG4G6mOGr9ar-l41wfhw","user_id":"IipCuqPk_dynew7yAVc_oQ","business_id":"QiuTcA0bKQMCyOFBFJZ58w","stars":1,"date":"2010-12-07","text":"I dont mind other locations, but this location on this particular night sucked huevos.\nI dont find the need to ever go back. \nTOTAL LATE NIGHT BUZZKILL.","useful":1,"funny":1,"cool":0},
{"review_id":"Q119lblElrcI5a1rZOpXaQ","user_id":"IipCuqPk_dynew7yAVc_oQ","business_id":"BYQ6Wfh4hhKKLI71qhDWIw","stars":4,"date":"2010-12-07","text":"My new Vegas destination, when Im in town. Wish I could have found the time to go back for more food...but thats no excuse cause the kitchen is open 24 hrs.\nClassic British food served by Brits... And so far the widest draft beer selection i have found on the strip.\nI'll be back again, and again, and again!","useful":1,"funny":0,"cool":0},
{"review_id":"AeUiftUk8iarTWtuzIkhxg","user_id":"IipCuqPk_dynew7yAVc_oQ","business_id":"jWHr_b19C1SjRvfI9jbdmQ","stars":3,"date":"2010-12-06","text":"Al Pastor carved off the spit. Got it a little too early and it wasnt very crispy yet but I will be back to try that again when Im in town.\nChorizo and egg burrito was good.\nCarne Asada tacos really good...They serve whole beans on top, which reminds me of the way my friend's dad used to make them in the middle of the desert, cooking over a campfire.","useful":0,"funny":0,"cool":0},
{"review_id":"p0LbfwU_jkfZb8kGX4G8wA","user_id":"IipCuqPk_dynew7yAVc_oQ","business_id":"LEASX4wn1U1TAmwQfsDtIw","stars":2,"date":"2010-12-07","text":"No more 99 cent beer, no more diarrhea inducing 99 cent shrimp cocktail, no more 1\/4 lb hot dogs...dangit...whats a cheapskate to do?\nWell at least the Snack Nook has footlongs for $1.99","useful":1,"funny":2,"cool":0},
{"review_id":"LPAMYL0eab5ZnW8Xmwz6fQ","user_id":"IwitfgFeRrIB0omBaNNjIQ","business_id":"eeTQZt5aLtPjBrnPvR1tiQ","stars":5,"date":"2013-11-11","text":"Very delicious Po Boys and free clam strips when you sink a putt? Count me in. Mr. D'z fish house is great seafood at a great price.","useful":1,"funny":1,"cool":1},
{"review_id":"2jf6muHlu5XpVuy7x8lLQQ","user_id":"0BwXT1VPSrTIj9HlEN2tow","business_id":"HIw8YU0KwB1GdGJTrkbSKQ","stars":5,"date":"2016-03-09","text":"Wow!!!! I read all of the reviews and have never written a review on anything ever I felt I had to... I have been with Debbie for 6 plus years and she has been very good to me, first property was two years the owners short sold it, I was notified, Debbie herself showed me some other homes and we moved I'm a single mom and have my son and my elderly mom.  We moved she transferred all deposits couldn't have been easier.  When we moved in the air didn't work I called Debbie she got back to me right away while she was on vacation mind you had someone over here that day!! It was fixed whenever I've had an issue it has been fixed right away, Josh has actually been very patient with me and helped me fix things over the phone so I didn't need anyone to come over. I have been in the house I'm in now for four years, the only reason I'm looking to move is because it has been robbed twice. I notified Debbie she asked if I wanted to move and was willing to let me out of lease and tried to find another house however the rents have gone up.  I then asked if they could put a security door on she thought that was a great idea had someone over right away to install a security door and security bar on slider no cost to me!! I have never had an issue with Susan either.  I am grateful to have had such a positive experience Debbie, Josh and Susan...","useful":2,"funny":2,"cool":0},
{"review_id":"V9zoTnipQLHRTE1Kns16XA","user_id":"0BwXT1VPSrTIj9HlEN2tow","business_id":"DqCz4pb6smEwsOTanhyycg","stars":5,"date":"2017-07-09","text":"Moon valley planted my palm trees and plants last summer.  I recently noticed everything looked dry and asked my Gardner about it he said everything was fine!! Thank goodness I reached out to Elizabeth at Moon Valley she got right back to me immediately, she came by my house this morning and within a couple minutes knew what was wrong!! Once again she went above and beyond which is so lacking with business today!!   Thank you Elizabeth.  I hope Moon Valley realizes they have an exceptional employee in Elizabeth!'","useful":0,"funny":0,"cool":0},
{"review_id":"JRH6hB8s0mjlgZmV4d8dhw","user_id":"0BwXT1VPSrTIj9HlEN2tow","business_id":"TSZCZnzxd10npwOLP6OP7A","stars":5,"date":"2016-03-17","text":"no pretense here people!!! Doctor K is the real deal, couldn't be more down to earth,easy going not in a hurry ....... I had Botox and filler  had my lips done, Doctor K put a dental block in, I knew I was in good hands then because I did not even feel that.... Jenny and the rest of the staff are amazing friendly and knowledgeable so excited with my results!!!!!  The absolute best!!!!!!","useful":1,"funny":1,"cool":1},
{"review_id":"oAE7rTajOwLEAt5dnGZJZw","user_id":"9vsmZcfnhXKcM-qYV5BoPw","business_id":"FcpNYvZkBjt930vSQL57tw","stars":1,"date":"2015-01-20","text":"I've been a customer off and on for over 10yrs.  After switching to directv for a while I got a call to come back to fios so I listened to their sales spew.  I was still under contract with directv so the man said he'd give me a $300 visa gift card.  After over 31 phone calls and numerous hang ups I finally talked to a superviser who basically called me a lier. I would never recommend them and feel they don't treat people properly.","useful":4,"funny":0,"cool":1},
{"review_id":"--2KPEup5YzgbCaE4IWztQ","user_id":"9vsmZcfnhXKcM-qYV5BoPw","business_id":"ECXHwaJW7Lc7qDlH89Syaw","stars":1,"date":"2016-06-09","text":"I waited for my order for over 10 minutes. I ordered two chicken finger kids meals and two adult meals. Had to pull forward and wait another ten minutes for food. When I got home they didn't give me my kids meals.","useful":0,"funny":0,"cool":0},
{"review_id":"SeQOgNmkxnR5NFNmFXo9sg","user_id":"ZGiDB8JvXwuwQMrhITeYyw","business_id":"_DpnhekFOZDPNBDekWpx4A","stars":1,"date":"2012-10-02","text":"Awful! I'm in town for work and wanted to watch my baseball game. It's Monday night so I understand it will be busy and Monday Night Football will be on so I find a spot at the bar and ask for my game. The bartender explains to me, since they \"went corporate\" they can't play baseball games. Uh, huh? Went corporate? You're a chain. That was odd to me so I ask a manager and he said they don't get the sports packages. Again, makes no sense, you're Buffalo Wild Wings...you have every game. Then another manager comes over and says they're having issues with their tv and can only get the MNF game and the Brewers game. No thanks, I'll go somewhere else. \n\nVery disappointing. BWWs is always my go to place when traveling to watch whatever game I want. It's a great sports town so I assumed I would be fine. My game is on at Hooters so no more BWWs in Madison.","useful":1,"funny":0,"cool":0},
{"review_id":"3MSnA7xa5ay9im9nFNdbKA","user_id":"PUukPvTHQzpyhcnsn0PRYQ","business_id":"h0rpFd7QqVMSNMKBz0GMUw","stars":5,"date":"2015-05-02","text":"Wonerful people to do business with. They found and special ordered me a piece of jewellry I had been searching for. The service was personal ( even though we dealt on line) and seamless. I would highly recommend this merchant.","useful":0,"funny":0,"cool":0},
{"review_id":"9QDkjpzOaenj36We50ZdBQ","user_id":"QCW9e0dehBOT0hfcjv266g","business_id":"pCwOCE-cycl6cMEa9O6bZQ","stars":1,"date":"2015-10-14","text":"Ordered a cup of their usually good chicken noodle soup to go. Walked down Forbes Ave for a while and sat down to eat and it was unbearably salty. Inedible. Walked back to get it swapped for something else (they were out of their other soups, as it was late in the evening). I opted for a $4 breakfast sandwich. The manager was unwilling to compensate me in any other way than by deducting the price of the soup from what I was getting (which was $1.50 more than the soup). He insulted me by offering an order of fries instead (which was worth less than the soup). I wasted 10 minutes twice waiting for the food and another 10 minutes walking back. You can't treat a customer like that. I wasn't asking for the world. I was forced to pay full price for something I didn't originally want after having walked back and forth and waiting for it to be prepared.","useful":2,"funny":0,"cool":0},
{"review_id":"QReBE31vnnbv2SGDfO4jhA","user_id":"3vegOcommMolc8X03iKTqA","business_id":"CqCLZEeMWBAsOzAQQLm71Q","stars":5,"date":"2017-02-07","text":"Orange Pest Control, always on time, always a friendly face. Jack does a great job, very through and deals wonderfully with the family hoard of pets. We are new to having pest control but from the first service where we had a call back, not a pest to be seen. I would recommend them to my friends and neighbors.","useful":1,"funny":0,"cool":0},
{"review_id":"RUqkzR6cqLja70IfFYeDcw","user_id":"3vegOcommMolc8X03iKTqA","business_id":"z3VM5ZYimstQ8bYwGT5FOA","stars":5,"date":"2016-05-28","text":"Great service, clean carpet ( mine was white) friendly and knowledgable rep. I would recommend to friends. Dried in less than 3 hours. No soggy wet carpets!","useful":0,"funny":0,"cool":0},
{"review_id":"LmPLcvZ6pqr34vhL7AWRNQ","user_id":"nguWpMFp7OqIMaGd9vfX5w","business_id":"M72tVr95htIh2wpJGwLkEQ","stars":5,"date":"2016-06-05","text":"Nana is amazing! She will recreate whatever nail idea you have! :) I highly recommend her awesome skills!","useful":0,"funny":0,"cool":0},
{"review_id":"K4LfQFkd7GkSzralJ7RDBA","user_id":"_MQN4GqlHN9dEkEc1U-JtA","business_id":"ghpFh6XpH1TYZhjAGdx-xw","stars":1,"date":"2016-05-24","text":"Disrespectful employees. I thought the African American dude who works there was disabled or deaf and kept repeating everything I said till the tall  girl behind the cash starts laughing with him & acts  sarcastic while I was there for the pizza only. Will never eat there again. The business owner better interview his employees first before hiring people who are disrespectful to customers. I'm very disappointed. Unprofessional and uneducated people.","useful":0,"funny":0,"cool":0},
{"review_id":"XZzZZeJbX-PsVkq2FFD8uQ","user_id":"AHUW45C_jgmNz6IlYVAB9g","business_id":"bjSC_jbrypke0l-bXXBmwQ","stars":5,"date":"2014-11-26","text":"We enjoyed every bite. The Oysters were fresh. The filet cooked to perfection and could be cut with a fork. Our wait staff, Josh, was as good as it gets. He was knowledgeable regarding the food and the wine, making excellent suggestions. We will definitely return next time we are in Las Vegas. We felt extremely lucky to have found Vic & Anthony's.","useful":0,"funny":0,"cool":0},
{"review_id":"7rbOL0UZU4nfDN6Oi6inUw","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"Ay2hfgpp8kELkwy76BRWLQ","stars":5,"date":"2016-02-23","text":"I've got nothing bad to say. Came for lunch and ordered boneless wings. Service was quick, food was quick and hot, server didn't hover......just as it should be. Atmosphere was better than expected and the bathrooms were clean. Like I said, I've got nothing bad to say. \n\nI would come back for sure.","useful":1,"funny":0,"cool":0},
{"review_id":"llZbtat9zxnnsW2_RD8VJA","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"MQ3o9sFS1m1L2Gb_hvvYSQ","stars":2,"date":"2010-08-19","text":"It is like any other Subway. Food is good, restaurant is clean. However, as I walked in, there was an employee and her friend sitting at tables no more than 5 feet from the door, both smoking. I had to walk through the smoke to get into the restaurant. Stuff like that is a deal breaker for me. I will go to Quizno's next time.","useful":0,"funny":0,"cool":0},
{"review_id":"h0_RX0TCsq91QY5zurtaHg","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"I4ZHa5S7vPMBauConLlbSg","stars":5,"date":"2011-06-14","text":"Waitresses are hot,  food is awesome,  price is right, service is fast,  and place is clean. Love it here.","useful":3,"funny":3,"cool":1},
{"review_id":"wsfeN5AsqawvcF7pNlDjpw","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"wTNWq7jrCZD1q2hSjUtTXg","stars":3,"date":"2016-09-22","text":"Dang it. I wanted to love this. I really liked them at their old location. The new location is really nice. A lot nicer than the old, to be sure, but the food? Eh. \n\nWe stopped in for lunch on a Tuesday and took advantage of the cheap tacos. They just bring the shells and meat to you and then you finish them off at the taco bar. They had the normal taco fare. Lettuce, tomatoes, cheese, different salsas and hot sauces, and (unfortunately) pickled jalapeños. I wish they had fresh jalapeños but whatever. All of the fixings were fresh. \n\nI got the beef tacos. Big mistake. The beef had the texture (and I assume the taste) of Moon Sand. If you have kids you know what I mean. It was so bland that it could have been served in a nursing home. The texture made me think that whatever meat they used was put into a blender and someone hit purée but then started playing Angry Birds and forgot about it. \n\nService was great. Water never ran dry and checks came fast and correct. \n\nI'll give it one more shot for dinner. I will not be ordering the puréed moon sand tacos again.","useful":2,"funny":1,"cool":1},
{"review_id":"X3ZNcr-w-52-Wa9f0ZRkKw","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"XkA8scf2M_-CirepJSACXg","stars":3,"date":"2015-09-05","text":"Eh. Slow service but hot food. Slow service just irks me. We were literally the only people in the restaurant. There's really no excuse for slow service when there's only two of us.","useful":0,"funny":0,"cool":0},
{"review_id":"DssNSsWtep73v_TsG03edg","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"PaIhgplSaX7nxR5XR1yatQ","stars":4,"date":"2017-08-04","text":"My daughter and I walked in and were seated right away. The server came by immediately and got our drink orders and we ordered our food quickly. It wasn't real busy but the food took a bit longer than I think it should have. Not \"This is bullshit, I want to talk to the manger\" slow, just \"Hmmm. I'm hungry\" slow. \n\nThe food came and the portions were bigger than expected. The peppered bacon is amazing. Thick, not fatty, just perfect. All of the food was hot and on par with what I would expect. Nothing earth shattering but pretty good. \n\nThe servers are attentive and checkout was a breeze. We'll be back. \n\nTwo of us ate for $16.19 and left food on our plates because we were full.","useful":6,"funny":0,"cool":0},
{"review_id":"LyNEn2JKk8O2X2ur-RiO_g","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"-W1rsicX12yNIjsBUh6TiQ","stars":4,"date":"2016-06-27","text":"I stumbled on this place while passing through and stopped in to get a bottle of water. When I walked in I saw the sandwiches and got hungry. They all looked great but I settled on the egg salad. It was really good. Maybe not quite $5 good, but really good. \n\nI assume the owner rang me up. He's one of those guys that makes you feel like you're already friends with him. \n\nCool little store and whenever I'm in the area, I'll be stopping in for a sandwich.","useful":1,"funny":0,"cool":0},
{"review_id":"KrhX0A8xeYDvobSbaJdbaQ","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"THTiTUAvK1ihGpXleFjGcQ","stars":4,"date":"2015-03-14","text":"Never had a bad meal here. Tough to understand them over the phone but I guess that's to be expected.","useful":0,"funny":0,"cool":0},
{"review_id":"2IXxASG6XlSdCvCl6-cEyA","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"ELIINdJ7w8FcfcGqoGbPoA","stars":4,"date":"2015-03-18","text":"The Cajun BBQ wings are some of the best I've ever had. If they had a bigger bourbon selection (read: Woodford's) I'd give them 5 stars.","useful":0,"funny":0,"cool":0},
{"review_id":"fytdS0szTVA5GDVst0jjcg","user_id":"eRNuF7zlZKSh7MWOk6J_Mg","business_id":"5YyLWps6xL372Lj2hRlPQw","stars":3,"date":"2016-07-13","text":"Eh. Stopped in for lunch and got the buffet. Food was ok. Not horrible, not great. The salad portion of the bar was typical salad bar. There is pasta and one kind of wing available on the buffet but you can order any kind of wings in as small as 4 wings and its included so that made up for it. I ordered 4 mango dry rub and, while a little salty, they were pretty fantastic. \n\nWe came in at noon, got seated right away, and service was great. As long as you come in knowing that it's a QSL and not French dining you'll be OK. \n\nI'll be back.","useful":2,"funny":0,"cool":0},
{"review_id":"EtyDz1sdePxABhjckrC5Kw","user_id":"0Ab77zDMTqglC2uMZdEuqg","business_id":"KVsv8wRGnLX8QWoNZKNMQA","stars":5,"date":"2015-10-13","text":"Came here with coworkers. We ordered the \"chef's creation\" at the \"typical\" price limit of $80-100 each. \n\nIncredible. Some of us are seasoned sushi veterans, others weren't, everyone loved it. Very neat creations, each was unique and delicious.","useful":1,"funny":0,"cool":0},
{"review_id":"lbCFb8Qpt-1YUfnPt-oATw","user_id":"TOS8-C_j1gQmWG_8zQfVwg","business_id":"vCFIhkndnlmJg5-Uz6N_dQ","stars":5,"date":"2017-03-12","text":"Oh what a perfect ending to my weekend in Montreal. Came to this place with a group, all of us had a different burger and all of us thoroughly enjoyed it. Wish I could remember the one I had, but they were all good. \n\nOnly downside was that this put us in a food coma and we couldn't continue on.","useful":0,"funny":0,"cool":0},
{"review_id":"HTK_yAq0muJSPpa7gf82fQ","user_id":"TOS8-C_j1gQmWG_8zQfVwg","business_id":"ii9kqE9s4456Jn9asz-BPQ","stars":4,"date":"2017-03-12","text":"Came to this place my first night in Montreal with a group of friends and it was definitely a good pick. Our waiter was really cool and friendly. The food was well 4 out of 5. The meatballs were good but the arancino and antipasti plate were slightly underwhelming, but by no means bad. The main course, think it was penne with prosciutto more than made up for it. \n\nOnly thing that was a negative was the front staff\/manager? Even though we were a group of five and the restaurant was 85% empty, they were trying to sit us in a small table for four. Basically had to argue with the guy to get us a larger table. No reason for that.","useful":1,"funny":0,"cool":2},
{"review_id":"-C1BH9PW-1NQIAN-45e2Ew","user_id":"9eqVf8szlOYQLEe3T5R0Lg","business_id":"upe4kXYT_hrENtLRu-v4Hw","stars":5,"date":"2013-09-18","text":"My Grandson attends Journey Education, we love the school. The best part about Journey is that they care for each and every child. The classes are small and the teachers are wonderful. The tuition cost is lower then most private schools in Las Vegas.","useful":1,"funny":0,"cool":0},
{"review_id":"eda_1lfOLRUWbItXIfoyOg","user_id":"9eqVf8szlOYQLEe3T5R0Lg","business_id":"m8o3OrY0DWfqvk820EyrxQ","stars":5,"date":"2015-08-05","text":"My Mac Hard drive failed. They fixed it in 24 hours and restored back to normal. Amazing,  \nThank you!","useful":0,"funny":0,"cool":0},
{"review_id":"olQ6spQirFm_7fvOLsOV8w","user_id":"FsogoYux8thh4NjuXbwwsg","business_id":"OTg5-3_O73VdvvkO_B1BKw","stars":5,"date":"2015-02-12","text":"Love,  LOVE, LOVE  this place, torrid has great stylish clothes in plus size and there is a wonderful attitude & Fantastic service by all the ladies who work at this location, especially Cortney, Brittany & Aimee.  I can be having a bad day a day,  come here and walk out of here happier and in a better mood. Thank you Torrid for great clothing,  and thank you to all the ladies who work at this location.  \n* I  typically don't address another's opinion,  however I read a negative review comment about one of the workers Cortney that works here at Litchfield and this person labeling her as a racist, I can tell you she is far from a person being a racist. So to the person who decided to take it upon themselves to judge and label another person's character like this,  shame on you try to do so and saying something like this about such a kind sweet person as her maybe try taking a look in the mirror at yourself and your attitude first before placing judgement on another person like that.  You got it ALL WRONG!!","useful":3,"funny":1,"cool":1},
{"review_id":"3f1MujjKEoTPW2E-VFwicg","user_id":"G5QQ679NciI86UIQtIyOfg","business_id":"LSPwq3J4WDHh6q3Cu0uMog","stars":5,"date":"2013-06-17","text":"Régine Café est définitivement l'un des meilleurs endroits pour déjeuner. Oubliez les oeufs tournés et rôties sans intérêt, cet endroit a beaucoup mieux à offrir. Tout a l'air délicieusement appétissant et vous donne envie d'y retourner tous les matins. Je me promets d'essayer le Nutella maison lors de ma prochaine visite.","useful":0,"funny":0,"cool":1},
{"review_id":"aqgTLRYIPjyMtL8GDveGTg","user_id":"G5QQ679NciI86UIQtIyOfg","business_id":"uU1VdmqO6UTCiRgbhQrbsg","stars":4,"date":"2011-11-16","text":"J'ai adoré ma visite au resto Nil Bleu! Une amie m'avait parlé de cet endroit avec grand enthousiasme et je n'ai pas été déçue.\n\nQuel plaisir de manger cette délicieux nourriture à la façon des Éthiopiens...avec les mains! Pour goûter au maximum de plats, il est agréable de partager avec tous les gens autour de la table. Soyez sans crainte si votre voisin de table n'est pas passé à la salle de toilettes pour se savonner les mains, une serviette humide vous sera apportée avant le repas.","useful":2,"funny":0,"cool":2},
{"review_id":"tMzvKFUFpkWlrlRLJhmbog","user_id":"G5QQ679NciI86UIQtIyOfg","business_id":"ey9c-TjWXgTJ5OlD0HPd_A","stars":5,"date":"2013-05-28","text":"Ce petit resto est une découverte que je ne visite pas assez souvent à mon goût. Ambiance relaxe, employés très accueillant, gaufres à tomber par terre !\nJuste miam !","useful":1,"funny":0,"cool":2},
{"review_id":"b11HmUx9O6X-tao_bAlSKw","user_id":"G5QQ679NciI86UIQtIyOfg","business_id":"BwWwUSBiGymiixwun5cVNw","stars":4,"date":"2012-02-06","text":"Le Finlandais est mon spa favori des environs de Montréal. Pas trop petit, ni trop grand, il y a assez de place pour tous sans qu'on se pile sur les pieds. L'endroit est propre et bien entretenu. \nÉvidemment, en hiver, les gens se réfugient dans les grands bains et c'est parfois difficile de se trouver un petit endroit à part.\nSi on fait abstraction des gens qui y sont pour exhiber corps et chaînes en or, c'est un endroit superbe à visiter :)","useful":3,"funny":0,"cool":3},
{"review_id":"zQiJ3dOTHoiENMOCC2K6GA","user_id":"ALAaRsRhi58PVRXD5mP6cQ","business_id":"XMrLwzmEAsfNpbKRC7vUzQ","stars":5,"date":"2015-10-11","text":"Loved the Nachos All the Way!!  The Kenmore burger was delicious also. Our waitress was great.  Great service also.","useful":0,"funny":1,"cool":0},
{"review_id":"tGW8xfSkVjxmB7QEtN8fGg","user_id":"lxRtuzv_0laDi6ol2OOL7Q","business_id":"WUq8HJHIZU4uteB154XN7w","stars":5,"date":"2013-10-15","text":"Had an awesome time at Marquee for my 46th bday.  Had a poolside cabana and wouldn't recommend anything else!  The fresh air retreat outside was great after dancing inside.  Staff was great and our party of 6 really enjoyed ourselves.  We would definitely return again for another cabana evening of partying.  Dance floors get packed, but hey, it's an awesome nightclub so expect it.  Cheers!","useful":1,"funny":0,"cool":0},
{"review_id":"VVvTutPYuNHLta0iFxBYNw","user_id":"2k8P0zDMOwcsQ8MnDgtcdQ","business_id":"wi2zmt1W_hUjBe1c71lIUg","stars":5,"date":"2016-07-01","text":"Adrianne is a great real estate agent.  She worked really hard to find my perfect home. She all ways shows up on time to all the home viewings and when I finally found a home I wanted to purchase she gave me great advice on how much to offer the home owner to get the home.  You will not be disappointed if you select Adrianne as your real estate agent.","useful":0,"funny":0,"cool":0},
{"review_id":"DNntUUHvTHroDRALKlHfTg","user_id":"lpGqw17QVlPV9zvv-J6qBA","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":2,"date":"2014-04-17","text":"We went there on a Wednesday night, and not only did we have to wait over an hour in line, but they didn't have too many main-course vegetarian options, like tofu, veggie meat, loafs, etc. And a vegan definitely couldn't eat there, cause they'd have just fruit. Much of it was meat & side dishes to go along with the meat. I don't think i'd pay $36 again to eat overly-rich pasta, pizza & dessert, as a vegetarian. I probably ate about $5 worth of food, if that. The food was nicely presented though, and the staff friendly. They can't accommodate so many people in a timely manner. It's like a circus. I wouldn't go back because it's expensive, food options are limited for vegetarians, & takes WAY too long to get in.","useful":0,"funny":0,"cool":0},
{"review_id":"rbT48c-rlUiXN1bhfJh5yQ","user_id":"lpGqw17QVlPV9zvv-J6qBA","business_id":"OIOqy9gh3LOoyso3JMwyyA","stars":5,"date":"2014-04-19","text":"Nice!! After staying in a dated hotel last night, it's refreshing to be in a clean, modern hotel with a great kitchen, bathroom & bedroom. Love it so far!","useful":0,"funny":0,"cool":0},
{"review_id":"hnRNcOpBNaEKJg90RCs1sw","user_id":"p0N4SbQJwmGOWzLWF2_NBw","business_id":"laBHq-98LF93adYf2Bl0cw","stars":5,"date":"2016-08-10","text":"I found Davonna on Yelp searching for a massage therapist who knew how to do lymphatic massages which are hard to find.  I recently had finished treatment for Lyme Disease and was wanting extra help detoxing.  She is AMAZING!!!!! I am so grateful I found her.  She truly wants to help and is concerned about your well being.  I would recommend her to anyone! Especially those who are looking for help detoxing after long term antibiotic treatments.","useful":0,"funny":0,"cool":0},
{"review_id":"v5lSBg9Pf1wbPX_7q-IItQ","user_id":"_W7PUfVeZm_lkqmtKVJo6g","business_id":"YOZgLDLNLAe2nP1sw5inYw","stars":5,"date":"2015-05-08","text":"Was in town for a bit of business and pleasure; MK Thai definitely fit the latter. The tempura shrimp appetizer was appropriately prepared and came with a delicate but flavorful plum sauce. The entrees were the standouts, though. My wife's Panang beef and my Chili paste chicken were both outstanding. Service was friendly and prompt. Do not hesitate the leave the bubble of the strip or your resort to seek out this gem.","useful":0,"funny":0,"cool":0},
{"review_id":"d8dJODcBSdHA-c1bbcfOEQ","user_id":"_W7PUfVeZm_lkqmtKVJo6g","business_id":"zwNC-Ow4eIMan2__bS9-rg","stars":5,"date":"2015-05-08","text":"We had lunch here while in town and glad we did. If there was a taco y taco in my hometown, I'd eat there regularly. The asada and carnitas tacos were very tasty. I also had a vampiro for the first time. It was outstanding, as well.","useful":0,"funny":0,"cool":0},
{"review_id":"abclzhv2QnRMdtwZYcL63w","user_id":"mQj2DwJLn9zBj8dpdrmZYA","business_id":"yfxDa8RFOvJPQh0rNtakHA","stars":1,"date":"2017-06-06","text":"Family and I went in for lunch on Sunday around 3. We were able to get seated fairly quickly because there was no line. The food and service was mediocre at best. The one star rating is because the waitress demanded more tip money. The bill had came and I paid with tip and placed the money on the tray which accompanied the bill. The waitress came by to pick up the bill and when she saw the tip amount she told me \"This is how much 15% tip would be.\"  I told her I'm giving you 10% because that's what I believe you deserve. Mind you, I'm not cheap and I often tip up to 30% if the service warrants it. In this case it did not. My family and I were all so shocked that she demanded more tip. This is the first time this has ever happened to me. I believe that once a business gets established and has a lot of customers they tend to take customers for granted. We will never ever ever go back. Maybe they thought they were the only Pho store in town. There's like another five to ten Pho store within a one mile radius that we will rather go to next time we are in Vegas. Btw, I'm not the only one complaining about the tips. There's other reviews also.","useful":0,"funny":0,"cool":0},
{"review_id":"nJLZ0e5e954xL4V0hS2reg","user_id":"zCHZh_haMe-8QcpOLrsszQ","business_id":"XBEx2FI2GKmsjs7eWNr7Lw","stars":5,"date":"2016-01-23","text":"This place is dank af. I come by all the time and all the employees are chill. The dude with that tattoos looks cool. I'd smoke a bowl wit dem","useful":0,"funny":0,"cool":0},
{"review_id":"LZYno2OsEKDAEjH5itUVMA","user_id":"zCHZh_haMe-8QcpOLrsszQ","business_id":"qBn_PHbXCab6dLV3xXiQOw","stars":5,"date":"2016-08-04","text":"Im getting supplies needing to start blowing glass, the last thing I needed but couldnt seem to figure out were the right hoses and fittings for Oxygen and Propane, I went to one place and was talking to the dude there and Stephanie just happened to be in line and then told me this place had what I was looking for and directed me here, and then Jeff here helped me out and got me what I needed right away. Super chill dude and he knows what hes doing and talking about. I will more than definitely be back again if im in need of anything else, and I would highly recommend this place to anyone else.","useful":0,"funny":0,"cool":0},
{"review_id":"M5hMOamQoJRcKITAoIWvbg","user_id":"SByZV0HByWV2RlxnzQ1hTg","business_id":"S5QaTPa3bjQDJcYlMjnqlw","stars":1,"date":"2015-04-05","text":"CUSTOMER SERIVCE ISSUE!!\nMy issue is not just with this location but now with the Customer Service department of the entire company.\nMy first problem was I was not informed about the tanning 1 time within a 24 hour period. I was rudely informed that I would  have to wait another 30 min before I could tan again, and that was Nevada State Law. Ok, its a law I will get over it. (Later I found that other salons don't do this, they only allow 1 tanning session within a 12 hour period). \nThe second issue was last weekend, when I had stopped by with a friend of mine (who doesn't tan there) because we were near there and she said she didn't mind waiting, I heard the employee say to a new customer that he could call ahead to reserve a bed if he was on the way. I was surprised by this and so was my friend so I told her we could go and I would do that. So later I called and the same employee answered the phone, I asked to hold my bed because i would be there in about 15 min and she said \"we don't take appointments.\" I had informed here that i just heard her say that they do to a  new customer and she was VERY RUDE replying \"It's been me here all morning and i didn't say that.\" if it weren't for the fact that my friend heard her say this as well as me, I would have gotten over it, but she flat out lied to me. \nThird, I emailed the customer service department about my issues a week ago and still have not gotten a response.\nAnd today while stopping by there I heard an employee answer the phone asking a customer to hold extremely rudely. \"I asked you to hold on for a moment\" I work in a customer service environment and you do NOT speak to customers this way!\nI CANNOT believe that customers are treated this way!!! If this is what the company allows to happen in their salons I do not want to be a part of it. I will be canceling my membership.\n\nI DO NOT RECCOMEND TANNING HERE!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"1mil9axYCtU3-4RxlDyfBw","user_id":"SByZV0HByWV2RlxnzQ1hTg","business_id":"uUEKndnFbHD8mVkGiirtpA","stars":5,"date":"2015-08-08","text":"They have the best fish tacos!!! I love the island feel of the restaurant. It's so relaxed and they wait staff has been great each time I have gone. This is one of favorite places to eat. The Sangria is also tasty!!","useful":1,"funny":0,"cool":1},
{"review_id":"BNheFT9ZAqbpTD0IWISbVg","user_id":"SByZV0HByWV2RlxnzQ1hTg","business_id":"cMHEWGbGdGy1WkThoh6oXA","stars":5,"date":"2015-08-08","text":"This gym is awesome!!! They keep it so clean and it's big enough that people aren't on top of you. Like any gym though there are those people who are just rude but it's NOT the staff. The staff is friendly and willing to answer questions quickly. This is my favorite gym of the LVACs not just because it's new but the layout is awesome. The pool is still under construction but I will love this place even more when it's finished. They also have fun group classes!! Brandy who teaches some of the Les Mills classes is awesome!!! \nBEST GYM!","useful":0,"funny":0,"cool":0},
{"review_id":"Xahaa1t-8i2PLW7dFWWiTA","user_id":"SByZV0HByWV2RlxnzQ1hTg","business_id":"XQm5LDv3M9d4zDtKRO_8iQ","stars":2,"date":"2015-08-08","text":"This used to be a Golds Gym and it was awesome then!! Since its been change to a EOS Fitness it just seems to go downhill. The broke equipment seems to stay broke and the facility always seems dirty. The staff also isn't the friendliest. They don't clean out the pool very often so it feels like you have oil on your skin when you get out. The bathrooms usually have toilet paper all over the ground, which I don't understand why people do that that's a customer issue. They showers seem to be broken a lot so it's unpredictable if you'll be able to shower there after your workout. Wish this was still golds they seemed to care more about it then.","useful":2,"funny":0,"cool":0},
{"review_id":"MfJOY7ff-4j4mAeTGm0TsQ","user_id":"yixUoWwuIUI09USqGFSNWg","business_id":"zNRPkZXj3h_Wq5g31aXEGg","stars":5,"date":"2015-01-07","text":"Came in there with completely shot brakes on my front two tires. They explained to me exactly what was wrong, showed where the rotors were damaged beyond use, and worked with me to find the best price. The manager even threw on an extra discount and coupon for me since I'm a broke recent-grad. I usually stay away from big name auto repair companies, but these are some trustworthy guys over here","useful":0,"funny":0,"cool":1},
{"review_id":"ygfBtJMDhv4YUtZK4LeoUQ","user_id":"R8lkxK7XVdQBQaS6qkmb6Q","business_id":"wB3wHS79wDxGTnEk8N51qA","stars":4,"date":"2011-02-05","text":"This place could be our new once a week! Great specials, great pizza, lots of TV's. Perfect place to watch the game. I love Belmont!","useful":0,"funny":0,"cool":0},
{"review_id":"I8_E0M9_0TI7gGobH6Mp-A","user_id":"R8lkxK7XVdQBQaS6qkmb6Q","business_id":"T2tEMLpTeSMxLKpxwFdS3g","stars":5,"date":"2011-02-05","text":"Best fish tacos I have ever had. Can't wait to go back! Only draw back would be the wait and the small bar area. Yummmm..","useful":0,"funny":0,"cool":0},
{"review_id":"YRbJ-INS-Q45FuxPec_1AA","user_id":"R8lkxK7XVdQBQaS6qkmb6Q","business_id":"gN_Ex1rxGEQUayCvdMNcCA","stars":2,"date":"2011-02-05","text":"Average food. The eating area was freezing, we ate with our coats on. won't be going back anytime soon.","useful":0,"funny":0,"cool":0},
{"review_id":"ET-RrUsRGzXg2Nttadj2yg","user_id":"s_9ndJi_KShYTLZGeVW4ng","business_id":"Hooe-5-Drf63HI9Pj6dA5w","stars":5,"date":"2016-12-12","text":"From the moment I walked into Elysian West, I felt right at home. The staff is beyond wonderful. The property feels like a resort and it's not your normal property. It's huge. The apartments are exquisite. Everything is brand new. The amenities are over the top great. The rent is at the right price. This property is amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"O57eSUXuSBvgfCroo0X3Fw","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"i_t_UJTSScw4srpb8aHUiw","stars":1,"date":"2013-10-22","text":"Nothing change after 2+ years visit!! The service still suck, food still bad!! I don't know why people still take line up at here!! I prefer pay more $2-3 to get good food and good service!! Agree with one of the guy said \"only cheap people go here\"!\nI think other restaurant at hwy 7 is the same owner, they do same worst food and service!  OMG !!!","useful":3,"funny":0,"cool":0},
{"review_id":"4ooWVIJ3SpuQvRJI9-d3dQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"QZ4GFIArBMGolsVi0XHgcA","stars":2,"date":"2013-05-15","text":"Came there sometime! Food portion small and taste just OK and also not using a meat !! Inside the restaurant, a lady too loudy and always make me uncomfortable !! Other waitress also just OK not really friendy!!","useful":0,"funny":3,"cool":1},
{"review_id":"Ns69WeYpITNV0np01HgIvQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"ae95XSsD37OQfOWF92GjNQ","stars":3,"date":"2014-03-05","text":"Went for Buffet with my family on Tuesday night! Arrived at 7pm, crazy parking area , parking full and my husband need to park his car at other mall and then he walked to restaurant! \n\nFood not bad and more choice than others!\n\nService so so !\n\nI love the desserts bar better than others!","useful":1,"funny":2,"cool":0},
{"review_id":"fLuY7ALjqmKEUlKa8IvbYA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"QWYKZ9mp9ggGQqGEw0LLqA","stars":2,"date":"2013-10-14","text":"Don't order Tung yum Kung soup (very bad)! Curry chicken (chicken seem over a months),they say ??? is the best in Toronto but nothing special.steam fish cake was cold and reheat at microwave in mins! Over all I won't come again!","useful":1,"funny":0,"cool":0},
{"review_id":"IfYnEphwrWP9PDTXVXSBog","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"8zyurJRIAEHh_I0Skhcp3w","stars":1,"date":"2013-09-10","text":"Came with my 8 friends last Thurday morning. We order 7 breakfast and side order 1 hot drink and 1 cold drink. For my order was 2 eggs (well done), ham with toast (but I request no toast and no butter). But they gave me 2 sunny side up, ham with bread with butter. They brought back my dish to kitchen and fixed for me. But its too oily and cold on the ham and bread with butter (because 2nd time they gave me 2 eggs (over easy, so brought back to kitchen 3rd time). Cold milk tea very bad and make my tummy whole day uncomfortable. For my friends, they said noodle in soup very bad. When we got the bill, they charge more side order drinks, so we told them to fix it ( charge more $3). But the chasier and waitress told us .... \"only charge us more $1 only jar .........\"","useful":0,"funny":0,"cool":0},
{"review_id":"lc2TPXZtmzuXDryIvKXlJg","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"ttOvIMRLQrSM8cdCjFql7A","stars":2,"date":"2011-10-10","text":"Service A-OK !!\n\nFood not really good !! A little bit disappointed, I love the one locate at Richmond Hill ( Closed )\n\nI ordered 2 noodles, 1 pancake, 1 tempra .Noodle too salty, pancake just OK! When the noodles ready on my table, the looking very bad and make me dont want to eat !! Just let all the meat, egg, veg. put in a blow .... Anyway, I think I dont go there again .... !!","useful":0,"funny":0,"cool":1},
{"review_id":"qpYvBD6N0yor_Vb-ZZ7KLg","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"H2ljOK6pDHJ-iQzHkijW0w","stars":2,"date":"2015-04-05","text":"Food bad! Ordered wings w\/ fries and it's only have 4 pcs small tiny wings with about 20 pcs fries! ???????very oily and each pcs was deep fried, can't eat , I returned it!","useful":1,"funny":2,"cool":0},
{"review_id":"pKQaKp6QzlYxdeFSrPilGA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"VFr0wUWq-qwe6nIRjdRYvg","stars":5,"date":"2013-09-10","text":"I went Stone Cafe yesterday night. They have a good deal on sizzling platter and huge of selection. We ordered 3 different Iced Snow Flake ( see my photo). That's so nice and yummy!! They also have some other desserts and special drinks ..... chesse cake, pudding, pancake ..... Would try next time !!","useful":0,"funny":1,"cool":0},
{"review_id":"PVnpzR3_y-k6PrGNv5jsTA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"MLVBJjbgk3sLZYyxqBD4XA","stars":1,"date":"2013-10-28","text":"Just common HK milk tea, not good not bad!! I don't like the take out cup for milk tea! I just think I'm in Tim Horton ! Food only 1 star, my mother did better than here!\nService = No Service = Tim Horton = Mc Donald = Burger King = .......\nWhen we ate, there were some guys to fix the waste pipe! So disgusting smell!","useful":2,"funny":0,"cool":1},
{"review_id":"m1nfgtS4j1YA9flO1NVxLQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"O_9K3WhlGlXW3KFPfTo0yA","stars":2,"date":"2013-05-15","text":"Came for lunch at around 3pm but wait about 20 mins for my noodle. At that time only 2 tables!! Food just OK !! Waitress good and friendly but the man I think he is the owner not friendy !!","useful":1,"funny":0,"cool":0},
{"review_id":"RKZSlJnsxfmpBR9i-ThkvQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"cdLBNUBgPurw3PyLXvbiGA","stars":2,"date":"2013-05-15","text":"Food tastes just OK, but portion small !! Came at 2:45pm and asked for lunch !! But the staff only give us tea time menu and dinner menu!! Finally we order 6 tea time dishes for 3 people and cost us $36 and more!! But we didn't feel full !!","useful":0,"funny":1,"cool":0},
{"review_id":"vkuiiJ6LNL7vU_B-m7GTmw","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"6R75fHJ_chR0LZT_7RZ92A","stars":3,"date":"2011-06-27","text":"Everything A-OK!! Right now, Most clean than before ..... Um .... only the owner ( laday ) no good !! She seem hate everyone .....!!","useful":0,"funny":0,"cool":0},
{"review_id":"k7P5R2vUF6moV8BHyZsbUw","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"6rv2q1906KMiJTW2QpXv6A","stars":2,"date":"2013-12-22","text":"Agree with Jennifer ... Little bit disappointed! \nRamen was over cooked;\nChasu was too fat, no BBQ taste, look like Chinese style fat pork;\nSoup too salty;\nFried noodle too salty;\n$2 for a California roll seem over a day, very dry;\nOrder come very slow! Only 1 waitress here, so when we add more order seem no one help!!","useful":1,"funny":0,"cool":0},
{"review_id":"Stef4OEp3o3g0Hg3I3c-Ww","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"OYfXGMEwcMKj_gty5e_Udg","stars":2,"date":"2012-01-07","text":"Went there 3 times in a month. Very big different between 1st and 3rd time. Order the same dishes but with different taste. Seafood paste with Cream Sauce, very creamy at 1st time but 3rd times was vert salty. Soup also have same problem! Just a new restaurant, control the taste don't make too big different! Otherwise, people won't come again!","useful":2,"funny":0,"cool":1},
{"review_id":"EiKoRmKkKb9aHOExODFfug","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"VVW8mxu8Ru2UR3lVJYA81Q","stars":2,"date":"2013-10-21","text":"Fish soup not recommend, just no good! Other fish soup restaurant on hwy 7 better than here! Some vegetable in soup seem being expire, taste seem sour! Tea time rice combo jut nothing special but my teenage girl told me that it's bad! Chicken wings also not recommend too!! I only recommend the source they give for the noodle ( I think is xo source, but my husband said that mind one at home most better)\nService ok, a lady very friendly to show the menu and told us about the tea time special! But I just feel little bit too much!! \nFood come within 10 mins after ordered ( but that day only 3 tables in store)\nWe try 1 more time but would be 3 more months later !","useful":1,"funny":1,"cool":0},
{"review_id":"QbdvVNasat7IOZcJx1WE7Q","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"8Fsg2BdHy1e0Pa_TfK58iw","stars":2,"date":"2014-01-24","text":"We were waiting for my dishes over 20 mins. Finally we cancel our French Toast because they didn't start to make after 20 mins! I just saw that all staff including chief were eating beside our table! We pay money to enjoy meal, why we need to wait too long! Food not bad but not good ( 2 pts). Service just ok (2.5 pts, only 1 waitress was ok )! Over all 2 pts!","useful":0,"funny":0,"cool":1},
{"review_id":"lCpDrLK-Q7nla4z2pR-KbQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"XjmHPe0H91BlJ3gwJb7OiA","stars":1,"date":"2011-08-15","text":"My Rate: 1st Service 2nd Clean 3rd Food 4th Price\n\nService: Service was VERY VERY horrible before and after being seated. We had to ask more times for a menu and order food ...... total about take 20 mins. Also, all waitress seem don't want to work here .... no smile no service.\n\nClean: Dinner room A-OK but very LOUD! That night, we had 5 people went there but they gave us a side table for 4 .... so we felt uncomfortable ( resturant not full, I think they want to hold a large table for other walk-in people )!!\n\nFood: I just can say food not good but not really bad!! Um ... Oily Oily Oliy and also salty ... if table for 5 and order 5 dishes were not enough .... there portion was SO small.\n\nPrice: They only give you a Combo menu for 4 dishes, 6 dishes .... Need to ask for side order menu .... but they seem not want to give you ( bcos price cheaper than combo)!\n\nAbout a month ago, I read this restaurant review was different .... I think someone remove a bad review .... I hope that my review dont remove by no reason !! That my comment after visit and want to share !! I keep a copy for this ...haha!!","useful":2,"funny":0,"cool":1},
{"review_id":"XZw6cHFqVf7lKF9UzXy0Uw","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"qZFZJXASKETnKvq6ciVoFw","stars":1,"date":"2013-04-21","text":"Don't order piggy club sandwich it's very bad only ham, bacon, luncheon cost &6.99 No drink! Service Bad !! Portion very very small! Tea time pastes like kids meal! OMG","useful":0,"funny":0,"cool":0},
{"review_id":"awjJ4Hkb6RRr5_0TyWCsbg","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"4-1Cfzs1782tbudx7PDFYQ","stars":2,"date":"2013-12-31","text":"*Food OK la!\n*Service here OK!\n*Cold HK milk tea here, very bad!\n*Price not too high but I can get more better at other HK style restaurant!\n*Don't request a take out box, it's cost $0.5 each ( whole sale price for it not more than $0.1?why they earn this money!","useful":1,"funny":0,"cool":0},
{"review_id":"qS-3AVJPH_pNTGNXfEnNSA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"BYGe-hM9rPcr6yQ9wuZtjw","stars":5,"date":"2013-11-27","text":"Nice salesperson ! I came with my 11 months old baby! They so nice to promote stuff for me and my baby sit in front of the display area! Never force me to buy and hard selling!! Finally I bought a set of wedding bears and got a good deal! Should come again for Christmas gift!!","useful":3,"funny":2,"cool":1},
{"review_id":"lYBtcdH_0VD5u_TYUwosSA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"M-rqZ56wTGSNoIIsBSlhDA","stars":2,"date":"2011-09-12","text":"Food A-OK ! Just basic select of dish ... Nothing special! A little bit hard to call for service ! \nTea time combo come with a hot drink and change to cold drink add $0.75! I ordered 4 combo and want to add $$ to change my drink to SNOW WHITE ( seven up + ice cream ). But the waitress told me that can't ?? U should side order ... So totally we have 6 drinks for 4 people! All HK style restaurant offer add $$ to upgrade their drink ! Anyway, I just go there one .... No second!!","useful":0,"funny":2,"cool":2},
{"review_id":"EIJAcpT-k0ldCHauyISLwg","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"tZ-h-gFhIWnrC4TR_N9K_Q","stars":1,"date":"2016-12-29","text":"Food ok, so 1 star for food ! But poor service, unfriendly waitress, no sense on their service!","useful":0,"funny":0,"cool":0},
{"review_id":"evTOKFi4n8MLSGa8y0iodA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"0-jZq2P4eN7fRdt4Ls1QZQ","stars":3,"date":"2011-06-16","text":"Sometime went there .... OK food .... Goos Service !! The owner (lady) very nice !!","useful":0,"funny":1,"cool":1},
{"review_id":"pMHDN85jFlRzZcC8H5C2kA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"SvMBtzXfE-3H5pxoR7VD3w","stars":1,"date":"2012-01-07","text":"Sometime will go there! Food AOK but service NO. Especially the old man, always no smile and unwilling to serve customer . Today I order s wonton noodle, the good Chinese egg noodle are tender but today are very soft very bad! Also the noodle have a small insert , that scary me.","useful":1,"funny":0,"cool":1},
{"review_id":"P-MseEXGmyB4MOUrCif1HA","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"UnWWyBzpo6L1tT3_5mUqZQ","stars":1,"date":"2013-10-30","text":"0 star! Shrimp won ton but no shrimp! Only meat inside ! Told them about that staff just say nothing ! Bad list !!","useful":2,"funny":0,"cool":0},
{"review_id":"7HZVgGd5HgWmIJYOmeNpUQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"4KHo1LnkM69RtWTDBdG16g","stars":3,"date":"2014-02-18","text":"2.5 stars\nFood so so!\nService so so!\nPrice good but taste just so so!\n$6.95 with steam rice, soup, vegetable and dessert!\nThe restaurant seem old and dirty!\nWaiting time for food was too long!","useful":0,"funny":0,"cool":0},
{"review_id":"_GEJqHheDjQvPBdgX6fA9A","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"ax4ztJvW28xgGvI0OPqGcQ","stars":2,"date":"2011-06-16","text":"Not really to go there !! I ordered a \" Pork Chop Cutlet with Salad\" ..... U know what ... thap Pork Chop Cutlet in dark color .... I think there oil was very old !! I didnt eat the Pork Chop .... For Salad is OK !!","useful":0,"funny":1,"cool":1},
{"review_id":"wJVJ1ChypsbDR4FDTVfARg","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"nrOxXGd3Vx6iz5xuIJT8cw","stars":5,"date":"2011-06-20","text":"Nice owner!! Service good !! Food OK!! I really really love Sundae Roll so much!","useful":0,"funny":0,"cool":1},
{"review_id":"j82ETFzp1n2oODSU3ZxVTQ","user_id":"6jjQkX_rQafuL4Ied1XtuA","business_id":"WDzU-H9ugWqI67rd4YZj4g","stars":4,"date":"2014-02-18","text":"Nice staff!\nGood service and make me feel eating at home!\nOrder tofu seafood soup, stone rice and  seafood pancake. Both of them were fresh and tasty! \nPrice was reasonable! Price for lunch will reduce about $2 each!","useful":1,"funny":0,"cool":0},
{"review_id":"IjhsfMnWIFpmB0dsEgAmuw","user_id":"DmDJoq6ito2s7RrSw2MDDg","business_id":"LD3RKb8ZFPwijgymgMafSA","stars":1,"date":"2013-11-04","text":"I had the worst experience here. I don't recommend this place to anyone I wanna cry. But here's why\n\n1- lady who cut my hair did not speak English very well. \n2- she told me to wait 5 minutes so she could go smoke and come back smelling like cigarettes (and I think she was pregnant)\n3- I showed her multiple pictures of what I wanted my hair to look like and she STILL butchered it. \n4- the place was dirty and was not at all professional (I don't know what these google reviews are all talking about)\n5- I felt like I knew more about hair than she did. \n6- she can't wash hair for shit and she brushed my hair soo hard \n\nI could go on but she sucked soo much and the place was sketch. I should have trusted my gut and not cut my hair there the second I stepped in. The only good thing about it is that I paid 20$. And I regret tipping. Don't go here. \n\nThat is all.\nSincerely, angry client with ugly hair.","useful":13,"funny":7,"cool":4},
{"review_id":"Hvy-mTKo55129kMINkjc_A","user_id":"gPcIdOlg6sIpJUJ6wSC4FA","business_id":"tom6spH5n_eilaCQ2R6J3w","stars":5,"date":"2012-12-10","text":"This is where I stay when I travel to Calgary for or work or for pleasure. Staff are great, rooms are great and it''s nice to have the Moxies and Denny's on site. The addition of a Wal Mart, Costco, Superstore, Ikea and a bunch of other dining options make this a prime spot for the business traveller or for families.\n\nHighly suggest you try this hotel out next time you're in Calgary.","useful":0,"funny":0,"cool":0},
{"review_id":"MyQEB3rN-HxdCdqahQyW8w","user_id":"uWHhcNz1gDeyQiq4FSyTAQ","business_id":"ByyMZI6YHeBuYlAeQ7DaEw","stars":5,"date":"2016-06-22","text":"This was my first time eating Ethiopian food and I must say that it was a wonderful experience. My girlfriend (who has had Ethiopian food many times before) and I went while visiting Charlotte and we are very glad we found this place. From the outside it looks like just a grocery store but don't let that fool you. Inside in the back is seating and the woman that cooked and helped us was so wonderful and kind. I don't like very spicy food and she tweaked some of her recipes to accommodate my tastes. We had had the Tibia and the Shiro and both were absolutely amazing. The meat was tender and cooked to perfection and the Shiro had such great flavor. The injera was so good and cooked with love (as was everything). After dinner she recommended a tea (cardamom I believe) and it was a great way to finish off the meal. I was so happy with this meal. And my girlfriend also said it was one of the best Ethiopian experiences she has had. \n\n\nI would recommend this place to anyone wanting to try Ethiopian here in Charlotte.","useful":1,"funny":0,"cool":0},
{"review_id":"moJkanMBFCFgjhT_1jGa_A","user_id":"mBjOET42wac2ava09tOI7g","business_id":"CMN3KmB5SEfONN00s2nEeQ","stars":1,"date":"2014-07-02","text":"In one word: Meh. In many words: This is a show for people who like Criss Angel, not for people looking for a magic show.  I won't rag on Criss Angel, but for goodness sake, people paid to see him perform, not listen about his childhood (tho the picture of him and his mom was cute) or him shilling his minkfreak show or youtube clips. It would have been fine for like 5 minutes...Not for half of his 90 minute show.  \n\nPatrick M. gives a good account of what the show is actually like. Don't be fooled by the association with Cirque du Soleil...There is nothing Cirque about it other than Criss mentioning that Cirque keeps \"telling [him] to change up his act.\" The best part of his entire show was his little sidekick \"Maestro,\" a short \"magician\" from Mexico who serves as Criss' comedic foil. \n\nAnyway, if you are a Criss Angel fan then you will like this show. For those of you looking for a magic show, please go elsewhere. You will save yourself some major eye-rolling and yawning.","useful":0,"funny":0,"cool":1},
{"review_id":"QhE6adwqS83G93X_NzuhYA","user_id":"1woPk3oQN82GcDzFnSKrtQ","business_id":"sE5Kuu7FiHyfkxkXu11adQ","stars":1,"date":"2014-11-15","text":"Horrible food! I found 2 long hairs in my food.  The place is dirty and the food looks nothing like the advertisements. I will never go here again.","useful":0,"funny":1,"cool":0},
{"review_id":"tYK5uk-r8Owe5-44VzjQcA","user_id":"pTR-du9pMt9yyHrNOKHuLA","business_id":"aEs7Qle2Ah49dwaf3QNU1w","stars":1,"date":"2014-07-01","text":"Wow..never thought there is a difference between dive bars and found out there is a big difference.  This place should be categorize as a shit bar instead of a dive bar! \n\nCalled about 1:30 and ask about employment there and was told by some bitch working there said \"no we are not hiring\" and then with her stupid uneducated trailer trash bitch attitude ass added \"if you are in the business,  you should know not to call during lunch!\" \n\nIts 1:30, past lunch time \"rush\" and this bitch had to open her probably fat, pimple faced mouth and give this rude comment?! This was so uncalled for!!\n\nSo I went in this shitty place to complain (so glad I did not applied at this nasty ass place-which I did not understand why anybody else did not smell or see how nasty this place really is!) and asked for the manager. This  nasty toothless so called\"waitress\" said he was bartending and was busy! I still spoke to this (piece of shit Is way too much nice of a word for this asshole!)manager and was treated again like a piece shit and he bitched me out saying \"if you are not a customer, I don't have time for your shit and come back later!!\" \n\nWell the only time I would come back to this shitty bar if I ever wanted a staff infection or hepatitis from the gross bathrooms! \n\nHow can anybody eat at a place where the management treats anyone this way??!!  I would never eat here and wouldn't anyone else eat at this place!!","useful":1,"funny":0,"cool":0},
{"review_id":"XueS2RqbcpMKmWY8Btj7Ow","user_id":"WQtebIc8sOpC6Zr__AgQXQ","business_id":"9MnbQg7kfb_WgxoV0hXKSQ","stars":4,"date":"2015-07-08","text":"full of people, but did not wait for a lot time for carryout. Really good food. Price is a little bit high.","useful":0,"funny":0,"cool":0},
{"review_id":"LvZ6TQk7nZSSY2HYX1WeIg","user_id":"WQtebIc8sOpC6Zr__AgQXQ","business_id":"BQbDU21SuXERM_gK9AA9AQ","stars":5,"date":"2015-06-12","text":"This is the place my wife and I come every weekend. Good food and great service. Walnut strudel is my favorite.","useful":0,"funny":0,"cool":0},
{"review_id":"BdceNC0WvPQ3WGzWpHQ8Dg","user_id":"WQtebIc8sOpC6Zr__AgQXQ","business_id":"A_wn7gdvQAv5F2-0CBjgEA","stars":4,"date":"2015-07-08","text":"Went to this place twice in the past 10 days. My wife likes the wings a lot.","useful":0,"funny":0,"cool":0}]