[{"review_id":"-YQ8M8cdV5vZGXGeOzrQKw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"SCxtzXcvyk1hygdmOZqd1A","stars":4,"date":"2015-03-27","text":"A coworker told me this place was better than Layalina, and them's fightin' words, so off I went for lunch.\n\nInterior is nice, airy spacious, a bit loud and echoey with upstairs seating. Not exactly a cozy intimate dinner spot, still retains that fast-foody 'get in, eat, get out' atmosphere of most places on Green.\n\nIn order to get a good cross-sample I ordered the mixed grill. Wait was a solid 15 minutes, and there was a steady trickle of customers the whole time (during spring break, I imagine they will be busier during school). The menu said they had hot tea but I saw none in evidence, just a soda fountain, cold bottle drinks behind the counter, and an iced tea server.\n\nGot the food to go and got back to the office. The chicken (shish tawook) was perfectly done, which for white meat at an understaffed restaurant (they had help wanted signs in the window) is a mark in their favor. The beef was also well done and mildly flavorful but not quite the explosion of spiciness that Layalina provides. The kufta kabob was also mild and well-cooked. Nothing was dry or tasteless, the pita bread was fresh, the two sides they give you, one was some kind of jerusalem salad that was 90% tomatoes so I passed on it after taking one bite for review purposes (yup, tomtaoey. Yuck. The things I do for you people) and the other was this odd, neon-pink pickled... something. Not cabbage, not radish, not sure what it was. Its not on the menu. I ate it anyway. It was... pickled radishy but not too strong. Serving sizes were more than enough for lunch unless you're super hungry, I was and still felt full about halfway in but it was good enough that by picking at it over the course of an hour I managed to finish everything but the pita.\n\nThe rice was a little on the oily side but good if again, not as spiced as Layalina. All in all this was a nice, freshly-cooked, healthy meal for a great price. I've heard the owners are Afghani so its possible the food is a milder form than I'm used to. Either way it was fresh, hot, tasty and a great deal for the price. I wouldn't do a dinner date here or anything but for a casual nice lunch or dinner that's not the same fast food fare, I definitely recommend it.","useful":1,"funny":3,"cool":1},
{"review_id":"KdFgqFLuuVi0UgYBjfYd5w","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"hMgIF04rrJ7oB1lGIpFt5w","stars":4,"date":"2013-01-07","text":"This is owned by the old original cook\/owner of Tang Dynasty in Lincoln Square Mall. If you ever wonder what happened to the food there, it was this: the cook sold it and left. He's now opened a new place and the food's just as good as I remembered it. \n\nHad the dry-fried string beans, some stir-fried beef and mixed veg dish, the mix platter appetizer and some beef noodle soup. All were quite flavorful and tasty, and not too oily (something that happens often in this town with Chinese food, sadly). Could not stop eating the green beans, even my four year old liked them. For those who use this metric for their Chinese restaurants: every other patron there was native Chinese, both students and older folk. Parking is free, easy and plentiful. \n\nAs others have said, the interior is the exact same (they even still have the beanbag toss game out on the patio and the 'lucky' rock in the lobby from when it was Rock's) just with a bunch of tables thrown in but I'm sure that'll change as it gets established.\nThe serving staff was efficient (might have to point at the menu item you're ordering) and quick with the food, which was piping hot and obviously freshly made, and quite friendly with my son when he practiced his Chinese on them. \n\nAll in all a nice time, excellent authentic food, easy parking close to campus and convenient hours. Give it a try, you won't be disappointed.","useful":2,"funny":0,"cool":0},
{"review_id":"dT0DuDfFNDX9BnPETiH5ZQ","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"PTQVaWA-I5ZLzwy5oBbVMg","stars":4,"date":"2014-06-05","text":"The bread here is so good. Got the baguette from a place that sources their bread from Pekara and froze it. Reheated it in the oven two days later (16m on 375,  if you're wondering) and it was so good I just ate it plain. Made the best garlic bread from the rest. One star removed for sloooooow service and rather overpriced selections of other things, but man their pastries are good. Sandwiches can be hit or miss and heavy. Ambiance is typical locally-owned college town coffee shop, with eclectic furnishings and local art on the walls etc. Outdoor patio seating is great for nice days. Very walkable location, not so much driveable, parking is limited and metered.","useful":0,"funny":0,"cool":0},
{"review_id":"UgUfDGPcvLl8e-IPZl_8uw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"9SJ5sTileHeLXVMJrQiEDQ","stars":5,"date":"2013-01-11","text":"My go-to place for documentaries, kung fu films, obscure 80s cartoons and everything else hard to find that you don't want to watch in stuttering grainy footage on youtube. If you like foreign films there is no other place, period.","useful":1,"funny":0,"cool":0},
{"review_id":"hHZIU19wYXRGd8tbB8AAHw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"uGxZdLLgMQDvFSqiXyCg_w","stars":3,"date":"2013-11-14","text":"Tried the lunch buffet (takeout). Cheaper than other Indian places in the area but due to the small location size less variety of food as well (half the buffet table is salad bar\/dessert\/sauces), so it evens out. Nice touch: they weigh the buffet takeout, so you don't have to pay the full price if you don't load up.\n\nNaan: just ok, but I did get takeout so it might've suffered a bit in transit. Naan is best fresh and hot.\n\nveggie korma: very good, nicely spicy, good flavor, vegetables were good quality.\n\npekora: nicely crunchy even after sitting in a styrofoam box for a few minutes, little salty.\n\npalak chana: good, nicely spicy and flavorful, right thickness of sauce\n\nkidney bean chickpea thing I forget the name of: kind of bland, I usually expect more fire in this dish.\n\ntandoori chicken: not great, surprisingly. It was dry and surprisingly hot (spice wise) while being less flavorful than I'm used to. Maybe it'd just been sitting around for awhile (its hard to make dark meat dry!)\n\nlemon rice: yellow rice with fried peanuts in it. I liked the peanuts, gave it a nice crunch, but didn't really taste anything else flavor wise; could've just been plain old basmati rice.\n\nchicken curry: ok, this is why this place dropped a full star. The chicken curry is bone in, which would be fine if it were whole bone, but the bone is cleaver-chopped, which leaves tiny shards of barely-detectable bone EVERYWHERE. Seriously I was picking through this thing like I was dissecting in a lab to make sure I didn't kill myself with every bite. I don't even remember how it tasted. I realize this is 'authentic' but so is using a cow-dung oven to make naan and I'm betting they don't do that. Debone your chicken curry, you're gonna get sued.\n\nThe interior decor is really quite nice (a huge change from when it was Wonderdogs, you won't recognize the place), the music wasn't too loud, there was a refreshing lack of tv blaring in the corner, the proprietors are very nice and conscientious, and things were moving along well in such a tight space (you're not going to like it at lunch rush if you're claustrophobic\/have a phobia of strange people bumping up against\/brushing by you). The vegetarian dishes are better than the meat dishes, and I didn't try everything available on the lunch buffet (two or three more items, a lentil soup, desserts (mango custard sounds really good but I didn't want to mingle flavors).\n\nFeels like the vegetarian dishes were better than the meat-based ones, and there is plenty of vegetarian on offer. Wish they'd add samosas to the buffet. Overall I'd recommend it if you want Indian buffet but don't want\/don't have time to leave campus, just avoid the chicken curry, especially if you're feeding kids or something.","useful":2,"funny":1,"cool":0},
{"review_id":"744NkTDbevC60rnR6pqDXw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"poDxgsg-i02WzqBujqEm-A","stars":5,"date":"2012-02-08","text":"This place is nice, always busy  (its also a gym), the therapists are friendly, listen well, joke around with you, but really know their stuff. The Mettler Release Technique is freaking magical. I have adhesive capsulitis (frozen shoulder) and had surgery to repair a torn rotator cuff which may well have caused or contributed to it, and Jeff (mentioned in the review above) decided to give MRT a try. \n\nThe effects were immediate; keep in mind this shoulder had been affected for two+ years, and suddenly  after only a few minutes of manipulation I was able to move it further than I'd been able to before with much much much less pain, and this improvement didn't go away after a few hours as it often did with conventional massage. I would strongly recommend anyone with mobility issues due to scar tissue who is considering surgical intervention to at least try this first. I was a complete skeptic going in. I'm writing Paul Mettler a fan letter now.","useful":3,"funny":0,"cool":0},
{"review_id":"mER2F7We6w4pYF16C_5VVA","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"lZ0W0-pQyS35ahsrZezNiw","stars":4,"date":"2009-04-17","text":"This is my go-to place for organic and pastured meats. Prices are better than Strawberry Fields, sometimes by an order of magnitude, the selection is usually wider and they are less likely to be sold out of the stuff I want. Produce is pretty nonexistent yes, they sell out of milk fast but if you're in need of sugar substitutes or hard to find herbs and spices they are awesome (check back in the back by the bulk foods).\n\nAlso the lunch counter makes awesome sandwiches and very good Thai food (owner's husband is Thai and used to operate one of the best restaurants in Bloomington, I think it was). I like the noodle soups especially.","useful":2,"funny":0,"cool":0},
{"review_id":"YrvCFQdYdz-7iTPSbz-KGw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"pJlHbIoePemy_wQVpWTR2g","stars":5,"date":"2013-09-23","text":"Good fast Mexican food right on green st. They make their own hot sauces and have margaritas and Jarritos and horchata. Friendly guys behind the counter if you like futbol it's always on.","useful":0,"funny":0,"cool":0},
{"review_id":"kxnvf4xuW5HwYJGkyUFPXw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"D-B5LsTHJgrhsHVex4gyHA","stars":1,"date":"2015-08-27","text":"Layalina has closed; a Chinese restaurant called Schezwan Chinese is going in there now. Rumors abound about why, most revolving around unpaid rent. Goodbye Layalina, we hardly knew ye :( If you're still on the lookout for good Med food, check out Mashawi Grill on Green St.","useful":0,"funny":0,"cool":0},
{"review_id":"QK4MHeS09RkB7KNYXcMijQ","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"h2vFVV5pJjn8arA7GR6mQg","stars":1,"date":"2013-01-07","text":"Zelma's is now closed, we got one of their last five pizzas. The guy behind the counter said to look for a new place in March, they're apparently selling it.","useful":3,"funny":0,"cool":0},
{"review_id":"mSIMlz42hN42AYgN56l2vg","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"OB9fA3C-7ppMH5mZFw71AQ","stars":4,"date":"2014-06-05","text":"This store is dangerous for people who like camping gadgets. I am one of those people. I can never get out of here without some doohickey that I never realized existed before I walked in yet now cannot live without. \n\nThey have all your typical outdoor brands but the prices are a bit... pricey (fifty bucks for a kid's windbreaker, really? REALLY?) I will forgive them for this because they have ALL THE SMARTWOOL. ALL OF IT. Seriously if you have not bought smartwool socks before do yourself a favor, wait for them to go on sale and just buy them. Especially this last winter I lived in smartwool socks and tights and the medium-weight hiking socks are so thick and comfortable I use them as slippers.\n\nAnyway the sales people have always been helpful and friendly if a little harried on busy days, and if the person you're asking doesn't know something they know who to ask (go on weekends if you're looking for the hard-core grizzled mountain men type guys who know all the knots in the world and how to arm wrestle a bear).","useful":2,"funny":1,"cool":0},
{"review_id":"FGn6ERtwbaVqRTVarCLDHw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"r8R7dWTZEbJUd6gwrVsUNg","stars":5,"date":"2015-03-27","text":"These guys are great, very good with kids, eyewear selection is wide and they do free refittings (which is great when your 8 year old is as rough on his glasses as mine is).\n\nDr. Leon as mentioned previously is a man who obviously loves his job, and takes the time to explain all the stuff to curious kids who ask a million questions. He even managed to diagnose an issue in my left eye that had never before been diagnosed and explained it to me in a way I could understand (and also why lasik couldn't fix it). \n\nThey take all kinds of insurance (including university insurance) so you should be covered. The offices are lovely and cozy. They have all the bells and whistles your heart could desire if you're that kind of patient, but they also do standard eye exams and are open on Saturdays as well. I've managed to be seen same day after accidentally splashing toilet bowl cleaner in my eye and my kid managing to take a blow to the eye during a soccer game, same level of service as other days of the week.\n\nVery very happy with this place and its doctors.","useful":3,"funny":0,"cool":0},
{"review_id":"C0rsCybajVgjii4fiERhcA","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"t0f8qXrKGNWv6j8MGmosRg","stars":2,"date":"2014-05-21","text":"This place is apparently a hugely famous Korean coffee chain that's all over Southeast Asia and was brought here to cater to the foreign Asian student population. I got the Thai milk bubble tea and it was certainly... milky. There was a Thai iced tea flavor\/color to it, I'll give them that, dunno how well it mixes with tapioca pearls, and for the price I'll go across the street to Basil Thai. Everything in here was hilariously expensive. I got a blueberry muffin that could have been purchased at Sam's Club by the pallet for the same level of quality. The place is clean, the uniforms are cute, and I'm sure the homesick ex-pats will keep it in business, but for those prices vs. quality I'll be going elsewhere.","useful":2,"funny":0,"cool":0},
{"review_id":"ECIbpRt3USqughpioPIaCA","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"yLKoESPQ8BN7dn6ADzZicQ","stars":1,"date":"2014-06-05","text":"Two words: food poisoning. ACUTE food poisoning. Knew I should have trusted my instincts when I saw them prepping food on the same cutting board they had just cut raw meat on. Food was pre-cooked and reheated and still tasted overly salty and the wait was ridiculous (said 10m, waited over 20). This is the second time I've given this place a chance and the second disappointment. Won't be a third.","useful":4,"funny":1,"cool":1},
{"review_id":"v1Tx8AjdDYd_dq7CBnrM2Q","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"5_cn7M-9swHrFbnqZtYGBQ","stars":5,"date":"2015-01-01","text":"Love their pho, best on or off campus. I still remember the first time I had it, I was stuffed to bursting but still had a bowl of that delicious broth left and I honestly felt guilty about throwing it out. The rest of Thai food is serviceable but I only come for the pho. \n\nWord of warning: in the cold winter months this place is FREEZING because of a combination of the heavy foot traffic leaving the doors constantly open and the location in the mini mall. The doors face right into the wind which is funneled right down that corridor like a wind tunnel.  The inside is also always cramped and packed though turnover is quick so tables tend to open up regularly. I would do takeout a lot more if it wasn't such a hassle for pho (multiple containers to separate the noodles\/broth\/garnish and you need a big Chinese soup bowl to put it in once you get where you're going). \n\nThe folks behind the counter are great friendly but busy so don't expect a lot of chitchat at lunch rush. They do speak Thai and you will get major brownie points if you can summon up a friendly sawat dee or kup kum krap\/kah.","useful":0,"funny":0,"cool":0},
{"review_id":"EZqOo2RnL0S0Bsf5TC8b8w","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"Pj8n8jDPRdXi7RdOABJkWA","stars":4,"date":"2014-04-25","text":"Wonderful pizza, wonderful people. If you are a Chicago native and like stuffed pizza, order here. If you are not a Chicago native and don't know wtf a stuffed pizza is, order from here. Know that you will be waiting 40 minutes. They make it when you call, none sitting around. I'd pick it up, the drivers will go just about anywhere but you're adding on delivery time that you could be spending eating fresh hot pizza. This is not a sit down place, its counter only, but the owners are pleasant and chatty, the place spotless, and the pizza is awesome. Try the dessert pizza too.","useful":1,"funny":0,"cool":0},
{"review_id":"VVH-ob1Zq6IOaC9psr0RPw","user_id":"cIOG8YUui6r4cMaxzDFBfg","business_id":"L2DONYpn0IjFvVGaZ9bZpg","stars":5,"date":"2015-05-19","text":"I really enjoyed my limo service with bell the driver Dave was sure pleasant and knowledgeable about the area . I will be checking out on Thursday  and we have had a blast here.  Will call bell again. Thank you","useful":0,"funny":0,"cool":0},
{"review_id":"1ssVMW2q8dU9_TvFJltbtw","user_id":"742Gsec3pKTQ7z0BYI_DrQ","business_id":"r3Xx9Qk3xAMzYGIGFBcKpQ","stars":4,"date":"2011-06-08","text":"Enterprise's customer service blew us away.  We arrived on Easter Sunday to a clean facility, short line and speedy assistance.  The counter rep was friendly and helpful,  and we were welcomed with a courteous greeting and bottles of cold water when we went downstairs to pick up our car.  Another rep showed us several cars  to choose from and answered our questions with patience and professionalism.  Returning the car was just as easy.\n\nI removed one star because the rep made a point of emphasizing that Arizona is a \"no-fault\" state and we'd be liable for lost use of the car if it landed in the shop, regardless of whether the other driver was at fault.  With over $200 in added insurance and a $10 a day upgrade, our original weekly rental of $197 burgeoned into well over $525.  \n\nI don't blame Enterprise - we should have researched our liability in advance.  But they do prey upon travelers' anxiety when they're eager to hit the road and start their vacations.  It's a scam.","useful":7,"funny":0,"cool":0},
{"review_id":"dAL1NleAVIaqDGxp_mlhpg","user_id":"UQnP-Qpt8GUouWaCi9V30w","business_id":"9vG7UBYjYLDNb3VS1EZqEw","stars":5,"date":"2016-11-08","text":"If you have never tried laser or are just looking for a laser place look no further than Simply Skin! This place is amazing from the staff to the laser. I moved from California and was in need of a laser place and I stumbled upon Simply Skin. I was nervous but it has been the best decision I have made. They are super nice there and make you feel super comfortable. Let's talk about the laser machine now. It is painless and has gives you results!","useful":0,"funny":0,"cool":0},
{"review_id":"WYUgKU6j7SP8PCXHHB4itw","user_id":"UQnP-Qpt8GUouWaCi9V30w","business_id":"YrKjO9jFZrsgpIbSSLSHRA","stars":1,"date":"2018-01-02","text":"Avoid this place and Avoid hairstylist Irina!!! Save your money. I asked for layers and my hair was butchered and uneven! This is what I ended up with. Who cuts someone's hair like that! I also had my bottom ends dyed grey and no grey was noticeable. I ended up with orange\/copper hair. I called to speak to the manager I was told I would have to wait a week to speak to the manager!  Wtf!","useful":3,"funny":0,"cool":0},
{"review_id":"TmoDDrtQ-aURU1c3rqRCHQ","user_id":"qkwlgXLO5HtqrtA6-HN4ZQ","business_id":"RFXvcu83or4KG7mcjWaUKA","stars":4,"date":"2016-08-03","text":"Overall very Good experience at the store. Rep was helpful in walking through the item I was looking to purchase. Had discounts with the bestbuy program as well. Have the product installed and see it working like a charm.","useful":1,"funny":0,"cool":0},
{"review_id":"E5Muz67N4RvsJOVDyF5t6g","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"7zW2T9P0kgzO11F30HWvjg","stars":4,"date":"2016-02-21","text":"Very nice, new boutique for men and women.  Worth stopping by and the customer service is great. Dresses, tops, shoes, bags, coats, and a very nice selection of perfumes.","useful":0,"funny":0,"cool":0},
{"review_id":"JpcIJjTX7tyMMq79PQMyEQ","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"iKMLsX1Je7P3wAOEc9scDg","stars":4,"date":"2015-09-09","text":"Came here for brunch.  Everything was very tasty - deviled eggs are outstanding and the salmon equally good.  Service was quick and courteous","useful":0,"funny":0,"cool":0},
{"review_id":"RYQVDR1cNXpf_vfn1nT3LA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"nPScIPiMb3hy1CnrLfEZuQ","stars":5,"date":"2015-11-07","text":"This place is the best for shoe repairs. Brought In a pair of Jimmy Choo's and Manolo's and they made them both look like new, including new soles and polish, etc.  I was ready to throw them both away they looked so bad. They also do a great job of putting rubber soles on brand new shoes that don't already have them (to avoid slips) and it doesn't take away from the look of the shoe. Highly recommend this place.","useful":2,"funny":0,"cool":0},
{"review_id":"_qSZqFuPeRhFX9TKv7DlKg","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"kYD9E14AijONhJ7rFsyLrg","stars":5,"date":"2015-04-11","text":"We came here for dinner and the service was outstanding and the food was just excellent.  This restaurant is a hidden gem!","useful":0,"funny":0,"cool":0},
{"review_id":"u7FA0sWOM_BbtJx4aLPp3A","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"GcxE5hK_TaHP4EZFDYz2mg","stars":4,"date":"2015-08-01","text":"We came for the Sunday brunch.  It's expensive but you can skip lunch after eating here.  Great variety - typical breakfast food like omelets , a variety of cheeses, breads and fruit but also has crepes and nice salads.  They also bring six different meats to your table - the Chicken Parmesan was my favorite (even better than the beef).  It costs $30 per person - I would recommend this for a nice brunch with lots of variety.","useful":0,"funny":0,"cool":0},
{"review_id":"UjxKe9a9tdGHC1iCfSOaKw","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"_BnBjRMt5Ba-TAv07r3fyw","stars":4,"date":"2015-11-14","text":"Service was outstanding.  I ordered pasta arrabiata and it was quite good.  The coffee is very good here too along with the pizza crust.","useful":0,"funny":0,"cool":0},
{"review_id":"r_2zT5Jw9GGQMFCxP9ps7A","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"dsIHIXyAl_ldqkd8QekvTQ","stars":1,"date":"2015-11-14","text":"I walked in here to try it and had a Greenhouse Juicery bottle in my hand and I was asked to put it away.  Please.  I was immediately irritated.  In no way was my juice going to take away from the business I gave to you - until you said that.  Then I ordered less simply because of the rudeness.  Your food is nowhere in the same league so you should take whatever business you can get and be glad anyone stops in.","useful":0,"funny":0,"cool":0},
{"review_id":"m0dZSmXPWlDJ_VGgCWZa9w","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"r48H_sNUGmcRGX1LsEc2mg","stars":3,"date":"2015-11-14","text":"My husband and I came here for appetizers and drinks only.  Reasonably priced, nice interior, accommodating waitress, and food was pretty good.  It wasn't anything fantastic but I'd return for a decent meal.  The drinks we ordered were small, however, and not that much bigger than a shot glass it seemed.  Maybe it was just the type of drink we ordered but the glasses were quite small.","useful":0,"funny":0,"cool":0},
{"review_id":"ETxzxCzbn4yap2tllojINA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"UH6mET5JYZR6yPDVpTG9Og","stars":4,"date":"2015-05-22","text":"The turkey meatballs are delicious!  Nice atmosphere and good service.  We'll be back!","useful":0,"funny":0,"cool":0},
{"review_id":"C_4oDIZpo-PP7miUhrSPnA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"fCpPsX76xgs4BKLe_uxAMQ","stars":2,"date":"2015-09-07","text":"Had two chicken tacos with cheese, lettuce, guac, and the mild salsa.  Tacos are good but nothing special.  Typical fast food.  Walk a little further west to Wilbur Mexicana on King Street past Spadina if you want much better Mexican that is fast and reasonably priced.","useful":0,"funny":0,"cool":0},
{"review_id":"r35AtF1luGvnojz7js615w","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"UxWH8zRYIBgs6Q2oykvRdw","stars":3,"date":"2015-09-09","text":"Came here for brunch and had the mushroom and artichoke omelette. It was very good and served with a small salad. Very nice atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"-mKxNOVHiQQhDpteGtH1pw","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"a8pmtlVKf7NiSLI-4KejIw","stars":4,"date":"2015-08-01","text":"Nice place to eat on a patio in the summer.  We ordered the guacamole which our waiter said was the best.  I wouldn't say it was the best but it was quite good.  Our dishes were also tasty and we didn't walk out of this restaurant feeling stuffed (unlike most Mexican restaurants).  The mojitos are excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"7MBS2ZSO0Lcx4GwOasyDGA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"tEfmHuo_dNanyTaC5PyoOQ","stars":3,"date":"2015-11-08","text":"Food was very good.  My friend had the torn pasta and I had the roasted pickerel.  Portion sizes are good and you don't feel stuffed after the meal.  For some reason I didn't think it was fantastic though.","useful":0,"funny":0,"cool":0},
{"review_id":"qUg0mKZBlbmqHGMpfvKlxA","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"5nie8WoCB-MpEYT5uE6t4A","stars":3,"date":"2015-11-22","text":"Came here for lunch and had the spinach salad with salmon.  I substituted the creamy garlic dressing for a balsamic vinaigrette.  The salmon was very good and the salad equally tasty. Reasonably priced for lunch and not a massive portion - just right.  Atmosphere is just average.","useful":0,"funny":0,"cool":0},
{"review_id":"PAwIQc10vVpnedCA33R1SQ","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"6md5a6HzI8oKkBTaOecygg","stars":4,"date":"2015-11-15","text":"This restaurant has a great ambiance no matter what meal you are enjoying or even if you're just having a drink.  I've eaten breakfast here as well and everything was very good and the service was great too.","useful":0,"funny":0,"cool":0},
{"review_id":"t3SECSreDW24T4al2ppJHg","user_id":"aBXJK7fk2GDhDmgJEKiBeA","business_id":"tqgDsKlKdH73HVs5jxfemw","stars":5,"date":"2016-02-21","text":"Love this store.  All of the best brands in one place including some very unique ones you won't find anywhere else.  The best women's clothing boutique in Toronto!","useful":0,"funny":0,"cool":0},
{"review_id":"mQfl6ci46mu0xaZrkRUhlA","user_id":"f638AHA_GoHbyDB7VFMz7A","business_id":"RESDUcs7fIiihp38-d6_6g","stars":5,"date":"2017-09-09","text":"This buffet is amazing.  Yes, it is expensive, but it is worth the splurge.  I recommend that you look at everything first and then decide what to get, because you can't possibly try everything.  I missed an entire corner of great food that I didn't see at first, and then I was too full to eat more. I like how everything is on little plates, bowls, or baskets, so everything doesn't get mixed together.  Lines are long, but you can check in and then they text when your time is almost up.  The wait time was less than they had said it would be, so don't go far away to wait.","useful":0,"funny":0,"cool":0},
{"review_id":"6VXTrqmjF1tNNIkYNcvycw","user_id":"f638AHA_GoHbyDB7VFMz7A","business_id":"I_ZfddXlWIY-PIltZPVarQ","stars":1,"date":"2015-10-28","text":"I wish I had read the reviews prior to hiring this company to conduct an estate sale at my two vacation houses that are located side by side.  DO NOT use this company!  An estate sale is usually held at a time of stress, death, or moving to a retirement home, when you are vulnerable. That was not my situation, but she CANNOT BE TRUSTED with your family belongings!  Both houses were complete turn-key rentals with all furniture, décor, household goods, linens, etc.  Some of the items were exquisite, especially compared to the other sales shown on her website. There was a mix of things and various quality and values.  I had already conducted three of my own estate sales for other vacation homes that my company was emptying out, and I didn't have time to do another sale. I made a lot of money at my own sales, and I know what stuff sells and what doesn't.  I am also an avid estate\/garage sale shopper, so I do know prices. I was going out of town, so I thought this was a great idea - WRONG!  I feel scammed and robbed.  So many things went wrong -- I can't possibly list them all here.  Numerous people told me later that they had been at the sale and said it was very disorganized, nothing was priced, she was on the phone all the time, was just stuffing money into her overalls and not accounting for anything at all!  She doesn't say what she sold major items for (even though I had set minimum prices), provides no accounting whatsoever, and she brought over a lot of her own JUNK to sell.  I think she keeps stuff left over from other sales  (she says she donates it), and then she sells it and pockets the money herself, mixing up the funds of her clients.  Damage was done to both houses from people moving furniture, the carpets were filthy, and items were stolen, including a fixture from the shower!  There were only 3 people working both houses and she had told me there would be 5 -- 2 people at each house, plus herself.  How else could you make sure people weren't stealing stuff, if there is no one there watching?!  Something doesn't add up about this company, and I cannot believe she is still in business.  She also doesn't tell you what the extra fees will be for signs, email blasts, etc.  Very deceptive.","useful":16,"funny":0,"cool":0},
{"review_id":"VSwyN265HuHDDvZ3TAYGfg","user_id":"f638AHA_GoHbyDB7VFMz7A","business_id":"ajoqEHnCZTD8-8GqGLq9-Q","stars":1,"date":"2016-06-26","text":"I live in Las Vegas, and last week I stayed at the Palms for 3 nights for a \"staycation\".  I made the reservation online and paid with a credit card.  When I checked in, I was told that because I am a local, they thought I might be having a PARTY in the room, so there would be a $250 PER NIGHT security deposit, for a total of $750.  I am a single 58 year old woman, not a 21 year old party animal!  The $750 was charged to my credit card, not as a hold, but as an actual charge, and it will take several days after check-out to be credited back to my card.  I did not rent a big suite and the room I had was certainly not big enough to have a party.  The Palms is known for their big party suites--why else would you rent a big party suite if you were NOT going to have a party?  According to their logic, locals might have a party in their room, but tourists pack 6 guests in their basic small room and that is NOT a party?  It's the tourists that come here to party!  If I wanted to have a party, I would have it at my house, not a small hotel room with no refrigerator!  Why was the security deposit $250 PER NIGHT?  Obviously, when the maid cleaned the room after the first and second day, she could see that I had not had a party there the night before.  I am thoroughly insulted and will not stay at the Palms again for my next staycation.  Also, the resort fee of over $30 is a joke.  I know all the hotels here do it, but why is that legal?  Since it is not an optional charge, it should be part of the room rate.  It doesn't even include decent WiFi.  You have to pay extra to get faster than a 1 mg speed.","useful":2,"funny":0,"cool":0},
{"review_id":"W_2oPUFaToK26U8JW88lkQ","user_id":"-wVPuTiIEG85LwTK46Prpw","business_id":"4L3VJwVqUareUUIGPE2zcw","stars":4,"date":"2013-01-14","text":"Oh man, the interior of this place needs a Gordon Ramsay make over.  It kind of looks more like an office rather than restaurant.  I ordered take out, and the food was surprisingly delicious.  Bhuna gosht and Daal masala were great with the garlic naan.  The basmati rice (ordered seperately) was also very flavorful.  If anything, the lamb was slightly overpriced for the portion.  This place needs more customers!! Gotta try it!","useful":1,"funny":1,"cool":0},
{"review_id":"EJ7DJ8bm7-2PLFB9WKx4LQ","user_id":"-wVPuTiIEG85LwTK46Prpw","business_id":"RESDUcs7fIiihp38-d6_6g","stars":3,"date":"2013-01-14","text":"I was really looking forward to this but it was a slight let down.  Most of the food was good.  Asian food section and meat selection were great. Seafood area was very limited compared to what was advertised on yelp and their website.  For $50.99 per person on a Saturday night, I would rather be at The Buffet at The Wynn with beautiful flower arrangments surrounding me.","useful":0,"funny":0,"cool":0},
{"review_id":"Lq-199kDbbx3i-ocDFWmoA","user_id":"-wVPuTiIEG85LwTK46Prpw","business_id":"65eDIQ8bpMJFtgdyX7ulVA","stars":4,"date":"2013-01-19","text":"Once again, yelp has not failed me.  This place has great food.  The meat was tender and very flavorful, and the salad was fresh with the dressing spot on.  They were very accomodating to a last minute order change.  The baklava was a perfect way to end the meal :) This is one of those places that I want to try everything on the menu :)","useful":0,"funny":0,"cool":0},
{"review_id":"G5rCnBz7ubdkNiWGQdN3Gw","user_id":"-wVPuTiIEG85LwTK46Prpw","business_id":"M51gw2cz_vXarNBLbKkOxQ","stars":5,"date":"2013-01-14","text":"This is my favorite breakfast place in town and it never fails me.  Service is always top notch.  I like sitting at the counter watching the food come out.  If you feel like indulging, try the Monte Cristo. Its a turkey, ham, and swiss sammy in french toast batter deep fried.  Dipped in syrup and you're in heaven!!  If you feel like a healthier option, go for the Veggie Benny.  Avocado, spinach, grilled tomatoes, two poached eggs smothered in hollandaise.  One of the best benedicts I've ever had!","useful":0,"funny":0,"cool":0},
{"review_id":"V2zdPn3b1WMCjy7Qcm-n1w","user_id":"-wVPuTiIEG85LwTK46Prpw","business_id":"saQQmDQQJ14BVkm_sg53UA","stars":5,"date":"2013-01-14","text":"Thank you yelp!!! I am so glad I found this little market.  Perfect place to find all the middle eastern spices I need for cooking.  The restaurant inside has amazing food.  Just perfect for my random kabob cravings.  The KGB is to die for!!! Two juicy koobideh kabobs on a big flat bread with onions, grilled tomato, and a ton of fresh basil($9.99 ).  I noticed when I dined in the food was on the slower side of coming out.  I prefer ordering ahead and picking up.  Mmm can't wait to be back!","useful":0,"funny":0,"cool":0},
{"review_id":"-1kHrfS1En061JnBt_xUnA","user_id":"7-wMHgWs8s94p7eEg6TQAw","business_id":"DKZN5IjHEE_BCDCRLxb7sQ","stars":5,"date":"2017-04-11","text":"We recently had an amazing catering experience for our 75 person party with Mykonos Grill. This was the first time we hosted such a large event and Peter clearly showed that his primary concern was the success of our party. He was extremely helpful, offering lots of tips on how to best serve and arrange the food with so many people, and never made us feel rushed anytime we stopped by or called with a question. The food was delivered on time and was a huge hit with our guests, everything was delicious! We've dined in the restaurant before as well and both the service and food were excellent. We couldn't recommend this restaurant enough.","useful":0,"funny":0,"cool":0},
{"review_id":"HpnkC9ILQ0NPpC2CKGelPg","user_id":"7-wMHgWs8s94p7eEg6TQAw","business_id":"oa8TWxieXRqMJzlEwIBUyQ","stars":5,"date":"2017-10-18","text":"I had the most AMAZING experience at Habibi Day Spa. With just one week left before my wedding, and I booked a last-minute facial with Salisa. She was extremely professional and caring, and did an amazing job with my facial- my skin was glowing just in time for my wedding! Salisa really cares about her clients, and she really personalizes each service to the needs of her client. The salon was beautiful and conveniently located. I will be back soon!","useful":0,"funny":0,"cool":0},
{"review_id":"-OMLGmPZFWzfCkSUSVV6CQ","user_id":"G2XNBerSAEzfLiSPaPY-Rg","business_id":"wgoCMZXYoIj2vcxB4GjePw","stars":5,"date":"2012-06-15","text":"Best poker room in Arizona. There are big screen TVs every where.  Food is great and staff were friendly.","useful":2,"funny":1,"cool":0},
{"review_id":"Gn201sHmVag6w0hbIe2mAw","user_id":"ROw7gCGzmg093vdNs8mrbQ","business_id":"S-ATWNuhGzFBV1Na3o47CA","stars":5,"date":"2014-08-11","text":"Stu is the man! Got to us fast, great service, awesome rig and just a kool guy. To top it all off he took my buddies dual sport, with a flat , to a friend of his to get him back on the road after all the other places were closed on a Sunday. Stu's friend got it all done fast. Will definitely keep Stu's number for when I come through with my bike. Highly recommended Keep it up stu!","useful":1,"funny":0,"cool":0},
{"review_id":"RT20_fUNJJNqMNvvjviNbQ","user_id":"ROw7gCGzmg093vdNs8mrbQ","business_id":"9NBkIExYYz3w9O5JdzDOMA","stars":1,"date":"2013-11-03","text":"Hit or miss. I used these guys twice in a day and the cab out was great! Called them when I needed to be picked up and was told 20-30. I waited 55 minutes and then saw the cab cruise by not even looking for a pick up and no stop, no call nothing. So I call the dispatch to let them know and listend to the driver flat out lie to dispatch that I was not there to pick up. Dispatch told me I had to wait for another cab because the one that just drove by was unavailable.  He was sitting at the light on the other side of the lot. On top of that, $20 to go 4 miles? I'll be renting a car tomorrow.","useful":1,"funny":0,"cool":0},
{"review_id":"nQrMfkrvASlcJfACj8Phtg","user_id":"46UF55A26vVfChgAsACM5g","business_id":"7VMQOcu_ZitkulsDsvegZw","stars":4,"date":"2013-09-16","text":"I received a competitive price and good install on a kenwood head unit.  I would go back.","useful":4,"funny":0,"cool":2},
{"review_id":"o8w3-PlnZthHsr_zv8gW7A","user_id":"46UF55A26vVfChgAsACM5g","business_id":"GvKx1QL6XLyMZnWZun1DPQ","stars":4,"date":"2013-05-27","text":"Excellent place I visit every time I am in Waxhaw.  Come early, it gets full quick as here is limited seating.  Pork chops are to die for!  If you leave hungry it's your own fault!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"A1DJ_VhRUMLqbLlWcrIQjw","user_id":"46UF55A26vVfChgAsACM5g","business_id":"ireHTdAh1d4lmGiieMfV_A","stars":4,"date":"2012-11-11","text":"Bailey's is a great place to hangout and play some pool and have some great pub food.","useful":0,"funny":0,"cool":0},
{"review_id":"t3whVRDgtKNUEakSuSjUsA","user_id":"46UF55A26vVfChgAsACM5g","business_id":"ewaHMKX-W0zatENPv2oQRg","stars":5,"date":"2013-10-23","text":"You will be hard pressed to find a better burger.  The menu has changed recently, I recommend over other similar sports bars.  ThIs location and the rock hill location really care that you get good food and service. You will get a hand pressed half pound burger here, not a frozen thin excuse for a burger that other places give you.  If you don't like what you get tell them, they will make it good, just be nice and honest with them.  They do listen to the customers!  I am not alone there are many regulars I see each time I visit.","useful":0,"funny":0,"cool":0},
{"review_id":"V1xkfp0vU1Jwk-w_6nG3AQ","user_id":"46UF55A26vVfChgAsACM5g","business_id":"6YGQcH6v5ndd-Q4ovVRLDQ","stars":4,"date":"2015-05-10","text":"I have visited a few times now and I have enjoyed the food every time.  The last visit I had to wait a bit too long for my drinks.  Waitress was talking with co-workers and texting, Manager was right there watching.. So we made our drink and dinner order at the same time...since we had plenty of time to look over the menu.  Smoked brisket is excellent (my favorite).","useful":0,"funny":1,"cool":0},
{"review_id":"Tvf04RByyzkBSPFqK3IibQ","user_id":"46UF55A26vVfChgAsACM5g","business_id":"Hx6HNJfEGgllQ3-dyoNDbA","stars":5,"date":"2012-11-12","text":"You must have the Chili.  It is served Texas Stlye, no beans, with several types of meats.   Awesome!   The bowl serving could be larger, but only because it was that good!!","useful":2,"funny":1,"cool":1},
{"review_id":"-j7YpQMiFhVOjlY_6n5hCQ","user_id":"46UF55A26vVfChgAsACM5g","business_id":"tIiiq23utFKTs1At2bVD6w","stars":4,"date":"2013-09-29","text":"I had a very nice meal at this establishment.  The entire staff really cared that our table had a good dining experience.  The manager visited our table shortly after the food was delivered (I really like to see this), followed by the waiter.  Everyone at our table enjoyed their meal.  Pasta was cooked to perfection.  The restaurant is small so arrive before the dinner rush.  Gets a bit noisy as the place fills up.","useful":2,"funny":0,"cool":0},
{"review_id":"RgnLQSPxYCVkCVRIZNL8qw","user_id":"46UF55A26vVfChgAsACM5g","business_id":"X-uKQqs0y_2TnPGG24fIBA","stars":4,"date":"2015-05-10","text":"Dad and I are members.  Always very good service.  Just get confused on who we report to, who we pay, etc.  we have to check in\/out with 3 different people when visiting the range.  My recommendation is to streamline this process a bit.  ID card to scan would be helpful.","useful":4,"funny":0,"cool":2},
{"review_id":"AxHK5OzqvWnMwcI7YJBkBA","user_id":"46UF55A26vVfChgAsACM5g","business_id":"D2ojX9bvE0_-aIj9BhdZZA","stars":4,"date":"2013-09-29","text":"The wife and I enjoyed our lunch very much.  You will receive the freshest food here.  The pimiento cheese spread is to die for.  Try the shrimp BLT panini it is fabulous.  If you like burgers give them a try too.","useful":0,"funny":0,"cool":0},
{"review_id":"juXuh2tOmkPj1LJBe9wQKg","user_id":"46UF55A26vVfChgAsACM5g","business_id":"6PHMvoJwpIyr4G3huULuWA","stars":5,"date":"2013-06-23","text":"This place is awesome!   Pizza is Authentic NY Style.  Cecilian Itialian at it's best.   I love the sauce!   The meatballs are huge, the lasagne melts in your mouth.","useful":1,"funny":0,"cool":0},
{"review_id":"n_lCTGMsZ1kA-v0Xu2cB_Q","user_id":"U0VDv2GkSBN5y2MEpLWdeQ","business_id":"Bzno2_Ntqaag-set2rkiSw","stars":1,"date":"2013-04-26","text":"Awful.  No parking, rude customer service, and wonky computer system doesn't submit online reservations.","useful":6,"funny":2,"cool":0},
{"review_id":"W5r3im_DrwSCdgsgZeSyCw","user_id":"U0VDv2GkSBN5y2MEpLWdeQ","business_id":"R6eKPg16ha-RmF9Zux1ZBA","stars":1,"date":"2012-04-26","text":"Old folks home food, generic, institutional food service quality-and over priced to boot.  Your grandma will love it if she's not on a fixed income.","useful":1,"funny":1,"cool":0},
{"review_id":"qfuEMceYiB1IzhZkFSwpgg","user_id":"Xu6kxX18Uv14MSZTY7PSgw","business_id":"v1DdKUcs-KxR3JV_vE8nMg","stars":1,"date":"2014-12-04","text":"If you are female I would not recommend this place!  Stay away service contracts etc added in after being shuffled through 5 salesmen!  Really it is the epitome of the \"old car\" sales place!  If you like that sort of thing this is your place if not there are so many other places to give your money!","useful":3,"funny":0,"cool":0},
{"review_id":"1dartEoF9n7-Fcgx7DWilA","user_id":"Xu6kxX18Uv14MSZTY7PSgw","business_id":"xmgLfJ5Jo6hHjY61hzO_EQ","stars":1,"date":"2014-03-13","text":"Went on a Sunday and the gal did not use sanitised tools!  Ok If nothing else the cheapest thing is to be clean!!!!!  It takes one time to get some kind of infection and lose a finger.  I think the owner was not there that day so I hope she reads and takes care of this problem!","useful":0,"funny":0,"cool":0},
{"review_id":"cIyDRhWeHtZ_pDQBe4sG8Q","user_id":"zdG-3ABz7-mv1P3cs2_Rfg","business_id":"xkiYAerQQXL25legNhVsSw","stars":4,"date":"2015-04-26","text":"The pizza was ok and the chips as an appetizer were good. Anna our waitress was very pleasant and did a great job!!!","useful":0,"funny":0,"cool":0},
{"review_id":"tYmdSXu5_cAHrTG9W3e1Ow","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"deipWwvNQm5DMmfpq9tNoA","stars":4,"date":"2015-09-08","text":"Pretty awesome Thai food. Can't say more than have the fresh and spring rolls and as much pad Thai as you can get your hands on!","useful":2,"funny":0,"cool":0},
{"review_id":"raFaUIfZrmZVby7Tb6kn2w","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"225qTLqhdBmJskUEr76Kww","stars":4,"date":"2015-09-08","text":"The perfect joint to bring a book (Or a comic book) and enjoy a coffee on a cold winter day. Although the atmosphere is perfect, the coffee could be better","useful":0,"funny":0,"cool":0},
{"review_id":"vLD_YEzQYfQhkRQThC4aTg","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"tIvDO_1WNbb6UAifErQ-Ug","stars":5,"date":"2015-09-08","text":"My favourite cafe in Toronto. Great coffee with flourishes of that little something that most coffee joints miss. With enough attitude to stand out but stay cheery, I'll never stop going to Balzacs","useful":0,"funny":0,"cool":0},
{"review_id":"bsARmqAZY0C7uXkz5nO_oA","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"E_Qr3fQrZCwOvEnEDYT4Kw","stars":4,"date":"2015-10-11","text":"Great decor and atmosphere for a party but with all the music and chatter, there's not a balcony to escape the noise.","useful":0,"funny":0,"cool":0},
{"review_id":"qPJb_4nNnG8bNgdVVPL6fA","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"XS80QAi1aYKK5v1zmKlkwA","stars":4,"date":"2015-09-02","text":"Great quality cheap and cheery sushi. The dragon rolls are to DIE for. but the chirashi needs improvement","useful":0,"funny":0,"cool":1},
{"review_id":"pcXgkvRiyxlrMPUOFMKQDA","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"fm6WsvdktoYphVMqt6Xjng","stars":4,"date":"2015-09-11","text":"Decent quality sushi, but we're in it for the beef cup, a cup full of steamed rice, veggies and most importantly braised teryaki beef. It's good and in a huge enough portion to split two way. Perfect for a cheep take out or on the run lunch, although during lunch hour, sushi lovers can get surprisingly busy, I mean it's so crowded, you can barely fit in. So without the crowd it's zippy but with, it's nauseatingly slow. Still pretty awesome though.\n\nSushi Lovers top 3:\n1) beef cup\n2) glass noodle\n3) surprisingly awesome ramen","useful":1,"funny":0,"cool":0},
{"review_id":"tG7ZdU6UruvGOTLe6Czryw","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"hm0y7QxT-UUmQcF074qV0g","stars":4,"date":"2015-09-08","text":"While very good you can't help but feel you're not wanted in the Boxcar Social, a cafe with good quality stuff, but a little too much attitude. The decor is nice though.","useful":0,"funny":0,"cool":0},
{"review_id":"q6Y_AQxUZUYXD3uWidnj2w","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"DPA9MQKkCqT0qnevsG740A","stars":5,"date":"2015-09-11","text":"Easily my favourite Thai in Toronto, Sabai Sabai's fantastic food seems effortless although creative and monstrously delicious. It really is perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"9QCaqB-eBQAqrV8Obp6_Cg","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"lDpVyjENOz_qbxbRoyBi8w","stars":5,"date":"2014-07-18","text":"Black camel is pure awesome. It's small, inexpensive and packs a crazy punch. I highly recommend the pulled pork sandwich with barbecue sauce \nand a brio. It's quick, great and convenient if you're getting off the Rose-dale subway. The black camel is THE SANDWICH PLACE.","useful":2,"funny":2,"cool":2},
{"review_id":"bYcZXAbaQUALdRVspfIqNg","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"scVd-lmZCNZHK5W75-4sKQ","stars":5,"date":"2015-10-03","text":"My favourite burger place in town, hands down. Also, their kimchi fries are to die for!","useful":0,"funny":0,"cool":0},
{"review_id":"tkv9XVLI8dH0kgjDr-J5UA","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"3cAy1gxlprn1ue0q3L_ziw","stars":4,"date":"2014-07-18","text":"Lee Chen is one of the most underrated restaurants in Toronto. It's really good, the decor is great and it's food is delicious. It's fun, cheap and really awesome. Despite some flaws, Lee Chen is great.","useful":1,"funny":1,"cool":1},
{"review_id":"bSSPOvfoM_ghNZ-9bop7wQ","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"2mKFNjIEktW2Nl1yV2cj7g","stars":2,"date":"2014-07-18","text":"E","useful":1,"funny":2,"cool":1},
{"review_id":"IEQ5cescpF4HCSmgek8sUw","user_id":"Yp0KIKTlQBlyID724QKDNw","business_id":"4_EgrMY-EI-i-xyWixI2qg","stars":5,"date":"2015-09-08","text":"Boasting great chicken potato wraps for only five dollars, and an extremely good lentil soup, Mystic Muffin is one of my Toronto staples, partly because of Elias, who's a really nice guy. This all together creates a fantastic atmosphere and great place. But the APPLE CAKE IS AMAZING! It's actually so good it's unbelievable. So mystic muffin gets a five out of five.","useful":0,"funny":0,"cool":0},
{"review_id":"m3W9P9ySyPItCJLuPAf7pA","user_id":"kqLeLZhLUt8N5ZGpHUAxFg","business_id":"XxX2LZ2o9p9Wlq7noOcfNg","stars":4,"date":"2015-06-28","text":"Nice location, pretty good food, solid service and decent prices!\nVery close to the water!","useful":0,"funny":0,"cool":0},
{"review_id":"EFTppzlh9Kt4pyBRbpVAOg","user_id":"kqLeLZhLUt8N5ZGpHUAxFg","business_id":"YAJzBGvqT3dT_qAg6u8E1A","stars":5,"date":"2015-05-05","text":"Awesome burger; perfect tacos and also the grilled sandwiches are pretty good!\nIn addition to that they have the best fries!!!\nPrices are very reasonable!!","useful":0,"funny":0,"cool":0},
{"review_id":"Lkd8R_AX1Y-6m9DGwOCyyg","user_id":"S0nSl2GbmEzW4NSout_Rhg","business_id":"bBDk37NRCuZndzgDG5j1Tw","stars":1,"date":"2017-07-19","text":"Pretty awful and cringeworthy. The restaurant is not air conditioned so be ready to sweat buckets. Food is overpriced for what you get--$45, before tax and tip, for a cocktail, a plate of nachos split 4 ways, and 3 of the smallest soft shell tacos I've ever seen. We're talking maybe 3 inches in diameter.\n\nNachos are not served with anything, guacamole, sour cream and salsa is all extra. Guacamole is also listed as \"Market price\"? Weird. Steak tacos were cold and chewy.\n\nBeware the service--likely from the owner. After our nachos he came by, tossed all of our food to the right of the table without saying anything (he knocked over the bowl of guacamole and shoved my arm in the process) and then promptly sat a family of four...right at our table. I've never experienced something so incredibly awkward and bizarre. He took our water jug, put it on their side, then took our water glasses--which I drank out of--and put it in front of them. That family somehow got their tacos before we did, ate, left, then another group of 3 came and were seated right at our table--elbow to elbow--again.\n\nNever, ever going back here. Terrible food and most awkward, uncomfortable dining experience.","useful":0,"funny":0,"cool":0},
{"review_id":"z_1A5Io1qD_xMBt5df45TQ","user_id":"GESMvmak7oGs5sQwJ1V8ww","business_id":"mtQ7Uc-j2muK0AyVQTT9fQ","stars":5,"date":"2016-11-10","text":"Food was amazing chicken crispy full of flavor mac an cheese best I have had out of all soul food restaurant I been the customer service was awesome they gave me a sample of sweet potatoe pie ended up buying 3 was truly mouth watering I will be back for sure highly recommend if u want food that taste home-made will be back for sure....","useful":0,"funny":0,"cool":0},
{"review_id":"f4hFQG0lfmnFMKqZ4iyphA","user_id":"CSs6Gs-k0x_PdnzShgOFsg","business_id":"vOyZkFAknjVg-Fwye3TKaQ","stars":4,"date":"2016-08-14","text":"My wife and I really enjoy coming to Pita Jungle for lunch and dinner.  The seasoned chicken and hummus is one of our favorites!  Service staff is always friendly and helpful with meal suggestions.  I would recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"oUf5MQ6Kdr5sJOGjgvBuLw","user_id":"CSs6Gs-k0x_PdnzShgOFsg","business_id":"sMxs2yhapicPlc0Xgy446A","stars":5,"date":"2016-04-11","text":"I recently used Arrowhead Painting to have my home painted and rear yard fence repaired (stucco finish) and painted.  Mark came to my home and we both went over the work he and his company would do.  The following day he provided me with a proposal including the estimate.  His estimate was very reasonable.  I went with his company and was extremely please with his work.  The job was very complete and his people are extremely competent.  I highly recommend his company and  I really appreciated him going the extra effort in the little things.  He and his guys took a couple of extra hours picking up after themselves and checking over their work.  After he finished, I had several neighbors come over to my home and asked who painted my home.  I proudly recommended Mark and Arrowhead Painting!  \nP.S.  Make sure you have him recondition your gates to your backyards.  He'll replace the wood slats and stain them an awesome redwood color with sealer.  He charges very little to do this after he paints your home.  You won't be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"uThrtV5tgD-xyylHvdweQw","user_id":"CSs6Gs-k0x_PdnzShgOFsg","business_id":"ilELkaycQPNo0ikN3Ec5Rw","stars":5,"date":"2017-03-29","text":"The staff is very polite and professional.  One of the previous reviewer complained about the staff but I don't believe it's the office personnel, it's the insurance coverage she (the patient) chose.  I was seen by Dr. Stone and thought she was thorough and professional.  I liked her conservative approach and wasn't just throwing out expensive treatment suggestions.  I would recommend this practice to others.","useful":1,"funny":0,"cool":0},
{"review_id":"AUVlbDD4k8GoxbPycEBs_Q","user_id":"8Cvdf7-zeGPkcv8afQ58wA","business_id":"I22wQGTkLFGn6jTOhwoecQ","stars":5,"date":"2017-01-15","text":"Food was very authentic and excellent! Best carne asada that I've ever had. If you live here or just visiting I highly suggest this place.","useful":1,"funny":0,"cool":0},
{"review_id":"y2uPL4NauaY4YBR4vPgc7A","user_id":"8Cvdf7-zeGPkcv8afQ58wA","business_id":"py85NxzGJTNfeQvqrKY_GA","stars":5,"date":"2014-09-18","text":"Beer selection is awesome and the employees were very helpful and friendly. I would highly recommend this place if you need to purchase any grocery items.","useful":0,"funny":0,"cool":0},
{"review_id":"91EiXjj_7Rw-FPOKEnRVaw","user_id":"dwx0oafyJ_CPa_mEjO_I7A","business_id":"71cDCJlVEu9qJck6MyaVFQ","stars":5,"date":"2011-07-23","text":"Super location zum Feiern.Ein oberhammer von Inhaber, der mit seiner immer guten Laune auch gerne mal spontan einen Salsa Kurs gibt und für alles ein offenes ohr hat.Wenn auch der Türsteher etwas eingebildet ist,hält es dort keinen vom Feiern ab.","useful":0,"funny":0,"cool":0},
{"review_id":"lG356_iBk1pHyNfVh9_Csw","user_id":"dwx0oafyJ_CPa_mEjO_I7A","business_id":"cgbwniQdmHwVxjdyuTm9vA","stars":5,"date":"2011-07-23","text":"hier lohnt sich das warten!","useful":0,"funny":0,"cool":0},
{"review_id":"oTsbyOsasnc6D5nD9bRf1w","user_id":"dwx0oafyJ_CPa_mEjO_I7A","business_id":"fsNiDdfm6fkMn26KZfegrg","stars":5,"date":"2011-07-23","text":"Die besten Pfannkuchen,die mir je unter gekommen sind.Ich war sehr positiv von der lockeren Atmosphäre und dem seltenen und vielfältigen Angebot an Pfannkuchen und anderen Speisen überrascht.Hier ist auf jeden Fall für alle was dabei..","useful":0,"funny":0,"cool":0},
{"review_id":"cYgFjoj6GpvX6IuyXAHtXw","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"3LWsVfsSmb_Nzbi2YQ-NIA","stars":5,"date":"2014-04-28","text":"The food is delicious. I went there with my family today and ordered the paneer chili and chili chicken as appetizers. What can i say the appetizers was absolutely amazing. Try ordering it at a level 6-7 spicy and it will burn your mouth. Loved the Chicken Tikka Masala and Chicken Jalfrezi. They also have a check-in deal for yelp for a free lassi or soda. Last but not least one of my favorites was Gajar Halwa, it was nice and warm, and absolutely amazing. The prices are reasonable and cheap compared to other Indian Restaraunts around vegas. Chicken dishes are at $14 versus other restaraunts that have them for $18. They also have huge buffet for only $9.99. The most selections for the lowest prices. Now thats what i called a indian Buffet. I would deffinetly come back here again.","useful":0,"funny":0,"cool":0},
{"review_id":"IcWBYf4oXSb27EMxoADLmQ","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"KjV_68oLLSpqR96VnV68tw","stars":2,"date":"2014-04-26","text":"First of all when you go thru the drive-thru they dont greet you at all. There food is also very greasy. And when your done ordering they never tell the total. How are we supposed to know how much the total is if they dont tell us.","useful":1,"funny":0,"cool":0},
{"review_id":"oTj5rY-WQpfb4heIFFdMvw","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"WQyGqfFKd-baBTVfZWzeTw","stars":5,"date":"2014-04-17","text":"This place is awesome. Lots of variety. Lots of different candy and sprinkles n even strawberrys. They should add more chocolate yogurt that would be nice.","useful":0,"funny":0,"cool":0},
{"review_id":"nBSZLacee6NaPuCKRf4lvA","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"riFzCvp77DMKDX-5GoTpqA","stars":3,"date":"2014-04-26","text":"The first time i came here i loved the oreo shake. But the second time they messed it up. It didnt taste like it did before. They also have the same shakes everytime. They never change the flavors or make news ones like other restaurants do.","useful":0,"funny":0,"cool":0},
{"review_id":"4YSIJYcQj6143WyQE1ID0Q","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"LNGBEEelQx4zbfWnlc66cw","stars":5,"date":"2014-04-22","text":"Absolutely the best buffet I've ever been too.. So much variety. First time I went there is like almost 4 dozen shrimps. The M cider was pretty amazing. The best part was the desserts. They so many different desserts waiting to be eaten by me. Love the different types of ice cream as well.","useful":0,"funny":0,"cool":0},
{"review_id":"2Wm9_ytkF_56LfFbCqk0ZQ","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"LwXo16VrGPhhOWc_Wj7ifw","stars":5,"date":"2014-04-17","text":"I have to say wow it completely blew me away. I ordered the chicken tikka and naan today. The chicken tikka was the best chicken tikka I ever had came with bell peppers and onions with masala on it. And the naan was so good. Everything was fresh. They make it right in front of you while your waiting. I would definitely recommend this place to friends. This is my new favorite place to eat Indian food.","useful":0,"funny":0,"cool":0},
{"review_id":"gecyhWEXzzmtQJ8fIaspjw","user_id":"SQm5TEeF_tP9QJKg1HAN6Q","business_id":"ccd6w9w81PUBmtV1DFXgig","stars":5,"date":"2014-04-26","text":"Love the sonic blast. Doesnt matter which sonic blast you pick they all taste awesome. The slushes are awesome. Very cheap too $1.08. But the only problem is that with the slush is that it dries up after your done drinking it so it becomes all white.","useful":0,"funny":0,"cool":0},
{"review_id":"zxxXDSOpwfrpwzTxEmyYWw","user_id":"PFgwxPT9VedFaIteiZWnTw","business_id":"Xav69Sc4bw2go6xm1UET5Q","stars":5,"date":"2015-10-31","text":"Stumbled into Max's looking for a brunch\/Bloody Mary spot to watch the Badger game.  This place is fantastic!  American breakfast and grilled cheese (with spinach and bacon added) were both phenomenal- and use Stella's famously delicious cheese bread!  Great bloody Mary too.  Not a ton of beers on tap, but good options.  Most importantly the service was top notch and the atmosphere is terrific.  Plenty of room upstairs, great bar, and a cozy area with leather couches and a fireplace.  Highly recommend checking this place out if you haven't!","useful":4,"funny":0,"cool":1},
{"review_id":"R3LT_fj07AdklPuiECf49w","user_id":"PFgwxPT9VedFaIteiZWnTw","business_id":"SiAUKC-pLZAhiRWw5OwnKg","stars":5,"date":"2016-12-05","text":"We had an accident resulting in a massive amount of red, green, and white\/clear candle wax getting spilled all over the carpet.  Greg & Ryan were able to come out the day I called.  They were timely, friendly, professional, efficient, and courteous.  They told me there was only an ~80% chance that all of the wax could be removed, and I appreciated the honesty.  They completed the wax removal and cleaned 4 rooms in barely over an hour, and there is literally zero discoloration or other evidence that the accident ever occurred.  The rest of the cleaned carpet looks like new.  They have earned my future business and my recommendation- I couldn't have asked for a better experience!","useful":0,"funny":0,"cool":1},
{"review_id":"ZHtkLaMn_fQxskFAIqCVog","user_id":"jH7agfowlP9TbXQHApyMxg","business_id":"4JdoQ95uXy__zoHmPhtdiA","stars":5,"date":"2015-09-21","text":"Heard about hydrocare thru a friend. Came into town to get my house ready to sell. Called Michel. No problems. Set the appt for Sunday for carpets and a large sectional. Awesome service. Everything came out better than I expected. Michel showed me his grout and tile cleaning process and I was sold. So that performed this work all on Sunday. Amazing job. Michel and Patrick are great to work with and I would def recommend them to all my friends.","useful":0,"funny":1,"cool":0},
{"review_id":"diQy3vHanT2s9qfKSE9m0w","user_id":"FhFMPorNb5A4PdTUXRUj2A","business_id":"X1twjafYxMCpKt2MqvY5Tw","stars":5,"date":"2016-07-11","text":"Great little hidden place so you might be skeptical. But once you walk in they have great friendly family style service.  Fantastic food with fresh ingredients at a good price.  Glad I randomly stumbled upon this place.","useful":0,"funny":0,"cool":0},
{"review_id":"SV6flf33qoUu4SsxracDng","user_id":"z4A1iiko20WNMW3_rPGoJg","business_id":"TH6mQqMfKATGjuW9SfoVSg","stars":1,"date":"2015-04-06","text":"I wish they didn't have to charge for lemons and jalapeño , and also someone needs to keep the men's restroom clean it's always dirty and full of graffiti. Is this to much to ask for? Anyway the food is good. Also it wouldn't be bad to replace all the light bulbs that don't work.... This restaurant is located in a nice area in Chandler, yet it seems dirty. Maybe is time for a new crew leader? Or maybe the owner is just a stingy asswhole :) good day","useful":1,"funny":0,"cool":0},
{"review_id":"Bx_j7jp6XMmow-1PIXu6lg","user_id":"uRfrT_ZiL7COPvji4YZpnQ","business_id":"JE6dUkEDIAFFtnWoq8XJyQ","stars":2,"date":"2017-08-05","text":"Couple things really urked me about this place. Every hour everyone in the whole place has to line up to have their bracelet scanned. Not easy to keep a toddler in line with all that going on. And no outside food and drinks unless you paid for a party.. ok fine, but the only choices you have to purchase from are fountain drinks. So anyone who cares about their health is screwed... not even bottled water available.. fountain tap water it is! Blah. Couldn't pay me to come back.","useful":2,"funny":0,"cool":0},
{"review_id":"rLP2fdsJpzZWHcHx2ShjJQ","user_id":"uRfrT_ZiL7COPvji4YZpnQ","business_id":"DYPURlmGYXzutAURa2q5JQ","stars":1,"date":"2013-06-10","text":"This is the first time I've ever taken the time to write a bad review for anything.. But this place deserves due credit. While a few other mothers and I were sitting across the hall watching our FOUR YEAR OLD children from a room equipped with tv screens we hear coach Shauna bellow in a very loud deep tone &quot;I told you 4 times to get over here and pay attention&quot; and I'm talking like shes yelling at grown men in a barroom or something absurd. Completely startled we all glance at each other wondering if that really just happened. Followed by 2 other moms I walk to the room, concerned. When i asked Coach Shauna what was wrong she told me that the girls were just not listening. I told her that if she ever has a problem with my daughter to send her out of class, that i am always in the other room and that i do not approve of her yelling at her. the other mothers also voiced their concern in which Coach Shauna replied &quot;if you dont want your kid in my class they don't have to be&quot; Hello?! Last I knew I payed to have my kid in this class and never once did I sign her up to be disciplined especially in that manner! After requesting to speak with the manager about the incident and them returning my call after they reviewed the tape i was informed that they cant have the class disrupted. I am not about letting my daughter be rude and I am more than proud knowing that she is a very polite and respectful little girl, but these are FOUR year old kids Coach Shauna is dealing with and if she doesnt have the patients to teach four year olds then she shouldn't be! i'm also pretty sure they are suppose to be having fun and they are not training for the olympics. Needless to say I never went back and wasted a ton of money :( Beware of this scary place. Ps the tv screens suck too, can't see a thing!","useful":2,"funny":0,"cool":0},
{"review_id":"o3IlnuEWhb_lVWvF1D3dCA","user_id":"uRfrT_ZiL7COPvji4YZpnQ","business_id":"6Qn4YU7DKtp2S9IL9Rr0-A","stars":1,"date":"2010-09-21","text":"RUDE! and I MEAN RUDE and they manicures are shotty. The main girl Lisa is always just been plain rude. from the way she looks at you to the way she greets you. I get an awkward feeling every time I've been there. I gave them 3 tries, and 3 strikes you're OUT... done with this place. I wish i had the time to attach a picture... don't waste your money there. spent 75 bucks on a mani pedi.... and it is ugly","useful":0,"funny":0,"cool":0},
{"review_id":"OifPxoCV9YqLivhrfMi6fA","user_id":"uRfrT_ZiL7COPvji4YZpnQ","business_id":"Tjbd3oTRXs9ZdItF_cLJMQ","stars":1,"date":"2013-02-13","text":"By far the worst gel manicure I've ever got. Just eww. Glitter gel was not even. Thick as hell. Not shaped well made my nails look deformed. AAANNNDD this part is just sad funny... One lady did my cuticles and filed.. When she was done another lady \"Mimi\" stepped in to do the gel while the First Lady stood behind her and watched. I don't know what exactly they were saying but it was pretty apparent that she was teaching her how to do gel. Lol. Aren't you suppose to go to school and be certified to do that! Not to mention she's being trained by the worst nail technician I've ever met. Don't go here. Oh and another funny.. While I was there FedEx guy came and delivered a Manila envelope that required signature from a law firm. Maybe they will be shut down for their fraudulent nail service and no one else will have to experience such bull. The files were reused the cuticle trimmers didn't seem to be sterile the tray had nail dust on it ugh I could go on and on the more I write the more upset I get!","useful":0,"funny":0,"cool":0},
{"review_id":"Kq1i2x-PdXNKJ5C3H0qkbg","user_id":"gkvbfc3LD5C70pY6ZEoY6Q","business_id":"Tc0okkldQiVUOdeocZUV4g","stars":5,"date":"2014-01-04","text":"I was put up in this hotel for the evening by United Airlines because my flight had been cancelled.  I couldn't have been more pleased.  They seemed professional over the phone, they accepted my room AND dinner voucher which I was VERY pleased with.  The room was clean and elegant and the bed was extremely comfortable.  I especially enjoyed the fluffy duvet.  The staff was incredibly kind and willing to help.  I have absolutely no complaints about this hotel.","useful":0,"funny":0,"cool":0},
{"review_id":"PPrpUYB6jSooI5iX3Hk6hQ","user_id":"Uy3nWPNRJsT5xLX1IHWzoQ","business_id":"KPqXo9ZXSc3-WOl6oe58Og","stars":5,"date":"2016-11-08","text":"I'm an amateur when it comes to air duct cleaning. Although I did my best to educate myself and hire the highest-rated company nearby, it's almost impossible to know whether your ducts need cleaning, or whether the job was done correctly. For these reasons, I had reservations. As it turns out, the house we bought had new ductwork installed just two years ago and there was only minimal dust in the air ducts. The very professional crew came out and did their job. They were honest to offer their expert opinion. I then called Steve who listened intently to what I had to say. Long story short, he did what was the right thing to do, out of decency and good business ethics. He renewed my faith in honest business and unparalleled customer service. \nI plan on using their services every time. I highly recommend this company. Don't even look elsewhere.","useful":0,"funny":0,"cool":0},
{"review_id":"yW8OwERgWvJjefA_5_cGyg","user_id":"Uy3nWPNRJsT5xLX1IHWzoQ","business_id":"_uFPwnKuYByj9_Zq9-C0Og","stars":5,"date":"2017-06-21","text":"I've been leery about getting my lashes done by inexperienced technicians, but with Margarita, my worries have vanished. Her professionalism and talent compelled me to even sign up for the membership. The place is clean, and the staff members are nice. Margarita has just the demeanor to make you feel comfortable and trust her suggestions. And yes, lashes do make a tremendous difference!","useful":0,"funny":0,"cool":0},
{"review_id":"Sg4xejh3bdrSoTFNA0625A","user_id":"Uy3nWPNRJsT5xLX1IHWzoQ","business_id":"eZXhBAQ65BUtnc56r9U1Kg","stars":5,"date":"2017-04-25","text":"I seldom write reviews for businesses but I know how daunting it is to find a reliable handyman. I'd like to point out that Brian does an exemplary job. He has a very polite and knowledgeable demeanor, and delivers excellent results. I've used this company for three jobs and I will keep using them for future needs. I especially like the fact that they base their estimates on specific details that the customer provides through pictures and measurements.","useful":5,"funny":0,"cool":0},
{"review_id":"Dd1UTleQY9yMzS-6l42lvg","user_id":"Rlk6xQes1Di4eIME2Nmfag","business_id":"vCjX7hK0Aq1d8KcrhwwxTw","stars":1,"date":"2014-05-15","text":"I have been there before and had gotten good service but today i went to get an oil change and a car wash. I went to the oil change guy first and he said he would take the car to get washed after he was done. about 20 minutes later he shows up to tell me that my filter needed changing and I say go ahead. He then tells me he will only take a few minutes and then off to the car wash. So there I am waiting patiently for my car to be done. I hate to be a pain so I wait without any concerns thinking to myself, these people know what they are doing. WRONG, i am waiting and waiting, finally i go see for myself what could be taking so long. The car was parked in the lot. No one ever bothered to inform me that my car was done. I complained to cashier who passed me off to the car wash manager. He apologized for the poor service and blamed it on the oil change guys. Said they were supposed to call me when it was done. Yeah right, they change oil not wash cars. They have no checks and balances over there. They don't work together as a complete service team. Next time I will just go to Jiffy. They are more professional. Lesson for others, if you get two services done, don't assume they work together. You are on your own to figure who is done with what and be your own customer service because they have none there.","useful":1,"funny":0,"cool":0},
{"review_id":"Vv_Dbh_-JWGGEmmLzh6EyQ","user_id":"VxucPs_aMfXnvx88nEsQmA","business_id":"D3GgPF08lX44wSmk0CIKvQ","stars":5,"date":"2016-02-01","text":"Been here about 6 or 7 times and finally met the owner Pete. Great guy! We are proud to support this local business. The service has always been friendly, fast, and accommodating. The food is EXCELLENT and priced in my opinion lower than expected. As other posts have mentioned, a sign board is displayed infront of the restraunt. It is updated to reflect current political\/religious events. We look forward to the opinions being posted by the employees. This is a business who chooses to take great pride in their products, service, and patriotism. Simply Greek...simply amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"Gy1M2cIy336VCuQ94AQKAg","user_id":"mJ27E3lwUEDitcOl5i4QdQ","business_id":"9QwO5xy_E8PV8cmu4hNigg","stars":1,"date":"2013-09-30","text":"I would never stay here again, or refer anybody to stay here.  After staying there for one year, keeping the place clean, and finishing my MBA at Thunderbird, I moved out (along with my roommate).  We made an appointment to meet with the maintenance personnel to do a walk-through of the place before leaving because we had heard that the complex was unfairly keeping people's security deposits.  After the walk-through, the maintenance person said everything was fine.  The carpet was vacuumed and everything was clean.  Then, 3 weeks later I get my security deposit notice-  that they have taken my deposit and they want me to pay $75.00 beyond it.  \n\nManagement told me there was nothing I could do about it.  I also had issues with rude management during an extension of my lease and adding somebody onto the lease.  I escalated the case to rkproperties management and they claimed that they took pictures of stains on carpets.  Also, my roommate had opened the microwave one day and a piece of the top fell off . . .just fell off!  We were told that it was 'damaged' above normal wear and tear and the maintenance personnel's word was the last.  Since when is opening a microwave door 'damage?'  It was probably broken before we even moved in.  Again, we were told that the maintenance personnel had the last word.  Seriously?  This is how you treat part of your largest group of renters, business school students?\n\nWe had domestic violence in the apartment below us, ambulances came, they were screaming and yelling and fighting all the time.  And the apartment management chooses quiet students, with other potential quiet, orderly renting friends, to pick on.  That's just bad business, and I will not recommend ANY TBird to go there.  Beware!","useful":5,"funny":0,"cool":0},
{"review_id":"hiDqMNV9daG77k8PwQU7iw","user_id":"8UPnHtRqG-xJJBYXMN3LPw","business_id":"R5sfMJeNBARIOT9OevJLkA","stars":1,"date":"2016-07-29","text":"Worst company ever! The product is soap and water! This product is so expensive and is a waste. Try and get some customer service and your screwed. All they care about is the commission so once your card is swiped forget about any help after that!","useful":1,"funny":0,"cool":0},
{"review_id":"x0kflqvNvG82bu0N1fvoJA","user_id":"pQEKiZ_76KtpRVtIlHCzFg","business_id":"GTuAPBRsM5dVPqPy9oe14Q","stars":5,"date":"2013-08-27","text":"The cheese steak with sauce & onions is almost as good as the chicken salad; which rocks!","useful":0,"funny":0,"cool":0},
{"review_id":"-Hr48Svv_aPOJMO2tgEbyw","user_id":"JCB38-kGiyPmxeGSDsFytA","business_id":"G-5kEa6E6PD5fkBRuA7k9Q","stars":1,"date":"2016-02-14","text":"We are locals and 2nd time here...first time was awesome! Looking forward to our 2nd time but very disappointing. Especially on V day.  The veal was extremely dry and the sauce didn't help...so sad.","useful":0,"funny":0,"cool":0},
{"review_id":"mSEhEUnDnipTarxduZpk4A","user_id":"YhNK3cIg7uElufNIScrfEg","business_id":"zjUBFVAoz35L6-OFizNNKQ","stars":1,"date":"2016-10-18","text":"damages your car more than cleaning it... highly unprofessional...do not take your car here, for a gold package, this guys doesn't know how to wash a car, all he does is soak your seats amd let the water dry it self out, so when it does, you have assured water stains like pee...and you can forget the joints of your doors and vents etc.... and engine, lol yeah right....so in all he does what a machine car wash does, a so called spiffy outer job with a slightly little vacuumed touch! do not take your car here!","useful":2,"funny":1,"cool":0},
{"review_id":"5iRkTAC9o61EOnMsh_ex4g","user_id":"A1CfHNPwo5j7_q9E1UXwXA","business_id":"0a1I-mIn6pMghtjhhgYqVA","stars":2,"date":"2015-09-28","text":"Gets the job done, but I try to avoid this post office if possible. There's one man in there who is friendly, but the other employees seem like they try to do the bare minimum and are completely unhelpful and on occasion downright rude.","useful":2,"funny":0,"cool":0},
{"review_id":"ck6X0QIvOvc6a9ay1EzTNA","user_id":"TIJ0w4QP5Lg0kaPC2hlT2w","business_id":"0dFOy1BeJWuYTyIsi-gAqw","stars":2,"date":"2015-05-24","text":"Should have read the yelp reviews before going here.  Stayed here one night on a road trip.  Definitely not worth the $89+tax.  Not the best location.  Hotel is attached to a defunct restaurant\/banquet hall.  Only saving graces are free breakfast and a flat screen tv.  Other than that, you can find much better.","useful":0,"funny":0,"cool":0},
{"review_id":"tQMLT4RBPHL1AObWElWSRA","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"EnCIojgP5KTr1leaysFE3A","stars":4,"date":"2013-02-06","text":"Love the new location...much more comfortable, and will be even more so when the summer heat gets here.  Tried the ribs and the chicken and both were awesome.  One star loss for the fries which were a little oily and limp, and the black beans which were a bit dry.  But the ribs and chicken were worth coming back for again and again.","useful":1,"funny":0,"cool":1},
{"review_id":"WR0jhOoHNrwlx2sPnpfbiQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"b7Y4dIggAacPum1tF3NpKg","stars":2,"date":"2013-09-03","text":"Called in an order for delivery to my home, 2 miles from the shop.  Medium, 3-ingedient pizza and a small greek salad...$33 and change!  Add to that the five bucks I would give the delivery guy and I'm into it for just shy of $40.  Their pizza is o.k., but not even close to the quality that would command that price.  I know, delivery charge, taxes, blah blah blah...it's just a bottom line issue...waaay too much for an average pizza.  Sorry Rosati's, but we're done.","useful":1,"funny":0,"cool":0},
{"review_id":"jUtbkna_vBX5j_QSkVr21A","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"dfRAK2mgdHbL2_YsFqtCdQ","stars":1,"date":"2012-08-14","text":"I reviewed this once and yelp removed it because, they said, it didn't include a first hand experience.  so, here's my review with a first-hand experience.  I went there...and it was a filthy dump.","useful":4,"funny":3,"cool":0},
{"review_id":"VH6VxzEjVouFIu0C8q6ylA","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"MTtI2bqoNHN_0m2cHbY2ug","stars":4,"date":"2015-08-19","text":"I found all the staff to be professional , knowledgable, and friendly... Except for the ER admitting desk. On more than one occasion I've been given the impression that I was an inconvenience to them, and that my acute and obvious pain and discomfort were not their concern. I've watched them treat others this way as well. At least I know that once i've made it past them, I'm going to get professional treatment","useful":2,"funny":0,"cool":0},
{"review_id":"nmo1EESQLD-I4RnX2GaxjQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"LYWbyu1EQM2o5hwHG5_Ldg","stars":5,"date":"2013-04-01","text":"so, maybe a little expensive...but outstanding preparation and quality.  Beyond that, I have to give special mention to our waiter, Clifton(?), the most knowledgable waiter I've come across in a long time.  He really knew and understood the menu, and provided information and sugggestions without being overbearing or patronizing.  An excellent expreince.","useful":0,"funny":0,"cool":0},
{"review_id":"Uts0KOO_cZ3WC6Fi09nQog","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"pWjcb5g3YEvBEOKS8VkZ9g","stars":4,"date":"2012-07-20","text":"I've had no experience with the sales department...this is strictly based on the service department.\n\nThe last few times I've been to the service department I had Brian waiting on me.  They guy is great...personable, professional...makes having to get a battery replaced, or whatever, a whole lot easier.  Whoever reads these at Planet Hyundai...give Brian a raise!","useful":2,"funny":1,"cool":3},
{"review_id":"DNfAwVJJG1knqPSVZwlIQQ","user_id":"ZdUFyF5eNyZxete-T4bmZA","business_id":"nqiTujxNtEpA8dPATEQRrg","stars":4,"date":"2016-08-31","text":"Four stars for the service. Grace lived up to her name. Gracious and patient. It was as if she is an actress. Hope we'll get a chance to return.","useful":1,"funny":0,"cool":0},
{"review_id":"pdYF9kU7WaJ6Akf_oWG0Fw","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"mmMjrcClT9kAK0lCbn_x6g","stars":1,"date":"2012-03-15","text":"Breathless over the bad treatment I received in this local kitchenware store. I've been a customer for 17 years, and went in today to return a cutting board that had both warped and split apart. Not only did Didier accuse me of not having bought it at his shop, but he also claimed he didn't sell this brand and particular item. (Hard to believe given the pile of similar cutting boards on sale near the cash.) \n\nProbably should have brought my receipt the first time, but figured as a longstanding customer it'd be no problem. My mistake. So I went home dug up my receipt and returned. Only to be told 'No return, no refund. Sue me.'\n\nAvoid the overpriced \"Word of Mouth\" Upscale Kitchen shop on Spadina Road in Forest Hill Village.","useful":12,"funny":3,"cool":3},
{"review_id":"A-Q_euDlRfocbsQ2uwRN6w","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"2auigv5pF08RjJ8CL1dIVw","stars":4,"date":"2010-12-10","text":"Early morning Sunday breakfast. The pulled pork eggs benny was unexpectedly great, the service attentive and knowledgeable. The latte was dreadful (from a machine) but brewed coffee aplenty was on offer as apology. Happily.\n\nAnd a lovely setting. Cosy on a cold November morning. Free wifi too.","useful":1,"funny":0,"cool":1},
{"review_id":"AeYEOrwwTU7OI-9i28RaPw","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"y1AM7MeCN3HaS7SHnxcBfQ","stars":1,"date":"2015-12-15","text":"Forest Hill Village is not on Eglinton West, so please stop your misleading nonsense and rewrite your web\/social media copy.","useful":0,"funny":2,"cool":0},
{"review_id":"1XsWhvyJ190nG9BbBysYWw","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"Uq-GOs9_IqweUsB5MdII9w","stars":5,"date":"2014-05-12","text":"Still thinking about their unexpectedly fab sweet potato and bacon salad. I'm a fan of their eggs benny, bacon and gingerbread pancakes. The staff and owners are great, love their 70s radio selection too.","useful":0,"funny":0,"cool":0},
{"review_id":"tjvKRPcF3QuQLw6Cb5Kzyw","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"DiGcxpWsHFjMyKirtyzhww","stars":1,"date":"2013-10-31","text":"Almost inedible eggs a few weeks back (after a swim workout when almost anything will do), surly and slow counter staff, counters and tables that never look properly clean. \n\nAvoid during lunch and commuter rush, unless you're up for a long wait in a lineup that's painfully disorganized.","useful":1,"funny":0,"cool":0},
{"review_id":"BK3QDGUWzHYlWbv2DBhkWQ","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"MjQtalcEfMkaAWLsEK0pVQ","stars":1,"date":"2017-06-16","text":"Has gone downhill, AVOID. Used to wash blankets in their large machines every spring but this year the place is dirty and several machines aren't working. Mentioned the issues to owner who was not overly concerned. Will need to find another place for next year. Sad.","useful":1,"funny":1,"cool":0},
{"review_id":"79Ijvy2_5Q_SBDv6hMIirg","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"c2EfZuhjfwJ2VxTkTRv9Ag","stars":5,"date":"2016-01-08","text":"I've often seen the owner sweeping the street in front of his shop. This speaks to the care he takes with the details. Bought glasses here years ago, but mostly wear contacts. I remember those glasses fondly and would return for their replacement in a heartbeat. Olsson carries thoughtful, modern styles.","useful":5,"funny":0,"cool":0},
{"review_id":"zakV2yUPMc9K-esVxyxYHA","user_id":"VpjTKBBzMU-ouUOP88qI-g","business_id":"xkoQ1c4c6F9Fy3J73kN7Rg","stars":3,"date":"2010-02-22","text":"Beware the offbeat (i.e., quasi bag-lady) patron with her belongings piled up (for hours!) on the window counter, otherwise a predictable Second Cup experience. \n\nNew owner, things much improved from a few years back.","useful":2,"funny":0,"cool":1},
{"review_id":"8EtxuCP_fpaq8t0wxKKnFA","user_id":"qfd8RzFnl3gZgathtm6yqg","business_id":"4-ErDo1ggAg0DWrVwPa-IQ","stars":5,"date":"2016-03-25","text":"Loved my visit at clear vision! All of them are really nice and they know exactly what you want when picking out glasses!","useful":1,"funny":0,"cool":0},
{"review_id":"oCX4Bkc3mc_RHNFxl8Yj-w","user_id":"HtxS3TMKjzlCQINL9FAgzg","business_id":"q3oJ6bNRV3OoJrwc95GOwg","stars":4,"date":"2017-12-08","text":"Had the Elote Dog. Amazing flavor, not too heavy on the toppings. One of the best things I've had to eat in quite a while. The fries are great too, but I didn't care for the chili. Definitely coming back","useful":0,"funny":0,"cool":0},
{"review_id":"ZITCVOZ-2n1h7ICsHwJSmA","user_id":"HtxS3TMKjzlCQINL9FAgzg","business_id":"QMPDsRxHmDtap9ECO1Uwjg","stars":2,"date":"2015-04-07","text":"OK, let me start out by prefacing the fact that I've ordered from here several times along with my co-workers (upon their recommendations) and the food was generally pretty good. I've had their italian sausage sandwich (decent), the philly cheese sandwich (pretty good), pastrami (pretty good) and their chef salad. The chef salad is quite decent but they put these onions on it that look like they were meant to be battered and deep fried for onion rings. They were so large and overpowering that I started requesting to leave them off of the salad. Overall, the food has been decent, but this last time, I decided to get a small order of chili cheese fries. My God, that was a mistake. The chili was obviously out of a can...easily mistaken for dog food (even the smell took me for a loop). The cheese was like cheez-wiz....not appetizing at all. And like many reviewers stated, the fries were soggy. The fries are ALWAYS soggy. They don't punch a hole in the containers to let the steam out so once they're delivered, they are too far gone. \n\nAs for the delivery time, that's absolutely crazy too. For being in a fairly close proximity to their establishment, they sure take a LONG time, even if it's just an order of salads for myself and my co-workers. The delivery guy is different every single time and they are often a bit rude. \n\nMy co-worker ordered the chef salad yesterday, but was told they increased the price by almost $2.00. We unanimously agreed that we'll find some place new to get lunch. \n\nThe only reason I gave this place 2 stars is because I can't lie and say they don't have good food, they do. But when you wait well over an hour for your food, you hope it at least tastes good, and when something as easy as chili cheese fries is as egregiously bad as it was yesterday, it's hard to want to eat there again.","useful":0,"funny":0,"cool":0},
{"review_id":"xMNk_C6AxEIXQzhrRBHYrQ","user_id":"Pvvvi8d9JHOa0DEjFe05Cg","business_id":"EDONvnmu-C-tsvDVP9hlRA","stars":2,"date":"2017-07-02","text":"Salon is beautiful but sanitation is something to be desired. I have seen workers not clean area in between clients or their hands after cash register. Definitely not going back. Scary, they are touching eyes also wear a mask if you are sick.","useful":2,"funny":0,"cool":0},
{"review_id":"nSbxCknKPLL_sQSfohIbeQ","user_id":"Pvvvi8d9JHOa0DEjFe05Cg","business_id":"tixO3aKYU99KCFaRKm7Cjw","stars":1,"date":"2017-07-02","text":"I like the previous reviewer had same issues for scheduling and overcharged on estimate . Owner told me we would do remnant but than ordered. To top off his inept staff made a pipe leak in bathroom and leaked through ceiling to bottom floor on top of furniture that was soaked. IT WAS HORRIBLE. We went and talked with owner and said he'd look into it and never called back or rectified situation. Now we smell mild. WORST COMPANY EVER.","useful":0,"funny":0,"cool":0},
{"review_id":"54Als0ek4EPUDXhokp4A9Q","user_id":"SdxNjQk0I4qefOsKfJAz1g","business_id":"B5E_Qp3R1q0oRlzbYaWIkQ","stars":4,"date":"2016-07-11","text":"I have eaten here many times and it is always so good. The noodle dishes are soooo good my favorites are the pad zu and pad thi they are both my absolute favorite things to get. When u go there ask for the server leilani because she is great! She is sooooo nice and she makes great recommendations I also love how clean and tidy they keep the restraunt","useful":0,"funny":0,"cool":0},
{"review_id":"1SUm1hVjpozRjsdWzYsbxg","user_id":"UHHH54ywACV68MlNDO3x6A","business_id":"7o61DDMJ1noIlDbjY-McEA","stars":5,"date":"2014-01-08","text":"I just relocated back to Phoenix this past November.  I was a frequent shopper at the Ralph Lauren Store at the Anthem Outlets in the past.  I was completely blown away by my shopping experience this last December.  The store looked amazingly clean and well organized.  I had the best time shopping there Christmas time.  Thank you Ralph Lauren!  I will be a frequent shopper in your Anthem store!","useful":0,"funny":0,"cool":0},
{"review_id":"5A88eUwQRCv7xMJ4FTFLIw","user_id":"pQSpJukPH5QmvebFHgJc7A","business_id":"p6YA-77VayfRsm-QdBlUJQ","stars":5,"date":"2016-09-25","text":"She was amazing!! Very accurate she definitely have a gift from God!!! Thanks lily!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"g0tf_C4LRHFskglpYMhWNQ","user_id":"pQSpJukPH5QmvebFHgJc7A","business_id":"VtuC_HxzVTl4Zw0ICuXkIQ","stars":1,"date":"2017-09-20","text":"Awful! She spent 5 minutes with me!  She rushed through visit and showed no compassion whatsoever. Never listened to me and claimed I've tried \"everything\" and didn't think she could help.  \nShe is one of the worse providers I have been to, hands down. \nAlso she refused to do MRI even though I have PA for years. she ordered X-Rays of parts of body that I have no pain. Very weird.  My Physical therapist was surprised by her lack of care. \nrude and unprofessional. Of all things she rigorously shook my hand-- knowing I have terrible hand\/ joint pain. Really??   Just goes to show, her level of ignorance.","useful":1,"funny":0,"cool":0},
{"review_id":"2tIpIsG5jdQqueCjMS29bw","user_id":"pQSpJukPH5QmvebFHgJc7A","business_id":"cOqGZrtWiuv2yigzq6T9Tg","stars":1,"date":"2017-09-22","text":"WORST medical care I have EVER had-- hands down!. STAFF- HORRIBLE - attitudes. \nDr stood over top of me while I sat in side chair by door. She showed no compassion, knowledge, or care.  and didn't even do the exam. her NP did.  She shook my hand very rigorously-- knowing i have immense pain in (joints) of the hands. Unbelievable. WOW-- really intelligent dr.  You almost wonder how they obtained their degree.\n She walked in and out in 5 minutes or less.  Refused to give me a script of anything . She told me she couldn't order MRI and to go to Pain Clinic for that. WOAH..... I work in the medical field and i wonder how long some of these providers will get away with treating patients like dirt?!  Actually pretty frightening.  I waited 6 months for this appt! Apparently found out from the NP it was due to my insurance. ummmm.. ok?  BYE BYE","useful":5,"funny":1,"cool":0},
{"review_id":"xFFZb_KbaTjPAremrGahFw","user_id":"pQSpJukPH5QmvebFHgJc7A","business_id":"HkG8Ucn1E1R4acyhFrywEA","stars":1,"date":"2017-05-06","text":"I stopped by for an egg sandwich on a Wednesday morning. My server was unfriendly and gave off negative energy from the beginning. I waited, waited and waited for my sandwich to come out. I finally asked him how much longer (about 30 mins) and he was rude again, saying.....\"ummm I couldn't tell ya.. sorrrrry. He said it with no compassion and concern. I simply walked out the door telling another server... It shouldn't take over 30 minutes for one egg sandwich on a SLOW day. But honestly, It was this  mans tone and rudeness that will never  bring me back. It's too bad. \nWay to many other places to eat that treat you with respect.","useful":2,"funny":1,"cool":1},
{"review_id":"h3MS_qQa-lHFCaOCxlc9Kg","user_id":"pQSpJukPH5QmvebFHgJc7A","business_id":"dU-Nt1-LjV9mAgFOVcdAJw","stars":1,"date":"2017-08-24","text":"I did not have a good experience here. Theyprovider-NP  was  pushy and rude with me. Not professional. I have worked in the medical field,  so I know what it's like-- but these people don't even try. I  had to call 4 times about a Prior- Auth-- still getting a run around. The communication is terrible here. I had a Pap done 4 weeks ago and still waiting for results. I do NOT recommend this place for excellent patient care. \nAs a matter of fact, 3 different workers there told me different things. Practice Manger wasn't much help.  I would go somewhere else.","useful":3,"funny":0,"cool":1},
{"review_id":"SivQRfGKo5ts7F__FsHODA","user_id":"FosTFVr3UQD4Pm7HNweiOw","business_id":"-ZNTxbUVRg25LhOxEuW4rQ","stars":5,"date":"2015-03-20","text":"Best pedicure EVER! Great atmosphere,  great smell,  friendly , helpful and interactive technicians. They accommodated our party of 7 with no problem. We called ahead and they were ready for us,  none of us had to wait. This is NOT your average foot spa!  We will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"4do95uO6Xi9Z9l5kHrDUSw","user_id":"uypTljdvpVpU4A_3eRRmUQ","business_id":"7yYexN1Q5ShE_z1MH2TDTw","stars":1,"date":"2016-08-21","text":"Awful customer service. Lady was rude when we got there. Left us standing at the counter to order for five minutes. Came back and didn't ask if we were ready or  anything. When we finally got our food my burger the animal was over cooked and my oldest son's(10) chicken basket was under cooked. Needless to say he got food poisoning. My older brother recommended this joint. I was not impressed either by the certificates they had displayed from 5-6 years ago. I will not return ever.","useful":1,"funny":0,"cool":0},
{"review_id":"FnzwZe4bOPz88l0ZBituFw","user_id":"uypTljdvpVpU4A_3eRRmUQ","business_id":"LtO6vTBfYzlgWArn3kRe_A","stars":5,"date":"2017-12-25","text":"It was recommended that I visit Tacos El Gordo, so I took the advice and I was more than pleasantly satisfied. I wanted to try a variety of what they offered, so I ordered the Vampiro with al pastor, carne asada taco, al pastor taco and an al pastor Mula. Everything I ordered tasted amazing. I highly recommend this place, just make sure you get there on a not so empty stomach because the wait time is  quite a while, but most definitely worth it! And make sure you stand in the line according to the meat that you want. There are different lines for the different types of meats. I hope you all enjoy it as much as I did!","useful":0,"funny":0,"cool":0},
{"review_id":"4alqO_U5VlQL71QqqhPLhg","user_id":"uypTljdvpVpU4A_3eRRmUQ","business_id":"cAjgUS1UZpsZnKeNlXS8TA","stars":1,"date":"2017-12-25","text":"I would rate this place a zero if I could. I'm glad I didn't stay to get a haircut. I checked in online with 0 wait time. (0 wait time should have raised a red flag...Go figure) I went in with my sons and my aunt to get haircuts before Christmas. I walked in and 2 employees where sitting and didn't acknowledge us. After a couple of minutes, one of them asked if I had checked in online. I said \"yes, that's my name on the screen.\" I hadn't registered the other names, so as I spelled the other names out for her, she kept telling me to wait, and then she would say \"go ahead,\" and as I started spelling it out for her again, she would tell me to wait. She attempted to spell my son's name and she spelled it incorrectly. I told her what the last person's name was and I began spelling it for her and with the worst attitude, \nshe said, \"I know how to spell.\" By that time I had enough of her attitude and my wife asked if I wanted to leave and I replied, \"yes.\" I went down the street to a different Great Clips and it was an absolutely better experience. As soon as we walked in, they greeted me & checked me in. They were way busier than the other location. It was a good thirty minute wait, but well worth it! Go there instead by the Winco on Decatur.","useful":0,"funny":0,"cool":0},
{"review_id":"SlKl30jjhIKrZhzwNnitag","user_id":"wdqtGJL7bK-UzhjbujGdLw","business_id":"OneyDoIPnABworUjMHqXMA","stars":2,"date":"2012-07-15","text":"As with many Las Vegs clubs, 1 OAK is overpriced. $30 entry on a Saturday night even though we were guests at the hotel. Once we were in the drinks were pretty unreasonable too - $14 for a Vokda and Cook and $7 just for a small soda. The atmosphere was fin but the dance floor is tiny and an absolutely stuffed with people.\n\nTo be honest this place is not worth paying for. Try another, bigger club on a Saturday night.","useful":0,"funny":0,"cool":0},
{"review_id":"wJzWSNNGeQx1QklQFWCy_g","user_id":"Ou-_0fA27csSVc5yjiEVMQ","business_id":"uuGL8diLlHfeUeFuod3F-w","stars":5,"date":"2016-09-21","text":"I came for happy hour and it has been my best experience on the Vegas strip. The food was good but what stood out was the service. The hostess was friendly, the supervisor went around to tables to see if people were happy with their meals but our server, Michael, was the BEST!!!! If you can request for him-DO IT. I've had enough bad restaurant experiences to really appreciate a good one in Vegas. I will definitely come back","useful":1,"funny":0,"cool":0},
{"review_id":"aGznFbReqz6-3s5SWW114A","user_id":"pQp7aL8UmxhFkO73w5UERw","business_id":"9a_c5g9It4-_fDgM9PSjMg","stars":5,"date":"2015-11-11","text":"Best place to tan and relax!!! Awesome prices, clean and neat, VERY welcoming! The owner Emily is the biggest sweetheart you will meet :))","useful":0,"funny":0,"cool":0},
{"review_id":"pBRvnpW4ByFhm8kjvx5r0Q","user_id":"k3AtUSZRiDe_OZBK1fjMtg","business_id":"lOYv3HSPkO8hy1jaoER-Rw","stars":5,"date":"2015-09-30","text":"Needed a duplicate building FOB for visitors and building management would not issue.  CloneMyKey to the rescue and within a couple days, they delivered as promised with excellent customer service.  These guys are 100% legit and would highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"WdzQPQeWLLMdIH6sXRRFcg","user_id":"zKOIrTwR7HCYfi05ce1-qQ","business_id":"_pBXtjN43eqMV0XZTz7nmw","stars":1,"date":"2016-05-16","text":"The bouncers and staff were such assholes we left and went somewhere else. Ruined my friend's birthday.","useful":1,"funny":0,"cool":0},
{"review_id":"9uOHpeu3eeqTfUrzRLFzPg","user_id":"XR7DMCO0C7McsLuS8mpvow","business_id":"wizwRqaukMKVNSf8IFZCYQ","stars":5,"date":"2017-08-11","text":"What an amazing way to spend part of the day!!!  Top class service from start to finish!  Really happy to be able to go!","useful":1,"funny":0,"cool":2},
{"review_id":"U0PFwmB9uy5OIZROVYVawg","user_id":"oWsryVTVEPZFqtmlHmdEdg","business_id":"ruN8KDsPebvhwXHED65sNA","stars":1,"date":"2015-12-10","text":"Unfortunately six months after getting a used car from this dealership I was left with no choice but to replace the vehicle. I am not able to say my experience with the car I was sold was a good one. In the first 3 months the car was in the mechanics shop 5 separate times. The first problem happened in the first 48 hours. Granted the dealership paid for that repair since the warranty refused to. And the fifth trip to the mechanic was also paid for by the dealer. None the less, when the first problem happened I was told that if trouble persisted I would be placed in a different vehicle. 5 separate trips to the mechanic showed a persisting problem. I wasn't placed in a different vehicle. This vehicle has been nothing but a money pit from the start. I will not be replacing the engine. \n    This vehicle has not been reliable. I felt I was left no other choice but to go and get a new car that is reliable from a reputable dealership. I understand that there are people that have had good experiences with getting a car from good carma. Unfortunately I cannot say my experience was among them. I paid for a 3 month warranty that refused to cover repairs that were included in the warranty agreement. \n    So here is my revised and updated review. Unfortunately I don't feel I can change my rating due to all I have experienced.","useful":11,"funny":0,"cool":0},
{"review_id":"xQti6jI4rAzT9bcQmXxwtQ","user_id":"fVp4QikO6obgiBqMgj6--A","business_id":"CoyeXg8FBsS_d20QzNIy-A","stars":5,"date":"2017-02-21","text":"I'd like to take a moment to thank Josh and his hardworking staff for hosting my organization's recent business workshop. Josh went above and beyond to meet our needs prior to and during the event. The staff was incredibly friendly and helpful toward all attendees. The delicious cocktails, lattes, and food left everyone satisfied and wanting more. The venue provided an open, clean, and inviting environment for all, and I look forward to working together again. Between the excellent customer service, mouthwatering menu, and perfect location nestled in the heart of the DTLV's Arts District, there's no other coffee shop that compares. Thank you, Makers & Finders for an amazing experience!","useful":0,"funny":0,"cool":0},
{"review_id":"40aMXXV3GmdLzZjtCBJMtQ","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"m5mXo_UzCUZPfL7BXzApFQ","stars":5,"date":"2015-06-07","text":"Erika has done my hair styles for multiple weddings and events, she always goes above and beyond what I ask for, she is also very efficient with time and pays attention to detail. I highly recommend her.","useful":1,"funny":1,"cool":1},
{"review_id":"7yKlf1W-vVFK1TmORRLNZQ","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"_OTl6V2oUfMMmoDWD2nXVg","stars":4,"date":"2014-07-25","text":"I purchasd the italian bread- it was delicious. Better then any other gluten free baked goods i've had from whole foods.","useful":0,"funny":0,"cool":0},
{"review_id":"g7j-44IT0zfanWtwOcKaYw","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"Dnn7JsdmvJ0_spWu9wo2kg","stars":5,"date":"2015-01-21","text":"First off- Congrats Chef Piero. My co-worker and I shared two sandwiches the cuban and american(the american version of an italian) both delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"14UGjc3Vjvij6NkCssh56g","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"1W4MuTJiUBJ3Z2TsXz994Q","stars":5,"date":"2015-09-18","text":"I have nothing but great things to say about well rounded mama. I took the hypnobirthing series with Mandie and all my nerves are gone and i'm excited for labor. I am also using their service for my placenta pills. I'm so happy that i learned about this place.","useful":2,"funny":0,"cool":0},
{"review_id":"LtZWuvpMSl_a_uNXnkqU3w","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"cK9e9dU6NwcCXT-ycKQ3SA","stars":1,"date":"2017-10-20","text":"absolutely terrible customer service. 2 weeks after ordering product I called 5x for an update and still did not receive one. i had to call the stone manufacturer direct for an answer. better off ordering via lowe's.","useful":1,"funny":0,"cool":0},
{"review_id":"CQBfaeKf-nyOxezK4bcA9Q","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"N8D-5-fW7EkBdKjNYGhu0A","stars":3,"date":"2014-07-25","text":"We were a group of 8 Las Vegas locals celebrating a friend's birthday.. our first impression was great we had some drinks at the bar and the bartender was very knowledgeable and nice we were seated at one of the best tables in the restaurant. My whole group would agree that once seated we were disapointed with the service from our waiter he suggested the Chef's Tasting menu($45each) due to the size of our party we all thought that was reasonable but one of the members of our group has a food allergy to mushrooms and 3 of the six items contained mushrooms, when asked to substitute our waiter acted offended and told them \"to eat around the mushrooms\". We opted out of the tasting menu after the comment was made and ordered some delicious items like the Crab Lettuce Wraps, Pesto Pasta, Asparagus with egg, Flat Breads and other items. The service improved with the evening sadly once they realized we would possibly be repeat customers and after talking to the sommelier about the waiters personality . The bill was over $850 for tapas, dessert, cava toast and wine(2 @bottles at $70each). Overall the food was good and the atmosphere was great.","useful":0,"funny":0,"cool":0},
{"review_id":"UbcVNZ9cgMOc0C3iJu5ScA","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"YQkiqFCiGr_GtTY6-QHEog","stars":5,"date":"2017-10-22","text":"we had a fabulous lunch with family, ordered caesar salad, meatballs, contento pizza and gnocchi all Fabulous! can't wait to got back!","useful":0,"funny":0,"cool":0},
{"review_id":"UzmBkhi5tf-GIHQhhMLEqw","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"w5CSi-An5meLnxjKSFn0wQ","stars":1,"date":"2015-06-26","text":"this does not even deserve one star....my husband and i got take out. very basic items, fried rice, thai beef salad and pad thai. the fried rice was terrible not sure how you mess this up, the thai beef was bland and the pad thai was worse than the time i tried to make it at home. we each had a few bites and threw out the food. we have never done this. \n\nnot sure how they have 4.5 stars. we will stick to archi's and le thai.","useful":0,"funny":0,"cool":0},
{"review_id":"3DUlt-hKxEFWdJdfW0eLZg","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"SIWwh4m6kkvUaa5skrVAQQ","stars":5,"date":"2016-06-29","text":"this is our go-to coffee shop, we always have great service and food. it's always a struggle to pick from our favorite menu items the french dip, club sandwich and cobb salad always with a side of of greek fries. We always save room for desserts we use to always get an eclair which is delicious and now we always get the chocolate cream pie, it's AMAZING!","useful":0,"funny":0,"cool":0},
{"review_id":"qbLbXM16O_YcSapyK-N4Kw","user_id":"a_ysP4XsxQjHGeYcHasVgw","business_id":"G_WLvkBLT9xr9aM_nmgrwQ","stars":5,"date":"2015-03-09","text":"we got a beautiful frameless shower door for our master bath. couldn't be happier.","useful":0,"funny":0,"cool":0},
{"review_id":"Z4nT3rlL3EaBXUKyTCfhDQ","user_id":"9VZ-PYp1Cf4oC3wdGVzhwg","business_id":"S-oLPRdhlyL5HAknBKTUcQ","stars":5,"date":"2015-10-20","text":"Best sushi I've ever had!!! \nThe Oh My God Sushi is amazing!!! OMG!! \nThe philadelphia roll was awesome too!","useful":1,"funny":0,"cool":0},
{"review_id":"h64uopInatis83Pp4iGqRQ","user_id":"Ac3vNCPDwirpxSkIwtcvVA","business_id":"9-Mfo1JItBhTkhGgYg1X1A","stars":3,"date":"2014-10-04","text":"A casual go-to favorite. Wonderful baked Brie, fresh salads, and tasty soups. Friendly service and delightful patio. Upstairs dining room can get a bit loud is cozy and fun for a casual bite.","useful":0,"funny":0,"cool":0},
{"review_id":"sb5ZMlnmwcAZPCodR37Uiw","user_id":"Ac3vNCPDwirpxSkIwtcvVA","business_id":"SzcCJJmreMlWCsNjupdVAA","stars":5,"date":"2015-11-08","text":"A patio favorite. Best cheese board and wine options in University Circle. A favorite after trips to the museum or before the orchestra. The vegetarian cassoulet is always outstanding.","useful":0,"funny":0,"cool":1},
{"review_id":"qFNtxmCldq0bUoRF1OdpQA","user_id":"Ac3vNCPDwirpxSkIwtcvVA","business_id":"-lJtyCOTVInWusU9YF120A","stars":5,"date":"2015-11-08","text":"One of our favorite Italian restaurants. Fabulous pizza and light & tasty chew pose ravioli that never disappoints. Fabulous friendly staff. A neighborhood gem for casual dining.","useful":0,"funny":0,"cool":0},
{"review_id":"jfs_ZtWnWgrCvEFEl8DPQA","user_id":"Ac3vNCPDwirpxSkIwtcvVA","business_id":"kG3TJsJvaDHF3csp0dRDYg","stars":2,"date":"2017-09-05","text":"While service was friendly and prices were reasonable the chocolate dipped cone lacked flavor.","useful":0,"funny":0,"cool":0},
{"review_id":"dnFaX47ASF4-eUXBbCG2hg","user_id":"9bvrSiI2GITibg06TyTTtA","business_id":"nxz2oOD3sryU5evFAYmmLQ","stars":5,"date":"2015-01-12","text":"My family went for lunch today. First, the waitress, Emily, was awesome. The best service I've received in a long time. The food was fantastic and brought quickly. I had the grilled chicken with mash potatoes and bake beans. The serving size was very large for the money. Two big chicken breasts. The cheese muffins were awesome. We tried several desserts as a family and they were all delicious. When you go ask to be seated in Emily's section she won't disappoint.","useful":0,"funny":0,"cool":0},
{"review_id":"du2Q2zZfBnHUQw9k15qBog","user_id":"9bvrSiI2GITibg06TyTTtA","business_id":"VpXlnz2dD4KzPw4yJ_eJ3A","stars":5,"date":"2014-09-20","text":"Great fresh food. Friendly staff and clean restrooms. The gas is usually the cheapest around.","useful":0,"funny":0,"cool":0},
{"review_id":"yV8pT2gRI5aeHtERC999uA","user_id":"9bvrSiI2GITibg06TyTTtA","business_id":"QpCYSH83E5qT9Vss28Odug","stars":5,"date":"2014-09-04","text":"We go to this pizza place almost every week for girls night out. I have tried almost everything on the menu and never been disappointed.  The Cesar Salad is delicious. The fried zucchini appetizer or the garlic knots are fantastic. The service is friendly and attentive.\n\nThe manager Cameron always speaks to us and makes sure that our food came out good. Not many managers make it a habit to know their frequent customers.  On occasion he has even brought out our food to us just to say hello.\n\nIf you love pizza or Italian you will not be disappointed.","useful":1,"funny":0,"cool":2},
{"review_id":"EUcUNmUz0rnsB9RFRTXfjQ","user_id":"ayKItMzLXwpNSwfYlF72Fw","business_id":"zL7ur9zT-WIUTHJrrh_xSg","stars":5,"date":"2016-11-09","text":"I love coming here great food and great employees. Always putting a smile on my face when I come in they are in such a good mood. Love being in an environment where people love their jobs","useful":0,"funny":0,"cool":0},
{"review_id":"IlkfTGnr1ad4CSiXLPf14A","user_id":"ayKItMzLXwpNSwfYlF72Fw","business_id":"Qjz2Lyqlrag9bCKo3glExg","stars":1,"date":"2016-10-02","text":"The dryers are horrible don't work well. And when we had the workers wash our clothes we asked them to call us back. Didn't hear anything for two days and the pie clothes were stained pink. NEVER going back.","useful":0,"funny":0,"cool":0},
{"review_id":"RSOEtDwDbERksaqEmJC9-A","user_id":"DtFDIgjhIISL2csiNcPIyg","business_id":"c4zgJxmqz9nbBHF69EskSA","stars":4,"date":"2014-01-04","text":"I don't know why everyone says dinner wasn't fast enough. We went had some wine, relaxed and enjoyed. If you are looking for quick service go to eat n park. The short ribs were great and so was the staff. Wine glasses were kept full. No complaining here. We had a table of 8 and I would say we were there about and hour and a half. Will definitely return to try more.","useful":0,"funny":0,"cool":0},
{"review_id":"LqaPCkaAJHXsDvAisrkgSQ","user_id":"IEm5TyEFNlNRbnnG5gG99w","business_id":"e-cxqDjKEHEcISP2iGcZxg","stars":1,"date":"2010-03-07","text":"The bartenders are rude, the people are snobs, and the drinks are over priced-other than that the place is great.","useful":0,"funny":0,"cool":0},
{"review_id":"VmLtGRSt9Qopf6Ig0pKTeQ","user_id":"D4BODFv4qlCL31_xx7uYEQ","business_id":"pPgyuGtcNIBRfrPFu3Vceg","stars":4,"date":"2017-04-08","text":"I had the Buddha Bowl and it was really nice. I like the poke bowl idea because it has veggies, carb and protein all in one. The place is quite small but it has lots of seating space outside. Would be nice if they can put a few tables in the mall area.","useful":0,"funny":0,"cool":0},
{"review_id":"QnTWEkq92qv0GBnV1v6OzQ","user_id":"D4BODFv4qlCL31_xx7uYEQ","business_id":"g6AFW-zY0wDvBl9U82g4zg","stars":5,"date":"2017-04-08","text":"This is such a wonderful little cafe, tucked inside a medical building! The food is good and the coffee is amazing. Service was excellent as both owners came check on us a few times, without being pushy. I will definitely go back!","useful":1,"funny":0,"cool":0},
{"review_id":"fye4xClu-y6hCtbsc91u9Q","user_id":"HM738ERo8d1FhA4oy56gyw","business_id":"D7DLb-G0HJis3Ae4iGsVkQ","stars":5,"date":"2015-07-07","text":"A guy made the best subway sandwiches I've ever gotten. Said he's been working there 4 years and that he was 19. Whoever that guy is... Deserves an award","useful":0,"funny":0,"cool":0},
{"review_id":"tzR_lnw2I2X3TqhRqhvFsA","user_id":"HM738ERo8d1FhA4oy56gyw","business_id":"Pg6t8mG-zWY3pRSdxlFnHg","stars":5,"date":"2015-05-17","text":"So I heard this place gave out a free rose and a free desert to any mother who ate there on Mother's Day, how awesome is that ! ! ! \n\nBut I absolutely love the food here at Bella, just had a slice of mushroom today, apparently you can get a slice of whatever the heck you want any time of day, but my all time favorite is the Bella Delight... Fried eggplant covered with ricotta cheese, Italian sausage, homemade marinara and mozzarella... And then they bake it. No wonder I eat here all the time.","useful":0,"funny":0,"cool":0},
{"review_id":"_x8wP9PAqQSTBjbR3e4Vow","user_id":"oC7g9egiLv7lagvnNOXb0w","business_id":"voVFOIp4mUHElDeryPfHkg","stars":2,"date":"2015-10-03","text":"Honestly, I. love. Baskin Robbins.  The only ice cream I ever eat now is Baskin Robbins' Cookies and Cream!  It's the only place I ever go to if I'm craving ice cream.\n\nHowever, I experienced the worst service at this location which is around St. Patrick's station downtown.  The employee there was so rude.\nSo, my friend and I came into the store first.  No greeting.  I mean, whatever, nothing too big to complain about.  We were browsing the flavours when two other girls came into the store.  The employee then talked to them and they seemed to be friends.  After two minutes, we were ready to order and the employee was still talking to the two girls for around 5-10 minutes.  She also served them first! (Ha!)  It wasn't until her friend stopped (annoyed) and pointed at us, whispering, apparently signalling for her friend (the employee) to go and serve us.  The employee also looked annoyed that she had to stop her conversation 'cus we wanted to order something... so anyway, we asked her if she had the Cookies & Cream flavour and she just replied, \"No.\"  That's it!  and then she went back to her friends.  She didn't even say, \"Sorry\" \"Do you want anything else\" and she didn't even ask my friend who was actually ready to order her Pistachio ice cream.  She just said one word and went back to talk to her friends.  \n\nIt was like we weren't even there!  I find it so rude to be treated as if you don't even exist.  It's so much worse than being given attitude...at least the person acknowledges your presence.  I will NEVER go to this location again.  I love Baskin Robbins but I'd rather just walk to the Eaton Centre location than go to this place again!  I hope no one ever has to experience being ignored like that.","useful":0,"funny":0,"cool":0},
{"review_id":"DkUEYR3YUCJyIqvKgIxYrQ","user_id":"oC7g9egiLv7lagvnNOXb0w","business_id":"nRZjrWIzqKc26KjpBG0fHg","stars":3,"date":"2014-06-13","text":"A cute place to lounge and relax in with your friends.  It's comfortable and neat.  I've been here two to three times now and I've always sat on the couches with the big coffee tables.  \n\n+ Oh and I asked for water once and they pointed me to the little water cooler table near the door.  I didn't really mind getting up to pour myself water but just something I wanted to point out.\n\nIt's a bit pricy but this is the only reason I come back here:\n\nThe chocolate waffles are heavenly.\n\nAlso, the heart post-it message board is really cute.  I remember writing messages with my friends on there back when I was in high school.","useful":0,"funny":0,"cool":0},
{"review_id":"tUm_W7b0r2iCgj2hovqHtg","user_id":"Ck6CDY0rcGfadIWXRJ5Z0Q","business_id":"m8o3OrY0DWfqvk820EyrxQ","stars":5,"date":"2017-02-26","text":"Computer Doctor BG did a thorough diagnosis of my computer until they resolved the problem which allowed me to keep my business  up and running. The marvelous thing about what they did is I have a older Mac computer and they found parts that would enable it to keep performing.","useful":0,"funny":0,"cool":0},
{"review_id":"BJOKBv-5T0pbJ-AePUt-DA","user_id":"pHGy0L950NeKvRnJK8-5JQ","business_id":"jppxrDQLXr4Nk8cV7IGlcw","stars":5,"date":"2017-02-25","text":"Awesome food and great music. A must eat with authentic Mexican food. Not the Tex Mex fast food crap!!! The homemade wine is divine! The home chocolate ice cream is fabulous and so yummy!!","useful":0,"funny":0,"cool":0},
{"review_id":"PAv2BPk1M0Su7CCyzvgjGQ","user_id":"pHGy0L950NeKvRnJK8-5JQ","business_id":"Fbycyr3KEjDQ4wO9AStmvQ","stars":1,"date":"2017-02-25","text":"We went to Cafe Sam to celebrate 2 birthdays. Service was slow. Downstairs was not to busy. Four out of seven meals were unedible. Steaks we found out were from last week for Valentines Day. The steaks were tough needless to say. No bread. I had to ask for our salads. Manger Dan really was passive in talking to us. He did give us alcoholic drinks which was nice but I don't drink alcohol. The only thing that was great was conversation with friends.","useful":2,"funny":0,"cool":0},
{"review_id":"vpFagHhvPfwhqfXZByv6GQ","user_id":"yD1NqQR3hfuq29hCLUVtvQ","business_id":"dpOWBBnpzpkIvhuLBFIg6w","stars":1,"date":"2017-06-21","text":"Dropped the car of for an oil change, tire rotation (which they do for free since I bought the tires there), check of the transmission fluids, and power steering. I left with an oil change. 1 out of the 4 things I asked for was completed.  The reason I know nothing got done was it was not on my receipt for checking the fluids and I mark my tires to make sure they do a tire rotation.  I got home and my same mark was on my drivers side front tire.  Called them back and they said since my tires were worn that they can't rotate them...um b.s. They flat out did not do it.  This was after they would not prorate me for new tires that I bought from them and got 35,000 miles on 65,000 mile tires. They said I needed to have tire rotation records (which I do have just not from Brian's).  How do you get tire rotation records when you don't rotate the tires?  When I called Bridgestone about my tire warranty they said to not go there (Brian's) and go to another place   Shady place..be careful.","useful":1,"funny":0,"cool":1},
{"review_id":"QSH0rT-F_gPC7sYYql-_QA","user_id":"Xl2AqR8_IeJtZK5j1deYHQ","business_id":"Bk3yUv6mJqSCTbyFNbgeSw","stars":1,"date":"2014-01-29","text":"I had a fine experience opening my account. Life changes necessitated me rolling these funds to another custodian after 2 years. A full 6 weeks after the new custodian, a major corporation, sent ALL the proper paperwork to ETC, ETC decided one of the forms was \"too light\" and needed to be resubmitted by the new custodian. Then they said that they would need \"at least\" three more weeks to \"review\" the replaced form before they would transfer my funds. I am about ready to book a flight to Ohio so I can scream at them in person. They talk around and around in circles, pathetic excuse for a company.","useful":7,"funny":0,"cool":0},
{"review_id":"D36rLlR-RrHJ6iMMDYfLlQ","user_id":"TwqTpONeE4qA8Z_yvHF6CQ","business_id":"b4k3TsCTJs9b7MrM8Xz7_w","stars":5,"date":"2013-10-21","text":"This place has great service! The mechanic is extremely knowledgable and honest. He does good work and charges a fair price. \n\nMy car wouldn't start one day but when the tow truck got to me it started. I thought my starter was going out, but I took my car here and he knew right away that it needed a battery. He put in a new one to check it and make sure that was the problem. He said I could take it somewhere else but he dialed O'Reilly's and had me ask them what they charge to prove he was giving me a good deal. This is definitely a good place to bring a vehicle for repairs.","useful":4,"funny":0,"cool":0},
{"review_id":"SldeyLJYcKD-NKNVisNALA","user_id":"UIwFaKNduUzyAbTYhMDRtg","business_id":"yhf9NlNKu8efjVHHGiNIqA","stars":2,"date":"2011-04-01","text":"Four friends and myself ate at Alloy for my Birthday dinner last night and I must say I was not overly impressed. \nThe decor is unique and the atmosphere was cool but that just does not make up for average food at an above average price. If it were not for the food I think I would give this place a 4! But in the end that is what tells the real story for me. \nWe all tried a different starter, main and we shared a few salads so I can certainly say I gave it a fair chance. \nService was friendly but did not seem overly knowledgeable, no food descriptions or desire created,\nDish presentation was quite nice, \nFood was sub par, I kept expecting to be wowed by one of the 12 + dishes we ordered but in the end the candle burnt out and we were left with a hefty bill and disappointed taste buds. \nI may go back when the patio is open on a nice day to give it one more shot but that will be long after I try several other places on the bookmark list including some repeats to places like The Muse and Rouge where I would gladly spend my time and money :)","useful":0,"funny":0,"cool":0},
{"review_id":"bB3MkfREmMII6cmIUe0Dxw","user_id":"UIwFaKNduUzyAbTYhMDRtg","business_id":"STsW9ALww7yeVNcRxXEmXQ","stars":4,"date":"2011-04-01","text":"Mmm Mmm Mmm!! \n\nGreat location, atmosphere, knowledgeable staff and in the end every little morsel of food was gobbled up and plates licked clean haha. \nThe 3 people who joined me had the same reaction and we all said we would go back any time! \n\nThank you for an intimate, delightful dining experience!","useful":2,"funny":0,"cool":0},
{"review_id":"uyv5ubAWa4Tu3RkfRzFT3Q","user_id":"et1U5x5kDSxSf9EuP6GRRQ","business_id":"TUFq8k3aBwOSfyusG0yKPA","stars":1,"date":"2014-10-16","text":"This salon is sub-par. If you make an appointment you will quickly learn that actually doing hair is not the priority here. The stylists are watching TV\/bootleg movies, texting, and taking cell phone calls while doing the client's hair. As a client, I felt like I was distracting my stylist from watching her movie rather than being the focus of her attention. Also, expect to be double booked for a hair appointment time slot and don't be surprised if the stylist leaves you under the dryer for 40 minutes to run down the street to the store. I have always had natural hair and I am used to the way black salons normally run and this is below average. \n\nI might be able to deal with the unprofessionalism if my hair was done well, but this isn't the case. The stylist burned my hair because she was trying to do everything but pay attention to her job. On a positive note-the staff there is nice and polite, but I still won't be going back.","useful":1,"funny":1,"cool":0},
{"review_id":"aRldpRkOX_zcqb8im-XtFA","user_id":"43CYDDnQGMLqwGv3NwRTog","business_id":"t8Mo-KiivPqXbFKJmakj4w","stars":5,"date":"2017-05-30","text":"i have been a customer for a long time and the staff has always been friendly, knowledgable, and available when you need to find something.  i trade in my clothes and the process is quick and easy.  the two men (Josh and Dave) are always friendly and willing to help you.  they work very hard and keep things organized.  i think it's the best that i have seen in all the years that i have been there.\ni like that they have all sorts of other things to buy.  it's not just clothes but a lot of household goods to update your decor.  it's just a fun place to spend a few hours either buying or looking!","useful":2,"funny":0,"cool":0},
{"review_id":"wz6-OiHrmHkATcNmkZySpA","user_id":"mCoJyAt9FJdTK93C2QsEeg","business_id":"Qihead6oTtWCwde3TBqlGg","stars":5,"date":"2010-06-14","text":"YUMMY! Had dinner here our first night, then breakfast the next morning, and breakfast again the next morning. The wait staff is awesome! The GM indicated they had a re-do about 3 months back and everything is made from scratch, even the jams. Back to the original recipes. \n\nGreat food at a great value! \nENJOY!","useful":0,"funny":0,"cool":0},
{"review_id":"GvCshy8f960aZPBsvLj1Tw","user_id":"mCoJyAt9FJdTK93C2QsEeg","business_id":"XjepvTIfp4iqGq1orODedg","stars":3,"date":"2010-06-15","text":"The Stromboli was good. Service was very pleasant. The place was dark and old, having to walk through the smoke filled bar to get to the glass partitioned dining room was disappointing....hold your breathe!  Would I go back, probably not. Once and done.","useful":0,"funny":0,"cool":0},
{"review_id":"vYM_UnfFZCZG308hvqJ1eg","user_id":"mCoJyAt9FJdTK93C2QsEeg","business_id":"j5nPiTwWEFr-VsePew7Sjg","stars":5,"date":"2010-06-14","text":"LOVE THIS PLACE! I was in Vegas 4 nights and ate here 2 of them. It was recommended by a local and is the most amazing Japanese restaurant on this side of the Pacific! \n\nBlue Fin Tuna Sushimi, Yellow Tail Tar Tar, Black Cod, Ramen","useful":0,"funny":0,"cool":0},
{"review_id":"IMoecEm58KnWWASeAM5xEw","user_id":"wAO6sndUAdqLTuKsAR1pFg","business_id":"vy9we2md5bP6bBjuHdhr4w","stars":5,"date":"2013-10-03","text":"I moved to Shaker about a year ago, with the loyalty to the barbershop I've been visiting, I have never tried any local barbershop. I have been driving back and forth 2 hours to go back to Tiffin to visit, then trying to catch the barber's free time between the appointments. \n\nLong story short. I have to get a hair cut by today, can't wait due to scheduling issue. Found this one near by, decided to give it a try. \n\nSgro's doesn't go by appointments. I walked in around 5:05, the shop closes at 5:30. They took their time to meet my specific request for my hair style. By the time was done, it was already pass the closing time. The outcome is clean and neat. \n\nThey really know their stuff. \n\nNow, one more place to go for my haircut, and will go back again.","useful":0,"funny":0,"cool":0}]