[{"review_id":"4dAK3me4r05-u7BnmI2V8g","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"C_Zj7H7bUJ5kGCwFmEwW6w","stars":2,"date":"2013-07-05","text":"The food is fine, but the service sucks. \nWe came for a late lunch, and there were only two tables including us. The guy (I believed it's the owner) came to our table several times just standing and staring at us while we are still looking at the menu, which was so creepy. I told him we needed more time to decide but it looked like he didn't understand me and came by again before we were ready to order. I felt like being rushed to order.\nThen the food came, and they were fine. But the bill came when we were in half eating, and the guy just dropped the bill on our table saying nothing. That was sooooooo RUDE.","useful":4,"funny":1,"cool":1},
{"review_id":"-Aj7jPUjyXg-H5Go3sfIXg","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"ECKXHrl2GqNKRMG9jp4trg","stars":5,"date":"2013-07-14","text":"This is the best Korean restaurant I have ever been in CU area. The kimchi pork with tofu is really good! The serving is also very good. Although it's a little bit overpriced, but the food is really good.","useful":0,"funny":0,"cool":0},
{"review_id":"K5XAmKlFDBnQ9wxzxD64PA","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"C31ExBTn_6UxbTVkWPtNkg","stars":5,"date":"2013-06-22","text":"We didn't order sushi because we want to eat something hot. So, we ordered the Pork Don Katsu and Beef and Scallop Teriyaki. They were awesome! And also, the waiter and waitress were very nice and friendly!","useful":0,"funny":0,"cool":0},
{"review_id":"XegwGNdl8JlLeIVdqbvkmQ","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"nsSfCKW9KDB4COj9bzXApw","stars":4,"date":"2013-07-08","text":"The food are quite decent and the service is great, although it's a little bit pricey.","useful":0,"funny":0,"cool":0},
{"review_id":"2o0cIgJ57WjFAk2Vh1EKag","user_id":"02A7EMn1GbOtsX3w8NwTAA","business_id":"Aao0zW-OqEWMOCKVubXT-Q","stars":5,"date":"2017-11-04","text":"SHEEP CAMP\nDowntown Buckeye\nHome town feel.  Simple menu with great variety and generous servings.  Lots of locals  and farmers, not modern or fancy or big, but great home style cooking, open until 2 pm.  My wife pretty much only eats breakfast two places, The Sheep Camp in Buckeye  and Ronnie's Cafe in Phoenix on 43rd Ave.  Friendly service and good food in a relaxed non-commercial setting.  Try it I think you will like it.","useful":0,"funny":0,"cool":0},
{"review_id":"Tt-YgadZXa9PrE21F1OF-Q","user_id":"gP_x6FPC6hkV8C1duvUM2w","business_id":"vF2a_cycD2sHfM1-KBijxw","stars":5,"date":"2017-06-09","text":"I just had my eyes done this March and couldn't be happier with the results. I was seeing 20\/20 seconds after the procedure and could get back to my normal daily routine very quickly everyone from the surgeon to the staff were very welcoming and answered any question that I had for them. I would recommend this to anyone who wears glasses","useful":1,"funny":0,"cool":0},
{"review_id":"GDQv6tNAQU_G9D66ABc30A","user_id":"EDnHstFuSg6nA5gqdcP6Ig","business_id":"OFdMlXxtkU_nUh8jJ4W6GA","stars":5,"date":"2015-11-15","text":"Lovely little coffee shop :) It's cozy and you can get delicious coffee and simple eats. It's great!","useful":0,"funny":0,"cool":0},
{"review_id":"oAvWyhbfIVNokdjlGZpVWw","user_id":"tPAa_ww5FHYalX3kcNhSRw","business_id":"wJVW-Bgc9j2aaMnwI7TH3Q","stars":4,"date":"2010-05-08","text":"I went here during my visit to Calgary...\n\nThe first big plus is that they are open late. It seemed like everywhere downtown sort of shuts down at 9pm. I was really hungry after a play and Original Joe's came to the rescue. \n\nI had the Thai-style Salad and it was very good. The grilled chicken, noodle and cashew nut mix  was an unexpected combination... but it tasted great with the sauce. \n\nIt is a place I will visit again.","useful":0,"funny":0,"cool":0},
{"review_id":"nMrho2QVkoenG4AickJy9A","user_id":"tPAa_ww5FHYalX3kcNhSRw","business_id":"1HmFo8cD3z5QGCuWS-UxUA","stars":1,"date":"2010-05-08","text":"This hotel (motel) is hands-down the worst I have ever stayed in. I booked it through Orbitz, where it was listed as a 3-Star hotel and was elated to be getting a great deal... of course it was too good to be true.\n\nThe entrance\/office was absolutely nothing like the pictures... you sort of had to stretch your imagination to see the semblance from the pictures. \n\nThe rooms were simply drab, complete with hideously patterned sheets and curtains (I can't place what decade they were from). The pillows: imagine a $3.00 Walmart pillow, that has been used 50 times. The room also had an annoying odor, like an old abandoned warehouse. The window A\/C unit was one of those from the 1960's (may be not quite that old), with shabby faded wood panelling, and it was plugged into a socket that was falling off the wall. The TV: half the stations were static ridden images. The room was connected to a balcony- (a shared one). But, you guessed it.... you would not want to step into the balcony or leave your dog roaming there... Of course it smelt pretty bad because it was covered in a lime green carpet, that had not been cleaned in maybe 5 years.\n\nAnd do not be deceived by the free breakfast. I was dreaming of a continental spread with eggs, sausage... Far from it, the fruit basket  contained 20% soft rotting apples, the bread tray- the bread seemed recycled from 3 days (think of the hardened texture of bread that has been left out overnight). Needless to say I was too scared to try the coffee or milk; all I could stomach was the orange juice.\n\nAs far as location: The only plus is that it is close to a train stop, with easy access to downtown. Otherwise, there are couple of other motels in the area and nothing else; I mean NOTHING.\n\nHere are the only positives: Thankfully the sheets seemed clean and there were no roaches or rats; the bathroom was decent; and the wireless internet worked.\n\nPlease do not fall for this miserable place. I payed $85 for the night and wanted all but 100 pennies back.  I have not stayed in a 1-star motel, but I suspect this place will make some 1-star places look stellar. I know its sort of a harsh review, but it is completely true to my experience there. Give it a try and you'll see for yourself!","useful":6,"funny":0,"cool":0},
{"review_id":"MyEGmXfG22uJIAzf0Kbsdw","user_id":"9t9CYqFB2dBwB3icQ67kaw","business_id":"gBIpbpuVWCBWiWZF2p_B8w","stars":5,"date":"2016-04-04","text":"Tyler M is great! We've had him several times and he always does a fantastic job! Very professional and nice.","useful":0,"funny":0,"cool":0},
{"review_id":"xXyiq6KyJlgCbfT_xlAEjg","user_id":"9t9CYqFB2dBwB3icQ67kaw","business_id":"b7XTyK_z8Nsl-uds_l6imQ","stars":5,"date":"2017-02-21","text":"We love this place! So much better than the others like it. Super fresh and super delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"vhHzlWnGqEkgd0iCile1Kg","user_id":"9t9CYqFB2dBwB3icQ67kaw","business_id":"mmpwjRJpbdWHgoqOhG0Igg","stars":5,"date":"2016-02-16","text":"Love these guys. Tyler even came back today since he wasn't able to spray my backyard (my fault) last week! Always professional and so nice.","useful":0,"funny":0,"cool":0},
{"review_id":"mxI9HCs5uQyhw2qOydj2Ig","user_id":"4nDS7iADGDadQH1JYXfNMg","business_id":"De8BJmD7PuIxUggJtDFEXQ","stars":5,"date":"2017-05-30","text":"Attorney Jake Smith and his assistant, Leanne, handled my case with diligence. They were both easy to get ahold of when I needed them and I was very happy with my settlement. :)","useful":0,"funny":0,"cool":0},
{"review_id":"dzOTgYr3kEhqeUmeCgnb7w","user_id":"Ho3YV44bT3kcwZcijr735w","business_id":"PAr8XQLgVx2bFIs7OCqPwg","stars":1,"date":"2015-03-15","text":"DO NOT EAT HERE!!!! This place doesn't deserve a star!  Ordered a Philly and a gyro both were garbage!  Not to mention the HARD French fries we got..step your game up Geno's.. Definitely not eating here again!","useful":0,"funny":0,"cool":0},
{"review_id":"q69R8H5bYPT6q5jH8RUZ4A","user_id":"PDPHG0jOo6otveyNUdWy2A","business_id":"Ul4tIj6lr0XHsFJWxvnDTA","stars":5,"date":"2017-05-21","text":"Ben Correa helped us to sell our NV house while we relocated to TX three months ago; because the owners are out of state, Ben picked up alot of extra duties such as checking on the house, changing lock, managing contractors (we did a little touch up work before selling) and coordinating different   parties that were in the state, out of the state and outside the country! Never hear him complains and always on top with the next action plan. Ben has many years of real estate experiences and extensive networks that will guarantee a solid result, whether you are buying or selling. He shared his honest, professional opinions regarding the market trend and helped us come up with a strong listing; we had couple offers within three days on the market and we ended up in a favorable sale (pending) only one week of listing. We sailed smoothly after that; the house was sold without drama per the agreed closing. We have also used Ben for buying a short sale house which requires more paperwork and negotiation. He tackled them all efficiently! What can you ask for more in a realtor? Ben is our only choice; we are very demanding clients but both transactions we were very pleased with the results. Oh and he truly value each clients' need and treat us like friends.... I think it's a no brainer for me to say, \"yes, i highly recommend Ben Correa!\".","useful":0,"funny":0,"cool":0},
{"review_id":"cpUlEIeGIfnMUKKRlOYHjw","user_id":"TDr257Q-nb96dxUqovMkAg","business_id":"Ki9N8VBWvEs3FOpAjeNWFA","stars":2,"date":"2017-07-09","text":"Culver's does have good fast food but beware of drivethru.  Back in May, part of our order was not put in bag.  Living thirty minutes away, I called and the manager promised to mail a coupon voucher, to replace items not received.  This was in April.  To date, have not received.  Multiple emails unanswered.  #customerservicefail","useful":0,"funny":0,"cool":0},
{"review_id":"CRk0oOO7fXtDFSAua_5uxg","user_id":"TDr257Q-nb96dxUqovMkAg","business_id":"qLB08x1bZeXRylZ88amSsw","stars":1,"date":"2015-06-07","text":"Never. Ever. Again.  Service was lousy- large party- but they knew we were coming.  Reservations but did not matter.  Took an hour for even the drink order. Over an hour for food - then another hour to get the bill.  Food was not the greatest either.  Gave it a shot-we won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"60xRyxx48avIqCGJu648sg","user_id":"44ijGDYfGY_NHvJygBpoHw","business_id":"-AtzcXIwEP6yO7rM9CM9ww","stars":5,"date":"2009-04-26","text":"Excellent, low key Mexican food. Great for a casual lunch. The staff is friendly and very attentive...\n\nNo alcohol served, they don't have a liquor license","useful":1,"funny":0,"cool":0},
{"review_id":"Bol8Sr3fQGgthHo-lX78Dg","user_id":"CYB6sZzsCM9Y70RHrFUAmQ","business_id":"ww_MXl-qDLeYdYTZZ9KWbA","stars":4,"date":"2010-03-16","text":"I love this place, one of my favorites in the West end. I like that their noodles a little wider and fresh. They are pretty quick, and the broth is consistent. For those of you who enjoy their soup on the spicier side, they have a couple chilli oil jars kicking around. which is a big bonus for me, seeing as i bring my own sometimes to pho places that don't have them. i'm pretty much a regular there.","useful":0,"funny":0,"cool":0},
{"review_id":"Fg1vqJUPd51yTF4KdrKCpg","user_id":"CYB6sZzsCM9Y70RHrFUAmQ","business_id":"Whzg5Koaz9yJ6mwIl7QkqQ","stars":4,"date":"2012-11-07","text":"This is my local pho spot on the Plateau.. Ohhh and they now deliver :)  They're always consistent and I find the prices good for a Vietnamese restaurant. The food is is fresh and I know I can count on a good bowl of pho when I'm craving it. Broth is usually flavourful and they also have great Bun. I'm glad it's around the corner from me!","useful":1,"funny":1,"cool":2},
{"review_id":"QHxRO4wa8F9bW1f-jT3Abw","user_id":"CYB6sZzsCM9Y70RHrFUAmQ","business_id":"C5f0zLJ822I1EvVLplJDcg","stars":5,"date":"2013-11-22","text":"The first time I went to Oasis I had the oxtail and a side of fresh salad. It was delicious and I'll definitely be back for more. The oxtail had lots of meat on it and was perfectly cooked. The place itself is cute and cozy with a 'ma and pa' type feel to it, which I prefer. So if you are looking for home-cooked Jamaican style dishes, it's worth checking out. The owner is lovely, she is super sweet and charming. Oh and yes, her  home-made hot sauce is bomb.","useful":0,"funny":0,"cool":0},
{"review_id":"0a28cD1Zl2pWkgV1GdHFgw","user_id":"CYB6sZzsCM9Y70RHrFUAmQ","business_id":"xlMgaPOpd_99SFTuOtDH0A","stars":1,"date":"2014-09-01","text":"Group of 7 for a Sunday brunch.\n\nStep 1.  order 7 caesars.  received 5.  was felt to be responsible for said error.\n\nStep 2.  ordered a mimosa.  order was refused on the grounds of it being \"to classic\".  was in turn up sold to a 14 dollar drink.\n\nStep 3.  ordered an assortment of egg dishes for the table - all were incorrectly or incredibly over-cooked.  again, was felt to be responsible for the missteps.  this doesn't even compare to the preparation of the pork belly which were essentially jerky.  or worse.\n\nStep 4.  the tomatoes were great.  \n\nStep 5. THE CAESAR'S WERE 11 DOLLARS!\n\nStep 6.  as such, it was 100 dollars per couple for what was an entirely unsatisfactory brunch experience.\n\nStep 7.  we will never go there again. ever.","useful":9,"funny":1,"cool":0},
{"review_id":"RtU7Xg_Hoik9NsOrz_5VBQ","user_id":"CYB6sZzsCM9Y70RHrFUAmQ","business_id":"MHgCSMjjLBa11ul2as6dpw","stars":4,"date":"2012-11-20","text":"Hiii, I'm Laotion and I just moved to Montreal recently and was one day craving Lao food. I decided to look up Laotion resto's in Montreal..I wasn't expecting anything buuut BAM! I found one :) It's not close to where I live but I decided to metro up to Cote Vertu and to my surprise the food is really authentic :) \n\nI've had the papaya salad, chicken wings, tom yum soup, pho, lab and Laos Sausages. I love it all. I'm ecstatic there's a place that has some of my favourite dishes that no other restaurant in the city has. I go at least  once every couple weeks when I get cravings for a home cooked meal. \nBeware, if you asked for the papaya salad spicy..you'll get it spicy! I like the way they use crab paste in there too to give it that extra fishy taste the way I like it. (Most Lao people eat it like this)\nThe atmosphere is pretty simple and easy, prices are decent. I like hearing the women cooking and and talking in the kitchen, makes me miss talking Lao to my family. Things are fresh and made to order so if you're in a rush it's not the place to go to.","useful":6,"funny":0,"cool":4},
{"review_id":"eSsK1LiDjen4mA0hkh_8sQ","user_id":"IVh8umIzfXmtvbzMLs_pgQ","business_id":"4mb32UmQULqg7IMck28vog","stars":1,"date":"2016-01-16","text":"Horrible service. 2 other tables in restaurant . Waited over 30 minutes for food and drinks. Drinks were not brought out with food or before food. Had to wait another 10 minutes for drinks. Staff only starred at us while we ate and had to wait another 10 minutes after done eating for the server to come over and give us the check. Food was ok small portions. Never going back!","useful":1,"funny":0,"cool":0},
{"review_id":"rZuQrmoN6Cn1OvsNcYAO9w","user_id":"IVh8umIzfXmtvbzMLs_pgQ","business_id":"FMIwjG47DRY7vbpVW9A3uQ","stars":5,"date":"2016-07-09","text":"Awesome customer service. Highly recommended place to buy appliance parts. Went in for an AC motor today and Eddie hooked me up with a new motor and even wired it to the plug in so install was a snap. If u need any parts ask for Eddie he went out of his way to help and get me set up.","useful":1,"funny":0,"cool":1},
{"review_id":"mAB47rzU7APfxFo8RLmOYg","user_id":"aNfOG5uIpFnrZPCm-Q5Y_w","business_id":"Oj4PqiXtPTd4kZdI5aG1uw","stars":5,"date":"2017-01-26","text":"This place has such fresh food and the price is so reasonable. My spot to go for dimsum and traditional cantonese dishes any day.  5 star for food quality and quantity, service, and hot mustard","useful":0,"funny":0,"cool":0},
{"review_id":"8K5s28_YvXTw9CM8opKw6Q","user_id":"btF7YF6Sq5Y7h2uFkXI8Bg","business_id":"XPkyhoAoCXPmmCdbMpxLHg","stars":4,"date":"2015-05-05","text":"The sushi I had was great! Tempura was also really good. The restaurant was packed with limited parking. I will definitely be going back!","useful":0,"funny":0,"cool":0},
{"review_id":"CUNKX0mOrh76hJaHKyZ-rQ","user_id":"WznfyEZ_Adq2NHNnG8RqbA","business_id":"cSk4hIuOgdKsJfOooa3Sbg","stars":5,"date":"2017-02-19","text":"I got helped out by Jorge Moreno and got some awesome service! I was impressed, his first time helping me out and he won my trust with an astonishing cut and some great customer service. \n\nNow i have been coming here for a couple months and by far i can tell you this is the BEST barbershop in Chandler. I wouldn't even think about going to another shop. \n\nJose is my favorite barber no doubt!! I mean this guy puts his soul and heart into all his cuts, if you have the pleasure of getting your fade done by him consider it a blessing.  \nI would highly recommend to set up a appt with them because they are often busy.","useful":0,"funny":0,"cool":0},
{"review_id":"0zskr7HU2jlmBzE_Vg57Vg","user_id":"KYrBcYhTfQutc7Z-Oa1fUg","business_id":"1gXPQJYB1zS91N2tbqQo6g","stars":5,"date":"2011-04-26","text":"Great Italian Restaurant!  Nice patio with live music in the summer, or a welcoming, romantic atmosphere inside.  The food is above average and reasonably priced.","useful":0,"funny":1,"cool":3},
{"review_id":"4sB6FHkZecw39mw90uLJXw","user_id":"KYrBcYhTfQutc7Z-Oa1fUg","business_id":"IFaRfrlwhQo4gILB0wmA-g","stars":5,"date":"2011-05-15","text":"Very good food!  (I've eaten almost everything here seeing as I live within walking distance)The cold sandwiches have A LOT of meat on them, almost to much.  I usually have to take so much off that I could make another sandwich.  If you are on a diet or want something lighter get the steak salad.  It may sound weird if you read it off the menu but it's Delish!  Oh, and of course, the Philly cheese steaks are pretty unique and gooooood :)","useful":4,"funny":1,"cool":1},
{"review_id":"Lt52n1WZ8HlhmBUz6ICxiw","user_id":"KYrBcYhTfQutc7Z-Oa1fUg","business_id":"N7Gkwbfs4sDikX4qHg_fGQ","stars":5,"date":"2011-05-15","text":"Amazing drinks specials and tasty Mexican - pretty much all ya need!  Relatively cheap prices too.","useful":0,"funny":0,"cool":0},
{"review_id":"HeFTBHAhfWT5Weisf_-P6g","user_id":"ML6Xm6XTESoT308nwhiylA","business_id":"GEk5OqxjRyTAY_Va_NSi3A","stars":5,"date":"2015-04-14","text":"The best family dollar on South Blvd.  They have a friendly environment store crew. They always have a smile on their face no matter what and no matter how hard life gets to them.  They do their very best to keep up with the customers and they have the best G4S security working for them as well for second shift. The store crew members know what it takes to work in retail and they clean their store daily :)","useful":0,"funny":0,"cool":0},
{"review_id":"FBmmASwGDgCM2S55ayLR1A","user_id":"13pXNVZXCLJMdTa9BcofDA","business_id":"6tLL1P8k9drb7MJEVwmRhg","stars":4,"date":"2009-11-10","text":"I recently had another birthday and happily started my evening at Papago.  The best thing about this place is that you can trust they will always have something new and really really fantastic on tap to try out.  You would think that would be a given, with 30 taps available.  But I just get this good feeling that they put a lot of heart, and hours of tasting (rough) into surprising and pleasing their patrons with the choices.\nI've enjoyed every visit I've made to Papago, but those guys made it very special for my special day.\nI haven't had the opportunity to try the food yet. Next time, I promise!","useful":1,"funny":0,"cool":0},
{"review_id":"_pJVuRSXlrmNyL1xY4o09w","user_id":"13pXNVZXCLJMdTa9BcofDA","business_id":"2fsJzlV09zPV12wT037pig","stars":2,"date":"2012-02-24","text":"I have been working at the ASU campus for a little over a year and I've visited Dave's about 5 or 6 times.  I was never very excited about their beer or food, but I love supporting local brewpubs, and I liked the atmosphere. Especially the patio and outdoor bar.\nI have a pretty forgiving palate when it comes to craft beer, but Dave's just falls flat. No complexity of flavor in any of the beers, although I haven't tried the stout. They aren't bad, they just have nothing to stand out.\nBut the reason I decided to write this review is that I was tremendously disappointed during my last visit in early Feb.  Since I work nearby my visits have often included lunch or happy hour food, and I thought they had a decent selection of affordable options. But they removed some of my go-to vegetarian items from the menu.  When I expressed my disappointment, the bartender told me they took the veggie items off because they weren't selling as much.  I can see why a restaurant might stop advertising a item that is not selling.  But there are few replacement options when you start removing vegetarian choices.  In addition, when I asked if they still made the veggie wrap at all, the bartender simply said no.   I hate the thought of being high maintenance, so I didn't press the issue. But I imagine that it wouldn't have been that difficult to do.\nSince the waitstaff was not interested in my satisfaction, and since the other food I have tried (bar food, typical salad) is just average and I prefer other beer, I won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"woDFxOKEfODIbKNPGHOgWw","user_id":"13pXNVZXCLJMdTa9BcofDA","business_id":"XKJdnU_LK5tE5ENJUxFUmQ","stars":5,"date":"2012-02-24","text":"I came to Class Fitness over a year ago after I injured my ankle and had to take a break from running. I started with rowing, which I had never done before, and signed up for a full membership within a month.\nRowing is an incredible total body workout that quickly improves your performance in all athletic activities.  When I finally started running again, I was surprised that I was doing better than before my injury! I would never have stuck with it and developed this appreciation if it wasn't for Morten. I can't imagine a more knowledgeable and devoted rowing coach- an opinion shared by every student I've met in his classes.\nSince joining I've added spinning, boot camp and yoga to the list of classes I regularly attend. The schedule is perfect for me (early mornings, but there are evening classes as well) and I always look forward to starting my day with this group. Taking a spin or boot camp class from Linda is fun and inspiring.  She accomplishes an unbelievable amount every day, but nothing ever weakens her contagious passion for fitness.  The community of members is great too, and there are always opportunities to join others for local events like races.\nAs a person used to just getting up and running for my exercise, I never thought I would want or need to join a gym. But I am so happy I did. At Class Fitness I've found friendship, accountability, and new adventures!","useful":0,"funny":0,"cool":0},
{"review_id":"JG6Tin5qHf8U6Fd1vWvShg","user_id":"cWqUl_hLE6xFAhSD03gUIg","business_id":"PAXUkXtz3YbzNZYlSTuMhA","stars":1,"date":"2015-02-28","text":"Every time I have tried calling them, there's always a problem. I can't get in contact with anyone to set up an appointment!! They couldn't even tell me which location was closest to me and do not return my calls! This is terrible!","useful":4,"funny":0,"cool":0},
{"review_id":"YRdVXbW4NLkLDMljeQO0YA","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"PRWWp5PnE35i05SVamSV-g","stars":5,"date":"2011-07-26","text":"Best Thai place around, unfortunately it appears it's closed :-(\n\nI can't find anywhere as good as 7 Star, food was always fresh, inexpensive, awesome taste and great service. Will be missed","useful":0,"funny":0,"cool":0},
{"review_id":"ByLkyyCMU4_Uhbo3KyO-1Q","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"NL3U1UB9sZvHbZQ77oNHVw","stars":5,"date":"2011-07-26","text":"druggies and drunks make the atmosphere.\nthe food's reasonably priced, cooked to order, and the beer is cold.\nwhat do you expect when you pay $3.50 for a burger, fries and pop?","useful":2,"funny":0,"cool":1},
{"review_id":"KG9DFUNYYIIfUIgRH_IzKg","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"AnemBUVAb9NRaselL2KITA","stars":2,"date":"2011-07-26","text":"Many better sushi places downtown. Oyshi service is to be desired, food is decent but always gives me the trots afterward. I only go there if everyone else is, too many better places around.","useful":0,"funny":0,"cool":1},
{"review_id":"tL0npNj0O73cFHyxQO2YRg","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"1w7J0Ja9SSM3V_zwYTZScQ","stars":5,"date":"2011-12-05","text":"Fantastic value and great staff. Had my daughter's birthday party there, Priscilla was a pro and great with the kids.\n\nI'm very pleased with the experience, I know our the other parents there were pleased too and am sure we'll all be back there soon for another birthday party.","useful":1,"funny":0,"cool":1},
{"review_id":"Zrb1n0D2366zbND5IsDUag","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"Yh18ij9FW0ZkpWuFJnb8Xg","stars":3,"date":"2011-06-10","text":"food tasted good but their specials are very expensive!! they don't tell you the price and watch for sticker shock when the bill comes! tasted pretty good though.","useful":2,"funny":0,"cool":0},
{"review_id":"NiRnkMse6U3uIurARNMWuA","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"7xWfQitZLBrHh3HZCAggPQ","stars":1,"date":"2011-06-10","text":"i don't know why it's not posting my full review but I'll sum it up with this:  i've been a few times to give it a fair chance, over priced, dry tasteless food bad service. won't be going back","useful":1,"funny":0,"cool":0},
{"review_id":"co6QTO7aO1sfodbl7B-OSQ","user_id":"jdnXY4Ht8GbmOgt2v0AZ_g","business_id":"kjZ7Mk1fvjgFCQxHpEn4hw","stars":4,"date":"2011-07-26","text":"cheap sushi, $12.99 lunch special is good, made to order and pretty fast. good service always there to refill your water.","useful":0,"funny":0,"cool":1},
{"review_id":"X6rEeCUf0erT8WjwM5uVBQ","user_id":"ESPUoB790fP3Kifqly-wvw","business_id":"M3oGsxwFK9l0AKUgciPEMw","stars":5,"date":"2016-10-02","text":"If you're in need of male adult\/child grooming, this is the place and my barber, Steve Duroseau, is the penultimate professional to see. He's a wealth of knowledge, great banter and the best hair care professional I've known. Check him out at The Exec Room","useful":1,"funny":1,"cool":1},
{"review_id":"I470Zhy2rJZkEg8Q4L5Nww","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"dUffgo9Lh_Vk9TLuFR5ywg","stars":3,"date":"2013-12-05","text":"Staff is always friendly. Pizza could use more flavor IMO. Vino bambino salad is awesome!!!","useful":0,"funny":0,"cool":0},
{"review_id":"xOkGLKBQE1yKoMLXoGhWAQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"xvIKjbhFydKRzrnibKuBDA","stars":3,"date":"2013-12-02","text":"Switched out my phone which was nice, but I think they gave me a \"refurbished\" one...","useful":1,"funny":0,"cool":0},
{"review_id":"1QDXh8O8G7sbqKUAiNwNxg","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"7pGWy3mR7gjMSE6x2njqPA","stars":2,"date":"2013-12-08","text":"Went on a weekend morning more than a year ago. It says something that I still remember the details of my visit. They were just unorganized. Possibly overwhelmed. Lady who I think was the owner was just barking orders. Maybe we should have waited for a table outside for a more peaceful dining experience...","useful":1,"funny":1,"cool":1},
{"review_id":"hiBk2l4jtj2TDz79pVk4AA","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"d10IxZPirVJlOSpdRZJczA","stars":5,"date":"2013-12-08","text":"Excellent ambiance. If this place was in a slightly better location they would be unstoppable. Regardless they do so many things right. Excellent food, and old school bartenders that actually take pride in the cocktails they prepare. Very impressed.","useful":0,"funny":0,"cool":0},
{"review_id":"TG7qm9k_MmKSdlsy7dxIlw","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"K-uQkfSUTwu5LIwPB4b_vg","stars":4,"date":"2013-12-08","text":"Service is always solid. Above and beyond. Food has occasionally been a bit salty... Love the fresh squeezed juice from bar for cocktails.","useful":1,"funny":0,"cool":1},
{"review_id":"VNE5AmYK92-vR7FfI29_HQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"C8D_GU9cDDjbOJfCaGXxDQ","stars":3,"date":"2013-12-08","text":"Wanted to like it... The hipster staff would be better suited for the Arcadia area. Plaid, plaid, plaid. Reminds me of the Vig staff. Food is ok. Gone three times with my employees for work lunches. There was always some sort of issue with someone's grub. Surprised it isn't perfect once I was told that Sam Fox lives on the same corner...","useful":1,"funny":1,"cool":1},
{"review_id":"NsrStite-TKzmwdkD9G4Dg","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"p-8AMN9Q0qwym-3Pdle20Q","stars":4,"date":"2013-12-02","text":"Probably their busiest location. Quality food, but the portion sizes at their original location always seem to be bigger! Stay clear of the one in fashion square mall. Quality just isn't the same. Guess that is to be expected though...","useful":1,"funny":1,"cool":1},
{"review_id":"hRHpaS7Mg4mICYczI3mm4w","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"0gXYLVPNWz0WT8wXQVpS0g","stars":4,"date":"2013-12-08","text":"Me and my date were only table in restaurant. Server was very attentive. Almost to a fault. Sometimes you just wanna be left alone to chat. But really I can not hold it against them for caring. Once I expressed that we were good and wanted time to chill they let us be. Food was good, but more to my dates liking than mine. Overall pretty good.","useful":1,"funny":0,"cool":0},
{"review_id":"_p58Bc8R-K7jMaxRVn1Rww","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"1d6c6Q2j2jwVzBfX_dLHlg","stars":5,"date":"2013-12-08","text":"I'm not really big on most if the menu but the salmon chop salad is amazing. I need that recipe!! Who can I bribe...?","useful":0,"funny":0,"cool":0},
{"review_id":"vN0iLPrU9SJZrfA6Sn2nvQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"Xgk-d2x59qhPxOsuCKeShw","stars":3,"date":"2013-12-08","text":"A decent substitute for Pita Jungle. Prices are a bit high for what you get compared to Pita Jungle. I have only ever gotten Togo food. I imagine it can sometimes be unpleasant to eat there. They allow Hooka smoking on patio. Even picking up my Togo food I have to brave the Hooka smell. Food is pretty good, just might wanna tweak a couple things.","useful":1,"funny":1,"cool":1},
{"review_id":"E42SDNB-HffM5iL0J0spPQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"eDlgbI0Qg_mmI-Osvci0gw","stars":3,"date":"2013-12-03","text":"Sadly this place has gone downhill since it changed ownership. The original owners did an amazing job. Now just another corporate owned restaurant, where quality gets lost... So sad. Used to be amazing...","useful":0,"funny":0,"cool":0},
{"review_id":"h4wOLuyBpDA7Gz6OMVL3mQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"jG1jcAeDw0pZTHCNC5kw_w","stars":5,"date":"2013-12-08","text":"Haven't been in a few months, but I have been meaning to post my review. My office is down the road and we used to visit Grazie on a regular basis. Also a great place to take a date. Pizza is always excellent. Love the taste and texture. I read a review before I started this post. Ummm \"Christine\" why would you wanna ruin excellent pizza with ranch? Lol. Btw don't go to Grimaldies down the road cause they don't have ranch either. Maybe Pizza Hut? So funny. I like ranch too but def not needed for Grazie or Grimaldies pizza pies!! Maybe just bring a packet in your purse... Oops I kinda got off topic. To sum it up: great food, wine selection, and last time I went there was an intoxicating server. She had a great accent...","useful":0,"funny":1,"cool":0},
{"review_id":"AsW1bZdTr7s7gg3d51Wxzw","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"67zCgILB2h6JoSvFabVe7g","stars":4,"date":"2013-12-08","text":"Very simple menu, but ambiance is always amazing. Looking forward to returning to see the Christmas display. I wonder if they still do the huge champagne glass Christmas tree... Bar makes the \"classics\" spot on.","useful":1,"funny":0,"cool":1},
{"review_id":"_mq69AZ3GuLzhDRHOEotVA","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"Hv3iuAYsoF2FjH0ND9rIKg","stars":2,"date":"2013-12-02","text":"Ordered prime rib from counter. Would have been fine except guy wrapped up the au jus, napkins, and horseradish sauce with meat, THEN weighed it. At $29.99 a pound that sure was some expensive dips! They must make a pretty penny if this is common practice...","useful":1,"funny":1,"cool":1},
{"review_id":"8QVtDA5qucetm5iikMXhuQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"NXWWlAJi2kDltKRiSzAk2w","stars":4,"date":"2013-12-21","text":"GREAT selection of wines. Also surprisingly affordable. They also carry a lot of unique items\/mixers. Cracks me up all the people that are tasting wines\/beers like they area actually gonna buy. More like get buzzed for free! Reminds me of cost co grazers. \"Hmmm this wine would be great for my wedding reception dinner... JK, peace out suckers!\"","useful":1,"funny":1,"cool":1},
{"review_id":"4ZD4oyvKX8ThpycJhLA0wA","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"_n3w5BK4-k7iXCWifCjUZg","stars":5,"date":"2013-12-08","text":"This place knows its identity and does it right. Just a comfortable Gem in the mess of pretentious Scottsdale clubs. I haven't been in a bit, but I hope the bartender Kiki is still there. So friendly and attentive. Such an intoxicating smile. ;)","useful":0,"funny":0,"cool":0},
{"review_id":"nIZAwo6tc0XGIPxV-m3omQ","user_id":"CoCkuPtRB3cYZaHlAI-Vbg","business_id":"zrDi4gEaUi64lAMfJU51dw","stars":4,"date":"2013-12-08","text":"When the have it available, the grilled artichoke app is amazing. The filet is also consistently solid. Great char on it even though I order med rare.","useful":0,"funny":0,"cool":0},
{"review_id":"E5BAOhHRqWtA-p02ol1oiw","user_id":"zTiRCcNRQgsuCr9HE2TNQQ","business_id":"wpnLPAnkMEb1NpC3xiD_qg","stars":4,"date":"2014-08-26","text":"As a local from Hawaii, this is place is pretty good. I tried: \n\nKalua pork and cabbage\nHamburger steak\nKorean chicken\n\nThe korean chicken was fantastic. Just alittle but of crunch on the skin of the chicken and just the right amount of spice. \n\nI've had better Hamburger steak, but it'll have to do. I wish there were more vegetables on the plate\n\nI've had waaaay better kalua pork. There isn't much flavor to it. \n\nThe mac salad on all the plates was just like home in Hawaii. Just a dash of pepper and it was like being home. \n\nI really disliked the cash only deal. You're in a casino, people.","useful":0,"funny":0,"cool":0},
{"review_id":"JYVu3cuQX6HJueHkHYxSbw","user_id":"BJNcLl4SHRdXlz0RUC7E-g","business_id":"-B_4pHQkzU12AMaYkkY4cw","stars":1,"date":"2013-03-09","text":"Highly disappointed in this place.  First of all the line is long, the pick up register was empty and could have been used to make the line move quicker. We were not told that the sauces were at a station. When we got our meals my mac and cheese was cold and the pulled chicken sandwich was dry.  To top it off, all of the buns on our sandwiches were soggy and fell apart.  Overall save your money, there are better bbq places than this one.","useful":0,"funny":0,"cool":0},
{"review_id":"eUOPHw5ygnwrd_TuRl4RIA","user_id":"BJNcLl4SHRdXlz0RUC7E-g","business_id":"157Y-QIXWnqQra78_WfW5g","stars":5,"date":"2012-10-06","text":"I just don't know where to begin....I attended my cousins wedding at the tudor arms hotel on Friday October 5, 2012.  I as well as my parents were overwhelmed with the courtesy and attentiveness of the staff, from the valet's to the bartenders\/servers to just anyone walking by...we were all impressed with the professionalism.  We have never had quality at other reception halls\/weddings we have attended.  By far this made our evening extra enjoyable!  Thank you all for your superior attitudes and service!","useful":3,"funny":0,"cool":0},
{"review_id":"0mc53W6rrD6d2h02OwZ-4Q","user_id":"BJNcLl4SHRdXlz0RUC7E-g","business_id":"Egd-0nDgzZGEVA0R09yyUQ","stars":2,"date":"2013-03-23","text":"First of all we wanted to try this place for the first time and we just purchased a groupon so we decided to go. We were excited at first the bread and salad were good but the meals were ok nothing spectacular for the price. Our major disappointment came when we were ready to pay, the server was less than pleasant when we handed her the groupon, then when she brought back our revised bill she marked a 20 percent gratuity on it! Really?!?!?! A tip is based on your service and not on what you think you deserve. Her service was ok at best and being in the restaurant industry we were going to tip her on the entire amount but since she wrote it in the credit card tip line we decided not to tip her on the entire bill! Needless to say we will NOT be returning! I will be sure to spread the word!","useful":0,"funny":0,"cool":0},
{"review_id":"5JGyEtzM4JoJVVOhl1-HOA","user_id":"BJNcLl4SHRdXlz0RUC7E-g","business_id":"4bbnMcaVJYlDcTj1vgOvFA","stars":1,"date":"2013-01-30","text":"I decided to try this place and it was the worst experience EVER!  I made an appointment for Saturday 2:30, I was called 40 minutes before my appointment to reschedule for 3:30, I agreed, when I arrived, the receptionist was playing receptionist and doing a pedicure...ok. Well when 3:45 approached I had to question why I was waiting, there was no one in the place. So when I got in the chair (now 4pm) the woman, elderly, acted like she was new to the place, didn't know where stuff was, couldn't operate her blow dryer etc. So when I was getting my hair washed the hair bowl kept moving like it was broken. I also asked if I could get a eyebrow wax since I was one of the two in the salon, she said yes and proceeded to pull out sissors, really? Long story short, I came home highly disappointed in my services and experience.  A month later and my hair is faded and my eyebrow is still growing back.  HORRIBLE SALON!","useful":2,"funny":1,"cool":0},
{"review_id":"RCuVotPSaekz3yECWmXsuA","user_id":"li1wApM75XJNpYjo_uqsLg","business_id":"LwafYd6RYGPnnjoMc0YHaw","stars":1,"date":"2012-10-21","text":"The Parma location needs help, BADLY!\n\nThe menu at the Parma location has been reduced to a badly typed 3\/4 page menu, from a FULL MENU!  Of course, the full menu is still on the website,misleading people.  They were out of fries, out of mushrooms, and out of wings!  The Parma location has repeatedly had the worst service of any restaurant in town!  Tonight, service was terrible, even though the place was empty. Our beers sat at the bar for about 8 minutes, until I got up, walked over and got them. Ten minutes later, when the waitress returned, she said \"oh, you got your beers?\" I bit my tongue. Last time I'll be going here. This place has went downhill fast.","useful":0,"funny":0,"cool":0},
{"review_id":"3nU8X12PDbdiawvKSXimDw","user_id":"FrSIT6NJlpoIswOHuLQ_Tg","business_id":"5shgJB7a-2_gdnzc0gsOtg","stars":5,"date":"2011-01-07","text":"LOVED this place! We came here with friends that live in Las Vegas and they introduced us to this amazing place. I fell in love with the hoisin duck rolls, stuffed dates and the mac & cheese. It was also my first time having tres leches chocolate cake which was like an orgasm in my mouth! the sangria is delicous and they have soo many different types of mojitos there to try. The prices are excellent. I can't wait to go back!","useful":2,"funny":0,"cool":1},
{"review_id":"kipIOhHk15vtzm-9IJrDpw","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"dn51F67VLgPuqy_8SFk9oA","stars":5,"date":"2015-03-06","text":"Only place I know of charging only $10-13 for a steak dinner plate. And it tasted great! They also have they're own brewery but the Amber Ale I tried was ok, huge glass though maybe 15-20oz which was awesome because it came with my plate. A great local spot.","useful":0,"funny":0,"cool":0},
{"review_id":"bf-XwaiDcF6p5k6ZirtVUQ","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"9GPTELAPPpT5vUxad9AoCw","stars":1,"date":"2015-05-10","text":"Went for the first time and they gave me a stale piece of cake.. What kind of garbage is that. Like it had sat in the back or something all day. Worst place ever don't ever come here","useful":0,"funny":1,"cool":0},
{"review_id":"S8hojGdLFxKjGfLS5SyPkA","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"5uMby-2z4xIFBQjgTLCYdg","stars":5,"date":"2015-03-07","text":"Awesome spot! The bar tender Angie was very nice, drink prices are fair, and they have a cool small good stage playing local punk bands. Being an audio engineer, I dig any spot that plays live music while you sit and enjoy your drink. There was a wild older lady who seems to be a usual here but being from hollywood that's nothing new to me haha definitely come check it out","useful":0,"funny":0,"cool":0},
{"review_id":"dhrmifbi5GdXL1pkkApQiQ","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"hvridAom9cjx4mfFYasVrA","stars":5,"date":"2015-03-06","text":"Went to get an oil change yesterday and all went well. Damien was very helpful, gave me some great recommendations on future services I need on my car nothing stupid and unnecessary. It wasn't crowded I was in and out in about 30 minutes. Very convenient","useful":0,"funny":0,"cool":0},
{"review_id":"XhxEbfW2GJ70IRvd7zS0GQ","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"u_8cVZyxh0J468zEZUjNDQ","stars":5,"date":"2015-04-09","text":"This place is awesome! They have an amazing variety of pizza to choose from and each slice is HUGE. All the ingredients taste delicious. The pin up girls Asia and Angela were adorable. Very kind, always smiling, really funny too. Had me laughing and smiling from the moment I stepped in to the moment I walked out. Definitely the best spot to grab some pizza on the strip everyone should check this place out.","useful":0,"funny":0,"cool":0},
{"review_id":"HIYj3qenUoHHyULiw0ZC8g","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"Yysbic2T_KH2oAflGRBJJQ","stars":1,"date":"2015-03-10","text":"Absolutely.. Terrible. Just got my cut done so I can go turn in job apps tomorrow. Should have went to a barber! Got in quick, very friendly staff. But the dude who cut my hair (Mike) was horrific. So slow.. Cut it all around than went back to finish cause it was uneven, and it is STILL uneven which drives me crazy. I asked for a one and a half and it's the longest one and a half I've ever seen, more like a two. I asked to taper down the back and he just lined it up, and did not line up around my ears. I have to go spend more money tomorrow morning before I head out to get this re done and I have to get it a shorter size now. So angry. Don't go here for your own good.","useful":1,"funny":0,"cool":0},
{"review_id":"g0vURBzjcGJ5hyOxtJhDCQ","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"QmIXl-zAw3kBOgnzcLidog","stars":1,"date":"2015-03-11","text":"Come here for all your smoke goods.. NOT YOUR VAPING GOODS!!! First juice I've ever had that literally gave me a headache, waste of money. Obviously they go for the best deal and not the quality juice, I don't think anyone actually tries the stuff before they buy it. Just terrible","useful":2,"funny":0,"cool":1},
{"review_id":"BzKhNNPXHuGQt5452HCUOQ","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"LxPNKVBrbqIHog3MI-rkDQ","stars":4,"date":"2015-03-06","text":"Came in the night before I moved into my new spot in Vegas. Staff was very kind, room was clean and nice, and the free breakfast at their Denny's was a really good deal. $100 for a 2 bed, not bad.","useful":0,"funny":0,"cool":0},
{"review_id":"eAOoWGvoeLbTeDhFka7VVA","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"lOQPeguczAueJnLmDUTfGg","stars":5,"date":"2015-03-06","text":"My 5 stars are specifically for the quality of the food, the meal was phenomenal. Amazing flavor and a very large portion. A tad bit expensive but what can you expect from a great quality restaurant. Hands down one of the top 5 Mexican food spots I've ever had, I'll be back whenever I find myself on the west side of the strip.","useful":1,"funny":0,"cool":0},
{"review_id":"TThqtsbr6RaIUjXavL1d7g","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"SIWwh4m6kkvUaa5skrVAQQ","stars":4,"date":"2015-03-10","text":"Stopped by this place on my way home from the weekend swap meet, and I must say that I'm glad I did! Food tasted fantastic, didn't wait long to be seated and the food came pretty quickly. My 2 reasons for the 4 stars instead of 5... My beans looked like they had been sitting for quite a while, everything was hot but the beans (minor deal). Secondly and more importantly, my $8 Cadillac margarita was way to small. I've spent $6 at other places that were both stronger AND bigger. It was neither strong nor large. Great food though honestly, the steak was cooked perfectly. And the staff is very nice. Was to full for desert but their selection was incredible, easily 30-40 choices and they all looked amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"PSrdzNvanwk2suJKHJmKsw","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"6UqOXFic_vu2JLGuu8YD6A","stars":5,"date":"2015-03-06","text":"Went to Cheers in hopes of watching the Kings game because I'm from LA. Went inside and the guest bartender Tommy was cool enough to find it for me, they have 3 good sized tv screens surrounding the bar so multiple games can go on at once. I met some great UNLV students who gave me some great tips on the town and the drink prices were great ( $4.50 for each beer is cool by me... Beats $7 at a lot of places). They have pool tables all around and juke box constantly jammin great rock tunes. I'll be back tonight for another kings game! Definitely should check this spot out.","useful":1,"funny":0,"cool":0},
{"review_id":"UxPYPaQUBSRmykIAWT9gNg","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"7GHtTixfTGFxx3JG2NdEdQ","stars":5,"date":"2015-03-06","text":"This place is GREAT! In LA, $100 a month to climb at Boulder Dash or virtually any indoor climbing gym. This place is $120 for 3 months! And $10 a month for a gear rentals. They have one big Boulder with all levels of climbing surrounding it. Most of it is inverted which was hard at first since I haven't climbed in about 6 months. But, after a day or two you get the technique to keep your body on the wall. They also have a few auto belays and tons of top rope routes surrounding the building. I saw a guy on a slack line doing some crazy acrobatics in the corner so I guess they let performers practice there to. I'm glad I became a member I go almost everyday now. Come on thru and climb sometime! Friendly people, friendly staff, great prices, and whoever picks the music station has the vibes on point.","useful":0,"funny":0,"cool":0},
{"review_id":"cQcqzuTGheyFkEdqwm-Lxw","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"5B2bliw6ZYnFv8VVCdoSDw","stars":5,"date":"2015-03-06","text":"This place is awesome! Just moved to Vegas on Sunday. I've had 3 separate occasions when I bought e-juice from a local smoke shop and they were TERRIBLE.. One actually gave me a headache ( never ever buy a juice from the company called 'Dolce Vapes'). Anyways, I went into Vapor Bombz and it was great. Edgar recommended some great liquids for me and my taste and the prices were very fair. They have a rewards program so after 9 bottles you get the 10th free! If you Vape like me, that adds up pretty quickly. I definitely recommended this shop it's amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"AQX2ysB0dv9lUVEk4KbNLw","user_id":"ywe_fvZcN3KSIEKapjE6Rg","business_id":"47i-sDR00I4WTOFZE5fIww","stars":5,"date":"2015-06-09","text":"This place is sick! The absolute BEST prices on juice, 30mL for $8 is crazy. They have an incredible selection to choose from and you can choose the pg\/vg ratio for every juice you get. Absolutely crazy, first time I've seen something like this and I'll definitely be back more often. Come by and check it out!","useful":0,"funny":0,"cool":0},
{"review_id":"xDUgNhDgRmWa4yjA1RX-PQ","user_id":"iL42nhZyqGGNuX9Vj379KA","business_id":"iWox6NQVA76eH61toMhxfA","stars":1,"date":"2015-07-13","text":"Got the wrong order twice, took almost an hour to get it right.  Probably just bad luck","useful":0,"funny":1,"cool":0},
{"review_id":"c9pzdYK9842ahEwF-he5BQ","user_id":"-Zdxj4wuj4D_899B7tPE3g","business_id":"oXoVJ0xKv82cBo9U6oEjlQ","stars":5,"date":"2015-07-24","text":"The service here was excellent. Our server, Christina, was amazing. Friendly, helpful, and down to earth. She was attentive without being over the top. Nice relaxing atmosphere and we enjoyed our meal.","useful":0,"funny":0,"cool":0},
{"review_id":"C47DquAr6DbzLjBlaqtT1w","user_id":"-Zdxj4wuj4D_899B7tPE3g","business_id":"u_vPjx925UPEG9DFOAAvFQ","stars":1,"date":"2015-08-04","text":"Dirty. Old. Elevators do not work well. Poor service. Smallest pillows ever! Room was renovated (cheaply)--bathroom was not. And did I mention Dirty? Weird smell throughout casino. Took 45 minutes to check in at 1am. So many better places to stay. Very disappointed overall.","useful":0,"funny":0,"cool":0},
{"review_id":"eLf8798jcxU__juuWVCgXA","user_id":"sl0HgOQ0dkLsAGQOvA7ogA","business_id":"L2p0vO3fsS2LC6hhQo3CzA","stars":5,"date":"2016-03-13","text":"Was in Phoenix for a convention and looking for a place to have breakfast. I found Mate's on Yelp and gave it a shot.  It was fantastic!   Food was awesome, service great, and ambiance was just what I was looking for.  If anyone is downtown phoenix and looking for a great breakfast go to Matts.","useful":0,"funny":0,"cool":0},
{"review_id":"_3Rncl6_kj8z_iQM2-1Znw","user_id":"D_XksECbX7yp9WrxujBo4w","business_id":"Mn474gMKu8P92Mk9jAaoVA","stars":5,"date":"2017-06-11","text":"Randy is an excellent technician, went above and beyond my expectations. Installed my air conditioner and furnace very professionally. They even came and replaced my air filters for me! Thank you very much highly would recommend to anyone looking for any air conditioning or heating needs!!","useful":0,"funny":0,"cool":0},
{"review_id":"de812DE8MgF3LvrlyDFjcA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"A-KVm7iKLOe1X1yAQP13FA","stars":3,"date":"2014-08-13","text":"Cheap and cheerful.  Been here a few times and service and food quality is consistent. Nothing super special but its not terrible either.\n\nI always get the masala dosa - pretty traditional and standard. Could use more filling because I find myself eating a lot of the wrap at the end and just dipping it into the sauce. \n\nHad the pani puri - pretty good, but not really the best deal for the price - I expect a few more. \n\nChaat papri was good as well - but again - could have been more generous with the portion size. \n\nService here is quick - I was seated promptly and the wait staff are attentive, so ordering was quick and easy.","useful":1,"funny":0,"cool":0},
{"review_id":"hUL9h6VbLdlbA0i8GP9MmA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"BxkVct02QHybp54ATZgkUQ","stars":3,"date":"2015-02-28","text":"Came here a few weeks ago with some friends for lunch. They were running \"Jaipurlicous\" so we had that. \n\nI had the tandoori chicken wings as my app - didn't enjoy it all too much - it wasn't the traditional red, BBQ charred colour or taste I expected. Instead it was yellowish and looked to be semi broiled. Wasn't a fan. \n\nMy main dish of shrimp masala was good - really enjoyed the gravy - perfect level of spice and it was really aromatic. The naan was nice and fluffy. \n\nFor dessert I had the gulab jamun. The meal came with one, I could have easily had another 2 - these were rich, sweet and warm (I like them served warm, not cold like some restaurants do). \n\nPrice was great and service was good as well. Will come again and try other dishes, and I know not to order their tandoori wings.","useful":0,"funny":0,"cool":0},
{"review_id":"G9OUiuCy5eTmgpIGjYehMg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"KK7H1bVOMAJnDqMhBv2zpA","stars":4,"date":"2016-11-05","text":"Came on a recommendation from a friend. We had the chilli chicken dry, the chilli shrimp dry, the Manchurian mix fried rice and the chicken pakoras. \n\nMy favourite dish was the Manchurian Mixed Fried Rice - it was just the right level of spice - it's definitely got some kick to it so if you aren't a big spicy food eater you might want to ask them to tone it down. Portion size was huge! We had enough for lunch and dinner the next day. \n\nUnderwhelming was the chicken pakoras - they were not that great compared to others we have had from at other Hakka places. They were also quite pricy for what you were getting. They also came last which was a bit odd since usually they come as appetizers. We were halfway through our meal when they arrived and only had one each since our plates were full. \n\nI know people rave about the prices at this place but it was only reasonable - not a super great deal. Our go to Hakka place is about 20 dollars cheaper and it's good food too! \n\nI would still come again though","useful":0,"funny":0,"cool":0},
{"review_id":"yhYXBKT6qC8WZ3Eq1M7HDQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"7Us3dn3v9o2xMSXA6qztLg","stars":2,"date":"2014-11-23","text":"First time trying Paramount Fine Foods - heard both positive and negative things about their other locations and had to try this for myself. \n\nThis is their newest location. They had been open a few weeks when I visited with a large group of friends. The good news is they were able to accommodate the large party on short notice. The staff were polite, but because it was so busy they were not as attentive as I would have liked. We had to make several requests for garnishes, drinks and cutlery. \n\nThe nightmare came when it came time to order. You had to navigate yourself through the crowds of people to the other side of the restaurant to place your order. They had so many staff around I don't understand why they don't have table service. The nightmare continued when the food took over 45 minutes for everyone to receive their food. Some orders came within 15 minutes, others took up to 45 minutes. By the time the last people received their food the first group of people already finish their dinners. \n\nI was one of the first ones to receive their dinner but it was cold. The beef was very tough - couldn't stab it with a fork and had to use my hands. The rice was quite bland and the salad wilted. I also tried the butter chicken pizza which was ok. Mixed reviews from the other people we were dining with as well - the grilled chicken was good as was the other barbecued items. some of the other pizzas that they had tried we're also just okay. One of the only highlights was the pita bread that was brought to our table when we arrived - it was piping hot. \n\nMaybe it's just growing pains. I will give another location a second chance.","useful":2,"funny":1,"cool":1},
{"review_id":"BIoceYYmdjOnHZ4K8Fbygw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"cFpbP3-trTR9q34lOqiIUA","stars":4,"date":"2014-02-12","text":"Would have been perfect if full menu was available and heat was working properly. \n\nCame with a group of friends for winterlicous. Their heating wasn't working so we had to step over their space heaters to get to our table. It was pretty full considering it was a weekday evening. \n\nServer was very nice - she was attentive and patient. They had run out of a few things on their menu because she said they were very busy from the weekend so we had to make second choices.  They ran out of 2 appetizers, 1 main and 1 dessert so she had to stand there as we all re-read the menu to choose other things.\n\nI had the shrimp app. Very good - big pieces. Salad could have used a bit more dressing. Butter chicken main was amazing. Tender chicken - I can't remember the last time I had such tender chicken at an Indian restaurant. The sauce was delicious - cleaned my plate with naan, which was freshly baked and soft. Rice pudding for dessert with gulab jamun. They put the gulab jamun into the rice pudding. I didn't like that, should have put it on the side.\n\nMy friends had the lamb, beef and mutton. All were raving about their food too. Did not disappoint!\n\nComing back here again next time so I can have my first choice - lobster and shrimp!","useful":0,"funny":0,"cool":0},
{"review_id":"6lmRlkLRF0kSzVndIVAHYg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"ZilzayEdyk70SoI-wruJbg","stars":4,"date":"2016-04-24","text":"I used to frequent Congee Queen at least 3 times a month when I worked close by. I hadn't had the food there for over a year and decided to take my family here since I was selfishly craving it myself. \n\nPortion sizes are great for sharing with a large family. We a family size seafood soup. Should have gone with the smaller size because we ended up taking half of it home. It was really good! For our dinner we ordered a ton of dishes. Lobster, done the traditional way with green onion, Mango chicken and shrimp dish - unique flavour combo - we enjoyed it. Seafood chow mein, general Tao chicken, fried chilli turnip patties, spice and pepper salt squid, snow peas with garlic sauce -  everything was amazing. We had lots to take home for lunch the next day. \n\nOne star lost only because they had forgotten one dish and they had to make it after all the others had arrived. When it did arrive it was good anyhow, but would have been nice if if arrived with everything else.","useful":0,"funny":0,"cool":0},
{"review_id":"w4nUI5EkyJK3QnBPqNlQlw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"_xAJZOKBMPOe47p1MphB2w","stars":4,"date":"2016-03-28","text":"Came here for a big birthday dinner and we were not disappointed. After reading the reviews we were prepared - they did try to up sell out lobster and king crab. We were specific in what size we wanted and for the most part they complied (only paid about 5 bucks extra for the bigger crab).  They come out with the live lobster and crab to show you and to take photos of your upcoming meal. Quite entertaining watching people take selfies with their lobsters. \n\nFood was amazing! I love seafood and this really hit the spot. The presentation was really nice. Enjoyed every aspect of the meal.  The fried crab was really good - best part of the meal for sure! We also ordered a few extra dishes to complement all the seafood. We ordered a whole chicken which was good - on the smaller side considering you can go across the street to the supermarket to get a similar one for half the price. The mushroom efu noodle was meh - soggy and sticky. This place definitely has their seafood skills down - wouldn't order their other dishes. \n\nWe had extras so they packed it up and we had lunch for the next day. The service here was not characteristic of typical Chinese restaurants. We had great service with friendly staff coming by to wish my loved one a happy birthday (we had a cake and they volunteered to refrigerate it for us).","useful":0,"funny":0,"cool":0},
{"review_id":"fJ1sVJj5HLTais_T51nWRg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"ceK2VvPlxPBPo1evXOlD7g","stars":4,"date":"2014-03-10","text":"Except for a handful of items on their menu, the food tastes exactly like Bamiyan Kabob. \n\nThings that are different - less busy, smaller, parking lot is a big mess on a Friday\/Saturday night. Arrive early or you're going to be parking across the street. This restaurant shares a parking lot with a few other establishments, hence why the lack of parking. \n\nWe came with a group of 10 and were lucky that we got a table. A few other parties came in after and had wait for a spot to sit.\n\nThe food took 20 minutes to arrive, but it was good - slightly less in terms of portion size compared to bamiyan, but it was good. Their chicken breast and tikka chicken was good. I did not enjoy their beef kabob - bamiyan is that winner here. \n\nGood, friendly service - will come again!","useful":1,"funny":0,"cool":0},
{"review_id":"buVAAteP-Egxiq99Lf2A7Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"xLUsM-7yFDnXO7m7Xa420Q","stars":1,"date":"2014-02-12","text":"There are way better places to get your fix of Chinese buns from.  There is zero customer service here.  The buns were sub par. I've had much better buns from the local Loblaws and No Frills that sell the prepackaged 3 variety selection. And it was expensive - BBQ pork bun was $1.10 - which would be okay if there was actually BBQ pork meat inside it! Just a dollop of red goop.  Quality of other buns were the same - no filling and undercooked dough. \n\nI was gifted a certificate from a wedding invitation so I had to spend it.  First off there's no address on the voucher so I had to call them. The woman who picked up the phone was so rude - like I was making her do some exhaustive task by simply asking what their address was. \n\nWhen I went, I picked what I wanted, brought the tray to get rung up and it came to $10 exactly - value of my voucher. I handed my voucher to her and she said \"you have to pay $2 if you're going to use this.\"  They apparently give a 20% discount on cash purchases and this voucher doesn't count. Okay... So I give her $5. She gives me back $2. I look at my hand and said. \"Didn't you say $2?\" She said \"yea, so I'm giving you change\" I said \"but you owe me $3\". She gave me the dirtiest look and threw a loonie into my hand and gave me by bag.\n\nI am not returning to this bakery.","useful":3,"funny":2,"cool":0},
{"review_id":"pIfvMid2wWk7dS2KaunS8w","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"ovlWOSKVjGecnaPuZLv_OQ","stars":2,"date":"2013-10-03","text":"This is not your typical dim sum place - this is high end.  Presentation is amazing, atmosphere is really nice, no plastic table clothes and paper napkins here.  But that star of the show - the dim sum - is average. The price is not average though - over $60 for two people and we weren't even full. The menu isn't that big, so we had to go elsewhere to eat afterwards. \n\nIf you're trying to impress your Chinese mother in law, come here. Otherwise, there are better places for less and the food is much better.","useful":0,"funny":0,"cool":0},
{"review_id":"svpLfASw8QqePmFPTCXaNw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"Q62lGVKqoKJ09lZNt2qpfw","stars":2,"date":"2016-03-20","text":"Restaurant was busy for a weeknight and we figured that was a good sign. Checked Yelp and it appeared positive. \n\nHad the Manchurian noodle with shrimp, chicken pakoras and chilli chicken. Service was quick. Pakoras came out first... At least that's what we ordered. Not sure if I would call what the hard, round tennis balls, brown, almost black, mostly breading things, pakoras... But okay. Taste? Just like I expected. Not good. I thought maybe the just burned out batch. Nope. That's how they all looked when I looked around the room for other patrons who ordered \"pakoras\". \n\nManchurian noodles were drenched in oil. A lot of oil. Slippery couldn't hold them on chopsticks oily. The dish as mostly noodles - no veggies and shrimp were tiny. Chilli chicken was also a greasy mess.  The only thing that they didn't mess up was the rice. Oh and the Coke that I ordered. \n\nThe only \"positive\" thing was that portions were huge. Enough for us to take home for lunch and dinner the next day. Not that we wanted to eat it again.","useful":3,"funny":0,"cool":0},
{"review_id":"3c-G8zzmId6URPySGoDT7Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"iIFcMHXGNDz8jbx_4H-xVQ","stars":4,"date":"2014-05-26","text":"Drove past this place for years and finally decided to give it a try after reading a review online. We took the reviewers suggestion of having the chilli chicken and crispy beef, in addition we ordered a manchurian chow mein. \n\nChilli chicken was very good. Very good gravy to go with the steamed rice. The crispy beef was a bit disappointing - it was very sweet and tasted like a dessert rather than an entree.  Felt like asking for a side of whipped cream or ice cream to go with the beef. Manchurian chow mein with chicken was good - did not cheap out on the chicken like a lot of other hakka places do. \n\nPortions are large which was perfect for is - we had lunch for the next day.\n\nOwners and servers were pleasant and attentive. The restaurant was quite busy the Sunday evening we went - a few large parties. Had we come a few minutes later we would have had to wait for a table. \n\nWill be back to try the other items on the menu. Yum!","useful":1,"funny":0,"cool":0},
{"review_id":"VEH2hrTL84HADVIhxogYgA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"pofDmHoIsdvPcSKzb2iMag","stars":3,"date":"2013-09-07","text":"Where can you find $2.00 a dish dim sum anymore? The quality is good for the price you're paying. I went to a dim sum place and paid 3 times that price for a mediocre meal. This isn't a gourmet place like the ones in Markham and Richmond Hill but its perfect for the downtown dwellers. \n\nThe ladies pushing the carts are nice - the wait staff are super busy so sometimes you have to remind them of your requests. \n\nIf the dim sum dish you are craving has not come around after a few carts have passed,  you can order the dish through the wait staff who will put the order into the kitchen - nice and fresh!\n\nStars taken away for ambiance and decor - need a major update. Food presentation can be improved as well, but all in all, it's $2 a dish! Take some to go for a nice easy dinner!\n\nRandom comment - Elevator is a bit sketchy - if you're not afraid of heights, take the stairs - the elevator takes a while to get there and you'd want to let the elderly on first anyhow, leaving you to wait for it to come back again.","useful":0,"funny":0,"cool":0},
{"review_id":"ezOQlSJ-t3M2kDb_2fYLnA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"KSh5L6wADW_fMpG2hMJx8Q","stars":2,"date":"2014-01-19","text":"I've been here a few times and have been disappointed the last handful of visits.\n\nMost recent visit, my group and I waited for an hour before the first meal was delivered. From there it took another 20 minutes before we all got our food. \n\nI ordered the peppercorn steak. I ordered it medium well, they gave it to me well done. It was chewy, hard and not flavourful at all.  The vegetable side was a big gloppy mess of green and red peppers - the \"sauce\" they cooked it in tasted like a glue of corn starch and water. There were three small half pieces of roasted potatoes. For 22 bucks I expect a lot more. \n\nOur waitress was nice - felt bad for her because it's not her fault that the kitchen is so slow, but she had to hear about it from the customers in the dining room.","useful":0,"funny":1,"cool":0},
{"review_id":"Et_YbHkuLuAkClcsN5C1nw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"-av1lZI1JDY_RZN2eTMnWg","stars":3,"date":"2013-10-02","text":"3.5 stars - lost .5 star for lack authentically tasting Thai food, but still good!!\n\nSalad king - also known as the \"Ryerson cafeteria\". Best deal around for Thai food. Good meal under $10. \n\nThere are more authentic restaurants around but part of the reason why we come here is simply to hang out with a group of friends and it's a central location for everyone to come to. We're not fans of the \"other Thai restaurant\" down the street. \n\nMy go to dishes: spring rolls to start at every meal, then I either get the classic pad Thai, Thai Islamic noodles, Pattaya chicken or the red curry. I've had pretty much everything on the menu over the years, but those are my faves. \n\nI have had friend brave enough to do 20 chilli in their curry. It did not go well - upset stomach for a few hours after. Just stick to 10 and under. Don't be a hero. Lol!","useful":0,"funny":0,"cool":0},
{"review_id":"z6A3ZvIZTqb_GmLNjt0YUA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"PsYU8cEDE3oewzKCyVt5bw","stars":2,"date":"2013-09-05","text":"My coworkers and I used to frequent Ho Su often until a few of us didn't feel so great after eating there one day. We gave it another shot and the same thing happened. We all had the same thing - bento boxes - some of us had beef teriyaki, some chicken teriyaki. We figured it was something common in the boxes. Likely the glass noodles because both times they tasted off - strange after taste. Crossed this off our list and we now go down the street to another sushi establishment - a bit more in price but at least we feel good after eating there!","useful":0,"funny":0,"cool":0},
{"review_id":"za9t9Gxy8H6smd2XaJVZ0g","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"QXAEGFB4oINsVuTFxEYKFQ","stars":1,"date":"2013-09-06","text":"I've been here a quite a few times over the last two or three years and something has definitely changed. The quality of the food has gone down hill and the prices are ridiculous! \n\nToday I went with my husband for lunch and we were disappointed! The food was cold and on four occasions after we ordered the dim sum, the woman said \"okay let me warm it up for you\" and proceeded to the back to microwave it! What the heck?! Why are they pushing around cold dishes?\n\nWhen we asked for shrimp rice rolls, the waiter put in the order to the kitchen - we thought \"great! at least it will be fresh\". Well... when they came out we wanted to send it back. The roll was gummy and falling apart. Not pleasant at all. \n\n$40 for seven dishes, four of them microwaved, one of them barely edible - just not a good meal. Should have gone to Manchu Wok.","useful":1,"funny":0,"cool":0},
{"review_id":"2RV2aD5TXTbS9HESA8ZlGA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"YkAIlxYZ1guSqbbowU9X4g","stars":4,"date":"2014-10-16","text":"Came here for a lovely dinner with husband  been a few weeks ago and it was a great dining experience. \n\nWe enjoyed the dim sum that we ordered. Obviously it is more expensive than the typical Chinatown restaurant however this was justified. Unique dishes, amazing flavours, reminded me of my experience dining in high end dim sum restaurants in Hong Kong a few years ago. \n\nHighly recommend the shrimp rice rolls. Had we not ordered so many dishes we definitely would have ordered a second helping of this amazing dish. We also ordered the green beans, ha gow, the special of the day - a wonderful honey shrimp dish, and vermicelli. \n\nOnly disappointment was the desert that we had which was a chocolate steamed cake. The cake part was not that sweet a bit on the bland side. \n\nAll in all it was a very nice experience and we will visit again.","useful":0,"funny":0,"cool":0},
{"review_id":"JVwa-qaFERoa2dg0poiBcg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"8g3u6g7J93nIOF8owARxew","stars":3,"date":"2014-08-13","text":"If you're looking for a shawarma in this area, this is your only option. Better tasting options are downtown or in Scarborough. \n\nHad the traditional chicken shawarma. one of my favourite toppings are the pink pickled radishes. For some reason the ones here were not looking very appetizing. They were old and grey looking. I decided to opt out of those just to be on the safe side. Disappointed that they don't make their own hot sauce like many of the small mom and pop shops - this one was commercial. \n\nPrice was good and the sandwich size reflected the price you were paying.\n\nThis place gets a bit of traffic from being in close proximity to the subway - hungry passengers picking up something a quick lunch or dinner.  Convenient place if you live\/work in the area.","useful":1,"funny":0,"cool":0},
{"review_id":"sesKcJm0JGjvp6cc2pZ28g","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"Rh2smrKvcamnP8VBUgMI0Q","stars":3,"date":"2013-11-07","text":"In an earlier review of another dim sum restaurant in the Spadina, I said \"where can you find $2.00 a dish dim sum anymore\"?\n\nWell it appears we have discovered another one! And this time - it's better than the other restaurant I reviewed before!\n\nQuality and quantity is better here. Fried shrimp dumplings - at the other place you get 3 small ones. Here? 4 large ones. Ha gow? Better here. There's also more selection it seems. \n\nIt's less busy as the other place, but we also arrived a bit later than our normal dim sum time. The place marginally more decorative - with the seat covers and fancy table cloth, but both were stained with old sauces and food. \n\nWill visit again. Hopefully the linens are cleaner.","useful":0,"funny":1,"cool":0},
{"review_id":"VsyDqL8vzTsnO3IWvduPwA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"3k9treY8PmsZ42bKmuICgA","stars":2,"date":"2015-02-28","text":"Overpriced and really disorganized - and it wasn't even busy. \n\nCame here for Sunday lunch \"all you can eat\" and I was hoping it would be better. We ordered our first round of food and it took 20 minutes for the first dishes to arrive. It can't possibly take a them 20 minutes to boil edamame!\n\nOrdered 2 subsequent rounds of food and they took so long, we actually just cancelled our last round of food.  Apparently our last order was missed and the manager said it would be 15 minutes if we wanted to wait. No time - had to catch a movie at Fairview. \n\nFood is mediocre - nothing to rave about. Not shockingly, the portions were really small, so if you're coming with more than a party of 2 and everyone wants to try the dish, double up.","useful":3,"funny":0,"cool":0},
{"review_id":"hIaKA77HXmPsP-fkLDLwNg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"4MuzCfftvp_QQsHPqri5Rw","stars":3,"date":"2014-11-23","text":"Came here for dinner with a group of 10 - we all did the all you can eat dinner option. Our server was very nice - took our drink and food order promptly. Problem was the amount of time we had to wait before food actually arrived. It took about 20 minutes before we saw the first dishes. Then each time we ordered again, it took half hour for the food to arrive. \n\nFood was okay. Nothing to write home about. This chefs special sizzling dishes were probably the better items on the menu. Sushi was okay as well. I personally am not a fan of their pad Thai so I would not order that. I did enjoy the mango and coconut ice cream that they served at the end. Disappointed that they don't offer red bean ice cream! :(\n\nI really like the decor at this location and it is a great place to catch up with friends.","useful":0,"funny":0,"cool":0},
{"review_id":"rGiAjq2fVaw12uXWd_IJtQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"3gdjVkNeUa9piW9H708Aig","stars":4,"date":"2013-10-01","text":"The fish and chips here is really good. You can tell by the packed parking lot and long line to get in for dinner. \n\nWe came here on a Saturday night at around 7 and they were sold out of halibut!! They had just run out so the server had to come and ask us for a new order. So disappointed! I love halibut! We ended up getting haddock and basa instead.  The fish was fresh and flaky and battered perfectly. Chips are great too and coleslaw was yummy. \n\nNeed to come back for the halibut!","useful":0,"funny":0,"cool":0},
{"review_id":"lYX5Z9Cv7ISgOCO_3HNzxw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"egLYFnycp8ktxMCvilFdLw","stars":5,"date":"2016-05-19","text":"I used to get my passport and visa photos from Shoppers. Ever since Blacks shut down they felt that they could bring their prices up. Just a couple of months ago I got my passport photo for $13 and now they upped it to $25. I needed 4 copies of the photo for a visa and they said it would be $50 at Shoppers. \n\nQuick check on Yelp brought me here. \n\n2 other customers were there before we arrived.  They were done in no time. \n\nWhen it came time to our photos, he was nice enough to touch up our faces - I personally was having a bad acne breakout so he cleaned it up.  In and out in 15 minutes.  $15 for 4 copies. \n\nHappy customers! I will be recommending this place.","useful":1,"funny":0,"cool":0},
{"review_id":"1Rch84fqimlhcUaaJaMkPg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"F_oPMHJrH42R67xp5eKtQA","stars":3,"date":"2014-10-13","text":"It was quite busy for a mid week evening. I was shocked actually - all the tables were full, and there were people waiting for seats.  Only one server was working and the chef was by herself cooking everything for the restaurant, so it was quite chaotic. We forgave them when the server brought over something we did not order. It was similar enough so we kept it (shrimp tempura vs veggie tempura).  After the rush, the service did improve. You can tell they were stressed back in the kitchen. \n\nI came here with a large group and we decided to share about 10 dishes among all of us. Really liked the bibimbap! The complementary side dishes was nothing special. But what did stand out was the green pancake\/crepe they sent over. So good we ended up ordering another!  \n\nPrices are very reasonable and include tax.","useful":0,"funny":0,"cool":0},
{"review_id":"0afH9lwp8gqBZCGtx7X52w","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"rETL4tn0LMohgdQYpytY5A","stars":2,"date":"2016-07-15","text":"Took my family here for vaccines and medication for an upcoming trip.  We made an appointment. Well apparently that didn't matter because we ended up waiting 2 hours just to see the doctor. Then we had to wait another half hour for the vaccines. \n\nThe doctor was nice when we finally saw him. Gave us good information for our trip. Good news is we didn't get sick on the trip! \n\nWe had another trip planned recently and decided to come back for a prescription for some more medication.  Again we made an appointment, perhaps it was an anomaly last time for having to wait so long. Nope. It was 2 hours again. \n\nIt took them about 20 minutes to find my husbands file alone. Apparently it was misfiled.  \n\nAnd this time what really frustrated me was that some people just walked in with no appointment and were seen first. My guess is because they were paying for their consultation were as we were just going for a prescription. \n\nCompletely frustrating experience - next time I may try another clinic because this one clearly is understaffed and disorganized.","useful":3,"funny":0,"cool":2},
{"review_id":"xhaj4uM-JEsU3Fwu4D52cw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"wiuhohHv4fP2LY5yogv-vQ","stars":4,"date":"2016-01-11","text":"Been here a handful of times since they've opened.  It was busy 4 of the 5 times we went (Friday, Saturday and Sunday evening visits). If you have a group, make reservations because otherwise you'll be packed into a corner sharing a table with 2 or 3 people. \n\nWaffles and crepes were really good. I had a waffle topped with fruit and a scoop of their vanilla ice cream (which I heard was made in house, not commercial brand). Very good! My friend has the crepe with chocolate ice cream with chocolate sauce - also very good!\n\nAnother occasion we had the hot chocolate with a slice of chocolate cake. Hot chocolate was really good. The cake slice was huge. I feel that they could reduce the price (which was pricy as is!) and serve a smaller portion. This is definitely a \"share\" sized piece of cake - but you're stuck with just one variety if you're with a date. Table beside us had a group of 3 who ordered 3 slices and left about half of their cake behind. \n\nThey sometimes have entertainment - Bollywood dancers, band, themed parties, which is a nice change from the normal dessert places.","useful":0,"funny":0,"cool":0},
{"review_id":"_nCRBi7_RLMkmjF8s6i0nw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"NOHh2pgOTUBqp82IQlRQMQ","stars":1,"date":"2016-05-07","text":"Waitress we had was rudeeeeeeeee! She was rude when we got in, rude when we ordered, rude when she brought our food, rude when we told her she forgot one of our sides and rude when we asked for the bill.\n\nI went with a small group.  Food was just okay. It's pretty hard to screw up breakfast, but it happened. One person in my group ordered a sandwich. Disappointed - thoroughly. Bits of small chicken pieces which fell out every time they a bite of the sandwich.  Barely toasted bread, which was also soggy from the chicken that was probably sitting in the sandwich and waiting for the slow waitress to pick it up. Pancakes were forgotten by the waitress. When they came they were not hot, not surprisingly.  Home fries were soggy. \n\nWon't be coming back again.","useful":1,"funny":0,"cool":0},
{"review_id":"_A6nasik52sEurR1V7pp-Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"nDn2h-_c7Xk4UwM0aiXZlw","stars":2,"date":"2013-11-16","text":"2.5 stars\n\nHalf star earned only because I had really good service from the waiter and the greeter. They were attentive. \n\nFood - not good. I had the calamari dinner. Calamari was greasy and I got a number of pieces were the batter was removed from the calamari - not sure if it was on purpose to save on calamari or because the breading stick. \n\nRice - small portion. Salad - wilted mess. Potatoes - one quarter piece. Not sure where the rest of them went. \n\nI couldn't finish my meal. I was disappointed that I paid $20.00+tax for that!","useful":3,"funny":0,"cool":0},
{"review_id":"ICoXyycwU0r3dpikBs5UlQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"aTvzqD5Kot4vp3vOnDyrTw","stars":2,"date":"2014-02-24","text":"Messini on the Danforth is one of my favourite Greek restaurant on the strip.  \n\nThis location is a bit different - very much like a fast food joint in a food court. \n\nThe food is good - same as the Danforth location, much smaller menu, but that's to be expected with such small space (only about 12 tables, 2-4 seaters each) \n\nBut here's where they lost all the stars. The cashier and order taker at the front is complete rude. We had no clue what her problem is, but she was giving everyone attitude. Customers, the chefs, the woman who was clearing and cleaning tables. It was so disturbing I didn't even want to stay because every time we looked that way, she was giving someone a disinterested look,  rolling her eyes and smacking change into people's hands. Not acceptable!","useful":0,"funny":0,"cool":0},
{"review_id":"V0MoTZk8UyczA8WDiAPIIg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"Xy74meQwdTnloAAyRC-4cg","stars":4,"date":"2013-09-21","text":"So happy to have The Works in the neighbourhood! \n\nNavigating the menu is a bit daunting - the amount of options is overwhelming. The combinations are very unique and the combos that you kind of say \"really?!\" actually work.  Lots of choices for meat options too.  The prices are a bit high - but I tend to share my burger anyways because it's quite large. \n\nThe staff here are amazing. Friendly, great with recommendations and you can tell they like being at work. I brought my 10 year old niece here for dinner one night and the waiter burst into song for her - really sweet gesture to put a smile on all of our faces.","useful":0,"funny":0,"cool":0},
{"review_id":"hUQWPf2EfHVf8aIDAbsmMQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"EhGPj8iJDIdaHnWg9d5BgA","stars":3,"date":"2013-11-07","text":"Points for view. View of the lake, beautiful in the summer months. Great after lunch walk to work off that food you just ate. \n\nPrices are quite expensive and it's not really worth the price. Eggplant in that yummy sauce contained pork. Pork? Isn't it supposed to be fish? I prefer the fish version. \n\nHa gow wrap is sticky and mushy. Stuck to my chopsticks and made for an embarrassing moment when the ha gow was stuck to my bowl and I couldn't dig it out. It fell apart and I had to chisel it off the bowl. Ugh. \n\nService is a bit slow - they have plenty of staff - when my request for hot sauce didn't come after a few of our dishes did, I had to remind the server. Few minutes past and still nothing. Asked the waitress and she got it for me - finally!\n\nParking is expensive down there. Might want to leave the car at home and just walk or take the transit if you're in the downtown. area.","useful":0,"funny":0,"cool":0},
{"review_id":"abStF7f3_IyfZmOP82baZQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"nW45ez1L6U4PsYhV1BTrGQ","stars":5,"date":"2012-05-19","text":"H&F Jewellery is amazing!\n\nI had given my husband some ideas of engagement ring designs I liked and after going to the traditional big box jewelry stores, a friend of ours recommended H&F.\n\nThe customer service here is great - they are extremely knowledgeable, attentive, honest and the prices are very reasonable! My husband surprised me with a custom designed engagement ring and I love it!\n\nWe went back for our wedding bands and I worked with the gemologist there to create 4 beautiful bridesmaid gifts - necklaces with a pearl and white gold heart pendant - my girls loved them!\n\nWe've recommended 5 other friends to H&F - they've all been satisfied with their engagement rings and wedding bands.\n\nGo to H&F for all your jewellery needs - you won't be disappointed!!","useful":1,"funny":0,"cool":0},
{"review_id":"6Cc72bI-OeUFDxUN2Ql8mg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"UP7ejOl-PQyWZ9iFRQD8Xw","stars":2,"date":"2013-09-21","text":"I've been here many times over the years and the quality of food has gone down hill. \n\nMy most recent experience:  Had a get together with a few of my friends a while back - we came here because it was close to home. \n\nI had a pasta dish - I'm not sure how an Italian restaurant can mess up the most basic thing: cooking the pasta so that it is no longer raw. Well it happened. I couldn't finish my dish and was quite upset given this is not the first time where I had a disappointing meal here.\n\nMy friends had pizza - nothing special. Like someone had mentioned in another review - for the price you pay you you expect to be impressed. \n\nNeedless to say I've given enough chances - won't be coming back here again!","useful":0,"funny":0,"cool":0},
{"review_id":"e9PbPm_iDs5CZ1NOMdYwDQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"2aIgbnGUg8VC0u9iXO-wnQ","stars":4,"date":"2013-08-31","text":"Discovered this sushi place in our neighbourhood. Nice to have a local place we can walk to!\n\nAtmosphere - small, Japanese decor (would make sense!) friendly staff and chefs. \n\nFood - really liked the rice that came with our bento boxes - not the typical white rice, presentation was lovely. Tempura appetizer was nicely battered and it came with egg plant tempura (i love egg plant!) Food was prepared fresh and tasted yummy!\n\nPrice - reasonable - not amazing deal like the restaurants on the Danforth, but you get what you pay for.","useful":2,"funny":0,"cool":0},
{"review_id":"jfx9TNAo2b4HFASfvevgXw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"LBHbyID7tcaGszznHtnCrw","stars":4,"date":"2013-10-03","text":"Joey's is me and my best friends favourite restaurant to come to for get togethers. \n\nOur favourites are the sushi cones as an app, lobster grilled cheese and lobster ravioli. Last week when we went though, we were really disappointed! They removed the lobster ravioli off the menu! The new pasta they had in its place, prawn florentine ravioli was not that great. Bring back the lobster ravioli!\n\nService at this location is always great - if you have to wait for dinner service, they bring out appetizers for you to snack on while you wait.","useful":0,"funny":0,"cool":0},
{"review_id":"C7JIUDTgE0inPoWqxcbVKw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"lvU7Mu7YU_2Gfw6QvsKqqw","stars":3,"date":"2013-11-21","text":"Good place for hakka food. It's family style so it's perfect for sharing with a bunch of friends. I really like the chilli chicken here. Manchurian noodles were great too!\n\nPretty busy on a Saturday night if you're coming during the prime dinner hour. Come a bit before to ensure they seat your large party.","useful":0,"funny":0,"cool":0},
{"review_id":"YYe172qIGx0kltrr-Q72rQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"2TGbIdKD-smMD7udsLig3Q","stars":4,"date":"2014-02-26","text":"I also went to Louis Shoe Repair for my Ugg boots. After attempting to do it myself with the \"official\" Ugg cleaning kit, the solution that came in the box to shampoo the boot actually made it worse -  turning the front of the boot hard, stained with a strange \"sugary\" looking texture. Do not buy this product!!\n\nI didn't want to do more damage so I took it into Louis after reading the review below by Monica. \n\nHe did an amazing job! I am so happy - the boots look brand new - soft and furry. It took a week to get them back and it came to $40 with the taxes (same price as the Ugg cleaner, way better results). I am going to bring my other pair in to get them cleaned at the end of the season. \n\nHighly recommend!","useful":2,"funny":0,"cool":0},
{"review_id":"NGDIHjNTHuJeop9GEyBYOg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"IBZ6e3P0OqcPXVjvGlpueQ","stars":2,"date":"2013-10-01","text":"Food was okay - as others have pointed out, a bit expensive. Everything is fried fresh, right when you order. Nothing is frozen (better not be for the price you're paying).  We had the calamari and two orders of halibut with fries. It took a very long time for food to arrive, as it was quite busy on a Saturday evening.\n\nBig points lost for service - Also as others have mentioned, the staff here aren't exactly welcoming and warm.  I wasn't pleased at how they were treating their customers. I'm not expecting a joint like this to roll out the red carpet, but I do expect a bit of kindness.","useful":0,"funny":0,"cool":0},
{"review_id":"j7inVDSpw9USpSjQ8t47sA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"9s8D_cDi-HZv6EFiBBY3Uw","stars":1,"date":"2014-11-23","text":"I wish they had a zero star rating option here. Because this is what I would give this BMW location. \n\nI bought my car at a different location a few years ago and this dealership was the closest one to my house. I had a mechanical issue with my car and brought it in for service on a Monday morning. They didn't touch my car that day so when I came back it wasn't fixed. They told me to drive it home and bring it back the next day. This happened three times that week. I thought they had fixed it by the third time as they said they did but this was not true.  I had to bring about the following week another two additional times. What a nightmare!\n\nService staff here are incredibly rude, unprofessional and they really don't care about customer service whatsoever.  The only person that was actually nice was the receptionist. \n\nI thought perhaps this was isolated to the service department but it turns out that this is not the case. I came back for a part a few months later and the parts counter staff were just as rude and confrontational. I simply wanted to purchase a part! I didn't need the attitude.\n\nI have decided that my next car won't be a BMW - I'm going with another luxury car retailer. What a terrible experience!","useful":7,"funny":0,"cool":0},
{"review_id":"r9mQ1o9xVVpSs-v8GaE1_w","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"6D_rZE3vtdur2RR_QK0G6Q","stars":5,"date":"2013-08-31","text":"My go to place for a Hawaiian pizza on a Saturday night. Wings are really great as well! They have a \"butter chicken pizza\" that is definitely worth a try! Way better than the grocery store frozen version!\n\nVery friendly service - always a pleasant conversation when I pick up my order. \n\nThey moved locations - formally at Dundas and Bathurst, now at Bloor and Crawford. Just a few minutes north west!","useful":1,"funny":0,"cool":1},
{"review_id":"lW9OIvyazf7RT7nZukxfFQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"RUd_M7DPJq1I3DPq0oF--w","stars":3,"date":"2013-11-06","text":"Really good Indian\/Pakistani food.  I've been coming here for at least 10 years and it's come a long way in terms of expanding the sizes. Still the same furniture though - by that I mean the plastic patio chairs and tables. But you don't come here for the luxurious surroundings. \n\nFood is good - beef kabobs, chicken kabobs,  paneer, butter chicken, biryani - I've had it all. All authentic, so be prepared for a meal filled with butter, oils and deep fried fair.  Naan is really good - fresh and soft. \n\nThe price of the food is quite high compared to other Indian restaurants. But it's not outrageous like others I've been to.  \n\nFor an on the go experience, grab a wrap - beef is my fave. ask for extra lettuce and onions because otherwise you're getting 2 pieces of lettuce and one piece of onion on a naan with the meat.","useful":0,"funny":0,"cool":0},
{"review_id":"yXPEBweCjQtT1iYIU0ln-Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"yP-6hIA3qGWbIz0p9zSaoA","stars":3,"date":"2014-08-13","text":"3.5 stars\n\nWe've been to Crave ever since it's opened. I've tried a handful of dishes there and for the most part, I've enjoyed my meals. I've also had pretty good service here as well. \n\nFirst time we came here, we were with a larger group, they had just opened a couple of weeks before and the manager came out to get our opinion. Nice guy who genuinely wanted to get our feedback. \n\nMy previous visit, my husband ordered the lamb chops. They were all bone and my husband was really disappointed - it's not a cheap meal after all! So he bought it up to the waitress and she offered him a new meal.\n\nMost recently, I had the New York strip and my husband had the filet minion. My steak was over done and was tough to eat. Gravy for my potatoes did not taste proper either. My husband shared half his portion with me - his meal was cooked perfectly.  My friends who ordered steaks and pastas were pleased with their meals, so I was the odd one out. \n\nDessert was good - had the molten chocolate cake with ice cream - delish! \n\nThe waitress was nice - very cheery, quick with our requests.","useful":0,"funny":0,"cool":0},
{"review_id":"AHqYd-6jeh5TRbNgCncFnw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"USWaAiJglhGtUKn2uR-iiA","stars":4,"date":"2013-11-16","text":"Love this bakery! Best Chinese bakery of the 3 in the area. \n\nTheir Vietnamese chicken sandwiches are really good as is the \"Special\" which is an assortment of the different meats. The vegetarian tofu one is also very good. \n\nAs another poster has mentioned, the egg tarts are amazing. They're flaky and wonderfully eggy. Since they turn over so quickly they're often warm - which is the best way to have them. \n\nThe birthday cakes and rolled cakes are good too. My favourite is the fruit cake - not the \"Christmas cake\", but a great sponge cake with fruit in the cream layer in between.","useful":0,"funny":0,"cool":0},
{"review_id":"LUunRlcJ2wva8DYayCjABA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"R5ZvZ97FDp2bD93CNKg-zQ","stars":4,"date":"2013-09-05","text":"Love this sushi place! I work close by and my group of coworkers would come here often. Make resos if you're coming for lunch on Fridays. The kitchen is really small so it does take a while for food to come out of you're with a large group.\n\nI always get the Lola bento box - you get a choice of main dish (chicken, salmon, beef, various sushi, etc) with your Japanese bento box staples (few rolls, salad, rice, miso, tempura, fruit). Dynamite roll is really good too - pretty big serving - enough for a nice lunch!","useful":0,"funny":0,"cool":0},
{"review_id":"xjQlMYbbJ_jIozsZ1lSAcA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"GdCRQU3VCh_x8fY84mbwYQ","stars":4,"date":"2013-09-08","text":"Really good kebabs! Doesn't matter what you order - beef, chicken, lamb, and whatever marinade - I haven't had a bad selection yet! Price is fair for the amount of food you get. I often take home some for lunch next day. \n\nTwo downsides - not enough seating during peak dinner time (doesn't matter what day you are going, it's busy all nights) and the lines are long.","useful":0,"funny":0,"cool":0},
{"review_id":"eNfnyllvw_EoIVJt7kqvXA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"KQEuEJ80wwPqhRNSI3em4A","stars":2,"date":"2014-05-05","text":"Appetizer was good - had the deep fried shrimp rolls.\n\nFor our mains we had the garlic shrimp and Pad Thai. Neither was impressive. We were especially disappointed with the garlic shrimp - for the price we paid ($10) we expected a much larger portion than the 6-8 pieces we got and a bit more substance than just shrimp and a few pieces of roasted garlic.  We just added it to the pad Thai.\n\nPad Thai - good thing we ordered something to add to the pad Thai because there wasn't much to it besides noodles.  I think I would have enjoyed standing in line for Thai Express at the local mall food court - that's got better flavour than our meal today.","useful":1,"funny":0,"cool":1},
{"review_id":"0IdQ0Gs36MBtlsZgNyR7qA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"YLc7Djf3GsC8IT84YkZMzw","stars":4,"date":"2013-09-05","text":"Best Thai food ever!\n\nI've had almost everything on the menu (it's quite small) and everything is delicious! My favourite dish is the Sukho Pad Thai. The fragrances, the taste, makes my mouth water just thinking about it! Get the garlic chicken as an appetizer - garlicky goodness!\n\nI took away one star because it is absolutely impossible to get seats in a decent time on Friday or Saturday night (we waited almost 2 hours one time and theres nothing in the area to go to so you're standing outside the restaurant) Long wait for food too when you get seated. And even if you call to order food for pick up, it takes an hour before you can come pick it up.","useful":0,"funny":0,"cool":0},
{"review_id":"lxhqKRGCWkXI_3Mj9dta_Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"97--r-a3_J8qo-ajRiU9wg","stars":4,"date":"2015-02-01","text":"Been here a handful of times since they've opened.  It was busy 4 of the 5 times we went (Friday, Saturday and Sunday evening visits). If you have a group, make reservations because otherwise you'll be packed into a corner sharing a table with 2 or 3 people. \n\nWaffles and crepes were really good. I had a waffle topped with fruit and a scoop of their vanilla ice cream (which I heard was made in house, not commercial brand). Very good! My friend has the crepe with chocolate ice cream with chocolate sauce - also very good!\n\nAnother occasion we had the hot chocolate with a slice of chocolate cake. Hot chocolate was really good. The cake slice was huge. I feel that they could reduce the price (which was pricy as is!) and serve a smaller portion. This is definitely a \"share\" sized piece of cake - but you're stuck with just one variety if you're with a date. Table beside us had a group of 3 who ordered 3 slices and left about half of their cake behind. \n\nThey sometimes have entertainment - Bollywood dancers, band, themed parties, which is a nice change from the normal dessert places.","useful":1,"funny":0,"cool":1},
{"review_id":"Wpx0B6TG3DMSnFn_3vgyLQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"Jgi9U4FtFu75iZTaX7X02w","stars":4,"date":"2013-10-03","text":"Got a mani and pedi here for my wedding. It was a really nice experience. The ladies here were super nice and when they found out I was getting married they were so excited to be doing my nails for the big day - and for the honeymoon on the beach. \n\nI had my finger nails painted the traditional French manicure - I got the shellac done for the first time. I loved it! It lasted for my entire 2 week honeymoon and looked great!\n\nI wanted to go with a hot pink for the toes just for fun - but the lady suggested something more \"bridal\" lol! So she did them in silver with sparkles. Very cute. I am glad I took her advice. \n\nThe whole experience took 2 hours they gave me a hand and foot massage as well. I felt nice and relaxed when I left.  Great service!!","useful":0,"funny":0,"cool":1},
{"review_id":"kwiEG_KCpDB6aK5fTSM7iw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":2,"date":"2013-10-02","text":"We were expecting amazing Thai food after all the reviews that we read and the fact that this place was voted one of the top 100 restaurants in Toronto. \n\nThis was disappointing. \n\nFirst off, it was really awkward sitting on the benches outside on the sidewalk, as people walked past us while to wait for our table. \n\nSecond, when we were seated, it was so loud. It felt like we were in a high school cafeteria. There was so much noise from people talking over each other and from the loud music. We were just happy that we didn't have to share a table with another couple. \n\nFinally - Food was mediocre. I was extremely disappointed with the curry egg noodle dish. It was awkward to eat and I felt sick about half way through because the curry was too rich. On the flip side - I had a taste of my company's dish and it wasn't that great either - he had the beef stir fry dish with rice. The meat was nice and tender, but it wasn't flavourful. \n\nWasn't worth the hype, unfortunately.","useful":1,"funny":0,"cool":0},
{"review_id":"uZLsHt0TBXhxMu29CYU18Q","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"6d7aOsiinhme6BB7s2QmZQ","stars":4,"date":"2013-10-06","text":"I used to be a big fan of \"the other pizza chain that specializes in pan pizza\". When we found out that Dominos makes pan pizza we had to try and now we are hooked. It's less greasy and the cheese is much better. Dominos is now our favourite pizza chain!\n\nAnd this location is our favourite place to go! The staff here are energetic, friendly and they really aim to please. I come here often now and they know me by name and we have a good conversation while I wait for my order. They know precisely how we like our pizza (not well done, but almost...). \n\nWe live outside the delivery area and we rather drive and pick up our pizza than to get delivery from the other location closer to our house.","useful":1,"funny":0,"cool":0},
{"review_id":"4p3a-XGpOaaW24bi3LLZHg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"AM0NHSxMeX92OKBt0ywmSA","stars":3,"date":"2016-11-17","text":"Attentive service and good food! Had the Mexican corn and tortilla with 3 dips for apps.  Guacamole was good - other two dips - the corn salsa and spicy bean and smoked queso was meh. Mexican corn was really good. The sauce and spices were yummy!\n\nI had the cod tacos and the Crispy Cotija. Cod taco was good. Cotija not so much.  \n\nI was too stuffed to eat a whole dessert myself so I shared the churros. I didn't enjoy these at all. I much have rather had one of the Sweet Jesus popsicles that my other dinner guests had. \n\nOverall it was good. Next time I'll know to get less tacos or apps and save room for dessert.","useful":0,"funny":0,"cool":0},
{"review_id":"9_LbJ8r6T2o5R8Bw_taJNg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"l9vx-OTdDPU-oHZ17aVxdg","stars":4,"date":"2013-11-06","text":"Really good place introduced by my coworkers. It's quite the drive from the office but it's worth the trip for lunch. \n\nI've been during lunch, they have special combos for a good price - and lots of options.  Dinner is reasonably priced, not as great as lunch pricing. \n\nLove the chicken pakoras, manchurian chow mein, Szechwan fried rice, and chilli chicken. \n\nGreat place for large gatherings as it is family style - order a ton and sample everything.","useful":1,"funny":0,"cool":0},
{"review_id":"0tlT-4mpb5kDeYB6kUJwDg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"Mrqk1ydkvgKtlxrExCv6gQ","stars":4,"date":"2013-09-16","text":"My cousin recommended that I try this place - she showed me pics of her dinner and it looked amazing!\n\nCame here for a special anniversary dinner. The restaurant is very small and in an obscure location in the middle of Scarborough - not where you would expect to find a good seafood restaurant!\n\nWe came on a weeknight and had no problem getting seats. I did hear that it was harder on Fridays and Saturday nights so either call for a table. \n\nFood was good - nice and fresh, no surprise since the market was right on site! A bit pricy compared to other seafood restaurants but it was good quality and knowing that the seafood wasn't sitting around in some fridge for a long time was worth it. We had scallops, shrimps, salmon and calamari. Yum!","useful":1,"funny":0,"cool":0},
{"review_id":"ragZwT6uv4MPQHLeEXmkOA","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"QxSFIWk_hhSloUS6-IIUcg","stars":2,"date":"2017-02-22","text":"I really wanted to like this place.  I really did. \n\n2 Uber orders, one customer in front of me and 6 more behind me. Two tables were waiting for their food. They came up twice to see what the hold up was.  It took close to 40 mins for my take out order of two sandwiches and a poutine. Uber driver got so fed up he left and told them that he's cancelling the order. \n\nSandwiches were good. The poutine was super salty.","useful":0,"funny":0,"cool":0},
{"review_id":"tnrY04eiOllOMSdFgZTNLw","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"TBzgzTFSa7pJXiLD7emYaQ","stars":4,"date":"2016-05-15","text":"Quick search on Yelp for good Hakka Food yielded this restaurant. Other reviewers are right - this place is in a really sketchy neighbourhood but the food is good!\n\nWe went many of the suggested dishes on Yelp - - started with the Chicken Pakoras. Okay. These were amazing. Not a ton of breading - just right. And the flavours were soooo yum! I could eat this all by themselves all day! I've had many versions of Chicken Pakoras and this is hands down the best one. We also went the Crispy Beef as everyone seems to suggest. It was good! Gingery, sesamey and nicely done with some onions. Wouldn't be Hakka dinner if we didn't try their Chilli Chicken with gravy which was also good! Could have been a touch spicier but it was good nonetheless.  We had the Hakka noodles which was also good. The shrimps were a bit small - but there was too much going on with other ingredients to miss them too much. \n\nService was great - friendly service on the phone and the food was fresh. We'll be back to try other dishes soon!","useful":1,"funny":0,"cool":0},
{"review_id":"ZH1PHbeJprG8h-8cFNfvjg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"snw9iNNLpFYZeHotW00uVA","stars":4,"date":"2014-02-07","text":"Really good experience here. I dined with 20 people and they were attentive to each of our needs - waiter was really knowledgable and knew all the ingredients in each dish and was able to make really good suggestions for our group. \n\nLoved the slaw.  I have cravings for this dish all the time now. Best thing on the menu! I also had the lobster ravioli and had a bite of the black cod. Also very good!\n\nEven though it was a busy night, at no time did we feel rushed by waitstaff.","useful":0,"funny":0,"cool":0},
{"review_id":"jwNEkZAww5eXT8H7pYjWrQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"MT-lkIacLNyC7KF2dY997A","stars":2,"date":"2013-09-12","text":"Had lunch here a few weeks ago - I was quite disappointed in both the quality of the food and the service. \n\nIt was a nice summer day so we went out to the patio which was nice.  We ordered drinks, which came promptly along with samples. And that was the end of the prompt service. We waited over 45 minutes for our food. I asked about half an hour in if the food was coming. The waiter said it would be about 5 minutes. 15 minutes later the food arrives.  We didn't order anything fancy or complex to warrant such a wait. The burger I ordered was mediocre and the fries that came as a side was so small questioned if this was a garnish. \n\nWhen we requested our bill that took another 15 minutes to arrive. \n\nAlmost 3 hours later, we finally left - desperately trying to find a chocolate bar because that lunch was not satisfying at all.","useful":0,"funny":0,"cool":0},
{"review_id":"qE_liiIHY67pVpr1Rh-dfQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"RwRNR4z3kY-4OsFqigY5sw","stars":4,"date":"2015-06-20","text":"I had to see what the fuss was about.  The line was just over an hour long on a sunny Saturday afternoon. I hung out with a friend so at least the time passed quickly. You can smell the goodness coming from the ovens from outside. \n\nOne batch of cheesecakes yields 12 orders.  Probably about 35-40 mins to bake, but they gave a couple of ovens so the line moves every 20 mins or so. \n\nI got a cheesecake and an order of Madeleine's. Both were really good! The cheese cake was melt in your mouth soft and not too sweet as its American counterpart. My friend who does not like American cheesecake thoroughly enjoyed this variation. \n\nWould I stand in line again for over an hour for this? Not likely. But I wouldn't hesitate to buy it again if there wasn't a line.","useful":0,"funny":0,"cool":0},
{"review_id":"YN7IVU1A_7INs9hvifVbBQ","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"h36qA5gnNTgByhxWx1aH-Q","stars":4,"date":"2013-09-27","text":"Very good place for all things lobster! I had the lobster Mac and cheese and the lobster poutine. Very good!\n\nThe place is quite small and tends to get busy during prime dinner time. We knew this so we went early and had no problem getting seats. As the evening progressed the lines grew outside. \n\nService was friendly and accommodating. We ordered a bunch of stuff for apps and we wanted to share. They're more than happy to bring extra cutlery and plates. \n\nYum! I think I may need to go back soon to satisfy my lobster craving!","useful":1,"funny":1,"cool":1},
{"review_id":"e85X0oMuo907gAysqggTMg","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"cPXasVLtq_1gmuSg65TUfQ","stars":4,"date":"2013-11-08","text":"Chinese buffet with Chinese people eating there? This is definitely not the mandarin! \n\nHuge lines ups during Friday Saturday and Sundays. Less busy on weekdays, also cheaper. Try to go then so you can be seated at a decent time. \n\nThe food is good - some authentic dishes with the traditional \"Canadian\" fare you would find at the food courts. \n\nI can't remember what day it was, but they had half lobsters for every guest.  It was a bit dry, not my favourite thing from the massive buffet selection. \n\nFare included: dim sum (ha gow and siu Mai, different dumplings etc), noodle bar!, sushi (it was okay - not mind blowing), salad bar and they had tons of dessert - both the typical cake, jello and ice cream you see at the mandarin, but they had some pretty good Chinese desserts too (tofu dessert - served warm), almond jello, mango jello etc. \n\n\nPrice is more than the mandarin, but it's definitely better quality and service.","useful":1,"funny":0,"cool":0},
{"review_id":"mTPITnITB8L3DUsa1fcZ7A","user_id":"PkRFSQgSfca9Tamq7b2LdQ","business_id":"_zICxzg7kkHREGTJfVHAFQ","stars":5,"date":"2012-08-17","text":"We had our wedding this past fall at the Red Rose Convention Center.   Deepak was extremely amazing at his job - professional, well organized, detail oriented and he gave us great advice.  The in house decorators did a wonderful job matching my theme colors and it was beautifully set up.  The food was amazing! We had a mixed culture wedding and decided to have an Indian reception and my family, who aren't Indian, really enjoyed the food!  The dessert tables was beautifully set up - with a lovely ice sculpture, which was really impressive. The staff at Red Rose were helpful, pleasant and we couldn't be happier with our reception! Great job Deepak!!","useful":0,"funny":0,"cool":0},
{"review_id":"1KZB1c0O-NnFvWb2S89Ulw","user_id":"JMMn2pW2mRFgtfy9p8ovtg","business_id":"CqVdLcbyZzfAjeCD1qEBZQ","stars":2,"date":"2014-05-14","text":"Updated review (keeping 2 stars) after having one of the owners message me on here, same guy that was the cook when I went in. The customer service was horrible in my experience at this establishment. Our visit to a mom an pop restaurant should not be over an hour, that is not acceptable. Especially if there was less than 10 guests in the establishment. I wondered how all of the reviews were 5 stars, am I the only one he messages after a lower rating? Just a heads up yelpers! If you don't label this place 5 stars you can expect a message!","useful":8,"funny":2,"cool":2},
{"review_id":"5BT9zrT6nVcVDjNPyqvXvA","user_id":"Yob3Y8U8OApJUyUQK0C-XQ","business_id":"Iy-8SbnmobuW8jwJWQE-kQ","stars":5,"date":"2015-01-10","text":"Wow, call on Roger! He is very easy to work with and very knowledgeable. He fixed my audio problem in less than fifteen minutes. He is amazing. My computer tech chose the wrong settings for my PC \"Media Center\". This prevented my PC from sending sound to my speakers. I was so frustrated trying to figure out who could help me. Then I read about Roger on Yelp. I read all of the positive reviews and decided to call him. I got lucky in the sense that he was able to come the same day. So here I am sharing very good comments in hope that one of you folks reading this will give him a try. I hope this review helps Roger and potential customers.","useful":1,"funny":0,"cool":1},
{"review_id":"-eQ7Fy5YhdGYuZRF5bcF8A","user_id":"Yob3Y8U8OApJUyUQK0C-XQ","business_id":"1cmGPtkf173LS4XuFkzADQ","stars":5,"date":"2015-02-08","text":"The need for honest, reliable and talented Android techs is high. When my phone gave me trouble or I wanted to root or update safely or whatever, I used to get that awful scary feeling!\nNow that I use Todd, I never worry. He always knows what to do and he does it perfectly.\nHe has updated many of my gadgets including an old HP TouchPad that had a black screen. I only use it for watching the news while I prepare meals but I enjoy having it working again. He also saved my HTC One that was bricked.\nDon't be afraid to fix or update your gadgets with them instead of buying new ones. You will save a lot of money and get most of the new features. However, they do have a lot of different phones at great prices that you can buy from them if you choose.\nTodd just updated my Note 2 to Kit Kat. He did a fantastic job. Now I don't feel the urgency to buy a new Note or start another 2 year contract.\nTodd and Mohammed are really nice fellows, really talented and very reasonable.\nI highly recommend them!!","useful":0,"funny":1,"cool":0},
{"review_id":"0iUm3t4fctxDb0ecp9tQ3Q","user_id":"envr6GXAZtanlgyvl_1bdg","business_id":"wZukjLaf1V2dLRQap_Zriw","stars":3,"date":"2012-03-26","text":"Hate to rain on the parade but our experience tonight at the Gilbert location was disappointing.  We have been to the Arcadia location many times and count it as one of our favorite eating destinations in Phoenix. However, a combination of problems added a sour note to an otherwise nice evening.  \n\nThe first problem -- apparently the kitchen lost track of our salad -- would have been understandable for a new operation.  Plus, to their credit, Postino did not charge for the salad.  However, our server compounded the problem by trying to close our bill while we were enjoying our meal culminating with her giving us our check before I had finished eating said salad.  Not only did we feel rushed out of the restaurant but we had intended to order dessert!\n\nI have always admired the wait staff at the Arcadia location for their professionalism that seemed to support a relaxing and enjoyable dining experience. The Gilbert location stumbled on both accounts.  We'll assume this new operation will resolve these bugs and hope to return to this location.  Afterall, the bruschetta is delicious, the wine list is extensive, and the yet-to-be-tried salty caramel sundae is too enticing to avoid.","useful":4,"funny":0,"cool":1},
{"review_id":"raMMcpE2Ws2fIwugSGhkGQ","user_id":"s2SbRhL14fDSGkQ14k8bFg","business_id":"QVw8qu3-BrMx0PE-CnUqBQ","stars":5,"date":"2016-08-02","text":"Went on Sunday to get the whole package; a haircut and a Royal Shave.\n\nI'll preface this by saying it was pretty pricey for the whole package, over $100. Mostly in part due to the shave. The experience however, made it all worth it. I don't normally keep a beard, but I had been growing one for the past few months and decided to shave. After the haircut, you get the shave, and it is a process, but it's very in depth, relaxing, and it gives you that feeling of living the good life. \n\nThe haircut is really where I'm on the fence. Although a bad run in with a previous barber unfamiliar with my hair on a work trip left my crown pretty shoddy, my barber, Mignon did good work with what hair I had. Arguably the second best haircut I've ever had, and a picture of the best, she did a very good job. Give it one or two more visits and I'm sure she'll get it dialed in. \n\nI probably won't get the shave again to save some money, and because I normally stay clean shaven, but if there ever is a time I grow out my beard, I'd get the whole package again simply because it's such a relaxing experience.","useful":0,"funny":0,"cool":0},
{"review_id":"cWmt1IL2Fk538I-N1ghOCg","user_id":"s2SbRhL14fDSGkQ14k8bFg","business_id":"LQ20tGLjCUkuX_bf-mQDfg","stars":1,"date":"2016-08-02","text":"I stopped in here for a haircut a little over a month ago. It had good reviews and was close to home, so I figured it was worth a shot.\n\nThis really isn't a barber shop, it's more of an electric clipper chop shop. I normally sport a gentlemans cut with a fade on the sides. The man that shaved my hair cut right across my crown with his clippers and completely ruined it; I didn't have enough hair to comb on it so it sticks straight out of the back of my head and requires an ungodly amount of product to get to lay down, and even then, it'll break free in a few hours.\n\nMaybe it's just a one-off, bad luck scenario, but when it comes to your personal looks, you really can't accept any substitutes.","useful":1,"funny":0,"cool":0},
{"review_id":"GocpkrtE24qGUZxFJTKrgA","user_id":"ZwosAf4-tO2YsOqorV85Lw","business_id":"XcXXzKE8u0mP1VtpR5oZ8Q","stars":5,"date":"2016-11-27","text":"Quick response and came over within a day to give me an onsite quote! He even did the job the same day. I needed two carpets patched and one he said he would try a stain remover first to give me the best outcome, but it only worked on part so he came back a few days later when the carpet was dry and patched it. You can't even tell and it is in the middle of the room! Dane did a great job and I will recommend this company to others and absolutely use them again!","useful":0,"funny":0,"cool":0},
{"review_id":"5KX1ij6EXnnk6ZFcWFO9xg","user_id":"tMLghX--PfwVcEkoUeNNKA","business_id":"iPxaFtUXxOlJ-0hMHCM7wg","stars":5,"date":"2016-04-22","text":"Fast,efficient and courteous.  He actually arrived at the location and was waiting for me when I got there. Now that's what I call service! Will definitely use again. Keep up the good work.","useful":0,"funny":0,"cool":0},
{"review_id":"tB842omXBdTSD8JOlgJEMg","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"eeDcY3TD89COiaZl7dP34Q","stars":4,"date":"2011-01-10","text":"There are a lot of frozen yogurt places to check out, but Yogurtini is by far my favorite.  (+ positive, - negative, -\/+ neutral)\n\n+ The place is freaking adorable.  I know it sounds a little strange, but I love the colors they picked for the place.  The blues and greens MAKE me want to eat their yogurt.\n\n-\/+ The frozen yogurt.  Although I do love their vanilla flavor, it doesn't taste like \"original\" frozen yogurt.  They do make a homemade yogurt, and I haven't tried it, but I'm guessing that one must taste more like the classic frozen yogurt.\n\n+ SO. MANY. TOPPINGS.  Hot sauce? Yes.  Gummy worms? Yes.  They have all the fruits you love, and definitely all the candy you love, to make your frozen yogurt just the way you want it.  (I personally like to mix my vanilla yogurt with peanut butter and chocolate chips).  \n\n+ Punch cards.  This is a big thing for me.  Of course I'm gonna come back if a company is going to reward me for my loyalty.","useful":0,"funny":0,"cool":0},
{"review_id":"nLk4uUDq0yyUlBiG-zzR1w","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"sZf_KrF9ZLC7z4jiLGgVOw","stars":4,"date":"2008-09-28","text":"Been to Steve's a few times.  Time for a review.  (+ positive, - negative, -\/+ neutral)\n\n+ Good ambiance.  Low lighting and sweet music.  I really enjoy studying here.\n\n+ Slightly above average coffee.  I've had better, but Steve's still has really good drinks.\n\n+ Awesome prices.  I'm in college and I really like saving my money.\n\n-\/+ Customer service is alright.  One time I was there only one barista working.  He was obviously a high school student and had other important things going on.  Two of his friends came in and chatted him up at the counter... and they weren't quiet.  Then, he left the counter, with no one else there, to go outside for a smoke and talk with his little friends.  Nothing happened in result, but I thought it was rude.","useful":3,"funny":1,"cool":2},
{"review_id":"yDU7dIXtezyYpboc_L_8xg","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"VO8ZLZ4NPvwcvdCAp89e0w","stars":5,"date":"2008-09-28","text":"Best coffee I have tasted, by far, in the short 20 years of my life.  Here's why (+ positive, -negative, -\/+ neutral):\n\n+ They're a hole-in-the-wall joint.  That means little to no traffic, cozy, fast.\n\n+ Simple menu.  It really bugs me when coffee shops have a hundred-and-one different drinks up on the board.  Seattle Espresso's menu does not mess with your mind.\n\n-\/+ The baristas are average.  Most of the time I come in and they're friendly, but once I had a guy treat me like I wasn't even there.  His friend came in and they started talking... while he was making my drink and when I paid.\n\n+++ I LOVE THEIR DRINKS.  Their espresso is smooth and blends well.  Their cup sizes are decent.  They have very unique flavors, my favorite being the white mocha.  The coffee experience here is sublime, to say the least.","useful":5,"funny":2,"cool":2},
{"review_id":"6I-AqQMNOF9SbK7WaPUSIA","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"rnCKXjVBrv23nT6Q5G0ZaQ","stars":2,"date":"2008-09-28","text":"Oh, Coffee Plantation, where didst thou self-respect go?  I've been coming here for a couple of years, and this is what I've decided (+ positive, - negative, -\/+ neutral):\n\n- Bad customer service.  There's one employee in particular who treats me like I'm a child every time I order... and she's never happy.\n\n- Messy.  Maybe it's because the joint is on Mill (which is gross to begin with), but I'm guessing it's because the manager doesn't enforce cleanliness.\n\n-\/+ Coffee is decent, if not below average.  Don't try any fancy shmancy drinks here, you will be disappointed.","useful":2,"funny":1,"cool":3},
{"review_id":"Jqs-EgHdeGrbD1PvKRFiRw","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"5FIOXmUE3qMviX9GafGH-Q","stars":4,"date":"2008-09-27","text":"+ positive, -negative, -\/+ neutral\n\n+ The food is amazing.  They cook their tofu just right: crispy, tasty, fresh.  I'm also a huge fan of the Greenburger.  I would have to say it's even better than an In-and-Out burger (although now I'm a vegetarian).\n\n- The food is good, but definitely not healthy.  Grease, with a side of fat.\n\n-\/+ Seating could be better.  I don't feel relaxed here.\n\n+ One word: Soynamis.  These are frozen yogurt (soy, of course) treats with mix-ins, like fruit, nuts, etc.  Perfection in a cup.\n\n-\/+ Service.  They get your order in quickly and get the food to you fast.  However, I always find myself a little bummed out after ordering, they never smile!\n\n+ Limeade.  It's really, really good.","useful":2,"funny":1,"cool":1},
{"review_id":"K0sndPUAXPt_7yiUExXVGQ","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"zT45hBptOygpgCddHZRsjA","stars":5,"date":"2008-09-28","text":"I'm an avid reader and ever since I visited City Lights Books in San Francisco, I was desperate to find a good independent bookstore in the East Valley.  Although Changing Hands is not quite City Lights, it comes in close second.  Here's why (+ positive, - negative, -\/+ neutral):\n\n+ They are organized.  Nothing Like Bookman's.\n\n+ They have wonderful customer service.  I love everyone that works here.  They are always willing to help you find a book you'll enjoy.  Plus, they're knowledgeable, unlike B&N employees.\n\n+ Book signings here are bomb.  I saw Stephanie Meyer shortly after she published Twilight.  It was legit.\n\n+ PUNCH CARD!! Any bookstore that has a punch card is a friend in my book.  I actually have a full one right now that I need to utilize to get my 10% off!\n\n-\/+ I like Paradise Bakery, but I don't like them hitched to a bookstore.  It can be noisy sometimes.","useful":3,"funny":1,"cool":1},
{"review_id":"HXxA1SnZbjDU2TGLrVIf3w","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"2GmGT-7QjowR1ihup3FbVA","stars":5,"date":"2012-01-03","text":"Are there really words in the English language to describe how wonderful this food is?  Not even close.  This is by far the best Middle Eastern cuisine I've had in the valley.  Lots of entrees to choose from, so many different desserts, and if you're feeling bold, you can try one of their unique drink options. (+ positive, - negative, -\/+ neutral)\n\n-\/+ Sometimes the wait can be long, especially during lunch hour.  But I wouldn't say that this should keep you away.  The food is worth it.\n\n+ Chicken Shawarma\n\n+ Gyros\n\n+ Lots of food.  Sometimes you have to roll me out to the car when I'm done... and I STILL have left overs.\n\n+ Friendly, helpful staff that will make you feel at home.\n\n-\/+  Decor.  I've heard some people hate on the \"look\" of the restaurant.  It's not a wine and dine kind of place and honestly, it's not that bad.  It's just a bunch of tables and chairs, but is that what you're there for?  No, you're there for the amazing, bountiful meal that your little tummy has been begging for.  It's clean, whether some people say that or not.  I'm pretty sure they wouldn't win Best-of awards for almost 30 years if they were bad at keeping things picked up.","useful":2,"funny":0,"cool":2},
{"review_id":"YyLk1FOQ1vOolVai_rCPYA","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"dO2V9ut5x8Zx_XhYrNp4Ig","stars":2,"date":"2008-09-28","text":"Eh, is really all I have to say.  (+ positive, - negative, -\/+ neutral)\n\n+ Incense selection is awesome.  I love their stuff.\n\n-\/+ Location is terrible.  I don't like Mill Ave., but at least it's close to where I live.\n\n- Poor customer service.  Don't talk to me like I'm stupid and we'll have a great employee\/customer relationship.\n\n- Expensive.  Tie-dye shirts for $25?  I'll make my own, thanks.  And I don't know many people that buy smoke supplies here (I don't smoke myself).","useful":7,"funny":1,"cool":2},
{"review_id":"bLZ7V686nYqKkbDoIQtTbw","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"D3ehpx1uKG5aLuaJgztYDg","stars":5,"date":"2008-10-12","text":"Solo is definitely one of my favorite places to get espresso now.  After checking out the great reviews on here, I decided to skip on my usuals (XB, Steve's)  and come here.  (No negatives or neutrals this time!)\n\n+ Great location.  Strip mall, not too much traffic.  The storefront faces Baseline, so you can sit in comfort and watch cars go by.\n\n+ The atmosphere is amazing!  I walked in and automatically felt at home.  There are couches, benches, tables, outside seating.  Everything you want in a coffee shop.  There's beautiful photography on the walls (which you can buy), including one of Jared Leto (or at least it looks just like him).  And there are plenty of places to plug in your laptop.\n\n+ Local coffee!! I love it when local shops use homegrown stuff.  I had never had this kind of espresso, but all I can say is that it's damn good.  I can't remember the name, though.\n\n+ The drinks.  Oh. My. Word.  I ordered a cafe mocha with no whip.  It was smooth, creamy, and had just the right amount of mocha.  It was to die for.  Also, if you're a big foam fan, you'll love any of their hot drinks.  I had about an inch of foam in my cup and it was thick and flavorful.\n\n+ The service is just as great as the coffee.  The guy at the counter was polite, helped me choose a good drink, and smiled.  \n\nI must say, it's going to be very difficult for me to find a place better than here.","useful":2,"funny":0,"cool":1},
{"review_id":"re8-AKMLglvEVvxXv26T1w","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"cXy1NKi1cdsidlaT6dDFKw","stars":3,"date":"2012-01-03","text":"Alright, so I'll be honest here, this was my first experience at a hookah bar, so I don't have much experience to go from.  On the other hand, I like to think I give pretty fair, intelligent reviews that are well-thought out.   I've been here twice so far.  (+ positive, - negative, -\/+ neutral)\n\n+ Hookah is superb.  I will say their stuff is pretty good.  Smooth, not powerful, and flavorful.  \n\n-\/+ Customer service.  I think they're decent, but not amazing.  They're nice, friendly, and definitely help you out with any questions you may have.\n\n- EXPENSIVE.  Holy mother of... why would I wanna pay $30 for hookah?  It just really blows my mind how much it costs.  It is good stuff... but really?\n\n-\/+ You must order a drink.  I kind of understand how this works on the business side of things, but I think maybe it cuts back on the amount of clientele.  And it's kind of annoying.  I go there for a smoke, not for a drink or coffee.  \n\n+ Atmosphere.  Definitely what comes to mind for me when I hear \"lounge.\"  Dark, spacious, comfortable, candles lit.  It's a nice place to relax for sure.  It's wonderfully decorated and you can tell the owners take pride in its appearance.","useful":6,"funny":0,"cool":0},
{"review_id":"SaZrEarRFOtxC_riAf03VQ","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"iRDfCn7MSvEVKZLyzimKpw","stars":2,"date":"2008-10-08","text":"Well... hmmm...  (+ positive, - negative, -\/+ neutral)\n\n- Crappy, crappy food.  The hummus didn't even have garlic in it.  \n\n- Not very relaxing.  It has an up-tight feel to it.  Decor seems a bit futuristic.\n\n-\/+ Espresso.  It was good, but it didn't make me say, \"Mmmm!\"\n\n- Paying for internet.  You must purchase an order of $5 or more to get internet access.  Now, honestly, if you are an internet cafe within walking distance of ASU, you may as well keep the service free. \n\n+ Computers.  If you are in need of a computer for gaming, do come here.  I play WoW and if I didn't have a decent gaming comp, I would definitely use this place.  The backroom is dimly lit with TONS of computers and comfy chairs.  Definitely  MMORPG material.","useful":1,"funny":0,"cool":0},
{"review_id":"Xgjjp8Jxd8flZNIeqKId3g","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"KsNZgnE0tFblW4Rfu72mZg","stars":3,"date":"2015-06-01","text":"Being that I live in the west valley now, there are little to no mom-n-pop delivery shops to choose from, Zella's is a friendly name that I remember. After ordering from them for over a year now, I think I have my final consensus. \n\nOverall, I don't know why I keep coming back to Zella's. I've had some pretty shitty phone service, but I guess I like their food enough to put up with it. PLEASE, if anything, Zella's, learn to be more courteous on the phone!\n\nPlease be aware that my review is based only on delivery. (+ positive, - negative, -\/+ neutral)\n\n+ Good food. I love their boneless wings. Best flavor from any pizza\/wing place in Arizona to date (for me). I usually get regular wings because no one likes wimpy wings aka boneless, but I love the Zella's boneless. They've hardly ever messed up my orders, although I'd say the boneless wings can come smaller than normal, and you never know what you'll get. I once got the usual 10, but each \"wing\" was about 1\/2\" in size. \n\n- Waiting. OMG sometimes I wait an hour and a half for my food. Usually they let me know about the wait and are honest with how long it will be, but damn, maybe hire some more people for busy nights? It's been like this since I started ordering from here over a year ago.\n\n-\/+ Service. Typically I've had very lousy service on the phone. Twice it was one hour from their closing time and they told me they would not deliver. THIS is what makes me order from a large corporate chain. If they say they close at 9, and you call at 8:45, your order will STILL be delivered. I also had one lady DEMAND my building number (albeit I should know my building number, but no one has ever denied delivery without a building number) and so I hung up and ordered Papa John's. According to her she \"wasn't going to send her driver out there with no building number.\" Um, they have to look at the map anyway, get over it. HOWEVER, my delivery service has always had pleasant drivers. One girl even gave me extra ranch (shout out to you, girl!).\n\n+ Prices. For delivery (and usually if it's fried), this place is pretty good. Good portions and I don't spend more than I would at a corporate chain.\n\n-\/+ Coupons. Sure, if you want pizza and wings, you can get some good deals. If you want subs or anything else, probably not your best bet. And to my knowledge, their \"deals\" have always been the same.","useful":2,"funny":2,"cool":1},
{"review_id":"7Xk_gdsvENqKS0qWMu5cug","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"xZhCCireQYwcRHh5Nc1Vkw","stars":2,"date":"2008-09-27","text":"After hearing a friend talk about this place like it's coffee was gold, I decided to check it out.  I've been to 3 Roots at least four times and this is what I've confirmed (+ positive, - negative, -\/+ neutral):\n\n-\/+ Service is a 50\/50.  Some baristas are awesome, some I'd like to slap back into reality.\n\n- Prices suck.  At 3 Roots I tried the pita\/veggie plate and it was definitely not worth the nine bucks.  A few slices of carrots, broccoli and celery, a dab of hummus and a stale pita.  Gross.\n\n+ Vanilla latte.  At least they know how to make the most generic latte in the world.\n\n- I once tried their Irish cream.  I will never again ask for anything that sounds fancy.","useful":3,"funny":1,"cool":2},
{"review_id":"PbZPi4N0hjOnL5UnVBrsCg","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"BhzbId_o7t-1q349J1L5Dg","stars":4,"date":"2008-09-28","text":"I cannot believe this.  I lived in Chandler for eleven years and never discovered this place until I moved to Tempe for college.  Either way, it's a blessing to the earth.  (+ positive, - negative, -\/+ neutral)\n\n+ Coffee is fresh and never burnt.  I drink lots and lots of this drug, I know what's up.\n\n-\/+ Lots of places to sit, but I just can't get comfortable.  It's too bright inside and the music outside is usually too loud.  However...\n\n+ The joint is located on a lake (man-made of course) and it's beautiful.  Once a friend and I passed on the tables and just sat on the edge of the water. Despite the dead fish smell, which wasn't harsh, it was fantastic.\n\n+ The employees always ask how you are doing.  They are quick to make drinks and never get distracted.\n\n+ Prices are below average.  There are a few items that are a tad overpriced, but in a nutshell this is the place to get an inexpensive good time.\n\n+  PUNCH CARD!! As some of you know, I really like punch cards.  Coffee Rush has them.  Get one.","useful":2,"funny":1,"cool":3},
{"review_id":"BYjrj8zZlt2PE-1kmCpgZg","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"pApEPv1-ApXee4GYYMB5AQ","stars":5,"date":"2008-09-28","text":"Please, please, PLEASE do your body good and get your piercing done at HTC.  They are the best in Arizona, I can guarantee you that.  (+ positive, - negative, -\/+ neutral).  \n\n+ Beautiful selection of jewelry.  They have bone, wood, glass...\n\n+ They know what they're doing.  I actually had my tragus corrected here because the last guy who did it (tattoo shop, of course) did it wrong.\n\n-\/+ I have yet to decide what I think of their customer service.  Ninety-nine percent of the time they're very helpful, understanding and polite.  Once, however, I thought one guy was going to have a fit because I took my gauges out.  How was I supposed to know that was unhealthy practice?  Maybe he was just having a bad day...\n\n+ Ask them anything.  No question is too dumb, believe me, I've asked plenty of them.","useful":3,"funny":0,"cool":0},
{"review_id":"lGNH9OsmMXaJMeWSrEpJfw","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"Net_BZG7t8JRLjXxNtvyNg","stars":5,"date":"2008-09-27","text":"Oh man.  I love this place.  (+ positive, - negative, -\/+ neutral)\n\n+ Open 24 hours on the weekends.  'Nough said.\n\n+ Cheap, but flavorful, drinks.  I always like what I get here.  There is one guy who makes a mean vanilla latte, I have yet to get his name.\n\n+ Food.  Good cakes and cookies.\n\n-\/+ I've found that a lot of high school kids like to loiter here (and they're loud).  But, hey, it's not XB's fault.\n\n+ The people who work here know what they're doing.  They make sure to get your order right.  And they're always friendly.\n\n+ They have musical guests every now and then... and it's usually good stuff.","useful":3,"funny":0,"cool":1},
{"review_id":"Bx15NkkQIoxBToxmNK_sNQ","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"-IZvuqxekWEvJqDw308daQ","stars":4,"date":"2008-09-28","text":"Oh. My. Goodness.  Since I'm vegetarian, I can only get a bean and cheese burrito (yes, I know the beans are made of lard).  But I still love this place!\n\n+ Prices are cheap!  Good, cheap Mexican food always sounds good to me.\n\n- Location.  Kind of hidden, hard to find.\n\n+ Horchata.  Yes, mmm, horchata.  It's really, really good here.\n\n+ Better than Filly B's by far.  Just the right amount of beans and cheese in a warm but moist tortilla.  Heaven in a wrapper.","useful":2,"funny":2,"cool":2},
{"review_id":"e4t1B6WbuyrRxWaNH3M4kA","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"6qR6CmHQrheE0fWRhAhbVg","stars":3,"date":"2008-09-29","text":"So, I only have two tattoos, which means I can't complain TOO much.  I got my second tattoo here and I believe I would recommend this place to a friend who wants to get a cheap, quick tattoo.  (+ positive, - negative, -\/+ neutral)\n\n+ Prices are decent.  I got my tattoo done on my back by an apprentice and it was only $100, where most places were charging about $150.\n\n+ Open seating area.  I've been to some tattoo shops that are smaller than my bedroom.  This place is bigger than my apartment.\n\n- Staff could be more friendly.  I visited the place a few times before making my decision to get my ink done here.  Two out of three times I was not satisfied with customer service, but the cleanliness and reputation kept me coming back.\n\n+ Really good at inking simple designs.  My tattoo is large script across my back, and I would have to say it's pretty damn awesome.","useful":2,"funny":1,"cool":1},
{"review_id":"EreJHuj4fiXVEmnqXC-0Og","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"JsUprRhyzQyukZmAhcOg0A","stars":5,"date":"2008-10-12","text":"Oh sweet, sweet Brio.  I absolutely love this place.  I wouldn't change a thing about it.  Yes, it's a chain, but I definitely give props to a restaurant chain that makes food as delicious as Brio.  There are no negatives or neutrals about this place.\n\n+ Wonderful service.  Our waitress was so nice.  She helped me make a decision on my meal and she was very knowledgeable of the menu.  Also, the other employees were happy and spunky.\n\n+ You can add or modify your meal as needed.  A lot of big restaurants (especially more expensive ones) don't allow you do personalize your meal.\n\n+ FOOD.  Oh my goodness.  If you want a meal that is flavorful, cooked right, and unique, you have to try this place.  I ordered the Mushroom Ravioli and it was the best meal I've ever had.  I could taste the different cheeses, the pasta was cooked perfectly, and it melted in my mouth.  My mom ordered a chicken dish and it came with two large chicken breasts and vegetables (she substituted rice for veggies).  Of course, I'm vegetarian and can't eat meat, but the veggies were ridiculous!! They were so delicious.\n\n+ Prices and portions.  Yes, the prices are a tad high, but the portions make it worth it.  I had ten large raviolis stuffed well with mushrooms.  It could easily be split into two meals.\n\n+ Creme brulee.  They have about eight different kinds of creme brulee to choose from.  I ordered the chocolate cake, the original and caramel.  Fantabulous.  Spectacular.  Even if you don't eat a meal here, you MUST try their desserts!!  It will be the best thing you ever do for yourself.","useful":7,"funny":4,"cool":7},
{"review_id":"rS0b3XR_-ll36F2tPPXpkA","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"Xwf022IffmZPq6V25iomDg","stars":3,"date":"2008-09-28","text":"Nice place.  (+ positive, - negative, -\/+ neutral)\n\n+ Good coffee.  I forgot what the name is, but I once asked the barista to make me something with lots of chocolate.  It was a mocha made with Ghirardelli chocolate I believe.  I was in love.\n\n+ I've been here three times and every time the employees have been respectful and fast.\n\n- Their food is... well... gross.\n\n+ Good atmosphere.  Great place to study because most of the time loners sit inside and groups sit outside.  If you like alone time when you read\/study\/whatever (like me), you'll like it here.\n\n- I will sadly have to agree with many other reviews: the prices are not worth the coffee.","useful":2,"funny":2,"cool":2},
{"review_id":"saeL-tTsiJmZwuyiZt9DcQ","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"wrQG6xvECjz0CbBft8oS9Q","stars":5,"date":"2014-02-20","text":"For years I rolled my eyes when people talked about \"amazing\" sandwich shops.  \"Seriously,\" I thought, \"How can something as simple as a sandwich be amazing?\"  It wasn't until I walked into The Lunch Bag and had my first bite of their (amazing) sandwiches that I really understood. Unfortunately, I no longer work near Scottsdale, nor do I live anywhere remotely close.  I've had to say my goodbyes, but I promise The Lunch Bag, my sweet, I will be back. (+ positive, - negative, -\/+ neutral)\n\n+ Good ole taste of Mom's cooking... 'cept it's not from her.  I truly reconsidered how great my mother's sandwich making skills are after eating the Turkey Green Chili.  Sorry Mom.  Soups made from scratch, fresh meats and breads, AND COOKIES.\n\n+ Excellent service.  The ladies who work in the kitchen are always happy and cheerful.\n\n+ Pick up orders \/ delivery.  I personally always took a break from work to stop in, but you can call ahead and pick up, or have them deliver!\n\n-\/+ Small dining area.  This is mostly made to cater to the HUGE amount of local business there, so I'm not surprised they only have a handful of table and chairs.  Still a nice place to stop for lunch if you need a break. :)\n\n+ You'd think with all this awesomeness there HAS to be a catch with the cost.  Nope.  It's all affordable delicious goodness.  Definitely competitive prices and I'd pick this place every time.","useful":1,"funny":0,"cool":0},
{"review_id":"8i_O1fMkObYPoFu8AnUuoA","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"AJ8DDFm6QaihAPZI3wFBHw","stars":4,"date":"2008-10-08","text":"Whenever you want a refreshing drink, go to Tea Infusion.  (+ positive, - negative, -\/+ neutral)\n\n+ Comfy tables and chairs.  It's a bit like a coffee joint, a place to sit, relax, and talk with friends.\n\n+ The tea selection is AMAZING.  I don't drink too much tea myself, but I know my friends like it.  They have fresh tea in boxes and have a very large assortment.\n\n+ You can do so much to your drink.  Blend, ice, hot, boba.  I like to get smoothies (they also put green tea in their smoothies) with boba.  It's delicious.\n\n- Location.  A place like this should NOT be sandwiched between stores in a crappy mall.  It would be better in a shopping center, away from Tempe Marketplace.\n\n-\/+ Food is alright.  If you're looking for a snack, good, but if you're looking for a decent sands","useful":3,"funny":2,"cool":3},
{"review_id":"7Tei2VXbEO9Sap0YB7Db0w","user_id":"dnSBTYaCnKk_zxjAic1QEQ","business_id":"5k34OJo3BsEaoyMsW86eZg","stars":2,"date":"2008-10-08","text":"A friend of mine works across the street from this place and he gets food here all the time.  He once took me there and this is what I've concluded:  (+ positive, - negative, -\/+ neutral)\n\n+ TVs for games.  I'm a football girl and I like big flatscreens to watch games on.\n\n+I'm not 21 yet, but this place has a nice feel as far as bars go.\n\n- Food is gross.  Plain and simple.  Yes, I am a vegetarian, but the only thing I didn't eat was the meat... and it still wasn't good.  A burrito should be good with or without meat.\n\n- Open seating.  It's a garage-turned-restaurant (or it least it looks like it) and so the place is WIDE open.  There tall bar stools and tables everywhere and the only nice place to sit is on couch-benches that don't have tables.\n\n-\/+  I guess if you're drunk and need a little something-something to eat, this would be a good place to go.  But it's not a good place to get a good meal.\n\n- Prices suck.  If you're going to do it Chipotle style, at least be cheaper than the chain.","useful":1,"funny":1,"cool":1},
{"review_id":"fEnKr69qgjaO_8YKjLBH-A","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"tuB82m4oIlKLyWeQjEF16g","stars":5,"date":"2015-03-05","text":"Very clean, friendly people working there, the food was hot, fresh, and very good!  It is a takeout place, but the sign says they deliver within a 2 mile radius.  Would definitely recommend & go back if you like Mediterranean food!","useful":0,"funny":0,"cool":0},
{"review_id":"W8_sPyzQYBvQovFSdoO8mw","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"2F8povaKEaqieQhzFSKwQg","stars":1,"date":"2015-02-22","text":"For the price that I paid, it was definitely not worth it.  I would understand if it was a school, where stylists are still learning, then you get what you paid for, but that is not true here.  When I got home I noticed an area on my scalp that had dye and melted saran wrap stuck to it, which was super awkward to get out of my hair & now the area is very sensitive.  I also noticed there was a huge bleach stain on my t-shirt as well.  For such an expensive hair cut and dye I don't think I should have had to suffer through peeling dye off my scalp at home or a ruined t-shirt.","useful":2,"funny":0,"cool":0},
{"review_id":"2ojAHRtGp3SUC_bLguVT5Q","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"kT9SuRVTapbDgFGMcg1Rqg","stars":4,"date":"2015-02-26","text":"Tried it for the first time this evening and it was very good.  Would have earned 5 stars, but the fries were warm, not hot.  The burgers were fantastic, service was quick and friendly, could not ask for more in those areas!  Will definitely be going back!","useful":0,"funny":0,"cool":0},
{"review_id":"nBuiOsqkE8DyxKJOdoWSvQ","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"xYZefYQ777honVZnlcD3vQ","stars":4,"date":"2015-02-22","text":"Busy place, but they took me rather quickly and the lady did a great job on my pedicure","useful":0,"funny":0,"cool":0},
{"review_id":"_Rzm6xCJb01K7OrALNjSvg","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"CE05_kJvl0xRloi8fW6R3w","stars":5,"date":"2015-06-25","text":"They do a great job of letting you know what's wrong & how much it will cost to fix it.  They also say it in words that non-car people can understand.","useful":0,"funny":0,"cool":0},
{"review_id":"cvBoz0YGmK_Gh9tA5k-tcA","user_id":"dN9nRZmDCk0wk1Uya5kCRQ","business_id":"Fozo0B-y42EhRMomR0K5vQ","stars":5,"date":"2015-02-26","text":"Read a ton of reviews about waffalonia & finally got to try it! Yay!  The waffles with ice cream are super yummy and reasonably priced!  Not a lot of seating though, but that wasn't a problem tonight!","useful":0,"funny":0,"cool":0},
{"review_id":"Doxxt5bkC5WqsEIS_fX7gg","user_id":"LQ4sZeULtGb25ECjaONpUA","business_id":"SMNZS7w9Blmc8TOUZ4oqYg","stars":4,"date":"2015-10-24","text":"Very good food! I expected everything to be soaked in curry, but it's not. Everything was very fresh and flavorful, and the only spice was the green sauce I had them put on my chicken tikka.  The potato mixture is delicious, too. Definitely going back.","useful":0,"funny":0,"cool":0},
{"review_id":"rWc72Fx8ZKuat39dI-JLyw","user_id":"SGc1Qk_LR8G8WEEA5QafEw","business_id":"yY3jNsrpCyKTqQuRuLV8gw","stars":5,"date":"2017-07-16","text":"Amazing food and drinks. I've tried multiple main courses on the menu and was never disappointed. \nAlways happy to go there and would recommend to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"BRJNMM7GTEPH01f_S635hA","user_id":"SGc1Qk_LR8G8WEEA5QafEw","business_id":"DXl9YviWyzAwMeUtrBPW7w","stars":1,"date":"2017-04-14","text":"This place has limited seating and still cannot handle the capacity of people. We waited over an hour for our food just so we can be served cold soup and sandwiches. Coffee was lukewarm.  Despite the effort from the servers, it was not an ideal experience.","useful":0,"funny":0,"cool":0},
{"review_id":"Pj0HSetBFKDGW3nLqgthAQ","user_id":"SGc1Qk_LR8G8WEEA5QafEw","business_id":"wG4qwKeFdbS17bAKnNqZqw","stars":1,"date":"2017-07-16","text":"Ordered through ritual. Screwed up the order, burgers were dry and fries were burnt. Had to throw away a full order of fries. Don't waste your time or money here.","useful":0,"funny":0,"cool":0},
{"review_id":"nWwwX0o7_WHZKjKO1lzWPg","user_id":"OoN-KRtCG72_cpgaUzyHIA","business_id":"LAKs5UatFvOhlaF4sZ1obA","stars":3,"date":"2017-03-18","text":"The food is great but the servers aren't. The place isn't even full but every time i come here i can't get a refill ever!","useful":0,"funny":0,"cool":0},
{"review_id":"2IGdCNebh9MNb_jID8uMjA","user_id":"OoN-KRtCG72_cpgaUzyHIA","business_id":"UXL5eg0e6W1AZzmX6NAXdg","stars":1,"date":"2017-11-22","text":"This place used to be the best food for the money, now its just another expensive place with good food.\n\nThey just recently bump their prices (some things doubled in price) i used to go to this place often for lunch but i'm never going back. I used to get their gluten free for $14 which was kind of pricey this last time i went i paid $21 for the same thing. \n\nIf i'm going to pay this much for a meal i'd rather go somewhere else. \nThey just lost a regular client.","useful":2,"funny":0,"cool":0},
{"review_id":"omLVWOG39q4y-7cm5AUucA","user_id":"OoN-KRtCG72_cpgaUzyHIA","business_id":"BEnW9JoHqjdMP5u8luCnvQ","stars":5,"date":"2016-02-03","text":"Never did i expect to have a pleasant experience at the DMV! People are very pleasant, helpful and the place was clean. Its a nice building. \n\nThe thought of going to DMV has always been awful so it felt great arriving to such a nice place. \nGood job NC!","useful":0,"funny":0,"cool":0},
{"review_id":"CZHKKuQKKubQZqklL46SnQ","user_id":"M6-nAnW4RIjlY7urpCELzA","business_id":"JzNXaLxwWnC_zKOI0tkt2w","stars":5,"date":"2011-06-15","text":"We go a few times a month for their Tuesday wine tastings. Have a tasting buy a bottle of wine an get food from one off the places in parkewest. Their wine club is a great value. 2 bottles of wine a month, free tastings on Tuesdays and 1\/2 off on Friday and Saturdays.","useful":1,"funny":0,"cool":0},
{"review_id":"Qzaa4EJ1cBP6WXPhWPV9pA","user_id":"ZAWEuVjtgC65ITpDoCrI0w","business_id":"8zN3nV0zbtE377_XhlvabA","stars":5,"date":"2017-07-23","text":"Hey all, my 5 star is solely based on the food. I've visited at various times during the day and it seems run well enough, and though it seems to have a fairly large group of regulars it really doesn't bother me, but I know that that could turn some patrons off. HOWEVER, as a Chicagoian who values quality food I can honestly say that Jolies has a menu that's unrivaled in the valley. I've easily tried half a dozen dishes and everything was MUCH better than I expected. The service is always good, and it's easy to flag down a server when things get busy and they seem on top of it. So thanks, Jolie's, for being a place that's been reliably good.","useful":1,"funny":0,"cool":0},
{"review_id":"Nyn08bKSdqaie9zJXdZU9g","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"k8BThB11SS-DQDTl--kG8Q","stars":2,"date":"2012-12-12","text":"This is unfortunately another lackluster Mexican food place in El Mirage. It is REALLY frustrating. The food has never been bad (as in spoiled,) but the prices are high, and the quality is inconsistent. Sometimes it feels worth it, others I'm disappointed. If this were the only place nearby I'd say it's worth it, but Las Fuentes next to the Surprise theater, or any of the Humberto's taco stands easily beat this place for price and quality.","useful":1,"funny":0,"cool":0},
{"review_id":"DcQ6X-rMsnnRNNOEczPR9g","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"-aaVZUYi4Ys_DP0rcBsFTg","stars":4,"date":"2012-12-04","text":"I've been eating at this CK since they opened ... I think back in 2008. I probably go once or twice a month for breakfast, and occasionally for lunch \/ dinner. I can say that their management in the past has SUCKED. They've changed managers several times, and can never seem to get a good one. I have no met the current one, I just noticed that the last one I met is no longer there.\n\nThe waitresses are usually great. There have only been a couple that have been disappointing, and I haven't seen them around in quite a while.\n\nThe breakfast food is pretty standard. Pancakes, waffles, omelets, and all the usual breakfast meats.\n\nTheir burgers are decent, but I don't care for any of their other lunch items. Their all you can eat rib or fish & chips nights are a pretty good deal, but I'm not really impressed by their dinner food. However, I've never had anything that wasn't good enough for me to eat till I'm full.","useful":0,"funny":0,"cool":0},
{"review_id":"BXSOrMFhQUOjjDp7Sjru5g","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"LGEIsxeJQATo9J1IA-TEdA","stars":1,"date":"2012-12-03","text":"I ordered their (steak of course) fajitas and they were not good ... at all. I LOVE tex-mex, and I couldn't finish them. The onions tasted like they had gone bad, and soured the entire plate. Add to it that there was almost no flavor in the meat (salt and pepper are not the only spices in the world ....) I was extremely disappointed. When your restaurant is NAMED fajitas, you'd better deliver.","useful":0,"funny":3,"cool":0},
{"review_id":"_1XXeXKPY-2VPQIYVrNWHg","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"ZFhToWN998div0sU0vFLyA","stars":1,"date":"2012-12-03","text":"This place was TERRIBLE. Of all the Mexican restaurants in El Mirage \/ Surprise, this is easily the worst. I got the carne asada, and it tasted like they took a flank steak straight from the freezer to the grill with no stopping for seasoning or tenderizing. Chips were cold and unsalted, the salsa tasted like watered down ketchup, the Rice and Beans were inedible, and the Ice Tea tasted like it had sat all day to sour. PLEASE PLEASE, go to Las Fuentes, Rio Mirage, or even the drive through Humberto's next to City Hall before you go here.\n\nI'm a 5th generation native Arizonan, and I don't think I've ever had worse Mexican food in my life.","useful":1,"funny":0,"cool":0}]