[{"review_id":"HkXXFaLfzmHmw7Q1abyN5Q","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"nCEomY3N-sYkoUhIrlMbzQ","stars":5,"date":"2014-04-04","text":"I have been going to A Desert Song for now over 16 years since it was at the 16th street location. The staff are very dedicated to their craft and will help anyone, at any level. I would recommend the intro series for the new students, or the basics class. The staff will get to know you by name, and personally help you. Even in a large class you may feel like you are having a private yoga session, especially with the owner Mary Beth.\nAs others have mentioned, this place is truly a breath of fresh air in Phoenix. When I am tense all I need to do is go to yoga and it all washes away. If I need some deeper intervention, desert song is hands down the best place to get a massage in the valley. The practitioners can root out your stress and rub it all away. After a massage here I feel as if all of my stressors in life have magically disappeared. There's nothing that even comes close. They've ruined me for everything else.","useful":1,"funny":0,"cool":0},
{"review_id":"niQdRTa0vHfyEcRBp8QKXQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"QJl-EAKJQjUZoBBQPKhCgg","stars":2,"date":"2014-03-09","text":"This is a low budget high priced store. Superstore? Not really. They don't have a huge selection and then they direct you to their website. If I wanted to buy something online then I would have bought it online! They also have no return policy, which for a mostly online store, strikes me as a bad practice. The store itself is dusty and disheveled, with badly designed window units. David's Bridal seems high class compared to this. However, they do have a good clearance section. It's in the section of the store where the broken display items and torn signs are.","useful":2,"funny":1,"cool":0},
{"review_id":"7WYO4V4vG9Q9g6mkQmWTKQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"pup46G8qFBG8695RtbQNwA","stars":2,"date":"2013-12-22","text":"Meh. Tricolored chips? Really? Salsa? No taste except for spiciness. The $10 for the \"Hand squeezed margarita\" was money poorly spent for what was clearly a margarita made with a mix. The menu is sparse, with not too much of a selection and a la carte items starting at $7. The servers are clearly instructed to up sell, but we did appreciate the attention. The food came, and it was incredibly bland except for the one note punch of heat and the blanket of cheese on top. Two stars for the service, the tortilla and the portions, which are hearty. Overall, not worth the $42 for two people plus tip. Never again.","useful":1,"funny":0,"cool":0},
{"review_id":"kVuKd8OjHaGdpfFUQrCG3Q","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"aTd8upPhfxefiecvTbtUMg","stars":3,"date":"2015-12-28","text":"Cheap and right down the street, but they don't take appointments. Ann is great for eyelashes though, the best in central Phoenix.","useful":0,"funny":0,"cool":0},
{"review_id":"_0QTwEM3HEakNGg20LnYVQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"JMkBrqzBKFtVgmpyAy3jKQ","stars":5,"date":"2014-03-24","text":"Wow. Jayd not only gave me what I needed for my wedding, she was able to accommodate us last minute and came to our house. She was completely professional, even when dealing with my crazy family! She also put my friends to ease since it was their first time.\nAlso, she knows all of the hookups for beauty treatments in the valley, so trust her with those!!!!","useful":2,"funny":1,"cool":1},
{"review_id":"FEsA2y9ZQt9ZeRmP8Vad4Q","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"B6_0FVtTtUbodbD_LKgLnw","stars":2,"date":"2014-03-24","text":"So just an update, she did contact me and say that she had an unexpected death in the family, so hence the no communication.","useful":0,"funny":0,"cool":0},
{"review_id":"daZWrfqim9zkgTRm-fUoEA","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"-Bdw-5H5C4AYSMGnAvmnzw","stars":2,"date":"2013-09-17","text":"I have to preface this by saying that I'm a vegetarian so I may be slightly skewed in my review. Yes this is \"comfort food\" and I understand that doesn't mean healthy. However, the dish I ordered came out in a pool of grease.  The \"baked eggplant\"  tasted bland and oily, and all the while the bartender (we sat at the bar) kept raving about how delicious the food was. Hmmm not so much. We also had a salad, pretty good but small for the price, and an appetizer. This was the mixed rellenos which were a little better but missing...something.  My fiance had one of the rellenos with beef in it and he said it was grisly. All together, the bill came to over $80 for one salad, an appetizer and an entree, plus two drinks. I would come here for just wine but nothing more.","useful":0,"funny":0,"cool":0},
{"review_id":"gX7Zlzka6Q0WZYlO0LoviQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"S-oLPRdhlyL5HAknBKTUcQ","stars":3,"date":"2016-01-16","text":"This place is great, but it's first  come first served, and you're all packed into a real small area by the door and very much in the way. This would be much more efficient if the hostess took names!! I really don't know why they don't. Extremely efficient once you're seated, I'd say we waited maybe two minutes after we ordered to receive our soup and edamame, then the rest of the order just rolled on out. The food was very good!\nOh, worth noting, the bathroom is in a strange location, check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"DVQf6O5-Jli_f4n-G8-IAg","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"J3HR1X1oARY-sXrKq-bc-Q","stars":5,"date":"2013-09-17","text":"So I went in here today after the last \"bridal salon\" I went to was a complete and utter disaster. I normally wear a size 12 to 14 in \"street wear\" and don't have any problem buying clothes at normal stores, so I don't even consider myself plus sized. However, after the last place literally brought me to a panic, I bit the bullet and called Strut. Ann, the owner, was able to get me in last minute.  She was incredibly warm, asked me about which gowns i liked, and even pulled a few that I wouldn't have otherwise tried on. Guess what I fell in love! And with a dress I wouldn't have thought of. Who knew I had a waist? Ann did!  She was great, incredibly friendly and most of all, warm. She made me feel like a bride. I would definitely recommend this salon to anyone who has had a similar experience. I definitely felt no pressure to buy, but I just knew that dress was the one. Thanks Ann!","useful":1,"funny":0,"cool":0},
{"review_id":"Q_g2rEC5SbmNfD0xDbIAcw","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"drIFrAyZnyismS1ArZlmAg","stars":5,"date":"2015-02-18","text":"I have been coming here for almost 20 years. I followed them from 7th ave. I still, and always will, know them as \"Supreme Master.\" These people are the best, the first, the only true vegetarian Chinese\/Vietnamese place in the valley (please let me know, yelpers, if there are more!).\nI've staged breakups here, and first dates. I had my 18 year old birthday party here. And my 30th. I didn't tell my relatives it was Vegan. They never asked.\n\nIn all of the cases, DO NOT UNDERORDER!\n\nThrough tears and heirs, order the extra mu shu. Don't forget the lemongrass chicken (an order per person), sizzling rice soup, and the New York charm.\nI have one rule here: always leave with leftovers. They usually don't make it to the fridge, let alone the next day.\nOh, and take kick of religion in stride.\nChopsticks optional.","useful":5,"funny":3,"cool":2},
{"review_id":"1MnJVvt6YcDbcK1WE_IxNQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"Arox2o0zyinAFrsE_HDtHg","stars":4,"date":"2013-09-17","text":"Ok, so it's LA fitness. This is not a fancy gym, but for the price you really can't beat it. I, like many other posters before, go a little farther to avoid the 20th street one. Yes if you come on weekends and week nights it may be crowded.  However, I've never had to wait for a cardio machine so no complaints in that regard whatsoever.\nI've been to a few classes too, and now have experience with personal trainers, so I'll give my input on those.\nThe good: I Love love love Katherine for cycle. I've been to spin studios and she seriously kicks butt. She had a sub a couple of weeks ago and I wanted to cry the whole time because Katherine is so much better.\nI also really love Cassandra for personal training.  She works me hard but knows how to modify the exercises. She's really nice and understands weight issues, injuries, etc.  She kicks butt!\nYou can watch tv and charge your iPhone at every cardio machine! Woohoo!\nThe bad: ugh I hate step class. I'm not sure if I really just hate the step class or if it was the instructor, but its boring.\nThe ugly: My personal training assessment was not so good, mainly because of the kid who did it was not too sympathetic to my struggles, and said some things that sounded judgmental, ie \"how long have you been overweight?\" Me: my whole life. Him: \"really, why? (In a snooty tone)\" That's just one example. I feel with a little customer service skills that could have gone a lot better. High pressure sales, belittling don't usually work on me, and I had gone in there already deciding to sign up for personal training, so it wasn't necessary at all.","useful":4,"funny":1,"cool":1},
{"review_id":"v_FNVgP57Xig7XNVeHknfA","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"pHpU8lnnxMuPWRHOysuMIQ","stars":1,"date":"2014-03-09","text":"I really wanted to like this place, but unfortunately it gets one star for the food alone. Maybe other things on the menu are better, but definitely steer away from the egg paninis. Maybe they ran out of ingredients? The vegetable one, which was supposed to have vegetables on it, had what seemed like less than an egg, one slice of tomato, 3 leaves of wilted spinach and some red onion. It was ALL greasy bread with no flavor (nothing really was inside of it). All that for $10.\nThe service was good, but with so many other options in the area, why waste your hunger?","useful":1,"funny":2,"cool":0},
{"review_id":"dP5ZUeyelsHpCbHP8NgohQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"Vxi-celYU3bWbDwm47wKHw","stars":1,"date":"2014-04-04","text":"Oh geeze I loathe this place. It smells like a sweaty swamp full of mold, yeast, day old balls and other unidentified bodily odors. The fluorescent lights blare while the instructors yawn and fan themselves with the list of asanas they repeat session after session ad nauseum. Did I mention it's also 100 degrees and 95 percent humidity in there? You will also huddle together as there is always a groupon bringing in the hordes. Don't worry, you will be able to see every inch of everyone's nearly naked body for only a few minutes as the mirrors quickly fog up with your collective sweat.","useful":2,"funny":2,"cool":0},
{"review_id":"42Y52MaU1C-GhZBnDxrN_w","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"OCQ3t1Tps_ARxHmYOpXEaA","stars":1,"date":"2016-01-13","text":"They close early, doors were locked at 430 in a Wednesday when their sign says 5. I will update this if they are ever open.","useful":0,"funny":0,"cool":0},
{"review_id":"UR2EbFqtt78TY2bISZwpFQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"TQxMhEar6--Wj4Du8nRQsw","stars":4,"date":"2014-03-27","text":"Just eat the drunken noodles and the peanut sauce. Just do it. I love this place, although I do agree that it isn't quite as good as it was a few years ago. It's still the best druken noodles and peanut sauce in my book.","useful":1,"funny":0,"cool":0},
{"review_id":"K3JYqRbkCIQbrjprMs1FfQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"bmS1onKPckNWPPREDAC8Gw","stars":2,"date":"2014-03-24","text":"So I was so excited to come in with my wedding party. She was unresponsive and didn't seem to even want the business. She doesn't do mobile, which is a little odd considering she stood to make hundreds of dollars. Luckily I found someone else who was a lot nicer, more professional and also did a good job.","useful":1,"funny":0,"cool":0},
{"review_id":"ZzIwjPv9DsluQvRNRSSMdA","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"GRoVL2n6HO3I1H4NtJLYMw","stars":4,"date":"2014-04-04","text":"I went here at their Central location a few years ago and loved it. The whole experience was like hanging out with some friends while getting pampered. I totally recommend it!","useful":2,"funny":0,"cool":0},
{"review_id":"CxQwcUP7taTaVUMovwyPfA","user_id":"RV7QFjb_VWZ-AaVmgnFDmA","business_id":"mO8ukT3f5BRQ29pC_WoAtg","stars":2,"date":"2014-05-15","text":"Honestly I will NEVER come back to this place, not only was I over charged for some nails that were TOO thin, 3 nails broke in less than two weeks. The woman I went to was very rude. I'm so disappointed.","useful":7,"funny":5,"cool":4},
{"review_id":"71n2SfEBCyC-MUsiH2S3MA","user_id":"o1VxsUQToeUXhjpsSms1Hg","business_id":"dLOjs9bNH327Ir9umpTQRw","stars":3,"date":"2011-06-05","text":"Customer service: I went in for the first time I signed in and they told me to sit down and wait! Well I was the only one there and there was two of them watching a movie! I sat there for 5 to10 mins waiting! When more people came they helped me! That us why their customer service is a 2 star!\nService: well the lady doing my eyebrows did a good job! By making it fast and less pain! Usually when I get my eyebrows done, I usually have a lot of hair to clean so they clean where they see my shape of my eye brows then make it thin but not too thin until they ask me if it's ok! Then I tell them to thin it out in curtain places! But the lady who did my eyebrows at this store,  made the front of my eyebrows a little too thin! So when she asked me if my eyebrows are ok! I could not say, no you made it to thin! She can't just grow my eyebrows back! But I looked at it and dealt with it! \n\nWebsite: there website says \"first time client get a perfectly done eyebrows for half off!\" that is a false statement cause asked and told them and showed them on my iPhone! And they said no, we don't have it! So What the hell, I paid for my 10 dollar!  I would go back but I want to try others before making a final decision on which one I like!\nThis was close to my house!","useful":4,"funny":1,"cool":1},
{"review_id":"M8Gv0nrhOXaXK6bMJRp9rA","user_id":"o1VxsUQToeUXhjpsSms1Hg","business_id":"p3xAyO2DEbiC5c3dW1e20A","stars":5,"date":"2014-05-16","text":"I got my hair done at ulta and had a wonderful time! My stylist was amazing! Her name is Val, I recommend her for the life of my hair.\n\nBackground info on me and my hair: I am from the Bay Area and I always had my hair done by an Asian because it always came out the way I wanted. I am really anal with my hair and need it to look a specific way. I even interviewed my stylist to make sure she can give me the quality of hair I want.\n\nVal is an amazing stylist and I love that she listened to exactly what I want, I even brought a picture of the hair style and highlight color. She walked me through with the cut length and color of highlight, then she did her magic! \n\nWe had a wonderful conversation and talked about everything, she is very down to earth and easy going! It took me 4 year to find the right stylist in vegas and I found mine!! \n\nIf your looking for one, Val is the lady, go and talk to her and tell her what you want, and find out yourself!","useful":1,"funny":0,"cool":1},
{"review_id":"eRmztT5k1L5KRXy5AgrBOw","user_id":"OM3NxFqyPPgwrKeZh4Nnkw","business_id":"aiX_WP7NKPTdF9CfI-M-wg","stars":2,"date":"2015-04-02","text":"The best part about this restaurant was the unique setting.  It is a quasi-outdoor warehouse with casual seating areas (apart from the restaurant seating) and outdoor games.  Aside from that, not much to recommend it.  The service is awful - slow, inattentive, amateurish, and uninterested, the drinks were weak and just so-so, and the food was bland and did not live up to the restaurant's self proclaimed \"gastropub\" moniker.  But then I'm probably spoiled by the Twin Cities' more sophisticated, maturely developed, and creative restaurant scene, which Phoenix just can't touch.","useful":0,"funny":0,"cool":0},
{"review_id":"z4KHqmQvNJQg-Cs_ChQL2g","user_id":"S_YGDzuBblToMAXDYWld5Q","business_id":"p_IB-mepGK6xMZBC-20mZw","stars":5,"date":"2017-10-19","text":"I had an amazing experience at Fino, the vibe is just amazing and every one is so friendly. My barber Antonio Vaz did an amazing job. He gave me the best hair cut I've ever received. I would highly recommend going to this shop.","useful":0,"funny":0,"cool":0},
{"review_id":"kKJwDPJmfY0Pf6REnTJmVg","user_id":"gJVmZmExiDRezwN5l3SK6g","business_id":"xFkUn2tIJY0vkcm1Hl5m_A","stars":1,"date":"2015-07-12","text":"Had to try Wahlburgers in town since I had seen the show many times. However the burgers are overpriced for the size and without any sides being included. The burger tasted fine, nothing extraordinary, and lacked any reason to come back. The service was subpar hostess was very nice but our waitress was not friendly nor attentive. The manager that was featured on the show, never asked us how our meal was as she was on her phone for a majority of our visit. I would not recommend visiting, just take a picture outside.","useful":3,"funny":0,"cool":0},
{"review_id":"697kAt92azD5U7waU_-SpQ","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"yQab5dxZzgBLTEHCw9V7_w","stars":5,"date":"2010-05-30","text":"schöner Umsteigeflughafen: Viele restaurants und geschäfte, Schaukelstühle mit steckdose nebendran im Zentralbereich und gratis WLAN für alle.","useful":0,"funny":0,"cool":0},
{"review_id":"MFRz_bgtR7NfmdUVZ-oKxw","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"lAR6Lj6-zBxQNqflZt0zTQ","stars":2,"date":"2008-11-13","text":"Hier wird Qualität über die Menge definiert. Riesige Portionen, die sehr satt aber nicht wirklich zufrieden machen. Nicht wirklich schlecht, aber halt auch das typische Mittelmass und amerikanische Austauschbarkeit. Abgesehen davon: Sehr, sehr typisch amerikanisch, auch wenn das Lokal versucht sämtliche Italieneische Klischees zu bedienen. Manchmal mischen sich zwar spanische Sätze in die Dekorationen an der Wand, aber ist ja alles Europa.\n\n\n Am Nachbartisch eine ganze Hochzeitsgesellschaft. Las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"_taS349aF6xeLc-wFSC6_g","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"NCFwm2-TDb-oBQ2medmYDg","stars":5,"date":"2008-11-21","text":"maybe the only must-see in Las Vegas (you need to hope for good music, though - if not, wait another 15 min and try again)","useful":0,"funny":0,"cool":0},
{"review_id":"DEahaPEKsl9DQt6ap7dtXw","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"1Df5WnLX3DqN6ymlhqznaQ","stars":4,"date":"2008-11-21","text":"Any restaurant that produces such a delicious chocolate soufflee deserves full five stars. Its takes about 20 min after you ordered, but I consider this definitely as a good sign: It's fresh! Great seafood as well, by the way. But that's not important ;-)\n\n\n However, if I compare it directly with my other five star locations, it just can't get more then four, sorry.","useful":0,"funny":0,"cool":0},
{"review_id":"TUFQ0xsIXHfBVJdKaE31jw","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"cJWbbvGmyhFiBpG_5hf5LA","stars":4,"date":"2008-11-21","text":"some say, it's even better than the Original (http:\/\/www.qype.com\/place\/8913-Hofbraeuhaus-Munich) .","useful":0,"funny":0,"cool":0},
{"review_id":"RxYQHrFkfBC9vvaRJFM2Lw","user_id":"7ieFGBmuwf3zAhJREFuSCw","business_id":"OFw59czUoeeosFMKfRawmg","stars":3,"date":"2008-11-21","text":"Not my favourite Gordon Biersch Restaurant (for example, I prefer the one in San Francisco - but that might be since I prefer San Francisco to Las Vegas in general) but definitely worth considering. It's the same good beer and great burgers & garlic fries.","useful":0,"funny":0,"cool":0},
{"review_id":"v__fZZf3FYUC12q9pV2RZw","user_id":"MO9PqQn2yIh0UjmvWTAgIQ","business_id":"g7LC8EnBxXFWhm4UrriCJg","stars":5,"date":"2015-11-03","text":"My all time fave sushi place in town  Friendly staff! Great service as always. The place is always packed. My favorite is their calamari and mango roll. Will be coming back for more!","useful":0,"funny":0,"cool":0},
{"review_id":"_4jfuJGmtQG-bzzcpSz01w","user_id":"MO9PqQn2yIh0UjmvWTAgIQ","business_id":"YlH13A5DQcnWbzmxvQ7dvw","stars":5,"date":"2015-11-03","text":"Their ramen is the bomb! Serving is huge and I never get to finish the whole bowl lol Nice and friendly servers. Don't forget to try their takoyaki as well super deli and addictive!","useful":0,"funny":0,"cool":0},
{"review_id":"-3NOnYTv9xh0yL4MxxxeFg","user_id":"MO9PqQn2yIh0UjmvWTAgIQ","business_id":"pD8WUQDJFeCD2xxMcW3hHQ","stars":1,"date":"2015-09-28","text":"One of the most horrible receptionist I have encountered. Her name is Tram. Awful, unproffesional, rude, impolite. She lacks the most basic sense of propriety, compassion and kindness in dealing with their clients. Taking my business somewhere else because of her!","useful":0,"funny":1,"cool":0},
{"review_id":"nbzmFCW84_PPVuOtBloz1A","user_id":"MO9PqQn2yIh0UjmvWTAgIQ","business_id":"TxpreKdif84agTHRu8zRpg","stars":4,"date":"2016-01-12","text":"Will give them 4 starts because of the great service and presentation was nice but Unfortunately, most of the food that we ordered tasted bland. From appies to soup to rice dishes. Especially the Tipsy Tapsi which I didn't enjoy at all. The garlic rice was served cold so I had it re-heated for me. The meat was tender but no taste. The tofu and pork belly was a little bit pricey for 4 pieces and tastes okay. Siopao sliders were actually good (the only one I enjoyed). Oohmami soup was kinda bland but the meat was super tender (two tumbs up). Sisig was a little bit burnt. Bagoong rice bowl was okay. I hope they focus more on the flavor. We might visit again.","useful":2,"funny":0,"cool":0},
{"review_id":"25Y8HNvwbEakyJVpjDxP3g","user_id":"6HTzFfcxkPM_CKG_BmKDoA","business_id":"Q8-4uLtLJeXHJZZsr2Zexw","stars":5,"date":"2013-11-08","text":"Amazing sashimi! The rock shrimp and spicy chicken are amazing as well. Everything is great here and they have a lot of different choices.","useful":0,"funny":0,"cool":0},
{"review_id":"zoZcu-hnhyMsd_y67u_rbg","user_id":"6HTzFfcxkPM_CKG_BmKDoA","business_id":"F7uDccc_XT5aYamZeSkcZw","stars":5,"date":"2013-12-22","text":"Great service, best sushi in Vaughan right now. The rock shrimp is amazing and the sashimi is cut thick and very fresh! You can order blindfolded and be very satisfied with anything brought to you","useful":0,"funny":0,"cool":0},
{"review_id":"WsaggRyKHNFwBDZ1xn4qoA","user_id":"MGBmVVVNRUeS8OxNEQV7GA","business_id":"cXRCxeaKHyOR8SnrDXv_DA","stars":4,"date":"2015-07-14","text":"Awesome sno cone! The ice is so soft and fone, not chunky and hard like some places. They also have a great selection of flavors and the price is what you'd expect to pay.","useful":0,"funny":0,"cool":0},
{"review_id":"sTR30-hsK2c27motW9na9g","user_id":"MGBmVVVNRUeS8OxNEQV7GA","business_id":"i8ijGG8LXmFOWTz-Haej7w","stars":4,"date":"2015-07-14","text":"I've gone a few times for lunch and I've had a good experience every time. They have fast service and the food is yummy. I really like their complementary salsa and chips and the chimichungas are delish!","useful":0,"funny":0,"cool":0},
{"review_id":"q4RrC03yq3pCwXchocOKgg","user_id":"MGBmVVVNRUeS8OxNEQV7GA","business_id":"OXFWfJIp5pN8fIQGxOYvzg","stars":5,"date":"2015-07-14","text":"I've been to several area nail  salons, and I haven't been as satisfied with any of them as much as I have at Infinity nail. They have one of the best gel and regular nail color selections I have seen. I have gone at least 3 time since they have changed owners and renamed the salon, and each time my gel color has lasted the full 2 weeks without chipping! And that's amazing to me because being a health care professional, I am constantly  washing my hands and using alcohol based agents. Anne and her husband do an excellent job and always make me feel welcomed. They also do great designs and 3D art for nails! I would recommend this nail salon over any I've been to in the past.","useful":2,"funny":0,"cool":1},
{"review_id":"hLwaP3bmZkRraS9Yzonkyg","user_id":"OL9vY3mDxMoIycrutz0OHQ","business_id":"-QK041S1Clr0N4m3adwRpA","stars":5,"date":"2017-01-02","text":"This was my first time here and I was blown away with the results! It came out to a really nice color that I wished I should've done sooner. I live all the way down in Henderson and it was worth it to come all the way down here. All the staff were amazing and nice. I recommend for any one who wants their hair colored or anything else. This is the place you would not regret coming to.","useful":0,"funny":0,"cool":0},
{"review_id":"sZnEOYo9K8QH72mgmq7yJA","user_id":"VdaZ6XMidy4c4MUOMDvXpg","business_id":"PU2uJbQ8McMubvRNsK445A","stars":1,"date":"2014-08-08","text":"Let me preface this by saying that over the years I have wanted to sign-up for yelp but have not for one reason or another. I would never want to publicly say something mean about a place of business; however my experience at Garage Boutique left me no choice but to sign-up and post a review. I have never, in all my life, been treated the way I was treated in this store. Picture Julia Roberts in Pretty Woman on Rodeo Drive; however a. I am not a hooker and b. Garage Boutique is not a shop on rodeo drive. The only similarity is the snotty, arrogant, rude manager\/owner-whatever she might be.  I was not looking to simply browse that day.  I  was on a mission for a few gifts and found them in this store. Never-mind making a purchase, the sour customer care made it impossible for me to actually give this boutique anything more then a look of shock at their nightmarish treatment of potential customers. Simply put, do yourself a favor and shop somewhere else. All their designer merchandise can be found online or in stores that actually represent the kind people of Arizona and not the vapid management from the Garage.  I am returning to Arizona with a group of girls who are pregnant\/have children. We will not be going to this store; which is a shame because they did have some cute things. \n\nOn principle, I refuse to give them any business. There are better stores in Arizona that do not operate under the premise that you should feel honored to be able to shop in their store. Business must be good to treat people the way they do.","useful":6,"funny":1,"cool":0},
{"review_id":"NXn2ETuHimV_V8vnIp1--A","user_id":"wB51fZPfNCwS2ePcJmDEyg","business_id":"-Bdw-5H5C4AYSMGnAvmnzw","stars":5,"date":"2011-01-22","text":"Thoroughly enjoyed the Skirt Steak plus the dessert of the day, a chocolate pudding with a cakey covering was delightful. Cant wait to go back!","useful":2,"funny":0,"cool":1},
{"review_id":"PZJOQGrRLcS4ys4Jthdqng","user_id":"wB51fZPfNCwS2ePcJmDEyg","business_id":"hU6sN5r6vayqm_RMgvPGOQ","stars":5,"date":"2011-01-27","text":"Pricey but so worth it.  Asked our waiter for cheese suggestions and they always hit a homerun. The wines are always good, service is great and food is incredible.","useful":1,"funny":0,"cool":0},
{"review_id":"vLF0zyxeU-1t7iwFJqPizg","user_id":"wB51fZPfNCwS2ePcJmDEyg","business_id":"j0_DUr3vBXY-JP-b0bf93A","stars":5,"date":"2011-01-22","text":"Awesome, Big Ben sandwich is delish and chocolate\/strawberry scones is one of the best I have ever had, and can't forget to mention the coffee and tea, great place","useful":0,"funny":0,"cool":0},
{"review_id":"fXDLcVJOZ9HetET9miIPFQ","user_id":"bZzvV6bwL1vujiG6MFDMSA","business_id":"SZpzzfyKOojW2GIYPzSo_A","stars":1,"date":"2015-05-15","text":"I went to the welcome to night vale live show and I was harassed by a security guard. He accused me of recording the show and when I proved I didn't he put his hands on my mother. Then he stood behind us and made me terrified and upset. I couldn't even enjoy the show at all. It was very upsetting and I will never be returning here. We complained and the manager did absolutely nothing.","useful":1,"funny":0,"cool":0},
{"review_id":"CHFyoDzYWNTbgWjemB429A","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"EK_pkOQgVQC3Ctx2_a5jcA","stars":5,"date":"2012-02-28","text":"We Care Family Wellness Center is the most exceptional doctor's office and staff that I have ever found. Every employee here genuinely cares about you. I highly recommend.","useful":3,"funny":1,"cool":1},
{"review_id":"G25LA-BgjrYfcEZDHv9Liw","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"vuuqo4n4SFU6Lft5z8bCnQ","stars":5,"date":"2014-08-10","text":"Friendly, helpful employees.  Awesome selection of flavors. I was there on a Sunday evening. They have a nice area in the back by the lake to sit & enjoy your yogurt. It was a good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"-evufjMxFS8BLGMGTDyqtw","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"Jhz-8IqPf_2YUWsbGFyDNA","stars":4,"date":"2015-11-09","text":"Friendly, helpful employees, and wonderful vegan food!","useful":0,"funny":0,"cool":0},
{"review_id":"goJySu82CXiWqg9nEFmiCQ","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"fjR3W5nd02fev0ZseLsoEw","stars":5,"date":"2012-10-12","text":"The 1st time I went here for a pedicure, they were not busy, and they really made me comfortable. This place is the best I've  found for a pedicure since moving to AZ 14 years ago! The owner, his wife & most of the workers are very courteous and friendly. Sometimes they get really busy. I've never had to wait more than 20 minutes. They try to accommodate everyone, but when you have more customers than workers, that's hard to do. They definitely make the effort to get you to become a regular customer.","useful":0,"funny":0,"cool":1},
{"review_id":"6Bt0_iSvnLPvLFC6NVuNKQ","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"uSuEv4Jh9BGViT-ZQ1xzBA","stars":5,"date":"2016-01-28","text":"Best yoga studio I have found so far in my life! Zen, baby!","useful":0,"funny":0,"cool":0},
{"review_id":"h7kdCfS0wYGqJXpJToqPXA","user_id":"_6p2iK3hniCrYiaSTaXdxg","business_id":"s8pPawiXUdLV4hRBkVLgMQ","stars":4,"date":"2015-02-13","text":"I go there often and have had nothing but excellent service. They are one of if not the only bank that does not charge for a simple thing like counting your change. They are also open on Sundays which is awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"KXrrFZItm2Se7Q3ctQWJCw","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"epAifIGqwj5oFp5MV8kgiQ","stars":5,"date":"2016-06-04","text":"Hands down the best Italian food in the city ! There is nothing fancy about the place, very approachable for anyone and the value for the price point is great ! Wine list and wine knowledge for the serves needs work but the ambiance and service aptitude makes up for it by leaps and bounds ! highly recommend this place any day of the year !","useful":1,"funny":0,"cool":0},
{"review_id":"49u8FIjSuW-n-aH2LoH3kQ","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"SzcCJJmreMlWCsNjupdVAA","stars":5,"date":"2016-06-18","text":"Hands down one of the best restaurants in Cleveland, went there last night with my fiancée and she absolutely loved it as well. The ambiance is quaint and perfect , service was excellent ,the server was confident in knowledge of the menu and made recommendations like she knew the menu in and out. Food was fantastic , bottle of wine delicious , I guest what more could you ask for.... Definitely going back and Certainly recommend L'Albatros as a must visit.","useful":1,"funny":0,"cool":0},
{"review_id":"Hmo0Nop3bjqAITi4gzmTSQ","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"Cgz5LfLohDjo1rmPL5l9Tg","stars":1,"date":"2016-06-11","text":"United is by far one of the worst with timing & delays, above & beyond their service culture is non existent. I have had to unfortunately fly United airlines a few times over the alt couple years & every time it gets worse & worse, they have a big network & don't care! I This time it was to Newark to the same song & dance of delays, missed connections & lack of basic courtesy to try & make it right... I try and avoid United when I can & will continue to do so !","useful":1,"funny":1,"cool":1},
{"review_id":"5secTRIgoB7s3a11cDYHxg","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"anzCdD5eIEHwydTpXhLlUA","stars":5,"date":"2016-06-04","text":"Hipster vile up in here.. Good dogs and cheap beer, I'll give it another try next time I'm in mood to having out with a bunch of cool hipsters !","useful":0,"funny":0,"cool":0},
{"review_id":"mrgFss9YhwSEfkOe0bnq4Q","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"cX2Nr_XmGYlMaBW35M0sUg","stars":3,"date":"2016-06-25","text":"Having lived in the south, I have a skewed opinion of this place and the food offerings. It's ok at best , perhaps for Cleveland standards it might be good as I read through the other reviews but when you compare it to the real BBQ from Tennessee or Texas this place doesn't even compare or come close. A for Effort, B for Food Quality and a C for Service delivery , perhaps with more menu knowledge and time, service delivery will improve to match the hipster county vibe the place is trying to give off. My recommendation , try it for yourself to determine !","useful":0,"funny":0,"cool":0},
{"review_id":"Oe_13KszQtTzA-1Z8izYnw","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"qlg2QMEErgseygqs_MQETA","stars":3,"date":"2016-06-21","text":"Overall I give it an ok ranking jut because it's not great,  it's right at the cusp of just ok and good.. The ambiance is great , open kitchen concept, open bar , great happy hour & reasonable pricing on the menu makes it a local spot to check out. It's got all the makings of a great place but the service just lacks that crispness one would expect & food also needs a little TLC work... $2 Peroni's on Tap , that's a whole different story! Definitely coming back for drinks @ the bar but not so sure I'll be going out of my way to plan a dinner here.","useful":2,"funny":1,"cool":1},
{"review_id":"r8aSuxHcLc4H-NSCstXPKw","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"RsxqZk0wswetGMaaQh2r2Q","stars":4,"date":"2016-06-04","text":"Can't say enough good things about this place, hidden gem ! Cocktail experience is better at the bar than on a floor\/table seats, knowledgable bartenders that make this a good place to visit at least one even if you're not a cocktail guru...","useful":1,"funny":0,"cool":1},
{"review_id":"VHlk-3qjeoed9F1vAXVcww","user_id":"Pnyedcoi2k6YZ6TfwGOYGw","business_id":"xnLNPkL7bbdhD842T4oPqg","stars":5,"date":"2016-07-08","text":"Let me start off by saying that I'm not the one to rate any place 5\/5 often (call me stingy with ratings) but I will give credit where credit is due. What an incredible spot this is and I've been up here a few times and keep coming back for more! Yes , hands down its the best view of DT Cleveland but this place offers much more than just that. The food and cocktails are generous portions ,plenty of options for you beer snobs and a nice variety of wines for a nice day out on any roof top,I particularly enjoy getting the Ahi Tuna Tartar and the Steak tacos which by the way are also on the happy hour menu,  I've had my steak tacos a couple times with a beer brewed just for the hotel locally (bartenders tell me it's made a few miles away and only available at the hotel) , I'm no micro-brew beer snob but find that pretty cool and the beer is absolutely delicious !! To top it all off on the 12th floor (The lounge is on the 12th,Ha!) the service staff is just straight up friendly. I've sat at the bar and in one of their fancy couch sections (open seating BTW) and gotten serviced pretty quickly and by some very friendly people , I had heard some mixed reviews but my experience has been Spot-On the few visits I've had with friends for happy hour or late nights, they get to you quick, bring you great refreshing & delicious cocktails with a smile , Kudos to whoever is making those things happen ..I'm a huge fan! Highly recommended .","useful":1,"funny":0,"cool":0},
{"review_id":"OyJ5ezB-Xa_hNpYAx7Fj1A","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"mQnYgd5ywCzYMblWqL7-AQ","stars":5,"date":"2015-04-02","text":"After speaking with 4 other companies who were incredibly rude on the phone, and who I later discovered had received terrible reviews, I was referred to Appliance Works by another company who didn't service my side of town. I am so fortunate that they sent me to Appliance Works! The receptionist was so kind and sympathetic (broken dryer with 3 kids aged 2 and younger) they give you a realistic time frame for when they'll arrive, and the repairman arrived on time, well-groomed, and incredibly friendly. They ended up not having the part in stock, but they expedited the order and was able to fix it two days later. They didn't charge me for the first visit, and only asked for payment after everything was fixed. It was reasonable and I will be calling them the next time I need anything repaired. But of course I'm hoping that doesn't happen anytime soon. :)","useful":2,"funny":0,"cool":0},
{"review_id":"4N-zcirImMpRsbyKnPMWcg","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"PzI468m66KKNNpbX7brjVA","stars":5,"date":"2012-06-02","text":"I can't say enough nice things about Tom and the folks at Floor Source.  I had received a quote from a big box home improvement store (which shall remain nameless) and was shocked at how expensive they were for cheap-looking carpeting.  I went to Floor Source and not only was their carpet much nicer, their price was nearly half of what the other quote was, and they install the very next day!  The carpet looks beautiful and the workers were fast and professional, caused no disruption or damage to the walls (which the other company couldn't promise wouldn't happen).  These guys know customer service and I'll refer anyone who asks to Floor Source!","useful":7,"funny":0,"cool":0},
{"review_id":"BELrusBKs_dB6SHBcHfOfw","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"QLAfLK9tzgTnsypzwR27vA","stars":5,"date":"2012-06-02","text":"Jeff could not be more awesome!  He arrives when he says he will, doesn't overcharge, goes WAY above and beyond the call of duty, fixing every switchplate that he notices is out of alignment or improperly installed.  His prices are extremely reasonable, and he didn't even charge us for a second visit when one job took a long time and he needed a special part for our doorframe.  What a professional!  I've already recommended him to one friend who needed a locksmith for a new house, and will for anyone else who asks.","useful":0,"funny":0,"cool":0},
{"review_id":"cP51cBtwOBqbrnteCFIKJA","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"xEc_S1Oz22QEmQK9CbdDMg","stars":5,"date":"2012-06-02","text":"Had a wonderful first experience with Bill's Pest Control - they arrived on time, charged me the quoted price, and gave me quite an education about the pests lurking in and around my home.  Our technician was Tina, and she really loves her job, I've never heard anyone more excited about the critters of the valley (and how to eliminate them) than her!  Hopefully we'll be sticking with them for years to come and hopefully we'll stay bug-free.","useful":1,"funny":0,"cool":0},
{"review_id":"MXS9IZ_hoBZXkUftsnEXog","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"hdnYZ7s1V8qEuOn91xky8A","stars":5,"date":"2014-02-08","text":"Another great haircut by Joanna! She always takes the time required to cut and style my long, THICK hair. Been coming to her for 13 years now and wouldn't dream of going anywhere else. She's fun to talk to, and she always remembers what's going on in my life. A great person and wonderful stylist. Highly recommend!","useful":1,"funny":0,"cool":0},
{"review_id":"2wdZCMlP_usUOCNWwJi6FA","user_id":"I4uBxqEgwMj_cmo5CiHUTw","business_id":"3Alq2Er28QVsdxGJlQgVkg","stars":1,"date":"2014-06-04","text":"Closed! I drove by this location today (June 2014), and was sorry to see the building fenced off and the signs removed. Guess it's closed for good. Too bad, the cheese curds were yummy and the custard was delish!","useful":2,"funny":0,"cool":0},
{"review_id":"CTdHIEp6vGBqfZ2V7psYAA","user_id":"Lz4Q-UVIqLfPSrVJDpcrUA","business_id":"yLKoESPQ8BN7dn6ADzZicQ","stars":2,"date":"2013-11-03","text":"like a previous post, i was told i couldn't have curry vegetables, because it would take too long.\n\ni was wanting something vegan, without onions.  so, what i ended up with, was...  a little bowl of chickpeas in a really, really salty sauce.  for which i paid about $10.00.\n\nthe food aside...  the restaurant is very pretty.","useful":3,"funny":2,"cool":1},
{"review_id":"-m9A9GpdNyTXzWPJYh-7EQ","user_id":"K4RN3EihkPLxdAa6kIjT2Q","business_id":"b1UvPlDmVtN0ATBVfe6wBw","stars":5,"date":"2017-01-04","text":"Ed is a great inspector. We hired him in Dec 2016 to check a home we are purchasing. He performed a very through inspection, really took his time and wrote a great inspection report including lots of helpful details on necessary repairs and maintenance.","useful":0,"funny":0,"cool":0},
{"review_id":"5ohkn8dqntKTj9FUkFhYwQ","user_id":"u3iiawOeBnwU402RWewEgQ","business_id":"fUEHk00pkkuXaGdHQa2eKg","stars":1,"date":"2015-04-10","text":"This is by far the most unprofessional dealership i have ever done business with dont waste your time ever walking in the doors of bmw north scottdale their customer service sucks and there uper management sucks the GM calls me 14 days after singing paper work and tells me if i dont bring back my new car after putting almost 50k down on it a brand new white bmw m4 that he was going to report it as stolen i told him i was in utah 10 hours away he said well you better start driving and have that car to us in the morning no later then 8am the next morning.even knowing my deal was alredy funded to there dealership the gm still called me at late hours harassing me over 3,000 owed out of 50k this is by far the most unprofessional experience i have ever had in my life if your thinking about buying a bmw look away go anywhere but here they scam you out anything they can they still up to this day have not even paid off my trade in and i am turning them into the bbb and the MVD of Arizona this place has lost all of my business i would not even trust them to service my car ever there service center messes with your car i had my 1200 mile first service within a week of taking it to utah the car broke down and i needed to have it towed after having it towed to a utah bmw dealership they let me know parts on the drive train was loosened and i do believe bmw north Scottsdale service had everything to do with this a new car of its value should not be braking down within the first two weeks of owning it dont trust these guys at all they are out for your money and they take it to the extreme with you and will fight tooth and nail to take advantage of you anyway they can.","useful":12,"funny":1,"cool":4},
{"review_id":"_y2FuQQqRsFWQwJZYuq2Tw","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"QTSCFDPcuROE8UCvGS8Fiw","stars":4,"date":"2013-10-04","text":"Good food for the price. Better than many other sushi places on Queen St. so it's my go-to in the area.","useful":0,"funny":0,"cool":0},
{"review_id":"WBn9OSnMPdc7ifGZYezmBA","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"_WOqh3hBx3qqzE-Jf-bLKA","stars":5,"date":"2011-10-31","text":"I went to a Hatha Flow class on the weekend and it was one of the best classes I have been to in the city.  It's a beautiful studio and quite spacious.  The class was small which was nice because the instructor gave more individual attention than I have experienced at other studios.  The instructor was great.  I will definitely be back.","useful":0,"funny":0,"cool":1},
{"review_id":"4rjmgB7yXZqGL2ihXcfNqw","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"5Y9GXBFTEA6ahtxj7kRyXg","stars":4,"date":"2013-04-29","text":"I have been a member of Fit Factory for close to 2 years.\n\nPros: you will not get a work out like this anywhere else. If you have an aggressive fitness goal or want to push yourself this is the place for you.  I thought I was in decent shape when I started classes at Fit Factory and quickly realized that was not the case.  In the first 6 months I lost close to 10 lbs only coming 2-3 times per week.  I like that the classes are always different (never boring) and some classes are in the park near the studio which is a lot of fun.  \n\nCons: The studio is great, but the evening classes are often quite crowded and hot. I prefer being outside in the nicer weather so there's more space.","useful":0,"funny":0,"cool":0},
{"review_id":"5RyWHFQe2JeeXNEj4EVm8A","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"_nUQ_iT_JEdkMN7c-wqkBQ","stars":5,"date":"2011-11-21","text":"I've had sushi all over the city and this is my favourite place.  The quality and portions are great.  I recommend the spicy salmon and california rolls.","useful":1,"funny":0,"cool":0},
{"review_id":"su530W_v8pkkyiVCm2m_Lg","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"YnLyyo9QzqpDEDYPRJFUwQ","stars":1,"date":"2013-10-01","text":"I had actually read the reviews before I went so my expectations were super low but they still managed to disappoint.\n\nI waited so long for someone to take my drink order that I ended up ordering at the bar. The food was dropped off so quickly that we didn't have a chance to ask for cutlery (and no one noticed we didn't have any). We ended up taking it from another table. When the mains came, they didn't clear the appetizer plates. Then when the desserts came, they didn't remove ANY of the dinner or appetizer plates. Seriously? We also didn't get cutlery for dessert and had to once again pillage another table.  And don't even bother trying to get a glass of water... \n\nBottom line: mediocre food, terrible service.","useful":3,"funny":1,"cool":0},
{"review_id":"nMK_yV5Yd_WMq33-98uFdQ","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"58m8i72mRDxB9ntHZPA0_A","stars":4,"date":"2011-11-21","text":"Dr. Skotniki is extremely knowledgeable in her field.  It's difficult to get an appointment because her services are in demand.  I agree that it can be frustrating to book an appointment but it's worth the wait as she is one of the best dermatologists in the city.","useful":2,"funny":0,"cool":1},
{"review_id":"WhGqwFHJIHz_jpPZT_f40w","user_id":"m_-mPO2mwZcwig8WRWfFVw","business_id":"Qmwfg-PtYuCo5Q_IwcA_HQ","stars":5,"date":"2013-04-29","text":"My boyfriend took me for dinner at JaBistro for our anniversary and it was a fantastic experience.  The staff are very friendly and attentive.  In fact, it was the best service I've received in ages. The blowtorch sushi was delicious and really different.  We tried quite a few things from the menu and loved everything.  I would definitely go back.","useful":1,"funny":0,"cool":1},
{"review_id":"tcGBk4GnMYtvr8R9snMlXw","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"28yQhgAweo2-Xp_g08Hmdw","stars":1,"date":"2015-12-02","text":"Had an appointment for routine blood work. They refused to see me because Dr West did not put in an order. They expected me to come back in two weeks. After wasting my time. I will find a real health care provider.","useful":7,"funny":0,"cool":0},
{"review_id":"Z6umikfDfOm9SLHuZtE3Cg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"72isavZBcUCVRd9cu3GLwg","stars":1,"date":"2010-07-25","text":"I called Scott and left message that I was interested in lawn service. He never called me back.","useful":0,"funny":4,"cool":0},
{"review_id":"OOPOeEvKax2iKjwML6yEHg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"3MGitTkbdBHDq6YVGF0lww","stars":1,"date":"2013-05-22","text":"I had high hopes to work with Troy. He called right away after I called to set up an appointment. He came by to look at my job and said it was pretty straightforward He then said he would get back with me on a quote. After a week and multiple text messages asking for a quote he never got back to me.","useful":9,"funny":0,"cool":1},
{"review_id":"KZkyYYvTPwWlnLdJ2Py2Jg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"0s11XYD62p8g_hAyivQ2Iw","stars":5,"date":"2014-10-06","text":"I was very pleased with A-Z service and responsiveness.  I called for a routine service and was scheduled right away on the day I requested.  They acutally came a little earlier than scheduled but called before they came.  Able the service man was very polite and got the job done quickly.  I felt I was charged a resonable and fair amount.  I highly reccomend A-Z Septic Service.","useful":3,"funny":0,"cool":0},
{"review_id":"SdDSlPYcj-5DhIF1iTl9Dg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"MYTYGPh4Bciamb98tn8o_g","stars":5,"date":"2012-05-04","text":"Came when promised.  But charged quite a bit.  I would get other quotes.\nUpdate: I called because the toilet was filling slow.  I thought it was the input valve to the toilet. SavOn replaced it but it turns out the problem is in the tank. Now I have to get this fixed. They should have checked the entire system. I paid too much and I still have my original problem.\nUpdate #2:  Tom called me and resolved my issues.  I appreciate a company that wants its customers satisfied. Because of this I am changing my rating from a 3 to a 5","useful":4,"funny":3,"cool":0},
{"review_id":"3Yuuki53r5Pa3KSkFZjnsw","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"05QyQiesTeumSdJWZw3q8w","stars":5,"date":"2016-01-14","text":"We were very pleased with our experience with Robert of Arizona's Best Windows.  Robert responded to all phone and email requests and did a great job installing six windows in our home.  His prices were very competitive and we are very pleased with his responsiveness and installation.","useful":2,"funny":0,"cool":0},
{"review_id":"I2w1YOJuCGEZs8GSSSaMbg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"oVFRqhwQQ3zD3geTtRYZTA","stars":5,"date":"2010-01-23","text":"Bryan did a great job installing an Ethernet cable in my home.  He returned all emails and phone calls promptly and arrived when he promised.  He cleaned up after himself , was very courteous, and gave me a great price.  I am going to have Bryan do some more work in the next few weeks.","useful":1,"funny":2,"cool":0},
{"review_id":"IG72Rt1zjprBlpL5O0pOAg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"JbHVdvF0E3n7e8jUrOO6uQ","stars":2,"date":"2012-07-28","text":"David came to my house to give an estimate.  He said he would send me quote  but never got back to me.  I sent him a message but did not hear back.  Not reliable in my opinion.","useful":10,"funny":11,"cool":2},
{"review_id":"oNY59hGx6F-QBt2dKDHiAg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"QZV9hW3WP9o9SmmV29JVQw","stars":1,"date":"2010-02-13","text":"I was very disappointed.  My wife I tried Fuzzy's based on the reviews and both of us found this pizza to be below par.  Nothing like good Chicago pizza.  We ordered a sausage and mushroom 16\" and I think we got 12 mushrooms and 8 pieces of sausage.  The pizza had lots of cheese but very little flavor.  We won't be back.","useful":0,"funny":3,"cool":0},
{"review_id":"ycbLmTVgumjPmUC782T8IQ","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"f9ERQpAPOAMv5Ay0kyD3Yw","stars":5,"date":"2010-01-23","text":"Great Food.  General Tso's and Egg Foo Yong is the best.  I have not had anything I didn't like yet.  We go to this restaurant at least once a month and are never disappointed.  If you like good Asian food try this place.","useful":0,"funny":2,"cool":0},
{"review_id":"O6DN-67CyjTDbOFE38nOWg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"9T2fYTnKClbBKCDaJypGxw","stars":1,"date":"2016-10-24","text":"I agree with all the 1 and 2 star reviews. This particular location just does not care about customers. I have had more than one bad experience and will not be back to this location.","useful":2,"funny":0,"cool":0},
{"review_id":"G54ebeMen21viUL497zKKg","user_id":"hqe-6SkqNnPHB6OltBJvIw","business_id":"IAqQ_SnNO6C3PWmJ0JAD8g","stars":1,"date":"2015-03-17","text":"I was very unhappy about the amount the charged to see my dog when I took her in recently. They looked at my dog could not clearly identify what was wrong with her gave her a shot and some pills and charged over $300. That was us even having their overpriced Paws plan ($750). The said they took blood and stool sample tests but I still have not heard back from them (5 days). In talking with other pet owners the said they have only been charged half as much. It is time we find a new vet. This place was reasonable in the past but not anymore.","useful":1,"funny":2,"cool":0},
{"review_id":"OGQGXyqngsN6Ynv2bLYx4g","user_id":"APMEQ2XG2-JikONatg1wnw","business_id":"rANNcpPvv9EezHF-6kYCMg","stars":5,"date":"2015-07-21","text":"This place was amazing! The decor, food, and cocktails truly encompass the tapas vibe! The patio is the perfect place to enjoy a cold festive drink, on a hot summer night!  We can't wait to come back!","useful":0,"funny":0,"cool":0},
{"review_id":"qSRmIPOTCKcYpYIUmsZIOA","user_id":"APMEQ2XG2-JikONatg1wnw","business_id":"ibWJKyFwzm3K2UHSlc8EGA","stars":1,"date":"2015-02-27","text":"Ok let me prefect the fact that I never write reviews on yelp.  I also am the most sympathetic individual to restaurants due to the amount of time I spent working for wonderful establishments throughout my service career.  \n\nMy colleague and I walk into LaPaz, and there is probably 5 people in the restaurant, but it takes 5 minutes to even see a worker (who quickly looks away as she doesn't want to have to deal with us), and then another 2 minutes to be greeted.   We seat and a few minutes later, and are greeted by our server. We try and order guacamole (avocado, pico, and onion) only to be told the food preparer came in late and that would not be available.  When To  we tried to order... Tamales too would not be available.  The only two things I ever get here would not be available. \n\nMy colleague went to the men's bathroom and there were no towels, typically one could deal with a lack of towels, given the high end hand dryer.... This didn't work either.  Icing on the cake.  \n\nI hate when reviewers go on rants, and I just can't relate. So take this with a grain of salt.  My colleague and myself live for a good restaurant, and we used to love this place.  It used to be amazing, even after they moved from south blvd.  At this point I am exceedingly disappointed, probably will not be back.  The only difference between LaPaz and Taco Bell is warm tequila at best.","useful":0,"funny":0,"cool":0},
{"review_id":"3dALkEhovNiVqtc0y6pPZw","user_id":"0iilBriJid3EvqgNiH84SQ","business_id":"8VQbablhtEXNPfOFJVROGA","stars":1,"date":"2016-01-19","text":"I have purchased 2 cars from Camelback VW and had good experiences. George sold me the second car and was very pleasant to work with.\n\nA week ago, I was in again and looking at trading in my TDI that I purchased from them. They offered me $4500 for a car that I purchased from them a year ago for $15k. When I expressed how I was displeased with it because the VW TDI scandal is the reason the car's value plummeted, they came back saying they could give me $9500 since I've purchased from them twice and they want to maintain that relationship. Today, I was told they could give me $4k and that the manager who told me $9500 a week ago either quit or was fired (conveniently). After some back and forth, they said $5k is the best they can do and They'd get me out the door at $39k in a vehicle on their site for $24,500. So not only do they NOT value the relationships with customers, they have proven that they do not stand behind their vehicles and definitely do not anticipate the VW \"fix\" to restore value to their vehicles. \n\nThat said, George was still pleasant to work with and kept trying to get his managers to step up and be an honorable business. I highly discourage people from purchasing a vehicle here, but if you do, buy a used car and get it from George.","useful":3,"funny":0,"cool":0},
{"review_id":"1ceLLL4aUP8bKDkH3UtiEA","user_id":"0iilBriJid3EvqgNiH84SQ","business_id":"IabRbItRXwr6T0c5HHIaPA","stars":1,"date":"2014-03-21","text":"They had a car listed on their website with a market retail price of $21,000 and a Mark Kia discount of $4,105, bringing the internet price down to $16,895. \n\nI went in and first impression was I couldn't get over the classiness of the place. No exaggeration, within 5 minutes of meeting the salesman, he told me he's on a diet because he is in his 50's and his girlfriend is in her 30's and he gets winded f***ing her. We get in the car to take it for a drive and he starts making comments about a woman walking down the street and tells me if she's still there when we come back, I need to go back in tomorrow because he's going to go pick her up. Then as we drive past Dream Palace, he starts talking about wanting us to stop and go in. He also told me his theory is why hang out with a 5 when you can buy a 10? We get back and sit down at the computer and he had to get a manager to enter something on the computer. While the manager was sitting at the desk, the salesman proceeds to tell the manager about this woman we saw. I can't remember the word he used to describe her. The manager seemed a bit freaked out while looking over his shoulder at the young woman sitting nearby with another salesman and shushed the salesman. This salesman also had a plaque at his desk for salesperson of the year for last year.\n\nGetting back to the specific car, they got the info for my trade (I didn't have it with me, I wanted to check out their car first because of that great price and the fact that it's been there for a while and the carfax is clean). They work the numbers and come back out with the paper showing that the car WAS $19,986 NOW! $16,895 + inspection ($1,197) + prep ($695) + wheels ($2,395) (bringing the car price up to $21,182... back up above what the the market price is and more expensive than I can get the same model BRAND new - 2 years newer and 15k miles fewer) + fees. \n\nThen is the info for my trade. KBB says my trade in value is $26k, and fair market value to buy it from them is $30k. Autotrader valued the trade at $24k (there are options on the vehicle that autotrader didn't give me the choice to add). I've been shopping around and have been offered between $26k and $29k for my trade and have had other dealerships offer to buy it outright from me for between $27k and $28k. Mark Kia offered me $21k. \n\nMark Kia... where they want to get you coming AND going.","useful":2,"funny":0,"cool":0},
{"review_id":"vEqbTepmHNj-OjTG5cAWmA","user_id":"OgX3H8ikAf8MoFz7v3oTQA","business_id":"xP1G-ub5UmdYclZUu3ZaOA","stars":1,"date":"2012-07-12","text":"Like Mike T.'s review 7\/4\/12, we live in another state and AMEX called us with a security alert about a $1.75 suspicious pending charge to our account. This suggests that an employee there is using their credit card system to fish for active AMEX numbers to try any use it for a spending spree before it gets shut down. We will call the company tomorrow and seek legal action if needed.","useful":3,"funny":0,"cool":0},
{"review_id":"YY3fg41wF6f5pKX3J3AmLA","user_id":"f4leP16tfSE_WkxhV834KQ","business_id":"CVKOPzBVOj3_apFUmZ9ZWw","stars":3,"date":"2017-10-06","text":"I got the fish & chips combo, upgraded to the dirty #2 (truffle, parmesan, chives chips). My husband and I were there on a Saturday night, so it was busy, seating was limited and people were hovering over others for seating\/tables. I finally found a table on the patio and the weather was perfect. Our food took a while, but it's understandable since it was a Saturday evening. The fish was amazing - very light, crisp, and delicious - 5 stars for the fish. The chips, not so much, my chips tasted like they were old and stale.  I just couldn't eat it, had about 3 fries, and ended up tossing the rest. Overall, overpriced for ok food.","useful":0,"funny":0,"cool":0},
{"review_id":"zrq7jlxdQ24n7vQmEav1Iw","user_id":"f4leP16tfSE_WkxhV834KQ","business_id":"xfWdUmrz2ha3rcigyITV0g","stars":4,"date":"2017-10-06","text":"We came here for a Sunday dinner, and as it was the week-end, a wait was expected.  The line actually moved fairly quickly, so it wasn't too bad. After being seated, our waitress came, and she was quite friendly.  It took about 30 minutes before we got our food - longer wait than we expected. It seemed there was a hold-up of some sort in the kitchen though because once the food started coming out, a lot of food was coming out. We had onion rings for appetizer, and it was delicious. The batter was light and crispy, and the sauces were very good.   My husband had the Hell's Kitchen Burger, medium rare, and he really enjoyed it.  I was a bit boring and got the ultimate cheeseburger, medium well (since I'm pregnant and shouldn't eat anything too rare). The waitress asked if I wanted any toppings for my burger, and among other things, I requested extra pickles on my burger. When the burgers came out, it was obvious to me that the waitress wrote down that I asked for \"extra\" pickles because my burger was loaded with pickles - a good sign that she listened, and the chefs made the food as ordered. While I wished I would have ordered my burger medium, it was still quite good. The cheese flavor was quite strong, but overall, a very good burger.  Perhaps it's because I'm pregnant, but the sweet pickles were delicious - I had to ask for an extra side of pickles and actually finished all of that too. The burger was quite large for me, and after eating half of the burger, I took the buns off the other half so I can finish my dinner without overstuffing myself.  Overall, great place.  If I'm in the area, I wouldn't mind coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"ZJesU62ksuc4-Pjxu0Ll8A","user_id":"f4leP16tfSE_WkxhV834KQ","business_id":"A6qvHu4tVEKzwjZjWSCeRQ","stars":1,"date":"2017-10-06","text":"We decided to go to this on our last night since a lot of the other shows we wanted to see were cancelled or sold out.  (It was the Monday after the shooting in Vegas, so Cirque du Soleil cancelled all of their shows for at least Monday). We decided on the Ultimate Variety Show on Monday afternoon and purchased our tickets via Groupon.  After purchasing, we called the reservation line to get our tickets, and were told what our seats would be.  However, upon ticket pick up, we were bumped back a few rows.  The man helping us indicated our tickets were for \"general seating\".  Yes, general seating can be rows F-O.  If I called reservation and was told my seats would be in row F, and when I come to pick up my seats, and was pushed back  to row O, what's the point of calling ahead for reservations?  No, we were not pushed back that far, but it was extremely irritating and felt like it was a cunning way of doing business.  By the way, the entire left hand section of the theater, where our original seats were supposed to be, was practically empty. \n\nThe entire process was a mess.  The 1st showing was at 7pm, and they were let out around 8:10-8:15pm.  They started seating the 8:30pm less than 10 minutes before, and when the show was supposed to start at 8:30pm, they were still trying to seat guests.  The show was late, surprise surprise, since people were still trying to find their seats, but once the lights were out and the show started, the ushers were still walking people to their seats with very bright cell phone flashlights - very distracting. \n\nOverall, only 2, maybe 3 of the acts were worth watching, and the rest were a waste of time. I don't think the show is worth any more than about $30\/pp.","useful":0,"funny":0,"cool":0},
{"review_id":"IPwuaa3p12FaXwgSV0WYPA","user_id":"f4leP16tfSE_WkxhV834KQ","business_id":"AaLvYFsLuyO1uGk0QLxN5A","stars":5,"date":"2017-10-06","text":"This place is a bit hidden, but it's in the same center as WahlBurger.  We missed it my first time trying to find it, but after doing better research, found it on our 2nd day in Vegas. We came on a Sunday afternoon for lunch, and there were only 2 people in front of me, but it took a while to get my food (hubby went to try something else as he wasn't in the mood for hotdogs).   It started out as one person taking orders, making food, etc, so it took a while for me to actually get my food.  Hubby came back to order food from here too after browsing around, but I told him to go elsewhere b\/c it was taking too long, and I'd already ordered. I got the dirty chilidog and dirty esquite (corn in a cup). The chili dog was amazing, and the bun was fantastic - crispy edges and perfectly buttered.  I had to save some for my husband to try since it was too good not to share.  The corn, absolutely delicious..... I can't wait to go back on future visits.","useful":0,"funny":0,"cool":0},
{"review_id":"aq9y5dag6vxdznkDWC4IBg","user_id":"HBMauDqModXJ9ciY1FXV1g","business_id":"S9TEg6rGYDYiJlBuVlkC8Q","stars":1,"date":"2017-02-20","text":"Keep away from this place, seriously! Before I visited this place I thought the bad club can only be boring or expensive, but this one is beyond this that people there tried to threaten me! \nWhen I walked in, the bouncer charged me $5 for entry which seems fair but before long I found that this small club doesn't have customers or strippers! There was only one guy sitting in the corner except me! And there was only one black girl with glasses dancing on the stage, I don't remember her looking but she's certainly not my type.\nSo I turned to the gambling machines, but the girl in the bar urged me to buy a drink when I said I don't want to drink, she told me directly that I have to or the fat bouncer will come to ask me! The other stripper (there were only two strippers) called me to drink too but obviously, she didn't want to talk to me. When I told them I don't have enough cash they didn't bother to conceal disappointments on their face. \nThis lady was not so beautiful and a little over mature, she urged me to have a private dance but refused to tell me about details. It's $20 for a song but when I decided to do it, she asked me to pay $10 room fee to the bouncer, WTF, so the total was $30, exact the amount I told them what I have. In fact, there were no songs, she played with the music in the background and stopped whenever she likes. It says full-contact on their door but I'm sure you can do nothing beyond shaking hand cause I asked about the price about it. \nThe most ridiculous thing about this club was that the strippers don't take off pants! The black girl was with Bikini all the time and the woman with me only took off her upper, and she told me if I stay longer I will get more, how can I believe it! She tried to persuade me to get more cash from ATM but when I told she the machine doesn't work, she turned away immediately without responding to my goodbye, terribly rude! \nEven when I left after staying less than 30 mins, the bouncer called me back and took my beer back, which was only half drank, cause it's not allowed to drink outside the club, WTF!","useful":2,"funny":2,"cool":0},
{"review_id":"KkKNBmzfomw7Kn7RO10pLA","user_id":"Uh5HP9f4mVmZgnC6fnHC0Q","business_id":"kvlk_JCr8IhgZDzASIjEug","stars":2,"date":"2017-06-19","text":"I am a black card member which means you can visit other locations with your membership. I travel fairly often so I take advantage of this upgrade. My home gym is the Rocky River location. Of all the locations I have visited this is the worst. The water fountain is broken - and had been for MONTHS. How can you have a gym without a fountain? There is HALF of the fountain that sort of works but it's the super short one and it doesn't have any water pressure. I finally told an employee and she said the owners have been aware of this....but what? They don't care? Why wouldn't the owners fix this valuable part of a gym Immediately?  Also the machines are much older than the other locations and the ear bud jacks to listen to the tv are always broken. Also, there is no full length mirror in the locker rooms. So if you are showering and getting ready to go to work or anywhere you can't see your whole body.  I will say that it is usually kept clean. But all Planet Fitness locations I've been to are clean. I'm really NEVER a complainer but c'mon guys....at least give us some water!!! Is that even legal?","useful":1,"funny":0,"cool":0},
{"review_id":"wsspyyFFfiSRPelqMLzmNA","user_id":"Uh5HP9f4mVmZgnC6fnHC0Q","business_id":"8RHnmBwWd0Cicq_ttN6LQg","stars":5,"date":"2014-11-08","text":"I went to Erie Island Coffee in Rocky River Tuesday morning and was so surprised by the wonderful service and environment. I wasn't sure exactly what I wanted and the barista Tony was the most helpful I've ever encountered!  I will be back for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"lEDDljhnc4SX6oQ5CF8anA","user_id":"Uh5HP9f4mVmZgnC6fnHC0Q","business_id":"qjTPOOiUMZEhOBshHAXpQg","stars":5,"date":"2016-01-28","text":"I love this place! Just popped in not knowing anything about it and was really happy I found it! Sat at the bar for a tasty glass of wine and was so pleased to have a wonderful bartender, Heather, who actually had a personality! A great personality! Heather went above and beyond to tell me all about the place, the menu, and helped me get a great seat at the cozy fireplace. I know this will be my new favorite place because I felt right at home from the minute I walked in the door, thanks to Heather! By the way...I was a single female walking in here and usually don't get treated so nicely as a single female. I will be back often! Highly recommended!","useful":1,"funny":0,"cool":0},
{"review_id":"xcfm6Tum22mrjDkGJCX_ww","user_id":"Uh5HP9f4mVmZgnC6fnHC0Q","business_id":"MgScNgEPoNExpCOwcgQR3g","stars":1,"date":"2012-11-10","text":"Bad experience at Rocky River Longhorn.  Ordered a salmon salad to go and was told it would be 20 minutes.  I thought that was a bit long for a salad, but decided to do it.  I got there 20 minutes later, waited in a long line at the hostess stand, to be told to go to the bar area.  I went to the bar...no one was there to help.  After about 10 minutes someone asked what I needed.  I told them about my salad that I had ordered now 30 minutes ago.  They went to check on it..I then had to wait another 20 minutes to get it!  When I got it home, the salmon was tough on the edges like it was either freezer-burned or cooked too long.  I just hope I don't get sick from it!  This location needs better quality control and time management!","useful":0,"funny":1,"cool":0},
{"review_id":"1_qRxVwWIUdY2IIQrPM3Qw","user_id":"Uh5HP9f4mVmZgnC6fnHC0Q","business_id":"2tfMXjOotr1r168mVttUmQ","stars":5,"date":"2015-02-18","text":"Fantastic food - fresh as it gets.  The burger was right off the farm! Very cool, hip atmosphere...comfortable and will be one of my staples.  The wine is by the bottle, but they cork it to take with you. - And they deliver!  So if you can't get to them, they will get to you!!!  This is one of those places that makes Cleveland cool!","useful":1,"funny":0,"cool":0},
{"review_id":"tNGbknnwD8ROH1eJEF0F0A","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"_F4qxboOpRaOOMWsmXU8QA","stars":3,"date":"2017-10-31","text":"This place reminds me of some of the locations in Miami called Pollo Tropical however if food was very refreshing cooked well and tasted great the only reason I gave it three stars is because the service was ferocious my wife's order was wrong twice I had to argue with cashier because they charged me for one meal and gave her a different one my only reason for the review is to let the owner know got to get the service together man and you'll have it all made","useful":0,"funny":0,"cool":0},
{"review_id":"OVS-kphU8A1j_dVVF5uMcA","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"U_sZ5xC0GT78krjPyYLOPw","stars":4,"date":"2017-11-09","text":"The food at this place has always been an excellent service was good at one time however the only suggestion I can make to the owner is whoever is taking the order needs to do a better job of explaining what comes with the meal and what they put on it","useful":0,"funny":0,"cool":0},
{"review_id":"bVF-66mQQ_ZpcL8JCGCc6w","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"--cZ6Hhc9F7VkKXxHMVZSQ","stars":5,"date":"2017-09-08","text":"Awesome, as always. Bright me back to miami. Stay constant. I went for lunch today with my wife and the place was packed and very much shorthanded however they performed beautifully and keeping up with all of their clients. The only thing I can say is if you're from South Florida and enjoy flying there is is very different than what you're used to but they still have great food","useful":0,"funny":0,"cool":0},
{"review_id":"yZKxQyzEKZdJvU38fkzFPQ","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"G75gMavLP3CtShvZZBpb_Q","stars":1,"date":"2017-08-30","text":"Waitress was polite and very patient considering that I was very aggravated however this does not improve the quality of the food. I have grown up in Miami and have tasted Caribbean food and I must say that they have missed the mark because the food here was horrible and you should have void it at all cost because they have truly earned the 85% rating from the health department. I tried to give everybody the benefit of the doubt but this place should not be in business","useful":2,"funny":2,"cool":1},
{"review_id":"HVxLxa9_425Psb5g7_5IPQ","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"zQfmGir-zgurgmZYjYnxJA","stars":5,"date":"2017-08-22","text":"One of the very best in Gaston County and the surrounding areas prices are always very competitive service is always with a smile and even if it's something they don't fix they'll send you in the right direction","useful":0,"funny":0,"cool":0},
{"review_id":"1iKshWpYoeNShkjbA1Zn0w","user_id":"cba8cVlvGUsOG66XfN2n7A","business_id":"B0ovKDmWnVMs_LFgzPwfpg","stars":5,"date":"2017-08-22","text":"I must say that for a fast food location in Gastonia this place stands out as one of the best in my opinion. My food is always hot service is always fast and my drive-thru caretaker is always friendly","useful":0,"funny":0,"cool":0},
{"review_id":"xQxe5NX0oBBuhCKbtZ5IRw","user_id":"7lcUL-esG9LhlryH8m8waA","business_id":"0-fJRl595ZfHFyLQ3cROUg","stars":4,"date":"2017-07-12","text":"I chose this place as others on Yelp said it was a good place to get breakfast.  As a bonus, it was really close to the Ontario Science Museum, where we wanted to go that day.  What a great place to start the day with some good breakfast.  I think our family ordered a bunch of stuff like pancake, poutine, eggs, sausage and bacon etc.  The usual stuff and it all came out the way it should.  Everything tasted fine and that's what you want sometimes.. just your normal run of the mill breakfast.  Nothing crazy or all crazy stuff that some people try to hard to make it \"special\".  They do have their specials if you want too.  The people there are really nice and friendly.  We were traveling and they made us feel welcomed in their restaurant.  Good luck to our waitress, I think her name was Sandy.  It was her first day and we think she did a great job!","useful":0,"funny":0,"cool":0},
{"review_id":"0fQYHn7CmYKXGon6xH_8Bg","user_id":"yoi1hDMnlk_3unPwS0Rg_A","business_id":"F0iEafKvm4t9PC-EDQO4AA","stars":5,"date":"2018-01-03","text":"Stephen Nwogbe and his associates at The Nwogbe Law Group have been extremely helpful to my wife and I. We are going through a small legal issue with a Photographer\/Videoagrapher MikeNIke Mike Griffin. Stephen has been able to help us with all of issue with retrieving the items we have paid in full for. He is knowledgeable about how to handle things amicably but he also can move forward with any suit you are wanting. When I was looking for an attorney I wanted someone that was willing to go that extra mile. Stephen surpassed my expectations. I highly recommend Stephen and his law firm.","useful":0,"funny":0,"cool":0},
{"review_id":"0J1_u2_Rkkzk3X-5ImTx_Q","user_id":"F90b1mb3QGu89pqzUudxAQ","business_id":"xFkUn2tIJY0vkcm1Hl5m_A","stars":2,"date":"2014-11-08","text":"Short and sweet. Burgers were alright, beer selection was good. Sweet potato tots were meh. Quite pricey for what it is. I'd take a Big Smoke or Burgers Priest over this any day. Glad to have tried it once.","useful":2,"funny":1,"cool":0},
{"review_id":"ppPfpHQ6Qu0TRnchhXP6BQ","user_id":"ctLhUpafoeiG-JstH2lAhA","business_id":"eBS9X1hIFXZWrVncXDx7BA","stars":1,"date":"2017-05-28","text":"I will never return back to this place again. Horrible customer service and bad attitude. Walked in with the kids and was not greeted with a pleasant welcoming but instead a glaring moody look from one of the stylist standing by the register( made me want to hurry and run out the door which is what I should've done). Told the guy I think his name is John that I wanted to get my son a haircut he ask me if I have anyone in particular I said no. He turned to the blond lady standing next to him the one who looked moody and uninterested that we were there to cut his hair. She seems like she didn't want to do it and was not friendly at all, especially with the kids.  I then ask if she could cut my nephew's hair too, she said no and asked someone else to cut his hair. I asked the guy and he seem uninterested to cut my nephew hair too but at least he attempted to be friendly with him. I don't understand how people who work in a place like that could be so cold and unappreciative for any businesses that I seek, but I guess your establishment can afford to be picky. I asked my son how he like his haircut, he said it was fine but the lady was rough on him and that he was scared to go back. I told him he doesn't have to worry about being scared bc we will never go back there again.","useful":0,"funny":0,"cool":0},
{"review_id":"E9E83tqhoZXfbhSaxx8Fqw","user_id":"ctLhUpafoeiG-JstH2lAhA","business_id":"-hu5mnjIjnTWyCQIGDL_Iw","stars":5,"date":"2015-11-13","text":"Cheryl is great with customer service, thank you. A satisfied customer","useful":1,"funny":0,"cool":0},
{"review_id":"Wbr4_G6dilOjDc4TU8Eu8Q","user_id":"1anyv8ecofh42cieF9zocQ","business_id":"pKk7jCFIm96qDdk0laVT2w","stars":1,"date":"2015-09-12","text":"A bunch of friends get together. Expect to spend a couple thousand bucks on a meal. Couldn't have been a worst experience. So slow. We wanted drinks and took 30 minutes. Wanted appetizers and took an hour. Complained and the manager got involved and nothing changed. If you are going to spend a bunch of money, don't go here. Hugely disappointing. Haven't even gotten the main course and the poor services has me turned off. Hope they turn it around but I shouldn't feel like I got terrible service when I spent a bunch of money. Shouldn't that be #1?","useful":1,"funny":1,"cool":0},
{"review_id":"EgWbH1ZhRbwke3rTtE1mkQ","user_id":"0ZjgNZeEdzoHxPI27HnfJQ","business_id":"azIZRqX_1qbp0_6GKSgSAA","stars":5,"date":"2014-08-18","text":"There aren't enough stars to on Yelp to rate this establishment properly. How about 100 stars? I had a salmon and shrimp roll that was the most delicious and sweetest fish I've ever had. It's all I can think about right now! I can hardly wait to go back!","useful":0,"funny":0,"cool":0},
{"review_id":"cTvr1I-ullgit3rwNZ5PnA","user_id":"lcOdxDGTn9CYyVu7SzwXwA","business_id":"w12x7UBSSRsdbp3ZqguG3Q","stars":5,"date":"2017-03-05","text":"Went to the palm the other night and had great service!! Derrick and victor both did an Amazing job and there bar back David as well!! Outstanding service! Will be back again","useful":0,"funny":0,"cool":0},
{"review_id":"nn8584DAGGZ_GWlPnPJcuw","user_id":"UjO-KfNEI2ObSZDOCqQ-AQ","business_id":"jkLdoE_8yeXLyy7iBc5dGQ","stars":5,"date":"2011-02-16","text":"First of all, I'd like to say that the owners are wonderful people and it seems that everything they serve is handmade and from the heart! I ordered the chicken nachos as an appetizer. The chicken was cooked perfectly and the jalapeños were amazing! My entrée was the carne asada, which I have heard of but when I was brought a plate with a thin steak on it I was a little confused. Oscar (the owner) came over to the table and explained the best ways to eat it, and it was absolutely delicious! The pinto beans were whole and once again were absolutely cooked to perfection. He brought out 3 different salsas for us as well. One was the house salsa, which was the perfect blend of spice and sweet. The other was a much hotter salsa that definitely creeps up on you! It takes about 4 seconds before it tears you up! The third was a tomatillo salsa that was green. I'm not sure how to explain it but it was very good. For dessert I had the fried ice cream and it was awesome! The service was spectacular, as we were promptly seated and the food came very quickly! I would definitely recommend this place to anyone looking for great handmade Mexican food! Kudos to Cafe Posada!","useful":1,"funny":0,"cool":0},
{"review_id":"VErEYJfAIKtNCM46O5bkuQ","user_id":"UjO-KfNEI2ObSZDOCqQ-AQ","business_id":"xSplhd6mlpQzbjUAq3rP6w","stars":2,"date":"2014-05-03","text":"I'm apparently the only one who did not think was very good. General Tso's chicken let me down.","useful":0,"funny":0,"cool":0},
{"review_id":"Rg2QNIW71krY_h_nn0fYGQ","user_id":"UjO-KfNEI2ObSZDOCqQ-AQ","business_id":"PebX-Sf_h4FJGgsRAA5Fng","stars":5,"date":"2011-03-04","text":"I'm not sure if these people that rated this place poorly were just having a bad day or what, but I had a hot chicken parmigiana ciabatta and it was amazing! Everything is homemade and their slogan is \"Even the chef is imported\". which is very clever! My water was refilled even if it didn't really need to be and I was able to meet the chef and his wife! I had a very pleasant time! 6 bucks for a homemade lunch? Yes, please!! I will definitely be back often!","useful":0,"funny":0,"cool":0},
{"review_id":"pUfdBxZNZJEvaxUtKAjisA","user_id":"UjO-KfNEI2ObSZDOCqQ-AQ","business_id":"J5lgLvoKPzNqGCGPbznh-Q","stars":5,"date":"2011-04-04","text":"This place is incredible. Hands down most delicious  \"fast food\"\n Chinese restaurant in the East Valley. Wow! I ordered the 2 item combo and I got a heaping portion of Orange and General Tso's chicken, white rice, chow mien, and an egg roll for $5.95. I went here at 9:15pm on a Sunday also. I would recommend this place to anyone and am happy to say that I will be eating here much more often.","useful":7,"funny":1,"cool":2},
{"review_id":"DUQEWp7jjml3MsIElOJowA","user_id":"UjO-KfNEI2ObSZDOCqQ-AQ","business_id":"jPQxZTuFhuVHsu-DI4hm2A","stars":4,"date":"2011-02-16","text":"Great food! Great prices! Awesome environment. Looking out the window at Guadalupe Road almost makes you feel like you're at a diner in Tokyo.I'll be coming back for sure!","useful":2,"funny":3,"cool":1},
{"review_id":"DF2cEHbaHfE7kFh7_SSagw","user_id":"jstPDQ20nfuLlCJTAmV2WQ","business_id":"1uvcySLWM75MzlLM12F8dA","stars":5,"date":"2011-04-16","text":"The international Cheese shop in Pennsylvania Macaroni Co is incredible.   WOW! really different cheeses - REAL CHEESE!  Kraft cheese, this is NOT!  \n\nThe cheeses are aged naturally - not pushed. We purchased the Italian Gorgonzola Dulci and the Aged Crotonese Made in Calabria. The staff is generous with the samples too. They know you will buy once you taste it. \n\nThere is real pride in this stuff and the staff is eager to guide you to just the cracker that will fit the cheese.  An amazing place in the strip District.","useful":0,"funny":0,"cool":0},
{"review_id":"mwsLa2HrDNDdGGuEpyF52w","user_id":"jstPDQ20nfuLlCJTAmV2WQ","business_id":"zPxWTy_2WOslWtKCr8B1nQ","stars":1,"date":"2015-07-16","text":"I must agree -- just not ready for the real world!  Endless waiting on the support to answer the simple question \"Where is my Stuff\" from Amazon??","useful":3,"funny":1,"cool":1},
{"review_id":"a7_7kB4-tRZlg_PDlOnO2Q","user_id":"jstPDQ20nfuLlCJTAmV2WQ","business_id":"hsRjct8UiUHU54B983GmcA","stars":5,"date":"2011-04-16","text":"For a guy from California, Wholey's is like a trip to europe.  The Fish sandwiches are great -- we had the cod - deep fried -- WOW!! \n\nWe spent an hour in the store - packed with people.  One of our reunion   friends (natives of Pittsburgh)  told us the Strip District was a must see!!  They were right!  Lots of history there and Wholey's made the day.","useful":0,"funny":1,"cool":1},
{"review_id":"wQPcACswon0ChNileFUBhA","user_id":"jstPDQ20nfuLlCJTAmV2WQ","business_id":"XUDOc980cjB0PZvVS-T6Eg","stars":3,"date":"2011-04-16","text":"We were in Pittsburgh on a family reunion two weeks ago.  My wife and I wanted to try some of the local restaurants and stumble upon Jimmy Wans.  The restaurant looked interesting with a great decor.  The staff was very responsive and the service was good.\n\nUnfortunately, the food missed the mark.  For the starter, I had the wanton soup and my wife had the spring roll.  Tasteless, similar to Glenn C. opinion.  We had already ordered the entrees - kung pao chicken and  szechuan beef  -- They were large portions but again tasteless.  The Staff tried to help, but they were not the problem.  \n\nWe talked to other at the reunion later, and were total the Fox Chapel restaurant was new in the chain and that it had some growing pains.  Maybe it will get better after they \"season\"  the chef.    After eating int the Strip District, this just didn't cut it.","useful":3,"funny":0,"cool":0},
{"review_id":"ilRQ8rGXnF2pCIEzQOokJA","user_id":"DudP84k0N545LD0YPjPtKA","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":5,"date":"2017-08-29","text":"First trip to Vegas and we had to stop for a bite here. Food was awesome! Very tasty! The Bloody Mary looked and tasted fabulous! Portions were WAY too large to finish but overall we LOVED it! I didn't think the prices were any higher than some of the other places around here. Would definitely recommend! Especially the Motley Que sandwich! Yum!","useful":0,"funny":0,"cool":0},
{"review_id":"7OZ3W7ELKMGbnXB6_QASLg","user_id":"DudP84k0N545LD0YPjPtKA","business_id":"EneqsOFGCK4KXofNHsc5aQ","stars":1,"date":"2017-08-29","text":"We had to try this place after hearing all the HYPE about it. What a let down! The burger was so thin you could barely taste it and the fries were so bland and stale tasting. Would not recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"T4BpmTpOCho3oogm_cY9SA","user_id":"25UbgHZ88AWK9GHNSjPzVA","business_id":"uuGL8diLlHfeUeFuod3F-w","stars":5,"date":"2017-05-11","text":"This is a follow up review of Tom's Urban Las Vegas and my second five star rating.  Ate here last September and loved every bite. Decided to eat here again on our next trip in May and brought along another couple who had never been here before.  Made reservations online but were able to get in 45 minutes early.  We were nervous wondering if we would get the same high quality service and food we had the first time. We were not disappointed!  Server and Maggie was attentive, friendly and helpful with menu questions. The potstickers were as good as I remembered-soft, tasty little pockets of goodness with a yummy dipping sauce. I was so excited to eat them I forgot to take a picture so my only photo was of an empty plate. Our friends tried the nachos which they loved and we also tried the brussel sprouts, which were the best I've ever had in a restaurant.  Charred but not bitter, and the sauce was full of flavor but not too spicy or sweet.  We sat on the patio and enjoyed the shade and the stripside sights and sounds. We took advantage of the 4:00 happy hour prices so even the overall bill was better than expected. Tom's Urban is definitely on our \"go-to\" list when in Las Vegas.","useful":1,"funny":0,"cool":1},
{"review_id":"AJ1zzj2N_dzifdC7RwU5BA","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"aKsM_Dt1Rpg9zRGdHzTnIw","stars":4,"date":"2010-01-24","text":"For a first try I was very pleased.  \n\nThe bread dip was excellent.   Pesto, balsamic vinagrette and olive oil.  My wife had a salad with Butter lettuce, shredded chicken and avocado.   She said it was good but not awesome.\n\nI had the red snapper special that was served over scallions, pearl onions and vegetables.   It was excellent.   Nicely browned and cooked perfectly.    I saw they had brussel sprouts as the veg special so asked for those as a side.    They were also very good served with onions bacon bits and breadcrumbs.   \nGood service.  It is has a nice bistro feel to it with a comfortable looking bar.   A community table in the middle of it all with smaller tables around the other wall.    An 8 person table was in the back behind the wine room.    \n\nWe we went early on a Saturday and got in without a reservation.   But they turned some people  away after that.   \n\nA great addition to the East Valley where culinary blight is so common.","useful":1,"funny":1,"cool":1},
{"review_id":"9BrV2X4kCcxnrs6K9QH4eA","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"ZXC9HaHWeHnKKtbqX74Q_A","stars":4,"date":"2016-01-17","text":"Love this place for basic mex.   Burritos, Quesadillas and consistently good Horchata.  They also do very good Breakfast burritos","useful":0,"funny":0,"cool":0},
{"review_id":"5ZSyQLNnORoHFan6hs8NSQ","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"jIzygnVmajEXYmfsBNY_Gw","stars":5,"date":"2015-05-12","text":"A very fun Taqueria.  They know how to make a first timer feel welcome with their samples.  The wrestling to theme is cool\n\nGood option for Tacos or Burritos.","useful":0,"funny":0,"cool":0},
{"review_id":"S_eqKMZ20kyqi_EouyE_Ug","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"VcGyezSNtkNBr2HidcaM1A","stars":4,"date":"2012-08-07","text":"Great pizza   We have enjoyed this place for quite a few years.   Ingredients are above average.   Love the fresh garlic topping\n\nTough to beat for quality pizza on the East side","useful":1,"funny":0,"cool":0},
{"review_id":"iWeZ8pecOkXzoofi8KiWXA","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"emJungvsYbiex7iIBYeCdQ","stars":4,"date":"2013-05-12","text":"I have been very pleased with my eye appointments with both Dr Schecter and Dr Gieske.   Straight info and advise  The Opticians have always provided welcome assistance and I have always liked the frames they helped me select.  Their selection of frames seems to be expanding even more in their new location\n\nPrices are on par with other eyecare providers","useful":2,"funny":0,"cool":0},
{"review_id":"HCGYTnmYrMlm8Jl7nrlW0Q","user_id":"0UmAZ-ZGg3Iych1sllMaxw","business_id":"cJ1IUHt9prPgw1tzdPkpuQ","stars":5,"date":"2016-01-17","text":"I have used Mike for a number of repairs over the last four+ years and have had very good, honest service.   He is a good wrench and his prices are very reasonable.   If he does not have a part in stock he will order it for a good price or give you recommendations in the East Valley if you need it today.","useful":0,"funny":0,"cool":0},
{"review_id":"g_9NoUpzS3_9gLcSnk-KbA","user_id":"9KFzQN9awDWmGKyQ_eNRJg","business_id":"zpOqZ_Zbmc5_eUHN7DpL8g","stars":1,"date":"2016-05-11","text":"I'm a manager of a health care office,I dropped off my prescriptions and the girl that works in the pharmacy took down all my insurance information. Told me to comeback in an hour, when I came back not only did they not have my prescription ready, but I was told they don't expect my insurance, they should have told me that in the beginning! The manager of the pharmacy then tells me that she will call Walmart to transfer my prescription to them and I would be able to pick them up the next day. So the next day I go to walmart to pick up my prescriptions and the Walmart pharmacy tells me that is was never sent!!  I go back to walgreens to see what is going on and the pharmacist tells me that my medicine is not that important that I can buy them over the counter and she can not give back my prescriptions!! Do not go to this walgreens this place is incompetent and very un professional. My health company will not recommend this dump ever!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"eRVOzAQ_PjmqBsO4oBOvEg","user_id":"9KFzQN9awDWmGKyQ_eNRJg","business_id":"J0ufK7WAEq6oAdpDFz2xVA","stars":1,"date":"2017-01-19","text":"This place has the worst customer service, I spent over a 150.00 for dirty and smelly bathrooms, then the manager Deven has the worst customer service. He was mean rude it is sad that this cinema is in green valley casino, this kind if service is expected in the north side of town. Stay away from this place!!","useful":1,"funny":0,"cool":0},
{"review_id":"w-0Yubul7kXyZXSzv-SU8Q","user_id":"CdXGymemWxqH0p4X3o73WQ","business_id":"DDTLSLO32vAbT6ja1LP_8A","stars":5,"date":"2016-07-03","text":"Thursday 6\/30\/2016\n\nGetting highlights and great reception.\n\nFinally, after 4 months in Phoenix I find Giovanni. Picasso, Mozart and...Giovanni! A master artist. Loves what he does and it radiates. He performs his art well, he is a happy man and he has an energy that lifts. How wonderful to encounter such a person and how rarely I find them. I feel inspired and enriched. \n\nAnd my hair. How beautiful it looks. This is my second visit. Giovanni is an Aveda stylist of 30 years. He highlighted my hair without the nasty bleach. I feel like a beauty queen today.","useful":2,"funny":0,"cool":1},
{"review_id":"DyJR5mlCWGDdIScmM3Tjnw","user_id":"Z_eY1bJgi02ACwsA2waw9w","business_id":"9VHUX0dDUTZbKPCMSjdqNQ","stars":5,"date":"2017-11-11","text":"I am not a review person, but this place is a real treat and under appreciated \nVery solid wine, even a Sonoma Valley wine I used to be a member of when I lived in San Francisco.\nJust had the food for the first time and the Sooresseta, Artichoke flatbread was outstanding.\nI have been staying in hotels down the street while traveling and moving to the area.  \nNow as we move here I'll be sure to continue to stop by.","useful":0,"funny":0,"cool":0},
{"review_id":"f_KkdfF0q_V3Sfnxb1Q1mg","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"5bcpM0ss6j3AnsOOiOZiig","stars":1,"date":"2015-02-03","text":"I will never go back to this clinic again. I have been suffering from a migraine daily for the past 3 weeks. When I went to see one of the doctors today. He refused to give me ANYTHING to treat my migraine. His bedside manners are terrible, he is judgmental and needs to be brought up to date on medical practices. The main reason I made this appointment in the first place was because I'm starting to have suicidal thoughts to make the pain stop. And, this man refused to help me.\n\nAdditionally, my appointment was 15 minutes late. While he was seeing me during my appointment, he had the audacity to leave the room to take a personal call. This man is not professional at all.\n\nAfter 17 years of being a patient here, I will no longer be going to this clinic. Neither will my boyfriend or anyone else that I have referred in the past.\n\nI can find another doctor who actually respects their patients. As if I wasn't feeling like crap already. This doctor only made me feel worse!","useful":6,"funny":9,"cool":0},
{"review_id":"J3ELEsNYCdBaIBGVBUzk6g","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"6tqlfHNrrO9pNAOtLPJlHw","stars":5,"date":"2011-01-30","text":"This is my favorite Indian restaurant. The food is delicious, and the staff is friendly. Food is quick to leave the kitchen. Always a great experience.","useful":1,"funny":0,"cool":0},
{"review_id":"FZB4cgetIcBSiKfhJISkPg","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"j2ylpi_0ByksVQiq4GiTYA","stars":3,"date":"2013-01-25","text":"SLOW service. I had to wait over 10 minutes to make my purchase. A extra cashier was opened after I requested it.\n\nGreat selections of books though.","useful":0,"funny":0,"cool":0},
{"review_id":"r_VrztuUkEdEJqKirlSiFw","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"ZNI4aJrPrQ_ufcMJ9hm1aQ","stars":5,"date":"2013-04-15","text":"I love this massage retreat. It's in a great location, and they have great customer service. The massage therapists are excellent. Aaron and Brett are my favourite therapists. I go there regularly and am happy with my membership. \n\nThe aromatherapy there makes the experience even more relaxing. And the couple's massage is at a reasonable price.","useful":1,"funny":3,"cool":1},
{"review_id":"AI-bkwjvYPclDkZMD3YHWw","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"XGawwbf08MPsTQwq4abMEw","stars":5,"date":"2015-02-05","text":"I'm very impressed with this clinic. I went in as a walk-in because the doctor at the previous clinic that I was going to would not help me.\n\nThis clinic is large with numerous doctors and a pharmacy within. The waiting room has comfortable seats and hand sanitizers available at each table.\n\nThe front staff at this clinic are warm, friendly and very helpful. And the doctor that saw me was sympathetic and listened to me. She did an  thorough examination on me to determine if it's neurological. She then,  gave me medication for my migraine and asked me to come in again a week later for a follow-up.\n\nThis will be my new go-to clinic.","useful":2,"funny":0,"cool":0},
{"review_id":"SWz3NNXAODxUi7j0V_mOaQ","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"HAMLLfH-2ho37Y4zsa9bDw","stars":4,"date":"2011-01-30","text":"I love the Keg. The staff is friendly, and make you feel welcome. The food is always delicious, although they seem to never get my steak right. Still a fan though!","useful":0,"funny":0,"cool":0},
{"review_id":"7_eCQtMXQvPVE4xxMG3IDg","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"2vkRLq6yzvkKjzgjtUYIlw","stars":4,"date":"2012-04-19","text":"Great little store. The owners are very friendly and welcoming. I like that they have grooming available as well.","useful":0,"funny":0,"cool":0},
{"review_id":"UDEgkIxBGlYeWNg_A44ASg","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"hmcsl0vERvwvYUiWuNVKxg","stars":2,"date":"2011-01-30","text":"I wish I could say that my experience at this market was positive. I stopped by at the market this past December, and made an order with a sales clerk for some chicken livers and hearts. Not only was the clerk rude and short with me, but they also didn't phone me back as they promised they would. Not a good experience at all.","useful":0,"funny":0,"cool":0},
{"review_id":"TcRjGciV-T3firsJ7LYN1Q","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"Nx-Il-UuMNxSTWwnucVzxQ","stars":5,"date":"2016-09-30","text":"Absolutely great service. My go-to when I need my eyebrows waxed. They're great about taking walk-ins.","useful":1,"funny":0,"cool":0},
{"review_id":"MPfjuQ86Uxz72Vf5Rps2uA","user_id":"tgE4uQxMUriuhPEg2a6vyg","business_id":"eKZXXE_VLk5FFNrCjl15cQ","stars":3,"date":"2011-01-30","text":"I love eating here. Make sure you make reservations, because it can be really busy. But be aware that you often have to wait for long periods of time even if you do have reservations on a busy night. The food is worth the wait though! Great staff.","useful":0,"funny":0,"cool":0},
{"review_id":"u9SN8tmFn9220jC5VTnwbw","user_id":"pZeaDTHHD4sAHhAbkpjVOg","business_id":"IzQAW23PNGY0TlFU-5AVKQ","stars":5,"date":"2013-07-20","text":"New location and same great service with the same care and high level care for the customer! I love the masks that Kimberly has and all products!!! The new location is beautiful, very welcoming and serene!","useful":0,"funny":0,"cool":0},
{"review_id":"SJoTanY0s61LO-SZGqxc-A","user_id":"pZeaDTHHD4sAHhAbkpjVOg","business_id":"iR36j1b8owv2aZTi3mR0bg","stars":1,"date":"2012-10-29","text":"If you can stand bad service, no courtesy offered by the staff and expensive prices you may try this place. That is if you are lucky enough to arrive when they have the dough for the pizza!!! yes, yes !  You understood me right! \nToday at 5 PM with a Festival going downstairs in the Pedregal mall, this pizzeria, sorry, gourmet pizzeria, was without pizza dough!!! Why? Because the chef left without making enough!!! I am not sure who made the dough for the pizzas that I ordered, waited 2o min extrar and of course paid for! By the way, I paid $58 for 2 \"medium\" pizzas (more like small) and bread sticks, and the bread sticks (approx. $8) arrived with no red sauce!!!! All of this was for a carry out while the pizzeria was about 20% busy at the time!!\n\nWhen I asked for the managers I was told they left!!! \n\nSorry to say even the pizza is very good and the red sauce is outstanding when you can get it, I am not going there again and not sure how many people will be putting up with this type of service and prices...","useful":1,"funny":0,"cool":1},
{"review_id":"1tfL-CgyHeNOpfndfPZr1A","user_id":"pZeaDTHHD4sAHhAbkpjVOg","business_id":"ohMpNug5zWNxOlL6ShG7Ig","stars":2,"date":"2013-12-14","text":"It's been awhile since we been here. Very very disappointed ... Service bad, asked for salt and pepper and they brought it to another table! We asked for fries with the entrees and they came before ! But not only that the \"pommels frittes\"  were terrible, reheated fries! I would have expected the best ones around! I will have to drive to Zinc for that! The quiche another \"specialty\" wasn't cooked enough and it also looked microwaved! Oh I forgot the pumpkin soup, something that use to be so great that we use to reorder! - had no taste! We passed on deserts this time as we were afraid of yet another disappointment... I hope the owner would focus on the old places not only on the new city one!","useful":2,"funny":0,"cool":0},
{"review_id":"9Ds6OYkumuwW-jB-oev2jA","user_id":"zXKQsy-Ovnn6xWYSBtl_zQ","business_id":"fXNea6ST3FlFpA9qmSgHGQ","stars":1,"date":"2014-06-14","text":"Same commentary as Mauricio A. except taken last week. Sail was put up but the motor was active throughout the trip. Sails were put up for display and probably for the benefits given under the Rules of the Road (kind of sleazy to do that imo). Sea chanty was weak, seen much better in Newfoundland's bars, they should really see to getting some real sea folk aboard instead of the summer highschool\/college students that seemed to run the boat.\n\nNo sun shade as before, no real activities aside from pulling a rope to hoist the main sail (which was unused). Would be a much better trip, as Mauricio A. indicated, if they actually sailed. Seems unlikely they ever will though as the day was perfect - sunny, good wind, etc. so it would have been an ideal day to do it.\n\nTrip is mostly about the company. Correction, all about the company you keep. Mine was wonderful so I didn't really care how bad the sail actually was :)","useful":1,"funny":0,"cool":0},
{"review_id":"QShvv8lpllR9r7xcoSHFrw","user_id":"zXKQsy-Ovnn6xWYSBtl_zQ","business_id":"Rju2ynRaZPS-eY-cUKQxYg","stars":5,"date":"2014-02-01","text":"Although not the best pizza I've ever had, it is the best I've had in Canada in a long time. I ordered a couple of pizzas for delivery at 11pm (1 hour before closing), dealt with a very nice person on the other line, and received the pizzas within 20 minutes of ordering. The pizzas themselves had a decent sauce, ample amount of toppings, and a thick crust however it was grease-free which is something almost impossible to find north of the border. The grease-free aspect REALLY made this pizza great as you can then actually taste the toppings.","useful":0,"funny":0,"cool":0},
{"review_id":"CdTtR1gCZiff4Zqnys9s4g","user_id":"zXKQsy-Ovnn6xWYSBtl_zQ","business_id":"XZ1GgZfWRL87ieujN94q1g","stars":5,"date":"2013-08-22","text":"Came here last month for a schnitzel which by the way, was phenomenal, and saw the Bratwurst option on their old menu. Although not a menu item, the owner ordered in a dish worth for my next visit (today). I wish now that I were a more eloquent person for the words that would be needed to describe such a succulent dish are beyond my capabilities. The flavor in every element of the meal, from the potato salad to the sauerkraut to the sausages themselves are incredibly unique yet complementary in such a way as to make you wonder how you got by with other variants before.\n\nI would definitely come here again. If you get the opportunity, schedule the bratwurst a week in advance, it's worth the wait. The only shame is that normal sausages are going to seem so bland and pointless now.","useful":0,"funny":0,"cool":0},
{"review_id":"YUd63NlxdYlyHSo_Yyxdwg","user_id":"CsQj1-SnThDW-DZOSXFsEw","business_id":"2og7CivCoU54PKpvlvxOYw","stars":2,"date":"2016-11-16","text":"A large double cheese, sausage, mushroom, and pepperoni to go for $29. It was OK but definitely not worth the price tag. Definitely will not come back","useful":1,"funny":0,"cool":0},
{"review_id":"a21NTGeN6wLYaPaUD1XMiA","user_id":"j0cz81jfnXZHKvimxfzYMA","business_id":"xtktc6OTdtilAREgJH-P4g","stars":5,"date":"2015-10-05","text":"Went for a burger based on the Yelp! reviews. So glad we did. Burgers were cooked perfectly at medium and the bun was soft.  We had fries with one and upgraded to onion rings for the other ($3 extra) and well worth it. Both fries and onion rings were perfect. We built one burger to order and the other, mine, was the Québécois (wild mushrooms and bacon). Would come back again without hesitation.","useful":1,"funny":0,"cool":0},
{"review_id":"ZJIj2dHDpQ59bqUcT1TLkg","user_id":"-y-XiuRRqVu8bqKSOEjjlw","business_id":"bqIZx0ebqB0RcYox1KCwpw","stars":5,"date":"2014-02-21","text":"Ordered me my indash and rear view camera and called around for prices and 808 car audio evolution beat the price from other shops by 150$.. Courteney was very helpful and he also finished quickly. !!! I will go to him everytime i need something done to my car!! I also set up a appointment with him so he can do more things because i called around and he still was the cheapest price! TRY TO CALL AROUND AND SEE IF ANYONE CAN BEAT HIS PRICES!!!!!! THANKS COURTENEY!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"rxUObkuOvJ66sk7mfSp8Ww","user_id":"fr9sG_1QYvEp25UM45X-ZQ","business_id":"3xvrkmH9iy29CGYHU3SH-A","stars":5,"date":"2013-10-29","text":"I've had 2 facials with Margot and they were both fantastic!  She is wonderful and skilled and the products are fantastic.  I did not break out after either facial and my skin felt great!  I highly recommend her!","useful":1,"funny":0,"cool":0},
{"review_id":"nVTSifQar1pTESV-zmZdyw","user_id":"bsgGk0xsXJmRIecnUvf4vQ","business_id":"CV0knwCFA-x-8jJHot6Few","stars":5,"date":"2011-11-08","text":"Food was amazing! We saw a sign spinner on 19th ave and Greenway that said $1.99 gyro sandwich.... I looked to my right and I saw Good Fellas Grill in the Chino Bandito shopping mall. It was probably the best decision I had made all day, after a 7 hour work day I walked in was greeted, and ordered our two gyro sandwiches. We were given large servings of soup from the owner, my bf had chicken curry potato and I tried the lentil which were both amazing. We received our gyros which were on the best pita bread I've honestly ever had, the gyro was not greasy which I've had gyros that were total opposite, the onions and tomatoes were nice and fresh as well. The facilities were very clean, they had two big screens playing ESPN, which I love, and the bathrooms were nice and clean. The owner introduced himself as well which I find very respectable. I will be going back and I recommend you try Good Fellas Grill, you will be going back for more.","useful":3,"funny":1,"cool":3},
{"review_id":"e08POQjO_tjNdHG8u5tYbA","user_id":"FmGjEwS2TKLKaQ4lQH9cOQ","business_id":"Gc8R7b3I3CTwAiWv7MjtSg","stars":5,"date":"2016-11-10","text":"My experience was excellent. They expedited the repair and got to work right away. The output looked as if it were new.\nA+","useful":0,"funny":0,"cool":0},
{"review_id":"II-TYCd0yo_nmm9msQ9Stw","user_id":"8XgSddzzxdcTZVNHElp2MQ","business_id":"S7An_mscIgpmJi4nVWCxxg","stars":1,"date":"2015-08-12","text":"Carolyn Slack\n\nI was at Platinum Spray Tan on August 8, 2015.  I arrived on time and found the door locked, I continued to wait and wait until finally I see a car pull up and a lady gets out.  I told her I was just about to leave, she rolls her eyes and looks away, choosing not once to apologize that I have waited for her. She tells me to undress and that she will be back in a minute, standing there naked, she continues to go back and forth outside the door to bring items she has forgotten back into the room,very much unprepared for my visit.  Each time the door opens I am exposed to the waiting area where clients sit and wait for their turn. Before we get started she has me take off my diamond necklace and tells me to leave it on the chair,at the conclusion of her spraying my tan, I pay the assistant and get in my car and leave.  About 5 minutes later I realize my diamond necklace was left on the chair, I call and text continually until they respond.  Both the owner and the assistant say they never saw the necklace and it is nowhere to be found. I continue to call and text the next 2 days and ask if the necklace has shown up, they both say no, check your car, it's not here. One of the two woman have taken and kept my necklace - these are not the kind of people you EVER want to do business with.","useful":1,"funny":0,"cool":0},
{"review_id":"_07EusjB5aY7DSqb9rr8WA","user_id":"8XgSddzzxdcTZVNHElp2MQ","business_id":"fCx9d8ZtigoaqoY8B4yK0g","stars":5,"date":"2016-05-23","text":"I absolutely LOVE Dr. Predmore, she came as a referral from a dear friend.  I couldn't have been more pleased when I had my first visit with her.  She was kind, attentive and the results were fantastic, I could not have been more pleased. I have referred my daughter and a co-worker to her, they as well have been thrilled with the results.\nGo and see her I promise that you will be happy you did!!!!\n\nCarolyn MacDonald","useful":3,"funny":0,"cool":1},
{"review_id":"dIexsVcR1s-ougqPzRfpQQ","user_id":"Tqk3K_18TX03JyEZXvt4jg","business_id":"YK6XFE1SbLZGGXIKZmrQ-Q","stars":2,"date":"2012-02-10","text":"I ordered delivery from Campus Biryani, and it's been two hours and counting.  All I ordered was falafel and samosas.  I won't be ordering again.","useful":0,"funny":0,"cool":0},
{"review_id":"pLyyiySu6E64jOBxwazQaA","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"oNptGQ-jHp4NG1HzO8I4_A","stars":1,"date":"2013-02-12","text":"Our office group eats here often (against my wishes), and I am NOT a fan. They are extremely overpriced and the last time I ate here two of us came home with food poisoning. The staff is always very friendly, but I am not a fan of the food whatsoever.","useful":1,"funny":0,"cool":0},
{"review_id":"keupazE5N32Yby6tElCRJQ","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"9cOrfyag5ULqygrKq8pvjQ","stars":5,"date":"2013-04-09","text":"I had no complaints. They were prompt, friendly & did a great job on my hair. Reasonably priced. I will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"FJtsEIjDxOOLvglOF4-OSg","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"uxmL96QngoslrtMXaQ80nA","stars":4,"date":"2013-11-14","text":"We had the red curry and the spicy noodles, which were both great. The prices were also great at this place. We will definitely be back.","useful":1,"funny":0,"cool":1},
{"review_id":"wv1OBLUHSyGS3T0bnpRKIQ","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"6Pk9PJOD7EWd1tv3lk0ajA","stars":4,"date":"2014-07-05","text":"We stayed here in June, 2011 and loved it. It was clean, relatively quiet and the food was great. A really lovely place.","useful":0,"funny":0,"cool":0},
{"review_id":"lW5IJNDu_By9i_P9_qidUA","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"H-U7bDnKfssCDghHAkCb7A","stars":1,"date":"2013-08-24","text":"Didn't fix it right the first time, a no-show the second time, rude to me on the phone and when we told a \"leak specialist\" would be coming to fix what the first guy (Martin) didn't, guess who walked in the door? Yep, Martin. He then proceeded to speak snidely to me, which became ruder and ruder until he was full-blown yelling at me. When I started to yell back and ask him why he was so rude, yelling, would not let me finish sentences, etc., he walked away in the middle of my sentence saying, \"I don't have to deal with this!\" I kicked him out of my house.","useful":14,"funny":9,"cool":1},
{"review_id":"MJIfc8Gb0Sm8L_2s3A8wGQ","user_id":"XCGd-gkKqrLrgsvk92sIHw","business_id":"WQ1IKld2kUXOf0Md-p77WQ","stars":4,"date":"2013-04-05","text":"I've been here too many times to count. They are always clean (SO important), friendly, and never keep me waiting. They have done a good job & have never hurt me. I know that may seem like a strange thing to say, but I have been to a few salons, where they have. This place has hit the mark every time I've been there (*knock on wood!*), so I will stick with them.","useful":2,"funny":0,"cool":0},
{"review_id":"utnIQGvgMoNMEF9YU_8V3w","user_id":"goOiVVmOl9ptcx4JHkEpdA","business_id":"j2bx_ctb_ED3zbfSaqhQmQ","stars":2,"date":"2017-10-03","text":"Food was good. We had service issues. Server got a large group about the time that we were seated. After letting him know that we needed another minute to make wine and drink selections, we waited fifteen minutes before having to head to the hostess station and ask to place our drink order. After this, service seemed rushed and not terribly attentive. While the food was good, the experience was not.","useful":0,"funny":0,"cool":0},
{"review_id":"tdpt497coAKhlmsvt-TRSA","user_id":"nJpYu0k4WD-Z8j0OyXHcOA","business_id":"0N2y8rNxbet6p4UIBWTOrw","stars":2,"date":"2011-08-06","text":"I ate the \"Value Gyros Meal\" which consisted of a Gyros, fries and a fountain drink.. The fries were fresh and well done with no greasy taste.. the fountain drink was fine... but I came for the Gyros and what can I say.. the portion was ample but the meat was lacking in taste and a good gyro's got taste.. and as they say..\"the Chef is in the sauce\" and honestly the yogurt and cucumbers were barely discernible on the gyro.. Having lived in the area of Tarpon Springs, Florida for 25 years I ate a lot of good gyros and this was not one.. There are better ones in the Valley..","useful":0,"funny":0,"cool":0},
{"review_id":"gws_-YUy4gk59_h8BipeAQ","user_id":"nJpYu0k4WD-Z8j0OyXHcOA","business_id":"CR-gLUcudD0AQr7dzASgLA","stars":2,"date":"2013-10-06","text":"This restaurant has growing pains..  The restaurant was clean and colorful.  The kitchen sits in the middle of the restaurant and the aromas are everywhere.. I ordered spring rolls as an appetizer.  They appeared on the bill but not on the table.\nI like my dinner spicy.. \"Thai hot\".. My phad  thai came with no spices and I should have sent it back.. I've eaten in many Thai restaurants and don't hesitate to ask for the spice rack to give my dinner more kick.. Every spice rack has always included thai peppers in fish sauce but for some reason this was missing..  The scallions in the phad  thai were almost non-existent too.  My dining companion ordered curry that was overly sweet and scant on the meat.  I may go back but not really anytime soon..","useful":8,"funny":1,"cool":2},
{"review_id":"lr9RD7Z4LaGJV-q5I7Mhqw","user_id":"nJpYu0k4WD-Z8j0OyXHcOA","business_id":"45JwLE2ol0WozeHtzPToXg","stars":2,"date":"2015-07-09","text":"New owners...and a real disappointment. I used to eat here all the time.. I loved the authentic Greek salad.. tomatoes, cucumbers and real Greek dressing.. Now it's brown lettuce and vinaigrette. I paid extra for pita bread.. For that price I can eat twice at Wendy's and have a better salad and with chicken.. Chalk up one lost customer.  Oh.. and the on-line menu doesn't even come close to the new owner's menu..","useful":0,"funny":0,"cool":0},
{"review_id":"yEteZgWkGy9vA-4naeP0Fg","user_id":"-PE38sFK9Xa6ENcyg_jy3w","business_id":"M49WKXsPSyiDDbCuZk_vYQ","stars":5,"date":"2016-11-16","text":"Plumb is our home away from home!\nMy daughter has grown leaps and bounds in her 8!years attending Plumb. \nI would recommend Plumb to anyone looking for superior training and exposure to the best of the best in the dance world!!","useful":1,"funny":0,"cool":0},
{"review_id":"BhU6W8dKyx_d-vR0-RerZg","user_id":"sQu3SrMtPhTpp9HRFAcF2A","business_id":"DE6QVNI4iShtRfbCVuEOiA","stars":1,"date":"2015-09-29","text":"I've known this place since it opened in the original location about 10 years ago.  I've seen it go through two ownership changes as well, but I have to say that it is now so badly run that I don't even bother visiting.  The staff seem asleep on their feet and the owner\/manager can't seem to be bothered to make sure that  the place is stocked each day.  on more than one occasion, the staff have had to turn customers away or even shut down in order to replenish basic items.  On top of that, they can't make a half-decent espresso or keep track of orders, so there isn't much point in going unless you like the location.","useful":0,"funny":0,"cool":0},
{"review_id":"NdUXF00oyqyeczq1yTvExQ","user_id":"4fg7xDS_QIyCJ5v88BkfZg","business_id":"3jKUbhGSjFTv5jZ0wnW0xA","stars":5,"date":"2015-09-06","text":"On s'y arrête par hasard... Repas excellent, surtout crumble avec ajout de pop corn et glace vanille ! On a aussi pu rencontrer les deux proprios, très bon service, rien à redire, totalement à conseiller :)","useful":2,"funny":0,"cool":0},
{"review_id":"pa23cIhDntU7thcAmyAn8Q","user_id":"4fg7xDS_QIyCJ5v88BkfZg","business_id":"M6-HvE8lj4tJgiJ6xO8Vhw","stars":2,"date":"2015-09-06","text":"Nous sommes arrivées depuis l'aéroport à 1h10 du matin : plus personne à l'accueil donc dodo sur un parking mais première nuit payée, bon tampi pour nous. Puis pour le check in : ils nous avaient oublié, nous avons dormi dans la chambre du staff et deux membres du staff (un couple) ont dormi ensemble pour libérer un lit. La salle de bain est loin d'être propre, tout comme la cuisine, les ustensiles etc. Dans la nuit, deux personnes rentrent et commencent a copuler a cote, pas le top. Le point positif serait certain membres du staff, des volontaires, agréables. En trois semaines de road trip, c'est la moins bien que nous ayons faite.","useful":0,"funny":0,"cool":0},
{"review_id":"NRcicqk9pPOcyDgh_RJHiA","user_id":"4fg7xDS_QIyCJ5v88BkfZg","business_id":"bo4loBeLwkQqZ7HGrgxXRQ","stars":4,"date":"2015-04-19","text":"Très bon, tagliatelles au presto et chèvre pour moi, mes amis pizza carne et pâtes aux crevettes\/tomates cerises\/persil MAIS la quantité pour les pâtes compte tenu du prix est insuffisant, excepté pour la pizza ou c'est correct, nous restons sur notre faim, dommage :( service très bien également.","useful":0,"funny":0,"cool":0},
{"review_id":"SdkVbbxU-R6qbGnqIp5WBQ","user_id":"bL_nrd_p5SvpwAZv0MsJBg","business_id":"OnLY21kYfRrJrWcE8zuU_A","stars":2,"date":"2017-06-17","text":"Honestly I don't understand how this place is still open. Me and my husband went for brunch and the food was mediocre at best and the service was terrible. Let me start with the food, I ordered the breakfast poutine and it almost made me hate poutine. The fries were rock hard and the amount of gravy they gave would have sufficed for 1\/4 of the amount of poutine they gave. My husbands crepes were also quite soggy and they sat on the counter in the open for quite some time. Now the service it was terrible to be completely honest, but it was most certainly not the waitress' fault. She had so many other tables and I did not see her stop once the entire morning we were there. It was very clear that the morning was understaffed and the two girls working were over worked and even though the manager was clearly trying to help when he could. Honestly it seems like the restaurant hung these two poor girls out to dry as they were the only two on the floor. Honestly I'm just fully disappointed in the entire experience the restaurant has a cool feel but it didn't make up for the lack luster food and service.","useful":0,"funny":1,"cool":0},
{"review_id":"qrctLag2yDl5r5KVUly3qw","user_id":"7nS2SWJ7qq8DbezwOXN-pQ","business_id":"vpm8JRXdyrZZJS22m1FhfQ","stars":1,"date":"2017-06-23","text":"I went there today for a manicure, pedicure and waxed eyebrows.  Well the same thing happened to me as the other review.  I came out of there with a Black Eyelid. The response was by the owner, Mya, she must have hit a vessel.  I had to ask for ice.  Yes they did get me some.  As I was leaving Mya said tell everyone it is a birthmark.  I am leaving on a plane tonight for a weekend in NYC with my husband and friends.  Not exactly how I wanted to look for my mini vacation.  I even had to pay for it.  Better customer service probably would not have charged me for the horrible wax job!","useful":2,"funny":0,"cool":0},
{"review_id":"4Yhet3zk8PBryVgUlgEG9A","user_id":"j3ImF8pY11Ca33IUSIFOdw","business_id":"069TWjwxctY-3X_TitxJKQ","stars":5,"date":"2014-07-28","text":"I LOVE this place!!! Derrick and Anthony are the BEST EVER!!!!\nThe hookah is always amazing, lasts long, and never has a bad taste. Love the decor and just the customer service. Overall I'll be coming here regularly and inviting many of my friends. It's my favorite spot and it's becoming my friends favorite spot as well. There drinks are yummy and the food items are great as well.\nI will ALWAYS be a regular here from now on!!!","useful":1,"funny":0,"cool":0},
{"review_id":"v0Sg_sK-eGd-l81Iyz8gKg","user_id":"j3ImF8pY11Ca33IUSIFOdw","business_id":"hl6s4hGsJDcRhHIWrSM-UA","stars":5,"date":"2014-03-16","text":"This place is amazing. I loved the atmosphere and the service. The hookah was delicious and very flavorful. Most of all the GM Stephan was very accommodating and just awesome. He made sure everything was great and really made you feel as if you were welcome and comfortable. I will definitely be coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"62m8AWydz3cNk3Yg3et86A","user_id":"1WzprRhGqDbd3XcjJignTA","business_id":"leBz5w1fa1F_ChFcHorBwA","stars":4,"date":"2015-06-19","text":"This place is great for breakfast. The food always comes quick and the staff is always friendly.","useful":0,"funny":1,"cool":0},
{"review_id":"5_pRLYRYe-lF-fksOu3Ydw","user_id":"KEbqEa-Cm2dwTjywv_SNPA","business_id":"RUjBzTlEelxgeDevqR6osQ","stars":5,"date":"2016-03-12","text":"Hayla has magic hands and she's very flexible with great customer service. I have two bridesmaid dresses that need to be altered - a size 2 that I bought a few years ago and another size 6 from the same designer. She made both dresses fit on me perfectly. She also wanted to make sure I am happy before I left the store. When I told her my size 2 dress fit good but prefer to be a little loose, she made the change immediately!  She's such a sweet lady and treat her customers respectfully. Although it's a little drive for me, but I will definitely come back!","useful":0,"funny":0,"cool":0},
{"review_id":"cplzPn15PgMvAFhMeR8V9A","user_id":"KEbqEa-Cm2dwTjywv_SNPA","business_id":"qUMPCi_h3mkrmCBUhXP4qw","stars":5,"date":"2016-05-01","text":"After reading so many great reviews of this place, I went to get my gel manicure today. Tiffany is very talented and creative . I trust her with the design and I am loving it. The staff there are all very friendly. I would recommend making an appointment if possible because this place can get busy on Saturday.","useful":1,"funny":0,"cool":0},
{"review_id":"k60N-MHY3Yz8DAKm2XIgVg","user_id":"KEbqEa-Cm2dwTjywv_SNPA","business_id":"hXjmJCx2LjCJC3DhzxWAqQ","stars":5,"date":"2016-04-11","text":"Michael is amazing to work with ! I had my headshot done by him on Saturday afternoon and the retouched photos were ready by Monday morning ( I took the whole Sunday to select the photo because he made me look so good in the pictures.) Michael is very professional and gave advice on facial expression and how to pose. He also reminded me to fix my collar. I highly recommend Michael for his exceptional service.","useful":0,"funny":0,"cool":0},
{"review_id":"SvjP4OmpaIAWQGP5o0af6Q","user_id":"B2HBVdbtyiLqAxaIweRXGw","business_id":"j1VcTy8eMTgFnNqQTB7Cng","stars":5,"date":"2013-07-06","text":"Being a high school student, I was definitely familiar with the name \"Blue Lotus.\"  I live on the West side of Madison, and Blue Lotus is the place that all of the students at a my school go for tattoos and piercings.  After hearing great things from fellow students, I decided to drop in to get my ears pierced. \n\nI had had my ears pierced previously, but they closed up because I never wore earrings.  It was too much of a hassle to bring my mommy in with me to get a simple piercing, so I waited until I was 18 to get the piercing done.  I went in on my birthday and upon seeing my ID, the guy at the counter wished me \"happy birthday.\"  I know that's not a big deal, but it definitely created a good vibe and little things like that in a skeptical situation can make a big difference.  \n\nThere were people still waiting to get their piercings done, so I had to wait a bit before I was shown the jewelry.  After I picked my earrings out, I had to wait even longer to be escorted into a room.  I'd say overall, the wait time was probably about an hour.  I don't think that's Blue Lotus's fault, though.  It was busy, and people had appointments, and I did not.  \n\nEventually I was taken back into a room by Myke.  He was very kind and thorough in explaining to me what was going to be done and making sure that I knew how clean the whole process was.  He washed his hands and changed his gloves numerous times and even though I'm a bit crazy about germs, I felt completely comfortable.  \n\nI turned out that my hole hadn't completely closed up, and Myke was able to just insert something through my ear the opened the hole back up.  There was a bit of pain, but nothing bad by any means.  I'm very afraid of needles, so I began to get dizzy when the first ear was done.  He kept asking me if I was okay throughout the entire process, and when I told him I was dizzy, he was extremely understanding and finished the other ear with my lying down.  After the piercings were done, he had me check in the mirror and explained to me the steps to take in the weeks to come.\n\nI didn't get a tattoo or a major piercing, but I can testify that the Blue Lotus staff, especially Myke, is professional, kind, and extremely careful about cleanliness and sanitation.  I would recommend Blue Lotus to anyone!\n\nEar piercings at Blue Lotus cost $15, but mine was only $5 because it was just reopening a previous piercing.  My earrings were Neometal with CZ and set me back $60.  It seemed a bit pricey, but I really can't judge because I haven't compared the price to other places around Madison.","useful":7,"funny":0,"cool":2},
{"review_id":"OgUd0XdLMiv8xoltWgUBeg","user_id":"vuhkbBI4L5rvAjdVgqyXWQ","business_id":"j1C4arozKRq6rHSHD1wtig","stars":5,"date":"2013-12-04","text":"'Top Shelf' is a term I would use to describe Donaldson's. I went in for the first time recently and was treated to patient, personal service in buying my first quality watch, and Dave was a champ to my family members and myself. A great selection for those with horological tendencies. This is the type of place you want to support locally. Highly recommended!","useful":4,"funny":0,"cool":1},
{"review_id":"wI8_19IKln-HWlgl62XzBA","user_id":"Kvfqs8KpfVaOCNRiB_hXqQ","business_id":"YuiM5VKscO8rS1EX7f19_g","stars":5,"date":"2010-02-06","text":"We love staying at Mandalay Bay and a quiet evening spent dining at Fleur de Lys always makes our Vegas trip complete.\n\nThis is the second time I have eaten at Fleur de Lys, and it only gets better. (Of course I haven't had to pay the bill which was close to $400 plus tip)\n\nThe atmosphere is wonderful and is the perfect escape from the neon lights of Vegas.  Dining at Fleur de Lys makes me feel like a queen.  I love the outstanding service and the surroundings are elegant and relaxing.\n\nDuring our most recent experience the sommelier offered several suggestions to accompany our tasting menu and each was perfectly paired with the entrees.  I enjoyed a fruity Pinot Noir and had a few sips of a red, but stopped there since I'm not much of a drinker.\n\nThe food seemed to just keep coming and the only entree I passed on was the foie gras since I will not touch it for ethical reasons, but my dining companion said it was the best ever.\n  \nWe started with a mixed green salad with polenta and the Truffle Onion Soup, both excellent.  I was almost full by the time I sampled the bread basket which was amazing in itself.  I could have eaten the pretzel bread and focaccia along with the salad and soup and been very satisfied.\n\nThe other courses included a sampling of lobster and scallops, braised beef short ribs and pan seared duck breast.  My companion also ordered a sampling of Ahi Tuna Tartare.  Every course had unique flavors that worked together like an orchestra performing in my mouth.  Side dishes included white asparagus and fingerling fries.  Although I was full I couldn't pass up tasting each dish, and my companion lucked out since they scored half my dinner.  Ah, but there was a method to my madness since I was saving room for dessert.\n\nWe enjoyed a cheese sampling and fruit along with the chocolate soufflé and some brittle.  \n\nI can't wait to go back this spring, hopefully with my 21 year old in tow. \nFleur de Lys is definitely on my short list of favorite restaurants.","useful":2,"funny":0,"cool":1},
{"review_id":"2CR7H3wCPUKJ-e-mnuReBw","user_id":"w8RJWIqnsCghrs4sIh9hPA","business_id":"WpI5MZC3XzlTpcUOKXzCbA","stars":4,"date":"2015-06-18","text":"The staff was super attentive. Food was yummy...more tex-mex like. The view was awesome! You could see the whole valley. I went for lunch with my family and it was pretty quiet compared to the weekend (according to my Mom), but it was a Wednesday afternoon and we were looking for something good! It really seems like it would be a fun nighttime bar\/food spot....I'll definitely visit when I'm in town again! BTW the margaritas looked awesome....alas I didn't try one.","useful":0,"funny":0,"cool":0},
{"review_id":"BG3ctiHmGloNpS-byBCS-w","user_id":"w8RJWIqnsCghrs4sIh9hPA","business_id":"JIfSollg32ifUzTw2K4PDQ","stars":4,"date":"2015-06-18","text":"I was so happy to find this place! My Mom was in the hospital the day before and wanted some home cooking. This totally hit the spot. It seemed to be a little under staffed and I felt sorry for the cook and the front counter person, but both ladies did an awesome job! There appeared to be a steady stream of regulars. That's always a good sign in my opinion. The carnitas and horchetta were spot on....so good! :) I'll definitely come here again.","useful":0,"funny":0,"cool":0},
{"review_id":"RBYs2zNMFlGtricaMRvWQQ","user_id":"Q7QbT058lv1FFSB3CxJaHw","business_id":"p2_npu4-bMQsCWC-GtRnyg","stars":5,"date":"2014-06-28","text":"Got married here...what can I say that a five star review wouldn't....great people ,photographers and drivers.our wedding was perfect thanks to them...live streaming of our wedding on Facebook was equally as awesome as well as the DVD we got ....I'll never forget chapel of the flowers and my very special day here","useful":1,"funny":0,"cool":0},
{"review_id":"K5eR0R5Fxzz-CVE8d2I8aw","user_id":"SdWIwJPU_wI9fRoWan2_Wg","business_id":"15-7ccie0lFEbdsnwFXNZw","stars":2,"date":"2015-03-02","text":"Went for dinner to try their carved turkey.  They were out,  was going to take about a half hour.  No problem.  Then a half hour turned to a two hours.  Threw was no white meat fried or baked chicken.  They were out of plates, ice, cups and silverware most of that time.  It's like they didn't know how to manage with a full house.  What we were able to eat was okay.  The turkey was not worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"RolZT3TsUeKAi8l9xQTuLw","user_id":"SdWIwJPU_wI9fRoWan2_Wg","business_id":"PAr8XQLgVx2bFIs7OCqPwg","stars":3,"date":"2016-09-14","text":"Their food is usually good.  The customer service from the employees behind the counters is always going to be an experience; whether good, attentive, distracted, rude,  friendly or confused. Drivers are always friendly. I've been lucky the delivery God's  were smiling down on me because I live LITERALLY 1 block north out of their delivery area, but they still delivered!  that was awesome! Decent food (cheese bread, the bomb!), no hassle cooking, convenient and decent delivery times.  Well my luck tonight has changed, I am saddened by the loss of the delivery to my address. You will be missed, unless I am in the area.","useful":0,"funny":0,"cool":0},
{"review_id":"if7m81tnr6PZM5bMjjDt1g","user_id":"SdWIwJPU_wI9fRoWan2_Wg","business_id":"ANXk1tWr1_uDny3ih_5Q-w","stars":5,"date":"2013-08-17","text":"I've been to other locations close to my house and thought OK. But then I went to Trina's. This was very clean. \nTrina's offered a full spa pedicure with salt scrub, wax dip, callous remover, stone message and cooling gel for $40 dollars. During this time, I received a hand massage at no extra cost and as I wait for the nail polish to dry, a neck message; again no extra cost. \nThe basic charge would have been $23 if I would have kept it basic, but my much needed tired feet needed the full treatment. It was well done, was not rushed and very good treatment. \nI left with happy feet, relaxed hands and neck. It was worth the extra drive to get this treatment and well worth the price.","useful":1,"funny":0,"cool":0},
{"review_id":"ADs8yjc0SVLisQVudgt1SQ","user_id":"RNFf2oTQLCqbWYSnHvhPfQ","business_id":"1uPQTz5XZSWr0ti7kUpaDw","stars":5,"date":"2013-08-02","text":"Yummy!  Go here. We liked the steamed dumplings over the fried, but all were really good. The tomato and egg one was surprisingly delicious.","useful":1,"funny":0,"cool":0},
{"review_id":"8MtkQk4mGBX-Ed5R-RTF6Q","user_id":"9W7u9DZUX9QIGStaAnleDQ","business_id":"lOQPeguczAueJnLmDUTfGg","stars":2,"date":"2014-11-30","text":"It took more than 45 minutes to get our food. When it finally arrived, 3 of our 4 meals were cold. No dishes were amazing - disappointing considering the higher than average price.","useful":0,"funny":0,"cool":0},
{"review_id":"VSTSulCbrPcXsPZduidu7w","user_id":"vlsZJzb_XD11icMoMo4YKQ","business_id":"oJYqV8s_Y5y_mNC-38KELA","stars":5,"date":"2015-10-15","text":"We came here for my mom's 80th bday  It was our first time there. Reservations were made for 10 and we were seated promptly at 7pm on a sunday night. The restaurant was somewhat quiet but we weren't complaining since most restaurants are usually too noisy.\n\nWe ordered a lot of food. Everyone ordered a plate for themselves and also lots of rolls and sashimi to share. The rolls were amazing and also hugh. One of our guests has never eaten sashimi before and she loved it ( she couldn't believe raw fish can taste so good and not fishy at all). \n\nThe price was not the cheap but the food and service were very good. Our 20 something kids enjoyed it so much that they went back there a week after for more and introduced a friend to this place.\n\nWe will definitely come back.","useful":2,"funny":0,"cool":1},
{"review_id":"OVifZk2iC_gKjSnek5KTaw","user_id":"OzC_ikYTcjNtcrdAgFWDUg","business_id":"AOaT6anaom9lzaqLnpD8Lw","stars":1,"date":"2016-03-03","text":"STAY AWAY FROM THIS PLACE!!!!! Horrible costumer service, cheap people they don't want to fix anything and when they decide to fix they will send a handyman that can't understand you. They charged me $260 for a blind that worths only $30.","useful":0,"funny":0,"cool":0},
{"review_id":"viRE-WvmnI-GvyGuwmGyxA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"64_y0ZgHl34uOzHNnSnd1g","stars":4,"date":"2015-12-23","text":"It will be interesting to see whether they can hold on, in light of all these newer reviews. My 4 star rating is for the croissants, which are the only thing that we consistently order. We'll be back again and again, even just for them.","useful":0,"funny":1,"cool":0},
{"review_id":"HYu8s7ucnE_NBaTpXyL4DA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"Z5eukYH32_nFljOTC2DJ0g","stars":4,"date":"2014-10-05","text":"I'd been wondering about these guys for years, and finally we got a $4 off coupon to tempt us in.\n\nOrdered a Caesar salad, and also a plain personal pan pizza. Salad was great, and even the spines of the greens were sweet. Pizza was very nice, if different from what I'm used to. Its crust was a nice thin and crisp situation that did not get soggy at any time, thus making it better than what I got from nearby Novecento. And I'm going to say that the cheese and sauce were good but not as good as the also-nearby Montesano's Eateria - but Montesano's had a thicker, breadier crust that interfered too much with the other ingredients in my opinion.\n\nStaff were friendly, water tasted clean, and ambiance was nice. We came in during a slow time, so it wasn't busy or loud, but I can see how it would get very busy and very loud during dinner.","useful":0,"funny":0,"cool":0}]