[{"review_id":"yp1aBAd9fxq0vUNMLmiI8A","user_id":"STEY6Hr01gpw4pA_rpzesg","business_id":"-2ToCaDFpTNmmg3QFzxcWg","stars":1,"date":"2013-07-03","text":"Waited an hour on a Saturday night at 7pm for a shuttle from the airport to the strip. Every employee was rude and unhelpful. The return trip was 1\/2 hour late and the driver was also very rude.  If you value your time take a taxi. LV needs real mass transit and not these thieves.","useful":0,"funny":0,"cool":0},
{"review_id":"voig1-4gSlQXw7IGVvGkDg","user_id":"RT96GLIIEKTqRkXCy0Ym9w","business_id":"dWrezcuIAO-Ckx1W0gu5jg","stars":4,"date":"2015-02-13","text":"This is great place to eat. Fist time there and I had dip sandwich, it was awseome. second time the prk belly was very salty I coudn't eat. Third was dinner and it was pretty good. i will go back for sure and try some different plates. Chef Marc had come around my first time there and thought that was very nice to know the owner comes out to check on customers. I would have given 4.8 stars if I could.","useful":0,"funny":0,"cool":0},
{"review_id":"AIhba7Lg7n004364V9fjzA","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"YJ05ntGlszxACOD5zn1YjA","stars":5,"date":"2014-04-30","text":"OMG! one of the best burgers in the city. .. this will date me but the only thing that comes to mind when I eat a Burger's Priest  burger is..it tastes like what a McDonalds burger use to taste like when I was a kid, and  Mickey D's use to have real meat, and they actually use to COOK the burger from scratch in the store on a real flat grill... the best thing is they will let you have your burger any way you want, you can even ask for NO SALT.. I LOVE LOVE LOVE Burger's Priest.. and even better I love the wall of grease across the road from the original location on Queen east, you have to check it out it's the funniest thing ever..you know it's a good burger if it's left it's mark across the street along the sidewalk ...I would Highly recommend having a Burger at this place..you won't be disappointed ..","useful":0,"funny":0,"cool":0},
{"review_id":"mhop0e1nJ0afKzoC2CXtRw","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"cA9LmSotIsN3C8zCI94--A","stars":1,"date":"2014-04-15","text":"Loved this place until they changed the menu, use to go to the queen east location, but was excited when a Etobicoke location opened, because it's closer to me, went a few times when it first opened and it was just a good as the Queen east location, but sadly they menu has changed, and now the food is BLAND, the pizza crust is too thin in the middle and soft and mushy on the edges, and it lacks the fun huge bubbles that use to be on the edges with the nice brown crisp on them.. the sauce is BLAND no garlic or flavor at all. and I don't want a salad on my pizza, too many weird toppings and I HATE ARUGULA, it's bitter and unless your going to put a balsamic reduction on it it's just gross, the pizza was cold, as I watched the poor servers have to wait for this new chef to dress and cut each pizza, so the pizza sit's on the pass way way too long..And now to the prices..way way too much for a small pizza, guess these owners don't know the clients they are catering too, old money, sad to say but they are cheap, they won't pay more than $55-$65 for a family of 4 to eat pizza's and a couple of appetizers and drinks, with this price increase it's going to cost over $100 for a family of 4 to eat..and old money just won't pay that..they are thrifty with their money.. I won't be going back to this location EVER again the queen east location has thankfully kept their menu the same, and I will be heading back there next time I want a great Pizza..I say fire the chef, who btw smokes, so limited pallet. go back to what works, lower the prices and the old money crowd will return, I was astonished that I was able to get a reservation at 7:30 that should have been my first clue something was up, 3 months ago you couldn't get a reservation at this location until after 8:30 9:00 it was so booked up.. I feel sorry for their WONDERFUL staff, they are forced to SELL this new menu, to customers only to have the disappointing Food arrive, 35 min's later, which is now way way way longer than before..and it's COLD too boot.. I  have to say that over all the experience was disappointing and it's a shame because.. if it ain't broke-don't fix it..the place was excellent as it was, it didn't need to be shee shee foo fooed all up..","useful":0,"funny":1,"cool":0},
{"review_id":"bZKKq0arErHeu8Zrsd0O-g","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"67Pa_CtXthgJzXfY8JzLDQ","stars":5,"date":"2014-04-30","text":"Fantastic Burger, amazing menu, friendly staff, quick service, I can't say more, I love this place it's a great burger, and they will do a Salt free paddy and fries if you ask.. which I love..I would recommend this place if your craving a delicious juicy burger.. it's worth the drive from any part of the city just to have one..","useful":0,"funny":0,"cool":0},
{"review_id":"NDfOK2v0N98cA3uUGe5Zgw","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"QoXT0qI6_3WeHImUuLAyjg","stars":4,"date":"2013-10-05","text":"I would like to say right off the bat, I am a fan of this place...BUT! today when we visited this establishment we were treated BADLY...I'm 45 years old, spent most of my late teens and early 20ties at night clubs, listening to LOUD music.. but never thought I would be subjected to LOUD MUSIC at a breakfast restaurant, even if it's at 2:00 in the afternoon, needless to say, we asked if the music could be lowered a little, NOT turned off, I wasn't being unreasonable.. TO which I was told \"I don't think I can,the cooks like it loud\" !!!  I mean REALLY? I'm only going to be in the place for the most 45 min's, you mean you can't lower the volume of the music for 45 min's? So I can enjoy a meal I'm Paying for!!  So let's finish the story, they lowered it a TINY bit, for 4 min's then a song one of the waiters liked came on, and he proceeded to turn the music back up, So again I asked if they would be so kind as to lower it, to which they turned it down soooo slightly that it made no difference at all..and after about 5 more min's it was back to it's original volume..at that point I was pissed beyond belief so I rushed ate my food and as soon as the last fork full was past my lips I left the restaurant and walked out the door, and my husband who was also bothered by the LOUD music didn't not leave a tip.. I won't be back to the George st dinner for a while now..maybe even never again...","useful":4,"funny":2,"cool":1},
{"review_id":"vAy9yB85gMb7XszAPKgwsg","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"zg5rJfgT4jhzg1d6r2twnA","stars":1,"date":"2014-04-30","text":"I use to visit the original Kraft Burger, which was the name before they Franchised.. and I have to say since they Franchised it's totally lost all it's quality charm and warmth.. the burger's use to be hand made, and un-pasteurized meat. Because they knew who was cooking the burgers.. now they come Pre-fabbed frozen pasteurized..so when the 17 year old food prep person doesn't cook it properly you won't get sick.. So after Kraft burger..AKA Big Smoke. franchised the original staff disappeared and random kid's appeared and they ALWAYS screwed up my order and the patty just never the same.. nor the ambiance it was just gone.. I will miss a good flame grilled burger.. sometimes Franchise isn't the best route..I haven't had a burger from Big Smoke in over 2 years and I use to go there at least once every month..It's sad really since it was such a great burger and a wonderful place..","useful":1,"funny":0,"cool":0},
{"review_id":"bNchYWOY2GuaFeb8Y2E6Xg","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"ifRadEJatro2aQWaQH4kAw","stars":1,"date":"2014-04-22","text":"I'm sad to say that Maggie's is GONE.. it's now the College street Diner, and the decor is to say the least depressing, GREY, makes the space seem small and closed in..They did keep most of the menu but the food now is Sub-par. and gone is the small details like fresh edible fruit on the side of the plate, the orange juice isn't as fresh, the bacon was cooked to death, toast wasn't even toasted.  we waited around 45 min's for our food and when it came it was STONE COLD..at least when it was Maggie's it took a long time but the food always arrived hot. then comes the very Gross and disturbing part of the ordeal, I sat and watch the Prep cook, stick his fingers in his mouth 3 times and I mean a full on Molar scratch.. and then touch toast, fruit, and other items on people's plates, and I also saw the waitress bring someone a cup of tea holding the cup from the top with her fingers..to be honest I WON'T ever be going back to this place.. that finger in the mouth thing just super grossed me out and I just hope no one comes out of that place with HEP C or worse..","useful":0,"funny":0,"cool":0},
{"review_id":"J0Lbwt6ptR5GB054UUjcjA","user_id":"AfryLIz_0lH8PtVHx1F7qg","business_id":"6ALBeke4yZcCorqLMvpFoA","stars":5,"date":"2014-04-22","text":"This place is Our FAVE.. we are regulars to this roncies location, and my husband and I adore the staff, and the food, Coffee is amazing, food is always hot and deeelish..and they will always accommodate you when it comes to changing or adding anything to your order, not too many places with do that especially when it's so busy, during breakfast or brunch time.. the line cook's are freeking amazing they can knock out your order in record time, and I don't think I've ever had them make a mistake with an order..I recommend the shakes, they are a serious meal be prepared to take them with you, there HUGE.. I'm a big fan of the Huevos they are so yummy.. you won't be disappointed..I recommend this place 100% ..","useful":0,"funny":0,"cool":0},
{"review_id":"v9Y3vC8mWi9asTLMSYVK-A","user_id":"K944AsfTC63G2FNa9y305A","business_id":"b5kC2XepQ1-6qCDpvtoxxA","stars":1,"date":"2016-09-16","text":"Always long lines, always horrific service at this location. After waiting forever, order is consistently messed up.","useful":1,"funny":0,"cool":0},
{"review_id":"Bt-jvwo43ejVkp_ao0t_Bw","user_id":"pvWqCBsN0PpvdTwIOpXEbg","business_id":"-Ge9R96u0gmqyLFPPxDXvw","stars":5,"date":"2016-10-05","text":"My partner and I found Nicholas through a reference from a friend in town as we were relocating from OH and did not know any realtors.  I can't say enough about how completely satisfied we were with his expertise and professional manner.  He knows the area and was easy to work with in coordinating our several visits coming into town to search for our house.  In addition to his positive get it done attitude, he is very proficient at his job and has great contacts.  We have used his references both prior to and after our house closure and all of them have been terrific.  I would HIGHLY recommend Nicholas!","useful":0,"funny":0,"cool":0},
{"review_id":"H4B_Xta1_L1G0pwnG3i2BA","user_id":"T9o6lk7ShZM5ES5dDlPahA","business_id":"nl_gkvVXtsIlhGE0sP0qFw","stars":1,"date":"2015-04-29","text":"The food was sitting out old and stale. They finally brought out some fresh chicken and after biting it I had to spit it out because it bled into my mouth. I tried to find something else to eat but the selection was poor and I just couldn't get over the chicken. I go to get some ice cream and they have nothing but the last scrapings at the bottom of their bins. NEVER GOING THERE AGAIN","useful":0,"funny":0,"cool":0},
{"review_id":"G02xCZiDikQ6MLES5JEazw","user_id":"T9o6lk7ShZM5ES5dDlPahA","business_id":"UNhMZrJ-zZjh1XKaj0Z_DQ","stars":5,"date":"2016-03-07","text":"If you are looking for a dentist then this place is amazing. I am one of those people that hates going to the doctor\/dentist so it's a miracle when you can get me to go. This place was recommended by a coworker and I am so thankful. From the moment I made my appointment to the time I left I felt so welcomed and comfortable. Every single one of their staff are personable and friendly to the point to where I forget I'm at the dentist! It's a family owned practice and I cannot speak more highly of them. Thank you Okun!","useful":0,"funny":0,"cool":0},
{"review_id":"Jj_-Jt17JRwJNVrUVp_ZuA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"TdKJjgiXMPXDamGK-IwFZg","stars":5,"date":"2016-02-11","text":"Came here with my kiddos while my husband was shopping in Harbor Freight and I have to say I was surprised my how delicious their simple grilled cheese was. The burgers are great too... I love this place.","useful":0,"funny":0,"cool":0},
{"review_id":"hUJv7smcaJAT-Ii4yvbxwg","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"sCJAbN7K53y45F4FPOBxLA","stars":5,"date":"2015-10-01","text":"Took my boys here with a groupon and was pleasantly surprised by how clean the place was. There are lots of toys and equipment for babies and toddlers to enjoy. There were also sanitize stations to clean those grime little hands. I would definitely bring my boys back again!","useful":0,"funny":0,"cool":0},
{"review_id":"TMbooEs9sybccJ8lmgFSyw","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"fS9a8AGrcwWPf_9vfn5wPQ","stars":5,"date":"2016-07-08","text":"I was introduced to this place by a friend and instantly loved it. The atmosphere is great and the staff is friendly. I ordered the yellow chicken curry.. it was very delicious and full of flavor. I will definitely be coming back to try more items on the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"fzJBrRKl78dNlSPurS8Naw","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"RCOSsBh8uL69MT68uT92og","stars":5,"date":"2015-05-02","text":"This park has two decent playgrounds that are shaded and one unshaded.... theres plenty of Ramada space for a party and the historic part of the park is great for pictures.","useful":0,"funny":0,"cool":0},
{"review_id":"JN3V4Bka4YnqATnzxJUK-A","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"lImzcOqB4etkPR9WT50lDg","stars":1,"date":"2013-05-19","text":"This place is the worst!!! We got take out from here last night and our food was undercooked and very greasy. It also did not smell too good either... won't be going here again... should have listened to my sister who said \"eww\" when I told her we were ordering from this place.","useful":6,"funny":0,"cool":0},
{"review_id":"g9p8BlO2Hi6toTLDyTOjZA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"Vw9u6qar1I2QlkQOV6KNVA","stars":4,"date":"2013-05-19","text":"I've only been here once and must say the food is delicious! They were also very accommodating when I asked for no mushrooms in any of my order due to a mild allergy. I will be back for more.","useful":0,"funny":0,"cool":0},
{"review_id":"raIobXhB52luaxGekLmFqg","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"twrgw3ZaMEiS87sN5ahuuw","stars":5,"date":"2014-07-07","text":"Delicious food and great candy selection... I love this place!","useful":1,"funny":0,"cool":1},
{"review_id":"r-viRaVU_io0CBRJrYWL5Q","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"zO6Sx9HrkS_WTF6EB61-Pg","stars":5,"date":"2016-04-03","text":"I have only taken the zumba classes here and it is phenomenal...  the drop in price is very affordable and worth the 7 bucks. The atmosphere is fun and energetic... the instructor Dahiana really knows how to keep the class pumped and exicted to dance.","useful":0,"funny":0,"cool":0},
{"review_id":"wCtEtuyW5LVvGnn2PXZ9ig","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"mBeZ3dQzUPV60Oa26k3qHw","stars":5,"date":"2015-10-01","text":"I love this particular Harkins, it's always clean and in a great location. To me there seems to be less annoying preteens and high schoolers hanging outside...which is nice for date night.","useful":0,"funny":0,"cool":0},
{"review_id":"E8c9bJ-a9qpNILi-FDzMyQ","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"PxEBztsJoFUGnzOePct65w","stars":5,"date":"2013-11-09","text":"Love this place!!! After searching through numerous reviews I decided to try this place out... and I must say it was worth it. The people were very friendly and talkative... the nail tech told me they could do ANY design I find on pintrest or else where. Wish I took a pic of how awesome lily did on my pedicure.. maybe next time. Give this place a try, I promise you won't be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"9CQIGd71uTwuNJSrl5sNBQ","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"-YYhUIdX-oJoqwd47sAJSw","stars":5,"date":"2015-10-01","text":"I love this place...there is so much for your child to do and explore. I bring my kids to the children's museum a couple times a month and we always have fun. I especially love the arts and crafts room and the little grocery store.","useful":0,"funny":0,"cool":0},
{"review_id":"oMXa3nihhk2axDL_p05j0g","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"nywpcGzjPiNkMBxOpunTPQ","stars":5,"date":"2014-12-13","text":"This place was my first experience with Greek food and I loved it... I can't imagine my life without gyros now lol. Its kinda small but the food definitely makes up for it and the staff is really friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"ds3fSTyVmXvUp9ru4kBdtQ","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"6OFnrXcl_bAzj20zZjWJSw","stars":4,"date":"2017-08-27","text":"We came to Clubhouse today for the kids eat free special which was a good offer. They serve breakfast all day which is awesome and have really good drink specials. My kids and I had breakfast and my SO had the build your own burger. The burger and fries were average nothing special. The breakfast was good though, I had pancakes, eggs and bacon. My only complaint is that our waitress sucked. She was kind of rude and standoffish... Making us feel like she just didn't care. Other than that everything was good.","useful":0,"funny":0,"cool":0},
{"review_id":"hJ-eqOX9xJq8QHICLB7XLw","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"urkODQ1jX0qQzgbqsQjWVQ","stars":5,"date":"2016-07-08","text":"This place is amazingly delicious and healthy... score!!!  The staff is always friendly and the atmosphere is very laid back. I've only eaten their salads and wraps and all items from these selections are flavorful. I am never disappointed when I come to Flower Child and I will definitely keep coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"nS5Gfu3sEElI3sUoyEj6aA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"FcUaG4Lm1j8eTCXWru7aQw","stars":5,"date":"2015-03-14","text":"Took my boys here to get hair cuts and they loved this place. They never let anyone cut their hair... but this place was able to make them feel comfortable and happy. I will definitely be bringing them back.","useful":0,"funny":0,"cool":0},
{"review_id":"n2jRJd0xbFjgGlTFRUNvXw","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"Lm61pehc-oyqR6DBAAQNCg","stars":5,"date":"2014-12-13","text":"I love this place! Whenever I can convince someone to get up early and eat some awesome biscuits and gravy, it is the best day ever! Seriously, I recommend the biscuits and gravy... plus the atmosphere is pretty neat. Kinda reminds me of a Grandma who hordes country decor lol.... they have great food though.","useful":0,"funny":0,"cool":0},
{"review_id":"HkDAQT3kXmOh7nDTlQ1DsQ","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"cHdJXLlKNWixBXpDwEGb_A","stars":5,"date":"2014-07-15","text":"Yum! Chinese\/Mexican fusion, who would have thought?!!! Seriously, the jade chicken is amazing... try it :)","useful":0,"funny":0,"cool":0},
{"review_id":"lgde3XPoBoEZi5l8p4CTqw","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"bZaVMkkaXFc0xpnOkacWsg","stars":5,"date":"2014-07-15","text":"I've been coming from the northwest valley to eat at this pizza joint since I was a very young child... I'm now 26 and I still love this place. Great food and fun pin-ball machines. Everyone should try this place once.","useful":1,"funny":0,"cool":0},
{"review_id":"B7tP4ufBP0xJTJjQFxPXWA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"I1XKPA5cU5e8UDYVkxBcTQ","stars":5,"date":"2012-11-04","text":"I have been here twice and I must say for someone who goes to all the haunted attractions in the valley... this one is pretty good. But then again I'm a big wuss when it comes to haunted houses\/corn mazes. This place makes for a fun cheap date night...love the farm animals and pumpkin patch as well.","useful":2,"funny":0,"cool":1},
{"review_id":"BxOnQk-QmugZB5iqUWypIA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"x_4gEfC25uiX21NyYdohgQ","stars":3,"date":"2015-10-01","text":"I'm not too keen on Chinese food buffets even though I LOVE Chinese food. I gave three stars only because I ate two things... the lo mein and pot sickers. Those two items were decent enough... I had very low expectations so I was happy that these items were good. The bathroom was disgusting though.","useful":1,"funny":0,"cool":1},
{"review_id":"53qBORHdx1BGgnY9flqaBg","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"I4tp53A6qj6m_TXcwhBhqw","stars":3,"date":"2014-12-13","text":"This place has pretty decent tamales for 3 bucks... I purchased the tamale outside of the restaurant while attending Glendale Glitters. I have not been inside or tried anything other than their tamales but I would buy some again.","useful":1,"funny":1,"cool":1},
{"review_id":"hmvPTVczgakO51RbWgZQDg","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"cI4j5iXwxlW1D75YBkvlaQ","stars":5,"date":"2016-07-08","text":"My husband and I have just started coming here and we love it. We are new to climbing and the staff is very helpful in getting you acquainted with the equipment and proper safety techniques. The price for a day pass is very affordable at 20 bucks and includes shoes and harness. The place is a little rough looking but that doesn't take away from the climbing experience. Also, there are routes for all levels.. although some routes are incomplete and seem to abruptly end. Despite that, Ape Index is overall a great place for climbing. I will definitely keep coming back!","useful":1,"funny":0,"cool":0},
{"review_id":"S4-fCAKyq8NKjKJ-0q7-UA","user_id":"9ENjqz7bObyASRGGD4sYyg","business_id":"mR7tCPuk37W_CoFcNEI8rg","stars":5,"date":"2015-03-12","text":"Yum...they have delicious gyros and baklava for a decent price. I've been coming here since they opened and the owners are very friendly :)","useful":1,"funny":0,"cool":0},
{"review_id":"wylDqclFMUyQiwjrJYvYBA","user_id":"-qLmkelHUHWlQHrTzOMkvA","business_id":"0KjY3gmtqQjc4sK-uG-6fQ","stars":5,"date":"2017-03-23","text":"Love this place?the cookies and cream and banana cream are my favorite.  Today there was amazing music on! Rock on Thursday.","useful":0,"funny":0,"cool":0},
{"review_id":"wz1Pxl4OLQGAro-xZ0BiCA","user_id":"vo_rsIwU6ePwejzDgeRv7A","business_id":"c0ITJRgeNc6-iI6Z6OznRA","stars":5,"date":"2017-09-10","text":"I lived near and climbed at focus for a few years.  It's an excellent place to develop as a climber.  The setters keep things fresh with frequent resets, and the routes range from good to excellent.  I was always impressed by the little things: chalk being included, how clean the gym is, how much the staff know about climbing, and, most importantly, 2-ply toilet paper in the bathrooms.  Keep an eye out for the spotlight problems, they tend to be winners.  And even if you don't think you can compete, enter one of the free comps: they are great learning experiences with nothing to lose.","useful":0,"funny":0,"cool":0},
{"review_id":"FTOcc1_GDryj_rOhF2BlNw","user_id":"vo_rsIwU6ePwejzDgeRv7A","business_id":"xg7DgICgg4xqeLlF4zdLVw","stars":2,"date":"2014-06-06","text":"Issues:\nCard cash redeemable only in November.  Unless you happen to close your account after the November payout, everything past that point is lost.  I asked about my 30$ in card cash and was told I'd have to keep the account open with either the minimum to avoid fees or they'd bill me 3$ per month until I collected my 30.  \n\nFew locations and limited online ability.  This doesn't bother everyone, but I travel a lot.\n\nThey once tried to charge me 5$ for a printout of my statement.  Apparently it was a miscommunication, and they thought I wanted some official document rather than a standard printout.  It still took 10 minutes out of my day and some arguing.\n\nNothing special if you're just using checking\/savings.  With a bigger bank, I get more locations, quicker service, better online functionality, and am overall much happier with my experience.\n\nThey are a small bank without the small bank feeling.  This is entirely subjective, but part of the reason I joined was a positive experience with a small bank elsewhere.  People there knew me and were friendly.  The representatives were hit or miss at Canyon State, some very pleasant and others perfunctory.\n\nIt's not so much that they don't work, but rather, that they are mediocre in all of the areas that I value as a checking account holder.  There are plenty of better options.","useful":4,"funny":0,"cool":1},
{"review_id":"3uahJMZybVE6UcIDz5ozpg","user_id":"8RfxjzDvXRoSuTgXglqU-Q","business_id":"FSzfrQCKyzLgMhee4oxQMg","stars":1,"date":"2013-11-18","text":"We bought our new Jeep Cherokee from this dealer three years ago. Since then, It has been in their service department a shocking 17 times! Once they left a razor blade on the front seat. Once they left a wrench IN the engine. Once after 6 days in for repair (car wouldn't start), they called us to tell us that they couldn't fix it, but that we could come get it (how, exactly?). When we got there, the windshield had a crack clear across it, for which they said they were not responsible. They said it was there when we took it in. Or they dropped a wrench on it. Whatever. Go elsewhere. This dealer is an absolute disaster and their customer \"service\" is non-existent.","useful":6,"funny":1,"cool":0},
{"review_id":"nEjseZr1Ec65oM1HHcKl5w","user_id":"seDqYG1KJAn0JMidxg36yg","business_id":"c-Ur4wPDNjt-e2N5MkRRaQ","stars":4,"date":"2013-11-25","text":"The service was very friendly and fast. Each dish was very authentic, made with good quality ingredients. Excellent decoration inside. Reasonable price point. An unique all-day dim sum experience.","useful":0,"funny":0,"cool":0},
{"review_id":"LUYACA_SFJieooFd6PczlA","user_id":"seDqYG1KJAn0JMidxg36yg","business_id":"sYKB4nITCLLFcCZPn3QECQ","stars":4,"date":"2014-05-03","text":"This is a great place to taste authentic Japanese Izakaya or Teppanyaki styple cuisine. Not your typical mainstream Japanese restaurant here in Toronto.\n\nAmazing service and the food is just awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"oFmXfCI5nQAI80XSX5ab7A","user_id":"_kkZwJmVrQDtHWNm66e2cA","business_id":"svdEhLmNmpVaIv1WLtoOvQ","stars":5,"date":"2016-11-13","text":"Great selection of beer, wonderful food, excellent service, and Frank was great. Try the vegetarian tacos; as good or better than the meat and seafood.","useful":1,"funny":0,"cool":0},
{"review_id":"Tnu5pKYs4h_Udo_MiPWuRA","user_id":"_kkZwJmVrQDtHWNm66e2cA","business_id":"MyTsAeShB9pcWP84GSTAdw","stars":5,"date":"2017-01-12","text":"Excellent food, great service, clean place, friendly people. If you want good food and more than ample servings, Komex is the place.","useful":1,"funny":0,"cool":0},
{"review_id":"8c5DmRXtwnUDj628RlIrQQ","user_id":"_kkZwJmVrQDtHWNm66e2cA","business_id":"El83MSV3YHDtcSeIJqPOhg","stars":5,"date":"2016-11-11","text":"Excellent chicken and great service and the fried chicken is to die for. What else can you say other than try this place, you'll like it.","useful":0,"funny":0,"cool":0},
{"review_id":"VOQRXWmz0lT5sDQCipkxFQ","user_id":"gbEuiHwKMOJdb8aCzvloKA","business_id":"RG4NphZCi8Pw6Ei-g6oaqg","stars":5,"date":"2015-05-31","text":"Stopped in here for the tour with a big group of guys during my bachelor party.  Great tour, great beers, and great pretzels.\n\nOnly one critique, \"Beverly\" needs a sister about half way through.","useful":0,"funny":0,"cool":0},
{"review_id":"cJVjAAL6B-9ZcHLDihBPUQ","user_id":"Edf26mmiZEmh2_VMFHGIUQ","business_id":"xIbtbAJLWLNZcqfqF4f-Nw","stars":5,"date":"2017-02-25","text":"Friday night, the place was packed! It was my first time having dinner here, and we tried one of the appetizer specials, the charcuterie board. It was interesting, maybe not something I would do again, as the goat cheese and chicken liver mousse seemed like an odd combo. Dinner, however, was wonderful! My guest had the pork shoulder, and I had the pork belly. The pork belly was perfectly rendered and crispy, with cheesy grits, delicious. My guest's pork shoulder was perfectly seasoned and tender, served in an abundant amount alongside chipotle spiced beans. Definitely will go back!","useful":0,"funny":0,"cool":0},
{"review_id":"usQEcTwgJj5dK36vCcpFuQ","user_id":"Edf26mmiZEmh2_VMFHGIUQ","business_id":"lwpQQflP1CGJPV7QLybzOg","stars":5,"date":"2016-05-28","text":"Ambience is decent, staff is friendly, pizza is great! I have been an occasional visitor to this spot for years, and would suggest trying their wings or meatball sliders. Kitchen is open until 11pm, and half off bottles of wine on Wednesday. Most recently my GF and I sat in the dining room, and \"built\" our own pizza with Italian sausage, pepperoni and green peppers, we ordered a second to take home with us!","useful":0,"funny":0,"cool":0},
{"review_id":"GHwhW4IsHsDQBEsVrrFO5A","user_id":"Edf26mmiZEmh2_VMFHGIUQ","business_id":"htNS19kbvYpQ5FfW0_-f8g","stars":5,"date":"2016-07-27","text":"Heard about this place from a friend, and will definitely be back! The House cocktail is a craft riff on a margarita, and was delicious. The beef and Brussels sprouts skewers were amazing, a lot of different flavors on a small plate! The ahi tuna app, meh, not exactly memorable. The wait staff was friendly and helpful, and they have a great happy hour!","useful":1,"funny":0,"cool":0},
{"review_id":"aS_9N3Jns-pOpin_SAf7Hw","user_id":"gpUOWJqJvMPJo5TsVevyaQ","business_id":"fin8bCrfZ7aCB1pGesvDmw","stars":5,"date":"2010-04-28","text":"Went to Theodore 1922 on a recent trip to Toronto. The store is great and the collection is very well selected. It is definitely higher end than your usual off the street clothing store, but if you are into quality and style, I definitely recommend a stop here. \n\nThe staff are very helpful, knowledgeable and pleasant to shop with and were able to predict what I would like on the second try (yes, I bought the jacket).  \n\nIf you are interested in looking good and getting the right clothing to do so, a stop in Theodore 1922 should be on your schedule.","useful":2,"funny":0,"cool":1},
{"review_id":"3fHMXBRvUdL0OU-ViU0lhA","user_id":"KE7YbDunMa1zv-mrXno0Ow","business_id":"5XiXOjG9G_ooyfkLwto4VQ","stars":5,"date":"2016-07-11","text":"I had one of the best online shopping experiences with UGP from designing my own shirt to ordering and pick up. Their customer service was great! Cade answered all my questions and walked me through the design process step-by-step. I was very pleased to have that kind of assistance. Thank you Cade. I will be doing all future designs at UGP.","useful":0,"funny":0,"cool":0},
{"review_id":"qKI1uf9KqD5tBDXsRKRpzg","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":4,"date":"2013-06-19","text":"The food was so good! There was also a very short wait to be seated. Everything was super tasty. Their mac and cheese was insanely good and their gelato selection was huge.\n\nI deducted a star  because they ran out of my favorite food there (shrimp dumplings) and because there was no bottomless mimosa option when we went.","useful":0,"funny":0,"cool":0},
{"review_id":"ZU03Yp4no5RyIIpqlu-1VQ","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"K7fip0nDFFdCC7OCnNOotQ","stars":4,"date":"2013-10-23","text":"I went to Hyde as part of a huge bachelorette party. We had a host bring us in and we got some drink coupons. The drinks were okay (I can't complain too much because they were free) and it was insanely crowded everywhere we went. One of my friends practically got body-checked by a bouncer while trying to make a path for a bunch of cocktail waitresses holding champagne bottles to get through. The view of the fountains kind of makes up for the overcrowding. This was the first place of the night we went to, and we stayed for about an hour. The music was good, but it was way too crowded. It's definitely awesome to see the fountains (which went off more often than I thought), but I'm not sure I'd be back for the late night club part.","useful":0,"funny":0,"cool":0},
{"review_id":"abVrKLLpMhaK9SX4DOY41Q","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"liGn7sPOvUuy3kcwbhRkbA","stars":3,"date":"2013-06-19","text":"I went here with two other girls. There is no drink menu, just sake and wine. We were all in the mood for a cocktail and were kind of surprised that there was no cocktail menu! We went with champagne instead. We handed over our ID's and placed our champagne and food order. We got the food quickly but we never got the champagne. The food was good, but we were a little annoyed we never got our drinks. Luckily, we weren't charged for them. Next time I grab dinner, I'm going to make sure there is a cocktail menu.","useful":0,"funny":0,"cool":0},
{"review_id":"cyJrWPR29Iuu4Ipqh0lHAA","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"YuiM5VKscO8rS1EX7f19_g","stars":4,"date":"2013-06-19","text":"I went here on a Sunday night with two of my friends as part of my Vegas bachelorette weekend. We made reservations but they weren't really necessary. The atmosphere was upscale without the stuffiness. We all loved the decor.They had a very interesting cocktail list. My friend got an Absinthe Apple Martini and they made me a special drink that wasn't listed (St. Germain, Pear Vodka, sparkling wine). Both drinks were out of this world. Our waitress was super nice and even brought me a special desert that said congratulations for the engagement! The dinners we got and deserts were great. My only complaint is that the menu was kind of small and there wasn't any listed option to add any meat to out salads. Other than that, we all loved it!","useful":0,"funny":0,"cool":0},
{"review_id":"K-vmNvl-trp8CYPHl_GxPg","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"Rb2s2-2kIvbPXnPEuM_OBg","stars":1,"date":"2013-06-19","text":"My friends and I checked into TI after traveling from Boston and JFK and we were STARVING so we decided to check out Kahunaville. The food wasn't bad but the service was TERRIBLE. Our server took forever (there were 3 tables filled where we were) and wasn't congenial at all. I ordered a peach iced tea and it was clear which kind of freaked me out. It tasted like syrup so I never ordered another one. While our server was hiding somewhere, we got asked by some staff if we were eating. We told them we ordered food but hadn't received it yet. They told us we had to move our seats to a different table because they were setting up a projector for something. Instead of grabbing us new silverware or at least telling us where to sit, they just told us to grab our stuff and move. The only time we got a smile was when the bill was dropped off. I'd stay at TI again, but I definitely wouldn't visit Kahunaville.","useful":1,"funny":0,"cool":0},
{"review_id":"m-KE3nCfjj-MJKfCfAW9Lw","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"aLlREPOEtt3JzeDCagHytA","stars":5,"date":"2013-06-19","text":"I was under the impression that Pure was kind of on the older side and wasn't super thrilled about coming here...BUT I went here with a group of 8 girls as part of a bachelorette weekend and we all LOVED it! We got in at about 12:30 or 1. We were on the guest list and only had to wait a few minutes to get in. The dance floor was crowded, but that's how it always is in Vegas clubs if you don't get there as soon as they open. The drinks were delicious and pretty average priced (it's still a bit expensive though). The deck area was AMAZING and the view of the strip was perfect. The music was perfect. They played hip-hop\/rap downstairs and the deck area had more of an EDM vibe. The crowd was pretty good too (no one came in contact with any creeps). I'll definitely be back.","useful":2,"funny":0,"cool":0},
{"review_id":"bylBAarD3DRZvfrjpnWFPA","user_id":"iQgm7ZCSuyWklP8fsUDfcA","business_id":"HWl2EbZhkhAkFgqt44yUkA","stars":1,"date":"2013-06-19","text":"My friends and I came here for Happy Hour. We sat at one of the bars. We sat at our table for a little while thinking a waitress would come, but she didn't. No big deal, so we went to the bar. My friend waited literally 10 minutes at the bar (we know this because our other friend was on the phone while it happened and she saw the call timer) waiting for one of the 2 or 3 bartenders to hand us a menu. Before handing us menus, she demanded to see our ID's. We brought them back right away (we had a table like 3 feet from the bar), and then we had to wait even longer for her to check them. After looking through the menu (and getting such horrible service before we even ordered anything), we decided to go back to our room and drink in there instead.","useful":3,"funny":0,"cool":0},
{"review_id":"abNWkz4mBOfdfkB9v80s5A","user_id":"ztR1y7MkqdRCRwvZzx4_pw","business_id":"rnvKg9DtsAIHWU4eywsqmA","stars":5,"date":"2017-05-12","text":"This place right here is something everyone in Cleveland needs to stop by and try. I have tried the Brisket on Texas toast, and it is phenomenal. Great smokey taste with the perfect amount of seasoning. Their cornbread is also great. For sure will be back for this and to try out some other options. 5 stars, well done.","useful":2,"funny":0,"cool":0},
{"review_id":"3TjBj7zVj0h6Q5hoNLJiCw","user_id":"w_E0gn1-pHDdKRw69cbcgA","business_id":"-ed0Yc9on37RoIoG2ZgxBA","stars":5,"date":"2017-11-05","text":"Great food and worth the wait. We'll definitely eat here again next time we're in LV. Highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"vUWEaW5v5jPyCFoZc75OTg","user_id":"QP7X9GLutn-q6g_kWocsGA","business_id":"yk673s5q35WlMSZuUFfYXg","stars":1,"date":"2014-09-20","text":"We've had our car worked on here before with no issues. Brought them a friend's Mercedes, which needed a diagnostic and turned out to need a new alternator. We are fully aware that Mercedes parts and service are more expensive than American cars. However, Kerry's told us this part was a special order from Germany only, and with part, shipping and labor, the total cost would be $7700. Yes, SEVEN THOUSAND. We took the car home wondering what to do, since this used car as a whole cost not much more than the cost of this potential repair. I made a phone call to another German auto specialist who laughed at that price and said, after confirming the same special part (which they had in stock) would cost $2000, out the door, including labor and tax. I can see two different places having different prices, but a difference of $5500??? Clearly, Kerry's either doesn't know what they're doing, or they intentionally try to rip off people whom they know are unfamiliar with cars. I would never recommend this place to anyone after this.","useful":3,"funny":3,"cool":0},
{"review_id":"vAsdy1f6HcmjOVNsdu8xWg","user_id":"QP7X9GLutn-q6g_kWocsGA","business_id":"2uRM8Et0uJVl8u1jSnmuKw","stars":5,"date":"2013-03-29","text":"This is now our favorite Thai place in the valley, and even though we live on the other side of town, we have been there several times. The owners are very friendly and the atmosphere is elegant without being snobby. Tom Ka Gai soup is the best. I'm not a Thai food expert, but I'd say this place is one of the best you'll find. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"KYxrz0aK8sUpe0gF5YxqJw","user_id":"QP7X9GLutn-q6g_kWocsGA","business_id":"woP-omtF0PobX4JxXpZa7Q","stars":4,"date":"2013-03-29","text":"We have been semi-regulars of Ronnie's for a few years. The food is consistently very good, the portions are huge, and the servers are all extremely nice and very attentive. It's not fancy or gourmet, but it's seasoned well and tastes good. My bf always gets the steak & eggs special and for the price, it's always very good (potential for chewy cheap steak, but it's not). The only criticism I can give is that since they expanded the dining room last year, the kitchen sometimes gets backed up when they are swamped (more seats but no extra kitchen = slower food) so you will sometimes wait a little longer for your food. We always have some type of special request on our order (extra cheese or sauce, no sausage, etc) and they always get it right. \n\nI definitely recommend Ronnie's, and have sent many friends there, but if you've never been there before, you may want to go on a week day when they aren't so swamped. But... the place is swamped for a reason.","useful":4,"funny":0,"cool":0},
{"review_id":"iXEJAF1XTscMh8_0F_4Ikw","user_id":"QP7X9GLutn-q6g_kWocsGA","business_id":"UHSN_kZGfG-jBL8iCfvgvg","stars":3,"date":"2013-03-29","text":"Surprisingly good food for a dive bar. The all-you-can-eat fish fry is their specialty and we get it often. I do think it is priced a little high, but if you eat a lot, it's worth it. Their coleslaw is the best. Pastrami sandwich is great and so are their fries. Nothing fancy, just cold beer and good food.","useful":1,"funny":0,"cool":1},
{"review_id":"btmmWqbBGCwlq5BYNze3VQ","user_id":"94lmEEhikxBzQK8lVbUqwQ","business_id":"YIf8UeObm5WR-bQRwdu3Bg","stars":5,"date":"2016-09-25","text":"The flavor is amazing.... the people is great and friendly! Totally recommended!! It will come back next week!","useful":0,"funny":0,"cool":0},
{"review_id":"QxY1dh6jGeGChwtWbFlIOw","user_id":"94lmEEhikxBzQK8lVbUqwQ","business_id":"e2lqb5CMbNzxigLuW5DmGg","stars":5,"date":"2016-10-08","text":"It has a friendly environment, organic food, great flavor of coffees and teas made with fresh leaves!! Great cookies and cakes!","useful":1,"funny":0,"cool":0},
{"review_id":"Khr21Hwl-uZsdqPFnuyaUg","user_id":"5rPbiAl3KnQdnYBjdmkSOw","business_id":"oS0CnUbyv0GUoD3L8_3UPQ","stars":5,"date":"2017-12-11","text":"A favourite among locals! \nI've come here a number of times with friends and solo - they've never made an error on any order, which seems to be rare but definitely  understandable in the restaurant business.\nMost people order take out so there is always a spot inside if you prefer to stay and chat.\n\nThis is bias, but my utmost favourite dish is the green curry. It's just spicy enough and the flavours closely match real green curry found in Thailand. Close enough compared to other pricier Thai restaurants in Toronto( and none of the crowd)! The coconut milk greatly conpliments the complexity of the chilis that the dish is made with. Rice is never overcooked, but this splendid little number is hardly ordered on its own.\n\nIf you go with friends you can have more variety! I would highly recommend the spicy peanut chicken, and if you have enough people to eat with, please order the house pad thai. They don't skimp on any ingredients, and we all know how important peanuts are to a lot of these dishes! \n\nWhen you factor in no wait time, price point,amazing service with the SUPER friendly owner, and bang on dishes there is no way I could give this less than a 5!","useful":1,"funny":0,"cool":0},
{"review_id":"3_9UD0UQ1kS1_2AsookiDQ","user_id":"5rPbiAl3KnQdnYBjdmkSOw","business_id":"kMgdZVLzAXM1JQwFsPXIlg","stars":5,"date":"2016-11-04","text":"Don't go by the poor review below. This place is amazing. I went in on a whim and ordered the mattar paneer and aloo gobi. The curries they make are more authentic, rich in taste but do not sit heavy in your belly and better priced than any other indian take out. Best place in town! Huge portions, truly authentic taste. If you have a craving, go for the matar paneer. It's on the lower level, looks like nothing: so if you're walking past and staring at your phone you'll walk right by it. I know I'll be back !  Mmmm","useful":0,"funny":0,"cool":0},
{"review_id":"zfdZrDOmEnNuLbnpuwR1Dg","user_id":"aWfHeLObtRV4_SLgdKgHGQ","business_id":"WisJd-4-rpWUSPjRE8_MMQ","stars":1,"date":"2016-08-25","text":"All I can say is do not buy a bmw from this dealership. I also was not given the proper information by the sales representative Rock. This was the first problem. I have also had the worst possible experience dealing with the financial customer service which apparently is located in Ohio, but on there e mails the contact info was for a Richmond Hill.  Upon asking about this and wanting to talk to someone directly at the Richmond Hill office I was told that they have zero affiliation with my financial services yet in there e mails this was the contact information; this makes no sense. The problem effected my family in a horrific manner to the point were police had to get involved. After getting told 5 different things through email and telephone conversations and spending hours on the phone trying to resolve this issue I was forced to go into bmw auto haus to get help. Upon speaking with one of the financial services employees she called the Ohio office for me to try and get answers. During the conversation she had the audacity to laugh and say we'll there's nothing I can do and proceeded to get angry with me. BMW had specifically told me that there was a glitch in there system and that it in term was there fault. Upon leaving there office I was told that nothing could be done. The employee I spoke with quote, \"sry but it's just because of these incompetent people this has happened, sry have a nice day\". I am starting a petition boycotting this dealership. If you would like to help I would really appreciate it. My email is clintonthomas2007@yahoo.com please feel free to contact me. I will be very active on proceeding with this.","useful":1,"funny":0,"cool":0},
{"review_id":"Zlr63YifAk5q-jjJvtXcdA","user_id":"FPf7zZ2za5DTuKLqLnNs2A","business_id":"ay6V-SfANiKOZvma7iZS0Q","stars":5,"date":"2015-10-19","text":"When I visit Las Vegas, I visit family, take care of some business, I golf and enjoy En Fuego Cigars & Lounge's EXCELLENT service, cigar selection in your friendly atmosphere.\nThanks Again Mike & En Fuego Cigars & Lounge.\nR.L. Sr -  San Diego, CA","useful":0,"funny":0,"cool":0},
{"review_id":"gIXs1dPBvUKYSvkLsfPGrQ","user_id":"xrZcObsfs-ZQ0h8Yzrajiw","business_id":"Kt4jEhVbVoEqCl1VsOqlfA","stars":5,"date":"2015-03-02","text":"Dr. Nichola Ray and her assistant (we apologize for not remembering her name) were very kind, compassionate, caring, and made this experience as peaceful as possible. They explained the process, sat down with us by Sara's side, and made sure we were comfortable before moving forward with the next step. \n\nThis was one of the hardest and saddest things we had to do, but with the service that Angel Vet provides it was far more peaceful than going to the regular vet. Being able to say our last good-byes to our sweet girl in her favorite spot in the yard (on a Sunday) was priceless. \n\nWords can't express how grateful we are for the in-home service you provide. We would highly recommend this service for anyone who faces this difficult situation.\n\nThank You, Angel Vet... ~ Tanya, Cliff & Maggie (Sara's sister)","useful":0,"funny":0,"cool":0},
{"review_id":"909ICXFbiq4cuiK1QaWkDg","user_id":"xrZcObsfs-ZQ0h8Yzrajiw","business_id":"o7QpLwjQQs4qDX6TCd50Ig","stars":5,"date":"2016-03-21","text":"What an awesome concept - healthy, affordable, and fast! I had the cobb salad with steak and seasonal blueberry rosemary lemonade, and my boyfriend had the BBQ ranch wrap with chicken on honey wheat tortilla and traditional lemonade. \n\nEverything was fresh and delicious, and the portions were big (my salad was dinner last night and lunch today). This is a much needed option for take-out after work, and they open early for a protein-packed breakfast and picking up lunch on the way to work. We'll be back often!","useful":0,"funny":0,"cool":0},
{"review_id":"-UkhLEOBADoSxDlBTUSojw","user_id":"xrZcObsfs-ZQ0h8Yzrajiw","business_id":"HGLMe4y0y_VsBkDLdpfBLA","stars":5,"date":"2014-05-31","text":"The rustic atmosphere was nice, the food and drinks were great, and the service was awesome. I don't usually order steak in burritos because the meat is tough, but their steak was so tender and absolutely delicious...I'm glad I took the waiter's recommendation and tried it.","useful":0,"funny":0,"cool":0},
{"review_id":"0AJBYI8F0g--gQZI8ZeAhA","user_id":"xrZcObsfs-ZQ0h8Yzrajiw","business_id":"2kwi5dUDwZ0t2M8scSXNYg","stars":5,"date":"2015-03-28","text":"I've been a patient for about 5 years and couldn't be happier. Dr. Reid and the entire staff is friendly and professional, and they always explain everything to my satisfaction. I'm always seen on time, and all the work I've had done is top notch. I've referred family members and would recommend Gateway to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"UzSFszOSMzEsVbW9cS01sA","user_id":"OySRTbbgYgURPtAJefAZew","business_id":"9-cVW8wSRoE6Nmnc7v0uUA","stars":5,"date":"2015-09-22","text":"First off: A-fucking-+++++++ to our server Janel.\n\nThe pantry's 24 hour service makes it the perfect place to get your fix, whether it's breakfast or dinner; all of the food is deliciously Vegas, yet still affordably priced.\n\nMy husband and I have eaten here on more than one occasion only to receive the same, consistent service that leaves us wanting to come back.\nWe've tried most of the menu so far as, usually ordering half in a sitting as our \"spoils\" meal- each bite is perfectly cooked and portioned as well as creatively presented to match it's homey atmosphere.\n\nOn this recent trip our server was Janel. She was extremely attentive. Extremely:\n1: We were able to receive happy hours prices just as they were ending with her help.\n\n2: She was friendly, bubbly and reached our table in a timely manner- never too much or too little, leaving all our requests met...\n\n3: even the last minute order change was not a problem for her to fix for us.\n\nIf you get the chance, check out the pantry.\nAnd if the wonderful Janel is working, make sure to request her- by all means.","useful":0,"funny":0,"cool":0},
{"review_id":"Zy16QW9XLbplqXVbPw6hgA","user_id":"yEO7uAcwtG8e4oXLzc8kwA","business_id":"rfnBbkXc0q234rkDmmDeNQ","stars":5,"date":"2010-03-26","text":"I had a fantastic experience at this salon.\n\nMy stylist is Shirley and I highly recommend her and Destination Manhattan. The salon is luxe and they sell Kerastase products. The stylists work in private rooms which is really nice, because it allows for great conversations! \n\nShirley spent 2.5 hours with me, really talking to me about my hair, what I like, what I don't like, what I need my hair to do for me and what I must avoid... I left with absolutely silky hair and products in hand to fit my needs. She is truly a master - she crafted my tangled split ends into a stunning and chic style that kept my length but improved my texture. I feel fantastic!","useful":6,"funny":0,"cool":0},
{"review_id":"2DnuauSsidtzar_AovrB_w","user_id":"yEO7uAcwtG8e4oXLzc8kwA","business_id":"0zgu-ktM767MGgo8DN20-w","stars":5,"date":"2015-08-23","text":"Laurie is so wonderful! She makes us feel so welcome. My niece looks forward to her time at \"the park\" so much. You have created an excellent and safe place for children and parents alike!","useful":0,"funny":0,"cool":0},
{"review_id":"rsFk3H3vfNxM1yXH8NKKJw","user_id":"yEO7uAcwtG8e4oXLzc8kwA","business_id":"dI0ZVsjLxWnfGJtsq9Y1Qg","stars":5,"date":"2015-11-08","text":"I had an exceptional experience with Dr. Fong and her staff. From my first conversation with Mitzy (Dr. Fong's front office) - I felt welcomed. This is an organized office that cares about their patients. I traveled from out of state to visit my parents and wanted to coordinate my consultation and treatment in one visit. Mitzy helped me make that happen. Dr. Fong is caring and lovely! She made the appropriate recommendations of treatment and products (without being pushy) and then I saw Brenda for my treatment. It was a great experience, my skin is absolutely glowing and I will be back. I cannot recommend Dr. Fong and her staff enough.","useful":0,"funny":0,"cool":1},
{"review_id":"MO2W9MNPy3aC12V0_sm5Kg","user_id":"yEO7uAcwtG8e4oXLzc8kwA","business_id":"otfjSc1SWe5L28VRTkuEFw","stars":5,"date":"2014-06-16","text":"Excellent care and grooming. I live in CA but my parents and animals live in Vegas and this is the animal hospital for people who love their pets as if they are family.","useful":0,"funny":0,"cool":0},
{"review_id":"sWYQXLHcEuVec07guYzlPQ","user_id":"yEO7uAcwtG8e4oXLzc8kwA","business_id":"6pM2YxQH8dQYs07_CH3Z6g","stars":5,"date":"2010-03-26","text":"Shopping at Chanel Wynn is for me, like coming home.\n\nI have amassed quite a collection from Chanel over the past few years and each one is dear to me.\n\nI love this store!","useful":0,"funny":1,"cool":0},
{"review_id":"oXOqcrffn173KFQ18-vEFA","user_id":"m2iR7zpUP6MaAzWbBdJTaw","business_id":"DZ87I3-8RsOr6B8XL3RiYA","stars":1,"date":"2015-10-26","text":"First off let me start off I have no problem with Dr. Tallant, he is a professional and I believe he will do my surgery but the first visit he had trouble, then the next I couldn't find someone to come with me because i was being put under because my father is doing hospice for his dying parents, cut to last week. Noel the front desk person is the most hateful, temperamental, and the worst attitude of any front desk person i have ever encountered. She cancelled my appointment because i couldn't get back because i had the flu and was downtown and didnt get he msg oil i got back and it was after 2 so she took it upon herself to cancel it so when i called she was locked and loaded to spew out nothing but bitter hateful rants, which ended in I'm hanging up the phone now. Who does this? Before this she said she would ask and get back to be considering the circumstances but didnt of course so I'm going to make my way down there to talk to the Dr himself. Because she is just a hateful lil' grinch. So I Would avoid this practice unless thhey find someone else because trust me she brings her issues to work and that is unprofessional and you have to deal with her to make an appointment.","useful":1,"funny":1,"cool":1},
{"review_id":"YrOwkcOusiTDqHub8YSdhQ","user_id":"m2iR7zpUP6MaAzWbBdJTaw","business_id":"lWDo5lDJNF9JABDSFHGk-A","stars":1,"date":"2015-10-26","text":"Horrible Dr., My doctor retired that i had been seeing for over a year or so, and well I have extreme anxiety and no insurance. Dr Greene was my Physician and well he was great, nice guy, very professional and hate that he retired because i was treated the way nobody should be a person who goes into the medical field to help, i take it Dr. ILHEM REMMOUCHE has no qualms in making patients suffer and changing their meds before seeing them and the meds i was on are  ones you cannot just quit, you have to taper down. She didnt care anyhow long story short Dr. Greene did care and stayed way past his retirement date and that shows he cared for his patients and it wasn't a paycheck. As for Dr. ILHEM REMMOUCHE i have never been treated and put in danger by a physician in my experience, she gave me 1 a day for a month instead the 4 i was prescribed and said she wasn't going to do much more anyhow, so i switched Drs immediately and found a compassionate Dr. at the MMG downtown. Her secretary is a joke as well good luck hearing back from her, don't know if she's stupid or just doesnt care. But i would avoid this practice at al costs. this past month I've lost 15 pounds, haven't slept and haven't been able to leave the apartment, thanks a lot Dr. ILHEM REMMOUCHE. I hope your career falls short very soon.","useful":3,"funny":0,"cool":0},
{"review_id":"-krwXAyZDOH75G4PQ1IQgg","user_id":"m2iR7zpUP6MaAzWbBdJTaw","business_id":"Ps2ruNKnYRppfeDe26ZnAA","stars":5,"date":"2016-11-11","text":"Thanks Jimmy for all your help! I know i was killing you... Anyways ive been going to Repo in its many incarnations over the past 25+ years and well Its always got that cool vibe, and jimmy knows what hes talking about! GO VISIT GET SOME MUSIC CHEAP!","useful":1,"funny":0,"cool":1},
{"review_id":"GOuOjrfs7RayKODiVBNGeA","user_id":"JsJC2IW8ziuw24XzFUhFRQ","business_id":"Phyz3Iu3OccH32Spvi_bPw","stars":5,"date":"2014-10-03","text":"I have two long haired Shepards, who hate going to the groomers,  but lilac did such a wonderful job with my dogs!! They are both excited to go back!! Thank you spaw!!","useful":0,"funny":0,"cool":1},
{"review_id":"IcdIlt6FUSNMzybyDRDGRw","user_id":"qI82UK0FRHFnkn0PT82FQQ","business_id":"gBl5fPgCxy25bgwlpxX-5w","stars":1,"date":"2016-02-05","text":"So I am a really patient person. I had an awful experience here and I want others to succeed in the workforce so I have some helpful suggestions for the owners of this establishment.\n1. Teach your employees customer service skills. I was not greeted or acknowledged when I came in the store. I was ignored. All you have to do is say, \"I will be right with you\". I watched this happen to many people. Maybe you could have customers take a number to stay organized.  The young man that helped me was nervous, had poor eye contact and didn't know how to interact with me. This is not his fault. It is his employers job to teach him these skills. There were at least 4-5 other disgruntled looking ladies, not helping or interacting with the customers either. It seems like a group problem.\nBe organized and work as a team, or at least pretend to be. I was told my service would take 5 minutes. I waited for 45-50min and observed this young man help multiple other costumers handled in the same way. What really upset me was I could see all the other ladies in the back not doing anything. Maybe they were working on other projects, but all I saw was lots of bathroom breaks and chatting. I think if you have people waiting you need to work as a team to get stuff done. I finally approached the desk, he looked at me and walked away. No \"I will be right with you\", nothing. They all looked at me and did nothing. I hate when you are paying for a service and they act like they are doing you a favor. He finally came back flustered, I think he thought I was going to yell at him and couldn't remember what my order was. It was waiting there. I don't know if he did it or one of the other ladies did it but no one thought to check to see if it was there and he wasn't told. \nSo in a nutshell, train your employees in customer service and come up with an organizational system. It would be nice if there was a nicer waiting area and better lighting. I feel like Americopy has a loyal customer base, treat them better. You could really benefit from some of these changes. I would love to come back and have a nice experience.","useful":1,"funny":0,"cool":0},
{"review_id":"WH2hkvagVI6HrW_FuhqzGg","user_id":"qI82UK0FRHFnkn0PT82FQQ","business_id":"puQ2WGO0L2KvKqNQCJYZRw","stars":5,"date":"2015-12-09","text":"Food is fantastic and very reasonably priced. So glad they opened one up in Tempe, much closer to where we live. Can't wait to go again.","useful":0,"funny":0,"cool":0},
{"review_id":"_RopasTMAhSwd6n2HdzznA","user_id":"qI82UK0FRHFnkn0PT82FQQ","business_id":"oLh-vOB3mXhX92kcxdjpOA","stars":5,"date":"2015-01-29","text":"I took two of my children to Dr Heffelfinger a few months ago. It was their first eye exam, so it was a new experience for them. Dr H and her staff were wonderful, thorough, and very competent. We have VSP and got both of our kids the glasses that they needed. The experience encouraged my kids to read more and have a more positive outlook on eye care and glasses in general. I will continue to go to Camelback Eye Care in the future.\n\nThank you Dr H!","useful":0,"funny":0,"cool":0},
{"review_id":"D8c0tgUn454XiacZM8sf5A","user_id":"AWCzRnqXFS0-4ncBjSXgaw","business_id":"Cp01l4XUjd-6x-6v4KiIEg","stars":3,"date":"2015-07-23","text":"The air conditioning in this restaurant was set so low that I got sick from eating here. Ordered a soup to warm me up but it never came. Some dishes were luke warm. Mentioned that the restaurant was too cold to the wait staff several times, they just smiled and went about their business. I think they may do this so you feel uncomfortable and leave quicker. Food was good though and it came quickly.","useful":0,"funny":0,"cool":0},
{"review_id":"_rX9VorW0TwZ4Lt6Ll58pA","user_id":"AWCzRnqXFS0-4ncBjSXgaw","business_id":"w761Gs5wswaiKRNq0IpA7w","stars":3,"date":"2015-07-27","text":"I said I like it hot, but don't kill me. I literally thought they forgot the spice even though I saw the guy put something on from a hot sauce bottle.","useful":0,"funny":0,"cool":0},
{"review_id":"5KwVrmBnr5pTWWRrUtwROQ","user_id":"AWCzRnqXFS0-4ncBjSXgaw","business_id":"U5XCBcTtiNyasdT3A2_V3A","stars":5,"date":"2015-08-03","text":"Amazing everything. I hope I can find something like this place in the gta. A true montreal staple.","useful":0,"funny":0,"cool":0},
{"review_id":"5UJpO_jZKsvSDTN_4oycaA","user_id":"KMbFfXaK29K4jcPP6dlk-g","business_id":"THsU2vYT1sYm9amz9d0e4A","stars":5,"date":"2013-04-17","text":"Jimmy's has the best happy hour. The owners are there a lot and actually talk to the customers.  The map in iPhone had the wrong address; they're actually on the NE corner of Gilbert and Pecos.","useful":0,"funny":0,"cool":0},
{"review_id":"MiWMVgn6OzHVMt-EnpVrXQ","user_id":"KMbFfXaK29K4jcPP6dlk-g","business_id":"zkYURkaFb1bOsh_qulIPnA","stars":5,"date":"2017-01-19","text":"Dr Boyse is great.  I had three fillings and felt no pain whatsoever.  He took the time to talk over everything that was going to happen and kept me very comfortable.","useful":0,"funny":0,"cool":0},
{"review_id":"Eu51x3rXq_JC7tINthUERQ","user_id":"xRpRPPmaWCWYZRC7vTDO2A","business_id":"Euu79b2o5k5RZReIuThBWg","stars":1,"date":"2015-01-19","text":"Would really like to review Fogon.  Unfortunately, we showed up at 7:45 on a Sunday night.  Seems like they close at 8, and will turn away people that show up before then.  I get it.  If you want to go home, that's fine. But set the closing time for when you want people to stop coming, not when you want to go home.\n\nCan't comment on the food, atmosphere, or drinks. We couldn't get served.","useful":0,"funny":0,"cool":0},
{"review_id":"W0EhYGrVBiXmgKN7fKIxNw","user_id":"ZfwF92tyS16EEKr4x5fhzg","business_id":"qGLEE1yA1bK0YdlGI-S39A","stars":4,"date":"2017-07-01","text":"Great place for dumplings and brisket noodles, we tried their wonton, dumplings, beef brisket, fish balls, and crispy fish skins....we love them all.  Wish we could live closer so we can eat there more often.","useful":0,"funny":0,"cool":0},
{"review_id":"TDciJ8oeDDx-_eSNZOi7ag","user_id":"ZfwF92tyS16EEKr4x5fhzg","business_id":"oWEFIvvt_kJCuk2V268XeQ","stars":1,"date":"2017-07-01","text":"Very poor service and the food quality is below standard....there were food stains on the plates, half dry up shrimp head on the table cloth and we were the first customer on that table.  My 7 yrs old son asked me why the shrimp rice roll taste weird, not like the ones we get in Markham.  We couldn't eat another bite of the pork dumplings because the pork taste funny; WILL NOT RETURN","useful":1,"funny":0,"cool":1},
{"review_id":"hl5z5EMyhchKlqUX6eLpBQ","user_id":"p7nn0c-qQmsb_-cqFEAtKA","business_id":"yMBCem_MQYWdK1Hdratz4w","stars":5,"date":"2015-11-07","text":"This is easily some of the best breakfast food I've ever had. It reminds me of a homemade and much better panera bread. And I really like panera. \n\nThe smell when you walk in is so good that it instantly lifts your spirits and puts a smile on your face. I think I was smiling the entire time I was in the restaurant. I ordered the endless French toast and couldn't be happier. I  just moved here from Michigan and I will be back at Neaders very very soon. \n\nExcellent friendly staff too!!","useful":1,"funny":1,"cool":1},
{"review_id":"MuBfK0EH8S0L9Xef9-_aRQ","user_id":"p7nn0c-qQmsb_-cqFEAtKA","business_id":"TrGBHqHVzJM5tk2C1D1ctQ","stars":5,"date":"2016-08-20","text":"With out question the GREATEST sandwich in the world. I travel to Las Vegas at least once a month for business and I come out of the way to eat here EVERY time. In the past few years I've lived in California, Michigan, and I currently live in Arizona. Simply nothing compares to this place. I've ordered the #16 every time this year. Hot turkey, cream cheese, bomb sauce, avocado, Dutch crunch bread.... The best\n\nI've never had anything else, but everyone I bring here orders something different and they love it too!","useful":4,"funny":0,"cool":0},
{"review_id":"UvMlxRm3L-rM_oDOe8qo5A","user_id":"p7nn0c-qQmsb_-cqFEAtKA","business_id":"7gHdVSAz_Dm1wS1ZImJSiQ","stars":5,"date":"2016-07-25","text":"I am huge sweets guy and Baked Bear is hands down one of the best. The idea is legendary and then they back it up with an amazing product. They could just serve ice cream cones and still be good! Seriously, that's how good this place. They could compete just on ice cream and then they have the idea of smooching it between a cookie and a brownie. 5 out 5 stars. Returning very soon.","useful":1,"funny":0,"cool":0},
{"review_id":"Gw1nXcZt-bfndiHZisU3YA","user_id":"p7nn0c-qQmsb_-cqFEAtKA","business_id":"nFR7dDedxRuBeZz_6Cdalg","stars":5,"date":"2015-11-07","text":"The happy hour specials and guac are amazing. I wish I could come everyday just for those 2 items.","useful":0,"funny":0,"cool":0},
{"review_id":"NkDw04ws-xUQjZiZJzR0kw","user_id":"hA0Zj3yITNWPeSmOwdH_uA","business_id":"k2Zr99LMNhkKWgJrTcWFpg","stars":5,"date":"2015-07-28","text":"I was pleasantly surprised when I visited the National Laser Institute in Scottsdale, AZ. I am considering to add these service to my full service salon. I decided to travel over 2,000 miles and was pleased to find a rare treasure. I was very impressed with the staff, they made me feel very welcomed and treated me like they knew me for a lifetime. Louis, the owner answered questions beyond my expectations. He was very knowledgable and very generous with his time. I certainly would recommended attending his school to anyone interested in anything that the National Laser Institute teaches.","useful":0,"funny":0,"cool":0},
{"review_id":"F1CB0C_4X0ifgyfUI_ugcQ","user_id":"oQOWgZBWtPE4nIxg1dSy7w","business_id":"Ou9RNq18vfbfL-7adJNA9A","stars":1,"date":"2017-03-08","text":"The worst KFC I ever been to! Good customer service is nonexistent. I asked for honey... no honey. So I spent 30 minutes trying to eat their dry ass biscuit. I asked for my cookie that I bought with my hard earned money. And they said,\" oh we don't have any cookies.\" They could've told me that when I ordered something that included a cookie! I'm surprised that they didn't tell me that I couldn't order chicken because their FUCKING CHICKEN MACHINE WAS DOWN! Trying to pull a fast like McDonald's with their ice cream machine. Shake my head at this establishment. If I could give them 0 stars, I would. Also, I almost forgot one of the workers walked out from behind the counter with a cigarette in his mouth. Who does that?","useful":0,"funny":0,"cool":0},
{"review_id":"ClZ8RKmAKkzmDL4gey7mwA","user_id":"oQOWgZBWtPE4nIxg1dSy7w","business_id":"XYGXPXL05I6y2ennYt0qsw","stars":1,"date":"2017-03-17","text":"First of all on the official Facebook page they say it's going to be $10 ... When we get there they start talking bout $20 this , $20 that! That's false advertising! This business is just mooching off their customers! That's unbelievable. Don't recommend going here.","useful":0,"funny":0,"cool":0},
{"review_id":"9WDZiJxu62yn4tPIiOsM7A","user_id":"oQOWgZBWtPE4nIxg1dSy7w","business_id":"tCkd8eAx2mR0oioQcqkxPw","stars":4,"date":"2017-03-06","text":"Burrito so fat makes your jaw cramp up just trying take a bite. Overall food was good, nice little joint, great music you can vibe to, great customer service. Only one\nproblem. The salsa is subpar so I had to a hard time getting through the breakfast burrito but the burrito was still good.","useful":1,"funny":0,"cool":0},
{"review_id":"ckJmF-9jJALU9JvHb--LTQ","user_id":"oQOWgZBWtPE4nIxg1dSy7w","business_id":"PF9lQNv6snmGOCaR9NZggw","stars":5,"date":"2016-10-22","text":"I took my mom here for a pedicure because I felt like it would be nice to treat her. Great customer service and their receptionist Julissa is a complete beauty! I now try to take my mom every weekend just so I can go see this receptionist. My mom's all for it! Ha!","useful":0,"funny":0,"cool":0},
{"review_id":"d8yv6l9dnCLGtyL07UbVWw","user_id":"-2pQjFRs-VFz_TLQejkugg","business_id":"akhMwlK3WO74eYFlw6f4oA","stars":4,"date":"2011-08-01","text":"Service was great.  Food was delicious.  Small place compared to Ihop overall a good experience and the food wasn't greasy like the reviews stated.  (5030 W McDowell Rd Phoenix, AZ 85035-3945)","useful":0,"funny":0,"cool":0},
{"review_id":"x_xhgwEeaczHq81tGsogDw","user_id":"bTA9E4pGWdHFEd-4oSmP0Q","business_id":"nx5BY5K5hPYFPr6hzlHPZA","stars":1,"date":"2016-02-17","text":"This place sucks. The first time I went the barbers were playing to much, one even went to the back to smoke some weed. I went this morning because it says they open at 9am no one showed up!!! I stayed till 9:12 then I took off, it's close to my house but I'll never go again. I'll waste my gas driving to a better barber shop.","useful":1,"funny":2,"cool":0},
{"review_id":"dX-PTGflTyZfcf0HjwB6ow","user_id":"b-bswRXsg9IUk5s0VlCZCg","business_id":"fja2EnaSxKu1D7uctMhw-w","stars":5,"date":"2015-06-05","text":"We had a group of 10 people, and we had great service the whole night. We had a variety of appetizers and sides, all good. I had the ny strip... excellent. And the donuts are hot and tasty!","useful":0,"funny":0,"cool":0},
{"review_id":"0niyASt83V5l-tdZ7bBnJA","user_id":"b-bswRXsg9IUk5s0VlCZCg","business_id":"iyeanZgAkpCSL4eHoqdhnw","stars":4,"date":"2015-06-05","text":"Great location, unique place, good food. I went for a conference, so I can't speak to the music.","useful":0,"funny":0,"cool":0},
{"review_id":"mTGPxFCAUcqxp4tS8oeLIw","user_id":"4BvFiidzZnbisXHxpoWsUw","business_id":"KiE81YHZCEdPPlmrXghgzA","stars":5,"date":"2012-06-10","text":"This place does an awesome job. Nails last a long time and very friendly!!","useful":0,"funny":0,"cool":0},
{"review_id":"eHEU8NbBR1eqwY85zE_DWg","user_id":"4BvFiidzZnbisXHxpoWsUw","business_id":"6Cl15LapBVhw4ZfBIeVJJA","stars":5,"date":"2014-08-23","text":"This was absolutely yummy! Service was great. Asked the server for suggestions because we wanted to try something traditional afghan and she suggested several items. I had the lamb shank and it was fall off the bone with tons of flavor! My husband had the beef and chicken keemah and it was just as good. Went with the hot egg plant dip as well as was not disappointed. Highly recommend. We will be back!","useful":1,"funny":0,"cool":1},
{"review_id":"fE8vU3fyaf-hjvJ_9kH_jw","user_id":"tXL8tOAdFyMKbDF4GEPpPA","business_id":"84RdNjDKXKzqZlSlT6G6PA","stars":5,"date":"2016-11-26","text":"Such an amazing spot! The manager truly goes above and beyond with the amazing customer service they provide. The vibe is chill, and is such a great place for a date, meeting or study sesh. The food is all home baked and the overall place just gives you a comfortable, relaxed vibe. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"hzkjFd46d3YYOoP4lt9SlQ","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"G_LtZnL66Iwama_7_FCLUQ","stars":2,"date":"2015-09-23","text":"Tried this place for restaurant week....not impressed. Had a larger party of about 12. Waiter tried to upsell to chefs choice menu and told us the rest. week option wasn't going to be that good. Honestly he was right.....the Brussels sprouts were horrific. Burnt, bitter and not edible. Changed to the salad which was good with ginger dressing. About an hour after our apps we were served our dinners....all but one of my gfs. We all were about finished with our dinners when she finally got hers. To say the least, service was ok. Food was a huge let down. Too expensive and so many places to eat in Charlotte to have such mediocre food.","useful":1,"funny":0,"cool":0},
{"review_id":"sJbBFESolb6EXScTQIFQ4g","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"wMiOsYLtgwbUoyV2DttqMg","stars":2,"date":"2017-01-06","text":"Thought this was a better location than going to Publix across the street but I was wrong. Store was extremely busy and there were about 4-5 employees behind the counter just walking back and forth not really doing anything. Publix employees seem to enjoy their job a little more...everyone looked miserable at this location. What should have been a 30 min trip turned into an hour. I had to ask to bag my own groceries bc the employee was so slow and didn't have any sense of urgency. I do enjoy their produce more but it's not worth the lack of customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"SX2n148TygygFBaXGp2GxA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"dPWHFb_sDduzcJdOZSqR5Q","stars":4,"date":"2015-03-21","text":"I have yet to be disappointed by this place. They have a sampler where it's 25 wings for I believe $18? We chose 5 diff flavors, and they have so many to chose from! Garlic lemon pepper was not our favorite...I'm a fan of honey bbq and ming sweet chili and we always go with medium for a little bit of heat but not too much. The wings are HUGE! If your in the area try em out!","useful":1,"funny":0,"cool":0},
{"review_id":"yuxKxsWJUY4QHMst5Keb7w","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"yWUBX9Pe6pzh1PjVj04UmQ","stars":4,"date":"2015-07-03","text":"Been here on multiple occasions and the food is pretty good. The burgers can be a little greasy and messy but they do have good flavor. I make my own salad and let me tell you it's great! I get a small and although it may look small it is plenty for me! The produce is always fresh and I add grilled chicken.....I would come back day in and day out for this this salad. Good atmosphere and service is always great!","useful":0,"funny":0,"cool":0},
{"review_id":"xpCch3VAHEj-8DO7BkMsZA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"DccXBfQGFMKK7oXqm_3vMg","stars":1,"date":"2015-10-18","text":"Sitting in line @2am. I get it. It's late. I get it people are drunk. But to make the entire line wait when a single car wants to sit there for 15 min......really? You are called \"fast food\". Idk about you but fast food in not considered fast when you wait in line for 20+ min. No apology....poor customer service. Even though you are a fast food chain I'm still taking the time to write a review.  Have a little more pride in what you do and how you serve the people paying your paychecks.","useful":2,"funny":2,"cool":0},
{"review_id":"EIQH35oK4rGypYoUB-GbEA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"biCO6zc-opMp-uJ6rkTENA","stars":4,"date":"2016-09-24","text":"In lieu of all the bad reviews, you should give this place a shot. I believe that you have to give restaurants the benefit of the doubt when they are brand new. There will be longer wait times and food prep will most def have some issues. That being said...we came today at 5pm in order to avoid rush dinner times. And it paid off! We only waited 15 min for our food. Got an order of small wings and did half and half....the spicy wings were pretty spicy in my opinion but the soy garlic were quite tasty. The wings were crispy and plump. Also ordered the Bulgogi sliders and they too had a lot of flavor, the slaw on top tasted similar to the spicy mayo they put on sushi. I did try to get a piece of the burger without the slaw and it had flavor on its own (think I'll try with the slaw on the side next time) The service was quick and easy checkout unlike so many of these negative reviews. So please give them a try.....I don't think they should be judged so harshly just starting out. Enjoy!!!","useful":0,"funny":0,"cool":0},
{"review_id":"Y3hMLLhZvn0Gp0_x1xCNaA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"E0HOsxXZ_o6ocemK57BoWA","stars":3,"date":"2015-03-13","text":"Firstly, this was my first visit. \n\nJust to reiterate.....service is well below par. With that being said the food is meh. It is neither good nor bad. My boyfriend and I were hungry so we tried one of the combo platters made for two. It had steak (salty, chewy, and overcooked), chicken (seasoning was minimal and it also was overcooked) and lastly pork (this was the best meat on the plate). It also included white rice which was ok and some plantains. I ordered the empanadas....one beef and one chicken. This was the highlight of the meal. Beef was better but I did enjoy both. Lastly, you are supposed to get bread with the meal....like many restaurants it comes before your meal. I asked once we received the main course and our waitress said that they were out. Probably something you disclose at the beginning of the meal. Well come to find out, they were not out. I'm sure she noticed my unhappiness with this news and came out a minute latter saying that they would have it right out. So basically she lied.....not sure how you go from being out to all of a sudden having some stashed in the back??? \n\nNeedless to say probably won't be coming back. If anything....I would order the $2 empanadas and call it a night.","useful":3,"funny":0,"cool":0},
{"review_id":"RB2nzLSE5CLiyZ80uRFBMw","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"ywkw13rZ9xIv1s3CibF-uQ","stars":5,"date":"2016-10-04","text":"This is my go-to cupcake spot. I have tried at least 6-7 diff places in Charlotte and none of them compare. Her cupcakes are moist and full of flavor! Some of them can be intense with so much chocolate but if you're a chocolate lover like me it's amazing :D Cake pops are delicious, I just can't get enough of this place!!! It's worth the drive from Charlotte, promise you won't be disappointed!","useful":1,"funny":0,"cool":1},
{"review_id":"pfKWHm5_tMm4yqU8VJ0IuQ","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"krlBwPboTImWFS1xwPr70Q","stars":2,"date":"2016-08-30","text":"For $10 a roll the sushi is soooo small! I've tried to give this place the benefit of the doubt but it's just not worth how expensive it is.","useful":0,"funny":0,"cool":0},
{"review_id":"pTochsW7cvAQnsf1m-vLTQ","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"5DO7X3JRMSBdOmI629RcuQ","stars":5,"date":"2014-02-06","text":"Recently I have had some issues with my car and there was no doubt in my mind where to take it.  Mike has always answered every question I have promptly which is obviously hard to get nowadays. Never have I been pushed towards additional services\/products. Every team member that I have had contact with has always been extremely friendly and speaks to me with respect and honesty. Thank you Eurowise for making my experiences easy, quick and worthwhile!!! As long as I'm residing in Charlotte I will keep coming here for my car needs =)","useful":0,"funny":0,"cool":0},
{"review_id":"MS_5bc0HXNIBWIu2h9ngzw","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"WItlLMrwWUbZhi7aSAzs2Q","stars":1,"date":"2016-02-28","text":"Came here on opening weekend and have been back several times and customer service still has not improved. Although Strike City or Park Lanes is more expensive I believe the experience as a whole is better.","useful":1,"funny":0,"cool":0},
{"review_id":"BznsWsKAQ9byZZZwF65OZg","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"ukRgd3mAcD_lHgCWlzicbA","stars":2,"date":"2015-12-01","text":"So I've bought furniture from them before and usually it's a good experience. **BUYER BEWARE** of items sold off of the floor.  I should have stayed to look at a rug we bought off of the floor before he folded it up but Ray our sales associate was really pushy to get us to grab the car. Needless to say he was a nice salesman but he knew that the color would be off where the furniture had been sitting on it and where all the traffic from buyers would be stepping on it. Usually when it's too good to be true it is! Orig. $399 and got it for $160.....but we'll see if we can steam clean it and get some of the stain out. So don't give RAY (Asian guy) your business.....we bought a $2500 sofa set as well and he could have at least tried not to dupe us into getting the measley few dollars more commission and told us the rug wasn't worth it. Cmon man....honest living...be good to your buyers that's how you get repeat business. Instead now I have to put you on blast for being dirty! Please take into acct what others have said. The customer service was great for the most part but when you spend $2500 and you can't even tell the buyer that a $160 rug off of the floor isn't worth it, you are scraping the bottoms of people's pockets to fill your own. So scummy","useful":3,"funny":0,"cool":0},
{"review_id":"vQnyzdHj1D0nWV0N3WnmBg","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"tCSlpwJQ4CZsUEMZeH2SFg","stars":4,"date":"2015-03-03","text":"BRUNCH! Such an incredible meal that I can't understand why everyone doesn't like it! Anyway, I adore this spot  it is located in a moderately busy shopping center and I have never had an issue with parking. Let's move on to the menu...\n\nCoffee: I love coffee, while I may be no expert I drink it in all forms: black, sugar\/cream, flavored. I understand that traditionally they do not offer flavored coffee but somehow I was able to get vanilla added once and it was very tasty. Was not disappointed. \n\nI am in love with the eggs Benedict on a croissant. While I only divulge in meals like this every once in awhile it is amazing. I don't really care for English muffins but a croissant.....mmm mmm mmm! The croque Monsieur and croque Madame are also very appetizing. \n\nThe service is always on par and I have never had a bad experience In that aspect. Never too long of a wait and a speedy checkout. I hope you get a chance to check this place out bc it does not disappoint!","useful":0,"funny":0,"cool":0},
{"review_id":"LhzNsPp_qH2_8tAU-GMCOg","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"lb2MImFlwSUtTkfBFg9kcg","stars":5,"date":"2016-02-26","text":"So after my unfortunate visit with Steele Creek Animal Hospital I took my little one here and had an AMAZING experience. Everyone from the front desk to the vet were extremely friendly and helpful. They hours make it easy to come after work and it is so convenient! Thanks for making our visit memorable and I will continue to bring my pup!","useful":0,"funny":0,"cool":0},
{"review_id":"0bTK8bJOhsoFibJsa-BD6Q","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"CMq8TvATky5jpCnKACmE0Q","stars":2,"date":"2015-08-14","text":"Hmmm where to begin....\n\n(They are now Abra Auto body and Glass)\n\nI got into an accident with a deer and this body shop was within the network my insurance would accept. It is extremely convenient to my home\/work so I figured I would try them out. Well, this was my mistake. I did not do any research, which is very unlike me, so please please please read this! \n\nTook the car in for an initial estimate, was told ~$2,000-2,500. I get it, they haven't taken the car apart to see everything that was wrong with it so more than likely it would be more. Was told the front bumper, headlight, radiator, air conditioning, and a few other things. I left that day to think over what I wanted to do and about a week or so went by and I decided to just take it to have everything fixed.\n\nYes I was told they could not give me a definitive date. I was ok with that. They proceeded to tell me that the adjustment to the initial estimate went up to $3,400. Ok, I was covered for the majority of this so I said ok. Come to find out when all was said and done that they had charged my insurance $6,200. I was never notified that there were additional costs and my insurance company was even quoted around $5,800 or somewhere close to that. Kind of shady.\n\nMoving along, this is where shit hits the fan! I brought my car in on July 9 and dropped it off at 7:30am. I was told I would get a call back that evening for an update. No call. I call back the next morning and they tell me that they haven't completely finished looking over my vehicle and I would get a call back by lunchtime......no call. I finally receive a call at 5pm to tell me that they have ordered the parts and they would arrive at the beginning of the following week. By Tuesday they call me to tell me that all the parts have arrived and hopefully I would get my car by the end of the week. No car. I spoke to Jacob and he told me that sometimes when they have other cars that they are trying to get out and are closer to being finished that they would need to stop working on my car and attend to them first (not something you tell a client FYI) Also, they told me my AC would not be covered...not what they initially quoted me. So, I patiently await, another week goes by,By this time it is now Friday, July 24. They call to let me know my car is available for pick-up. So my bf goes to pick it up for me, the radiator that they replaced is leaking......are you kidding me?!?! So the GM says that they need to fix the issue. I had called their corporate office that Friday evening bc I was so livid. I received a call back from Kevin Holmes (DM for Abra) the following week trying to rectify the situation. Initially they were trying to get me to pay for the part out of pocket at cost with no fee for labor ($650-750 I cant remember exactly) Absolutely not! After he talked to the GM and realized that they almost gave me a car back that was still broken, they offered to pay for the AC to be fixed. And yet another week goes by that my car has to stay in the shop for them to replace the radiator they already replaced and fix the AC issue.\n\nKevin Holmes was the only good thing that came from this situation. He took over the situation and became my point of contact. If I could give individual reviews I would give him 5 stars and the auto body shop a 2.5. When I came to pick up my car on August 4th (yes I said AUGUST) the gentleman (Dana) was not interested in anything but getting me out of there. I had to ask him his name as he did not introduce himself and neither ladies at the front desk greeted us. Customer service is what your business is based upon and there needs to be some serious makeovers at this location. \n\nSoooooooo, almost a month later I finally got my car and i waited a little while to see if anything would go wrong before writing this review. OH! Almost forgot, was sent multiple emails about taking a survey but when I tried to access them I was denied and it said link no longer exists.......how convenient...... \n\nHope this helps, I would not want ANYONE to go through what I did.","useful":3,"funny":0,"cool":0},
{"review_id":"CSjSkQbtgB2tUYazk8ug5w","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"cpoymNVg8jDEv8azrAg5gQ","stars":4,"date":"2015-03-14","text":"So I'm by no means an expert of Mediterranean food but this place was pretty good. It was my first visit last night with my bf. The restaurant is nothing special on the inside, very simply decorated but clean. \n\nService: great! We had a gentleman at first but then a young lady took over and she was very attentive and came by often enough to check on our drinks and to see if we had everything we needed. \n\nFood: My bf got the kabob plate which I can't remember what it was called but it included a beef,chicken,and some sort of sausage skewer. The sausage I thought was the best followed by the beef and chkn. Bf liked them all and simply loved his food! I had the chicken shawarma sandwich and it was light and filling. And just to add to all the other reviews....the fries really are good!! They are crispy and not greasy at all. Idk what they do but it's working!  We will be back for sure!","useful":2,"funny":0,"cool":0},
{"review_id":"5bQRAtFC_2TESo__Ml8QdA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"mQCT1psNh2pJT38ohSQDHA","stars":3,"date":"2017-09-06","text":"Have tried to give this place the benefit of the doubt but keep getting disappointed. I can't understand how the service is so slow when during a weekday evening, and it's every time we come. Tonight we came in and my fianc got the stir fry lo mein and it was ok, came out in a timely manner. I got the volcano roll....30 min in and $15 later the sushi falls apart. Seriously? For such expensive sushi it was not good. Save some money and go down the street to Masa, their sushi may not have fancy fish drawn on their plates but the service is far better and food is cheaper and better quality.","useful":0,"funny":0,"cool":0},
{"review_id":"e0cJmTzCmkp-mZctp3kpNg","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"ADgacmZ-qXrSOhMfU6bmTA","stars":2,"date":"2015-03-21","text":"This review is long overdue....I had heard so many great things about this place and was terribly disappointed. I came twice just to make sure it wasn't just a bad taste in my mouth (not a cheap place either) and both times were mediocre at best. Food...ok. For the price it was not worth it. Service....ok. We had a large party of about 16 and one server......step ur game up! It took forever to get drinks, if you're trying to make money the point is to serve your customers. Not keep them waiting and asking other servers who pass by to find you. It seems so many of these uppity restaurants where you will automatically get grated, they lack in so many areas. They are lucky that there is gratuity tacked on because for the experience in its entirety it was not worth.","useful":0,"funny":0,"cool":0},
{"review_id":"GIQe4pCOYaeLU7DMRvNZfw","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"LIvXzdMJrIb6IY5Y3tqicA","stars":2,"date":"2015-09-23","text":"Came here for restaurant week and was so disappointed. Got sat an hour after our reservation and the only reason I am giving it 2 stars is because they did a phenomenal job with trying to make sure we were taken care of. That being said the food was meh.....I have heard the same from a lot of ppl and told myself I would give it a try. The atmosphere is nice but I don't think it's worth the money food wise.","useful":0,"funny":0,"cool":0},
{"review_id":"0VV0Ksvm3TiD4OmEIUp1cA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"-_Ph_Y9mJWNdKqArDxp0lQ","stars":2,"date":"2015-07-01","text":"Where to begin......\n\nCame here tonight for the first time because my cousin was recommended by coworkers. There was no wait, which is great. Well, our waitress told us this was her first job waiting tables. And although she was not terrible it showed. It was a little awkward and I'm not a fan of someone who comes to the table constantly to ask if we are ok. \n\nOnto the food: \nApps.....chicken wings. Hmmmm I don't even know how to describe these. The dry rub was quite unique, not horrible but def not anything to rave about. We also had the pork belly sliders. This one item was the favorite of the evening. We opted to not have the pimento cheese on there and that was probably for the best. I'm not sure why but a lot of the items seemed to have pimento cheese.....\n \nSo I had the steak sandwich. Not a fan at all. There was too much going on. I actually had one item taken off of the sandwich and it was still too much. It was really messy and not enjoyable to eat. \nWe also had the roast turkey. Seemed dry to me but that's not really anything new with turkey. It came with hummus but we opted for it to be on the side. Honestly I don't think it would have added anything to the sandwich. In addition we tried the burger. Meh. The FF though were quite delicious. \n\nI will say that the menu is limited and seemed overly crowded somehow. Each dinner item had so many ingredients and none of it really drew me in. Maybe less is more?? For spending $75 it was one of the worse most expensive meals I've had in Charlotte. NoDa this is not what you needed nor do I think it will last. So disappointed......","useful":0,"funny":0,"cool":0},
{"review_id":"7ziDyY6gJCLBLYZvCBBY1w","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"sBrrWO-Nv7imsqU0e5504Q","stars":3,"date":"2016-10-01","text":"I love jimmy johns and was really excited when this location opened up, only to find out it didn't deliver to us (2 miles away :(....boo!) That wasn't really a big deal, the problem I have is that every time I go in there are only kids working and the music is blasting like I'm about to go to the club on a fri\/sat night. I wasn't greeted.....all 3 employees just looked at me and stared blankly. Customer service is a huge priority in my books as I've worked in this industry my whole life. Food is usually pretty good, especially at the Fort Mill location but both Italian nightclubs we got were drenched in oil & vinegar....neither my bf or I could finish them. Will continue to drive to the Ft. Mill location where their service is always on point!","useful":0,"funny":0,"cool":0},
{"review_id":"bDtWtNMBzqj-z9S3Vg0a1w","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"7crU-PqmFD9hrWRaeYLlpg","stars":4,"date":"2015-07-03","text":"So I have been here on a few occasions and well worth it. So much that I joined the wellness program. $59 for an hour massage monthly is a deal!! I had two separate massage therapists and both were wonderful. The only complaint I had was that when I got undressed the room was a little cold and the bed was not heated. I was relaxed fairly easily and soon forgot of the small chill factor. Well worth every penny and have enjoyed every experience so far!","useful":0,"funny":0,"cool":0},
{"review_id":"Abv5w-3lL7gF2tOmA05D5w","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"XRrcBOUE0DFmuHZgwkvjgQ","stars":4,"date":"2016-09-10","text":"Went here for breakfast this morning to check it out....cute decor! I had a vanilla latte and a mocha latte for my bf, both were delish! Pancakes were so cakey and sweet and the SEC was savory. Will def come back to try other items but so glad a good brunch joint has come to this side of town","useful":1,"funny":1,"cool":2},
{"review_id":"Cmku9JEBsSwOKyRjAbsHSA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"E3BTs8yFlVbZd20TknY00A","stars":2,"date":"2015-10-11","text":"Usually really good but tonight we ordered Togo and it was terrible. Seemed like the brisket and hot links were leftovers that had been sitting on the grill for awhile. Called in our order and told us it would be 10-15 min, came and waited another 15 min. Not only did it take longer but the food was underpar. My previous review raved about this place and we were regulars but there are too many other bbq places for such poor food quality.","useful":2,"funny":0,"cool":0},
{"review_id":"K0P6XWe9pxIB2fW5bvwtiw","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"0D6NKcLzVfQ3RcEPySmzDw","stars":3,"date":"2016-10-04","text":"I would give this place 3.5 if it was an option. I live right down the street and customer service is usually pretty good when we come in to eat. I will say that their chicken wing combo is so worth it. Their food is not the best buuuuut you get a lot for your money. $6-7 for a 6 wing combo with your choice of lo mein or rice (wings are always big!) but be weary bc they ask what kind of lo mein and if you chose it with meat they upcharge (which they don't tell you about) They ask like that's how the meal comes. Sushi is mediocre, which I find it to be at most of the places in the area. Nothing to brag about so I usually just get something simple bc I don't believe their $10-14 rolls are worth it. \n\nIf you're looking for something good but not great this is the place. Don't expect too much but it satisfies when you don't want to drive 20-30 min into clt for the better sushi spots.","useful":2,"funny":0,"cool":0},
{"review_id":"nZX8uu439fyUQRjAF7dw-g","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"QDsA_urDuKRVRFELmBMsBA","stars":1,"date":"2016-01-29","text":"So I switched to this Vet last year from Dilworth Animal Hospital and have not been satisfied. I moved over to this area and she went in for her vaccinations and for some reason they like to make you wait. Idk why......but last Dec. the same thing happened as last night to me. I took her in for a 6pm appt and sat there....for 30 min. Not one single other person was there. And outside of the room I could hear the vet talking to a tech about fitness...really? You're making me wait so you can chit chat about your workout routine? I can't understand why they make you wait around, like you don't have a life. Dilworth never made me wait more than 5-10 min and there was good reason, bc other animals were being seen. They had to call back twice just to get a tech to come up and get us only for us to wait another 20 min. Learn to treat your clients better. I had asked about this place and had gotten not so great reviews but decided since it was convenient I would allow them to see my pup. Well, save your time and money, I will be taking her to Veterinary Medical Center of Fort Mill tonight and a follow up review will ensue. Crossing my fingers they care that you are a paying client unlike this","useful":2,"funny":0,"cool":0},
{"review_id":"DHvK6NxFhzxiLD7MCXW1FA","user_id":"9U__mJx6LrcklZeENRwH6g","business_id":"Db3CfZWrtG33UZSs8Tdlsg","stars":3,"date":"2016-07-06","text":"Came here from $1 tacos and they were ok. I've been to the NoDa location and they were much better. The onions were chopped too big here and they seemed very rushed, the guac was not good at all. All I tasted were the big chunks of onions and some tang I guess which was from the juice or powder they use to make it. It was not blended well. They were busy bc it was taco Tuesday but I went to the NoDa location which was 4x as busy on a Tuesday and the tacos came out amazing! They also ran out of a salsa I asked for and it was about 7pm....the staff were really nice and I would return bc it is close to where I live but the quality needs to improve.","useful":1,"funny":0,"cool":0},
{"review_id":"0ic4crNqKlbhpM5XsSbqAg","user_id":"B-BaIT52ps5lSz0x0zghvg","business_id":"gyDTYm_NDWXEHBPGnL-oRQ","stars":4,"date":"2012-07-12","text":"In the world of fast food, this joint tops them all.  Fast food that tastes good, vegetarian friendly, with service.  They provide a good choice of healthy drinks and meals.  Diversity in the fast food world.  I love it.","useful":0,"funny":0,"cool":0},
{"review_id":"oxRqIXAxBnPDD9RjucOkgg","user_id":"B-BaIT52ps5lSz0x0zghvg","business_id":"WoNfkeivHzA--Tu79xO3IQ","stars":4,"date":"2012-07-12","text":"9 hole golf course is pretty neat and super convenient.  It is open late and lit up at night which is an interesting experience.  It can be hard to find your ball if you don't land near the green off the tee though.  Beginners probably would do better playing during the day to make ball hunting easier.  Otherwise still a great option to have.  Didn't do other activities, but people were out there having fun.  Overall atmosphere was good.","useful":0,"funny":0,"cool":0},
{"review_id":"JbtMk6-tbVtk1SyPfWHYeA","user_id":"B-BaIT52ps5lSz0x0zghvg","business_id":"3QGcupWVaYsFJyL1gDt6kA","stars":4,"date":"2012-07-12","text":"The service was great!  Bagels were fresh, and the atmosphere was very warm and friendly.  Good place to grab a bagel or beverage and relax.","useful":0,"funny":0,"cool":0},
{"review_id":"3LFCRJ3oIBJOMnuz_HcImg","user_id":"vn8gIQrpOF-MXiXUkVaFXw","business_id":"ViwjR6a_0Ytbk7MUnK19ag","stars":5,"date":"2015-07-02","text":"When we returned from being away our Air Conditioning was not working .   I read reviews on Yelp.  They were right on.  I called Air Supply, they said they would have someone out within 2 hours.  10 minutes later their representative Mike was ringing my doorbell.  He was courteous and quick.  Within 1\/2 hour he had our problem fixed and our air conditioning working!!!   He took the time to review with my husband and gave him some great tips.  The company's website statements are true and so are the Yelp reviews.  Air Supply will be our go to company and we will recommend our friends and family.","useful":1,"funny":0,"cool":0},
{"review_id":"5begz6129eYwMNP0TDRxyA","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"ZwV28fE5wjdZ5voFMsn80Q","stars":5,"date":"2012-02-18","text":"Just went back for our second visit this evening. If you go, you absolutely MUST get the Fattat Mozat -- it is one of the best dishes I have ever had. So much delicious flavour in one plate, it is amazing!","useful":2,"funny":0,"cool":1},
{"review_id":"AU5HrLYPo0HFQd5zK7vtsA","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"prr5pOED31nKWUfCHUvhrA","stars":5,"date":"2011-02-16","text":"Soy is truly an exceptional restaurant. We have been many times now and each time is an amazing meal and experience. I was most impressed by the quality of ingredients - everything from the chicken to the shrimps is quite possibly the best-tasting meat available. The service is excellent and they have a good list of wines.\n\nI highly recommend the dgustation menu, as well as the duck dumplings and garlic pan-roasted shrimp.","useful":2,"funny":0,"cool":3},
{"review_id":"rUXDyiTLo83GgDYbv3AC4A","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"vtEwge-BXI5DHTwYKgK25Q","stars":5,"date":"2011-08-17","text":"Latina provides a great mix of specialty imported goods and delicious Italian and French cuisine prepared in-house and ready to take home. They have a refrigerated section of ready-made dishes to take-and-bake, or just order something heated and ready from the deli section for lunch. A selection of local cheeses, meats, drinks and a fruits-vegetables section make this an excellent all-around grocery as well. Try the fresh pasta and I promise you won't be disappointed.","useful":4,"funny":0,"cool":3},
{"review_id":"KTULAQZIDRFp3ocvMBF2jw","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"A5IQhhf2c9i2PwVmj92WJQ","stars":5,"date":"2012-08-31","text":"Un seul mot: D-LI-CIEUX. Ces petits beignets sont vraiment incroyables, et oui, ils sont prpars  la commande. Il faut surtout les manger frais comme a. Leurs saveurs sont toutes parfaites avec la pte chaude et fondue. Et le prix ne pourrait pas tre mieux - environ 6$ pour une douzaine, c'est excellent. Chez Boris est vraiment un endroit  essayer si vous avez un \"dent sucre\" ... comme moi!","useful":2,"funny":0,"cool":3},
{"review_id":"v-4sBPI1x9oiOxCxg8fhdQ","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"TkNhGEsi7BOXk7LzDpbHVg","stars":4,"date":"2011-12-01","text":"Fou d'Ici is a new downtown picerie made to highlight the best in locally-produced foods -- hence the \"ici.\" With a wide selection of different foods from around the Montral area, Fou d'Ici has strong points in their selection of meats, cheeses and prt--manger items. The takeout looks perfectly suited for a tasty downtown lunch on-the-go, and the boucherie has delicious meat selections for any taste. They have delicious thick-cut bacon, as well as plenty of yummy choices already prepared -- there is a confit jarret d'agneau there that I am dying to try. There is also a full poissonnerie, a decent selection of cheeses, a boulangerie counter, and a large tea shelf with plenty of good blends. And, of course, the fruits and vegetables to provide the bases for your weekly cooking.\n\nWith so many tasty local items in store, Fou d'Ici does an excellent job of showing what the Montral region has to offer. It is perfect for the occasional lunch or snack, and well suited to be your weekly grocery stop as well. Give it a look, you won't be disappointed!","useful":4,"funny":1,"cool":4},
{"review_id":"5RzKmxTSV0cP3I2dbXvIuA","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"Ta_dXR8lmacl3HKXKKj1sA","stars":4,"date":"2011-08-17","text":"A great selection of organic groceries, fresh vegetables, plenty of meat, dairy and beverages. Also has an extensive selection of organic\/'ethical' cleaning supplies, soaps, shampoos and makeup. Stocks local products like Charlevoix meats and Dieu du Ciel beers. Features some brands of things like cider and cookies I just can't find at many other places. The health supplies can be a little pricey (like everywhere else) but the food is often cheaper than organics at other Mile End groceries.","useful":5,"funny":0,"cool":2},
{"review_id":"SPQin8Ou6gFxt4DPxoRssQ","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"gmeX6sxracW4ZLLik7hWtQ","stars":5,"date":"2012-08-31","text":"Les coupes de cheveux qui sont toujours excellentes et  bon prix. Je suis all chez MonoKrome plusieures fois et tout ce qui concerne l'exprience, le personnel consciencieux et respectueux, et l'atmosphre dcontract du salon, tout a t merveilleux  chaque fois. Je recommande fortement Marek et son quipe!","useful":3,"funny":0,"cool":1},
{"review_id":"a4-hayo-4K7M47ZliDBvoA","user_id":"NDiOGtCCSdWBwVCp7p8fBA","business_id":"ml_Fo07EBZQ8uSSnvkZb3A","stars":4,"date":"2011-08-17","text":"It's every bit as great as the 'hype' would indicate. From les accras de morue to the authentic chorizo (!) to the delicious cheese plates, this place delivers great French tapas-style cuisine that won't break the bank. It's look is typical of trendy Plateau restaurants but laid-back enough to have some wine, check some choices off the menu and enjoy yourself.","useful":2,"funny":0,"cool":0},
{"review_id":"oifdk17A-MQvDBr1Q4ljNA","user_id":"tAs8oo0XEUhSosu33p-PPA","business_id":"zdE82PiD6wquvjYLyhOJNA","stars":5,"date":"2013-07-03","text":"All the food here is excellent, but be sure to order off the fusion menu to experience a unique blending of flavor crystals.\n\nThe lettuce wrapped fish tacos with kimchi are excellent paleo fare.\n\nExcellent prices, quality service. Tip heavy my friends.","useful":1,"funny":0,"cool":0},
{"review_id":"HA7uy-0lDt9e-GwSfFznyw","user_id":"tAs8oo0XEUhSosu33p-PPA","business_id":"DbEszO3wk1xVmN3pCPob2g","stars":5,"date":"2014-08-16","text":"This is the place for breakfast and brunch slash comfort food. Every week they have a unique flavor of potted bread which is offered as a side to most entrees.  I like the omelette selection.  The wait staff is attentive and very nice. At peak hours there's usually a short 15-30min wait for a table. I like to burn time at Dead Poets Used Bookstore also located in the same strip mall.","useful":0,"funny":0,"cool":0},
{"review_id":"qq9MD6Qm0DvFD09fq7rpTw","user_id":"uwH-Xes5lXGd4J_voJhWbA","business_id":"UDucqwO8PwUOwcmUsJ-gOA","stars":2,"date":"2013-05-12","text":"Based on reviews I thought the food would be excellent both in flavor and quality. We had carne asada tacos and there was almost no flavor at all. Plus, two of the tacos had big pieces of gristle that were unedible.","useful":0,"funny":1,"cool":0},
{"review_id":"Ulf3-ORIATVxyhEDQV0klA","user_id":"suSXX5r9X5VchQ0oa4Xpeg","business_id":"XfUg7AJJliNGNFseki2y3Q","stars":5,"date":"2015-06-07","text":"I came here last night and received the best service.  Everyone was very welcoming and answered all of my questions.  Eddie is an amazing artist.  He listened and suggested some great ideas.  He is just the sweetest guy and I couldn't have asked for a better experience.  The next time I'm in Vegas I will definitely make sure to visit Eddie for some more work!  Go get some zen in that beautiful garden Eddie!!","useful":2,"funny":0,"cool":0},
{"review_id":"3xwJwGtG-49nm0LPohPgsQ","user_id":"g7Ahy9OAMwizG2xnYXHJMQ","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":5,"date":"2017-06-26","text":"Everything we ordered was delicious - bacon & avocado omelet and carrot cake toast for breakfast,  chicken skillet meal and gumbalaya for a take out. And the banana nut muffin was delicious! Our server Karla was so helpful and pleasant. She hooked us up with an extra muffin for our hikes that we were doing later. And so thoughtful about packing our to go meals. We'll definitely come back for their delicious food and excellent service by Karla!","useful":0,"funny":0,"cool":0},
{"review_id":"kf4W6E0xEySFkVdgJk8H2Q","user_id":"qLdZBik_FYu_bWkxWRq6Zw","business_id":"IX8HB9zCZzmgWabMeC0ZEg","stars":2,"date":"2015-10-21","text":"We waited in three lines before we got our car that was not the one we reserved. WE waited approx. 3\/4 hour to get car. Then we waited to get car another 20 mins. We had to wait for the any compact car to come in. Then we had to wait in car to get out of the place (they had to see the reservation and had to scan in the car). We wanted a car with cruise controll which it didn't have. To rent the car for two day it costs us $174.00 with insurance\/fees. The rental of the car for 2 days was $39.98, the rest was insurance and fees.\nOn the bright side the employees we encountered here and Oakland, Ca were wonderful which made the experience better.","useful":0,"funny":0,"cool":0},
{"review_id":"EvXzWJKIsdacYEIwneo8tA","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"oZHbPhIj01_31jqD053a_Q","stars":3,"date":"2017-09-04","text":"I read so many 5 star reviews and many of our friends recommended Europea, so we had great expectations. The decor is very beautiful and our service was excellent. \n\nWe started with the champagne duo which was a 2006 Dom and a Krug for $90. The Dom was great but similar to many other champagnes like Louis Roderer, Perrier jouet, etc. the Krug was outstanding! We loved it and it was the first Krug we've ever had. \n\nWe both opted for the larger tasting menu. We also did one premium wine pairing and one divine. The amuse bouches were good but not great. Out of all the items we had, the only things that really stood out were the fois grais and the Krug. Everything else was just ok. \n\nAnother gripe was toward the end they decided to 'downgrade' my champagne from Krug to Laurient Perrier and 'upgrade' my boyfriends so that we would have the same champagne. The Krug was exceptionally better so we wish they would have left the original pairing. Also, we asked to revisit the Krug at the end and the waitress had to go check to see. They did it for us, but you would think after spending $1000 for the bill for 2 people that would be no problem!\n\nMaybe it's because we went to Joe Beef the night before and every single dish we had was mind blowing and the wine was fabulous for 1\/3 of what we paid here, but we would not return anytime soon. It is a fun dining experience and I would recommend it for a special occasion, but I am more about the quality of the food and wine above all else.","useful":2,"funny":0,"cool":0},
{"review_id":"M58Ex6qPsU9K2Fcpoms0aQ","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"f9sU31meK0bqAD7922sCog","stars":5,"date":"2017-05-02","text":"We first visited Sage a few years ago on Valentine's Day. The Chef's tasting menu with wine pairings was fantastic! We were so impressed by the excellent food, five star service, and interesting (and hard to find) wines! We had to come back!\n\nWe visited Sage again this past Friday. The hostess seated us right away, and we were greeted within moments by Marcus, our waiter. Marcus not only had an amazing, professional, calm, and cool personality - he paid attention to things that compare to a three Michelin star restaurant. He made some great food recommendations and when we told him we were interested in some of their wines, he sought Christina, the sommelier to our table. Christina and Marcus worked in sync together to perfectly pair our foods and wines. We had the oysters, slow poached farm egg, Parmesan bacon ravioli, gem salad, spring pea soup, Maine day boat scallops, veal cheeks, ginger cake, and chocolate torte (in order). We had about 6 wines total (we spilt them so we could sample more) and every one was perfectly paired with our feast. \n\nOur water glasses were never empty and Christina and Marcus made us feel special and well taken care of. At one point, one of the bussers removed one of the appetizer plates before we were finished and Marcus appeared like a ninja with a new plate and said 'I am so sorry about that.'  Seriously - what other waiter would notice something like that?! It's the fine details that impressed us. \n\nOverall, we feel Sage is one of the best restaurants for both food and service in Las Vegas. I am so happy we revisited this lovely establishment, and I look forward to our next visit!","useful":1,"funny":0,"cool":1},
{"review_id":"sRgyDC7bdbj4BlU5b6hkYQ","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"vZLAmpN-hTI3GCT9hlHVUA","stars":4,"date":"2016-02-14","text":"Fantastic service. The decor is also very unique and interesting. There is a lot of attention to detail. The food is also very good. It is expensive, though. \n\nWe loved the complimentary goodies like Parmesan cheese, bread basket, pickled cauliflower, and salami. \n\nThe octopus appetizer is great. We shared the veal Parmesan and spicy vodka rigatoni and both were good. \n\nWe had a glass of Leviathan and the Barolo. Both were good. \n\nWe finished with espresso and complimentary lemoncello. \n\nWe did not care for the music - the 50s\/60s music seemed out of place with the ambience. A little too loud and upbeat. \n\nOverall a great experience, although a bit expensive.","useful":2,"funny":2,"cool":1},
{"review_id":"NHtYjl3zeCSNsWDgd00G_w","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"mmazCP1ZH0QsUqDS6OivFA","stars":5,"date":"2017-09-03","text":"We made a reservation for 9:45pm and we were seated immediately. Isabel was our server and she was amazing! She went through the entire menu with us and also helped us select a fabulous bottle of wine. We started with the grilled calamari, fresh mozzarella, and rabbit tourine. All incredible. We had a 2010 Pinot Noir (movia modri) from Slovenia. It was so interesting- not like an American Pinot at all. Earthy, leathery and tannins. Excellent selection. We also had the poached halibut in olive oil and the lobster spaghetti (best pasta dish I've had since visiting Italy!). We ended with the cornbread cake topped with corn ice cream and also the oatmeal cookie with raisin sorbet. An outstanding first meal in Montreal! We love this place!","useful":0,"funny":0,"cool":0},
{"review_id":"uaG3g1RpXMMwrsC4K3jEtQ","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"OtGSQQzV7uF8XPAsNIh7Bw","stars":5,"date":"2016-05-09","text":"We first dined at Elements about a year ago. Denise was our server. She was one of the best servers we have ever had at any restaurant! She is amazing. We had the pork chop and filet - both 5\/5 stars. Both were delicious and perfectly prepared. \n\nWe dined with Elements again tonight to celebrate my boyfriend's birthday. Everything was amazing as usual. We were fortunate to have Denise again, who is one of the best servers we have ever had (and we had dined at many placed in the world). She was prompt, friendly, accommodating, and one of the best servers we have ever experienced! The foie gras was out of this world, and the bison carpaccio was light, tasty, and flavorful. The opah was fresh and delicate, and the lobster udon was incredible. Beau is a fantastic chef - we are more impressed by his food than many of our other restaurants that we frequent. Beau and Denise are the best!","useful":2,"funny":0,"cool":0},
{"review_id":"xGPpZkDE9bj3B6nNq6b-Ng","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"ztP466jMUMtqLwwHqXbk9w","stars":5,"date":"2016-04-14","text":"Christopher took excellent care of our party of 10! He was friendly, efficient and personable. The food was good but the service was spectacular. He needs a raise immediately!","useful":1,"funny":0,"cool":0},
{"review_id":"HIhxD2-5-PMy1SoLJ6h4VA","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"zMGhQqA1Hho808BuQr9I6A","stars":5,"date":"2015-11-14","text":"What a great spa! The entire experience was pleasant - I booked the $99 massage and facial combo online and Rob called me within 20 minutes to confirm the date and time, and he made sure to give me proper directions. \n\nWhen I arrived at 9am, Rob greeted me, and I was quickly whisked away by Karina, who performed my facial. She was excellent. I agree with other Yelpers, who note that while the mask is setting, Karina gives you a wonderful scalp massage instead of leaving the room for 20 minutes. It's special attention to detail that makes this place special. After my facial, I got to stay in the same room and enjoy my one hour massage. Everything was great!\n\nI will definitely return when I am back in the Phoenix area. You won't be able to find a deal like this, along with great service, in most places. Great job Mozaik!","useful":6,"funny":0,"cool":2},
{"review_id":"uEEdttBGcUZudHGHzXDbKw","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"Er8DpPwf_lHHv64ncWhD8g","stars":4,"date":"2016-02-14","text":"Food was good. Wine was good. Ambience was good but we did not care for the loud and up beat 50s\/60s music. \n\nThe octopus appetizer is great. We split the veal Parmesan and the spicy vodka rigatoni. Both were good. We had a glass of leviathan and Barolo. \n\nIt is a bit expensive, in my opinion for what you get. \n\nOverall a great experience.","useful":2,"funny":2,"cool":1},
{"review_id":"Q4ljRw8361wOVsRkQdqMgA","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"IsoLzudHC50oJLiEWpwV-w","stars":5,"date":"2015-09-26","text":"We have been here many times and we have always had great service and great food! Today we met the manager Chris and his service was phenomenal. We are so happy we found this place and frequent it on the weekends. Favorite dishes: Howie burger, Santa Fe baked eggs, short rib hash, and blueberry pie! Awesome place!","useful":2,"funny":0,"cool":1},
{"review_id":"eWqOArw9_H5GXF4vaneoFw","user_id":"8NL04B7pa7iXTai-QZqYGg","business_id":"Ap17p-tA4Ipzy1s35DfCfg","stars":4,"date":"2015-11-15","text":"A very trendy and cool place to come with friends or with a date. \n\nPros: amazing selection of oysters. We love oysters and I'll honestly say these are extremely high quality and tasty. We tried all of the oysters that were available. I'll definitely try the crab claws and shrimp from the raw bar next visit. \n\nCoffee and pistachio gelato were great. \n\nGood selection of cocktails, wines, and bubbles. We have the Vouvrey brut and it was pretty good. \n\nAmbience is great - awesome decor and interior and lighting. I personally like the fact that it is very dark inside - gives it more of a mysterious and romantic vibe. \n\nCons: the main dishes we tried were good but not great. We had the Brussels sprouts (pretty good with the goat cheese dip), the trout which was so-so, the crab cakes were ok (not worth the price), and the scallops were a little bit too charred so the burnt flavor took over. \n\nInside is very loud, especially toward the bar, so you have to speak loudly to hear anyone in your group. I am not a fan of this, but what can you expect when the restaurant is packed?\n\nOverall a good place and we will definitely return for the raw bar items which were amazing.","useful":2,"funny":1,"cool":2},
{"review_id":"NqunqYV0Uq9uJeTYHzCtWQ","user_id":"JMzi2TDEmWOHgkJ3XtY6Uw","business_id":"OfLdWSqZ4HM_-B5khUtS8w","stars":5,"date":"2014-11-25","text":"We were in a late meeting and needed to order lunch for delivery. We called and the woman was super friendly. Ordered the chicken shawerma plate. The chicken and rice had tons of flavor. The garlic sauce is fresh and adds to the flavor without overpowering the chicken flavor. The delivery guy was super sweet!","useful":0,"funny":0,"cool":0},
{"review_id":"aoC-k39o52HqF9TNJnsDnA","user_id":"Oak_tXlYKdc-6oy9FjA_dg","business_id":"hgo0jDweUcHMHqNDnQQm9A","stars":1,"date":"2017-07-06","text":"Disappointed in our meal. The Chimichanga was not fried, just oil soaked tortilla covered with canned enchilada sauce. The salsa for the chips was fermented. It tingled on the tongue. Far overpriced for not so good quality.","useful":1,"funny":0,"cool":0},
{"review_id":"b7fkRpxa0_v3XdyyD9dPZA","user_id":"liamfPvCFMS1-tpjT22tQA","business_id":"Ocq3pio5JGNKEGqzjAhkbQ","stars":2,"date":"2014-03-14","text":"my chili cheese dog was cold. the hot dog itself. the chili, everything.  had mozzerella sticks they were hot. they were good.  but i was there for the hotdog and dont think i will be back.","useful":2,"funny":1,"cool":1},
{"review_id":"uQejm1hgooEIaRcvRhmXNg","user_id":"liamfPvCFMS1-tpjT22tQA","business_id":"dAVgrmzqBfn85zTgDP1UgQ","stars":5,"date":"2015-07-06","text":"had the pulled pork sandwich...was awesome. the coleslaw was great.   a friend was eating the cheesecake...stole a bite...that was very creamy was very happy...food was all great.","useful":0,"funny":0,"cool":0},
{"review_id":"Hl1xn4bJ-lGcLSGD0m5uuA","user_id":"liamfPvCFMS1-tpjT22tQA","business_id":"rTy6IWS8DCuxcBuALE-Rcw","stars":2,"date":"2016-07-06","text":"very disappointed.  I did a preorder to arrive at 1:00pm.  have done this before and was on time and  food was hot. I live less than 1\/2 mile away.  when I called the woman at the shop, she didn't even have my name or record of my order.  they showed up 20 min late while I was on the phone with the shop,  food was cold. the chicken poppers, on top of being cold, were missing the cheese sauce I ordered with it.  overall not worth it  especially if I am paying for delivery and a tip up front.","useful":0,"funny":0,"cool":0},
{"review_id":"2Kp9dToZs4sy0u4bkfSVzg","user_id":"liamfPvCFMS1-tpjT22tQA","business_id":"8cQc0BRbkSDSkLn6oFw3mw","stars":5,"date":"2016-07-06","text":"had breakfast Friday, was great. could not believe I cleaned my plate. that never happens.  new location is beautiful and huge. no waiting and much brighter and more open. very happy.","useful":1,"funny":0,"cool":0},
{"review_id":"K8bztrpM2jNIFqeGTQ4UuA","user_id":"NrHIf3HMm8l27TS2abNV6A","business_id":"bSY97kgQpJ5BrpgW40V1qg","stars":5,"date":"2007-07-20","text":"WTF!!! this is in Circus Circus? Looks like Frank and the rat pack left something behind.. This place is simply amazing. The best steaks, the best atmosphere, and the greatest service. Try it, you will fall in love.  Just be sure to step over the little peple when going!","useful":2,"funny":1,"cool":2},
{"review_id":"lwwg5V_4Ur-vUEaxBUMMng","user_id":"NrHIf3HMm8l27TS2abNV6A","business_id":"Sovgwq-E-n6wLqNh3X_rXg","stars":2,"date":"2007-07-20","text":"UPDATE UPDATE UPDATE:\nSince I worte my last review of thi splace, I hace since gone back. I went this past Labor day weekend for lunch. I am so very very disappointed. The menu prices have gone up so much. Lunch and dinner used to be a decent price, now they have gone up nearly 2 bucks for each entree. They also used to include a small bowl of soup with lunch, now it is 4.95 for it!!!! On top of all this, they provide only ONE refill of your beverage at lunch. So sad that the owners seem to have gotten very greedy and began to overprice. Despite this being one of my favorite Mexican resturants of all time, the price, quality and greed will not allow me to go back. I will look for something new.\n\nYou may never find another Mexican food resturant like this. WOW WOW WOW!!!!!  The food, awsome, the service, awsome, the price, awsome.  This family has done so well, and knows how to treat a customer!","useful":0,"funny":0,"cool":1},
{"review_id":"yJe9mEQw0ymHrFBL_RGWAw","user_id":"aEJbDJy-F_kVidTlfvfF-Q","business_id":"RESDUcs7fIiihp38-d6_6g","stars":4,"date":"2013-08-15","text":"Oh my! I do not regret coming here! Without a doubt the best buffet in Vegas. I had the buffet of buffets deal and tried a few buffets. This one is the best! The food is top notch. my favorite were the hamburger sliders and the ambience is amazing! Thumbs up!","useful":2,"funny":0,"cool":1},
{"review_id":"uSsCwvGDo1bNbWOuIhxNpQ","user_id":"aEJbDJy-F_kVidTlfvfF-Q","business_id":"MpmFFw0GE_2iRFPdsRpJbA","stars":4,"date":"2012-03-15","text":"The classiest and most amazing club I've ever been to hands down! An experience. The outdoors and indoor dance floors are very spacious! Will def go back again :)","useful":3,"funny":1,"cool":2},
{"review_id":"vwp4vRMjMWZ2NN1pRhDjwA","user_id":"pvP5ZcRtrycGx5b6RmWFdA","business_id":"ZYof0WYlilJ3pgWNSgmYKQ","stars":1,"date":"2016-05-13","text":"Felt like walked onto the set of \"It's Always Sunny\" at this bar.  Bartender was so rude.  I don't get how this bar stays in business.  It was a Thursday night with two other groups at the bar.  Takes her five minutes to come up and take our order and seems pissed while even doing that.  Then after we're finished our beer she just does not bother coming back around because she was too busy chatting to one group sitting at the bar.  I would understand if it was busy but the bar was nearly empty.  All around terrible customer service.  Will not be returning here, way too many other great bars.  I want to give it more stars because the Buffalo chicken pizza was really good!  So if you are going for the food, thumbs up, but I can't get past how rude the staff is.","useful":2,"funny":2,"cool":0},
{"review_id":"hX7bX7eWwkQgBkoQfIElkw","user_id":"pvP5ZcRtrycGx5b6RmWFdA","business_id":"BCAw9a_kyx2RddRH9tMmKQ","stars":5,"date":"2015-05-20","text":"I think people need to not go to this place expecting a top notch restaurant, not a fair comparison.  It's a decent place for a hangover breakfast, has a diner atmosphere.  I had the omelette the first morning and the rehab burrito the second morning.  Can't complain, was decent and a good price for Vegas.  Also, first day had an awesome server next day not so much but still wasn't bad.","useful":1,"funny":0,"cool":0},
{"review_id":"SLBCKP68Xvwct9NHlrP1zA","user_id":"pvP5ZcRtrycGx5b6RmWFdA","business_id":"cEEoMcZnRO5bO_H3AjFQZg","stars":1,"date":"2015-05-20","text":"Got a pedicure and manicure here, was $144 bucks all in, a little ridiculous if you ask me for what it is and further, my manicure is already chipping!!  I even had the gel added, I'm sorry, for 144 bucks it should not be chipping six days after I got it!!  Not just a minor chip, but completely peeling.  Skip this place for mani and pedis unless you enjoy being price gouged for shoddy work.","useful":0,"funny":0,"cool":0},
{"review_id":"mVgbjejJ-yr1GjRv_Z3gqw","user_id":"1Pd_8E2QMt39dH9Wd7OxiQ","business_id":"a50NCNUXq3o8DpveZxI1XQ","stars":5,"date":"2013-12-11","text":"I had my vision of we of what my website would look like. Anthony and Jen understood what I was aiming at. And hit the nail on the head! I could have not asked for a better website. During the build of our website they communicated with us to make sure we would be happy with it and after our site was done. They took the time to show me how the use and update our site. They made me feel like family and not just another client. Kudos to the team at Las Vegas Web Development and Design!!","useful":32,"funny":9,"cool":29},
{"review_id":"zPVUAIvQxuR2oTW7jU1dQA","user_id":"1Pd_8E2QMt39dH9Wd7OxiQ","business_id":"4yDzhf-Ap7RSr9slOYZgrA","stars":5,"date":"2014-08-04","text":"Very nice vape shop.. great selection of juice as well as their own line of Zen juice. Will definitely come again.","useful":1,"funny":1,"cool":2},
{"review_id":"dP8IpwmxbZ5uZCum3pylsA","user_id":"Bdz1mA2otGvyHBPrbFXy1A","business_id":"fS9a8AGrcwWPf_9vfn5wPQ","stars":5,"date":"2015-06-16","text":"Love this place. I recommend the bang bang shrimp and flank steak.  Comes with mini pho soup and salad.","useful":0,"funny":0,"cool":0},
{"review_id":"5GRrE7tLDyxolLOTH25QQg","user_id":"Bdz1mA2otGvyHBPrbFXy1A","business_id":"YrYJorbQyL-btu2wauLvFg","stars":5,"date":"2016-09-16","text":"Ask for Nicholas at autonatuon on i17 and Bell.  He takes great care of if me and my JK.","useful":0,"funny":0,"cool":0},
{"review_id":"VQl0D1pez_a8PWiq1lis-g","user_id":"Bdz1mA2otGvyHBPrbFXy1A","business_id":"NXoGguzSd3DrsaGRIQXLpg","stars":1,"date":"2015-06-15","text":"My 1 year old American Pit injured his rear left leg.  The swelling and pain was so bad that I had to take him to a vet.  The vet we went to was Deer Creek Animal Hospital.  \n\nI came there to get answers, solutions and remedy for my little pup. What I got was confusion, no answers, no solutions and a $350 vet bill for X-rays. \n\nSo for $350, all I got a recommendation to another vet, whom did a phenomenal job and was able to properly diagnose, treat and provided a a solution.   \n\nDeer creek animal hospital did nothing for me and my pup. I am extremely disappointed and felt like I was robbed in plain sight.  \n\nI do not recommend this place to get any sort of treatment.  But if your looking to pay $350 for just a recommendation to another vet then this is the place.","useful":11,"funny":3,"cool":0},
{"review_id":"sC5A3IwssiichmfUU6Jehg","user_id":"Bdz1mA2otGvyHBPrbFXy1A","business_id":"2UHtvx1hSbp9R06bCBTgUA","stars":5,"date":"2017-04-11","text":"AZ Best Barber hands down.  Issac is straight up OCD when it comes to cuts.  Thats the type of character you look for in a barber who loves his craft.","useful":0,"funny":0,"cool":0},
{"review_id":"GsUeA-_-CQK4FbDmfOTMkQ","user_id":"Bdz1mA2otGvyHBPrbFXy1A","business_id":"iZMdwe0xebE3rF0x3LOr4w","stars":5,"date":"2015-01-22","text":"Banh mi Bistro has taken Vietnamese sandwich and appetizers to a whole new level. Banh mi bistro has now set a very high standard for sandwiches.  Their new fresh ingredients and innovation could only be explained when you order their sandwich.  I will be there every week.","useful":2,"funny":0,"cool":0},
{"review_id":"8xn7qtmUwjvAkTBNuFSNBg","user_id":"YyK70BJuvew2LhqYPISkGQ","business_id":"o2Qh4SiGYJ7BK4hP7dfkrw","stars":4,"date":"2015-02-15","text":"My wife and I came here for dinner on Friday and were very pleased with our experience, especially given the dearth of good Indian places in the NW Valley. It's not strictly traditional Indian, but everything we had was good. We had the Samosa Chaat to start. The Paneer Tikka Masala and the Lamb Vindaloo were both very good as well, and I really liked the Firecracker Chicken. Similar to chicken you would get at a Chinese place, but better! Naan and rice were both fine. We'll definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"hr6vwmmo1yvQXwbC3A12Tw","user_id":"UgyVSjGwolUdQ0PQkCMxqA","business_id":"28rRiCNsqRf95R6jj3ENcQ","stars":2,"date":"2008-08-22","text":"ARGHHHHHHHHHH   We only ended up here cos it was listed in \"Montreal's Top 25\" guidebook.  (Do people who write these guide books actually eat at the places they review?!!!!)   Dont bother going to this place - cos if you walked a little further up, there are tons of better looking places with better looking food.\n\nThe service here was slow.  They took FOREVER to take our orders.  The food was not worth waiting for.  The soup of the day felt so thin that it was as if someone had just poured water into a pot of leftovers.  You could get better sandwiches off a street cart in New York.   They took FOREVER to give us our check.  Nuff said.  ARGHHHHHHHHHHH\n\nDont waste your time here.  We hopped onto the subway to find this place because it was on the recommended list.  Dont do it!!!   We did and we regret it till this day...........","useful":4,"funny":2,"cool":1},
{"review_id":"YCpvWuJmyRSDeU0XvV47CA","user_id":"UgyVSjGwolUdQ0PQkCMxqA","business_id":"7wgKazvblPECOzBrd6N50Q","stars":4,"date":"2008-08-22","text":"So we ended up in Montreal Chinatown from Old Town cos the restaurants there felt too much like tourist traps and the restaurant we really wanted to try was booked solid.\n\nIt was late and there were a few restaurants still opened.  The streets were very quiet.  We went into the restaurant next door to Beijing Restaurant Inc but RAN OUT as soon as we saw their LUMINOUS sweet and sour chicken!  You probably could use it to illuminate your way out of a coal mine with that!!!!!!!  Was not too keen on Beijing Restaurant cos I am not a fan of northern chinese food (think thick doughy chewy dumplings!)- but then I was tired and hungry and I really did not want to walk around looking for food.  So it was off to Beijing next door.\n\nThink the restaurant was named \"Beijing\" to sound Chinese but the food is more cantonese hong kong type cooking - nothing to do with northern chinese cooking or Beijing for that matter.  The owner spoke cantonese too.  So it was a good thing we walked in.\n\nThe food was excellent.  The portions were also huge so you are better off ordering just one dish per person for 2 or even share 2 dishes amongst 3.  Plenty!  The beef dish was tender and had that cooked over a high flame taste.  Yummy.  The fried shashimo with salt and peppers was delicious!  The congee was smooth and comforting as well.  Yum!  The free dessert of cut orange slices was a good end to a terrific meal.\n\nThe decor is simple but the place gets kinda crowded and you may be asked to share one of the bigger tables.  Was there late at round midnight and they were still doing a brisk business.  Great tip - they are opened till 3 am!  It seems like a lot of people come in for late night supper takeaways too.\n\nQuality is excellent quality and the prices are reasonable for the quantity as well.","useful":1,"funny":0,"cool":0},
{"review_id":"yD9B6aUF319UDCaKy1oY_w","user_id":"UgyVSjGwolUdQ0PQkCMxqA","business_id":"cKdox2gt3L1Dbb7MpOPdWg","stars":4,"date":"2008-08-13","text":"I wished I had like a dozen stomachs to try their whole menu!!!!  What we did get to order was nice but frankly not as \"awe-inspiring\" as I had expected after reading all the great reviews of this restaurant.  (So I am spoilt!) Nonetheless, the food was good and well worth a try.\n\nFoie Gras Cromesquis - basically a foie gras liquid croquette which was a tad too sweet for my liking!  Give me a nicely seared piece of foie gras any day. \n\nStuffed Pied de Cochon with Foie Gras - you really have to attack this as soon as it reaches the table - hot foie gras with hot pork is great.  Not so great when the pork cools down and you get that wiff of gamey pork smell.  It was hard to take after that. The portion is really huge and you might do well sharing this instead.\n\nDuck Magret in Mushroom Sauce  -  I have never seen so much mushroom served with duck magret before!  It was not a \"SAUCE\" as much as a generous serving of sliced mushroom piled on top of the beautifully seared duck.  Nice touch. The duck was tender and cooked to perfection.\n\nOrder your desserts early cos they might just run out of what you want.  The pecan pie was delicious - lots of nuts and smooth syrup base without the gritty sugar bits you get from some pies.\n\nThe service can get kinda slow but the food makes up for it.  Try it if you are in Montreal and remember to make your booking early.  They were recently reviewed in the NYT and are getting alot of attention from visitors to the city.","useful":2,"funny":0,"cool":3},
{"review_id":"rzRyQ1cT5ZJ7xe3J86pvIw","user_id":"UgyVSjGwolUdQ0PQkCMxqA","business_id":"d9VHRDmg37JrC8o7gqHxsw","stars":5,"date":"2008-08-13","text":"Great location!  You can walk just about anywhere from the hotel.  The underground city is just round the block. The rooms were clean and comfortable.  There is a small gym on the 3rd floor opened to guests.  It gets crowded in the morning as it is also a \"health club\" opened to members (public).  There is a small jacuzzi and a pool.  You can get into the jacuzzi from the pool through an indoor link.   Ultra cool! We could not make out if the bar\/cafe downstairs offered free drinks and tapas in the evenings for guests at the hotel (the sign in the elevators were not very clear) and we never really made it back to the hotel on time to try.\n\nOooi breakfast is not included but if you are \"cheap\" you can always go down for a quick breakfast of coffee\/tea, juice, muffins and fruit at the gym.  There are also fruit offerings in the reception area downstairs.\n\nWould recommend this hotel.","useful":2,"funny":0,"cool":1},
{"review_id":"2O8mBD5_it_UWrlk6rLE-Q","user_id":"LTCQDw3jZ22_5p2HTh-COw","business_id":"JDZ6_yycNQFTpUZzLIKHUg","stars":5,"date":"2015-06-23","text":"The best authentic Mexican food restaurant in Vegas! It's a must when you visit or live in Vegas. Homemade flan recipe from the chef's grandma it is to die for. Best server Neo and chef Paco","useful":0,"funny":0,"cool":1},
{"review_id":"69aB3qEVN0Ze9XpgPL0ynA","user_id":"JdaYH_L75gK6IWvfeHwOAw","business_id":"bpxGzNiVA_OhUvmdaDzbMQ","stars":5,"date":"2017-03-15","text":"I purchased a jeep GC a couple years ago from Las Vegas Auto Sports. I must say the jeep runs great. We go off-road a lot and the jeep is running as good as when I purchased it! I would highly recommend them to anyone that is purchasing a used car. They have a lot of great deals. We will be purchasing a new Jeep from them soon and we would not go anywhere else. Not only did we get a great deal they are very easy to work with.  Thanks LVAS Robin T!","useful":0,"funny":1,"cool":0},
{"review_id":"Avd19EkQ9aJTtsytNWBUag","user_id":"7Q52YgFWiqNwr0A0ifTQzw","business_id":"iXUxp09odGN2qhdPU6TKYQ","stars":1,"date":"2015-05-05","text":"Victor in the parts department was extremely rude and unprofessional. I called to place an order for a windshield on behalf of my glass company and he refused to provide the part number which is required to provide to the insurance company for approval. I called a different Kia dealership to order the glass, however, although they DID provide the part number and were very helpful, they did not deliver to our location. So, I had no choice but to call Victor back at Horne Kia and he was extremely rude. He refused to let me speak to his supervisor, stating that the supervisor is the one who put the policy in place. I advised him I would just have the owner of our company call back to place the order. The owner of our company spoke to Maury, the supervisor, who was also very unprofessional and unapologetic. We order glass from dealerships all of the time and were very confused as to why the customer service was so horrible, as we provide so much business to Horne Kia. I would advise not dealing with this company as they have extremely terrible customer service and seem to care less if they lose business based on that fact.","useful":1,"funny":0,"cool":0},
{"review_id":"nuMWMEnV9XF0RjwlojV4qw","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"-QmbV6oYxbBVpPVnstg8Dw","stars":2,"date":"2015-03-30","text":"Um...well that was disappointing. \nFor $43.00, plus tip, I expected a salon experience, or better. I would have even settled for something as good as I could do by myself at home!\n\nThis was my first trip to Blo and it reminded me of when I was a kid and my dad had to do my hair. Complete with the questionable techniques, hair pulling, roughness, sloppiness and an end result that made me want to hide. I didn't even get to pick my style! \n\nThey were polite and nice, but it appears there are no pro's at blo. Just chicks off the street with zero education or prior experience who just do your hair like they do their own at home.\nI have my friends, or evidently my dad, who can provide the same service for free.\n\nI'll stick to the salon. It's cheaper and professional. What the actual heck?!? So upset.","useful":1,"funny":0,"cool":0},
{"review_id":"fx0Rn5IIQZkfwBVz6OX05Q","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"umK6wcryq2IT8Sg86fkPnA","stars":5,"date":"2013-10-11","text":"This is my favourite sushi place. Because it is close to where I work, but also because it is delicious, consistent and fast with great staff and very welcoming atmosphere. \nI started going here just to get take-out, but it's so nice to be there, I usually eat in the restaurant. \nAnd the appetizers on the house... LOVE that!","useful":1,"funny":0,"cool":0},
{"review_id":"NhMZ17yY3Z0hN3yqQy3Hhg","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"qqDAjfveBYw31ilbp3KhkQ","stars":1,"date":"2014-07-21","text":"Just avoid like the plague. \nPretentious, ignorant, rude.\nI am writing this review a year later. My hair is still in awful because of their hairdresser Francesco, who doesn't listen. \n\nI asked for my hair to stay long with a semi-permanent gloss added. (my hair was medium brown, about 6 inches past my shoulders). \nWhen he was done, my hair was a shaggy, messy, mullet with red roots (hot roots) and my hair almost black everywhere else. \nIt was uneven, disgusting. No ability to put it up, braid it, straighten it, curl it.  And the semi-permanent colour never fully went away. \nI went back and the girl who was there was horrified at what they had done to my hair and kept saying \"I don't know why they would give you this cut. I don't know what to tell you.\" The only thing she could suggest was extension (which I would have had to pay for) and for her to strip my hair colour (but I would have had to pay for the product!!!!!) She couldn't even refund me because the owner was in Florida and left her to manage the place without any authority and couldn't be reached on the phone apparently. \n\nI think this place closed down. But if it ever opens up again, I wouldn't go near it with a ten foot pole. \nOh. And it was $200.00","useful":0,"funny":0,"cool":0},
{"review_id":"5GbXa7pk-Oq1mrqvGBe-Zw","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"jSm10odmxWoEs0l2CSqang","stars":1,"date":"2014-07-21","text":"Attended this clinic for 2.5 years. Why did I fire Dr. De Los Santos? Why will I never go to this clinic again? \n\nIn a nutshell: severe incompetence of doctors, poorly run clinic, rude receptionists, the walk in doctors are inexperienced and unprofessional, Dr. De Los Santos is extremely rude and unhelpful and appointments are unnecessarily rushed or rescheduled. \n\nOut of a nutshell: see stories below\n\nI am 27. In pretty great health. Maybe I would wind up here once every 4-5 months for something over a 2 and a half year span. Here are the stories of some of my visits:\n\nMy experiences with their walk-in doctors:\n\n1) Me seeing young female doctor\nMe: \"I have this bump on the inside of my finger\"\nYoung female: \"it feels like a ganglion cyst, you can google that and look up some treatment options\" \nMe: \"I'm sorry, google it? \nYoung female: \"yes, there are videos on how to smash it with different objects, like a book.\" \nMe: \"I googled that before I came here and it is supposed to be dangerous\" \nYoung female: \"well, you could just wait to see if it goes away. There isn't really anything we do for it here.\" \n\n2) Me seeing middle-aged male doctor\nMe: \"So, I dropped a weight on my toe. Went to the hospital and they x-rayed and it's not broken but the swelling is so bad I can't even lower my foot, let alone put weight on it, because it feels like my toe is going to explode\" \nMale dr: \"you need physio therapy. My buddy works over across the hall. I'll set you up with him, he'll take care of you.\"\nMe: \"they said at the hospital that I would need a hole drilled in the nail to relieve pressure and that any family doctor could do it. That's why I came here.\"\nMale dr: \"no, physio is what you need\"\n\n(2 weeks of agony and very expensive physio later with this doctor's \"buddy\" my the skin around my toe starts blistering with blood pockets and I go to my physiotherapist appointment):\n\nPhysio guy: \"whoa...that's not good. I don't think I should treat you while it's like that, let me get my doctor friend to take a look\"\n(He brings in the same male doctor from my walk in appointment) \nMake dr: \"oh wow, you need to have a hole drilled in the nail to drain that\" \n\n(I lost the nail in my toe which could have been prevented by relieving the pressure early.)\n\n3) Me seeing a young male doctor:\nMe: \"I am pretty sure I have a yeast infection.\"\nYoung male: \"oh. Ok. Well...we can uh..well we can do a quick pap, I guess. Um.. Ya. Ok. Is that what you want? Does that..I mean, that's probably the best idea. \"\nMe: \"ya...ok\"\n\n(He pushed my thighs further apart instead of asking me to do it then did the usual stuff but then took out the speculum and put two fingers in my vagina and felt around like he was looking for my g-spot. I've had someone feel around for abnormalities, but this was like i was getting fingered. I have never had a pap that included that sort of nonsense. I have never felt more uncomfortable in my life.)\n\nSo...needless to say, I stopped going to the walk in. I thought I would stick with Dr. De Los Santos (my Family dr).\n\nThen came the referrals. Referrals for everything. Sometimes 5 minute rushed appointments and 1-3 referrals elsewhere, every time I went. I am in general good health by the way, just low iron and some allergies (hence all the blood tests). I have been rudely rushed out of my appointments and felt like I was an absolute inconvenience for being there.\n\nThen I made an appointment with De Los Santos to get results for allergy tests. The clinic is a 3 minute drive from my place down Strachan. (Silly to drive, I know, but it was a freezing day in winter). I left about 10 minutes early. (Always plenty of time). Then bam, I get behind a truck that is trying (and failing) to back up into a parking lot, blocking the whole street. It was taking forever so I called to let them know that I would be late possibly. The receptionist asked how long and I said, maybe 2 minutes, it won't be much. She said \"ok, that's fine.\" I park in an open spot and run in. Yay! I am only 1 minute late. I wait at reception for probably another minute (with one person in line in front of me and three people behind the desk, I might add). I finally hand them my health card and a nurse comes over and says, \"oh, Dr. De Los Santos has already taken another patient since you were late. You'll have to reschedule. If it's an emergency you can see a walk-in doctor.\" At this point it is 3 minutes past my appointment time. I was just livid. \n\nNever, ever, ever again will I go back there. I don't care if you can instantly heal the blind and make them see, no one has the right to treat people the way she does. And the other doctors there should still be under the supervision of someone who knows what they are doing.","useful":8,"funny":5,"cool":0},
{"review_id":"m_N4qVN-PA7yOOwrVp9-lg","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"LAKMP2EskGnHgX5pcy285A","stars":1,"date":"2014-12-08","text":"My first experience there should have been my last... I just kept thinking, \"But I paid for a full year!\" \nI should have trusted my gut. Instead I lasted 4-5 months. \n \nI bought a Groupon for a year of unlimited laser hair removal on my upper lip, underarms and Brazilian. (I feel like so many bad reviews on Yelp start with, \"I bought a groupon.\" Will we ever learn?)\n\nThe short version: \nAnother reviewer put it best: \"The place itself shows many signs of wear and tear, especially in the treatment rooms and didn't feel particularly clean.\" \nThe floors are cracked and dirty, items in the room are also dirty and old. \nI experienced some of the worst customer service I have ever encountered.  \nIt seemed like they didn't know what they were doing during the procedure either. I don't know if it was a lack of confidence, or just a true lack of experience, but I felt really uneasy. Especially when I had to take off my underwear and expose my lady bits to someone who didn't inspire confidence. \nThe procedure was also extremely PAINFUL! I nearly jumped off the table over and over. I wouldn't consider myself a wuss. This may just be the procedure itself, but it added to my feelings of uneasiness.\n\nLong version: \nBefore my first appointment, I had never gone for laser hair removal before so I called ahead to ask if I needed to prepare in any way? The receptionist said, nope, no special preparation, just come as you are. \nOk... So I showed up with about 4-5 days worth of \"Stubble\" on my bikini area. (I read some online reviews for the procedure that said they usually ask for some hair growth). \nThe technician took one look at my hoo-haw and suddenly looked worried. \"Oh, you did not shave,\" she said. \n\"No,\" I said. \"I called to ask if I should, but they said I didn't have to do anything.\" \n\"Oh,\" she said. She remained quiet for a minute or so then went out of the room and came back with a disposable razor. \nOH ya. You guessed it. She had me dry-shave my under-business in their treatment room. With one leg up on the sink, performing a balancing act worthy of thunderous applause, I dry-shaved my crotch in their sink. \n\nIt just got sillier and sillier as the appointments went on. \n- I showed up a few times and the door to the clinic was locked. The owner would come back to tell me she had just \"popped around the corner.\" Apparently she \"pops around the corner\" a lot? Especially when there is a client scheduled to come in at that time. \n- Rough, scratchy papertowel was always the only thing available to wipe the gel off my face and other bits. \n- I called one time to change an appointment, but after 15-20 minutes of waiting on the phone while the receptionist flipped back and forth between times, I said she would have to call me back. The only call I received was days later from a different receptionist reminding me of my upcoming appointment (The one I was trying to change). I told her I was trying to reschedule days ago and no-one got back to me. She proceeded to lecture me about not giving them enough notice. \n\nThe final straw was when I sat in the treatment room, with no underwear on, for 30 minutes, while I listened to the technician deliberating with a client outside about schedules. They even had a receptionist, but still no-one even came in to say \"hey, sorry, it will be a minute.\" I finally put my clothes on and walked out. \nF-That noise. \n\nThe result: The hair removal worked somewhat for a bit while I was going to the appointments. It has been two months since I last had a laser hair removal treatment and everything has grown back to how it was before. Save your money and your skin. Don't do it. Or at least don't do it here.","useful":14,"funny":0,"cool":0},
{"review_id":"dX6WOw9jfhixeNEXX19k9Q","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"_nQrGoaH54rLhXj75PSz0g","stars":5,"date":"2014-07-21","text":"I love, love, love this place. \nTheir salmon sushi pizza is the best I have had, anywhere. \nTheir Bento boxes are huge. Their teriyaki chicken is the best.\nEverything is slightly more than your average sushi place ($1-$2) but it is worth it for the quality! \nTheir service isn't spectacular, but that's every sushi place. \nEveryone is friendly and eager to please. \nJust make sure you ask to get your bill.","useful":2,"funny":0,"cool":0}]