[{"review_id":"Qyr-oPX4k1XQb0cVCJgwWw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"1Z5S_Lkcl6vA3ZvrAG91TA","stars":5,"date":"2017-03-26","text":"First let me say the service was fantastic. Jason and Elsie both came to check on us multiple times. When are you ever at a restaurant and get checked on 4 times? Fabulous! The food was just like abuela's como siempre. This place always makes me feel closer to my grandmothers. Bacallito, Empanadillas, Maduras, Arroz con gandules, tembleque y flan. Yum!","useful":1,"funny":0,"cool":0},
{"review_id":"pfVTvn_z0bni-PRk9dRdJQ","user_id":"9LetdklTpcKWXAy-mYWCaQ","business_id":"OCEAe7tjPbDmcWWvRFUwwQ","stars":5,"date":"2016-11-17","text":"I have been looking for a good Barber Shop for a long time and instead I found a great one!\nMark is a fantastic barber and very genuinely fun guy. He is great at what he does and you can tell he's really passionate about it.\n Mark took his time and paid close attention to detail!Best hair cut I have ever had!\nI finally found my barber!!","useful":1,"funny":0,"cool":0},
{"review_id":"v3iwBWZXFNoT2sQZB2CAcQ","user_id":"9LetdklTpcKWXAy-mYWCaQ","business_id":"93ZfzaU2Y3FDSW4-4EGvoA","stars":1,"date":"2015-06-16","text":"The worse hair cut ever. Dirty shop. I never had a hair cut as bad as the one I had today.  I am not sure why some people gave it 4 or 5 stars unless they are friends.  I will never go back again","useful":0,"funny":0,"cool":0},
{"review_id":"Vag7XBHuKz-asxeSxj3PdQ","user_id":"9LetdklTpcKWXAy-mYWCaQ","business_id":"BT7FeQ8VkpHrU9qihvGD3w","stars":5,"date":"2013-10-04","text":"Best Middle Eastern food I've ever had outside of the Middle East.\n Amazing fresh ingredients, everything is made from scratch, and wonderful fast and friendly service.  \nThe first time I visited the place, I was greeted by one of the friendlies people. The man behind the counter was very friendly and chatty and gave me a piece of falafel to try out while I waited for mine to be cooked. I was very pleased - it was delicious. Crunchier and less greasy than any falafel I'd ever tried before, and much more flavorsome. To make conversation I mentioned how nice the baklava looked, and owner only went and gave me some to take with me as a little present! \nBecause the food was so good, I ordered Shish Kefta, Grilled Chicken, and Kibbee to go \nThe Shish Kefta was so good and melt-in-your-mouth tender, The Grilled Chicken was very juicy and full of flavor   and the Kibbee was crunchy and very tasty. \n\nI would definitely go back there if I am around Cleveland.","useful":0,"funny":0,"cool":0},
{"review_id":"yEfjqSxYu5ZYRI4WwblU-A","user_id":"BBNvUMCfR2etVJ8pJQ0c1Q","business_id":"P6c0lV9DeJ6ofntpTWyqhA","stars":5,"date":"2016-01-05","text":"Casa Reynoso is consistently serving 5-Star quality traditional Mexican dishes with excellent service! My favorites are the Flour Cheese Crisp with Green Chile and Green Corn Tamales with a large order of rice!!!!! It's always a pleasant experience dining at this restaurant! Appreciating the great food and welcoming hospitality my overall rating for this establishment is 4.5 Stars, leaving them room for growth.","useful":0,"funny":0,"cool":0},
{"review_id":"9pS3RQyzgrOcMD-NCPjXlQ","user_id":"N6d0Q3_ro_vg5wgWVuyxfg","business_id":"4MlVKZ1ZbVA__MA-7D3gYQ","stars":5,"date":"2016-08-21","text":"My experience was lovely.  Classic steak house feel, wonderful,attentive bartenders  (Derek and Brad) and lovely host (Jennifer). Clean, nice feel, DELICIOUS meatballs. Live music, not the bessssst, but fine. Overall, nice comfy feeling.","useful":0,"funny":0,"cool":0},
{"review_id":"Rt-N02FIO_u89obsqVq93Q","user_id":"N6d0Q3_ro_vg5wgWVuyxfg","business_id":"WLEneu6YVE_qM4NGXj2Ddg","stars":2,"date":"2016-08-21","text":"This place is gross. I've gotten up 3 times to get my own napkins, water,and ask for a menu. It feels like a bunch of kids who are annoyed you're here. Food....gross. drinks...Fine, I guess, but why not go somewhere else. I have a huge plate of nachos with barely any cheese, flies and bees flying around my table. Now all the waitresses are having drinks and laughing at the bar. Noone else is.","useful":0,"funny":0,"cool":0},
{"review_id":"NUKW7DPmD1R05wTbKMr2YA","user_id":"N6d0Q3_ro_vg5wgWVuyxfg","business_id":"vO3wH7q0z-bq052VNj-8Cw","stars":3,"date":"2016-08-21","text":"First of all, you don't want to sit at the bar because you're facing the back of the restaurant that looks like a clean but boring sports bar. If you look behind you at the rest of the restaurant, it's cute. Decor taking cues from the viceroy hotel for sure. Hipster black and yellow, life size horse lamp.\n  I ordered a cocktail, the club soda was flat. I also ordered the Cobb salad. Errrrr, it's hard to mess up a cobb salad. I was excited to see \"5 minute egg\" as one of the ingredients as I love a beautiful yolk, but it came out on a square of iceberg lettuce. This is only okay if you've ordered a wedge salad and they disguise this cheap lettuce by drenching it in blue cheese. I cut into the egg... lovely. So, why is my salad sort of watery? Like maybe they rinsed the lettuce and didn't spin it? The whole thing has a slimy feel.  Plus an excessive amounts of pickled onions, which I'm a fan of generally. I'm about to order something else cause I can't choke this down....wish me luck. \n  Ordered the tartare. Interesting and pretty good. Pickled mushrooms and mushrooms crisps on top (yum) but half way through,  there was so much mustard, I got queesy.\n  Staff was lovely, it was absolutely freezing, I left.","useful":0,"funny":0,"cool":1},
{"review_id":"y-woIJ2svmpJsMqIbgRTnQ","user_id":"tQqCwxLgYOrBgBf4CFZV7A","business_id":"_BinpQSjqtEgycxQxKHIGg","stars":1,"date":"2015-06-21","text":"A tale of two locations (AKA: AVOID 7700 S Autoplex, GO TO 616 W Baseline)\n\nFirst the good: 616 W Baseline\n\nI have been a loyal repeat customer of Cobblestone Auto Spa ever since I encountered Jared, one of the managers at the 616 W Baseline. \n\nThe first time I went there I had my car detailed for $150 after discounts. The detail had been a little rushed because the location was extra busy that day and they were also short staffed. As a result there appeared to be some minor scratching. Jared was immediately on the ball and worked to have the scratched buffed out and fixed. I was very impressed with him as I watched and saw him masterfully handle other customer issues like mine. I was impressed enough that I told the man to his face that I was going to be a loyal customer directly as a result of his good work.\n\nI am not good with names or dates, but I remember this man's name, because he does his job with pride. After Jared, I became a fastpass customer and still remain one.\n\nCOBBLESTONE, PAY CLOSE ATTENTION! THIS IS THE KIND OF EMPLOYEE YOU NEED MORE OF!\n\nNow the Bad: 7700 S Autoplex\n\nI first went to this location because I needed an oil change and the 616 location does not do oil changes. I got a heavy up-sale routine but went with it anyway. I also got a wash that was far below the standards of the 616 location. I let that all slide, as just being an off day.\n\nI then went a second time for a wash, also below standard. I also let that slide.\n\nI then went to get a wash yesterday. Not only was the wash worse than ever, but the car interior looked worse coming out than it did before I came! To begin with the carpets were barely vacuumed at all. There was dust and small dirt everywhere never even attempted to be cleaned. The only real evidence that they did anything was white stuff rubbed into the grain of dash around the driver's side air conditioning vent. There were also several new white smudges on the back of the seats as well as the seat back and headrests of both sides of the back seats.\n\nWhen I pointed out the mess on the dash, initially they tried to say this was the dash paint wearing off. I was able to remove some of this white stuff (that looked a lot like a car wax) with my thumb nail. The manager, who I do not remember his name (nor is he worthy of being remembered) wanted to just get his day over and wanted to fill out a damage report. I remained reasonable but refused to just drop it because I knew they caused the problem. At this point 3 of the employees were involved and seemed more concerned with getting the day over than fixing the problem. They were disrespectful and discourteous.\n\nFinally after they saw the light of day that it was not damage, but just some stuff that they managed to smear into the dash. They asked me to come back the next day. Obviously fixing the problem right then was just too much effort.\n\nI went home, frustrated but moderately satisfied that the car would be fixed the next day.\n\nThe next day while examining the contents of the back seat that were just tossed about with no care, and no effort to clean anything, I discovered a pair of women's panties placed in the center of the floor of the back seat. Keep in mind that the floor mats were not vacuumed, but tossed on the back seat. \n\nI knew these were not my wife's who is a small woman because these were of a rather robust size. Also these were obviously clean panties, so I gather that one of the employees has a fat girlfriend or wife who is missing something from the laundry.\n\nI suspect these were a gift for my complaining about the condition of the car and the fact I was making them late from rushing home to see the next episode of moronic reality TV.\n\nAs a result I was livid. I had tried to be cooperative and reasonable and was rewarded with this insult added to injury.\n\nI went to the 7700 location immediately and complained. They clearly found the actions of the yet undetermined employee very humorous, and were going to make no attempt to secure an apology or terminate the maleficent employee. \n\nThey reluctantly looked at fixing the area of the dash they had messed up, and made a halfhearted attempt to fix it. At this point the dash looked a little better but not the same as it did when I brought the car in. I was tired of dealing with these lazy incompetent fools who had no pride in their work and decided to take the car back to the 616 location.\n\nJared to the rescue:\n\nI took the car directly to the 616 location and saw Jared busily working with his staff. I pulled up and was greeted courteously by one of the staff. After being checked in I called out to Jared and explained the situation to him. He dutifully sought out to resolve this issues and return my car to its former glory.  This was not his problem, his staff did not cause it but he fixed it.\n\nLesson: NEVER GO TO THE 7700 LOCATION! ALWAYS GO TO THE 616 LOCATION!\n\nCOBBLESTONE, BAD MANAGERS MAKE FOR A BAD STAFF. GREAT MANAGERS MAKE FOR A GREAT STAFF.","useful":6,"funny":4,"cool":2},
{"review_id":"UuwV_kvSBEiRD0lbbUWNbg","user_id":"tQqCwxLgYOrBgBf4CFZV7A","business_id":"8TBt9XAVZIZR2Y0EqBHskg","stars":5,"date":"2015-06-21","text":"A tale of two locations (AKA: AVOID 7700 S Autoplex, GO TO 616 W Baseline)\n\nFirst the good: 616 W Baseline\n\nI have been a loyal repeat customer of Cobblestone Auto Spa ever since I encountered Jared, one of the managers at the 616 W Baseline. \n\nThe first time I went there I had my car detailed for $150 after discounts. The detail had been a little rushed because the location was extra busy that day and they were also short staffed. As a result there appeared to be some minor scratching. Jared was immediately on the ball and worked to have the scratched buffed out and fixed. I was very impressed with him as I watched and saw him masterfully handle other customer issues like mine. I was impressed enough that I told the man to his face that I was going to be a loyal customer directly as a result of his good work.\n\nI am not good with names or dates, but I remember this man's name, because he does his job with pride. After Jared, I became a fastpass customer and still remain one.\n\nCOBBLESTONE, PAY CLOSE ATTENTION! THIS IS THE KIND OF EMPLOYEE YOU NEED MORE OF!\n\nNow the Bad: 7700 S Autoplex\n\nI first went to this location because I needed an oil change and the 616 location does not do oil changes. I got a heavy up-sale routine but went with it anyway. I also got a wash that was far below the standards of the 616 location. I let that all slide, as just being an off day.\n\nI then went a second time for a wash, also below standard. I also let that slide.\n\nI then went to get a wash yesterday. Not only was the wash worse than ever, but the car interior looked worse coming out than it did before I came! To begin with the carpets were barely vacuumed at all. There was dust and small dirt everywhere never even attempted to be cleaned. The only real evidence that they did anything was white stuff rubbed into the grain of dash around the driver's side air conditioning vent. There were also several new white smudges on the back of the seats as well as the seat back and headrests of both sides of the back seats.\n\nWhen I pointed out the mess on the dash, initially they tried to say this was the dash paint wearing off. I was able to remove some of this white stuff (that looked a lot like a car wax) with my thumb nail. The manager, who I do not remember his name (nor is he worthy of being remembered) wanted to just get his day over and wanted to fill out a damage report. I remained reasonable but refused to just drop it because I knew they caused the problem. At this point 3 of the employees were involved and seemed more concerned with getting the day over than fixing the problem. They were disrespectful and discourteous.\n\nFinally after they saw the light of day that it was not damage, but just some stuff that they managed to smear into the dash. They asked me to come back the next day. Obviously fixing the problem right then was just too much effort.\n\nI went home, frustrated but moderately satisfied that the car would be fixed the next day.\n\nThe next day while examining the contents of the back seat that were just tossed about with no care, and no effort to clean anything, I discovered a pair of women's panties placed in the center of the floor of the back seat. Keep in mind that the floor mats were not vacuumed, but tossed on the back seat. \n\nI knew these were not my wife's who is a small woman because these were of a rather robust size. Also these were obviously clean panties, so I gather that one of the employees has a fat girlfriend or wife who is missing something from the laundry.\n\nI suspect these were a gift for my complaining about the condition of the car and the fact I was making them late from rushing home to see the next episode of moronic reality TV.\n\nAs a result I was livid. I had tried to be cooperative and reasonable and was rewarded with this insult added to injury.\n\nI went to the 7700 location immediately and complained. They clearly found the actions of the yet undetermined employee very humorous, and were going to make no attempt to secure an apology or terminate the maleficent employee. \n\nThey reluctantly looked at fixing the area of the dash they had messed up, and made a halfhearted attempt to fix it. At this point the dash looked a little better but not the same as it did when I brought the car in. I was tired of dealing with these lazy incompetent fools who had no pride in their work and decided to take the car back to the 616 location.\n\nJared to the rescue:\n\nI took the car directly to the 616 location and saw Jared busily working with his staff. I pulled up and was greeted courteously by one of the staff. After being checked in I called out to Jared and explained the situation to him. He dutifully sought out to resolve this issues and return my car to its former glory.  This was not his problem, his staff did not cause it but he fixed it.\n\nLesson: NEVER GO TO THE 7700 LOCATION! ALWAYS GO TO THE 616 LOCATION!\n\nCOBBLESTONE, BAD MANAGERS MAKE FOR A BAD STAFF. GREAT MANAGERS MAKE FOR A GREAT STAFF.","useful":1,"funny":0,"cool":1},
{"review_id":"l1jBu54V5b_n4yuZmdx0YA","user_id":"5zcAUxsf0n5sznNNxTwy9A","business_id":"1yWINuTOUBQj8ELqRNDOWA","stars":5,"date":"2016-04-22","text":"Was my first time here and loved loved loved !\nStaff was amazing let me sample all the flavor's I wanted , Super friendly & Loved the smiles","useful":0,"funny":0,"cool":0},
{"review_id":"1mTS_mmKJocNLxCQ4J7O6w","user_id":"LOWgS4mUu7Y2uPWKZnP5Pw","business_id":"5iSlHNIy3RLbCP5AayB31g","stars":3,"date":"2017-04-08","text":"I've been to this restaurant 2 times. The food was good but they're salad bar needs attention.  The have good items in the salad bar but it's never stocked.  I want there for lunch yesterday and the salad bar was missing many items and it didn't get restocked the entire time I was there.","useful":0,"funny":0,"cool":0},
{"review_id":"ezNmGP6f4LtMxBlchpHgbA","user_id":"icKJMLsafcQEnmcz4Xx3vA","business_id":"tWvep1usNNI3NYkoRbSb7g","stars":1,"date":"2016-05-06","text":"Furniture was destroyed. A hole in the roof from rust let water almost everything was wet or moldy. They refuse to take any responsibility for it.Going ao far as to say the hile never existed and we must have drilled it just to get money from then. The man insists on yelling and interrupting. \n\nUPDATE:\nupon returning to the unit to pick up the last of our items the owner began recording us taking photo's of the damage. When asked why he was recording us he jumped in his car and said he now 'understood our intentions' My Brother confronted him asking for the $110 reimbursement he had said he would deliver. The owner then declared he was going to call the police, we invited him to and encouraged him to.  Instead the owner barricaded himself in his office, locking the doors and setting the alarm. Upon leaving the facility he wanted us to sign a no-slander agreement. We declined. We did not receive the reimbursement.","useful":0,"funny":0,"cool":0},
{"review_id":"vA9k0GBvNe08yHij361e_Q","user_id":"ZuYuXMec3RkzrX4g3fE_ZA","business_id":"vaKRQV2hiuTntZEKK08sIA","stars":5,"date":"2015-03-04","text":"I absolutely LOVE this shop! A lot of the Regal salons in Wal Mart really suck!! This one is Amazing! I usually have LeeLee do my hands and feet, but either of the 2 ladies are good. ( I'm very picky) their prices are good and their promptness is exceptional.( you can only do nails so fast before they start lookin crappy) they try to speak English most of the time, like they don't look at you then start talkin in their language! They make  sure \"you like\" if not \"they fix for you\", they are very sanitary, & professional. All in all, I love them, I only have to visit once every 3-4 weeks (thats how good their products Are) & if you're in the area, stop by, they won't keep you waiting & you won't leave with empty pockets or a sad face. Keep up the good work Regal Nails!","useful":0,"funny":0,"cool":0},
{"review_id":"pkOXDshPOvFnJqfF8KAzhA","user_id":"ZuYuXMec3RkzrX4g3fE_ZA","business_id":"3kVThNUM1mzz1lBtxdSJxw","stars":1,"date":"2015-03-03","text":"The service here, is sooo bad! We were meeting family, happened to be running behind them and when we got there they were eating already, it took the waiter 20 min just to come take our drink order, another 10 min to come with the drinks and take our order...thought we were good,WRONG! After 45 min. I asked about or food& by the time they came out, approx 5-8 min later, family started leaving, and we just began eating! I will never go there again! They were packed so I could understand a little delay, but come on! 45 min to receive a few of the simplest plates on the menu, um no.","useful":0,"funny":1,"cool":0},
{"review_id":"D37683RSis4bCamv2AG2Vw","user_id":"ZuYuXMec3RkzrX4g3fE_ZA","business_id":"ygZSfAsnlztdeWZOlJA2Ug","stars":5,"date":"2015-03-04","text":"It was great! Great customer service! I definitely recommend anyone looking for good pizza & wings, to stop by Barro's! We were greeted immediately once arriving, & were asked to have our order takin. She even gave us an extra cup! Our food was served promptly and it was delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"cFruEMGE4BMevszPm3Ug5w","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"E25-2ssHwsajyGtsllMXaA","stars":5,"date":"2015-10-01","text":"Taking a bite of their sweet potatoes is like taking a bite out of heaven. Their chicken is fried to perfection and their Cobbler was made to a standard that only Chuck Norris could possibly compete with.","useful":0,"funny":0,"cool":0},
{"review_id":"IqlGAkDnK1MSSN0JoqBYSQ","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"DjvpsmdtEvnyMk2vXxpc-w","stars":2,"date":"2015-02-16","text":"I came here for Valentine's day and was seriously disappointed. Walking into the place, there was no host to greet or seat us. We had reservations and ended up walking around the empty tables looking for the one with our name on it. We finally chose a table and the food was pretty good, but my date asked for a steak knife to cut her lamb with, and our server said the place had no steak knives. Also our wine was served in tumbler glasses","useful":0,"funny":0,"cool":0},
{"review_id":"M-YzUvNcNYT2bOrTGZV9Ow","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"0KjY3gmtqQjc4sK-uG-6fQ","stars":5,"date":"2015-03-08","text":"I never thought that it was possible to have a life-changing experience at the hands of a single donut hole, but Pink Box donuts showed me what it meant to be happy again. Even after a weekend of partying in Las Vegas. A hole so sweet and flaky and perfect. A hole so inspiring that it made me question everything about myself. A hole that puts shame to all other holes. With every bite I was brought back to a simpler time when craftsmen had passion for their life's work. Cheers to you Pink Box donuts.","useful":2,"funny":2,"cool":2},
{"review_id":"pQ7NHetypf147ytZoRu_Mg","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"CFyPbqZaxoBTjOmVjSn_8Q","stars":5,"date":"2015-12-30","text":"Thus place may seem small, but their flavor is huge. A little out of the way but totally worth it. Chicken tacos on point.","useful":0,"funny":0,"cool":0},
{"review_id":"28nNkXOMr1LxL-Abeamnbg","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"4cuvlrnhnLA9r2TOmwSvfw","stars":5,"date":"2015-01-29","text":"I ordered from here online and I was very impressed at how quickly and accurately the order was processed and delivered. It was delivered in less than the expected wait time, and the sandwiches were wrapped and packaged very nicely. It's very obvious that this place loves good sandwiches.","useful":1,"funny":0,"cool":0},
{"review_id":"fT-BmxZo4UeJQylLFPgNgw","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"IrXlXhmSHlIllxZSAARjLA","stars":1,"date":"2015-01-26","text":"I ordered a meal online for delivery and the food didn't arrive until 2 hours later (I live 4 minutes down the road). When the food Did come, it was cold. The only good thing was the energy beet juice I ordered. Pretty good stuff.","useful":0,"funny":0,"cool":0},
{"review_id":"e7BMpMP6W6l1YuCYvWWgzg","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"Oa36vjcNukdm7xXcLZ6IPQ","stars":2,"date":"2015-11-15","text":"I've been to this restaurant twice and was disappointed both times. The first time, I drove-through ordered the 4 for 4 meal, and the employee almost sent me home without giving me my drink. Not a big deal, but then when I got home I found that my 4 for 4 meal was a 3 for 4, as there was no burger in my bag. Went back today and again the drive through employee tried sending me of without my drink. When I asked for my sprite, I got an eye roll instead of an apology, and a cup full of carbon water.","useful":0,"funny":0,"cool":0},
{"review_id":"pzPhbPkAp9-yU9nwxSYX9g","user_id":"eeovuG852zAmPm-8UPLEiQ","business_id":"LEYZb8jiD36RQTElxy0YrQ","stars":5,"date":"2015-11-13","text":"I have been here 3 times and have had a great experience every time. The service is friendly, bagels are delicious, and they are dog friendly which I love. They have home made dog bagels for your pets and water bowls as well.","useful":0,"funny":0,"cool":0},
{"review_id":"7Fq665NwsRMwhXus7ueJSw","user_id":"OKsOz8gvZqMzHwoQhxVgZQ","business_id":"plD9cuwxJ5esXPT9rY3tmQ","stars":4,"date":"2015-11-15","text":"Got a groupon for full set of eyelashes and was charged extra for full set in the salon","useful":1,"funny":1,"cool":0},
{"review_id":"mI3pNbPHWmWwFUNZSi3HJA","user_id":"zTGBQPwyaObHL_0YmuQU5A","business_id":"-pe8Y19gDT-na7SuoBuE4w","stars":2,"date":"2017-09-23","text":"We are in the hotel now. Very clean and staff seems nice. \n\nThe room is so HOT and there was no way to make it colder. We asked for a fan. It makes no difference. It just blows the hot air around. The staff needs to do something to make the rooms cooler before people check in. Miserable.","useful":0,"funny":0,"cool":0},
{"review_id":"-1d8giZWjqXTCL764kVGfw","user_id":"xKUIorGgGWh_Q5Pmh7NTGg","business_id":"gwcAxVenwrA4PoTPke-QUA","stars":5,"date":"2017-07-28","text":"I came in for the first time and had the best experience. He was very meticulous about the shape of the nails I wanted. The color looks amazing. I came with my coworker because she highly recommended this location. I'm so glad I did.","useful":0,"funny":0,"cool":0},
{"review_id":"iNe_h68ivdtre_moCIpgpA","user_id":"Inb_NNvrogAj_UHw9cd7Ag","business_id":"Auy2w1PNycTomFXMwdC6Zw","stars":1,"date":"2013-10-30","text":"Wish I would have read the reviews before I took my hard drive in.  I had been emailing Tom at Friendly Computers and told him exactly what was wrong with my hard drive and what Geek Squad and other techs had told me (that it would have to go to a clean room in order to recover my data).  Being desperate because all of my 2 year old's baby pictures and videos are on that hard drive, Tom gave me hope (false hope) so I took it in to him.  He told me he was 60-70% confident that he would be able to retrieve my data.  I had to pay $169 flat rate fee and leave the hard drive with them possibly for a couple of week.  About 5 days later he calls me and he tells me that he can't get any of my data.   He offers to send it to their clean room lab for an evaluation but the $169 that I already paid them was not gonna be refunded to me.  I told him I paid $169 for nothing and he said well it wasn't for nothing because we've been working on it and trying.  This sounds to be like a great way to scam people.  Tell them you think you can help them and get them to pay the $169 all the while knowing that you can't get any of that data but you sure got their money.  Wonder how many others are out there that have been thru the same situation.  Also, I have read this sales agreement\/receipt 3 times and don't see where it says the fee is non refundable even if they can't retrieve your data.  Maybe I'm overlooking it but I don't see it.  DO NOT GO TO FRIENDLY COMPUTERS.  They are not \"friendly\".  They are major con artists, scammers, liars, etc.  Don't waste your time or money and don't get your hopes up.  I got my hard drive back from him minus my $169 that was wasted down the drain and he probably erased all my data so that no one else would be able to recover it since I refused to let him send it to his lab.  I will never be able to recover those videos now of my toddlers first roll over, first crawl, first word, first steps, etc..  This is definitely not how I treat people and certainly don't want to be treated this way by others, especially businesses in my own community.  WOW!!!!","useful":7,"funny":0,"cool":0},
{"review_id":"Mx1p-TcHDUxDSgS1GwjHcA","user_id":"X46LA_SH5VTCoTcRbbtFMw","business_id":"n0SSApg8pIMu9uWr7IvxcQ","stars":1,"date":"2014-10-27","text":"I tried Fox car rental in late August. They were one of the cheapest and affordable in the area. The only reviews I read said they were slow. I had time so we decided to try them. They were okay at the first counter.  Set us up with a car, and sent us down to the garage to get our car.  This was not easy to find and no signs to there counter in the garage.  Another rental place had to show us where they were.  When we got over there, they were slow. They handed me keys and said here is your car go find it. If there is a problem with it let us know. We found the car? It had many dings and scratches down both sides. We stopped to report those, and the agent acted like we were wasting her time. I had to point out all the damage, as we walked around there we dings in the front and back too. We thought we were okay, the car ran fine the week we used it. When we returned it they tried to blame the dings and scratches on us! We said no way! They found the report where we reported the damage before we left. They then said okay.  We signed tge final paperwork and left. But a month later they are trying to say we did the damage and charge us 1000.00! I am fighting it, but my insurance company told me this is not uncommon!  Its is so wrong! If my insurance company steps in they saif they can get it lowered most likely,  its hard to prove or investagate. I would still have to pay my debatable. . It has been a horrible experience.  We never use them again!","useful":0,"funny":0,"cool":0},
{"review_id":"hPfnX0fyEx5-TQMMyd0VTQ","user_id":"uZ1MDOePKnGRlCejy5km6g","business_id":"WnrK19zBdW3ATWRc9RjYMA","stars":5,"date":"2015-07-03","text":"Went there with some coworkers unplanned and based solely on Yelp recommendations. Everything was great! The staff was helpful and accommodating. The owner was very friendly and hands on. The hookah was very nice, Turkish coffee was fantastic and we tried uma Ali for the first time ( I don't know how to spell it, but that was how it sounded to me)... great! There is no alcohol there so if you cannot live without it go to a bar, but you'll be missing out. If instead you like great, friendly service in a warm inviting environment then this is where you belong.","useful":0,"funny":0,"cool":0},
{"review_id":"lMarDJDg4-e_0YoJOKJoWA","user_id":"A21zMqdN76ueLZFpmbue0Q","business_id":"RESDUcs7fIiihp38-d6_6g","stars":2,"date":"2017-02-08","text":"This place....lol our server was nice.  But for 50 something dollars for dinner was not worth it....Sorry but if I could choose another place to spend that much I know I would have been much happier. Not to mention they took a photo of us when we came in then brought us like 3-4 printouts of them, I mean nice ones...then they told us it was 15 dollars for one of the pictures...we honestly thought out of all the money we spent we'd at least get the pics for \"free.\"  So they went through all the trouble to print them and then are going to throw them away because we didn't want to pay for them? Why not just give us the photos...Food was cold, poor quality of meats, etc..Also not near as big as this looks! Just bummed we spent so much. \nSorry can't recommend this at all.","useful":0,"funny":0,"cool":0},
{"review_id":"Fj-YfSH7JAJYOfqPxTIWCw","user_id":"hG0imiSdVrHyGYKlO859cA","business_id":"VW9qzO6Wxi8UlwT9024tMg","stars":5,"date":"2013-11-24","text":"Five stars are for my hair stylist Brice Bensimon. I haven't been yet at Cristope Salon, but i have seen Brice a couple of times and he is simply amazing. All knowledgeable and very helpful. He is a good listener, gives proper advise , and puts time end effort into making your hair great.( he is also charming and fun to talk to) My hair never looked so good before!  I highly recommend him.","useful":0,"funny":0,"cool":0},
{"review_id":"vV-HAiUQroFqJFv_HkCQfg","user_id":"hG0imiSdVrHyGYKlO859cA","business_id":"rq5dgoksPHkJwJNQKlGQ7w","stars":5,"date":"2011-10-12","text":"It's an Europian coffee shop where u can sit outside and enjoy your drink.They make good machiato(my husband loves it),delicious and healthy smoothies.I love that ginger peach hot tea..We go there almost 3 times a week.But know that my hus is in vacation we will come often.We take his parents too,cause as Europian we like these kind of places.I forgot to mention it,you don't forget to try the gelato,especially the chocolate one...","useful":0,"funny":0,"cool":0},
{"review_id":"-VWh2FEtyGVW7w5A7z-7rA","user_id":"p3lpJfAgaBBc-226gY9oNg","business_id":"xD6Q0UFxO8uE4bdaBDIMlA","stars":5,"date":"2015-02-18","text":"Best hot pot in Champaign Area. The bolus and shrimps are  so delicious, highly recommend~ Please try the plum juice and soy milk, they are amazing. The environment and service are great. It will be hard for you to find another place like this in Champaign.","useful":2,"funny":0,"cool":0},
{"review_id":"c-_UEhmJyEUdlk9Gzf3wrg","user_id":"USqqFNBXaUxFhsaKhmuEkw","business_id":"hrhtWc8UcoZqYr2d7YPgEA","stars":1,"date":"2016-10-28","text":"When you pay extra for a room at a 4-star hotel, you have an expectation that you will be getting a pretty nice room. That was not the case here.  I would say that our room was a step up from the Motel 6 down the street. \n\nWe were placed in one of the Bungalow rooms, which is essentially, the older section of rooms.  It has three floors with one side facing the pool and the other facing a loading dock and the Tropicana roof.  If you are lucking enough like us on our anniversary, there will also be a roof access door that is cracked open about 20 feet from your window so any Tropicana employees that happen to walk through that door will have a clear view into the room.  No luck in switching rooms either.\n\nThe carpet, furniture, and mustard yellow wall paper made it feel dated, along with the cracks in the ceiling.  The only updates in the room that I could tell was a 42-inch flatscreen TV and the shower.  \n\nThe lobby looks nice and updated, but the casino itself is pretty small.  We ended up spending most our time elsewhere.  Pool look decent, but was crowded.  Half of the area was empty as it was reserved for 'special' guests.  \n\nIf I were to do it all over again, I would have saved the extra cash spent on this supposed 4-star hotel and booked at one of the other 3 star casinos nearby that have better rooms, bigger casinos, and better location.","useful":0,"funny":1,"cool":0},
{"review_id":"RaBHiGIGYZXYTjhTKQRxBg","user_id":"NnsrxdlhWknG6jFVf2Jq1g","business_id":"UMqfeCItzQ2glr4d9apGlA","stars":5,"date":"2016-07-12","text":"This and Mothership Coffee Roasters are my 2 favorite places in Las Vegas! I especially love the spicier lattes on the menu. All good is Fair Trade- very important to me","useful":1,"funny":1,"cool":1},
{"review_id":"Wu7D1FUF4OwqwxrVtLTAAw","user_id":"NnsrxdlhWknG6jFVf2Jq1g","business_id":"G7xS3HiTKHnRhI8cNRGXpA","stars":5,"date":"2016-07-12","text":"This and Sunrise Coffee are my favorite places in Las Vegas! I NEVER drink my coffee black, but love the cold brew!!!!! The pastries are delicious and my celiac friends rate the banana bread as \"best ever\".  Also their coffee and hand made chocolate is all Fair Trade - especially important to me.  I come regularly, especially as I like to supports local business","useful":1,"funny":1,"cool":2},
{"review_id":"ZYKYQ24IRZj5qxIw8MSRoA","user_id":"6WIRvMKI5DSfZfOB4ZF7xA","business_id":"IsIKU8ndr3aU5sFTb4LuPA","stars":4,"date":"2008-09-03","text":"Love Drip. I've been coming here for a few years now, and Gina and Vene always make my daughter and I feel right at home. And where else can you be guaranteed to see the mayor of phoenix sipping a cuppa joe.\n I love the food, especially the NY egg sandwich, and the homemade goodies that are usually on display. And the coffee is excellent, always nice and strong. However, they do make everything to order, so allow some time during busy hours (lunch, etc).\n They have free wi fi, and well placed outlets, most of them are quad boxes, so you will have place to plug in.\n And I have yet to hear a bad song, so overall, I would recommend it to anyone.","useful":1,"funny":1,"cool":1},
{"review_id":"KBlHAfkjSR0jvOJoiM0wnw","user_id":"DWUUzXL11XQRZnwDFpH-kg","business_id":"AuLTXW451BdZubhPe5wo_w","stars":5,"date":"2013-06-13","text":"We've had Screenmobile of Charlotte help us with two different projects - one was a retractable screen for sliding french doors and the other was a removable safety fence around our pool.  Everyone who works for this company is so very helpful and puts customer satisfaction as their primary goal.  I highly recommend Dave and his team (including Debbie in the the office) if you have any screening needs.","useful":4,"funny":0,"cool":0},
{"review_id":"ytgYh0u4J5mN1eMroT90Kw","user_id":"l7ju-4ia4bkdrDpyG1ZWNw","business_id":"QWtQlVbQaLrnODBrdgJ15w","stars":1,"date":"2012-09-27","text":"Drittes GOA in Pfaffing erlebt. Absolut nix! Unterhaltung hab ich auch im Keller mit besser Fetz .No Kanibals, no Masaker..LECHTS!!","useful":0,"funny":0,"cool":0},
{"review_id":"v99zfmXQFo1Z9F7-qZD6tg","user_id":"88ZDBykC9oV2o6as3WnTdA","business_id":"hCfj1xtRSzO873TMX6rNTg","stars":5,"date":"2015-10-23","text":"I used to tan with Donna when I lived in Vegas. I have a spray tan business myself, but it's extremely difficult to spray yourself as you can imagine. With that being said, I am very picky and Donna does an amazing job! Her prices are inexpensive and even if it was last minute she was able to accommodate me! If I'm ever in Vegas and need a tan she is my girl!","useful":0,"funny":0,"cool":0},
{"review_id":"GuY57RcJ_iZFz6b3itLUdQ","user_id":"TBgq-ULi2LBCHct7aAbIEA","business_id":"9oyYmCv9HuVRa1lZUE86sw","stars":5,"date":"2017-08-07","text":"Best shaved ice dessert ever.  Their shaved ice is super soft like snowflakes.  You can get anything on the menu to go as well.  :)","useful":0,"funny":0,"cool":0},
{"review_id":"Wx8_ZN2mkjCUsf2irB1yRQ","user_id":"TBgq-ULi2LBCHct7aAbIEA","business_id":"HBtn4ENYp3zy0Ylsw5KVuw","stars":5,"date":"2017-04-27","text":"We've went through various daycares in the area before signing up with Kids&Company.  I even dropped by few times to make sure what I saw during our tour was what you'd actually get.  The site is very well maintained and extremely clean.  \n\nThe meals and snacks are carefully planned by a nutritionists who incorporate diverse menu (fish, tofu, various ethnic menus like pad thai) that incorporates seasonal veggies and fruits.  \n\nI cannot say enough about the staff though - they truly love what they do and it shows.  From the day we started transitioning my little one at 12 months, all the teachers have shown nothing but love and care.  They make sure each child is engaged and cared for and I am always grateful for all the work that they do with the children.  \n\nThe webcam access to the room is also a bonus (it came really handy during the first few weeks when it was just as much of a transition period for me as it was for my child - I may have spent a good chunk of my day watching\/weeping\/laughing).\n\nAnother added bonus is how responsive the head-office is to suggestions.  Parents are encouraged to give feedback and suggestions and they are very responsive to parents' inputs.  The weekly newsletter also allows us to know what my little one has been learning so that we can reinforce some of the things at home (ex. songs or books that they have been learning).\n\nKids and Company really is as good as it gets in terms of daycare :)","useful":1,"funny":0,"cool":0},
{"review_id":"Ca5g015zcfGxWZS2XmwGog","user_id":"TBgq-ULi2LBCHct7aAbIEA","business_id":"q5xrVJ4kivx_yEfJeOKNYQ","stars":2,"date":"2013-04-21","text":"We've visited The Black Hoof (one of the few restaurants Gordon Ramsay visited when he was in Toronto) numerous times and attended various culinary events with Grant van Gameren, so we were really excited to visit Bar Isabel.\n\nIf you have been to The Black Hoof, the menu will look extremely familiar -- don't get me wrong, the food is tasty and good (ex. tongue with broche, horse tartar) but there really isn't much new if you have been to his other restaurants.\n\nThe bartender took forever to get my drink made -- he kept looking back to the menu to figure out the ingredients were.  Also, I'm not sure if we just had a new waitress or just not the friendly ones other reviewers have said but our waitress told different tables different list of the night's special.  For example, when we asked about what fish they were using for the ceviche, she told us that they were only serving sea bream -- then told the other table that they had the option between sea bream or red snapper.  \n\nFor every table she went to, she'd ask if they wanted to order anything else, then if the customers said 'no', she'd roll her eyes as she walked away.  Other wait staff re-filled our water, never her.  Our plates were also taken away before we finished our food.\n\nIt is nice that Bar Isabel takes reservations, accepts credit cards, and has more space\/seating (unlike The Black Hoof).","useful":0,"funny":0,"cool":0},
{"review_id":"JBwiVYQGK-kHmdmt2Q_YSw","user_id":"TBgq-ULi2LBCHct7aAbIEA","business_id":"uthbVCNZqmExJTzhII9iNQ","stars":5,"date":"2017-07-20","text":"We've shared the mixed combo platter between 4 people and we did not leave the place hungry ;)  Darn those attentive servers who periodically come with steamy pillowy bread...\n\nThe falafel was a little bit denser than what I'm used to but still good.\n\nStill dreaming of the fries with garlic sauce and fattoush salad!","useful":0,"funny":0,"cool":0},
{"review_id":"1a9_FztvlRD5_9bF0IGBiw","user_id":"febUHTZsQZQ3WqYLQOxTUQ","business_id":"xU_QqrlaxXlf2SKoNIaGpg","stars":5,"date":"2014-05-26","text":"We decided to drop in after this restaurant was recommended to my dad by a friend. The place is moderately spacious but really homey - great for families. We ordered two gyros and the chicken souvlaki to go. The souvlaki was delicious, as were the fries on the side. My dad, a born-and-raised Greek, said the gyro was fantastic. The owners were so kind and welcoming, really wonderful people. To top it all off, we got a pretty hefty amount of food for a great price.  Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"rJhrQD3-b9GjTso0dxIkwg","user_id":"kzP96uX8TUMmmvLtd-I3RQ","business_id":"-MKWJZnMjSit406AUKf7Pg","stars":1,"date":"2015-01-03","text":"Drove 37 miles on a Saturday at 12:30pm for lunch.... to find the place CLOSED! \nNOT HAPPY !!!!","useful":0,"funny":2,"cool":0},
{"review_id":"hdt30kYFfyGB2y4GoDFBwg","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"_BurpVcmKZRovzqW4cm1qw","stars":4,"date":"2016-09-01","text":"This is a decent location, the only complaint I would have is the bar area is not lit very well. All of the bartenders I have been served by were wonderful, I think there is a girl named Sara there?? I'm not sure, I remember she told me it was her first day, this was a couple months ago, she was by far the best bartender I have had at this location!","useful":0,"funny":0,"cool":0},
{"review_id":"k31b2V6DRjdUo2i0H3L_3Q","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"fS9a8AGrcwWPf_9vfn5wPQ","stars":2,"date":"2016-08-24","text":"I have been coming here for a few years now and the service has steadily gotten worst. One server, who has been there as long as I've been going, Jesse i think his name is, hit on me and my friend, asking if we wanted to hang out later, even asked for our phone number.... I go here to eat, not to get hit on and made to feel like I need to leave because of some thirsty boy. Last time I was there, the girl who served me was very nice but never came to check how the food was and she never refilled my drink. I love the food here but if this type of service continues I will definitely be looking for another place of business to support.","useful":1,"funny":1,"cool":1},
{"review_id":"d-c9HA2NFWlCo77v4SV4ZQ","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"zwNLJ2VglfEvGu7DDZjJ4g","stars":1,"date":"2016-08-24","text":"5 stars for the food- i truly love the food here, everything is delicious and the margaritas are too good to not get \n5 stars for the service- any and every server I have had has exceeded my expectations! wonderful people!\nThere is one bartender there, I cant remember his name, he is maybe in his 30's, definitely heavier set guy, mexican and i think he wears glasses; I don't enjoy being served by him, I've overheard some sexually inappropriate comments coming from him concerning other paying customers in the restaurant. I find this highly offense and unprofessional, it makes me extremely uncomfortable and I also wonder what comments he has made about my body sexually.\nAll of the hostesses there are nice, friendly and full of smiles, except one, I dont know her name either. She is mexican, and last time I was in there she was handing out food, which was new, considering she is the girl who never smiles and makes it seem like it's a painful task to seat me. She always glares at me, never smiles, sighs when I let her know how many people are in my party and lazily walks us to our table. However, every other hostess I have ever come across here is all smiles, courteous and just as friendly as the servers.\n\nA couple bad apples can surely affect business, I know I avoid going to this establishment on certain days due to those specific employees. I have even mentioned something to the General Manager who simply replied, \"That is just who they are.\", with a smile on her face, like it wasn't a big deal and walked away. I was highly shocked, but with her attitude and lack of concern for the company, explains why those couple people act the way they do.","useful":1,"funny":0,"cool":0},
{"review_id":"Sm8WP4e3EmHUjHt5hrGZrg","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"lZ5rd3YxWTcCPJi45hvw7w","stars":5,"date":"2016-09-01","text":"I love coming here with my friends! It always seems to be busy but I typically do not wait at all. All of the servers I have had were very nice, as well as the bartenders. The drinks can sometimes be a little strong, which is a shock at first but I always appreciate it. The food is always exactly how I ordered it and have never had a problem with it, my favorite is the big mouth bites! so good!!!","useful":0,"funny":0,"cool":0},
{"review_id":"qI9CgE7d_Mwz8jAgnszHRw","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"9UvteZaWHpBbqrn5lv1uUw","stars":2,"date":"2016-08-24","text":"always has the worst servers. They take forever to realize you are there, and forever to get you drinks or food. If you need to order a drink, I suggest you go sit at a bar.","useful":1,"funny":1,"cool":1},
{"review_id":"MjCv5yUpJ4FEYMsVPO5jtQ","user_id":"CwVG-QYRdufyMH_oPPH85w","business_id":"Lm61pehc-oyqR6DBAAQNCg","stars":5,"date":"2016-09-01","text":"Love going here! My last two visits were decent. The server honestly, was rude, I do not remember her name; but seriously, every other time I have been here EVERYONE is so nice. Also, the potatoes seem to be slightly undercooked, again this is a more recent thing happening here, I am guessing there is a newer cook. The biscuits and gravy, Cajun omelet and the coffee are to die for!! Definitely somewhere you should try at least once, anyone I have every taken here has become a huge fan and always comes back","useful":0,"funny":0,"cool":0},
{"review_id":"3VyO4hA2leSJtl41lkgNVg","user_id":"Nd2evHJ_sbUA2bmnxdUz4w","business_id":"vi61pbWT6urr7_N5k0Tszg","stars":1,"date":"2014-08-25","text":"My meal was so terrible that I am writing this review instead of eating my food. I wish I could tell somebody but I haven't seen a server since one dropped off the food and left. This is literally the worst meal I've had in Calgary. Do not come here.\n\nI came back to edit this review because I can't get over how bad this meal was. The kimchi was terrible, the bulgogi tasted like nothing. The best part of the meal was the hot sauce that I used to provide some semblance of flavour.","useful":4,"funny":2,"cool":0},
{"review_id":"WwsLyhbRkAVoOj7eQWNQXg","user_id":"M8KZG9AxSaaJCyRZrHVXzg","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":5,"date":"2013-08-28","text":"HANDS DOWN the best burger joint!\n\nPros:\n+great service\n+amazing food\n+oxtail fries\n+kiki burger\n\nCons:\n-there isn't one in San Diego!","useful":1,"funny":0,"cool":0},
{"review_id":"ZQcT5McquK2ytp6gok_8PQ","user_id":"M8KZG9AxSaaJCyRZrHVXzg","business_id":"2weQS-RnoOBhb1KsHKyoSQ","stars":4,"date":"2013-08-28","text":"Pro:\n+food was stellar\n+dessert was beautiful and tasty\n+romantic feeling\n+worth every penny\n\nCon:\n-customer service\n-waited 15 minutes for someone to ask me what I wanted to drink\n-heard hostesses talking trash about every guest that walked in","useful":0,"funny":0,"cool":0},
{"review_id":"ngyaVZ24rP7LaVZiijXnLQ","user_id":"IPzhSrLQVIM58np2v7P2Ww","business_id":"1v6V9SRbMcFdbXnuTJhuvA","stars":5,"date":"2014-11-24","text":"I had Aaron tattoo a hummingbird on my ankle.  It looks fantastic!!!  Aaron, Sarah, and Heather were all very pleasant and professional.  I would highly recommend\nChic Ink Boutique to anyone who wants a great quality tattoo.","useful":0,"funny":0,"cool":0},
{"review_id":"HwRZtBXbQRbOrn9t0tJ0OQ","user_id":"OGx0rIsnkj-hubV_bmcKGw","business_id":"i0jiULli2gLvtxzsLDOC-Q","stars":1,"date":"2014-07-22","text":"First let me start by saying that I have NEVER in my life written a bad review, but was shocked by how incredibly rude and borderline abusive the female groomer Dana was!!!! I made an appointment a week ahead of schedule only to receive a call from Dana a few hours prior to my appt asking me to reschedule because she had overbooked herself. I let her know that I would not be able to do so, and she openly, and loudly, sighed over the phone about my not being able to change to another date and time. When my fiancee went to drop off the dog, and was 10 mins late so refused to take the dog at all! I was confused and called to ask why she wouldn't take my dog and she said it was because my fiancee was 15 mins late and that \"she can't help other people's mistakes\". If you do not have a 15 min window as a groomer then obviously you are doing a shoddy job and rushing. I explained to her that I was a little taken back by her attitude to which she hung up on me! DO NOT take your dog here, she is a nasty person with a nasty attitude!","useful":4,"funny":1,"cool":0},
{"review_id":"UQHWzFrzgqtcPIlWUJyOBA","user_id":"p6Zky5fJY6_tE716jchW_Q","business_id":"Qy26C1ewCj3GlQx7B-FAcw","stars":2,"date":"2016-09-18","text":"The pizza was good and I love the concept of making your own, however this location was filthy and service not so great.  It's a Saturday night and pretty dead compared to other places in the area.  There's 7 employees working and all of them are standing behind the counter not working. What's annoying is that there's not a clean table in the whole place, food all over the floor, etc.  One employee is on his phone texting and one is at the register dancing. What the hell? \n\nIt doesn't look like there's a manager on shift. What's sad is that they have a sign saying they're hiring, yet clearly over staffed with kids that aren't working.  I don't know that we'll go back.  If the place is that poorly run and dirty in the dining area, hate to know what's going on in the kitchen.","useful":6,"funny":0,"cool":0},
{"review_id":"wH2ue8uMSpCFC5N_vPv5VA","user_id":"p6Zky5fJY6_tE716jchW_Q","business_id":"gjQ20S96ScTc7LR_DY8SQQ","stars":1,"date":"2015-08-25","text":"We had used Nyah's a couple of times to groom our 3 little dogs.  My initial impression was great because they seemed to be so kind and caring towards our kiddos.  However, from a business perspective they are terrible.  They are very difficult to get a hold of, whether if it's to make an appointment or ask a question.  We had an appointment and when I called earlier in the week to confirm the time, I did not get a response.  The morning of the appointment I reached out again to ask how much time they'd need for our dogs because we had a potential conflict and had to leave the house 3 hours out from what I was guessing was our scheduled time.  I thought maybe we could do 2 of 3 dogs, but wasn't sure if we could get all 3 done.   When I did get a response back, it was a text saying they were cancelling our appointment entirely.  No call to answer my initial question of how long they'd need or a discussion to figure out an alternative solution (I could have easily had my mother come to the house).  Then Mitch went on to say that they might not be the best service for us because they prefer customers that have recurring appointments and they were raising prices.  A...they never discussed a desire to have recurring appointments, which we'd be happy to do if we were aware it's a requirement and B...there had been no discussion about a change in pricing.  Instead they cancelled on us within hours of our appointment and implied I was lucky they weren't going to charge me a cancellation fee.  Then I find out they decided to groom other dogs that were in the neighboring house they were at that morning. This was ridiculous.  Clearly it was more convenient for them to take this other client and cancel on us, but this is poor business.  It has taken us weeks to get scheduled with another mobile groomer to take care of our dogs (which I have found to be much more professional).  I would not recommend this service due to poor communication and business practices.","useful":3,"funny":0,"cool":0},
{"review_id":"IDXzZ-tECOYZcGlsHuhByw","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"dQ7NeQpWpyDvrfzI9GOD8g","stars":1,"date":"2012-07-25","text":"I called and talked to somebody about ordering a cake for my dogs birthday.  They said, \"No problem, we will have it ready for you today.\"  Now, a typical person would believe that to mean you will have your cake ready for you when you go to pick it up.  So, I leave work to go pick it up and this is not even close to me.  I get there and the doors are locked.  I look around and see a post it note on the door saying, \"Sorry cake guy, hospital issues.\"  I understand that things happen, but at least give me a call and at the very least, use my name!  Luckily, Boneappetit in Ahwatukee was able to accomadate me with a couple of pupcakes in a pinch.  My point: I never even got to check out their store or products, but I would never go back because of the terrible customer service I received.","useful":3,"funny":3,"cool":0},
{"review_id":"Ut-lWwAk5SY4YbkJ3Wyr0g","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"SAae44V24aD7y_HpgxjhPA","stars":4,"date":"2012-09-24","text":"Nando's has some really good dishes and an atmosphere that is not typical of East Mesa........it's actually fun.  The number one item on the menu is the Pollo Rico.  I won't describe it, just order it.  It's delicious.  Gets a little crowded at the bar early with the old Las Sendas people that, for some strange reason, think they are the true upper crust of America, but push them out of the way and find a seat at the bar, where you will get good service.","useful":1,"funny":1,"cool":0},
{"review_id":"QAPws6W1s1CryTGBWIKkKg","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"nsNONDHbV7Vudqh21uicqw","stars":5,"date":"2012-08-14","text":"I think I have eaten here a dozen or so times.  You think you can't get good seafood in Arizona, you're wrong.  This restaurant is amazing!  Their seafood is always fresh and tasty, the bread you get before your dinner is spectacular, the service is some of the best I've ever had, I can't say enough good things about this place.  Yes, it's expensive, but you get what you pay for.  If you don't normally go to nice dinners but have a special occasion, try the Salt Cellar.  Like I said, I have been there about a dozen times and I have never had a bad experience.","useful":8,"funny":0,"cool":0},
{"review_id":"c1_B1eJseMzZMqltnJM6jA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"lsKv0IDdj3c6Y8bT6taxSA","stars":4,"date":"2012-08-15","text":"Lou's has great service and great food.  Their drinks are strong, but a little pricey for a neighborhood bar location.  Overall, a good place to grab dinner and have a drink.","useful":0,"funny":0,"cool":0},
{"review_id":"_B_Mewwohb8er8fnyPIRNQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"2FBJzvGuSqlvjjm7Yr3pAQ","stars":1,"date":"2014-12-05","text":"If you want your child to sit in a bouncer or crib and cry all day unattended, take them here.  They care about your money; they make that very apparent.  They do not care about the well being of your child.  I can speak from experience.  Do your child a favor; find a place that is not so sterile and unaccomodating.  Like I said, their only concern is your money.  They do not provide anything other than a place to store your child when you have to work.","useful":6,"funny":0,"cool":0},
{"review_id":"v66ntBAIlSV8BuafINEgAQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"u4TVM_6Ya1FBRszxcBROWA","stars":5,"date":"2013-01-22","text":"I just bought my 3rd and 4th bikes from Tempe Bicycle last weekend.  I have never had any complaints, unlike most of the reviewers here!  I got my new MTB for about $500 less than I have seen elsewhere and my wife's road bike for about $200 less.  Overall, this was another plesant experience purchasing bikes.  Yes, the bikes are expensive.  Bikes are expensive everywhere!  They are no more expensive here than any other bike shop in town; usually cheaper.   I have also had great customer service here every time I have been in.  I definitely reccomend.","useful":1,"funny":0,"cool":0},
{"review_id":"gCMIDhT418uTuujJ2RQS5A","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"pYZnKIv0z-UxrpgBjp_z1w","stars":5,"date":"2013-03-05","text":"Definitely the best bagel in the valley.  They have great lunch sandwiches as well.  They bake their bagels fresh all day long and have a ton of awesome flavored cream cheeses that are all made there too.  This place is a must if you want a great bagel!","useful":0,"funny":0,"cool":0},
{"review_id":"KL8DrvQLYb9oDINOsHpSRA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"PVTfzxu7of57zo1jZwEzkg","stars":3,"date":"2012-09-24","text":"This place is ok.  Definitely overrated.  The food was decent but nothing memorable, the service was good.  Cool atmosphere and some pretty good drinks too.  You will pay for your average food too.  For my wife, my friend and myself (with at least a few drinks each) our bill was climbing over $200.  Normally I wouldn't complain about this, but I would expect way more flavor for my money.","useful":2,"funny":0,"cool":1},
{"review_id":"tJLNb74YjwYakTq5k7gR3Q","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"2pMT5SBfn4oGr_Ae1tp8vQ","stars":1,"date":"2012-08-14","text":"Let's just say this, if you are white trash, you will love this place.  You truly will fit in perfectly, since that is all that frequents this fine establishment.  Their food is not fit for humans, their service is very sub par, their clientelle is, as I've already stated, rather Apache Junction-like and the atmosphere is just depressing.  So come on down and make sure to wear your finest Metal Mullisha T-shirt and bring multiple packs of cigarettes to enjoy on their smoke filled patio, with the rest of the toothless patrons.","useful":10,"funny":8,"cool":1},
{"review_id":"cj7HN4uVs1tym3UpbFQzGA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"VYLQ3bMCqmHiNO2FS8aAsg","stars":1,"date":"2012-08-15","text":"It's painful to say this, but I would prefer Pizza Hut over this awful pizza!","useful":2,"funny":0,"cool":0},
{"review_id":"zvLXb8QEB42OEcq2TepfIA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"g5l4vrFN03ob_zDDztDDjA","stars":3,"date":"2012-08-22","text":"They do a pretty good job washing my cars.  I go here a few times a month and have had very few negative experiences.  Their oil and lube department is pretty bad though.  Do yourself a favor and skip the extremely overpriced oil change.  Go get it done at a reputable dealer or local garage for half the price.  I had back to back oil changes there once.  The first time they said my air filter needed to be replaced, so I did the lazy thing and had them replace it.  I came back 5,000 miles later and they said my air filter needed to be replaced again........really?  They will reccomend services you don't need.  Come here for a carwash only.","useful":0,"funny":0,"cool":0},
{"review_id":"LDZZr7kEGOdxWk8M19FRUA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"iXUxp09odGN2qhdPU6TKYQ","stars":1,"date":"2012-04-02","text":"Financing department and service department are the two most dishonest and disappointing departments ever.  Here's the story...........  I bought a 2009 Maxima from them in December.  I got what I wanted, traded my truck that was falling apart for a newer, nicer used car from Horne Kia.  I went in there with a loan from my bank already approved so I didn't need their financing.  I went in there with the loan approval number and was happy when they told me everything was good and they would get the information about my new car to the bank so they could complete the loan.  They didn't.  They opened a new loan with my bank so that they could make some money off the new loan that they started.  Now, this normally wouldn't be that big of a deal, aside from it causing my credit to be run again, but they lied about it to me, which is unacceptable.\n\nSo, with the purchase of my new, used car, I get a free oil change when it's due.  This brings me to this last Saturday, when I brought it in for it's first oil change.  I made an appointment for 9:30AM on Saturday to do a basic oil change.  My wife and I drop it off and they tell us it will take and hour and a half to an hour and 45 minutes.  No problem since they seemed rather busy, we'll go get some breakfast.  So it's after 12:30 and still no call, I figure they may have forgotten to call us and we just head back there since it's been three hours.  Much our dismay, we get there and it's still in the same spot it was in when we left.  I go into the office, which is now virtually empty, and speak with the service advisor I dealt with earlier.  He tells me that they had to go get an oil filter from a parts store since it was a Nissan they were working on and they were a Kia dealership.  Well, that makes sense if I hadn't made an appointment 8 days earlier and they weren't expecting me.  But here's the real kicker; a 2009 Maxima takes the exact same oil filter as virtually every Kia from 2008 and before, as well as some 2010 Kia's.\n\nApparently this service advisor thought I wouldn't know this, as most people wouldn't, I'm sure.  When I asked him again what part it was they had to go get from a parts store, giving him the chance to be honest with me, he lied again.  Therefore, I presented him with this information and he instantly turned quite sheepish, not knowing what to say.  I proceeded to tell him that all we wanted was some honesty and they obviously don't deliver that at this dealership.  My wife and I walked away and he had nothing to say.\n\nCase and point: NEVER DO BUSINESS WITH THESE PEOPLE.","useful":4,"funny":1,"cool":0},
{"review_id":"G-_pW-zQsGYGIA53l6DnzQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"oUvqwPJkorOnYZFKRt0oEg","stars":5,"date":"2012-08-15","text":"I love this restaurant.  If you are looking for good Italian food in the East Valley, you must travel to Baci.  Their pasta portions are huge and delicious, the bread they serve before the meal is great as well.  I must reccomend the cannolis, as they are to die for.  I'm not sure why people have said it is expensive, because it's really not.  Maybe they thought they were at Olive Garden and were expecting unlimited salad and pasta, who knows.  But hands down, the best Italian food in the East Valley.","useful":0,"funny":1,"cool":0},
{"review_id":"LpC5PMDXi832GfgnWjPdAw","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"L_Gffnv086h8wGaAiFxhIw","stars":5,"date":"2012-08-15","text":"Had my invisalign done by Dr. Woolaver and couldn't be happier with the results.  Great orthodontist and an exceptional staff make you feel right at home every visit.","useful":4,"funny":2,"cool":2},
{"review_id":"flp_Pkvl2eZnpAQ0czk2Qg","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"szhD1-esquzkQd0HDkbUOQ","stars":1,"date":"2017-07-06","text":"The absolute worst care ever.  They care about one thing and one thing only, taking your money.  The ladies at the front are extremely unprofessional and could not care less if your health is taken care of.  I am a patient of Dr. Rudgear for the last 7 years, although I've never met her.  I see Melissa Prince who will not give me the medically necessary care.  I am absolutely appalled by this place, as is the rest of the Yelp community apparently.  I will never go back here and you should AVOID AT ALL COSTS!","useful":6,"funny":0,"cool":0},
{"review_id":"HECB3NTnaaHX3vF6WIP9oQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"3k7BxyPCE60d-5GlU8hE0g","stars":5,"date":"2012-04-02","text":"These guys are honest, have unbeatable prices and fix the problem right the first time.\n\nI've been taking my two cars and our work trucks here for a couple years now.  I have no complaints.  If something doesn't need to be fixed, they won't try to tell you it does to make more money.  Fast, reliable service.","useful":3,"funny":0,"cool":0},
{"review_id":"fhJaTBiQd5-BWXUHrhzNbA","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"7tdVsSDXRKtLLC-fD1hJ-A","stars":5,"date":"2015-12-02","text":"I love Nando's!  Pollo Rico is amazing, as well as the enchiladas ongo and enchiladas del mar.  Great drinks and local craft beer on draft.  Try it.","useful":0,"funny":0,"cool":1},
{"review_id":"zatApNkt45nEZuqZOAkjYQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"Gh-qmVwvibLnNdqEZXcQHw","stars":5,"date":"2012-08-20","text":"The Golden Gate sandwich.  What more can I say?  I have dreams about it.......good ones.  Pastrami, bacon, swiss cheese and 1000 island dressing on a tasty sub roll and then baked.  This is my favorite sandwich in the valley.  Pair it with the homemade chips and bbq sauce and you are sure to be happy.\n\nThe place is really nice too.  Great selection of wine!","useful":1,"funny":0,"cool":1},
{"review_id":"5ZEoXwX3hJBzLNMN5xBrxQ","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"7ZAQHYwS4SlY2nDkQF54tQ","stars":2,"date":"2012-08-14","text":"I have been here four or five times and each time it gets a little worse.  Not the worst cafe I have been to, just nothing special.  Their sandwiches are small and the bread is not good.  The cookies are about the only thing worth going back for.","useful":3,"funny":1,"cool":0},
{"review_id":"3EvkBa4bLWuqD9hLedTmYg","user_id":"f59f2MbYILQznPvc9iBDog","business_id":"Rc3WSNqLq9Vd0bCFts-E_Q","stars":5,"date":"2012-07-25","text":"Very friendly staff and the pupcakes were awesome.  Bruce and Linda loved them!","useful":1,"funny":0,"cool":1},
{"review_id":"R1bu6Bn-g9LDHLPJZXquTA","user_id":"oXsS-D6Db-YNrD9GuIFQUw","business_id":"ufA5ebLmVAqCuhMrApaONg","stars":5,"date":"2016-04-26","text":"Good sandwhich, great customer service. Here on vacation & i like off the beaten path places. Owner took our order with a smile & entertained our kids as well, super nice people. I had a pastrami & wife had a 62 (turkey, bacon with sprouts & avacado on a roll). Both very pleases with the food & very happy with service & owners. Busy place for being small so i knew i chose right. They do breakfast as well i guess","useful":0,"funny":0,"cool":0},
{"review_id":"2YgnTHHU1n7b5Y50ZIwehw","user_id":"7JiDBFX_OlO0sDnEecE11A","business_id":"3b-jZX9Ms0U9B2Oy_ZmNMA","stars":4,"date":"2017-07-14","text":"I was very pleased with the service and quality off the food and sushi! Will definitely be going back!","useful":0,"funny":0,"cool":0},
{"review_id":"626qeebCelT6I6wXDQ3HzQ","user_id":"7JiDBFX_OlO0sDnEecE11A","business_id":"QDJ0UYHK5lDWiniL-ALM-Q","stars":5,"date":"2017-07-14","text":"Very clean gym with LOTS of equipment! The staff is great, especially Sarah! Happy to be a member.","useful":0,"funny":0,"cool":0},
{"review_id":"JJgLt9xvyuM0In3vwNTB-g","user_id":"sHSZnywTcjMEnxKyD1JMTQ","business_id":"Do4n_yK_K6DmR9_Es5qwlA","stars":4,"date":"2011-10-19","text":"Excellent coffee and lattes...They serve FONTE Coffee!\nHot cinnamon bun is delicious\nStaff is welcoming and friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"KdtwpSZp19grH1tCUKePRw","user_id":"sHSZnywTcjMEnxKyD1JMTQ","business_id":"AyEtowSGi9vx0-xFfrgjWw","stars":5,"date":"2011-10-19","text":"Visit vegas several times a year, always in search of a great latte...\nI have found it here!","useful":0,"funny":0,"cool":0},
{"review_id":"21pS36RmJwz2wHUOaqQERQ","user_id":"ckR-iJwmLfzW605O6IqYwA","business_id":"gQHvqWLvqOlSi_A0WkLLog","stars":1,"date":"2013-08-08","text":"This dealership sucks... Nick Taylor told us we were pre approved had a bank and everything and come down to sign papers and we would have a car. so we did that and had the car for a week ad five days they calls us to tell us we need to return it because they dont have a bank to finance us. So we were told one thing and they did another and act like oh well ooopppsss sorry. Dont go there to get a car they do not follow through with what they tell you... they give salesman a bad name. Now that he isnt getting a sale he will not return phone calls.","useful":0,"funny":0,"cool":0},
{"review_id":"9W0jU9H-QblGsIM9u7L8SQ","user_id":"CFCGYFFx_CuvDsSVTIpcGQ","business_id":"QuytwC8LramTP7QJ-SxFsA","stars":5,"date":"2015-08-15","text":"We had the pleasure of dealing with Brandon during our wedding at the Cosmopolitan on Aug 4, 2015 and he is without a doubt the best photographer I've ever dealt with in the 8 wedding parties I've been a part of.  \n\nYou know a good photographer that is selective with his shots and is confident that he has it right the first time.  I was amazed at how few shots he seemed to take, yet on receiving all our photos, we had about 300 and he nailed them all.\n\nThe turnaround was also amazing, we had our wedding on a Tuesday and had all the high res, edited shots in our hands by Friday.  He is great with lighting on the shots, and creates very interesting angles, at no point was the flash ever attached to his camera and placed in some corner of the room creating a great atmosphere to his photos.\n\nHe's great at making people feel comfortable, capturing candid moments and making it not feel like a chore.  To put it simply, I could not recommend him any higher, he is incredible at what he does and we couldn't be happier with the photos he produced.  \n\nMost people come away from their wedding with 5 or 6 favourite photos, we have the tough decision of narrowing 30 or 40 down to 4 or 5 to hang on the wall at home.","useful":0,"funny":0,"cool":0},
{"review_id":"7bTSV_7vE26k6gxxwfBNAA","user_id":"r72WH0xn-Zd0LyE37o7BCQ","business_id":"-Nol0FMWThU8s3QflnNEFw","stars":5,"date":"2015-02-26","text":"This is by far the best dentist I have ever been to!! I walked in for my apointment and was seen right away. The teeth cleaning was painless but thorough. The chairs are very comfortable and they have a personal TV for you to watch with Netflix. After visiting a different dentist I was told I needed a crown, and it would require two separate visits. I came here and they made my crown for me and put it on in no time at all! I highly recommend checking this place out if you haven't already.","useful":0,"funny":0,"cool":0},
{"review_id":"p8YlaZGkLmScDNX9S4qwyA","user_id":"0XBcxo8YkpHHyTn-ZWh1HQ","business_id":"IQjHRGMSXXGN9MHPdsvk8w","stars":5,"date":"2014-09-27","text":"The entire purchasing experience was fantastic! Everyone was willing to go above and beyond to make our time in the dealership as enjoyable as possible. I felt like we got a great value between the vehicle and the service!","useful":0,"funny":0,"cool":0},
{"review_id":"IV8G-7NRogYwA4FGMB63Kw","user_id":"0XBcxo8YkpHHyTn-ZWh1HQ","business_id":"0Dkf38oJU7GphwXC_gCBbg","stars":1,"date":"2014-11-21","text":"Wanted to go here during our trip to Vegas this Christmas. Confirmed by email that they would be giving rides around Christmas. Then bought the Living Social, filled out the booking request form on their website, then ... NOTHING! No confirmation. After several unanswered emails, I called Living Social for a refund. Turns out, the business had already marked my voucher as 'redeemed' even though I have not yet been to Las Vegas. Note: it is their policy to NOT answer phone calls\/return messages. In my case, apparently, it's their policy to not respond to emails either.","useful":4,"funny":0,"cool":0},
{"review_id":"f4UzSrCN9FhgSv2zd36jaQ","user_id":"0XBcxo8YkpHHyTn-ZWh1HQ","business_id":"EnTVeyh_8WzOaWrEJDWaZA","stars":5,"date":"2014-09-20","text":"Dr. Leuthner and Staff at Petcare Animal Hospital are wonderful! We have been taking our older kitty to them for over a year now. Our kitty has chronic medical needs and Dr. Leuthner has taken great care of him - helping us manage his symptoms at home & in the clinic when needed. He is very knowledgable & explains all treatment options available. The staff there are all incredibly helpful & friendly - always so accommodating!","useful":0,"funny":0,"cool":0},
{"review_id":"FpE_HGW_VyKGhVOrioynPQ","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"7-Ba9uSmYYpXgnQRoIPxMQ","stars":2,"date":"2008-06-07","text":"I love love Cuban food so I was thrilled that there was a place so close to me.  Unfortunately, this place was a big letdown.  I've gotten food here twice and both times were mediocre at best.  I ordered the cuban sandwich the first time and the fillings looked as though they were just thrown in.  And they forgot my fries and when I asked for them, I got a side of cold, limp ones.  Next time, I got the lechon asado and it was really fatty (I know this isn't a lo-cal dish, but there was almost more fat than meat), the sauce was really bland (couldn't even taste the bitter\/sour orange) and the onions were cooked until they were mushy.  Also, the servers weren't very friendly during either visit (big negative for me).\n\nThis is very sad since I was really hoping for the best for Havana Grill.","useful":3,"funny":0,"cool":1},
{"review_id":"2GNvIVYFTJzymMVWkKm-8w","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"irDgKDkvrma1jFN_mRgQ_g","stars":5,"date":"2008-06-03","text":"I've been lurking on yelp for awhile now, just reading reviews, getting suggestions, etc.  But after trying true island bbq today, I decided to man up (woman up?...whatever, you get the gist) and start posting.  Why? Because this place is ridiculously good!  Like others have said, Darrell is fantastic.  Very friendly and quick with the suggestions :)  I had the shish kabobs with red rice (8.75), and it was worth every penny.  Darrell was nice enough to put the hot sauce and salad dressing on the side for me (I didn't even have to ask) since I got my order to go and that hot sauce!!  Tart, garlicky, spicy...amazing.  Everything was super fresh and delicious!  So hurry up, don't just meander along, and get yourselves over there.  If not, I'll prob. end up eating everything before you get there.","useful":0,"funny":0,"cool":0},
{"review_id":"oC66Lw3hLiB19X3a4WSf7A","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"JECKrOvqJ_faoW_QxyeEAw","stars":4,"date":"2008-10-29","text":"Definitely not authentic, but nonetheless the food is awesome.  I've been here twice over the past two weeks and I'm a huge fan.  First, the drinks are great.  Margaritas: I've had the traditional and strawberry and both are excellent.  They also have a good variety of beer on tap.\n\nPortions here are pretty big so come hungry.  The carnitas and roasted chicken are juicy and come with great sides.  Good salsa and guacamole as well.\n\nAnd I've found the service to be great on both occasions I've visited the restaurant.  Prompt attention but not so much that it becomes hovering.  Plus the place has a beautiful bar area that's great for a relaxed dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"7NWRt7P2g30kvimW6mUKEA","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"wtcMoqKiaxkFPZj0BC9jlw","stars":4,"date":"2008-06-03","text":"Very friendly owners\/servers and decent food.  A mostly Korean menu with some Hawaiian BBQ, burgers, etc. added on.  The food is fresh and hot but not the best in terms of flavor (maybe not enough seasonings?).  (Pass on the fries.  Bibimbap and volcano pork are quite good.)  But as service counts for a lot in this girl's book, I'll stick to my 4 stars.","useful":1,"funny":0,"cool":0},
{"review_id":"-iE8cOG4lok0sUY5Z3hEgg","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"SAfuIUZMXrOnb3LWyvYjDA","stars":3,"date":"2008-06-03","text":"Very, very nice and customer friendly owners gets this place 3 stars, but on food alone I give it 1.5 stars.  Though it's nice to have a Korean place so close by, Jun's House food isn't what real Korean food should taste like.  First, shitake mushrooms should be reserved for just a few dishes since they're so pungent.  However, Jun's seems to place it in many dishes (including the yuk-hae-jang, or beef and veggie soup) which is a big big BIG mistake.  Instead of a spicy, savory soup, all you taste is shitake mushrooms.  The banchan (side dishes) are subpar as well, esp. the kimchi (bland and sad).  And don't get me started on the kimchi soup.  Using \"raw\" kimchi in kimchi soup is unheard of...I had no idea why it was so strangely sweet until I called my mother to ask.  And lettuce in the bibimbap?  Just weird.  But the BBQ is decent so if that's what you're looking for, Jun's shouldn't disappoint.  Jun's food made me grumpy and now I'm grumpier because I'm posting my first negative review.  Thanks a lot, Jun's house.","useful":2,"funny":1,"cool":0},
{"review_id":"A_VCBVr6-uyo1frXep2XGw","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"84D3me3nDXXWDBzT0qcbbA","stars":4,"date":"2008-06-03","text":"Nice place to go out for a relaxed night with friends...you know, when you don't want to get all glitzed up or have to deal with strip crowds.  Nothing fancy, but good drinks and decent food.  And mini-bowling of course.  That mini-bowling got Roadrunner two stars off the bat.","useful":0,"funny":0,"cool":0},
{"review_id":"ud-jYRqe0opK6js4e1LRrQ","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"grx2VIhIT7LpK0-kthPHzQ","stars":4,"date":"2008-10-30","text":"Wow, I'm surprised with most of the reviews here because I am in love with this restaurant.  I've been here a good dozen times since it opened and can't get enough.\n\nStart with the grilled artichoke appetizer.  The chef takes a whole (giant) artichoke, removes the choke, steams it until almost done and then finishes it off on the grill.  The artichoke comes out sprinkled with Parmesan cheese and with a mustardy dip on the side.  Amazing.\n\nAlso, the salads are delicious.  My personal favorite is the seared ahi tuna salad.  It comes with a great champagne dressing and a huge serving of sesame encrusted seared tuna.  So good.  The steak cobb salad is also really good with melt in your mouth croutons, avocado and a great dressing.\n\nI've always had great service here and the food is consistently great.","useful":1,"funny":0,"cool":0},
{"review_id":"qnUY103c9SaoDc4wAeWrBg","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"5Dccw539NNtnyCgTu5ed5A","stars":3,"date":"2008-10-29","text":"It's great that Thai House is so close to my house because I have some major Thai cravings.  That being said, I've found this place very hit or miss.\n\nHits: fresh veggie springrolls, red curry, pad thai, chicken wings.\n\nMisses: the soups (I've tried at least 5, and to me they all lack flavor), fried rice, roasted duck.\n\nAlso, the staff isn't the friendliest.  Even when there aren't many people in the restaurant.  Not rude, per se, just not very welcoming.  And if you come during dinner, expect a considerable wait until you get your food.","useful":2,"funny":0,"cool":1},
{"review_id":"pLktnpxdvPzx3HVYu1eZTw","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"rOqY1Vj8sQ6kL9XLVQRslw","stars":4,"date":"2008-06-15","text":"Cupcakes!!  Who doesn't love cute little \"all for me\" morsels of cake?  This store is adorable and the delicious smells waft all the way to the parking lot.  The cupcakes themselves are gorgeous (slight concern though: is it safe to eat glitter???).  And they're delicious to boot!  My favorite is the mounds of joy (coconut cupcake - no flakes, just yummy coconut smell and taste, dark chocolate frosting and coconut flakes on top).  The ganache and carrot cake are fantastic as well.  I actually didn't like the red velvet so much...it was really dry and the frosting was too gloppy for my taste, but everyone else seems to rave about them so maybe I just got a bad batch.  Warning, once you have one, it'll be really hard to stay away!","useful":1,"funny":0,"cool":1},
{"review_id":"siX1MnkKZeQywkYDDq0dYw","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"ajWLpOe3wcLrlu2CNjdAGA","stars":3,"date":"2008-06-10","text":"Like Monica, I never had the chance, prior to moving to LV, of trying Brooklyn Bagels, and I have to say that I was a bit disappointed.  I've been to this location many times because it's so close to where I live.  And I agree that the employees are always very cheery (even early in the morning) and eager to help.  My problem is that the bagels I've purchased have been very hit or miss.  Sometimes they're fantastic, crisp on the outside and pillowy on the inside...other times, they're hard (stale-like) and really dry and crumbly on the inside.  It's hard to rate this place higher than 3 stars when half the time I can only eat half the bagel before my jaw gets tired of chewing and chewing the rawhide-like bagel \"crusts\".  It doesn't mean I won't still go here once in a while, but it's always a crapshoot (sooo apropos in Vegas ;)).\n\nOne big plus: the coffee is always fantastic.  Much better than the starbucks next door.","useful":0,"funny":0,"cool":0},
{"review_id":"wtIVH4-CibnMndWFA3piLw","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"UYh1N1xQhOh-a7nX92xPzQ","stars":5,"date":"2008-06-06","text":"Hands down, my favorite restaurant in Las Vegas.  I've been there 5 times now and have left completely satisfied each time.  The restaurant itself is beautiful and has indoor and outdoor seating as well as an indoor and outdoor bar.  Since Brio doesn't take reservations, you'll often have to wait a good 30-45 minutes which is plenty of time to get yourself is peach bellini (yes, it's girly and frothy) which is wonderfully refreshing and not too sweet.  The waiters are all very attentive, even when the place is slammed, which is a nice change from the LV norm.  \n\nFood wise: the bread you're served upon seating is piping hot and delicious; the lobster bisque is amazing; the brio chopped salad is great (but I recommend getting the balsamic dressing over the red wine); caprese bruschetta is delicious, as is the roasted red pepper brushetta (blanking on the name); and those mini desserts (creme brulee especially) are the perfect endings to a great meal.","useful":0,"funny":0,"cool":0},
{"review_id":"RG023nZP9d0v24ASw95wqA","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"B7XwqO9Lbzq-VtOiRobfCg","stars":5,"date":"2008-11-01","text":"Incredible burgers!  LBS is located inside the Red Rock Casino and features all organic ingredients (even the ketchup is organic!).  It makes everything, including buns, patties, pickles, and fries, in house.  The buns are soft and so fresh.  The burgers are juicy and cooked perfectly.  The fries, that come with a special fry sauce, are crisp and delicious.\n\nLBS is great because it provides great choices to customize your burgers.  The LBS burger sauce is just slightly sweet (akin to a steak sauce) which some of you may not like.  But you have a variety of sauces you can substitute on your burger, including a horseradish one.  Yum!  There are also varieties of cheeses and toppings that ensures everyone will leave happy.  Definitely the best burger I've had in Vegas.","useful":1,"funny":0,"cool":0},
{"review_id":"pxnjQbx_Gt8lTzsq_ZBLFA","user_id":"X-IK7d1JIKVPWhgeiPO3pA","business_id":"ogaoL2WXjbL6BJkgzL7TYA","stars":1,"date":"2009-01-09","text":"Wow, I couldn't have had a more different experience from Cindy's.  First fyi: the company charges 80 dollars an hour (for two movers).  There is a minimum 2 hour block to use the services.  And there is a one hour \"driving\" fee of 80 dollars to initially get to your place.  So, the very minimum the service will cost is 240 dollars.  Seemed pretty reasonable.\n\nI hired All My Sons to move the furniture from a one bedroom apartment to a different unit in the same complex.  The new apartment was about 100 ft away from the first so there was no real \"driving time\" involved during the actual move.  All I really needed moved was a dining table, desk, bed, dresser, small file cabinet, and nightstand.  Shouldn't take more than 2 hours, right?  Wrong.  The workers moved slower than tar and continually used my bathroom and drank all my bottled water.  4 hours later, I just asked them to stop and said that I would pay what I owed.  Over 500 dollars later, I was still left with a ton of stuff to move on my own.  Also, they taped shut my dresser drawers and file cabinet doors with a tape they assured me would not damage the paint.  And when I started peeling the tape away, half of the paint came off with it.  They do not take of belongings and they scratched up the entire surface of my 1 month old white desk to the point I had to paint the entire thing over in a dark color.\n\nIf you're in need of trustworthy movers, try to use bekins or another more well established company.  You'll be much better off paying the slightly higher hourly rates for workers who actually work and don't damage your belongings.","useful":33,"funny":1,"cool":2},
{"review_id":"ygewwni0yXUeNrg8ElYLzw","user_id":"o865-7pvsMdSEowBbdp-bw","business_id":"tA5mqEP68qjbTFK9c14D7A","stars":3,"date":"2015-06-19","text":"Not my cup of tea. Although from many other reviews people seem to like this place. I'm not saying it's bad but I am very particular with my hot pots and like to have a garlic sauce similar to boiling points condiments. \nThis place does serve good food and looks delicious but I am a sauce person and similar to my joy pot I like popcorn chicken with sweet and sour or spicy sauce. Something along the lines with a flavorful taste so I don't just taste the fried chicken breast. \nIt may be due to the many Asian fusion places in my area. Living in SGV (San Gabriel Valley), which leaves me to make a drastic opinion based on things that others may not even care for. But overall presentation and quality is pretty good but I would not come back.","useful":2,"funny":1,"cool":2},
{"review_id":"d4B6HZdWavireprHoLF4fg","user_id":"o865-7pvsMdSEowBbdp-bw","business_id":"cYwJA2A6I12KNkm2rtXd5g","stars":5,"date":"2015-02-09","text":"Pro tip: be prepared to wait. The restaurant is located near the entrance of the Planet Hollywood Casino. I went for dinner at around 6 and was seated at about 7:30 pm, BE PREPARED TO WAIT! Especially for dinner, I had a party of 3. If it's just a couple they will most likely have you wait in line in front of the restaurant. The hostess were very snotty and I was not told any party that's isn't for two must check in with the hostess and they will text you when your table is ready. I waited for about 20 mins before a hostess came to get information for each couple. At that point I was told to give them my information. There was a huge misunderstanding. Be various of the line, it is best to check in with the hostess first.\n\nOnce we were seated, I started off with the sweet potato fries which where delicious. The food overall was probably one of the best gourmet burgers I had. Although I am not a huge fan of over easy egg, the duck bacon was spot on and the combination of both gave it a great pazzaz.\n\nOverall the is a must if your in Vegas. Defiantly worth the wait, it may be pricey for what you are getting but the burger was a mouthful. I would recommend to be spontaneous in what you order because Gordon Ramsey special designed each dish. A job well done!","useful":0,"funny":0,"cool":0},
{"review_id":"9c5xCD1GsGogeTYw1Ovw-w","user_id":"S63aoGafWASTkpC_dWygEQ","business_id":"zzYaAiC0rLNSDiFQlMKOEQ","stars":1,"date":"2017-08-17","text":"The harlot who rides the beast is the church. The beast must be the governments. How can you teach love and promote bigotry, support \" alt right\", through Trump? The people I loved there have so much hate in them. How? My heart is broken.","useful":0,"funny":0,"cool":0},
{"review_id":"ev6Nw1-VvT6lEgI1zPdGpA","user_id":"SxCe6smCv_rnyTWRpXZApA","business_id":"Dnn7JsdmvJ0_spWu9wo2kg","stars":3,"date":"2015-06-30","text":"I went here a few weeks ago because of all the reviews raving about it, and because it's just down the street from me. Overall the service was alright. I walked in and ordered my food at the counter. (I got a Ruben with their house-made chips) The cashier told me I could take a seat wherever and that my food would be out soon. After around 5-7 minutes they brought out my sandwich. \n\nThe sandwich wasn't bad, but it wasn't mind blowing either. Honestly, I just felt like a regular sandwich, which is fine in my book. Their homemade chips are pretty decent too. \n\nAll in all, the restaurant really isn't bad, but it's nothing to write home about either. If you're out and just want a quick bite to eat that's close by, this place is a viable option.","useful":0,"funny":0,"cool":0},
{"review_id":"625a2zdPf7F7vrsmRv8djw","user_id":"SxCe6smCv_rnyTWRpXZApA","business_id":"L6RxkP8dneVGelDLUhjCug","stars":5,"date":"2016-01-19","text":"This place is great, the owner is very kind, and the food is great. They honestly do their food better than a lot of places in china town. The second I walked in, the smell of the bakery had me hooked. The food takes a little on the long side to come out, but the service is good enough to make up for it.","useful":0,"funny":0,"cool":0},
{"review_id":"ykCRcT3LZTnktq1UKhmO5Q","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"1_rqZz1K5Uoq2RvZlINfgA","stars":5,"date":"2010-09-16","text":"Cho Sun Ok\nTheir menu features a wide variety of dishes - mostly typical Korean fare. However, people usually go for their cold noodles. They also feature an extensive list of Sundae (\"soon-deh\") dishes, which is Korean sausage made with pig organs and intestines. Observing the other tables, I noted that it wasn't as popular as Naeng Myeon. However, keep in mind that it was a hot summer evening and the cold noodles are just that good. I personally like Sundae (spelling it like that is making me want ice cream...argh. I better switch to Soondae), and encourage you to try it!\n\nChik Bibim Naeng Myeon (Thin arrowroot noodles with a special sauce)\nWin!\nThis was perfect for the hot day. The slushy broth, cooling veggies, chilled arrowroot noodles, and sliced hard-boiled egg made this the most satisfying bowl of noodles that I've had in Toronto. I chowed until all that was left was a puddle of the \"special spicy sauce\" which I loved. From what I observed, it's essentially hot pepper paste (gochu-jang), hot pepper flakes, and probably a bit of soy & minced garlic.\nThe slurried broth kept the dish chilled while I ate through my mother's plate of Tang Soo Yuk. My father and I shared dumplings & short ribs.\nAnyways, I can quite honestly say that this was the best bowl of cold noodles that I've had to date, rivalling South Korea. While it may seem backwards to eat spicy food when it's hot, it was super satisfying and it didn't make me feel hotter at all.\nNot a fan of spicy food? They offer Mul Naeng Myeon, which is essentially the same thing but without the spicy sauce (but that's what makes this so good, so please...get the bibim!!). It comes with seasonal fruit - watermelon was being served tonight. I like watermelon, but I love spice.\nI also like squirting hot mustard all over my noodles. You can also add vinegar, but I don't like it in my Naeng Myeon.\n\nTang Soo Yuk (Korean-style Chinese dish. Sweet & Sour Pork)\nSoggy :(\nA childhood favourite of mine, this is an example of Korean-style Chinese cuisine. There are many dishes that you'll find in Korean restaurant under this niche - Jajamyeon (black bean noodles) is another popular example. Sticky-sweet, when it's done right the deep-fried pork, chicken, or beef has super crispy batter and is tender on the inside with a generous helping of sugary syrup, vegetables and fruit. Unfortunately, this was not done right. It was squishy, not crispy, which pretty much ruined the dish. Boo.\n\nKalbi (Grilled, marinated beef short ribs)\nSkip this...\nI've had better - much better. I am a bit of snob since I often make my own short ribs, but since I don't have a grill I like ordering them from restaurants. The cut of meat tasted low grade and fatty, and the flavour was lacking from the missing green onions. Moving on.\n\nMandu (dumplings Available fried or steamed)\nDeep fried goodness!\nAnother dish that I often make on my own, I still like to order these in restaurants since I never deep-fry them at home. I was pleased with these, and I would order them again with my noodles over the kalbi any day!\n\nI was a little frustrated with the service, but it was super-busy so I wasn't upset. The servers were rushing between tables, so they definitely weren't slacking. I was simply anxious to get my banchan because I was super hungry and jealously watching other tables get theirs while we were a little forgotten...even though we were right in front of the kitchen. Oddly, we received our mandu (dumplings) and kalbi (short ribs) before our banchan but again, they were under quite a bit of pressure so I didn't complain. We were also not given a box of cutlery, and it was hard to wave a server down. Needing something to eat the food on our table, I leaned over and swiped a box from another table.\n\nCho Sun Ok!","useful":3,"funny":1,"cool":3},
{"review_id":"m7o2Ym3V8uDVo75HDL885w","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"AUv2UoAAi7VASJ6VK5lOlw","stars":4,"date":"2010-09-17","text":"Pics & Full Review (too long to copy and paste all of it here): http:\/\/cookiesandtomatoes.blogspot.com\/2010\/09\/kensington-market-pedestrian-sundays.html\n\nOn Pedestrian Sundays @ Kensington, Torontonians spill onto the car-free streets to enjoy a day of music, artsy performances, random shenanigans, and delicious face-stuffing. Held on the last Sunday of every month, it has a different atmosphere than some of the more widely advertised festivals.\n\nI love wandering the streets as I shop at the various markets and try different treats. An extra Pedestrian Sunday was held on the 7th anniversary of the '03 Blackout - what a great way to thank a few overgrown Ohio trees for a spike in pregnancies (\"blackout babies\"), intense street-partying and raw sewage pouring into the Rideau Canal!\n\nAlthough my major draw was The Bellevue's fish tacos (which was a fail since they didn't end up serving them the day that I went), I stuck around and did what I do best: explore and eat. \n\nSeveral restaurants were offering street-eats, both from their regular menu and PS-treats. Here's a run-down of what we tried:\n\nSegovia\nPatacone\nPlatanos with pulled pork and sauce\nEmpanadas\nStuffed Pobleno\n\n\nEl Gordo\nBurrito Empanada\nChurros\n\n\nFresco's Cuisine Inc. Fish & Chips\nKabobs\n\n\nOther vendors were selling Indian cuisine, pastries, jewellery, and sandwiches. As we munched away, we wandered the streets and enjoyed the fun vibe. In the spirit of Pedestrian Sunday, some locals were playing music and there were children selling some fun treats.\n\nAn oyster-loving friend was happy to discover these on sale outside of New Seaway Fish Market. Shucked to order, there were 4 varieties: French Kiss, Lucky Lime (PEI), and Kumamoto (2 for $5) as well as a BC variety (3 for $5).","useful":7,"funny":2,"cool":4},
{"review_id":"nFU83ilzZytqlWjvwdLJEA","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"ovlWOSKVjGecnaPuZLv_OQ","stars":4,"date":"2010-09-10","text":"I headed for the Early Bird special - $3.10 per Dim Sum dish before 11AM if you pay in cash. Fantastic presentation, delicious dishes, and great company...I left happy and satisfied. Everything was so pretty - made for excellent food pr0n :P.\n\nOverall, my impressions of Crown Princess Fine Dining are quite positive. Everything came out with great presentation and very fresh. It's easy to order if you don't have a friend who can speak Cantonese - but I am glad my friend was there to talk to the staff as we had to find out which dishes may have eggs or nuts due to an allergy at the table.\n\nThe dining area was very impressive - a banquet-sized dining area (you can rent it for weddings), tables outdoors (although it's getting cold...so I don't think I'll be sitting out there anytime soon), a side dining area, and a couple of private wings.\n\nAt $3.10 a dish before 11AM, the value felt good for the calibre of the food. I've been to Bright Pearl in downtown Chinatown, which is also a bit cheaper if you're not concerned about presentation and quality. Given it's location, wonderfully decorated dining areas, and delicious dishes I think it's safe to say that Crown Princess will be around for awhile!\n\nPics: http:\/\/cookiesandtomatoes.blogspot.com\/2010\/09\/crown-princess-fine-dining-dim-sum.html","useful":8,"funny":0,"cool":3},
{"review_id":"5E27R_GgD0dJ0ARc2pvA5g","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"IOFzd7mBYCopQQUlRivPCw","stars":5,"date":"2010-09-13","text":"The Big Chill is one of the newest ice cream additions to the downtown core. It's colourful and fun, and was great for many late night and lunchtime ice cream breaks! Located just west of College & Bathurst, it's been challenging my addiction to Dolce Gelato. They have the freshest waffle cones that I've tried (sorry Summers, you've been bumped!) and my favourite chocolate-peanut butter mixture so far.\n\nThe best part of the dark chocolate peanut butter is that there were generous slabs of peanut butter embedded throughout. With the fresh waffle cone, I say that this is my preferred choice over Coldstone and Marbleslab's Peanut butter chocolate concoctions.\n\nTheir Nutella ice cream is weak - if you want a chocolate-hazelnut treat I recommend going to Dolce Gelato instead. They also have \"Caribou Tracks\" which is the same as Kawartha's ever-popular moose tracks. I've also tried their Brownie Toffee Crunch and Espresso Robusto - both yummy!","useful":3,"funny":0,"cool":0},
{"review_id":"lr9UW4-9i71su8KY4fwTxg","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"lJOGYkb8_n77ixVh_3zaug","stars":5,"date":"2010-09-13","text":"Globe Bistro is my Summerlicious 2010 winner!\n\nSpiced chutney & warm, crusty bread\nI've come to appreciate a good spread that accompanies a nice bread basket. The spiced chutney was a pleasant start to the meal while my friend and I waited for the rest of our party to arrive. \n\nTom Collins Cucumber Gazpacho\nLake Erie farms cucumber, lemon cress, preserved lemon, Canadian gin \nI enjoyed this version quite a bit. Never having tried a non-tomato gazpacho before, this was my first pick for lunch. I was very pleased with the light, refreshing flavour and great consistency. Unlike Biff's gazpacho, it was neither too creamy nor smooth. I prefer it with texture, and this one definitely rivals Boulevard Cafe's tomato-based gazpacho. I did not notice the gin, which is a good thing since I'm not a fan and I'd have to do a blind taste test to see if it made a difference. This was my favourite starter.\n\nSmoked Black Cod Brandade\nCrispy shallot rings, smoked paprika essence, confit garlic crostini\nThe crispy shallot rings were great with the paprika essence topped with a generous helping of the brandade. The texture was similar to very thick mashed potatoes, and the cod flavour was not too strong. This was the overall favourite appetizer of the table (but not mine!)\n\nShaved Fennel & Purple Basil Cress Salad\nSpiced pistachio, taggiashi olive dust, orange gele\nI enjoyed this salad - the fennel had a good bite, the pistachios were great, and I enjoyed the orange gele quite a bit. The gele was sweet with a firm texture, which paired well with the vegetables.\n\nLake Erie Pickerel \nWild rice coriander salad, Millbank green peas, marjoram cress, earth chardonnay vinaigrette\nIn spite of my typical hesitation to order fish, I have tried it at all of my Summerlicious outings this year. I was very glad that I did not miss out on this dish! The pickerel was cooked with the skin, which was nice and crispy and the wild rice salad was wonderful. The fish was seared very well, and was neither dry nor oily and was my favourite entree. I would order the fish at Globe Bistro again based on this!\n \nSwiss Chard Torte Verde\nBest Baa Farm feta, charred tomato coulis, blonde frise, chives\nThe warm, baked feta on top of tomato coulis was quite savoury without an overpowering feta flavour. The tomato coulis had a cheesy taste and thick texture - I personally would have preferred a stronger charred tomato flavour instead but it was a great sauce to swirl the torte around before each bite.\n\nSeared Cumbrae's Flank Steak\nDuck fat Yukon chips, vine ripe tomato, scallion, Triple Crunch aioli\nCarefully cooked, the steak was wonderfully pink and juicy. The aioli was a great accompaniment and steak's usual partner in crime - the fries - were quite tasty. Thickly cut and cooked in duck fat, they were enjoyed with each tender slice of steak. This was the overall favourite.\n\nCallebaut Dark Chocolate Torte\nEspresso mousse, Cherry Lane Farms black cherry sugar\nTorte, torte, torte! Topped with mousse, this thick treat was a nice way to end the meal. I liked the torte at Biff's  a bit more, as it was a more moist and was served with a fruity sauce but this was a nice, satisfying variation as well. I love the density of torte, and the flavour of dark chocolate is something that I'll never tire of. I wasn't a huge fan of the espresso mousse - while good, I would prefer something a little sweeter\/fruity\/saucy for this dense dessert.\n\nGlobe Summer Berry \"Mess\"\nVanilla spiced meringue, bacon infused whiskey, Ontario berries\nYum! I'm not usually a fan of meringue or  vanilla but this dessert was light and pleasant. The meringue was airy and sweet, and a great combination with the Ontario strawberries. The stiff peaks were lightly browned and the vanilla flavour was very pleasant with the sweet berries. \n\nEwenity Crme Fraiche Panna Cotta \nCandied lemon zest, wild blueberry soup\nThis is the first panna cotta that I've enjoyed at a Summerlicious meal. I usually find it too creamy in taste, however joined with the blueberry soup and candied lemon this was great. I particularly enjoyed the lemon zest! The blueberry soup was akin to syrup and I'll admit that I took some torte and gave it a good swirl - it was fantastic. \n\nOverall, I was very pleased with my experience at Globe Bistro - definitely a nice way to end this year's Summerlicious escapades. Great service, good food made with local ingredients, and wonderful decor - a surefire recipe for a nice lunch or dinner. A pleasant bistro to go with friends or clients and it has a rooftop patio!\n\nPics: http:\/\/cookiesandtomatoes.blogspot.com\/2010\/07\/summerlicious-2010-globe-bistro.html","useful":1,"funny":0,"cool":0},
{"review_id":"hIZS8xfxDf_UMbJPMV2eNw","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"oQFMJqDwNXbNMRbcmIYRYg","stars":4,"date":"2010-09-11","text":"These donuts are fantastic!\n \n\nNote: not directly on Queen Street - the entrance is on Peter St! I almost thought I wrote the wrong address down and headed to O&B Canteen for a croissant.\n\nThis cute little coffee shop offers an array of sandwiches, croissants, muffins, and cookies. Best of all, you can get hot fresh donuts that are made to order!\n\nThey're quick and efficient and watching the donuts being made within seconds of ordering was a delight for my inner child. Once done, they're thrown into a bowl and tossed with sugar and cinnamon before being thrown into a paper bag or a bowl if you prefer...but it's much more fun to get it in the paper bag :P\n\nThe entire caf is noticeably tidy & clean, and I found the lady quite pleasant (not that the guy wasn't - he was just busy and I was slow to choose a drink). She also took care to ensure that every order of donut was cooked to perfection :)\n\nYum! These donuts disappeared quickly . They're the perfect size to just pop in your mouth, and not heavy at all. They're super fresh, hot, and a delicious treat. I got a full dozen for $4 - worth every penny :)\n\nThe shop is a delightful place to visit with a friend or a book. I will definitely return for a freshly made cookie :). I didn't see any signs of Wifi, but it'd be a perfect spot to study if they do.\\","useful":2,"funny":1,"cool":1},
{"review_id":"g_nACXAx32a3IZ17V8zJ9w","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"y-Zbg19VSb-k15A_yzruYg","stars":1,"date":"2010-09-11","text":"I went to Frank's for a late night dessert and I was really disappointed. I thought that it would be good, from positive online reviews and the fact that the AGO Cafe's treats also get positive feedback. I've also heard lovely things about their brunch. Unfortunately, the desserts were not fresh at all - way overpriced for what we got. Is it worth returning for a meal?\n\n\nSummer Berry Pudding\nRaspberries, strawberries, red currants, and vanilla whipped cream\nWhile tasty, I think that this would've been better topped on top of a cake rather than being served as a messy slab of pudding. It was more mushy than pudding-y.\n\nCoffee and Donut\nChocolate espresso pot de creme with dulce de leche whipped cream and cinnamon sugared mini donut\nCute presentation - chilled pot de creme had a nice chocolate-espresso flavour, but I wish it was a bit stronger or denser or had bits of chocolate in it.\nThe donut was quite disappointing. Despite being made in-house, both the twist and the donut were stale and lacked flavour. I would have been happier with a Timbit from Tim Hortons - for 16 cents!","useful":4,"funny":0,"cool":2},
{"review_id":"hGDjlXDLhH0kPZ3fvsnNbg","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"j_hB9Gt3VMJAbA2JyvyFjw","stars":1,"date":"2010-09-16","text":"Fried Calamari with Aioli & Salsa Fresca\nThe lightly breaded and deep-fried rings and tentacles were tender and neither overcooked nor too salty - two things that often ruin calamari. It wasn't put in the deep fryer for too long, so it wasn't especially crispy and the batter was so-so. I personally would have liked a bit more spice. It was okay, but I've had better value from Mezes in Greektown. The *best* calamari I've ever tried was from Yoso's-Call Joso's in Yorkville - pricey, but spiced and fried to perfection. Would not order calamari from Wish again.\n \nRomaine Salad w Cherry Tomatoes, Herb Dressing, Feta Cheese, & Crostini  \nThe waitress made a strong recommendation for the salad - she raved that she loved it and it is really great starter. Really? I think the picture speaks for itself. Romaine lettuce, a couple cherry tomatoes and an unmemorable dressing. Very poor value at $9.\n \nLamb Burger with Tomato Tzatziki & Feta\nThe saving grace of our lunch - the lamb was nicely ground and mixed with a good dash of cumin. Tender and juicy, I savoured it to make up for the disappointing salad and so-so calamari. The bun was a typical white hamburger-type of bun - too bad, really. I think that a great bun on a good burger makes a world of difference. The fries were decent - nice, thin, a little on the softer side (like the calamari! Perhaps this is just their style)\n\nThe patio and interior are simple and great for a summer brunch or lunch. Fresh, sunny flowers at each table, simple decor, and comfy couches created a low-key, relaxed atmosphere. However, for the value I don't think I will be returning for lunch...although I may give the weekend brunch another go. Maybe.","useful":1,"funny":0,"cool":1},
{"review_id":"dthp-EdVzxsiKnqrd2Dh9A","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"5BPv_vAnRp5EKdmacqvrLw","stars":4,"date":"2010-09-12","text":"After another ketchup-y plate of pad-thai at a local restaurant, I decided that I had to hunt for a great traditional version in Toronto. Mission accomplished!\n\nA very late dinner on Pi-Tom's patio coupled with pleasantly humid weather made a few of us reminisce of travels to Asia. Usually bustling & full during dinner, we arrived around 9pm and had full reign of the patio! Still decorated from the Pride Parade, the colourful patio is enveloped in plants and trees, making you forget that you're in the downtown core.  \n\nYum Mamuang (Mango Salad)\nGreen mango, red onion, chili, mint leaves, lemon juice\nA great start to our dinner, the ingredients were fresh and the lemon juice-chili combination complimented the mangoes quite well. The mangoes were ripe, but still had enough bite so you can get a good stab with your fork each time. The balance between fruit and vegetables was great - too much red onion can kill a mango salad.\n\n\nFish Cakes\nDeep-fried ground white fish mixed with chili and long bean\nWhat a pleasant surprise - when I heard \"fish cakes\" I was expecting spongy slivers of processed fish. Instead, we received tasty well-marinated slices accompanied with a hearty peanut sauce. The sauce was full of peanuts and flavour with a smooth, non-oily texture. I ended up scooping leftovers on some rice, yum!\n\nChicken Satay\n4 skewers of marinated chicken served with cucumber salad\nTender, juicy chicken with a sweet & salty flavour - I wish these were sold on the street. They'd be the perfect snack! A simple yet winning appetizer.\n\nThe servers were very friendly. The food came quick throughout the night, and upon request they gave us a jug of water to save the waitress the hassle of constantly refilling our glasses. We did not realize that they closed at 10pm, but they did not rush us out of the restaurant and did not seem annoyed that we were unknowingly staying well past their closing time.\n \nAuthentic Pad Thai\nThai rice noodles stir fried with sweet & sour tamarind sauce, chicken, shrimp, root vegetable, bean sprouts, tofu, coconut sauce, wrapped in a fried egg crepe\nWhat a difference from ketchup-based pad thai! Tamarind is by far the superior sauce. While ketchup (or \"sweet and sour tomato sauce\" as some restaurants call it) is very sugary, tamarind gave it a more tangy flavour and the portion in the egg crepe was quite generous. It wasn't sopping with sauce, and there meat, noodle, and sprouts ratio was great, and everything was cooked quite nicely\n\nDuck Curry\nRoasted duck in curry, lychee, bamboo shoots, peppers, and basil\nFull of bell peppers, broccoli and bamboo shoots, this aromatic curry was deliciously packed with flavour and roasted duck. To be honest, I didn't notice lychee...probably because I was too busy wolfing everything down!The curry was wonderfully seasoned; sweet, comforting and the favourite dish of the night for our table.\n\nPeanut Chicken\nChicken stir-fried with peanut sauce & long bean\nThe simple peanut chicken dish was very flavourful with moist bites of chicken. As expected, it had a very strong peanut taste, but wasn't at all pasty in texture. While yummy on a summer night, I can really see myself enjoying a bowl in the winter - and Pi-Tom's does delivery!\n\nPlamuek Pad Prik (Spicy Squid)\nSquid in hot pepper sauce with bamboo shoots and basil sauce\nA generous offering of vegetables and squid, this plate disappeared quickly! Green beans, carrots, bamboo shoots, onions, and squid, all smothered and cooked in an addictive basil sauce. Even when the food was gone, we were spooning the sauce on rice until the plate was super clean!\n\nGoong Pong Ka-Ree (Stir Fried Shrimp Dinner Special)\nStir-fried shrimp with curry powder, egg, onion, chili garlic sauce, sweet peppers.  Served with pineapple fried rice and pineapple salad.\nAnother favourite of the table - although the pineapples were canned, the salad was nice to scoop up with the shrimp and rice. The fried rice wasn't greasy (something that I'm usually wary of), and the shrimp had a great kick that kept us going back for more. \n\nBy the end of the night, all of us left happy & satisfied. Every single dish was full of flavour, the service was pleasant, and the patio was welcoming. A surprisingly delicious find, just off of Yonge Street and I will be back to try their soups and sticky-rice dessert!\n\n*Update*\nPi-Tom's Mango Sticky Rice  (~$6)\nThumbs down. I suppose I can't fault them for the blah mango - peak season has come and gone. \nMango Sticky Rice is supposed to be salty & sweet...I would've liked a bit more of a salty flavour in the coconut-milk. I could be wrong, but perhaps the rice wasn't soaked enough in the coconut-milk or maybe there wasn't enough (to my liking anyways. I'm no Thai-dessert expert) because I would've liked a milkier consistency.","useful":8,"funny":0,"cool":2},
{"review_id":"vfZBD6pHfdGg6A_9FsFT5A","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"3Zgo3Fi1DayoSkm89NweKA","stars":4,"date":"2010-09-16","text":"As a chocolate addict, I was intrigued by the chocolate-banana-jalapeo juice. Also ordered were the honeydew-avocado-banana and a lemonade made with crushed mint leaves and sugar cane. ($4)\n\nI liked them all - the lemonade was the most refreshing for the hot day, but I enjoyed the banana-chocolate- jalpeno flavour the most. With a consistency that's more shake-y than juice-y (makes sense given the ingredients), I enjoyed a jalapeo \"bite\" after each chocolately slurp. I wish they used a darker chocolate instead though - I think that the stronger cacao taste would go really well with the jalapeo.\n\nThe honeydew-avocado-banana was light, sweet and also on the thicker side. Next time, I think I will ask for some ice cubes in my drink even though it will dilute it a bit more just to keep it cold.\n\nThe Squirrel ($10)\nPeanut butter, sardines, hot chili sauce, cucumber, sprouts and white cheddar on dark rye\nHow could I not order this? The combination of salty, buttery, cheesy, and spicy was pretty darn good. I just wish there was more! At $10 though, it's not bad considering the big bowl of soup that came with it.\n\nI'd love to try this with a few slices of tomato and avocado. My friend disagrees saying that it's just make it too soggy but I think it'd be great. I think I will request that addition next time, if possible. I like tomatoes on everything though...\n\nThe Beach ($10)\nChick pea salad, roasted coconut, yakinori, sesame, sprouts, and cheddar on dark rye\nNot bad, a decent healthy sandwich. The chickpeas were chickpeas, the sprouts were sprouts - I got exactly what I ordered. While tasty, I won't be craving it anytime soon and I'd sooner try something else off of their menu.\n\nThe Fish Fry ($14)\nGolden fried Ontario Rainbow Trout, with a dandelion & avocado mixed green salad, white vinaigrette.\nThe Rainbow Trout was well done, although I wish there was more to the salad. I wonder how much it would have cost to upgrade to the Greens with Envy salad? Purple kale, dandelion, cucumber, green onion, sprouts, and broccoli sounds pretty darn good.\n\nThe following two items come with sandwiches, or you can order them separately.\nSoupe de Soleil ($4)\nThe butternut squash and was thick, filling, and satisfying. I actually like my squash soups a bit chunky so I was quite happy with this homey bowl. There was also a bit of tomato & scallions and possibly carrot, if I recall correctly. Yum.\n\nBlack Beans ($6)\nThe black bean dip with avocado was also tasty with the red tortilla chips. Dense and chunky, the bowl was spooned clean. I wished there were a few more large chips in the pile, but no biggie - I just scooped some dip with my spoon with the little chip bits. In hindsight, I think I would've liked this in the sandwich too!\n\nJulies' Pies!\nOoh...pie. With Wanda's Pie in the Sky down the street I was surprised to see \"Julies' Pie\" for dessert. I racked my poor memory for a bakery named Julie's and drawing a blank, I asked where\/who Julie('s) is. It turns out that one of the owner's (Ryan) cousin's wife bakes yummy desserts for their cafe. Talk about family love :) It was a sweltering hot day, but he convinced me that the pie was \"reaaaalllly good\" with a knowing \"omg\" look on his face. Not that my sweet tooth ever needs much convincing anyways.\n\nAnd \"reaaaallly good\" it was! Totally catering to my not-so-secret love affair with Ontario peaches, the filling was just the right amount of sweet and the crust (which I think is just as important!) was nice and soft. While my friend said he would've preferred more of a \"bite\" for both the peaches and the crust, I was quite satisfied as I liked the super-soft pieces of fruit. Mmmm. It wasn't syrupy or overloaded with sugar. This pie-lover was satisfied.\n\nThe service from co-owner Chris was very friendly and conversational. I heard they were going to offer fish tacos at yesterday's Pedestrian Sundays however a combination of a precarious weather forecast and something about the cousin who was going to cook 'em up made it a no-go. I must have looked crest-fallen as I got a consoling tap on the shoulder from Ryan (is it creepy that I'm using their first names as if I know them?) and a promise of their appearance on August 29th's Pedestrian Sunday. Sadly I will be out of town, but as a fanatic of Little Italy's Fish Store, at least I know where to get my fish-fix. Pout.\n\nOverall, I had a good time at The Bellevue. While there were some things that I would like to tweak, everything tasted good and homey. The items are things that I could easily make at home, but the creative combinations certainly stirred my imagination. It won't be long before I start making my own Sardine-Nut Butter-Rye sandwiches...which may or may not be pleasant for The Bellevue to hear!","useful":1,"funny":0,"cool":1},
{"review_id":"T_KGxMC9BKYv6qyATdTvgQ","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"Ydm2CYUvraXG2DfCkdZFOA","stars":4,"date":"2010-09-14","text":"Located in a plaza in Oakville, I will admit that I was skeptical about Sweet Smoke. A great barbecue joint beside a Mr. Sub and Funky Thai 2 Go? In Oakville? Hmm.\n\nBrightly lit and very clean, the interior looked newly renovated and ready for some hungry paddlers. We grabbed a table and were promptly given menus, which we scoured for the meatiest, tastiest sounding dishes. Paddling 20km during a 3 hour torrential downpour makes you hungry.\n\nSweet Smoke is both family-friendly and a good hang out, and the owner and the waitresses provided great service. After dinner, the owner was quite chatty and talked about how he slow cooked his pork and what he thought of his competition. It was a very relaxed atmosphere for a casual Saturday night dinner. They also serve homemade iced tea - sweetened, brewed tea which I found better than the bottled variety. \n\nGrilled Portobello Mushroom Melt\nArugula, Oven Dried Tomatoes, Grilled Red Onions, Gruyre Cheese, Guajillo Aioli on Toasted Rosemary Focaccia\nA generous helping of portobello paired extremely well with the gruyre. This is the same cheese that Biff's used for their crepes, and I must say that I am a fan! Although I'm not usually a fan of cheesy sandwiches, gruyre pairs very well with meat and vegetables, this sandwich being no exception. I especially enjoyed the toasted focaccia bread. Warm, \"meaty\" with mushrooms, and toasty - this was my second favourite sandwich!\n\nSouthwestern Club\nHickory Smoked Turkey, Crispy Pancetta, Tomato, Greens, Avocado and Chipotle Mayonnaise on Ciabatta\nWe were surprised to receive this sandwich, because we only inquired about it but didn't actually order it (whoops). It didn't matter - we were so hungry that it was a welcome appearance so there was no need to complain or send it back. The smoked turkey was nice and juicy, the ciabatta was was buttered and grilled. I would have liked a bit more pancetta for additional flavour. Decent sandwich, but the mushroom melt definitely eclipsed this sandwich. Even though it was my least favourite sandwich of the night, it was still tasty!\n\nEl Cubano \nPulled Pork, Shaved Smoked Turkey, Manchego Cheese and Quick Pickles on Sesame Seed Bun\nY-U-M! This was the best sandwich of the night. Smokey turkey, tender pulled pork, tangy sauce, and pickles was a great combination. Although it would probably be considered \"nontraditional\" for a pulled pork sandwich, I would have preferred it with the rosemary focaccia bread from the portobello mushroom melt and melted cheese. I liked the quick pickles quite a bit, I wouldn't mind ordering a side of them the next time I go in. The toasted sesame seed bun was soft & good, but wish it was a little more toasted - but the combination of the pulled pork and the turkey was heavenly so no complaints! Sammy win!\n\nFlat Iron Steak Burrito \nDrunken Beans, Queso Fresco, Ancho Chile Salsa and Cilantro\nUnable to find a great steak burrito in Toronto (tried Burrito Boyz, Burro Burrito, Big Fat Burrito and Burrito Loco) I felt like I was taking a chance ordering this. It came tender, juicy, and oh-so-delicious with melted cheese and great salsa. It was a good simple burrito, the meat was very well cooked - I wish it was jammed a bit more with veggies but considering that I wasn't at a burrito joint I can't expect to get a fat burrito. I wish there was a fast food burrito as tender as this...\n\nMixed Barbecue Sampler\nHickory Smoked BBQ Ribs, Slow Smoked Pulled Pork, Cowboy Beans, and Jicama slaw\nI came for the pulled pork, but when I spotted an item that gave you pulled pork and ribs, I was sold! The pulled pork was great - tender, juicy, smokey, and full of flavour. Everything I look for in pulled pork. While some might be turned off by the orange-coloured sauce, I happened to love the citrus flavour. If I could tweak one little thing, it would be the hickory flavour - more please!\nThe ribs however, were a little on the dry side but they still had a nice smokey flavour that I enjoyed. They weren't too dry, but I've had better.\nThe beans were tasty and saucy but the slaw was just slaw - I later learned that many people top their sandwiches with the slaw. I would've tried it if it occurred to me!\n\nCake and Shake!\nBlackout Cake with Dark Chocolate Pudding, and Vanilla Bean Milkshake\nThe chocolate fiend in me was definitely satisfied with this rich, moist cake. Creamy chocolate mousse layers nestled between dense cake was a great way to end the meal. If you like frothy and richly-flavoured milk shakes, you will love this. Mmm...\n\nIf you're looking for a savoury sandwich, Oakville's Sweet Smoke Barbecue & Grill is worth a visit! Friendly service (although we did accidentally get a sandwich that we didn't order), warm meaty sandwiches, and a bright interior made this a great place to grab a bite.","useful":3,"funny":1,"cool":2},
{"review_id":"vx_Xt6ivkbgwaZykcNUs3Q","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"e41TP5cXZqSrz50xCBJqZw","stars":4,"date":"2010-09-14","text":"Insomnia's been around forever and it's still going strong! Rec this place for lunch\n \nTried:\nEggs Charlotte ($11.50)\nInsomnia's hollandaise sauce has a bit of a cheesy flavour. It adds a bright colour and if you like a bit of cheese, then you'll probably prefer Insomnia's hollandaise over some other breakfast joints. The eggs were well poached - not as perfectly as Hoof Cafe's but still nice and runny and the side of greens was good to nosh on between bites.\n\nEggs Manami ($10)\nOrdered off of their \"Brunch Features\" menu, the Eggs Manami had wonderful curried rice patties. This is a delicious alternative to English muffins, and I recommend this over their regular Eggs Benny.!\n\nHome Fries\nTheir home fries are great! The potatoes are freshly tossed in a bbq-y sauce, and they're not at all soggy. These were quickly snarfed and definitely worth adding to your order if they don't come with it anyways.\n\nFrench Toast\nHeaven on Earth ($10.50)\nYummy - It was crispy and filling with a generous amount of fruit. The cream cheese was good, but I would've enjoyed it just as much without. I'm not so sure that the strawberries were wild as advertised, but they were fresh! This was great drenched in maple syrup.\n\nBaked Pancakes ($10)\nSo these aren't so much pancakes as cakes-baked-in-a-pan. They are huge and are made to order and from scratch. They are very thick and dense, and take at least 20 minutes upon ordering to arrive. We were definitely stuffed after polishing these off!\n \nChocolate Banana Pancakes & Apple Cinnamon Pancakes\nWhile good, I don't think I'd order it for myself but as a post-breakfast treat to share with a larger group.\n\nOverall, Insomnia is a bright cheery breakfast joint in the Annex. I recommend it if you're looking for a tasty brunch at a great value. Their pleasant service, bright dining and bar areas, and great brunch options make it a great choice. Definitely a step up from other local breakfast joints that I've tried with respect to service, atmosphere and quality of food. Get the home fries and their egg dishes are quite tasty.\n\nI've also been there for dinner. If you go, you *must* try their Climax Cake. It's as good as the name suggests ;). Flourless chocolate torte, wonderfully dense and rich - I would return just for that dessert alone! Their pizzas are also quite good and named after Toronto neighbourhoods - I tried their Annex pizza. Their Mediterranean Platter and fries with aioli are decent appetizers to share with the table - but the pizza would be better.\n\nErin\nhttp:\/\/cookiesandtomatoes.blogspot.com\/","useful":5,"funny":3,"cool":4},
{"review_id":"sX9nxrq6gkIZhwyVdyNrKg","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"uP2-0N59oW5lggIyvdfWkQ","stars":5,"date":"2010-09-11","text":"Located behind Pacific Mall, Chung King Garden serves an excellent full-course Peking Duck in record time. Every dish was fantastic, and the duck was crispy, non-fatty, and flavourful.\nKnowing that it takes 20-30 minutes for the food to be prepared, we ordered one of their House Specials to tide us over as well as some white rice.\n\nSzechwan Shredded Beef ($10.95\n)Crispy yet tender, crunchy but not oily, this was the perfect dish to ease our hunger pangs while we waited for the duck. I was really pleased with the beef; it had great flavour from the chili and it wasn't drenched in sauce so it stayed crispy. Shredded carrots and green onions added to the flavour, and it was great with rice.\n\nAuthentic Beijing Roast Duck (3 Courses) ($37.95)\n1. Crispy Duck Skin & Breast\n2. Duck Stir Fry\n3. Duck Soup\n\nCourse 1: Crispy, Roasted Skin\nI could hardly contain my excitement when the first course arrived. The dark skin was shining and crispy-looking, with duck breast peeking out from underneath.The flavour was fantastic. There was also little to no fat hiding between the skin and breast, which but they've rendered it so well that it was still moist.\nWith it came steamed dry crepes to wrap the roasted duck, vegetables, tian mian jian (a savoury-sweet bean sauce), and crispy shrimp crackers. The crepes are nice and thin, but thick enough to wrap everything without breaking before shoving it into your mouth. Eat the crackers while they're super-fresh and hot - like pork rinds, they get soft and blah over time.\n\nCourse 2: Minced, Fried Duck in Lettuce Wraps\nThere were also bits of crispy white noodles hidden among the pile of stir fried duck, vegetables, and saucey goodness. The sweet bean sauce is a great base for stir fries, and II enjoyed tofu, water chestnuts, pepper, carrots, onion, and whatever other vegetables were in the mix. There was just enough to give it flavour, and they clearly weren't just \"fillers\" for the dish to look bigger.\nWe eagerly grabbed spoonfuls and scooped the duck into pieces iceberg lettuce. I also enjoyed it with white rice when we ran out of lettuce. Win.\n\nCourse 3: Duck Soup\nLast to arrive was a soup made from the remaining skin, meat, and bones. The broth was surprisingly light and tasty - not at all oily! A friend said this was her favourite course for this very reason. I really wonder what they put in this broth to make it so flavourful in such a short amount of time. Tofu, duck, and nappa cabbage was plentiful and we cleaned this bowl up without a problem. I can only imagine how wonderful this soup must be on a cold, winter night.","useful":5,"funny":1,"cool":4},
{"review_id":"9gZFC22YdqQIAC_L0Y9_ZA","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"_u1Bq7QsgMUXSMex8QHqLQ","stars":4,"date":"2010-09-16","text":"I just enjoyed a large halibut burrito from Burrito Boyz. It's my favourite in Toronto along with Big Fat's Pulled Pork Burrito. I'm curious about BFB's breakfast one! I'm so addicted to the halibut though, that I can't seen to order anything else from BBz. I am in such a late night burrito mood tonight!\n\n \n\nI had to award both Burrito Boyz and Big Fat Burrito #1 to be fair. When I am craving a fish burrito, I go to BB. When I want something meaty, I go to BFB. It's as simple as that.\n\n1a. Burrito Boyz\nHalibut Burrito ($8.85 small, $9.73 large\n)Halibut Burrito - so much sauce, so much win!\nThe tortilla is toasted on a flat-top grill and the large gives you 1.5 lb of fish! Add a very generous helping of sauces: Lime-Chili Burrito sauce, sour cream, and hot sauce. Most of my friends get little to no hot sauce, but I like asking for two lines. Yum.\nI almost wrote this place off after trying their steak burrito - the beef was tough and unappetizing, despite the plethora of fillings. I'm really glad that I gave the place another go and tried their halibut burrito! I can ever resist its call...while curious about their veggie soy and shrimp burritos, I haven't been able to say no to halibut.\n1b. Big Fat Burrito\nPulled Pork\nI lo-o-o-ve their pulled pork burrito! It's always saucy, soft, and so good with guacamole. I always manage to stuff myself with a large without a single regret! You can get some yam in it too!\n\n3. Burrito Bandidos\nSteak Burrito\nThis is third because I only tried their steak - I bet their fish is just as good as Burrito Boyz. If I was ranking this on the steak alone, it'd be lower but I ought to be fair since the owners used to work together at Burrito Boyz so they're virtually identical.\n\n4. Z-teca\nBeef Barbacoa Burrito\nTried the one at Fairview Mall - this a popular chain. Pretty good if you're in the area and want a burrito fix! They're also often featured on Group Buy sites, so keep your eyes open for deals.\n\n5. Chipotle Mexican Grill\nCarnitas\nOwned by McDonalds, this has been a major hit-or-miss for me. The last time I went, the person who made my burrito jammed it full of Carnitas and I was very pleased. The time before that, the server was quite grumpy and I got a small handful of chicken. Nonetheless, when I needed a quick burrito fix around Yonge & Dundas, Chipotle did the trick...until Big Fat Burrito moved in. I rather like their Cilantro-Lime flavoured rice\n\n6. Burro Burrito\nSteak ($7.99 Large)\nLocated beside my beloved Fish Store, I popped by after a game of floor hockey. This was in my early burrito-blitzing days and I think that I've since realized that steak burritos are not the way to go unless if you're ordering them from a good restaurant like my visit to Sweet Smoke's BBQ\n\n7. Burrito Loco\nChicken Burrito\nSo close to being finished before the picture was taken! Oops!\n\nOf course, there's also Sweet Smoke's Flat Iron Steak burrito but since it's at a restaurant it's in a totally different class on it's own.\nSteak Burrito win @ $9, but not quick eats on the streets of Toronto\n\nHonourable Mentions - Not true Burritos but I still love 'em:\n1. The Fish Store\nTried almost everything - best: Black Cod Burrito with Avocado\nHonestly, if this was open later and closer to my place I'd get this over Burrito Boyz any day. The Fish Store is fantastic - they offer a huge selection of seafood that you can in sandwich or a wrap (which they call a burrito). Love Love Love.\n\n2. NY Subway\nPotato burrito, cauliflower burrito, lamb burrito\nThese aren't traditional burritos either - however their potato & cauliflower burritos are great! Totally recommend getting one of these over their meaty options.","useful":2,"funny":0,"cool":1},
{"review_id":"eSfSqJaNiAqpt-mCbFDT8A","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"kuJRRmmmDUXqwM6kNihXXA","stars":2,"date":"2010-09-13","text":"Tastefully decorated with wine bottles, glasses, and interesting lighting fixtures, the interior feels open and bright thanks to floor-to-ceiling windows. A fantastic outdoor back patio includes an outdoor bar and lounge areas. \n\nThe service was pleasant and patient - We were given a bread basket with crispy flat bread seasoned with tarragon and a few slices of white bread. It was accompanied with a rather plain marinara sauce, which foreshadowed the upcoming meal.\n\nBaby Red Romaine & Escarole Salad\nCara Cara orange, fennel, shaved Parmigiano-Reggiano and old wine vinaigrette \nA light start of fresh lettuce, a slightly tart vinaigrette, ripe Cara Cara orange, and cheese. While the orange and the dressing was enjoyable, something was left to be desired...perhaps it's because of my unrefined wine and cheese palette, but I wasn't particularly impressed. Memorable Summerlicious starter salads include the butterleaf truffle salad at Truffles at the Four Seasons (which has since closed) and Tutti Matti's carpaccio salads.\n\nBigeye Tuna Tartare & Spicy Sopressata \nCracked olives, garlic grissini, arugula, lemon and Sicilian organic extra virgin olive oil \nFresh tuna tartare on a bed of salami was a welcome dish, especially since I've never tried sopressata before. The saltyness of the cured ham paired with the freshnesses of the tuna created an interesting balance between bites. The olives were typical, and the bread sticks brought a crunch but no flavour to the plate. Perhaps if they were toasted a bit more or rolled in sesame, it would've been a nice compliment to the dish.\n\nWild & Tame Mushroom Soup \nSix kinds of mushrooms (no butter or cream)\nThick, warm, and hearty - this had the rich texture of a comforting soup despite the lack of cream or butter. I was impressed with the consistency and I love the taste of mushrooms so I thoroughly enjoyed this soup. As with the salad, there was something lacking - the \"wow\" factor that I always hope for at 'licious restaurants. The best mushroom soup that I've tasted was Wild Mushroom Soup from Tutti Matti - unfortunately not on their current menu.\n\n\nGrilled Top Sirloin Fettina\nCharred onion, heirloom tomato and rocket salad with crumbled Gorgonzola\nThe vegetables were nice and warm, and the sauce surrounding the steak sweet however the steak wasn't particularly interesting or great. Tender and nicely cooked, it was a good, simple cut of sirloin but didn't blow me away or leave a lasting impression on my palette.\n\nGrilled Jail Island Salmon\nPickled summer beets, heirloom carrots, watercress salad and horseradish crme frache\nDespite my half-success with the fish at Biff's Bistro, I decided that it was worth another go. While tasty, I'm quickly getting bored with this Summerlicious lunch. The beets were nice, warm, and soft and the horseradish crme frache had great flavour. However the salmon was...just salmon.\n\nRoasted Portobello Mushroom & Brie Quesadilla\nCaramelized onions, pico de gallo, chipotle crema, plantain tortilla chips and cilantro cress\nMy personal favourite of the entres, the chipotle cream had a tangy flavour that tasted great with the pico de gallo and quesadilla. The pico de gallo (salsa) was ripe and simple. Always a fan of portobello, these quesadillas had great flavour. While an interesting visual, the tortilla chips were lacking the flavour I usually enjoy from plantains. As a plantain chip lover, they were a disappointment. I'd rather crack open a bag of the Samai Plantain chips that I got addicted to Barbados.\n\nChocolate Toffee Crunch Cheesecake\nDulce de leche cream\nThick cheesecake that was more toffee-like than chocolate. The caramel was pleasant with the dense cake. I wasn't a fan of the bit of toffee that accompanied the cake but overall I'd say that this was the best dessert out of the three.\n\n\nBavarian Vanilla Cream\nOntario strawberry compote and dark cherry balsamic\nNice and warm with a smooth texture, the vanilla cream dessert sat on one of the better compotes that I've tried. I found myself scooping this dessert up more for the compote than the cream.\n\nCoconut Rum Baba \nTropical fruit salad and banana cream\nThis spongy cake was covered with coconut shavings over pineapple, mango, and lychee. A sweet, generous drizzle of rum syrup soaked into the cake quite nicely. While I wasn't the biggest fan of this dessert initially, over time as I enjoyed my company it grew on me. It wasn't too rich or filling.\n\nWonderfully designed and decorated, Jump Caf & Bar creates a vibrant, young, and upscale environment quite well. I would return for a drink at the bar, and the service was fantastic. However, I thought it was missing that the \"oomph\" factor that would make me wholeheartedly recommend this restaurant for future Summerlicious romps. This is a good spot to take someone who wants a very simple no-frills meal.","useful":1,"funny":0,"cool":1},
{"review_id":"IFvl7-D_lFtOsNjr-Hc1VA","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"j1yBqI57HIyVP_e1N374cQ","stars":5,"date":"2010-09-11","text":"My friend and I happily feasted three mains and an appetizer. That's not to say that the portion sizes aren't generous - because they are! It was just that good. Instead of picking two out of three entrees that we really wanted, we just tacked on another plate. You gotta make the visit count, right?\n\nExcited to Hoof-it-up, I got there a bit early and was surprised to find a line quickly gather behind me. Luckily, I was relaxing on the bench & enjoying the Sunday morning otherwise I wouldn't have gotten a table (not that the bar would've been bad). By 9:45AM, quite a few fellow brunchers were eagerly peering through the window in anticipation of the 10AM opening time.\n\nThe cafe itself is quite small, so go early if you want to avoid a wait or would prefer a seat by the window. Similarly, I arrived at Black Hoof right when they opened at 6PM, and just managed to grab a table. I wouldn't mind sitting at the bar though, they have fantastic cocktails and the service is jovial and chatty. However, for a group of more than 3 people a table is clearly better.\n\nBone Marrow Strawberry Beignets\nWinning Combination: Cinnamon, Sugar, Bone Marrow, Strawberries & Long Peppers\nThese delicious little bone marrow pastries are coated in sugar and cinnamon. The donuts were hot, fresh, and filled with a sweet strawberry and long pepper jelly. Deep fried bits of joy, these were the perfect size and a tasty $5 appetizer. More please!\nThe two other starters are currently available for $5; a pastry filled with bacon as well as ribs in a beer sauce. While curious about the others, these donuts were a winning choice. Well...honestly based on the entire meal, I'm convinced that anything would be a solid option!\n\nBeef Tongue Grilled Cheese\nWhen I spotted this on the menu, succulent memories of Beef Tongue on Brioche from Black Hoof wafted through my mind. Slathered and fried, the buttery bread had toasty grill marks and neatly sandwiched an extremely tender and generous portion of beef tongue. I needed to erase the disaster that was Friday's T&T's rubbery beef tongue from my mind and this just blew it away. Hello satisfaction.\nPacked with comforting flavour, every bite made me stop to savour the combination of Provolone, Brie, crispy-buttery bread, and amazing thinly-shaved beef tongue. The little piggy-skewer with 4 pickles was a nice touch, similar to Black Hoof's Beef Tongue on Brioche Sandwich. Between the two, I'd say that this was better...but trust me...they are both delicious. Not bad for my first grilled cheese sandwich!\n\nSuckling Pig Eggs Benny\nPerfectly runny egg yolks, light Hollandaise sauce over pickled jalapeo\nThe Eggs Benny was perfectly poached. Warm yolk slowly oozed out when pierced with a fork, and every bite was covered in heavenly Hollandaise sauce. The sauce wasn't too rich, and did not mask the wonderful porky flavour on top of the fresh biscuit. The suckling pig had a barbecue flavour, and reminded me of very tender pulled pork without the sauce. The arugula had a lemony zip and the dish was surrounded by pork rinds. I could be wrong, but the rinds tasted like they were made a bit earlier as they were a bit soft rather than hot and crispy. They were spiced with barbecue powder. While a nice touch, I didn't care so much for them.\nI recently told a friend that my next food-hunt would be for Toronto's best Eggs Benedict. However, I'm pretty sure that now I've tasted this, there is no need. Even without the suckling pig, this eclipses all other Eggs Benny dishes I've ever had.\n\nBrioche French Toast with Foie Gras\nO-M-G.\nI could easily leave the description as that, because that is all that was running through my mind when we received it, while I was eating it, and after it was done.\nThe Brioche French Toast was perfect - the thick French bread was perfectly battered & fried, covered in sweet-syrupy goodness, roasted macadamia nuts, a dollop of creme fraiche, and bright red strawberries. Oh, and quite possibly the largest serving of Foie Gras that I've ever seen i my life.\nWords can't describe how great I thought it was - sweet syrup, hot fresh brioche, seared Foie Gras, macadamia nuts, creme fraiche, and fruit. How could this not be amazing?! Now I want every restaurant to start making French Toast with brioche. Like the Eggs Benny, this wins the C&T prize for Toronto's Best French Toast. Sorry Kalendar, but your banana & mango stuffed French toast was just trumped BIG TIME.\nA $26 plate French Toast might sound quite steep (it's $12 for the French Toast and $14 for the Foie Gras) but I definitely think that it's worth a try at least once. Go with a few friends and split it if you need to...\nEverything about the the meal was great. From the upbeat and friendly service to the colours and presentation of each plate.\n\nPics : http:\/\/cookiesandtomatoes.blogspot.com\/2010\/08\/hoof-cafe-charcuterie-brunch-love.html","useful":2,"funny":1,"cool":1},
{"review_id":"7WNFDEMY0_hFO_EWROecJg","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"pZ1quwXnYozLIZIVABojhw","stars":4,"date":"2010-09-11","text":"Visit #1\nCharcuterie Platter ($16 small\/$25 large) & Thuet Bread ($2 small\/$4 large\n)This is a wonderful introduction for those who have never tried charcuterie. Basically, charcuterie is a series of meaty products (cured, whipped & other preparation techniques) served on a wooden platter.\nAll offered with a pile of full-seeded mustard, a dish of teeny-tiny pickled vegetables, and we ordered Thuet Bread on the side. The Thuet bread was soft & fresh - a great accompaniment.\nThe star was the foie gras mousse - whipped to perfection, it just melts in your mouth.\n\nRoasted Bone Marrow ($9)\nHollowed with a little spoon & sprinkled with a bit of coarse salt on top of warm, smoky bread, this was tasty and good for the immune system. I reminded myself of the health benefits as I savoured each bit of fatty, rich, comforting flavour.\n\nTongue in Brioche ($13)\nThe sandwich was a ridiculously generous portion of thinly sliced beef tongue between two plump slices of fragrant brioche, all held together with a skewered cornichons. A healthy (hah!) dose of mustard and tarragon mayo drizzled all over made my heart skip - whether it was in fear or excitement, I'm still not sure.\nIncredibly soft and tender, prior to this delight I didn't know that tongue could be this delectable. While I prefer the buttery & decadent Tongue Grilled Cheese at Hoof Cafe, I would never turn down this sandwich.\n\nRaw Horse Sammy w\/ Hot Sauce ($22)\nFresh bread topped with horse tartar with a raw egg yolk & shallots on one slice, and a liberal helping of hot sauce on the other. The \"HORSE\" spelled out in sauce was a fun touch. I couldn't believe how tasty the raw horse meat was - I tried it with and without the hot sauce & bread to get a sense of the true flavour.\n\nVisit #2\nCrispy Pig Ear Salad\nStrips of breaded & deep-fried pig ears over radishes, carrots, edible flowers with a lime buttermilk dressing\nI liked the pig ears, but I found the dressing too buttery and generous on the salad. As someone who prefers light, acidic dressing (or none at all with the right greens!) it was unappetizing. However, I was at the Black Hoof so this was to be expected.\nThe pig ears were crispy as advertised, and full of fatty-flavour with each bite. A dining companion claims that Buca does a better version...\n\nFluke Crudo\nFluke along with charred fava beans, avocado cream, sliced chili, pancetta, herbs & cilantro dressing.\nI really liked the avocado cream and fava beans. A little heavy on the dressing (but again, it's Hoof!) but the combination of the sliced chili & cilantro was delightful with the fish. Love the plating :)\n\nN'Duja & Corn Tagliatelle\nHouse tagliatelle noodles with charred corn, charred cherry tomatoes, and the n'duja which is a spicy calabrese salami melted into the pan. Garnished with a green onion salad on top.\nMmm. I realy enjoyed this - house pasta was al dente and the creamy sauce blended very well with the charred corn and tomatoes. I still have trouble pronouncing it, but the n'duja was quite tasty with a bit of heat and I would happily order this dish again. Creamy, spicy, & corny goodness. I love sweet corn!\n\nPork Belly, Squid,& Melon\nBaby squid, Berkshire pork belly & chunks of melon in a watermelon glaze with turmeric, cumin. Flaxseed, Vietnamese cilantro, mint, & basil also riddle this succulent dish.\nWhile the pork belly and the squid were both well done and delicious, the pairing did not do much for each other. They were enjoyed separately with the watermelon glaze. I must have gotten a good chunk of watermelon, as a dining partner-in-crime said she didn't taste the melon but I certainly did. As usual, the pork belly made me pause to fully enjoy the flavour. So decadent and perfectly pan-cooked.\n\nCalf's Brain Ravioli\nHouse ravioli in sage, brown sugar, & butter sauce with Parmesan shavings\nSo...It was an oily mess, and I was very glum as a result. From the poor presentation, meagre calf brain filling, blah pasta, and too-sharp cheese I reluctantly ate all 5 raviolis wondering why I was even bothering with each bite. It was cooked al dente, just like the tasty tagliatelle, but I don't think that that is the best way to cook ravioli. Sigh. A fellow diner sampled a bit of my dish and agreed that it was simply not good. Darn it. But that's 1 bad dish out of so many amazing ones...so all is forgiven =)\n\nPics: http:\/\/cookiesandtomatoes.blogspot.com\/2010\/08\/black-hoof-charcuterie-dinner-love.html\nPics: http:\/\/cookiesandtomatoes.blogspot.com\/2010\/09\/black-hoof-charcuterie-dinner-love.html","useful":2,"funny":1,"cool":1},
{"review_id":"zcNbe7F7o-o14gjDwVJWDQ","user_id":"WNAXTApcsMqobkZ8z9LJcA","business_id":"272a60ze8sADYRR6GyJ3GA","stars":1,"date":"2010-09-16","text":"The waffle was thick but not crispy - I wish I asked him to leave it on there for another minute. There are other flavours (cinnamon, maple, strawberry) but I don't see myself returning anytime soon...especially since Marbleslab's dark chocolate ice cream is just across the street.","useful":1,"funny":0,"cool":2},
{"review_id":"quukOpwSV1R8i0ZgeYKtRg","user_id":"Oo6eU9-SFnj3hJnCBqKb0A","business_id":"sPABXuc2eC87QfOvZuIvVQ","stars":5,"date":"2015-09-14","text":"I just wanted to say that this service is great, only it doesn't take the place of the family doctor. the doctors are great, for example my grandmother was really sick, and if it wasn't for the doctor suggesting that she go to the hospital she wouldn't have been around. I just want to say thanks so much for all the help!","useful":4,"funny":0,"cool":0},
{"review_id":"AjDnA8lC9qoCI2isUb-A3Q","user_id":"OcG7IyWe2q4fv1UbCwIzbw","business_id":"Ki8seQY5mtXc36xjoMfeDA","stars":2,"date":"2015-06-13","text":"Way overpriced and not that good.  Had the chicken wings that were fair and about 15.00 with tax for 5 wings Total rip-off.  Had calamari which had more of the other stuff in there than calamari. Pizza was ok.  Try someplace else and save some money.","useful":0,"funny":0,"cool":0},
{"review_id":"CcGw5uIu6631zBi1wVCIVg","user_id":"OcG7IyWe2q4fv1UbCwIzbw","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":2,"date":"2015-07-06","text":"Just another overrated hyped up place. Had blueberry pancake and eggs. Pancake was bland but big. Better places to eat and less expensive.","useful":0,"funny":0,"cool":0},
{"review_id":"yo06VhmgtTkvkJH4u4KBOg","user_id":"OcG7IyWe2q4fv1UbCwIzbw","business_id":"ThNGovQZjZ5mn-ZwX_N2BQ","stars":2,"date":"2015-06-13","text":"Decent hotel rooms but casino and layout are horrible. Terrible Idea to have restaurant (The Nook) and some bar near the room elevators in such a narrow area. Employees clueless and restaurants overpriced and overrated.","useful":0,"funny":0,"cool":0},
{"review_id":"y4FB25U3pjTrGIVgpsQX0w","user_id":"OcG7IyWe2q4fv1UbCwIzbw","business_id":"VbEK6-etnKKaPamrG2jWjQ","stars":2,"date":"2015-07-06","text":"Way overpriced and overrated. Ordered 3 dogs for the family, Jersey Ripper which wasn't ripped and barely cooked. The other two dogs were just as bad. When you're paying $6.00 for a hot dog it better be good. Plus the place is way to small. Save your money !","useful":0,"funny":0,"cool":0},
{"review_id":"m1GDHqPqYKlWA6Wcl03FbA","user_id":"1y0PLwJLqew5Uk_OGTqt3Q","business_id":"HgdFqAvK31fB9sgBdOzo9g","stars":5,"date":"2014-05-19","text":"We brought some guests here from Switzerland and one of them said it was the best crepe she ever had. I'm inclined to agree. \n\nI'm working my way through the entire menu and I've loved them all. Go with something sweet or savory; you won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"qS4HscjkKHtDUw4rdweGBw","user_id":"1y0PLwJLqew5Uk_OGTqt3Q","business_id":"O6-BlCviQBIEcGW4ll6ZsQ","stars":1,"date":"2014-05-28","text":"Flophouse. \n\nFormerly the Imperial Palace, only the name has changed. The location on the strip is prime, but the building should be demolished and rebuilt. The only reason I'm giving The Quad a one star rating is because I haven't figured out how to give it a negative rating.\n  \nNavigating the nightmarish layout from the self parking garage to the hotel was made extra special by the young man urinating while his buddies unloaded their beer coolers from their car.       \n\nChecking in was ok, but just ok. The staff is friendly enough. The elevators are small, slow, and dirty.         \n\nEverywhere in the hotel has filthy, stained carpet and walls. Evidence of human DNA is everywhere. Let your imagination run wild. I did. \n\nBathrooms are outdated and gross. Let's talk about the ten person bath tub\/shower with ceiling mirror for just a moment. The drain... doesn't. And cleaning those monster tubs can't be easy, so I think they just skip it altogether. Shower shoes are recommended. \n\nThe ceiling mirror above the bed adds another touch of class. Walking around the room in your socks is not a good idea. The dirty carpet will only ruin them. Again, shower shoes.  \n                      \nThe irate drunk male in the hallway shouting F bombs about how unfair his life is at one o'clock in the morning (for about an hour) was nice, but the 8 a.m. construction project on the floor above was really great.\n\nWe did not bother going to the pool. Our hearts just weren't in it.\n\nLook, you get what you pay for. And if you are under 30 and are looking for a place to party, then The Quad is for you. But if you are a grown-up with self esteem, go elsewhere.","useful":8,"funny":7,"cool":1},
{"review_id":"5WNdIO4ZTOP4EXHcvFPt1A","user_id":"YTXbrBoppIjLBeJh65fKKg","business_id":"Y40U2KXA3v-N_h-9F8Y_aQ","stars":4,"date":"2016-03-30","text":"I brought my friend here to celebrate her divorce and it was so much fun!!! When we first walked in and sat down I had a guy come up to me and just start giving me a lap dance. He didn't ask and when he was done wanted to be paid. For this reason alone I did not give 5 stars. Besides that the experience was great! I will say that JT is the best. I had a few dances from him. He was my fav by far! All of the guys were great while dancing on stage. It's just a lot of fun all around. I definitely recommend it!","useful":0,"funny":1,"cool":0},
{"review_id":"TRTDqClehII50Ut0l5_WLQ","user_id":"TGPkoF4sub0vqYQ1w1UYUg","business_id":"oi3FWENKZ5y_bDCpEb8yOw","stars":1,"date":"2016-05-30","text":"This is the worst experience we had at Lakeside Wynn from the waiter to the food the music in the restaurant. The worst don't know how they received to be in the Forbes Travel Guide Four Star award-winning restaurant.","useful":1,"funny":0,"cool":0},
{"review_id":"oTSiViqrWi22Qp3PCnj4qA","user_id":"X88eH9_rEzpX4en26OXcDg","business_id":"otyRCkvK6Kd8Gt2Va-EzDg","stars":1,"date":"2016-05-25","text":"Otakumen\/pat and Waldo's was almost deserted at 12:32 on a Wednesday, a warning sign I ignored to my regret. Ordered gyoza to go.  Priced low $5.  Box contains 5 tiny remarkably greasy gyoza.  Ate one and just can't face rest.  Much much too greasy.","useful":0,"funny":0,"cool":0},
{"review_id":"Bwo5jeNRuXqp8jFTYVVGgA","user_id":"QK2DUh-wJ1JQvunQKA5KTg","business_id":"U1vCsmbALiJpTUySjkirfw","stars":5,"date":"2015-09-25","text":"I pooped into the shop for quick nail fix and color change for my toes. I'm  in Vegas for a competition. Mindy too great care of me. Now my hands and feet look good. Thanks Mindy!!!","useful":0,"funny":1,"cool":0},
{"review_id":"qK2G2Ty22AlWq37tFZx-GA","user_id":"QK2DUh-wJ1JQvunQKA5KTg","business_id":"_DzbJ52ySSD4xVxigwj9nw","stars":5,"date":"2010-12-13","text":"My husband and I visited the store while in Vegas celebratinging our ten year wedding annivesary.. We were just looking but ended up leaving with a fantastic ring. Cher and the creww were great. they took the stone from my ring and placed it in a new setting. It is Breathtaking.","useful":3,"funny":0,"cool":2},
{"review_id":"YiPNvnX_9_JbDhHDfMwaqQ","user_id":"QK2DUh-wJ1JQvunQKA5KTg","business_id":"kd3gE_3MAZjiNUjxD2ubnw","stars":1,"date":"2016-07-06","text":"The Posh Club Hop party bus is a scam. Me and 12 friends booked the party bus expecting a great Vegas club experience. Let me start by saying the hop is a club crawl. Meaning you walk through the casinos to get to the various clubs. \n\nTo start, we met at Mandalay's House of Blues.  The House of Blues was the first stop. We went in for about 15 minutes then walked to the second location which was the Foundation room also located at Mandalay hotel. After that, our tour director (lol) walked us to the third club L.A.X(Luxor).  By then our feet hurt from all the walking so no one went inside the club. We sat outside the club until it was time for the next destination. If we had known this was a club walk, we would have worn walking shoes. \n\nFollowing LAX , we finally got on the over booked party bus (There were not enough seat). Luckily two individuals decided to abandon the field trip after walking to LAX. Anyway, the fun began on the bus where we were served watered down premixed drinks. We danced and got a little wild until rain water started leaking into the bus from the overhead emergency exit. The Party host did seem to care that we were getting rained on. \n\nDue to the rain, we skipped the Vegas sign photo op. \n\nFinally, the final destination and the end of the hop was the Chateau club located in the Paris hotel. This club was hopping and we partied for a couple  hours. \n\nDon't waste your money. You'd be better off renting your own limo bus.  Note to Posh... Include in your description , \"be prepared for a lot of walking\".","useful":1,"funny":0,"cool":0},
{"review_id":"wfWB-46-O5vy7SUK2wL3LA","user_id":"5fAaBl0dC69kW5untTf8KQ","business_id":"Wh_-S_tJvma15bxjSJjrWw","stars":1,"date":"2017-08-13","text":"Honteux ! Franaise en voyage  montreal j'ai voulu tester ce Resto japonais avec des amis : sushis mdiocres sauces oublies bires indisponibles donc on vous sert une autre bire similaire mais cotant plus chre sans qu'on vous l'annonce 2 desserts servis au lieu d'un et refus de le reprendre...  la fin du repas agression de la \"responsable\" qui ne vous a mme pas servi et vous rclame au minimum 20% de pourboire car \"c'est la pratique au Canada\"  Je dconseille aux touristes qui sont la manifestement pour remplir les caisses... Dommage de voir une telle attitude surtout pour un Resto ou la note avoisine les 150$ pour simplement quelques sushis....","useful":0,"funny":0,"cool":0},
{"review_id":"Pdo_4ehBTPvdDPMk5MeF6Q","user_id":"5fAaBl0dC69kW5untTf8KQ","business_id":"kJaoLPzOYh_7UoKuxL0l6Q","stars":5,"date":"2017-08-15","text":"Trs bon restaurant pour le petit dej choix varis : ufs pancakes et fruits frais. Service impeccable","useful":0,"funny":0,"cool":0},
{"review_id":"pqz7ZogfASgP40pF_c_EFA","user_id":"5fAaBl0dC69kW5untTf8KQ","business_id":"BkIZ8UDA23qxnp_kR1Sv8Q","stars":1,"date":"2017-08-15","text":"Nourriture fade : ufs brouills caoutchouteux pancakes qui se dlitent. un service  la limite du correct. Boissons chaudes non comprises dans les formules.","useful":0,"funny":0,"cool":0},
{"review_id":"ASOngeNYDkjXzvUjswTMNQ","user_id":"GPfteXVEeyOB6Jyd552Iew","business_id":"1vqFEbZ4xUsHAbiHmPzuhw","stars":5,"date":"2017-09-28","text":"Everything I've had here has been delicious. Came twice on my own and on my third round brought a number of colleagues -- all of them loved it.","useful":1,"funny":0,"cool":0},
{"review_id":"1BmoG_qVdmYHriTJWg0i6w","user_id":"l9EfJvYmP5i5LB-ctHUVHg","business_id":"_UCTo0560t8IyOq7TwJIUw","stars":1,"date":"2013-02-17","text":"Don't know what has happened to this place but my meal there last night was honestly just NOT good. I have been here before and loved it...even going so far as to call it one of the best restaurants in Charlotte if not the best. Last night, that was far from the case...and on Valentines Day too!\n\nThere were four of us in our party. We ordered a combination of the 3 course special menu and the regular a la carte menu. I had the lobster and truffle risotto which tasted so fishy I could not choke it down. My mom got the oysters Rockefeller which arrived like warm and salty as you can possibly imagine. My husbands butternut squash soup was also like warm and honestly tasted like something out of a Campbell's can (let's face it I've had better Campbell's). I sent mine back and got the mixed green salad instead. That was actually good although not outstanding which is what I expect from this type of restaurant. \n\nStill trying to be positive we moved on to the next course. Out of 3 dishes bc my husband and dad got the same thing, 2 were sent back. The scallops were gritty, fishy and just plain gross. My mom's swordfish was also fishy and tasted just \"not fresh\" is how I can describe it. The only decent dish was my filet, which I still had to be sent back to have cooked correctly bc my medium came out just plain rare.\n\nThe dessert plate was decent and we did eat that, but all in all I was extremely underwhelmed and will NOT be dining here again unless they do something major with their kitchen. Even the manager seemed extremely inexperienced and barely uttered an apology for this disaster of a meal. Yuck!","useful":0,"funny":0,"cool":0},
{"review_id":"wQgzHup6g4iv3b2_IJuBwA","user_id":"gsxo4hlXIL5Y505XWCW2lQ","business_id":"NJ0RzuWd5xDqfJejYQZ65g","stars":2,"date":"2010-06-27","text":"the burger was good, not great but oh the service, i think they forgot all about us.   If you are looking to eat in less than an hour forget it!","useful":1,"funny":1,"cool":1},
{"review_id":"2ulgvPfLj7JjzBEv6aT5mw","user_id":"gsxo4hlXIL5Y505XWCW2lQ","business_id":"HC8x_oRrWYbmPhDYNZLUzw","stars":1,"date":"2010-09-07","text":"Tried to eat here last night.  Was pretty full.  The hostess sat us in the back room which usually isn't a problem.  We waited almost 7 minutes and i then asked the hostess if we had a server. She said she would find out who it was.  After waiting another 5 minutes no one showed up and the hostess didn't return to let us know she had notified our server. In the mean time the hostess had sat 2 other tables in the back room. I guess business is so good they don't care if people leave. oh, she did thank us on our way out!","useful":0,"funny":0,"cool":0},
{"review_id":"kYNVNawPNfJ6fz3vDBYTxA","user_id":"gsxo4hlXIL5Y505XWCW2lQ","business_id":"m9aFZk1f8tSv248YErbpQA","stars":2,"date":"2010-08-17","text":"i grew up thinking a crepe was golden brown in color, this one was purple or grey,  i'm not quite sure.  The chicken with swiss cheese was just alright, i certainly wouldn't rush back.  It is a very cute place, all the appointments were great, maybe they need to practice the cooking.","useful":0,"funny":0,"cool":0},
{"review_id":"WKTkxNbIuvxmLz5OEpMAqw","user_id":"gsxo4hlXIL5Y505XWCW2lQ","business_id":"gZYt10Kn-eHpo3n4lx3iBg","stars":4,"date":"2010-07-18","text":"just got home from a great meal.  our server was very good and our tea and water glasses were never empty..  the lasagna was a true roman style, hard boiled egg and all.   it was only half full, but in the summer that is saying a lot.  can't wait to go back.","useful":0,"funny":0,"cool":0},
{"review_id":"DBRf92L7MMl5CL4VAqT4KA","user_id":"MVj_1U4D5h7iDtu5TG0d2Q","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":4,"date":"2012-11-13","text":"Went for brunch\/lunch with my family... We opted for the Bellagio over the Wynn based on the reviews. We arrived at 1100 and finally got through the long line around 1200. I was pleasantly surprised with the cleanliness, huge variety of the food, and drinks. There is a little bit of everything from meats, pastas, seafood, salads, pizzas, breads, fruits, breakfast items (omlet station, pancakes\/waffles, warm maple syrup, thick slabs of bacon, red potatoes, and sausage-SO YUMMY!!!!) and desserts!!! Champage\/mimosas were optional for a small extra charge and the orange juice tasted like it was freshly squeezed. My favorites were the large cocktail shrimp, prime rib, ham, turkey, sea bass\/salmon, coos coos, sushi, eggs bennidict, and the best cherry danishes that I've ever had!!!! The fresh fruit was amazingly sweet and ripe especially the strawberries, cantaloupe, and watermelon. The waitress was attentive and checked on our table often. We tried everything and I wasn't disappointed with anything. My daughter is 8 and can be a picky eater, but even she was in  pure heavan with the selections. For 3 people we spent $98.00 and it was worth every penny!!! We'll defiantly be back!","useful":0,"funny":0,"cool":0},
{"review_id":"xAkr2iBlytNwmnlLfMCTCw","user_id":"MVj_1U4D5h7iDtu5TG0d2Q","business_id":"b78V2YgEGGb4sp0wdbz57g","stars":5,"date":"2012-11-13","text":"My daughter had the best time here! The all-day wrist band is the way to go for kids and adults! There wasn't any lines on a Friday night and the kiddo got on all the rides over and over! There is a indoor roller coaster that is worth riding a few times but we stayed away from the water ride because you literally got soaked on it! The bumper cars are fun and my daughter was tall enough to drive her own for the first time! It's a nice break from the strip and the touristy sightseeing- its a place that kids can let loose and burn some energy! The rides are fun for even adults, but bring your Tylenol because I had a headache after the 3rd time on the roller coaster!!!The workers are enthusiastic\/friendly, and they do not hassle you to play games like at the carnivals or theme parks!","useful":0,"funny":0,"cool":0},
{"review_id":"e2-mwJiGzZ7imqdX5jCsXA","user_id":"a7AVkBCANuUnDNy_bhtOVg","business_id":"t5E00feZ15wN_AVNCgzWLw","stars":5,"date":"2012-09-16","text":"I love this church. Me and my husband did not know where we could meet people our own age and were looking for fellowship and people to do life with who loved Jesus Christ. I am 22 and he is 26. We were invited to the Maddox's redemption community on Tuesday nights and it was an answer to prayer. Lots of young people we could connect with, learn about the Bible, and ask questions. This church is all about Jesus, enough said. :)","useful":4,"funny":0,"cool":0},
{"review_id":"gyjqBQWXqIDZ34b7wrKrjQ","user_id":"a7AVkBCANuUnDNy_bhtOVg","business_id":"7T2Dx26gYKPMFmAWwHgnOA","stars":5,"date":"2016-03-05","text":"I absolutely love this place. My husband has been coming here practically since it opened and it is the freshest, tastiest, fast Mexican food out there. The ambience is casual but the customer service is exceptional as the staff always asks me to have a seat and brings menus as if it were a sit-down restaraunt. Fajitas are out of this world but I find I can't stop myself from ordering the nachos the past several times I have been. Their red and green salsa is delicious (very important) and they even have an actually spicy hot sauce instead of a wimpy excuse for hot sauce that most places have. The owner works hard to keep this place with a friendly, mom and pop vibe that I think keeps patrons like us coming back again and again.","useful":0,"funny":0,"cool":0},
{"review_id":"eiv63hkSvECrsqRNt6EF9Q","user_id":"a7AVkBCANuUnDNy_bhtOVg","business_id":"QXg8-xvdDP8AqeOBPbrXMA","stars":5,"date":"2013-10-29","text":"Believe all the hype. I just had a cavity filled and my fear is injections in the mouth but I didn't even feel the shot. Also Mcadams made sure everything he did was pregnancy friendly. Great dentist! :-)","useful":0,"funny":0,"cool":0},
{"review_id":"cvJgN8GVU59q4YbZ4LX_xw","user_id":"_7dQ1r5AyiIarVLvuKi54g","business_id":"8KJSfDRhAZjAs_rMDqem7w","stars":2,"date":"2015-06-20","text":"Attended there sponsored Yoga at the Zoo and let me tell you I was extremely disappointed. Unless you tailgated down by the fish tanks..you were not going to do yoga with the instructor! My friends and I were placed on the balcony where we could not see or hear anything. We were told to get as close to the person next to you as you can.. Not sure how that is relaxing when I almost got kicked in the face during downward dog! The two women at top did their best to try to make up their own yoga class, but I am almost POSITIVE it was different from what they were doing below! I don't know if someone was money hungry or what.. But they definitely OVERSOLD tickets. Would love to do it again as long as they only sold a limited amount of tickets! Cool idea at least!","useful":0,"funny":0,"cool":0},
{"review_id":"ipEvCLl5p0MAXcUYxcr5Eg","user_id":"_7dQ1r5AyiIarVLvuKi54g","business_id":"FJWDDlxhFzY1Tqu8sLCTaA","stars":2,"date":"2015-06-20","text":"Attended there sponsored Yoga at the Zoo and let me tell you I was extremely disappointed. Unless you tailgated down by the fish tanks..you were not going to do yoga with the instructor! My friends and I were placed on the balcony where we could not see or hear anything. We were told to get as close to the person next to you as you can.. Not sure how that is relaxing when I almost got kicked in the face during downward dog! The two women at top did their best to try to make up their own yoga class, but I am almost POSITIVE it was different from what they were doing below! I don't know if someone was money hungry or what.. But they definitely OVERSOLD tickets. Would love to do it again as long as they only sold a limited amount of tickets! Cool idea at least!","useful":0,"funny":0,"cool":0},
{"review_id":"6rHnAluBZ9plUHIZw4_a-A","user_id":"_7dQ1r5AyiIarVLvuKi54g","business_id":"69TTOqH18qztsroIii4e6A","stars":2,"date":"2015-06-20","text":"Normally my fianc and I love this place but last night our experience was so terrible that I doubt we will return any time soon! First off I felt like we had gone back in time to a high school dance! All of the waitresses were paying more time chatting about the boy working in the kitchen then checking on their guests! Second we ordered the homemade chips and salsa! Let me tell you the chips were definitely from a bag or they were old! Their was nothing homemade about them! And last but not least we normally visit this place for their delicious wings but they were far from delicious this time! The wings were not cooked all the way and were missing the sauces! After it took 20 minutes to get our waitresses attention,\nwe decided to get them to go and ended up cooking them ourselves at home! Poor experience will also share this with family who visits frequently!","useful":1,"funny":0,"cool":0},
{"review_id":"ZHgbb9RfPOGIhkJqP2uCUA","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"hmfAdo6LuVOvBLiu75C8ZA","stars":2,"date":"2017-01-01","text":"I was really disappointed by this place. Other than its location, Luca doesn't have much going for it. Even the bread and seasoned olive oil weren't good. The arugula salad was sour and bland, the gnocchi, bland and over-sauced, the shrimp was chewy and didn't taste fresh. It was so loud my husband and I couldn't hear each other (but we could hear the people shouting at tables nearby). The room was so steamy you couldn't even enjoy the view because the windows were opaque with steam. The service was very good, but that just isn't enough. Save your money.","useful":1,"funny":0,"cool":0},
{"review_id":"oyIlBixH1HDlN1JfU2XLWQ","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"vuC03KldDXReH8VTqRK03g","stars":5,"date":"2016-10-29","text":"We love LaRich's and it is our go-to delivery pizza. The pizza and other food are consistently good (eggplant parm & sandwiches) and we love their dessert. The best pizza in our delivery radius.","useful":1,"funny":0,"cool":0},
{"review_id":"EuvEc_7160EwjTf2Oa4cNA","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"PPCuGwbGA7HlhsGh8dbBsA","stars":4,"date":"2016-08-20","text":"Really slow service even though we were one of only two tables in the restaurant. But, the food is consistently good. I will just stick to carry out. Order from here regularly and am really glad there is good Indian food in the neighborhood.","useful":0,"funny":0,"cool":0},
{"review_id":"jmy9D-61xXONwe4QFwanlA","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"B2lAC0C5VAtWGkdsml1jfA","stars":1,"date":"2011-08-26","text":"I scheduled my appointment in advance, woke up early to prepare my donation (which was sizable and full of expensive furniture, housewares, dvds, pots\/pans, etc.) and when I hadn't heard from the driver by 9:30 called to find out what was going on.  They had no record of my appointment, were completely unapologetic about the error, and offered only to reschedule for 5 days later, when I would already be moving out of my apartment.  Even after both my husband and I implored them that we had a confirmed appointment and this stuff was too valuable to be thrown away and could they please add us to the schedule, they were dismissive, rude, nonchalant, and took absolutely no responsibility for their mistake.  We have rescheduled with another charity and will never donate to or shop at Salvation Army again.  This was a deplorable experience.  Hopefully all of these negative reviews will force them to reconsider how they do business.","useful":3,"funny":1,"cool":1},
{"review_id":"JrgezrVlMYJCEuxaIpZbew","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"2iTsRqUsPGRH1li1WVRvKQ","stars":5,"date":"2016-01-08","text":"This place is exceptional! Beyond the extraordinary food (creative recipes, fresh dishes, beautiful presentation, exciting flavors, new twists on standards) the service is warm, friendly, professional, and all of the people I met there were really cool and nice. Green beans are generally my least favorite vegetable (on account of them being boring and flavorless) but somehow they made green beans that made me actually gasp with pleasure! They were extremely accommodating of my vegetarianism (made me special flat-breads without meat). When I ate the Brussels sprouts I may have shed a few tears when it occurred to me that I couldn't continue to eat them for the remaining moments of my lifetime. \n\nSummary: Go to here. Eat many food.","useful":1,"funny":0,"cool":0},
{"review_id":"tGgWJTJm6a2mmlhV6caKHw","user_id":"fKtk0Z_qk2PG5MGfx1rw4w","business_id":"Y-oPVMkxgEsve1sG2iDLXA","stars":5,"date":"2016-01-19","text":"First time here and really impressed with the pizza! I got the Diavalo with no meat and it exceeded my expectations. The crust is thin and buttery and the wood fire flavor is smoky and delightful! The ingredients were really fresh and I thought the pizza was well thought out with the garlic complimenting the spicy peppers and olives. The restaurant is small so plan ahead. Definitely will go back.","useful":2,"funny":1,"cool":2},
{"review_id":"wIJ5Hp6zv3GJRyo1KDMA2w","user_id":"co-Pt541e_ggyERYqIB7nQ","business_id":"KPSaUzlYg4JLVbzrbA23uw","stars":5,"date":"2016-11-12","text":"Amazing food and great friendly people. Kind of hard to find but it's totally worth going here. Get the T-Bolt or butter chicken samosas!","useful":0,"funny":0,"cool":0},
{"review_id":"bvICsmv9LxXHnQg83cdaJQ","user_id":"-2K0yp7lBT_JUOzGkpdJ_g","business_id":"5oVIydJLDwm9chThPU6zIA","stars":5,"date":"2016-06-29","text":"Too bad this place shut down! I loved it when visiting Toronto!","useful":0,"funny":0,"cool":0},
{"review_id":"ffFMJDYYTjpE535IrFmMVg","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"hBJ0SZwpCX5fvJPyxFy83Q","stars":4,"date":"2016-12-24","text":"Delicious food and great service. Nice quiet atmosphere for lunch or dinner!  I recommend the Bangkok curry!","useful":0,"funny":0,"cool":0},
{"review_id":"yXqobwCCskx6dEbdvzWkCA","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"owO2UkNKk9qrWWd_PTYLDA","stars":4,"date":"2016-11-06","text":"First time at Area 51. Both the pulled pork and brisket were great. I recommend the mixed BBQ sauce. Great new local business. We'll be back!","useful":0,"funny":0,"cool":0},
{"review_id":"NRXfMXiQhw-vflEq0LqAeQ","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"F8_WdEVmUFTU1pTHBgikIg","stars":5,"date":"2016-12-24","text":"This is my favorite place for breakfast\/brunch. Lots of variety and the food is fresh and delicious!  The restaurant is pretty large and they've done a great job in the renovation. I like the little things like how they leave you with a pot of coffee or a carafe of water and they have real maple syrup. Good service too!","useful":1,"funny":0,"cool":0},
{"review_id":"CxQEza7TsaDa04QUaK1opg","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"YbrMUQSdRtTMZSUQq3xoPQ","stars":5,"date":"2014-10-03","text":"I have been buying fudge here for years. It is the best I've found!  I especially like the maple walnut and chocolate cheesecake!","useful":0,"funny":0,"cool":0},
{"review_id":"LsMfp61XVM-H58ub-rLCNA","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"ZJdOOIubTizd1eqECkeK-Q","stars":5,"date":"2015-07-22","text":"This is my very favorite Mexican food.  I've never been disappointed.  La Favorita is my favorite along with the cheese dip and sangria.  Even the chicken soup is amazing.  The service is excellent!  There's nowhere better in Pittsburgh for Mexican food!","useful":0,"funny":0,"cool":1},
{"review_id":"qERvhSYR-EzDJZY8KtWEbQ","user_id":"9cpWdgpc-i7FJ3ziip5Czg","business_id":"BqHX49ixrSuPoMaZ9Lzz1g","stars":5,"date":"2015-07-22","text":"I'm stunned to read these negative reviews.  Maybe things have changed over the past few years.  I've been to the Nailery several times now for gel mani & pedi.  I love it!  My nails are always beautiful and stay that way for a couple weeks or more.  The owner is kind and fun to talk with in addition to being quick and efficient.  I highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"vaShZluarrh8SGsfeLbqYw","user_id":"eIS-uKkK_PKzRsOaTFNZMA","business_id":"IakOnLeTFBvJvcxxBHQq_Q","stars":4,"date":"2015-01-02","text":"I went to Olio with my mom for lunch while I was home visiting for the holidays. We loved the cozy and comfortable atmosphere. The staff was attentive and friendly. We liked Dale, the bartender. He had such a great attitude, very refreshing from some other bartenders around Pit that aren't as kind and welcoming. I loved their drink selection, including the wine list and specialty cocktails. The bar menu was very affordable. I heard that they do 1\/2 price wine on Wednesday, I would definitely bring my girlfriends here for a causal night out. \n\nWe enjoyed the Antipasto for an appetizer. It was delicious! The bean dip was killer! And the bread served was soft and yummy. We split a chicken salad and prosciutto arugula pizza. The salad was fresh, the dressing was perfect and chicken was grilled to perfection. The pizza was yummy, it's crust was soft and doughy. It was a delicious spin off a traditional non-brick oven style pizza. Next time I want to try a pasta dish because it all looked so good and great portions too. This is definitely a restaurant that values using fresh and simple ingredients with nice traditional touches.\n\nI really enjoyed everything during my visit to Olio. I would definitely recommend it to my family and friends. It's finally nice to find a causal and comfortable restaurant with friendly people, good service and great food at an affordable price.","useful":1,"funny":0,"cool":1},
{"review_id":"SwfY9cFbI8lwjXxyWP8vqg","user_id":"6R52yUMNN592Nr99O4g21w","business_id":"_myTPlWa8QRN5eavs-hNPg","stars":4,"date":"2014-02-03","text":"Great atmosphere! Owners Frank & Alicia treat you like a guest in their home. Happy hour 7 days a week! (I almost don't want to share what a gem this place is, so I can keep it to myself.) The meatball sliders are amazing, and there's a pork chop with polenta on the Happy Hour menu for only $7!! My parents are regulars here now, and I can see why. If I lived closer I would be too! \n\nAll in all, a great place for homemade Italian dishes (and desserts) that is perfect for the area!","useful":2,"funny":0,"cool":0},
{"review_id":"9bfnqemozlvKzbmc8gbItw","user_id":"r2hoX58seF3kwP-U2W__QA","business_id":"xVEtGucSRLk5pxxN0t4i6g","stars":5,"date":"2009-06-09","text":"The best piece of meat I have ever had!!! This filet mignon melted with the plunge of the fork and then in my mouth. Asparagus al dente - perfect.  Any dessert is so good it is almost perverted. Service is good but dont expect california fakeness or ignorant drivel. Just get to the business of eating a fabulous meal.","useful":1,"funny":0,"cool":1},
{"review_id":"FQkE9QGvlhz3bM60PrFlqg","user_id":"2_CO_YlD5Yh_Qc034indfw","business_id":"uJJ62PLmWnkvPMDSB4k4AQ","stars":5,"date":"2017-08-22","text":"New Horizons Medspa- is the only place in town - that has professional staff- helpful crew- as well as a nice CLEAN facility.  Thanks - I recommend them all the time.","useful":0,"funny":0,"cool":0},
{"review_id":"1dgqkQS154I932CGIYsrIw","user_id":"xzjZZeRihz9IIARzVP62wA","business_id":"xVtdfNY51JlTpXLGzQs5ag","stars":3,"date":"2013-04-08","text":"Today was our second visit to 'The Egg I Am' on a Sunday. We arrived around 9:00AM and not a bad wait to be seated, 30 minutes. The complimentary coffee is a nice perk to have available while waiting. Once seated, it took 30 minutes for our food to arrive (during both visits). It has been over 6 weeks or more since they have been open and it is a shame that at both visits it took over 30 minutes for our food ticket, of just breakfast food. This is a lack of prep in the kitchen. Owners please take note and work on the kitchen staff to speed up the times. The apples in the apple pancake were raw. They fell out of the pancake. The eggs were great the first visit and were cooked just right. Today, the eggs were runny and were not hot. The bacon was cold too. I just do not see a 3rd visit in my future.","useful":0,"funny":0,"cool":0},
{"review_id":"acsWXRjRWWKzITQK4KaI4w","user_id":"gIWWW6w-6P2j-hTH7nantw","business_id":"hOB3NHuF-iVFdEkrA-PUlg","stars":4,"date":"2012-02-17","text":"The Gault is a wonderful destination.  My fiance and I stayed for Valentine's day weekend 2012.  We picked what could have been one of the coldest weekends all winter to visit Montreal, but due to the cozy warmth of our home-away-from-home at the Gault we felt so comfortable!  \n\nThe room was lovely, we had a loft basic package and really enjoyed the heated floor and cute door overlooking the street.  The bed is super soft and really a nice complement to the modern look of the room.  There's turn down service and cookies provided daily.  The location of the hotel in Old Montreal could not have been better - it's perfect for walking through the area and very close to the waterfront.\n\nWe took part in the spa package offered through the website with the Scandinavian baths and really enjoyed the experience.  Our massages were great and the price was reasonable and cheaper than what we would have paid on our own.\n\nI emailed the concierge ahead of time to request a special wine and snack celebratory surprise for my fiance and they were so helpful.  The entire request was provided to perfection and right on time.  I would highly recommend working with the concierge as the recommendations for dinner and jazz club were completely on-point.\n\nI've given 4 stars instead of 5 for a couple of reasons: the price is still a bit high for what you get, the breakfast is not included in the room rate although we were told it would be upon check in, and the gym is adequate but quite small.","useful":3,"funny":0,"cool":1},
{"review_id":"uzpGPQM2gvFmflbWLMbfmA","user_id":"gIWWW6w-6P2j-hTH7nantw","business_id":"EiscIlZ1owIb-TT1ugZ2Cg","stars":5,"date":"2012-02-16","text":"Intimate seating and sexy lighting... fantastic live music... a host who helps you find seating by artfully rearranging other patrons and a cover of only $6.  So what if my scotch pour was a tad stingy - this place has it all!!  \n\nThis is the perfect locale for a nightcap post dinner at L'Express (easy walk, even in heels and in 5degree F weather!) or to round off a hot first date.  I highly recommend checking it out - only don't tell anyone else, or next time I'm in Montreal there may be no room for me!","useful":0,"funny":0,"cool":2},
{"review_id":"d9Sz0NnzHraoouEbA-6waA","user_id":"qT87Od1_nUvgcdLh07N1oQ","business_id":"DI5lVpHe3xf-IPr_mgzxyg","stars":2,"date":"2011-01-11","text":"Great service, you can always count on a sincere smile when you come here! Fish tacos are good but many of the other good items could use more flavor.","useful":1,"funny":0,"cool":0},
{"review_id":"7m4eBhccJ5_XsLBjd05-HA","user_id":"qT87Od1_nUvgcdLh07N1oQ","business_id":"Wa2X66syShuMSVUYAj1C-Q","stars":4,"date":"2011-01-11","text":"Great food, reasonably priced. Large portions, plentiful variety! I highly recommend the orange chicken, the Mongolian beef and the number five meal with chicken, vegetables and lo mein noodles.scrumptious!","useful":0,"funny":0,"cool":0},
{"review_id":"RnwDQRmU3yQxPOnp_13dRg","user_id":"3-VzHOXgKvNoZCdIpQUezg","business_id":"K6ZdOSAvYs7LtPOOq30xsQ","stars":1,"date":"2017-04-14","text":"The manager had such an attitude , the manager \"Mandy price \"was talking so rudely to me for some one who has spent numerous amounts of money with them for mainly one of my dogs. She seemed like she didn't care about me as a customer at all, I work with customers all day and never would I have an attitude as hers. She made me feel like my money should have went some where else . I was expecting a more professional manager who would be a role model to her fellow workers . The two front desk people had better manors then she did, They should be her manager maybe she can take some tips on basic human communication 101.","useful":1,"funny":2,"cool":0},
{"review_id":"iEmjS6V5BD9o7uBpVa6PLA","user_id":"3-VzHOXgKvNoZCdIpQUezg","business_id":"1Nq7GxjvEDgAJxBeOjR_9Q","stars":1,"date":"2017-05-24","text":"This place had horrible customer service . The manager \/ owner had me on wait for 10 plus minutes with out even apologizing and was overly rude ... they messed up my last order as well with being 30min late and food was cold....! Places like this need new manager\/ better owner-ship because if that was the manager on the phone then contact better Business Bureau ASAP people","useful":0,"funny":0,"cool":0},
{"review_id":"pEJ1wpmTgy3AXHktlI0A2A","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"x3XmzWJUMEPLAvugNqIYQA","stars":3,"date":"2014-02-27","text":"We order the sample platter for 2, and it was way too much food. Perhaps we are not accustomed to eating BBQ in such quantities, but we hardly made a dent. The variety was very good to sample each of the meats that are offered, as well as two sides. Meats included full rack of ribs, brisket, pulled pork, meat loaf and chicken. We started with the ribs, and while  happy with the portion, I must say that I was disappointed in the meat itself. I'm not sure if they were baby back ribs, but they tasted more like side ribs, and were kind of dry. I am not a BBQ expert, so maybe real BBQ ribs are not supposed to be moist, but if juicy is wrong, then I don't want to be right! The rest of the platter was decent. The sides were probably my favorite part of the meal. We got fries, coleslaw and potato salad. I love sides in general, and all of the sides were excellent. The fries were crispy but not overly crunchy, the coleslaw was creamy and sour, but not too creamy, and the potato salad, topped with some paprika, was one of the best that I've had. There are also two bottles of house BBQ sauce on the table that you can add to your meats; I dumped it in massive amounts all over. The spicy one is pretty good, with some kick but not overbearing. I didn't not try the mild one. \n\nThere are two parts of the meal that are my focus: the sides (as mentioned above), and condiments, including any sauces or little extras that add to the meal. Many times, I can even forgo the main. In this case, I could definitely go back just for the sides and call it a meal.","useful":0,"funny":0,"cool":0},
{"review_id":"U6mGBLG2FQ-b7mFH4LC02Q","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"4izLezuABxOQUylmVenjHw","stars":1,"date":"2014-02-19","text":"Came here really wanting to like it since it's relatively close to home, but I was quite disappointed. The prices were very high for what we got. \n\nWhile I do enjoy fusion, particularly Japanese fusion, this aspect was not well executed here. They served some spicy tuna on a Pringles chip and another concoction on a nacho chip... Perhaps that night they were short on tuna but all I could taste were the chips. Not good. \n\nAlso, we had a billing issue that the waitress and manager could not resolve so she consulted with the owner. Instead of coming over to talk to us, he simple said no and sent her back to us without an explanation. We always try to be gracious to waitstaff when there are problems with the billing because I believe that it is the establishment's responsibility, and so we told her that the bill is wrong but we will pay it to save her the trouble. But overall, this showed poor customer service on the owner's part.","useful":0,"funny":1,"cool":0},
{"review_id":"ISS9GwK0T3XuCHYUCdO9ag","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"XETJL05OGIi-WliFzgk7cg","stars":2,"date":"2014-02-17","text":"I agree with the precious review; many of the dishes were not not available when I came in. I was told that I would have to wait 5 minutes for most of the dishes to come out, so I did. 10 minutes later, I was still waiting. Eventually someone noticed I was still waiting, apologized and offered me a free drink. I ended up getting the orange chicken, walnut shrimp and mandarin beef (crispy beef). The food was not that bad, typical Chinese takeout, but a little healthier. I think that the fried rice was brown rice. Note that the walnut shrimp is considered a premium item and has an additional charge. \n\nWhile I don't have complaints about the servers, the manager of the place did act very professionally. With an open kitchen, customers can watch their food being cooked and any interactions in the kitchen. That day, the manager reprimanded one of the cooks; not only did this slow down the food being prepared, but it was unprofessional. As I watched, I felt very bad for the guy; he was only one of two cooks, and from the time that I got there, he was cooking fast and hard. I think that Panda Express needs to hire more cooks to have food ready to go, as they are a fast food\/ take out restaurant, and consider better training for their managers.","useful":0,"funny":0,"cool":0},
{"review_id":"bGW8oujOHdGY4f98sSYAbw","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"2AGqSSK62TdzsnI80K_q4w","stars":5,"date":"2014-02-22","text":"My favorite place for Vietnamese food! \n\nWe like to get the bo bay mon (7 beef courses) ($25), and the family combo (canh chua - soup, ca kho - braised catfish, and goi kho bo - papaya beef jerky salad) ($20). They also have a seafood hotpot, with fish, squid, and veggies with a sour broth - very GOOD for under $25. Banh xeo is also quite good. \n\nVietnamese comfort food, at an affordable price. Very good service as well.","useful":0,"funny":0,"cool":0},
{"review_id":"Os-cJXka_SKtc1crdon84g","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"qA0SlNp1fVtMuB51okYhIw","stars":3,"date":"2014-02-17","text":"My SO and I have been trying expand our food horizon and try new cuisines. Inspired by our recent trip to Khao San Road, we ventured over to Lion City for a different South East Asian type of food. We ordered two noodle soups, the laksa and another soup that had two different types of noodles in it  (don't remember the name). I was anticipating bold flavors, but was disappointed. The laksa was a little to coconutty for me, and did not seem to have any other seasonings (save for some satay on the side).\n\nDespite this, I chose to give a 3-star rating because of the service. The servers there are very attentive and friendly. The atmosphere was very warm and welcoming. I think that I would go back just for the atmosphere here.","useful":0,"funny":0,"cool":0},
{"review_id":"5pZxY_gI8M0TLiuKHmLV2A","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"NkcT0GT7Xt2mtvIgHSxOcw","stars":4,"date":"2014-02-19","text":"There are 3 types of tacos that I have had here in Toronto: Taco Bell, Mexican tacos and fusion tacos. This is a Mexican taco place. \n\nThey have a variety items on their menu but we only tried the tacos - beef tongue, fish and carne asada. All were excellent, full of flavor, and spicy. I like my tacos very spicy, and often times, its not quite spicy enough, but here, the hot sauce really packed some punch. \n\nThe beef tongue was tender and flavorful. The fish taco was fried, the batter was good, not falling off of the fish like many places. The carne asada taco was not as good as the first two, but still enjoyable. All 3 tacos had pico de gallo , carne asada had pickled cabbage. \n\nMy favorite was the beef tongue. I was very apprehensive about it at first, because I've seen raw beef tongue before... its not pretty, but now, I look for restaurants that serve it. I have yet to find one as good. \n\nUnfortunately, I drove by a few times and the windows are blacked out, so I assume that they have since closed.","useful":1,"funny":0,"cool":0},
{"review_id":"7BYoqZEY-TQnGmn8jd0PZw","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"a-Mo7Ipu_c5y21mmg0-F7g","stars":5,"date":"2014-03-04","text":"I was apprehensive about going to Agio for dinner but agreed since we did not have a dinner destination and I hate driving around looking for a random restaurant. As we walked in, I was immediately doubtful of my agreeableness. Not only was the restaurant empty, there was an Asian man mopping, and he looked to be the chef. He quickly greeted us, told us to sit anywhere and brought us some hot green tea. At this point I was confused - green tea with pasta? But we went on anyway because he was actually very friendly, and I felt like I just walked into my uncle's house. \n\nWe ordered the butternut squash ravioli and the osso bucco. After ordering, the chef disappeared a while. When he returned, he had two bowls of butternut squash soup and some garlic bread. While it was a little bland, I enjoyed the warm soup on a cold day, and appreciated the complimentary amuse-bouche while we waited. \n\nNot long after, our mains were served and I must say I was impressed. My SO's osso bucco was accompanied with vegetables and some penne pasta, while my bowl had 4 large ravioli in a ros sauce, which was perfectly cooked. While I am not a pasta expert, I believe that the ravioli was made fresh and in house. The pasta itself was slightly chewy, with a generous amount of butternut squash in between. The sauce was a little overwhelming but I swept some of it to the side, which the bf gladly soaked up with the garlic bread. The osso bucco was also delicious; the veggies were cooked well, as was the pasta. But the star of the dish was the veal. The marrow was a nice treat to spread on the garlic toast (and on its own), and the meat itself was soft, tender, and well-seasoned. We ended the meal with complimentary tiramisu, which was excellent. \n\nOverall, Agio has a homey atmosphere, with delicious food. While small and easily missed, it is worth it to give it a try. Don't let the ethnicity of the chef deter you; as others have mentioned, he lived and was trained in Italy for many years.","useful":1,"funny":0,"cool":1},
{"review_id":"rVdAZgdVuJA0PzyHINtAzg","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"dc3uoAmNo5STqKV6mlD_aA","stars":4,"date":"2014-02-19","text":"Had the Drake burger, which was on promo for their 10 year anniversary. I thought that the burger was pretty good; I really liked the cheese and the bacon was very smokey and flavorful. I really like the bun - it was slightly chewy and toasted with butter. Also came with a pickle. \n\nWhat really stood out were the fries that came with the combo. I believe that the fries were twice fried with sea salt. I am definitely a fries girl and these were one of the best! I probably wouldn't pay full price for the burger ($19), but perhaps I would might just to have the fries.","useful":0,"funny":0,"cool":0},
{"review_id":"OwGJu3ZtvJVoOoettoToZg","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"jCpB1D_Hsc_dlF0ErNO-7w","stars":3,"date":"2014-03-06","text":"We came for the soft opening, so we knew that it might not the same experience expected from Guu. \n\nWe were quickly seated at the bar, and noticed that there was a strong hot air draft where we were seated. It was very hard to breathe and my eyes were getting dry but this was quickly turned off when the waiter noticed that I was trying to find the source of hot air. Sign of good customer service. \n\nWe ordered a variety of items on the menu including smoked monkfish liver, beef tongue and many different skewers. I really enjoyed the monkfish liver - it was actually my favorite dish of the night. The beef tongue was okay, a little chewy but good flavors. Very smokey. Upon tasting the first skewers that came out, my boyfriend commented on the temperature of the grill, that it wasn't hot enough. While I don't know much about grilling or temperatures, I trust his judgement in this area. As we received the rest of our skewers, each one had more char, and better flavor and texture. \n\nOf the skewers we ordered, my favorites were the liver, pork cheek, and pork belly. My least favorite was the sasami or chicken tenderloin; I found it a little dry and not enough flavor. \n\nI believe that there is great potential here at kintori, and will eventually live up to the standards set by its Guu counterpart.","useful":0,"funny":0,"cool":0},
{"review_id":"N_v3Mg4ZRQgRiHt6__BSJw","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"i1bwc_MLGgOIJ8S0r2uu2w","stars":4,"date":"2014-02-27","text":"Choose 2 is the perfect portion size for me! And I get to try out different things on the menu. While quite pricey, and can be replicated at home at a fraction of the cost, its a nice place to spend a few hours with friends catching up, or studying. \n\nYou are pretty safe ordering most of the items on the menus, except for the mushroom soup. I was under the impression that it was a cream of mushroom soup, but it was far from what I had expected. It was more sour and strange, so I couldn't finish it. Before I ordered, I did ask to confirm that it was cream of mushroom soup, but upon tasting, I think that it had more of a wine base than cream base. Maybe my taste buds are not refined enough, and the soup is actually good? I'm not sure.","useful":0,"funny":0,"cool":0},
{"review_id":"Ymy_H-EPNegP3ibWmc7mVA","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"ovnqQaQ8BsPgDoJ4nlYBUw","stars":5,"date":"2014-03-05","text":"Good even on a cold winter day!\n\nI'm not sure how it is possible but the cookies are soft and chewy, but also crunchy. Ice cream is very creamy and not icy at all. My favorite combination is the ginger molasses cookie with dulce de leche ice cream. I am not looking forward to summer, when I am sure there will be huge lineups!","useful":1,"funny":0,"cool":0},
{"review_id":"51dykqtFg1RZkBL69S51wQ","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"gh0mBl_SBZ6kX9mYMq-R5g","stars":4,"date":"2014-02-27","text":"Probably one of the best AYCE sushi restaurants that I've been to. As mentioned, on the weekends, you can order sweet shrimp sashimi. At first, I was apprehensive about ordering it because I've had bad sweet shrimp at non-AYCE places, however, it was very fresh and good size (sometimes, sushi places have tiny, tiny \"sweet shrimps\"). \n\nEverything else on the menu was enjoyable, with very good portion sizes - small enough that you have the opportunity to try multiple items. For example, the rolls come in 4's, so you can try more than one roll. Another plus was the dessert. They have black sesame ice cream, which I've never seen at AYCE sushi before, along with other jellos (black current and litchi), mango pudding and a chef's special. \n\nWhile pricey, $24.99 on the weekends, I would say that its worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"OB-3nwWRgQ6wIOWXDhgpfQ","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"AYxhg8pCPpTayz6TYfNzFg","stars":4,"date":"2014-02-19","text":"When we go out to eat, my SO and I like to order different meals so that we can sample a variety of foods from the restaurant. In particular to sushi restaurants, I usually get some raw fish and my SO gets a bento with cooked foods. \n\nHere at Sushi House, I ordered the salmon chirashi and he got a bento. The bento was not too special but the chirashi was very good. The rice was well seasoned, with a  generous portion of salmon, along with other little condiments on the side like marinated mushrooms and pickled radish. After the first time, I always order the same thing. \n\nThe owners and chef are Korean and so the sushi is a bit different from Japanese or Chinese sushi.","useful":0,"funny":0,"cool":0},
{"review_id":"RnU23wPLv5XF0O3meg65rw","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"qiRyyRWt6jmAxcoVW0-WHA","stars":3,"date":"2014-02-17","text":"We came here for lunch on a Friday. Upon first impression, we noted the large space, high ceilings and modern decor. The service was hit-or-miss. Some of the servers were friendly, and attentive, while others just tossed our food on the table and walked away, ignoring all inquiries. \n\nAs for the food, I was very impressed by the soup. We had hot and sour soup, and ordered a second one, it was that good. Other than that, there is nothing special about the food. The salmon sushi didn't taste very fresh, but I did enjoy the seaweed on the handrolls.","useful":0,"funny":2,"cool":0},
{"review_id":"dk5_PgDvOg2WiLizbVc3MQ","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"-BSf1LtnOrtCWAzmumxUpw","stars":4,"date":"2014-02-19","text":"I have recently discovered the Chatime on Dundas, and have become a fan. I usually get the grass jelly roasted milk tea. This location was very busy for a cold and wet Monday afternoon, with about 15 people ahead of us. The drink was consistent with the Dundas location. I would probably avoid this location because it is so busy, but without the line, and if I was in the area, I would be there.","useful":2,"funny":0,"cool":0},
{"review_id":"N7WVogy79U8uYyrJGQJRDg","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"_F1_05YYlvePzomZ_NFijA","stars":3,"date":"2014-02-22","text":"Been here a few times, and am usually happy with the food, service and atmosphere. The rolls are not very special, just average, although the presentation is very nice. The tempura was very good, particularly the lobster tempura - very reasonably priced too. They also have monkfish liver sushi, which I always appreciate; good portion and tastes great!","useful":0,"funny":0,"cool":0},
{"review_id":"ofXYrUYC6iYF8pGO5HGcLQ","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"ZDDzKXN_JXe7694zePRuTQ","stars":4,"date":"2014-02-22","text":"Grass jelly roasted milk tea with tapioca half sweet!","useful":1,"funny":0,"cool":1},
{"review_id":"PsXMmd1z_XiqMz8MlDMCfQ","user_id":"hJulW1s6tOBr2NXD9nAoMQ","business_id":"fK1oj0dk9Bc6KsBk5mMDxg","stars":3,"date":"2014-02-17","text":"When eating tacos, I like to have a good hot sauce on the side. Cantina definitely delivered in this respect. On the table, there are two hot sauces, the red one, chipotle based, and the green one, SPICY! \n\nWe ordered the octopus taco, fish taco and the LA truck taco. The combination of flavors worked very well. Each was enjoyable but the octopus was particularly good. I'm not sure how they cook it, but it was soft and flavorful. We also have the ceveche and plated chorizo burrito. The ceveche was not what I expected; I could have used some more salt and lime. The burrito was quite good, and unique. It had a fried egg on top, along with many sauces. \n\nThe reason for 3-star rating is mainly because of the price. With so many other fusion taco places around now, changing $5+ for a taco seems to be a bit steep.","useful":1,"funny":0,"cool":0}]