[{"review_id":"SX3gbwk6qRc4nuPhq-Ptag","user_id":"J_FU9nbqkuOoqkoZrB6ZGw","business_id":"MpovsyjkSkchD7ssAdEVKQ","stars":5,"date":"2016-05-12","text":"F*****g delicious. Ravioli was freshly made, lobster fried rice was amazingly covered throughout with giant pieces of lobster. The Filet mignon cooked perfectly to medium rare... Makes me want to go back right this second","useful":0,"funny":0,"cool":0},
{"review_id":"p6HgP5Cm0D7fiE333KXWNA","user_id":"aqH7A5v-uCkjIbLx4XlKvg","business_id":"OKlXchOaMlv5F6LEdaeiow","stars":5,"date":"2016-05-18","text":"Great little pizza joint! Great location, very friendly staff? I highly recommend it!","useful":0,"funny":0,"cool":0},
{"review_id":"s7sVomxcrWJCqoKmGyzd1Q","user_id":"wOiu0W5hu9T21BTZSdh0OA","business_id":"qje0dtfyYDRrdgpmTlHu3Q","stars":5,"date":"2013-10-27","text":"This place made me fall in love with pho all over again. The meat, the noodles, the broth, all were delicious and cooked perfectly. The spring rolls were superb too. And despite their being very busy the service was excellent.  Highly recommended.","useful":1,"funny":0,"cool":0},
{"review_id":"0PONpb0zUSt4vGN7g1kJkA","user_id":"NANgDZQvrobzHUvcFeQXfg","business_id":"DQa4ZI-lBPAG_3Mo_ye4ow","stars":5,"date":"2017-06-01","text":"I want to start off by saying that I specifically signed up on yelp to write this review.  I typically do not write reviews but in this case I did read them.  I booked Haul N Ass for my Sister's May Wedding in Cottonwood after coming across photos from a friends IG.  The post was tagged and I called the number and although it was somewhat last minute (i would have booked it sooner if i had known about it) vanessa took the time to answer all of my questions and since they had been to the venue before the booking was fairly straight forward.  The only rub was that they only accepted payment in full in advance of the date and I was more than a little nervous since it was not a small amount of money.  So before I mailed the check out of curiosity I went online and attempted to do some research on the company and this is when I cam across the yelp review.  I read the long crazy rant from jennifer (what a bridezilla) and I also read the stupid post from Lizz T.  Yep I had some time on my hands. And I have to say the negative post was strange to me since it didn't add up to my experience that i had with Haul N Ass to that point.  Well I sent the check and hoped for the best after all it was a surprise so if they didn't show up at least no one besides me would be dissapointed.  Well the day came and they did exactly what they said they would do.  It was like they appeared out of nowhere and after the ceremony the donkey was the first thing everyone came to.  The donkey was awesome! I mean it looked like something out of a magazine and my Sister went crazy.  She wanted the burro to begin with but they just didn't have the money left over in their budget.  So back to reason I am writing this.  That POS post by Lizz T actually caused me to second guess my decision to get the donkey.  The photos came back from the photographer today which made me remember and Lizz T bullshit post and I felt the need to write this because having the donkey at my Sister's wedding was amazing and we almost missed out because of what I will call politely misinformation and what is clearly an agenda by Lizz T - yelp should not allow her to posts - that all.","useful":2,"funny":0,"cool":0},
{"review_id":"2nIrahJpKmsADWyzDMarSQ","user_id":"c6XnMcxwKzy9wBuws1_bZA","business_id":"BeKbKmiGX8C1_lOmzKwH0Q","stars":1,"date":"2017-10-24","text":"i went to starbucks with two of my friends and the barista (emma) declined to give me a free refill because you had to have a \"gold card\" but on the Starbucks app it says that a green card can get a free refill on any tea , or brewed coffee. then one of my friends had asked for light ice, and the other barista (megan) said \"ugh these teenagers\". they are very disrespectful. do not suggest going here.","useful":0,"funny":0,"cool":0},
{"review_id":"HPXwJdEnU3hNq6IcuQ7qpA","user_id":"b6M_m7rUIIgIk1sHqpOwCQ","business_id":"WGkqfp1-3130v8xhCb3APg","stars":5,"date":"2017-07-10","text":"I cannot begin to express my love for this place. I go here once or twice a week, and one of my friends's parents own it. I certainly feel special as the awesome and helpful waiters and waitresses almost fight over who gets to serve us. If I could give service 300,000 stars, I certainly would. The food is extraordinary and is a million times better than that of taco bell, or and other taco place. Their chipotle mayo is the bomb, drinks are made with expertise. Everything is fresh, and when you taste the food, you'll want an El Biggo. The wait time is small for both food and seating, and filling that time is easy with the entertainment of the talented and awesome staff. Have fun, and enjoy Taco Tontos!!","useful":0,"funny":0,"cool":0},
{"review_id":"0KbLV-aLomqNxqyxjwSc_w","user_id":"b6M_m7rUIIgIk1sHqpOwCQ","business_id":"b--I9Ed6N5P9fwEb2qaiqg","stars":1,"date":"2017-09-03","text":"I have to start by saying that the first time we went there, the food and drinks were mixed up and service was horrible. So the manager gave us two 20$ gift cards. Our family wanted to go there again, so we did. The food took 45 minutes to come out, and someone had to wait another 10 minutes for their food, it was blackened and horrible. We asked for another one, and it took another 20 minutes. Some of the games were not working. When we tried to use the gift cards, the manager said there was nothing on the card. He was not the person that gave us the cards. We asked for him, but he never came. The only thing keeping me from viewing this as 0 stars was the waitress. She was very nice. We will not be THINKING of coming back here.","useful":1,"funny":0,"cool":0},
{"review_id":"XrW2kOMUmsey0SDwTv88gA","user_id":"BfQWoUO0YCRc532ouOf8-g","business_id":"uLyUh6bR5_RX5RlQ0LNvow","stars":3,"date":"2016-12-14","text":"The tech could have been a bit more communicative, but he diagnosed the cause of the malfunction quickly (10 minutes), and had the repair (two new light beam elements) installed in another 10. The hardware that I paid him $109 for is available on Amazon for one third the price, but I checked this too late. Bummer!","useful":0,"funny":0,"cool":0},
{"review_id":"ZtL0j12iJLnwq3fZ44ky3w","user_id":"2GA1iqVymUvoT1q0eV3cUw","business_id":"KWZqC7vfWpqlxnf0nD7QHQ","stars":5,"date":"2010-12-15","text":"Tumble Inn, Stumble out. A true bar bar. The outdoor area is a plus too. Never had a bad time at the Tumble inn. Good place to watch the Illini, or go drink at before and after you watch the Illini, live.","useful":1,"funny":1,"cool":1},
{"review_id":"Kg4Spz_zRjpIXv1ytvEXHw","user_id":"QeD1MQotlcTde-u_TvKT5A","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":1,"date":"2017-06-16","text":"Went here thinking there was gonna be avocado toast. LIES!!! there was just toast. and avacado. what the crap.","useful":0,"funny":0,"cool":0},
{"review_id":"_Hz1noOQ6GOeZ5DdHjko-A","user_id":"AjYAaN1BYSRKwooe2i7QeA","business_id":"9_0FtoabuC42T7AWDk5_sA","stars":4,"date":"2008-07-04","text":"This place is amazing.  \n\nAlgebra is the type of café that you often see in movies, but rarely in real life.  Owned and operated by an artist from Tripoli, the den's name is inspired by a combination of personal background and history (algebra has Muslim roots and is a universally recognized discipline).   I'm usually a germ freak, but I didn't even care that the place seemed less than spic-and-span.  The owner initially planned to focus on coffee, but we're all the richer for his decision to turn to tea, instead.  The Friday Night Market tea is my personal favorite.  Ask where he got the idea, and you'll understand its long and cumbersome title.  \n\nJust stop reading the reviews and get to Algebra.","useful":0,"funny":1,"cool":1},
{"review_id":"q4-g6fcv_4azAEinbddfsg","user_id":"1CTNifAekCVeGSuOll5vCg","business_id":"No_oM0f8dqiX2h8CfxoGuQ","stars":5,"date":"2015-11-20","text":"Cloud town is the best. George, along with the other staff, is incredibly friendly and knowledgeable. This is a great place to just hang out and get to know everyone. I have never had a bad experience while coming by.","useful":1,"funny":1,"cool":1},
{"review_id":"O_mT8EDP9YW0FvmT2Cm1AQ","user_id":"kNCE627u2VQo9BSqINsAOg","business_id":"na4Th5DrNauOv-c43QQFvA","stars":3,"date":"2015-08-09","text":"We stayed in the fountain view deluxe room for 3 nights. The rooms are clean and the view is very good. Also the room service (a bit pricey) is very prompt and good. But here are some of the downsides:\n\n1. While booking if you ask for a 2 queen beds instead of 1 king bed on their website, you might not get 2 queen beds. This is not very obvious from the website. Website should be more explicit about it. Also if I want 2 queen beds, I should get 2 queen beds or you dont take my reservation. What is this business of \"You might get 2 queen beds\".\n\n2. There is no coffee maker in the room. This is something everybody provides but not Bellagio.\n\n3. For the fountain view room, you can see the fountains but not hear them which takes the fun out of it. I called front desk to see if there is a TV channel I can hear the fountains on. They told me that it is broken (The audio system) and they are working on it. So we had go out and stand to enjoy the fountains.","useful":0,"funny":0,"cool":0},
{"review_id":"Ub0uc4FhBsOQNeby4ATnKw","user_id":"kNCE627u2VQo9BSqINsAOg","business_id":"UV2Jt8slktGu14gLZeNCjA","stars":3,"date":"2015-08-09","text":"Very tight place. Tables are placed too close to each other. For a vegetarian such as myself, I didn't find that much variety in their buffet. There were 3 or 4 veg dishes out of which I only liked 2. Food was tasty though.","useful":2,"funny":0,"cool":0},
{"review_id":"X78pkEdQLciRwROD2RRuIg","user_id":"1w-pL71BflIk0Jo6Tj3cYg","business_id":"dEAk-gE-5Q95a7p91gNn8A","stars":1,"date":"2014-05-27","text":"we use to come here quite often with our friends. but recently their service is getting down pretty bad. there are still some of senior server knows what they are doing. but all the new servers that we don't know( started past few month) they don't even have any knowledge of fish or sushi. they looks pretty and cute. but all the looks doesn't give us any good quality of service. last visit was last thursday... it was just bad experience by their service. we got there around 7pm... it was all servers that we don't know. and  it was pretty poor customer service over all. we did all you can eat.. but rolls got kept missing and we have to constantly remind them get drink refill.....     we love there  foods and few of servers has been workin there since we started going there from las year. it might be owner's styles or favor that has pretty lookin servers. but better training more instead putting extra make up or tiny shorts.. we like to enjoy their food. but long waiting time, wrong order, and bad customer service makes us to think twice before going there now. very sad.","useful":0,"funny":0,"cool":0},
{"review_id":"qzhHwuTtUafyqkPIUvhlHA","user_id":"1w-pL71BflIk0Jo6Tj3cYg","business_id":"6H8xfhoZ2IGa3eNiY5FqLA","stars":2,"date":"2014-10-24","text":"Idk why they get such a high rated for such a dishes. maybe they never had real Japanese Italian. They smells very bad and most of dishes too salty. They might trying to sell drink thats why it was so salty....  some seafood also smelled and they are trying to kill refrigerator smell tp use extra garlic and pepper, but still smelled. \n\nWe had family came from Cali and we checke yelp that they wanted to try such a high rated Italian dishes. But it was just such a disappointment.","useful":0,"funny":1,"cool":0},
{"review_id":"ep656eZ3UEFExXzEmsBsEA","user_id":"HY4YwU0h6zl4dhLE1Uum7g","business_id":"CYmhTXL29bc1UCj4mhx-6w","stars":1,"date":"2014-06-14","text":"Don't get anything fixed here.  I brought my car in and they quoted me $950 to replace the condenser for the A\/C.  I brought it to an independent garage where the bill was 1\/3 of the Midas quote.  These guys are really not competitive for anything other than an oil change.","useful":1,"funny":1,"cool":0},
{"review_id":"GPn0_54u1JYTeuiIkIw-fg","user_id":"Jiv_xyHUrNDxPhY72P9fmg","business_id":"FoJRtc3PDpbKsy_C5fk88Q","stars":5,"date":"2016-01-07","text":"Great breakfast bagel but the service was what made it a 5 star experience! Thanks to Tanarus Henry for being so kind and helpful!","useful":0,"funny":0,"cool":0},
{"review_id":"whby7no7iOgYioxVShMhQQ","user_id":"Jiv_xyHUrNDxPhY72P9fmg","business_id":"DfD-xc8788c081WiFjluTA","stars":5,"date":"2015-10-21","text":"Alexis and Britney have been great. This is my second time here today and both of them are still providing superb service and delicious food!","useful":0,"funny":0,"cool":0},
{"review_id":"uiN8o1osKc3TtIYfWuvsQQ","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"avLkkhIovFxh7axgJrKiJA","stars":5,"date":"2015-06-02","text":"Love California nails! Have been coming here since I was 16 years old and I am now 24, Tina has been doing my nails and she is amazing. Everyone is friendly and they have great prices.","useful":0,"funny":0,"cool":0},
{"review_id":"a5REsnLQacw1SPVcM9CVCg","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"xiSEUnaX77EhNz-l3ag7RA","stars":5,"date":"2016-11-18","text":"Got my nails done here for the first time today. Enjoyed the experience overall. The staff was very friendly and social. They had a ton of options to choose from and didn't rush on the job. I came in specifically off of a yelp review and I am definitely glad. Can't wait to go back for my fill. Loveeeee my nails !","useful":0,"funny":0,"cool":0},
{"review_id":"f0rCuTc4hcUVhAKMO-whtg","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"WmLTIN4qzZ8SjpPxsPH27Q","stars":5,"date":"2015-07-25","text":"Every time I come here it's a good experience! Everything is delicious from the pizza puffs to the gyro and the dogs ! Would definitely recommend coming here if you want some Chicago style food ! \n\nAnd their cheese cake on a stick is amazing","useful":0,"funny":0,"cool":0},
{"review_id":"8li_BYeGstmQOhC8vrgwug","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"Z3e6_PDf3Tn5O_77-nt-0Q","stars":5,"date":"2016-11-16","text":"Recently used this company for this horrible leak I had In my shower and sink. I looked them up on yelp and gave them a call, they answered my call fast and were able to show up in no time to fix it. They did not take long at all, and best part is the leaks are gone ! The name speaks for itself! They will get it done now !!!\nI would definitely recommend them to my friends and family for anything plumbing and heating related :)","useful":2,"funny":0,"cool":0},
{"review_id":"1FvJB8zY1jL1xLizp5g8Ag","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"oH6QAuoTLFaX97oqqpLTMg","stars":5,"date":"2016-05-13","text":"Got the \"wife\" pizza and it is absolutely delicious ! Such a good white pizza. Would definitely recommend it to anyone !","useful":0,"funny":0,"cool":0},
{"review_id":"DJQdQlk6Za4hyBmbIp9zxA","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"Ssa6XY_RdDRRB9wuVIeIWw","stars":5,"date":"2015-11-02","text":"Great service it was my first time here and I got a really delish meal","useful":0,"funny":0,"cool":0},
{"review_id":"WnU_7D9xNHh8E0EYGElA2Q","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"5XqlvHsByE4GFgTZtZDXgQ","stars":5,"date":"2015-07-13","text":"Had the chicken tiki masala & the butter chicken and they were both delicious. Their prices are very reasonable and the food was good. Loved the garlic non as well. Would definitely recommend coming here to eat.","useful":2,"funny":0,"cool":0},
{"review_id":"AT2XS42rA_8WszozqBPzYQ","user_id":"idDkHP1koa0XI74xGYlMTg","business_id":"ozEDKl0tZw5ob1evx41gcQ","stars":5,"date":"2015-06-29","text":"Got the fried chicken and mashed potatoes with broccoli ! It was so delish ! Wasn't cooked to long and had great flavor","useful":1,"funny":0,"cool":0},
{"review_id":"eRnbGND30luoT20MGMrnVg","user_id":"H_MBX2TNSMHeP5KT78DxNw","business_id":"Qp1Udrds4W5Gjm03u74zkA","stars":4,"date":"2013-12-10","text":"First ever trip to a \"lifestyle\" club. My boyfriend and I didn't know exactly what to expect and the green door surprised us. It was very dimly lit and had a certain smell to it. We asked for a tour, the place is huge and you can get lost if you don't know where anything is. The rooms are very nicely themed and have tissues for you to clean up after yourself. The biggest problem I have is that the designated couples only area is not patrolled enough and there were a lot of single guys that had not been invited, inside. There were a few couples getting frisky and two couples that were having a foursome. For a Saturday night it wasn't as busy as I had hoped it would be. I would go back to the green door but I wouldn't get my hopes up, make sure to go at a later time, it doesn't get busy until late. \n\nCall ahead of time and ask for the complimentary pick up from your hotel to the green door it's very nice!","useful":32,"funny":5,"cool":8},
{"review_id":"u4_I0nJxrhfwz-E43nZcxQ","user_id":"56yPekZjLnJxT_cL4UDvtA","business_id":"i631pRlq0u29VvaMshW67A","stars":1,"date":"2016-10-30","text":"Serves here is horrible they took hours to take our order for food. Saw them take everyone else's order we had to stop them so they could take our order. Then they took way too long with our food and drinks. When we tried to play the billiards they sent us from the front desk to the bar and back. Wouldn't let us pay so we could get a table. When we needed refills they still ignored us. Nobody ever helped up. Never coming here again.","useful":2,"funny":0,"cool":0},
{"review_id":"SVdxRqT5yHjMKKwBNY3C8w","user_id":"98TMIen78J0F2iNRjgpp7Q","business_id":"eAc9Vd6loOgRQolMXQt6FA","stars":4,"date":"2016-08-18","text":"I stayed at Mandalay Bay for the first time this past weekend and was a bit skeptical about the hotel since it had so many bad reviews. All the complaints about the wait time to check in, the parking fess, resort fees etc. However, to me, resort and parking fees were not a big deal since most places have such fees. \n\nI requested early check-in which was an additional $35 and I must say so worth it!!! We arrived Saturday morning, check in took less than 5 minutes. No line, no hassle from the receptionist. When we went down to the lobby later on during the day, the line to check in was ridiculous. So I was beyond glad I had requested early check in.  They gave me a beautiful room on the 28th floor. The room was really nice and spacious. The beds were comfy, pillows, beautiful vanity mirrors. Our bags were delivered to our room in a decent amount of time. So far so good!\n\nWe checked out Daylight which was fun!!! The bar was super packed. I must give the bartenders a pat on their backs for taking care of everyone. Both girls that helped us were super chill and nice. I would of died if I worked there. So kudos to them! Not an easy job to do. \n\nThe only thing I must say was a bit absurd was that our last night there we got a noise complaint. Three security guards knocked on the door stating there had been a complaint about us being too loud. Mind you all we were doing that night was watching TV and talking amongst ourselves. We didn't have any music playing. So we asked the guard what do you recommend we do as we are just hanging out. They said \"maybe talk a bit lower.\" LOL Not to mention it was only 930ish at night. It felt as though the people next door were too sensitive. It's Vegas. What do you expect for people to sleep before 10. Hmm. \n\nMoving on to the pools. The wave pool and lazy river= AWESOME. I did get stuck under the waterfall at the lazy river which was pretty hilarious. I couldn't get my tube to move away from the waterfall.  My friends just laughed at me. Kinda bummed we didn't get a chance to check out all the other pools since we did other things. \n\nWe went to Border Grill for dinner. The food is delicious. I had their chicken enchiladas in salsa verde which was so yummy. I am Mexican so my expectations are always high when it comes to Mexican food. I will definitely be eating there next time I am in Vegas. The black cherry mojito so good. The restaurant was simply amazing. And our server was also amazing. I don't remember her name. It was Monday night around 8-9, blonde  pretty girl. \n\nAll in all, I am glad we stayed here. The resort is beautiful, the rooms are spacious, the food and pools are amazing. I will definitely be staying here again. =)","useful":0,"funny":0,"cool":1},
{"review_id":"7YdkYKhTltzfUdXqKBvq5w","user_id":"W2VulqWPRWLmHmdQT6eDyg","business_id":"_ZJl7YVU4tvR98Ozajek-g","stars":5,"date":"2017-05-21","text":"I've been a customer for over 10 years and the customer service they provide is superb. They never leave me hold but in the rare event my agent is unavailable they set a callback time and execute it. Another benefit of being a client of William Kohl's office is; if there's? something new that your family could benefit from they're on it. My agent is Jacqueline Kohl and her wealth of knowledge is stellar. \n\nI would recommend William Kohl - State Farm Insurance agent and I have to all my friends and family.\n\nAmanda F","useful":0,"funny":0,"cool":0},
{"review_id":"zIXQT3hLQ5KyBLUkLtn--A","user_id":"waUrPSBpHvrnrEtSVCEiYQ","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":5,"date":"2015-08-27","text":"Never heard about this \"Secret Pizza\" place but my friends say they are the best and it was on a show. Well let me tell you this, it's the best pizza I've ever had. The white pizza is definitely the one to get. Just writing this review is making me hungry and craving for it even though I just had it like 4 hours ago.","useful":0,"funny":0,"cool":0},
{"review_id":"Y8-rUxp7oxWQzC9SHUZfwg","user_id":"waUrPSBpHvrnrEtSVCEiYQ","business_id":"_j2EtQtgLuXGRBfbM5YwZA","stars":4,"date":"2015-08-27","text":"Every time I'm in Vegas, I will make a trip out here for lunch or dinner. The food is good and the price is reasonable. I love the beef stew and won ton noodle soup. Reminds me how I use to get it at home. Definitely the place to go if your craving authentic Chinese food on the strip.","useful":0,"funny":0,"cool":0},
{"review_id":"qVcgQmqPYbvLcjk8d9tERQ","user_id":"Am_N49BrDnKYSFW8AnIkXQ","business_id":"NL95JTNTh_gebXKSz2ElNg","stars":5,"date":"2014-07-30","text":"Absolutely the best, freshest seafood in the valley! I highly recommend the sablefish, which melts in your mouth. The king salmon is of course unbelievable too! Once you try it you'll be hooked too!","useful":2,"funny":0,"cool":1},
{"review_id":"0NchxIYiWo-mAFuLOm5P1Q","user_id":"uxJ2YMu_fFJUnmUDjGzLvA","business_id":"yNPh5SO-7wr8HPpVCDPbXQ","stars":4,"date":"2016-07-21","text":"Amazing! I had great customer service and the food was soooooo good. I had the Grilled Salmon with Yukon Gold Potato, Roasted Mushrooms, Cipollini, Green Bean, Sherry Mustard Jus. Fresh, cooked to perfection. Loved it! If ever in down town Phoenix definitely make your way here.","useful":0,"funny":0,"cool":0},
{"review_id":"YMXsXzYFyB3xZAWX0mXNWw","user_id":"eJoMY0i5gyOSW2EQ6iDvZw","business_id":"eStn1HCGNcKiLXc0pfvZxg","stars":1,"date":"2010-02-21","text":"Told me to be ready 10 min before pickup and then the shuttle arrived 30 min late.  Wasting 40 minutes waiting for the airport shuttle is not a pleasant way to wrap up a nice vacation.  I won't be using this service again.","useful":2,"funny":0,"cool":0},
{"review_id":"yRUoUtk82eHjxiZ0VXDEmA","user_id":"btVEfy0CpZQ1--LQ-tsctw","business_id":"WjkjrsOzMAQ2wgY9tVyS0Q","stars":5,"date":"2017-04-19","text":"My favorite place for fast Mexican food in Oakland. Love that they are actually open past 10 unlike most places on Forbes. Staff is always friendly and the student discounts also make it great!","useful":0,"funny":0,"cool":0},
{"review_id":"dFwBz7T_KPDvZRJ81lDdOA","user_id":"bqA5wrriq3ELyQgWgMj1UA","business_id":"mOoHbDJF5t20OpD9z4uIcg","stars":5,"date":"2014-11-30","text":"We have to give it 5 stars cuz there isn't 10!! Awesome ambience food and service!!!! Love i, recommend it, we will be back!!","useful":0,"funny":0,"cool":0},
{"review_id":"7j0jv3Jxcr5QZPQq_hT3aQ","user_id":"04xwlutjprotcG7eZiYnog","business_id":"s9CG5XGXJQpP03iYFIHeLA","stars":5,"date":"2013-02-07","text":"I went to this place during happy hour: The interior was beautiful, the deals were amazing ($6 specialty cocktails, $3 well drinks, $2 drafts!)  and the food and drinks were fabulous. It's confusing to me why it was so empty!\n\nI had two of their special cocktails, the lavender gin fizz and the Pure Vida lemonade and they were both fabulous. I would have a hard time picking between them. I tried their chicken wings (can't remember which kind of sauce, but it was bbq something) the lobster toast and a little quarter of a burger and it was all fabulous. \n\nI will definitely be back.","useful":5,"funny":0,"cool":3},
{"review_id":"zDAAyTVJXKMiaLOGusTumg","user_id":"04xwlutjprotcG7eZiYnog","business_id":"fiYqGH-esbPpO-3DnSqVeg","stars":5,"date":"2013-01-06","text":"Simply, the best bagels outside of Brooklyn. I lived in NYC for 6 months and these are making me miss NYC a little less.","useful":1,"funny":0,"cool":0},
{"review_id":"QzS1qgGVdWihdRxlZvej9w","user_id":"04xwlutjprotcG7eZiYnog","business_id":"oxeW1tSB-e_oIzCQZtqyTw","stars":4,"date":"2013-02-06","text":"I work really close to here and love noodles so though the reviews here are super harsh I tried it. To be honest I don't understand most of the reviews. It's a trendy noodle fusion place, don't expect more. \n\nI was seated immediately (adequate seating for a lunch rush) my waiter was super helpful (knew the whole menu and gave appropriate recommendations), my food came out super quick and was hot and delicious. (Bonus, they have wifi and it's not weird to whip out your computer on a lunch for one.)\n\nI got the spicy octopus udon. It was delicious, however, I didn't know before ordering this dish that I don't like octopus (Trying something new!), so I can't really comment on the octopus itself. I ate everything else in my bowl however and it was perfect. \n\nI also got the fried chicken bun. It was okay, but I should have went with the waiters suggestion (pulled pork, or the west side market)\n\nAnyways, try it for yourself. It's worth it.","useful":3,"funny":0,"cool":0},
{"review_id":"sMvhCvQTasqSGP1wuDQ49w","user_id":"P-NpItR6qxizuBoP8FioIQ","business_id":"CB8HrynUWR4Odnj-XTY-Ew","stars":5,"date":"2017-05-10","text":"Amazing food and super friendly service. Will definitely come back again sometime soon.","useful":0,"funny":0,"cool":0},
{"review_id":"cnxMN9ajctZMfGWGRwxE8w","user_id":"P-NpItR6qxizuBoP8FioIQ","business_id":"yYuqSui8N0xesgiviE4evg","stars":5,"date":"2017-10-21","text":"Cakeview Bakery & Cafe is one of the best Hong Kong styled cafe's in Scarborough. They have a wide selection of pastry from durian tarts to macaroons and their mango filled cakes are to die for. You have to try their savoury menu as well because everything is made fresh and the portion size is pretty big. If you're ever in the area and want to have a quick meal for less than $10 heck even less than $5 be sure to check out Cakeview. Also, their Hong Kong milk tea is to die for you have to order it with your meal.","useful":0,"funny":0,"cool":0},
{"review_id":"OHogovlq4vU3aNYmdTIbHg","user_id":"P-NpItR6qxizuBoP8FioIQ","business_id":"WEw08dCcOiwH3Sw1f_8DKQ","stars":2,"date":"2017-03-23","text":"I had high hopes for this restaurant however I was extremely disappointed. The portions were small but the prices were steep. I thought the quality of the lamb was alright (the sesame lamb ribs were decent) but we found a hair in one of the salads... The noodles in the Mongolian Chicken dish were extremely soggy and pretty much turned into a doughy mess in the sauce. Don't think I'll be coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"ltlMcIGcRY30VAHI8NxChw","user_id":"P-NpItR6qxizuBoP8FioIQ","business_id":"X9ftU-exKhTMOjtr3B52rw","stars":5,"date":"2017-03-24","text":"I really love this place because it's so cheap but so good. The shrimp wontons are so big and fresh. One thing I really love about the wontons is that fact that the shrimps they use are very clean and do not have black \"vein\" in them. (I'm usually not a picky eater but I don't trust anyone or any place that leaves it in.) They're also seasoned simply but are very flavourful. I tried both the egg and the rice noodles and they were both great but I prefer the egg noodles because they're more al dente. The broth is light so you can customize it with the chilly oil and vinegar. I really like their chilly oil because they make it themselves and it's fragrant. A little goes a long way. I got take out the last time and it took less than 5 minutes for them to package everything up for you. Very good food and service.","useful":1,"funny":0,"cool":0},
{"review_id":"2iNFC0sZ24Wj7pANh5VQCw","user_id":"P-NpItR6qxizuBoP8FioIQ","business_id":"6ZsiLiSWGK2pgw6t3LfzNQ","stars":3,"date":"2017-03-23","text":"I liked the Oyakodon and the Chicken Curry Katsudon. My friend got the BBQ Chicken Don however the chicken was extremely hard, dry and cold, as if they just heated up some left over chicken but not thoroughly. We told the waitress and she brought it back to the kitchen to get my friend a fresh bowl. The service was good and the food is usually okay too.","useful":0,"funny":0,"cool":0},
{"review_id":"iVV17JQP9GqfXz006Uxeeg","user_id":"x7ZYxYbIycxVe_8FzXYvhA","business_id":"yLtdSJ4BzKFFBc-J9nM7yQ","stars":5,"date":"2016-11-19","text":"It's a hidden gem but once you find it it's worthwhile. The food is amazing. A kind of family owned business Conrad the owner and head chef is amazing at what he does. The food is beyond words but so is the service. Really makes you feel as if you're going to a family members house with the type of hospitality you get. 10\/10 will return again.","useful":0,"funny":0,"cool":1},
{"review_id":"54oJC5skSK9-CVEpisXbHg","user_id":"THFvsb86p8evq6B1QPlIRQ","business_id":"PdDpIGwBZoTYzOVasT-WuA","stars":1,"date":"2014-01-29","text":"It's worst tan before!!! Very bad! All the food don't taste good and not fresh!!! Won't go back anymore for sure!","useful":1,"funny":5,"cool":0},
{"review_id":"kCfYIGzivjjyrxiLTcjdMw","user_id":"THFvsb86p8evq6B1QPlIRQ","business_id":"KF1ngA96RBiRM5h8V7IQ2g","stars":5,"date":"2013-10-17","text":"Good service and good food!!  Must try the salted & pepper chicken and the Hot Pot!!\nFirst time trying the snow ice...only place selling in Pittsburgh, they are great!\nWorth a try! :)","useful":0,"funny":0,"cool":0},
{"review_id":"AA1whhAmf7nSs9iPEegZBw","user_id":"THFvsb86p8evq6B1QPlIRQ","business_id":"9nTF596jDvBBia2EXXiOOg","stars":1,"date":"2013-10-17","text":"The food is only so so...bad service and expansive!! If u are really hungry, u can try something small, but if u are looking for good Taiwanese Food, u should try Cool Ice Taipei or Rose Tea Café in Squirrel Hill. This 2 place have good food like Hot pot, Salted Pepper Chicken, and chunk Chicken, also Bubble Teas.","useful":0,"funny":0,"cool":0},
{"review_id":"F_Sq9upHTLDPP5q9CjqtbQ","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"ud-OcPc0KQP-M1U1EpT1rw","stars":5,"date":"2010-03-17","text":"i have no idea why so many other reviews are knocking this place. i love it here.\n\n- the coffee is delicious: the espresso is thick and strong and syrup-y the way it should be. i even saw someone in front order an \"almond milk latte\" with a swirly design on it - it looked and sounded very good.\n\n-the home-made sweets are to die for: muffins and cookies and scones etc. are also all pretty large in portion (a definite plus compared to some places).\n\n-the location right off of 17th ave is ideal\n\n-there are plenty of windows making it a very well lit and comfortable place on a sunny day\n\n-there are even benches outside (no tables, though).\n\ngranted, the place is usually busy, and there are definitely enough hipsters and alternative folk there. but there are also the neighborhood wack jobs that come sit outside on the benches, keeping you entertained. also, being forced to sometimes rub elbows or share a table with someone is a great way to, well, hit on girls.\n\noverall it's everything i could ask for in a cafe. if they had more room inside, maybe a few couches or armchairs would be nice.\n\ndon't discriminate against this place because hipsters frequent it. there's a reason they come here. it's damn good.","useful":3,"funny":0,"cool":1},
{"review_id":"xSt4DPGmf1TCNxJKH8Ltlw","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"aC0PXKoObd5ax6Hc8afUnQ","stars":4,"date":"2010-02-27","text":"dirty and grungy and small and intimate and everything a dive bar \/ music venue should be like... not to mention pretty well known bands play here... anyone ever heard of hilltop hoods from australia? they've played concerts in front of tens of thousands of people, but even from the back of the place, we could see them in all their white, suburban, hill top hoodiness.","useful":0,"funny":1,"cool":0},
{"review_id":"MlsrfoSVyJtfYWsYMh0hVg","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"b2gSNZj5MFCsfse0cO0CXg","stars":4,"date":"2010-03-05","text":"this is my new go-to lunch place in calgary.\n\n$6.25 lands you a very good sandwich. the options are beef satay, chicken satay, rib satay. the sub is a solid 9-10 inches long (that's about 25cm for you canadians out there)\n\ni agree with some of the other reviews that mentioned how perfectly the sandwich was toasted. it's something you take for granted until it's done incorrectly. these guys had their system down, and it works great.\n\nthey've been in the Let's Go (backpacker oriented) travel guide books off and on for the past 7 years.\n\nthey're definitely a bit hard to spot unless yo know exactly where your looking. check out the photo i added which will give you an idea of the sign to look for. note that they are tucked away in a corner.","useful":2,"funny":1,"cool":0},
{"review_id":"4XUZp_embFsTX72wvPph0w","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"KF3LbyaFIvdf-6UoK4jWWQ","stars":3,"date":"2010-03-19","text":"meh. order the \"medium\" and not the large, as the large is freakin' HUGE.\n\nthis place is pretty good, but i'll admit i have a bit of a soft spot for shwarmas. i'd drive half-way across town to come here, but probably not completely across town. that's how i feel about this place. somewhere in the middle.\n\ncertainly worth trying.","useful":1,"funny":0,"cool":0},
{"review_id":"EmnVwgaP53PJg2O7exGiGg","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"TdCyaV9ae0ykq94eM01ESA","stars":4,"date":"2010-03-04","text":"3.5 stars, but i always round up :)\n\nwe ordered the bite sized samosa appetizer (very good!), a spinach potato dish (forgot the name - sorry i was a little drunk), a diced chicken breast in spicy red sauce dish (forgot the name again - okay so i was pretty drunk), and the lamb curry (this was the best dish we had). obviously we got a few orders of garlic naan bread and some saffron rice. overall i was impressed with the quality of the food for a neighborhood indian food joint. full disclosure, as i'm sure you've already figured out by now, my senses may have been slightly distorted by the amount of alcohol consumed prior and during dinner (the girl in our group ordered an \"indian martini\" to drink - basically a martini with mango juice in it). they offered a couple different kinds of beer and some wine - all in all a sparse booze collection , but it still did the trick quite nicely.\n\nby the time we had finished eating (we had to eat early in order to make our ice skating reservations - no joke, that's what canada's like!) the place has gotten pretty lively and full of customers (some indian) - always a good sign!\n\nthree of us came here and ordered a combined: 3 main dishes, one appetizer, 2 naan, 2 rice, and 3 drinks. we left completely full for $90 (plus tip).\n\ni'm not sure what the indian food is like in the rest of calgary, but by san francisco standards, i wouldn't go out of my way for this place.","useful":8,"funny":0,"cool":4},
{"review_id":"kJJX47p2_lX2-rEmuqwvww","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"o9auqDMXSNvE_jNQby-1Og","stars":4,"date":"2010-03-19","text":"this is the best sushi i've had in calgary so far.\n\ni took a star off not for taste, but rather because it was pretty expensive. a lunch meal for two (including beers) came out to $110 CAN + tip. granted we were 2 big guys who ate way more than necessary, but still, i can't give this place a \"perfect\" rating unless everything is spot on.\n\ndefinitely a good place to go on a date. we showed up at 12.30pm on a weekday, and the place was packed. we had to wait for 15 minutes before we were seated.  that's always a good sign. a few locals just ordered some of the food by phone and got it take - out. they got the delicious and fresh fish without waiting in the line. well played.","useful":2,"funny":2,"cool":1},
{"review_id":"KpXHxLXNwe7xbbDNDajg4g","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"TJt1W9haRm2DKuoZLQ69yA","stars":5,"date":"2009-06-01","text":"excellent offbeat sandwiches and original home made soup.\n\ni never thought cream cheese could be used in so many different ways, with so many different accompanying flavors. i was VERY skeptical when i first saw the menu, but have been more than satisfied with everything i've ever ordered here.\n\nthere is a great backyard patio which is open during the summers. best of all, this place is a stone's through from the mountain, and we all know that nature + tasty sandwich = best thing ever.","useful":0,"funny":0,"cool":0},
{"review_id":"2l83vDfH1Aq4fYZqvBzBwQ","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"R1JkoHumXa95PnU5WChZEA","stars":4,"date":"2010-03-18","text":"these guys seemed solid. i had the club sandwich with spinach salad. my friends ordered the steak sandwich and chicken fingers + fries. everything was decent enough.\n\nthey had a surprisingly large selection of beers on tap. it got pretty crowded from noon to 1pm - if you are going at that point, definitely make reservations.","useful":1,"funny":0,"cool":1},
{"review_id":"eNV4e-NIPL4ol3wTG_Fekw","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"LyMpee3zP1J8A5t0AM-IJQ","stars":4,"date":"2009-06-01","text":"i'm a complete curling novice, but i had a blast when i was here.\n\nyou rent curling lanes by the hour, and equipment as well. you get a broom, and a smooth, custom made piece of plastic that attaches to the bottom of your shoe to slide across the ice. that's all there is to it! get out there and curl! it helps if you have a friend or two that knows what their doing, or at the very least look up the rules before you get there.\n\nthis place is also within walking distance of downtown (just north, over the center street bridge) which makes it logistically practical.\n\ni'll also suggest you get one of the lanes on the sides.... for no reason other than it's easier access to the bar and to your drinks. drinks and glass bottles are for obvious reasons not allowed on the ice, and the side lanes are right next to the doors\/ledges for your drinks.","useful":0,"funny":0,"cool":0},
{"review_id":"V5U5dgp-UF6uz4PM9Ur5iA","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"4RggTW3skfGuUt0MOY_zHw","stars":5,"date":"2010-02-27","text":"good food, cheap lunches! their smoothies are particularly tasty, as well.\n \ni was told the pho was amazing hear, but haven't tried it since i'm more of a bbq-pork-with-spring-roll-over-vermicelli kind of guy.\n\nworth checking out!","useful":2,"funny":0,"cool":0},
{"review_id":"hJdBVQEjT8bJdCV0DykJ9g","user_id":"cx-kUXWTf90AHoPcv25__Q","business_id":"m1tcZ2kveqcWrDAZ4CqpNw","stars":5,"date":"2009-06-01","text":"this place is my favorite summertime drinking destination. they've got something like 20 beers on tap - most of which are imports and delicious microbrews.\n\ninside is a very cozy atmosphere. dark, thick wooden tables,and even a fire place on the ground level.\n\nthe real reason to come here is the outdoor patio. surrounded on 3 sides by 50 meter tall brick buildings covered in ivy, this place is like no other. there are outdoor heating lamps, as well, for those slightly chilly beginning and end of summer days\/nights. a very green terrace, with a private feel to it.","useful":2,"funny":0,"cool":0},
{"review_id":"1IDmxwoJ0TG69fz-zwG3yQ","user_id":"eg3Ym2PcTgw65sz9AthuwQ","business_id":"nnDLapJk1z2NJE0-XzwMlQ","stars":5,"date":"2016-01-07","text":"Excellent food! Was here over Christmas with a friend and we shared some steaks and side dishes. It's an a la carte menu so you can order to share.\n\nThe dry-aged New York strip is the best! We also tried their filet mignon which was very good, nice and buttery; but the dry-aged NY strip blew it out of the water. We also ordered the roasted Brussels sprouts and the Yukon gold potato puree - fabulous...and fabulous!","useful":0,"funny":0,"cool":0},
{"review_id":"PPxYW2OwCH4FGVpMQwU7Fg","user_id":"eg3Ym2PcTgw65sz9AthuwQ","business_id":"R_ZlcX46pPdjhjmfd043LA","stars":5,"date":"2016-01-07","text":"This was such a treat! I was just here for the first time at Christmas time. It's such a spectacular view and the rotating feature gives you a 360 degree view right from your table while you dine. The food was very good. There was not a single thing I had that wasn't good. With the bread, they serve 3 different butters - all wonderful. The lobster bisque was the best I've ever had. If I'm remembering correctly, the friend I went with had been there several times before and had always ordered the duck but it was not on the menu this time. He was really looking forward to having it and was naturally disappointed to find it wasn't on the menu but he did very much enjoy what he ordered instead.\n\nIf you haven't been here before while visiting Vegas, it's worth the experience but know it's going to be an expensive night.","useful":0,"funny":0,"cool":0},
{"review_id":"lNtdF7dy6fx_DTrxkkEXbA","user_id":"Mksw5P27e00UQuNzRdRAyg","business_id":"8NHV3DBvq9Q88ZtzdR6W2w","stars":5,"date":"2015-10-17","text":"Omfg. I stumbled upon this place the other night while on a work trip and came back today because I had time to kill before my flight. I was at the bar less than an hour before realizing that everyone here (including me) is a repeat customer. What a gem! 40+ rotating beers on tap, friendly service, outstanding food (I didn't think anything could beat the pulled pork poutine until I tried the mac&cheese with lardons). My only regret is that I can't fold this place up and take it home. Do NOT miss it.","useful":0,"funny":0,"cool":0},
{"review_id":"kRY7oollnCMfNOGeE9SVhQ","user_id":"qylVS-BEp9NTl8PVmo6QQA","business_id":"9S7RUjzkdpU4MDxUxkvLvg","stars":3,"date":"2011-12-06","text":"Good food. Good service. Loud people. It was Sunday Night football in the bar area. The restaurant was not that busy and our waitress mostly stayed at the table next to us talking with another customer.","useful":0,"funny":0,"cool":0},
{"review_id":"vi9ldWs7HZg523Gher5vDA","user_id":"uVIMXpP3oNtvMw1MqZlkRg","business_id":"eoHdUeQDNgQ6WYEnP2aiRw","stars":4,"date":"2013-09-29","text":"yum... delish. expect a wait cause its crowded but they certainly do make sure their customers are satisfied.","useful":0,"funny":0,"cool":0},
{"review_id":"PolUmNQhtqoRbTzzkdKZuw","user_id":"uVIMXpP3oNtvMw1MqZlkRg","business_id":"RESDUcs7fIiihp38-d6_6g","stars":4,"date":"2014-03-30","text":"4 star for service, 4 star for food, and 4 star for price. \nService : attentive for buffet and very nice. Cleaned out the plates on point.\n\nFood: four stars because the variety is amazing but the SALT level is over board, caution if you are on salt restriction. If they just added less salt and let the natural flavors kick in.\n\nPrice is very fair considering the variety \n\nI think it is most well rounded buffet in Vegas to date.","useful":0,"funny":0,"cool":0},
{"review_id":"7hcdfepwKLvIXWVtHEQKOQ","user_id":"hkNwGGWiRfZiLCnm7lJzUg","business_id":"wTYZfHh1qnA_1GX7LvffVg","stars":5,"date":"2016-07-06","text":"I went into Iconic Tattoo after I saw the work Hollis had done to fix the horrific tattoo a friend had done at another shop. Her ink was gorgeous after he was done with her. I told him I needed 3 sparrows in very specific colors, but didn't have anything else in mind, but the sparrows & colors were very important. He took it from there, and what I ended up with was everything I didn't even know I wanted. Not only is my tattoo perfect, we had a blast while I was there. My tattoo is very visible, covers the side of my right leg, I get compliments from people all the time & they ask where I had it done. I have had a few friends now that have had work done there and every one of them love it.","useful":0,"funny":0,"cool":0},
{"review_id":"2EI6ELeiRQlYb_yfaw3e3Q","user_id":"hkNwGGWiRfZiLCnm7lJzUg","business_id":"pCWg4B0R5gauQR4SJ9VDmw","stars":5,"date":"2016-04-15","text":"We tried Stumpys after a recommendation from a friend when we moved into the neighborhood. Nothing but great things to say. The pizza is bomb, the sandwiches are fantastic, and I think I foodgasmed just a bit over my calzone tonight. It showed up 25 min after ordering, hot, fresh, and delicious. Our new go to pizza place.","useful":0,"funny":0,"cool":0},
{"review_id":"xQrSFV8bf9ubH4fIEI-LDg","user_id":"3qdACpNFQUG4lOWUUc7vXg","business_id":"vsi_PMRgyFy4_vVfQErtCA","stars":1,"date":"2014-12-05","text":"Ordered four things for delivery, only received two and a half. The half is because we ordered Red Thai Curry with Rice. I didnèt get the rice, just a big tub of curry chicken. When we called back they said they would get us the friend rice. When asked about a side of rice, they said it doesn't come with rice. When I initially made my pick, I chose it because it was under the subheading \"Rice\" how are you going to tell me something doesn't come with rice when it was UNDER THAT CATEGORY?!\n\nThey said they would give me a side of rice. However I wanted them to acknowledge that their meal comes with rice, and they weren't just being \"nice\".\n\nAlso forks an spoons + napkins should always be something that's provided... not necessarily asked for.","useful":0,"funny":0,"cool":0},
{"review_id":"TP9txU_K8gVTcNaiMaWGpQ","user_id":"w286bbN-5Yjq7ZGQHCljBw","business_id":"yMeyFt8ktPvzN0qFYLljMw","stars":5,"date":"2014-10-23","text":"Steve and the guys were great! I had two dents in the car that were really bugging me, but not enough to pay body shop prices.  So I gave these guys a shot. Boy am I glad I did. The dents are gone. Service was fast and friendly. I would highly recommend their services.","useful":0,"funny":0,"cool":0},
{"review_id":"e27ns5NUiY9dgg95mJhB1g","user_id":"w286bbN-5Yjq7ZGQHCljBw","business_id":"HeKfDaa_Fa0fn3-xy9tqDw","stars":2,"date":"2016-06-29","text":"I hate to give a negative review without giving a company a chance to make it right. However, it was 109 degrees outside and my AC compressor wasn't working. I found this company was highly recommended, so I tried them first. I had a couple of questions about servicing the unit, left my information with a associate and was told I'd get a call back soon. It never happened. So, I have another company coming out this afternoon instead. Really dissapointing; I know it's a busy time of the year, especially in the southwest, but a call back would have been nice.","useful":0,"funny":0,"cool":0},
{"review_id":"ulmW341ckL3ZtKKM1UyGxg","user_id":"w286bbN-5Yjq7ZGQHCljBw","business_id":"BCAw9a_kyx2RddRH9tMmKQ","stars":4,"date":"2014-10-13","text":"Convenient and quick.  Very attentive staff. Varied menu, including 24\/7 breakfast selections. I appreciate that you can itemize the breakfast options.  I hate having to order \"breakfast for a king,\" when I only want a quick snack. Priced fair.","useful":0,"funny":0,"cool":0},
{"review_id":"PM0oXufXuMSHn_taBfGKmA","user_id":"8AfPw7J4jYvkK9h965q-kw","business_id":"D4xv7_wwYpZEZar4DwwYYQ","stars":4,"date":"2014-06-26","text":"DELICIOUS burgers. You wont regret buying anything from them. Their lemonade is definitely worth trying too","useful":0,"funny":0,"cool":0},
{"review_id":"5MEaIJb3LABuTzoL5olUZQ","user_id":"rsPGLR1F6yY1Jk6jffX3dg","business_id":"6PwKC0dqP9uI85FEP86iPQ","stars":5,"date":"2010-03-18","text":"We love this place. The atmosphere was really nice. The service was excellent. The miso soup and house salad (or side salad) are delicious. Every sushi roll is delicious. Our favorite is Red Koi sushi roll. This place is great! Love it.","useful":2,"funny":0,"cool":0},
{"review_id":"pUQqWgWTa78Plwvd1iVw8g","user_id":"QruO3Xs4D87YASR8VlTP4w","business_id":"sR6Upz5dJ-EtURRSPOl9Xw","stars":5,"date":"2017-01-24","text":"Excellent customer service and they always look to get us the best coverage and price possible.  Anthony, Ivan, and Eric are awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"gGkZw9VYtm3CjDobNuWdWg","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"qjSpyukIL7labiBiPYlWvQ","stars":1,"date":"2015-08-06","text":"By far the worst restaurant experience I've had in my entire life - I urge you not to eat here. My family & I had eaten here at least 5 times before, never with a problem. When we went yesterday, they were understaffed with 2 polite & apologetic employees. We were very understanding & patient as we waited for our food & we had no problems with the 2 employees, who were very pleasant. \nOur food took a little long, but we were fine with that as the staff was apologetic & we sympathized with them. Unfortunately, the Orange Chicken had no chicken inside of it and tasted like a ball of dough...it was disgusting. The Kung Po chicken tasted ok, but it was completly different from when we've ordered it in the past at this restaurant.\nThen Kenny (the owner) came over to our table, asked what the problem was, picked up a half eaten piece of Orange \"Chicken\" from my 10 year old daughter's plate, popped it in his mouth and said, \"This is chicken!\" as food sprayed from his mouth. He did the same with the Kung Po Chicken, argued for a minute, then said, \" you know what, you're right, my new chef sucks & his food tastes like shit!\" \nThe whole thing spiraled out of control...he seemed like he might've been drunk. He started to say he was going to fire his chef, he got louder & louder, & said he was going to do us a favor and not charge us. I explained that we didn't want his food, didn't want to come back, and he wasn't doing us a favor by not charging for food we weren't going to eat. Food that, in his own words, \"tasted like shit.\" I also said he should refund us the $17 we spent on the Groupon for his restaurant. Then he got belligerent...he was swearing (shit this & fuck that) in front of my kids (6, 8, & 10) and other customers could not believe what was going on. My wife helped keep me relatively calm as we escorted our children out while he continued to yell profanities at us & recommended we eat at McDonald's. He also made some comment about coming into his restaurant with a groupon - that we shouldn't expect so much when we're not paying full price. \nI can not believe what an aweful experience this was and, while I feel pity for Kenny & the pathetic life he must be living, I feel more sorry for his friendly employees who deserve to work somewhere better and for my children who were terrified & in tears.","useful":12,"funny":4,"cool":2},
{"review_id":"XSyw-Ey88G8JnEpzNqrecw","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"XNG9v1-DmScfwMShOmErcg","stars":4,"date":"2015-08-21","text":"I went with 7 others tonight for the first time & was impressed. I thought it was great fast food. The BBQ chicken was pretty good, the chicken fingers were surprisingly great & the hush puppies were fantastic. The fries were OK, the cole slaw was good, the sweet potato fries were good. The others I was with enjoyed the ribs & the BBQ (pork). The peach cobbler was pretty good & the peach (sweet) tea was tasty. I'm not saying it's the best BBQ or anything, but for the price & fast food, I think it's well worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"o6f0nPmaakMMpxnKQb3eJw","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"57aBx6Mo_VRk_kMA8J5Efg","stars":5,"date":"2015-08-08","text":"Of the many Mexican restaurants around to choose from, this is definitely the best. I've never had a meal from La Unica that I didn't enjoy. Lately I've been on a taco kick - I love their shredded beef tacos & their carne asada tacos - authentic with cilantro & onion on soft corn tortillas. They also have some of the best horchata.","useful":1,"funny":0,"cool":0},
{"review_id":"n340ocHEGU5w5UfPPwtrDg","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"DrgGy-Kr2I67Lr2qq_ANbA","stars":4,"date":"2015-08-21","text":"Speed review: this is a bar, not a deli. The reuben was delicious & the staff was friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"GcMuFUUN3vhnBOMtgFjwIQ","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"TTFbaLpIwrjFx7YIL2pbJA","stars":5,"date":"2015-08-07","text":"This place is awesome...one of my & my wife's favorites. The staff is super friendly, the owner treats you like you're in his home & is very hospitable, and the food is amazing & at a great price! My favorite is the meat shawarma sandwich and we never go without taking a container of their garlic sauce home with us. If you're close, you've got to give them a try!","useful":1,"funny":0,"cool":0},
{"review_id":"6UsYKXjW3XlaTJRjAtKETw","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"NsrKAwgQkAe-pPJs5Y5fRA","stars":3,"date":"2015-08-07","text":"The chicken salad is tasty, but their bread is \"blah\" and they don't have the ability to toast. In my opinion, if you're a sandwich shop, you ought to be able to toast bread upon request. I have eaten here 4 times. 3 of the 4 I received great customer service. They have a variety of chicken salads to choose from (check out their menu) & I recommend purchasing them as a scoop, as the bread really takes away from the tastiness of their chicken. As a side note, this would be a great place to go for those of you that don't eat gluten IF something came with the scoops other than club crackers.","useful":1,"funny":0,"cool":0},
{"review_id":"sf2etJcJ1KzpSyTWR1zVMA","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"KaO8WM7MIv2c7vaOOXlVJQ","stars":1,"date":"2015-08-21","text":"This place currently has 4.5 stars out of 12 reviews, which can't be right. There is nothing interesting about this restaurant - they only have the basics & they don't do them well. Maybe their breakfast is good, but the 5 of us went for dinner & everything was bland & dried out. I will not be going back.","useful":1,"funny":0,"cool":0},
{"review_id":"f3DE9A9Lv1T4p6M_LhUYLA","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"csp7yhSDFkjdEKKGG7n6NA","stars":4,"date":"2015-08-25","text":"I tried the Northern Eggs Benedict (smoked salmon), which was quite good...I would order it again. Breakfast is served most of the day (NOT between 12 & 2p). The service was quick & fairly friendly. The interior has an old fashioned pub feel. I'll definitely go back for either this dish or to try something new.","useful":0,"funny":0,"cool":0},
{"review_id":"JRFZXYfaE9JU1f9YwBwEbw","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"YWm5z2mu-C-pUuL86fcFxQ","stars":4,"date":"2015-08-29","text":"I recommend for take out. Crab rangoon was excellent, sesame chicken was great, moo shu chicken was tasty, but the pancakes were a bit dry. I wasn't a big fan of the shezuan beef. Dining in is fine, but you order at the counter (no server) & your food comes on a Styrofoam plate. So far, the best Chinese I've had in the area, but I haven't tried many here yet.","useful":1,"funny":0,"cool":0},
{"review_id":"GgnSc2flL42pQs7SnoldIQ","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"SQEA7XcYZ6ygpuSnCSy1IQ","stars":4,"date":"2015-08-21","text":"Yes this is a chain, but I've never had a tastier $10 steak. I love the sweet potato, salad, & veggies (buttery, somewhat crisp, cooked carrots & broccoli)....& who doesn't enjoy their fresh bread?! I've always received friendly service.","useful":0,"funny":0,"cool":0},
{"review_id":"fGNoA4EV-faqU0MC35Z08Q","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"XgRljuEUyaHBKIpIz-PRAA","stars":5,"date":"2015-08-07","text":"Best burgers in Charlotte! The meat & buns are delicious & fresh and they have unique burger options (as well as traditional). I love the TNT burger, but the Hangover & Pimento are great too. They also have fabulous fries, sweet potato fries, and onion rings. I can't think of anywhere that has burgers or fries that are good as Bang Bang.","useful":2,"funny":0,"cool":1},
{"review_id":"5c60jD9SHS7EVscKUOlsNw","user_id":"z_xX4PNF_FCzaCoXFG8pyA","business_id":"Jo6EcTFYMMFbbdmkSPG5ug","stars":3,"date":"2015-08-17","text":"I ordered the teriyaki chicken & steak, which was fairly good for fast food. Nothing too exciting about the food or interior. A little pricy for what you get - $12 for some chicken, steak & rice on a Styrofoam plate. I'll stick with Chipotle or Salsarita's going forward or spend more at a full restaurant if I'm in the mood for Japanese.","useful":0,"funny":0,"cool":0},
{"review_id":"S299Kuq_dg7fkA0NEqcJGg","user_id":"R2OeVo8UIckg452Rtgpl2g","business_id":"TIWuQaqown-dCb9FojdN5g","stars":5,"date":"2017-04-22","text":"Excellent brunch today, felt compelled to write review! 2 people in our party of 4 ordered the eggs benedict, another got the Spanish tortilla, I got the bacon\/egg tacos. We also ordered the Brussels sprouts and side dish of home fries.  All was exceptional and our server was so nice!","useful":0,"funny":0,"cool":0},
{"review_id":"ZSQDBbTdQ7MkZWjzz8m9tA","user_id":"5yoz65RC6mo-SntIj2husg","business_id":"qFqueIKCVF5PlXmjl1YY9Q","stars":5,"date":"2016-02-07","text":"Amazing flavors and the employees are very friendly. They will give you free samples of everything. You have to wait in line for awhile but it's worth it. The salted Carmel is very good. They have chocolate flavors, fruit flavors, smoothies, coffee mixes, and pints of ice cream you can buy.","useful":0,"funny":0,"cool":0},
{"review_id":"IrpWBSGPC6bSIpV4ty7L4w","user_id":"5yoz65RC6mo-SntIj2husg","business_id":"YTmyUCOyNbyDFnNMbYnH_g","stars":5,"date":"2016-05-31","text":"The Chicago style Dog with the Pretzel bun is amazing! Great staff and is a good location! It would be perfect for a work party or birthday party as the have a good truck!","useful":0,"funny":0,"cool":0},
{"review_id":"uSMLgUoRk-IlEJKtfVbUSg","user_id":"Sh4RzpAf50TF669aX30xRA","business_id":"wbRZ9GU_YmrLA_1AwfbQ7w","stars":5,"date":"2016-06-17","text":"Doctor CHRISTAKOS attention to detail far surpasses any dentist I have been to in many years. His expertise and caring manner make him the best. His office is impeccable, his staff is friendly and professional at the same time. Doctor CHRISTAKOS explains all the procedures you may be facing, as well as options.","useful":0,"funny":0,"cool":0},
{"review_id":"BvoguKIePPcPulgFW5haMQ","user_id":"j8gBiMBND0E5yHKH3U1Haw","business_id":"NXTsT01IVpKYPpa_1L-Rlw","stars":1,"date":"2014-01-20","text":"I couldn't believe the amount of sodium and the calories in the oriental chicken rollup I had yesterday!  I went to their corporate site and checked out the nutrition table they have posted (kudos for having it!).  1180 calories for the rollup - that doesn't count the fries, and 3220 mg of sodium - that's more that 50% over the recommended daily intake of 2000mg.  Last time I will ever eat at any Applebees.  They do have a 550 or less calories lunch menue, but not on weekends!!","useful":0,"funny":0,"cool":0},
{"review_id":"YeDx5REOsFhpSuMZEQM06w","user_id":"S-D9iei2Nh9sPK7FR237_g","business_id":"GTVXDAjyXPVfu4FkCZPFXQ","stars":5,"date":"2017-03-03","text":"He is the most reliable gardener I ever worked with. Always on time, doing a great job for a great price. I can highly recommend him.","useful":0,"funny":0,"cool":0},
{"review_id":"Sw09vM2ov4clJm5yTAbswQ","user_id":"S-D9iei2Nh9sPK7FR237_g","business_id":"GG_o4Qt-vYUpnDCGP6Zpeg","stars":5,"date":"2016-09-14","text":"If you want a reliable guy you go with this company. I had experience with scam company www.locksmith247.org (no office, charged me double price, impossible to reach them once they left) \nKobe is very professional. Can't go wrong with him. He's honest,helpful and quoted a very reasonable price.","useful":0,"funny":0,"cool":0},
{"review_id":"a0YfiOQ8wGt2VyXrU9rZlQ","user_id":"S-D9iei2Nh9sPK7FR237_g","business_id":"5mlfC3-q8yVq8qdlUfVHLA","stars":5,"date":"2016-10-11","text":"Z Best Turf did a great job on my backyard. They work with great quality turf. \nRob worked with me and didn't try to push new ideas. He and his team are precise and professionals. 4 companies gave me quotes but they gave me the best price and best quality.\nRob explains the details what you pay for and you only pay once they finished (no deposit).\nBenito, one of the worker was always available and sent me updates when I was not home.\nIf you want quality work you choose them","useful":0,"funny":0,"cool":0},
{"review_id":"w1Upuvfp69aXz7a2I555kw","user_id":"vX4N2DgefAMhUiSl3l7HUw","business_id":"orV9obcclpsYaibFQAulRg","stars":1,"date":"2012-03-01","text":"If there was a way to give negative stars, I would. This place has been a constant disappointment in every way. They keep charging me the fees and the \"manager\" only comes in once a week and doesn't return phone calls. Worst customer service of any local business I have experienced. \nMy saga started over a year ago when I went in for the first massage, it was great. When your feeling relaxed and happy, then they hook you into a year long contract and that's where it gets messy. \nAll of a sudden the therapist you started with no longer works there. Come to find out the amount of turnover here is out of control and you can rarely get the same person twice. They are mostly straight out of massage school and have no experience. The ones that are any good leave for better places like Elements. \nIf you try to cancel, no such luck! Wait it out. I waited, thought I cancelled but apparently it was just a freeze for 6 months. Time goes by and I notice a charge on my card again, yey!  No phone call from them to say hey we are charging again, no email, nothing. Go to find the place, and they moved. Now its officially cancelled, but I have to wait 30 days and another billing cycle to make that happen. So thats one more charge for a membership I have no interest in ever using. \n\nDONT SIGN A CONTACT HERE.","useful":3,"funny":2,"cool":0},
{"review_id":"At8IZ4DporI2YLDHArqxDg","user_id":"vX4N2DgefAMhUiSl3l7HUw","business_id":"0owO8bvP8RgiAgimOLxXhw","stars":5,"date":"2011-11-02","text":"Place is great, the food is excellent and the manager and owner were very nice gents when I spoke with them. I have hosted an event here and they were more than accommodating by offering some free-bee's for my guests. Have been back on a couple other occasions and always a good time.","useful":0,"funny":0,"cool":0},
{"review_id":"wxba7NP9viyyId8_dpNzYA","user_id":"vX4N2DgefAMhUiSl3l7HUw","business_id":"QDVVNvYtd3XHKOdZlewouQ","stars":5,"date":"2010-12-03","text":"Printing Solutions is a fantastic company, just ordered my business cards and they stand out above the rest, high quality and fast turnaround, not to mention a great deal..","useful":0,"funny":0,"cool":0},
{"review_id":"MvvnI7UyhiNPT1RqGJcpYA","user_id":"vX4N2DgefAMhUiSl3l7HUw","business_id":"jRfQX8enRhWHf7V5zP5U8g","stars":5,"date":"2011-11-02","text":"I can't say enough good things about this place. I have all my meetings here, food is excellent, gelato is insanely delicious. Staff and owners are very nice and always attentive. MUST GO THERE!","useful":0,"funny":0,"cool":0},
{"review_id":"h0OcdT-2LcZrt3ORpMyDjA","user_id":"vX4N2DgefAMhUiSl3l7HUw","business_id":"DPZBuTuL7w5MVxsCEyQudQ","stars":1,"date":"2011-11-02","text":"Every time I shop at frys, they are able to disappoint me further. From the bad advice the sales people give, to being the most un-helpful place on earth, I will never walk into a frys again. The last straw, I was given a gift gard that I used once, it had something left on it but I wasn't sure. Went to the store, asked three people how I can check the balance (after having interrupted their conversation on a video game and being eye'd to death) finally someone said to go to the register and I could just walk up and skip the line. It happened to be on the opposite side of the store. Went to the closest register, waited for that person to finish so I could slip in undetected, he took my card, tried to swipe it and it error'd. He walked away and the next people in line came up looking at me like I was an AH for skipping the line. I said sorry I just wanted to check my card balance, they eye'd me without a word went back to waiting for the clerk. Clerk came back, unable to figure it out, handed me my card back and said I would have to wait for someone else to check it. Said no thanks and threw it in the trash. Last straw for this horrible place to shop. Not to mention the isles are always trashed like a hurricane whipped through and they are out of anything I ever need.","useful":2,"funny":1,"cool":1},
{"review_id":"QCB1QQzLI9OU_5aGurniwg","user_id":"TM43Cx2ZOtnI0vuUVdFsdQ","business_id":"4XeNjQdqG8_2lEDS2CNp2A","stars":1,"date":"2015-09-29","text":"My mother came out from Cali to visit and of course she's comes on the weekend of Life is beautiful festival. All the hotels were booked, she was able to book a room at Siena suites, there were dead bugs on the floor and she woke up covered with bites.","useful":1,"funny":0,"cool":0},
{"review_id":"o3hziSbImhPwojtksMg0Lw","user_id":"r0Y2zpyb6X_s_D-V5aoppQ","business_id":"OKA1BeCh1uazI0uNy55x9g","stars":2,"date":"2014-04-03","text":"I was feeling guilty about not tipping the manicurist because I had paid before the session and didn't want to dig in my wallet and mess up my nails afterwards but I am not guilty any more as this was the worst manicure I have ever had.  It's not been a week yet and my polish is peeling and my cuticles look disgusting still.  I will not go back there again!!","useful":0,"funny":0,"cool":0},
{"review_id":"SuyTnpSUXa5_I_w2_04B1w","user_id":"PMmN7iVg5YxHX3KwJjj0xw","business_id":"s9CG5XGXJQpP03iYFIHeLA","stars":5,"date":"2015-02-07","text":"I'm from Cincinnati and a group of us went on a Friday night after looking on Yelp for restaurants nearby our hotel. \nWe were seated right away, and the atmosphere was very warm and inviting. The open kitchen and lighting were classy with a contemporary twist. Our waiters name was Dave. He was attentive, yet not overbearing, very down to earth, and provided great suggestions. Very friendly guy!\n\nWe started with the the Caesar salad and the beet appetizer. Friend said it was the best salad he'd ever had. The beet appetizer was sublime. The beets were simply but flavorfully dressed and paired with goat cheese and duck prosciutto. The combination of flavors was very well balanced and the duck prosciutto had a tasty rub. Having never had duck, I was pleasantly surprised!\n\nI had the grilled chicken with bacon Mac n' cheese and subbed the kale for carrots. The meal arrived and it was a very generous portion. The two chicken breasts and accompanying poblano pepper jam were delicious. The jam was sweet and not at all spicy, and it paired very nicely with the marinated chicken breasts, which were juicy and flavorful. The mac'n cheese was creamy, comforting, and yet completely different from your typical Mac.  Plus, they did not scrimp on the bacon. Against my own better judgement, I finished every bite. The carrots and root vegetable were slightly undercooked, but the flavors were on point, and I actually didn't mind the texture. \n\nOther friends got the scallops, the 16oz  steak, the Philly cheese steak, and the bolognese. Every single one of us cleaned our plates. We all agreed it was one of the best meals we'd had.\n\nGreat service, ambience, and delicious food make for a great combination.","useful":3,"funny":0,"cool":0},
{"review_id":"_ww3Byv-2vXSN9AtrZd_yg","user_id":"AsDODIkwAmt7xVAU6M1mrQ","business_id":"lLZMIv_SovV9W6l5ZFSH_A","stars":5,"date":"2016-12-01","text":"I went in for just a hair wash and blowout. First time there. Courtney did a wonderful job and even fit me in for a haircut. My hair has never felt and looked better. She has a customer for life!!!","useful":0,"funny":0,"cool":0},
{"review_id":"9kmIhbohZm9KoBUrAOye7Q","user_id":"O-VHShfQhiVKYQvXwSGfzg","business_id":"vEoMx8AjjPyLH7giFLpMAw","stars":5,"date":"2010-10-04","text":"Some of the more interesting food that you will get in the falls.  The chefs put a lot of care into their craft and it is evident in the quality of the food that you get.","useful":1,"funny":0,"cool":0},
{"review_id":"V33cVffdxc3z5dlOpkOSfQ","user_id":"O-VHShfQhiVKYQvXwSGfzg","business_id":"2JsLzYF8rUalwpm5LDEcog","stars":1,"date":"2010-09-28","text":"The building and artwork look great(has since it was Jimmys place), but the food doesn't live up to the look and feel of the building at all.\n \nThe pulled pork barbecue tastes similar to what you would expect from McDonalds if they served pulled pork.  The sauce has enough sugar in it to induce a coma and the sandwich has so much sauce in it you can barely taste the pork.  The menu is very minimal to start out with, but when I went there for lunch it seemed like most of the items weren't available.\n\nOverall, it was a really disappointing experience.","useful":2,"funny":1,"cool":0},
{"review_id":"k0hF5qbfa86OvW9MvR-dEQ","user_id":"O-VHShfQhiVKYQvXwSGfzg","business_id":"4S7vWgarCkYjSaN8vrTV9g","stars":5,"date":"2010-10-04","text":"*Fantastic* food.  \nTheir homemade butter and lemon butter sauce are sublime...\nIt is really hard not to like the food from this restaurant.","useful":3,"funny":0,"cool":0},
{"review_id":"57-yTsJ4yjMB1xV-_lg4nw","user_id":"AL8CVsVALcB8Tdujv-XhyA","business_id":"PGLMjjHagSj9VnzXFhYuKA","stars":5,"date":"2013-12-21","text":"Awesome shwarma's. The kids are friendly and this is overall an awesome place. I'm not a big fan of sweets but they gave me one of their almond thingys and damn that was awesome too.","useful":0,"funny":0,"cool":0},
{"review_id":"eIkNB85WrFzVczHQg6bIOQ","user_id":"AL8CVsVALcB8Tdujv-XhyA","business_id":"K9AdKhxhozE5y_Auf7KsBQ","stars":5,"date":"2014-01-20","text":"Excellent overall. Sal is a great guy. Just watch all the addons their finance people will try and sell you.","useful":0,"funny":0,"cool":0},
{"review_id":"wXUDMbm-fYX5GgT6Ria1xw","user_id":"hLQNgKHt_YcV876OP5dHUg","business_id":"f64wkzPLEjXIbTJ9eGS6XA","stars":4,"date":"2013-09-10","text":"Always happy with the service that is offered here, not to mention the food is awesome and the servings are insane! I don't think I've ever left this establishment dissatisfied both in quality of service and the quality of their food!\n\nThank you!!!","useful":0,"funny":0,"cool":0},
{"review_id":"M0LKqLTRDutG69rKZhcmWQ","user_id":"Mo8kBnkV9sPG_s-1fBJL3Q","business_id":"f8OZhlaR8zSLe46sXV9NJg","stars":5,"date":"2010-03-01","text":"Die aktuellen Fischtage im Restaurant habe ich genutzt und es nicht bereut. Die gebackene Forelle aus der Region war bestens zubereitet, der zugehörige Salat und Kartoffelsalat sehr frisch und schmackhaft. An das Osser-Bier kann ich mich auch gewöhnen. Meiner Frau schmeckte das französische Pfeffersteak ebenfalls sehr gut.\nDas Restaurant bekommt von uns eine klare Empfehlung !","useful":0,"funny":0,"cool":0},
{"review_id":"7FL_XKdUksX5xDfJabAWMg","user_id":"08bJ-GODWV__F2qCkms9CQ","business_id":"X8c23dur0ll2D9XTu-I8Qg","stars":1,"date":"2016-06-27","text":"The Worst Nightclub in Las Vegas!\n\nSo, me and my friends got tickets to see Tiesto on Saturday we were so excited. We get inside the club (after waiting 1hr in a long a** line ) and we had to go through several flights of stairs to get to the main dance floor which had very little lighting, It was so dark that I ended tripped over and mind you I was sober, wearing flats. I started thinking about the girls who were wearing heels and were going up and down does stairs. I wonder how many injuries been reported from those stairs.  \n\nAnyways, once we reached the dance floor we headed to the bar, my friend ordered his drink and was charged  $18 per drink and not even tall glass more juice than greygoose !!  ridiculously overpriced. \n\nIn the dance floor we couldnt even dance this place was so over crowded people started pushing, elbowing and some even fighting so many out of control drunks with no security close by. I grew extremly concerned. \n\nAfter an hour in the crowd we couldnt take it anymore and we all decided to leave  find an empty space to just breath fresh air.  We couldnt find any . There were no exits!!! The exits were obstructed by the multitude of people, we couldnt get out of the maze of bodies. I became very anxious, i wanted nothing more than to leave i was so overwhelmed\n\nAs we were trying to make my way out I was harrassed, shoved, and punched, so were my friends.\nOne of my friends was asked if he had any drugs by this ratchet thirsty looking chick, wtf?!? \n\nsecurity sucks i was pushed and yelled at by one of them when i asked him for assistance to get out.  I was so livid. Any remains of fun from earlier that day were stripped down at this place . \n\nNever Again!","useful":3,"funny":0,"cool":0},
{"review_id":"iKTxo8EsDCn1WQAsvKuIoQ","user_id":"yMhZHfU3xg9gXIdJvdRBuA","business_id":"y5ChvqlVkTi9ClY332qsQA","stars":1,"date":"2012-04-25","text":"Ordered a power button over a month ago, never received a shipment notification. When I inquired JJ (the owner I believe) was very rude and claimed the item was shipped although he refused to provide me tracking information. He cancelled my order and said 'good luck finding the part'. I did find another supplier who is cheaper and has free shipping (with tracking). Avoid these guys!","useful":0,"funny":0,"cool":0},
{"review_id":"aAG4iuekbFzvKR_F-f-NeA","user_id":"DpiqFuBv6BpLGvdfS3iI2A","business_id":"t8yDCoIEibvP6QO4ILCAOQ","stars":5,"date":"2014-04-02","text":"I have been going here for 5 years now and the staff is so sweet. There is one girl who is a little rude but Dr hoepner makes up for it. I only go once a year and I have been there when she first got married, then the next year she was pregnant, the next had her baby and so on. Even though we only see each other once a year we catch up like we've been friends for ever. They get you in and out fast. And have a good variety in prices and brands for glasses \/contacts. I'd reccomend going here for sure.","useful":3,"funny":0,"cool":0},
{"review_id":"Aqs6zbBezGaOCr_bz6oGpw","user_id":"DpiqFuBv6BpLGvdfS3iI2A","business_id":"3uBrRcIhbhed1xftLBvabw","stars":1,"date":"2013-10-31","text":"I went to this place with my boyfriend and i didn't see what was so great about the place. Cheap quality furniture, over priced and felt like the sales people were desperate to get a sale. This place is not so great. I will not be back","useful":12,"funny":13,"cool":2},
{"review_id":"RRfXC-nReRUXeQ5UIm95Og","user_id":"spu82NJF1dawEMrFHW7mUg","business_id":"OqBT4e6wJCMhFUc-je_rxg","stars":1,"date":"2014-11-02","text":"I walked in to this place and both of the employees were helping another customer, after a few moments one of them, broke away and greeted me with a very curt \"What do you want?\" After a brief moment I replied \"nothing\", and walked out. Apparently this place is not currently in need of customers. \n\nI would suggest Scottsdale Gun Club, or Guns Etc. if you would like to be treated with dignity when you make your purchase.","useful":4,"funny":4,"cool":2},
{"review_id":"ZTXuYIxgf5RcuYIo7znEVA","user_id":"z3YB5ZzLy72O8LGW2OCLeQ","business_id":"U3ShrvhAFpv5mfT6z07eGw","stars":5,"date":"2010-11-24","text":"Very nice and CLEAN! The food was delicious, real mexican flavors, (most of the Mexican restaurants have a very strong flavor, not pleasant).  The staff was nice and friendly, I agree that they overcharge on some items comparing to other taco shops, but the food is better, the place is clean, and they offer a nice atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"4uMVRa8qJhp7PsQ22gXp4w","user_id":"o5G9Xemexysjzjyj-5n-5A","business_id":"cth3pA7Mj_v2Ka9GeOd0Ng","stars":5,"date":"2015-09-30","text":"I went to Gene Woods Racing Experience while in Vegas to get my racing \"fix\". I had an awesome time. The track was superb, and the people there were even better. \n\nYou have to stop by, just don't get upset when a young kids makes you look like you don't know how to drive by lapping you.","useful":1,"funny":0,"cool":1},
{"review_id":"swtp7B2fnRibh_pv8e0alA","user_id":"fCw5tpxna1Siu7afPoZ9UQ","business_id":"C1uqM8hRdRW0GImkDHNqsg","stars":5,"date":"2016-10-05","text":"I recently had to place an order for some flowers to be sent for a funeral.  I called the store at Village Green and spoke with a girl (I think her name may have been Shannon) about what my options were.  I didn't have a huge budget to work with and I wanted something a little specific for whatever money I could contribute.  She not only helped me come up with a great option for my budget and suggested the best way we could do what I was asking for at the same time.  They were extremely helpful and upon arrival to the visitation, I saw the arrangement they had put together.  It was beautiful and they really succeeded in making what I had asked for happen.  The associate was wonderful and kind to work with and I am really happy with the service I received.  Would definitely go back!","useful":1,"funny":0,"cool":0},
{"review_id":"SanFXuqn69RlA76o60ZMpQ","user_id":"0oM1C16Lye4o3vqn4_cYWA","business_id":"u27Nech3U3ntXwZ6ReJtUw","stars":5,"date":"2010-07-29","text":"Salon Karizma does Shellac Manicures for the best price in the valley.  Kristen Felcoski is an excellent nail technician and does beautiful French Tips completely \"free hand\" - she doesn't need to use a brush with acetone to shape the white part.  She's awesome and is meticulous with her work.  This is a great little salon.  \n\nI absolutely love the Shellac Manicure.  I have natural nails that would tear easily and polish would chip within 2 or 3 days.  I haven't had a single chip with the Shellac manicure - the only reason you have to go back to the salon to re-do it is because your nails will grow out and it will look funny to have so much \"new\" nail showing.  It sounds unbelievable, and too good to be true, but I swear this stuff really works and Kristen will do an excellent job on your nails.","useful":0,"funny":0,"cool":0},
{"review_id":"eazGxMEyH357Uu6g1uDy2g","user_id":"AeebNCHmOQjXYeL3bRJDxw","business_id":"fULc9W1Zm96taeRudD1Fqg","stars":2,"date":"2013-11-24","text":"I really wanted to like this place.  I love a good burger, and with the wide array of options shown on Streat Burger's menu, I was pretty confident that I'd walk out happy.\n\nThis wasn't the case, unfortunately.\n\nI have no complaints about the service. Everyone was very friendly and accommodating, but the food was another story.\n\nI ordered a Brokeback burger with the BBB (that's their burger and bacon blend patty) and my wife had a plainsville turkey burger. We ordered the fried pickle chips and fried cheese curds as an appetizer. \n\nIt took longer than expected for the apps to come out, but the server acknowledged this saying that the pickle chips had to be made twice, and she apologized. It didn't bother me much, as I was happy sipping on a Portside vanilla stout (they have a pretty good beer list).\n\nWhen we did get the appetizers, the first thing I noticed was that the \"cheese curds\" were the size of mozzarella sticks. I can only begin to imagine what an abomination their poutine is if that's what they serve with it. Also, the \"marinara\" sauce that came with the \"cheese curds\" was more of a paste than a sauce. We ended up using the sauce that came with the pickle chips instead, which was significantly better. \n\nThe pickle chips themselves, however, were probably some of the worst I've had. It was mostly dough with very thin pickle chips. I barely got any of the briney, pickley flavor, but I got plenty of greasy doughy flavor.\n\nThe burgers, the reason this place should be known and loved, were probably the most disappointing aspect of the meal. My burger was flavorful enough, but that was mainly because of all the toppings. In fact, that's all I could taste as the BBB was very thin and dry. There was no juiciness, thickness, or beefiness to be found in this anemic patty. What a shame.\n\nI didn't try the turkey burger my wife had, but she said that it was mushy. Our side of fries were nothing to write home about either. The weren't crisp and were slightly under-done.\n\nI really hope this place shapes up, because right now, there are much better options out there in the Cleveland area vying for a burger lover's attention (B-Spot, Flip Side, Dynomite). Streat Burgers should visit these places and take some notes, paying close attention to the burger patty.","useful":4,"funny":1,"cool":0},
{"review_id":"3bU7VRTLLbBr187ak0s8Vw","user_id":"AeebNCHmOQjXYeL3bRJDxw","business_id":"Z3Z8kIqh9SpSyhZtR9coJg","stars":1,"date":"2013-01-19","text":"This review is a little tardy as the only time I've been there was a few weeks after it first opened, but it doesn't make it any less true.\n\nWe went there on a Tuesday night and were greeted by three hostesses. We were sat promptly but that was the last interaction we had with a staff member that night. We waited at least ten minutes for someone to come over and just GREET us. Multiple servers\/hosts walked by our table without even glancing at it. The place was far from busy but we still didn't even get water by the time we decided enough was enough.\n\nWe walked out as the hostesses wished us a pleasant evening, and we haven't been back since.","useful":1,"funny":0,"cool":0},
{"review_id":"RUX1GkezpAx6EX1SR14clQ","user_id":"AeebNCHmOQjXYeL3bRJDxw","business_id":"hlhXDG5GfUUWLduFbbAXzg","stars":1,"date":"2014-02-28","text":"Terrible experience.\n\nWe placed an online order for delivery and the estimated delivery time was 45 minutes. After an hour and twenty minutes I called the store we ordered from to get a status update and they ensured me that the order had left and was on the way.\n\nAfter two hours the pizza still had not arrived. I called them again and the guy I spoke to was nice and apologetic, unfortunately he wasn't the manager as I think things would've been handled properly with him.\n\nThe manager, Robin, told me that they never received the order. I asked her why then, during my first call, did someone tell me the order was on the way. She had no explanation and claimed that I must've called another store - I didn't, I called the same number. It was also her assertion that I probably ordered from a different store, but would do me the favor of checking their computer to verify this. She said she would call me back in 15 minutes.\n\nFifteen minutes later, she called back and confirmed that the order was indeed in their system and I finally received an apology. She reviewed the order I placed, including the tip and total. I asked her if I was getting a refund and she told me that I wouldn't get the pizza if she gave me a refund.\n\nSince I wasn't about to pay full price to get a pizza delivered in three hours, I told her to forget it and take the charge off my card.\n\nLast time we order from there.","useful":1,"funny":0,"cool":0},
{"review_id":"rk7OU6tX60uP4BZMjFWaWQ","user_id":"AeebNCHmOQjXYeL3bRJDxw","business_id":"7tzhoEyaTLxdwkCWMTUbZg","stars":5,"date":"2013-11-27","text":"I feel like I need some Lipitor after my visit to Dynomite Burgers...and that's a good thing!\n\nI went with the Chinato burger and was very happy with my choice. The mortadella was crispy and salty and complimented the rich, juicy, beefy flavor of the burger patty.  The balsamic onions did their job perfectly by providing a nice touch of sweet and sour to prevent the burger from being over-rich. The tomato mayo was delicious too, although a good amount of it escaped onto my hands and the burger wrapper below. I must have went through a trees-worth of napkins. This burger was MESS-Y!\n\nThe side of fries, while certainly not the best fries I've ever had, were crispy and had just the right amount of salt. No complaints there.\n\nIn fact, I have no complaints at all. Although if there HAD to be any gripe it would be that it can be pretty chilly in the winter, standing outside waiting for your burger order to be completed, but that can be avoided by calling ahead. They even have an online ordering system.\n\nOverall, this is easily one of the best places for a burger in Cleveland.","useful":3,"funny":0,"cool":1},
{"review_id":"ntnVzlrfithti0KzZbK5qA","user_id":"3uRqFfYXab-Gan2HwNo4eA","business_id":"_R1jBQQieKpNGMBqmrLRyA","stars":3,"date":"2013-09-19","text":"Seafood jambalaya without rice, presentation was better then the food.a bit pricy for what you get. Still good, but nothing special.fries were excelent. great outdoor seating for people watching and relaxing. Great Nola bear selection!","useful":1,"funny":0,"cool":1},
{"review_id":"5ewcdFBpFWAteFsV3-kBWw","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"qmymSqVwHYRqdwfcBatzpQ","stars":5,"date":"2015-03-21","text":"My wife and I made reservation for our 3 years wedding anniversary and no regrets they sure made my wedding anniversary special. As soon as we sat down, they sent us champagne to congrat us . It made our night together extra special . \nThank you VG for your great food, beautiful restaurant, and amazing staff and managers. \n\nThank you Gabriel and Edgar.","useful":0,"funny":0,"cool":0},
{"review_id":"aBm5JB7LHY3qBLsMRw1Dxw","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"uFvx7_k8XxQjy0nFhu8ENQ","stars":5,"date":"2015-11-23","text":"BEST DEALS IN TOWN ! \n\nthe owners are great . They're super friendly and have great service . \n\nOne of their employee (forgot her name :( ) \nWas helpful and help educate me on a lot of smoke items they have . \n\nI've been going back weekly . Even though I'm now across town . \nYou can't find anywhere else in Vegas that offers as great of a deal here .","useful":2,"funny":0,"cool":1},
{"review_id":"8igM6YgSeT955ItOA5LF_A","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"APTiouqg0vmMznY_UoJ6MA","stars":1,"date":"2015-12-01","text":"Horrible guest service . \n\nWord of advice : Please have them take out your banner & display before taking it home . \n\nThe manager Pong needs to have more passion in his job and title .","useful":2,"funny":1,"cool":1},
{"review_id":"qqaKwZ6MZclov1pQkotMsA","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"OqamB2NfudcBaywvsToT8A","stars":5,"date":"2015-03-25","text":"Wish there was a closer location or at least more then one location . :P \n\nStaff are awesome . \nQuick & friendly .","useful":0,"funny":0,"cool":0},
{"review_id":"VfHslbLPGOShEWC3_ixAQg","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"H_AEozeQfFrn6VJGDJEcKA","stars":5,"date":"2014-10-11","text":"Great staff! Very clean hospital. \nLet's just say, this is the only hospital I can trust in Las Vegas. Never again will I go to sunrise! My stitches were so poorly tied on, my nurse friend can barely cut the knots. \n\n**sacrifice a few more minute of pain and drive across town if u have to. Trust me..the wait is FAST here & the staff are caring and friendly!","useful":0,"funny":0,"cool":0},
{"review_id":"P5OAcdsI4sRURU-PA51dbA","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"N4t78qF2C5jqYBjNr0j3_w","stars":5,"date":"2015-11-23","text":"I just got my food delivered by the company they're working with GrubHub. \nWell.. Technically, GrubHub was supposed to deliver but due to MY mistake I ordered it for Pick-Up. \nPho T ended up delivering to me . I haven't dine in the restaurant yet but this is already a Great Example of Great Guest Service . \n\nI was super surprise when I saw my food . \nI ordered spring rolls and seafood pho . \nBreaded Amt.Crab?! Breaded cod?! Genius ! \nPho T just stepped up the game & challenged the Vietnamese restaurants in Vegas .\nThe broth was so good I didn't have to add a single seasoning\/sauce (beside oil pepper Yum!) \n\nThis is now my new go to place . I am looking forward to dining in soon .","useful":0,"funny":0,"cool":2},
{"review_id":"Kmp26QAdnI4aGzOhN3clCA","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"UYh1N1xQhOh-a7nX92xPzQ","stars":5,"date":"2015-03-25","text":"Hands down! BEST HAPPY HOUR in town!! \n\nWhat a steal! \n\nHave to try the Shrimp Eggplant!","useful":0,"funny":0,"cool":0},
{"review_id":"SsxC7RUh5gBmTxUpyK5G7A","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"H0xkoPI-WwbjY7r-Zt-arw","stars":1,"date":"2014-10-12","text":"Just left Crave right now in huge disappointment. . Chicken was super dry. Wait time was long but of course It is their 2nd day opening totally understanding. . \n\nTo MANAGEMENT: \nPlease teach your staff to be more professional. I was eating at the end of the bar. My wife ordered a roasted chicken and I ordered a sushi boat while I was eating by your well station you have servers and bartenders giving guest checks right next to my plate invading my personal place and i just couldn't enjoy my food. We have your long black hair bartenders giving out free drinks to these two guys. Gosh, mind as well give me some free drinks too while she and her friends talk over my shoulder! \n\nAdvice to everyone: please give this restaurant some time to improve trust me. The food quality and service is not worth the price yet.. But we shall wait n see..","useful":8,"funny":3,"cool":0},
{"review_id":"sn-AdxS51Ita_bhm74ia0Q","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"4g3YEbClAD-6r2ogSctOyg","stars":5,"date":"2015-03-25","text":"Affordable .\nI went in there wanting to test out a one day tan but just to realize for a couple bucks more.. that'll be a membership. No contracts . Which means with 30 day noticed, I may cancel without any fines . \n\nSUNDAYS: Everything half off . \n\nAnd also moisturizer, lotion , etc \n\nSuper clean. \nU get in & out. \n\nRoom 4 bed does need new speaker though lol the stereo is popping :(","useful":0,"funny":0,"cool":0},
{"review_id":"BpAVOolvDpj9tADNdnNM4A","user_id":"KO1RNwtq1LZ_6AzYvjtQmA","business_id":"3_QNAH8yVzY0sBPftWyNhQ","stars":5,"date":"2015-03-25","text":"Great deal ! \n$30 for a full body deep tissue : 1 hour\n\nI always request for Joe since he's strong and is able to remove 100000000 of my knots. \n\nStaff are really friendly & welcoming. \n\nLook out for the younger aggressive Asian lady .. She will demand you to tip her and if it's too low.. she will demand for more.   \n\nAll in all great place to bring guest-visitors here for an affordable deep tissue massage. We do keep our clothing on so I recommend you wear shorts, shirt , & Sandal. \nAnd they are able to keep your group\/couple in the same room. \n\n\nReservation required .","useful":1,"funny":0,"cool":0},
{"review_id":"ed9v2HwH9x8uHIaQVsiI7g","user_id":"AM-YSdXrEvZS7fI6OoSQ3w","business_id":"MtSEQlqTj3Pup-wBY-dKfA","stars":2,"date":"2015-08-28","text":"Just had a burger and Parmesan fries.  How can you mess that up!!!\n\nAsked for the burger medium, it was black as the counter top it was so well done. \n\nThe fries were cold when they arrived. \n\nOn the up side the waitress was very friendly     I guess I should have take the recommendations she gave me.  She's the only reason I gave two stars.","useful":0,"funny":0,"cool":0},
{"review_id":"Ot7ewFqfDBSNqgIZVZUDCw","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"c5x6HWB8MTZvlTgabihaSw","stars":5,"date":"2012-12-06","text":"Absolutely delicious!!  The cesar salad was good & pasta dishes delicious.  The food was hot & the service was great!  Can't wait to go back again.","useful":0,"funny":0,"cool":0},
{"review_id":"Tmn3wdhPYMB-Sl0imxWphw","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"ZHiT9EIlnKMqbpBUmxSh_Q","stars":5,"date":"2017-01-12","text":"Had a groupon for Dysport & got an appointment quickly.  The staff is nice & friendly.  The nurse was nice and didn't pressure me to buy any extra dysport or other products.  I had my treatment about 2 weeks ago and I am pleased with results so far.  I thought it was weird that the receptionist asked if I wanted to leave a tip.  I've been to other places for Dysport\/botox and have never been asked if I wanted to leave a tip.  I do plan to return though.  I don't know how their price range is so I can't comment on that.","useful":0,"funny":0,"cool":0},
{"review_id":"_0duDCXTgqeyDYujDAGD6Q","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"1OxSzNUssdRohY5dC-kWVg","stars":4,"date":"2011-09-18","text":"We moved here from the east coast and weren't sure what to expect from this restaurant.   I must say we were pleasantly surprised.  The food was very good!  This place doesn't look like much from the outside but the inside was decorated very nicely with plently of tables & booths.  We will definitely return.","useful":6,"funny":1,"cool":0},
{"review_id":"ArAu67AIMFNMmhUnFT3JAg","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"3NCnsa2MLUXiJ8YauUMFoA","stars":5,"date":"2012-10-08","text":"I got my first tatto here from the owner himself...he sat down and drew out the tattoo for me when other shop's didnt bother. He was extremly friendly and did an amazing job, i highly suggest anyone who want a relaxed enviroment with great tattoo artisit's to come to this shop.","useful":1,"funny":0,"cool":1},
{"review_id":"Jjj-LVuFgI3C2V3u6L6aLg","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"iho2saPLm61Ccx5xm8Zl1Q","stars":1,"date":"2012-02-15","text":"I used a Deal Chicken coupon for a lemonzest facial, microdermebrasion & hydrating eye package.  This was my first time at Divine & I have never had any type of  microderm service.  Kellie was my therapist (or whatever they're called) and she never explained anything from the second I walked into the room. She never asked if I've ever had a facial before.   Imagine my surprise when I feel this razor type thing going across my face.  She did say if I felt some burning to let her know because that means the mask is to strong for my skin.  I didn't feel a thing, not even a tingle, does that mean she didn't use enough of the mask?  Then she takes the bright light to \"look at my skin\" she said, and tells me I have good texture, that's it, nothing else.  I felt that in the 50 mins I was there she repeated the same process over & over.  My skin felt no different than when I first walked into the room.  I saw they charge $168 for this lemonzest facial etc...never would I pay that for the service I received today.  I have no plans on returning to Divine, even if they cut the price in half.","useful":5,"funny":15,"cool":7},
{"review_id":"aywQ-SRWxyEJwzXEDW9oYQ","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"oE6HazJcDu8ci8K3OeTlIQ","stars":5,"date":"2017-04-16","text":"I have to say everyone I dealt with at Berge VW was wonderful.  Russ, Danny & Robert in sales couldn't have been nicer.   Marc in finance was very pleasant to deal with and funny too.  I would definitely recommend this dealership & plan to go back again whenever I get my next car.","useful":0,"funny":0,"cool":0},
{"review_id":"vavzVB6QYy8WlcrwS17Uhg","user_id":"RowPCV9s-Pxh3qlhtV_Xsw","business_id":"nxCRx5_US4XLxufkF6-Tlw","stars":5,"date":"2017-07-10","text":"I've used Super Shuttle several times.  They are always reliable & on time.","useful":0,"funny":0,"cool":0},
{"review_id":"matYGhQqwCpNjxOyGXkpJg","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"qmymSqVwHYRqdwfcBatzpQ","stars":5,"date":"2016-02-05","text":"I love this restaurant.  Love the atmosphere and the food.  My only complaint is they use bleach to clean, and I can always smell it when I arrive.","useful":1,"funny":1,"cool":0},
{"review_id":"nkbzWeEHX-Ij-HCj5dDTjA","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"zN4f3aLeCuIhCTPRH0di-A","stars":5,"date":"2017-09-17","text":"This is my second time here. The service is terrific. The food is perfectly done. A lot of menu items are not usually available at a typical Mexican restaurant. It's a great find!","useful":0,"funny":0,"cool":0},
{"review_id":"pumVeeycyzrT6hcXHloVRw","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"PJPO9AYkt__t4kSWdSWnfw","stars":4,"date":"2015-01-09","text":"The restaurant is well done & trendy. Great spot. Menu is certainly big enough and should have something for everyone. I've eaten here twice this week. Had the Philly cheesesteak. It was really awesome. Perfectly cooked. Today I had a Ruben sandwich which was also very good. Well trimmed, so not fatty. My only complaint is it seems a bit pricey. $17 for  lunch without a server.  But the food is really good. So...  I guess I'll pay!","useful":1,"funny":0,"cool":0},
{"review_id":"OSk3pBPQ9RYN-BATiy1LlA","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"u8L_pJdgGyNfyoSrYuXcZQ","stars":5,"date":"2016-02-05","text":"They removed all the existing kool decking and the stain on the driveway.  They applied new kool decking and new stain for the driveway and patio.  It went better then expected!  I am very happy with the result and it looks better than I imagined.  They were on time, communicated exactly what was going to take place next, when they were due to arrive next.  It was very well executed.  Everyone involved was professional and very conscientious of my property with their prep work.  My friend and neighbor down the street will also be using them.","useful":1,"funny":0,"cool":0},
{"review_id":"WVRfQDgipmKstvlA6T8xdg","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"dm6sO_Y8JdKTE1ZM955yug","stars":5,"date":"2015-02-05","text":"I love this restaurant!  It might be my new favorite in Vegas. I have brought two of my foodie friends and they both LOVED the food!  The crispy duck panang is just awesome !","useful":0,"funny":0,"cool":0},
{"review_id":"u6ch6jn6-LVjw5rIxAGGww","user_id":"itq2rZhg9VmQCCibeLdGSg","business_id":"LB6ZyCfUzeX9OLdunHhnOQ","stars":2,"date":"2015-04-04","text":"I can always find things that I like here. Today I picked up well over $100 with of merchandise.  There were 40 people in line waiting to pay. I  realize it's the day before Easter and it's busy. But that's not a surprise, Ya NEED more cashiers!  Hello!","useful":1,"funny":0,"cool":0},
{"review_id":"4ziSAAjnAnU1gF9iYy2q-A","user_id":"Z2VsNknMC_0SHqii8kNZ0w","business_id":"0ZLUXUoz3IxQoFCT5k8XUQ","stars":5,"date":"2009-10-04","text":"Yum yum yum!!! I had the spicy tuna salad and was not expecting what I got. It was a wonderful suprise! The spicy dressing was not overpowering and did not take away from my tuna. I will definately eat there again and again! The service was wonderful!","useful":0,"funny":0,"cool":0},
{"review_id":"ub9WVTw_kORmnDOneiajPg","user_id":"Z2VsNknMC_0SHqii8kNZ0w","business_id":"fiG6ltwNYf8k-mGurUybbg","stars":4,"date":"2009-10-04","text":"I am a morning person. I hate going to the gym on Friday mornings. The only good thing that I get out of it is going to DJ's when I am done. It's always clean and even though it's always busy, the line moves really quickly. I actually wish it would move a little slower so I can look at everything they have, but the best so far is a turkey bagle on 7 grain and of course toasted. The girls who work there are all young, but always have quick answers to all of my questions. I love it!!!","useful":1,"funny":0,"cool":0},
{"review_id":"lzKZS2KrDSjR39g7TE-psw","user_id":"Z2VsNknMC_0SHqii8kNZ0w","business_id":"f8BfK4xFQ4ZbibijJt9NBg","stars":4,"date":"2009-10-04","text":"I absoulutely love a good mexican meal, and I loved this place. I had the enchiladas and I was so impressed by the way it was presented to me! I was also VERY happy with the prices, and will definately go there again. The service was ok, but the food did it for me. I think I put on about 5 pounds, but don't even care... I'll go to the gym on friday.lol","useful":0,"funny":0,"cool":0},
{"review_id":"VuV6Kndtv5WfdOt_4v7iiw","user_id":"Z2VsNknMC_0SHqii8kNZ0w","business_id":"PzHbUm6bSG2mYcEnpj5WXA","stars":5,"date":"2009-10-04","text":"OMG!!! I hate greasy wings, but I was craving them. I read the review on yelp( THX!!!) and decided to try it. I was not expecting to be so overwhelmed with such yumminess. I was floored by the abundant amount of meat. I was overjoyed and I know it sounds stooge, but I was really happy, and full. I don't want wings from anywhere else!!!","useful":2,"funny":0,"cool":0},
{"review_id":"IyT0BM-A7Nc57mwbuXK3zA","user_id":"Z2VsNknMC_0SHqii8kNZ0w","business_id":"XrUNYJKy_Ht2qajCaFmwNA","stars":3,"date":"2009-10-04","text":"The bartender is sooo nice to me every time I go in... She charges me for 2 or 3 drinks, even though I have around 7 or 8. Don't worry, I don't drive home. The wings are too greasy for me, but the sandwiches are yummy. I did order the steak that was on special, and it came out wrong. But I do NOT go there for the food. I like the tequila...","useful":0,"funny":0,"cool":0},
{"review_id":"3RXakZKjbKRBWdePoI7B5A","user_id":"o1q2UIh1mCh2btDQ1APovg","business_id":"Zrtozs1rdJREGNxFRTcV3Q","stars":1,"date":"2015-07-24","text":"Most rude and inconsiderate lil twerps I've ever encountered at a food establishment. The boys behind the counter were infuriating, who in there right mind would represent there restaurant like this?! Took 30 minutes to cook our 3 burgers, and as we watched they're every move, there were over 10 health code violations. They used the same gloves to form burger patties, use the register and cash, get ice from the machine in the lobby, and cook our meal. Disgusting!!!!!! We weren't even greeted or looked at upon entering, and I had to ask if we could place an order. As we left they said in the most rude and condescending way \"sorry about the wait, but we hope you loved our clean shop!\" All 3 of our burgers went in the garbage after that comment, and  we will never come close to coming here again. Pathetic and a sorry excuse of a restaurant! If I didn't have to rate this place it would get -5 stars!","useful":13,"funny":7,"cool":5},
{"review_id":"HpVMUI00W7atB7IAX3DlAg","user_id":"o1q2UIh1mCh2btDQ1APovg","business_id":"Ssa6XY_RdDRRB9wuVIeIWw","stars":5,"date":"2016-08-05","text":"Always so so amazing! Cannot get enough of this food and great service!! Try the meat combination and the tabouli..you will not be disappointed!","useful":0,"funny":0,"cool":1},
{"review_id":"CF5oEMDIXE2cqhaqcAZfIg","user_id":"o1q2UIh1mCh2btDQ1APovg","business_id":"eRjcli4nDHRwhByViUz9Ow","stars":1,"date":"2013-10-10","text":"EXTREMELY DISAPPOINTED!!! After being a customer of Rosati's for the past 3 years I've lived in Las Vegas I could not believe the attitude that was received when my roommate and I tried to order delivery this evening (because my roommate is very pregnant she had ordered and gotten delivery to our home last night) upon calling and then getting shot down we tried the other location an we're told that the Cheyenne location would deliver to us. After trying to call again the manager, who seemed to be completely inept, told us that the person who took our order shouldn't have done that.\n\n I do not believe the improper training of employees by management should be taken out on the customer. Coming from a house that is filled with people who work in the food industry, and know what it is the give a little extra for loyal customers, especially when it was your fault..we were pretty upset. \n\nThe order we had was no small one either..they have lost us as customers and we will no longer refer our friends and family to these restaurants!","useful":5,"funny":0,"cool":1},
{"review_id":"c9E2My-J7-zBczYB5r68Ng","user_id":"xdB70T7NHrh0SFsSozvSlg","business_id":"4eqHtgdXEPG6V-Jzy0MhKw","stars":2,"date":"2016-09-30","text":"We went to Miss Thing's for my partner's birthday. Our party had 5 people. First, if you have sensitivities to scents please be aware that the smell of the air freshener is very strong and hits you in the face when you walk in. The service was a bit strange. We had two different servers and they knew very little about the menu. \n\nNow the food...\nOur starters were quite good. We had the Hoki Poke and the Shrimp Po' Bao. \nFor mains we had the fried chicken which was juicy and coated in a nice rice flour but served with very underwhelming cucumbers soaked in some kind of sauce that non of us cared for. We also had the Pineapple Fried Rice and the Poke Bowl which were good. The most disappointing part of the meal was the Grilled Octopus. It was REALLY overdone and very dry. It is served with pineapple salsa which is delicious but I needed more of it to coat the sawdust tasting octopus. The lentils on the dish were bitter and didn't make sense with the rest of the plate. \n\nNot the best birthday dinner for my partner.","useful":0,"funny":0,"cool":0},
{"review_id":"QO0YbSJXByS-_OYk7yi7Cg","user_id":"xdB70T7NHrh0SFsSozvSlg","business_id":"SW0NcZwZsbSpsk0ZPgJKmQ","stars":5,"date":"2016-06-24","text":"Incredible every time! The food speaks for itself and the service is always so welcoming! It's our go-to for Thai in the city!","useful":0,"funny":0,"cool":0},
{"review_id":"WzLjEBXzL-UmV8rzcLZAFg","user_id":"xdB70T7NHrh0SFsSozvSlg","business_id":"B5JCODx4728Ce2Qca1NFHw","stars":4,"date":"2016-06-24","text":"We came for my birthday dinner and were so impressed! The food was incredible and the atmosphere was top notch!","useful":0,"funny":0,"cool":0},
{"review_id":"PI0fp5rTp8IiuABRwIPdIQ","user_id":"xdB70T7NHrh0SFsSozvSlg","business_id":"rIgDuyZVLTyAue8cx1mnoA","stars":1,"date":"2016-06-24","text":"It sounded good when I was quoted 45 dollars but not so great when they charged me 60 after giving my pup the worst groom of his life. The groomer seemed rushed when I dropped him off and that made me quite nervous given that he is epileptic and I showed up 10 minutes early to have this conversation with her. My pup has never had a seizure after a groom but he did this time. It must have been a terrible experience for him! Never again.","useful":0,"funny":0,"cool":0},
{"review_id":"4yXSUoAQvEAeLJKVBtrTGw","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"WVvqV0cmNR3j7ChPoI74hQ","stars":5,"date":"2015-09-05","text":"Stopped in for a real southern soul food dinner.  Was excellent as usual!! Service was great and of course food excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"Uz7V4XiyOcPV7068n8QIgA","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"bNH0khpSY8K-LqviItLclA","stars":5,"date":"2014-10-29","text":"Have used other services and have not been happy so wasn't sure what to expect.  But was very pleasantly surprised.  Robin was efficient as well as very pleasant.  She did a great job.","useful":2,"funny":1,"cool":2},
{"review_id":"JR9wQRU5HHAr78n3_HMFqg","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"R6cjtlmUW_8hV4AlPTp99A","stars":5,"date":"2015-05-22","text":"I had to take our beloved Spice to be euthanized. He had been with our family for 18 years and had become very ill.  I am so impressed with the compassion and empathy everyone showed us as we made this dreadful decision.  Since then, I have taken our other pets for their checkups and am very pleased with the care.","useful":1,"funny":1,"cool":2},
{"review_id":"RWOgi4mfqQywtGR-eHHDJQ","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"63GKC3-BW8JY0YZewDj7XA","stars":5,"date":"2016-04-22","text":"Team was very professional and friendly.  They did a wonderful job with blocking pigeon access to under the solar panels but they even blocked off alcoves that pigeons were also using.  Of course, they also cleaned off all the pigeon poop.  And the price was VERY reasonable.","useful":0,"funny":0,"cool":0},
{"review_id":"QQx_pOkR_B3LyRIMmABkHQ","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"c1siAPW4kxsrURH5SqOe3A","stars":1,"date":"2016-08-12","text":"Coast dental made a bridge and told me insurance would cover it. Insurance did not cover it and it turns out coast did not do a preauthorization for the work.  When I asked why, they informed me they don't have to.  This is referring to the office on west flamingo.  The main issue is wirh the office manager who really has no concept of customer service.  So now I have to pay 1200, which I don't have.   If I had known ins would not cover I would have taken other options.  This was a way for Coast to make extra money and I strongly recommend not going to coast dental.","useful":2,"funny":0,"cool":0},
{"review_id":"VJtT4rGTeKxsozgxgAboDw","user_id":"kkF0FYTxb3QnS-z5o8iIKA","business_id":"oEkOj9NXJFrjFn3NBB_jpA","stars":5,"date":"2016-04-28","text":"This restaurant is a favorite and so I surprised my husband for his birthday.   We were served by Robert, the Assistant General Manager,  and even though service is always good,  tonight was impeccable.  For a birthday surprise,  a bananas foster was prepared tableside by Robert.  Being a local, we will always consider this restaurant as a favorite to go to.","useful":1,"funny":0,"cool":0},
{"review_id":"PhgBckgJLbz-zblSLBoJBg","user_id":"_ya_xNxhNS0Fu4ovLVSgLA","business_id":"TMhD-CnJSuFGvLVuY3boaw","stars":5,"date":"2015-10-27","text":"Great place, owners are awesome.  Very convenient and they have everything you would need for a great workout. 24\/7 access, definitely worth coming by and checking out. You can't beat the price either and there is no contract!!","useful":0,"funny":0,"cool":0},
{"review_id":"hfhFD4R82ptBM9LRFwT8Mw","user_id":"_ya_xNxhNS0Fu4ovLVSgLA","business_id":"4Zo0mPRLQv9xSU6xBVBCjw","stars":5,"date":"2014-10-02","text":"This is a great place to go for a massage. I have been twice now and it was amazing. Went before two endurance events and he helped out so much. I would recommend Wendy to anyone.  Remember to ask for Wendy she is great!  Thanks again!!","useful":0,"funny":0,"cool":0},
{"review_id":"GseJqYWuVKY41UtQoHPvRQ","user_id":"sCvnXCosXn6sY6Hv0WVpzg","business_id":"FpFIAW_IEvASZBbusABbkA","stars":5,"date":"2013-06-29","text":"Went here while on business a month ago. It was great! Not too big like other clubs in Vegas and tons of girls. And they were gorgeous! In fact, I went back the next night. Then flew back there last week and went again. I had much more fun than most of the guys there, here's why:  Hint #1:  Some of the girls are friendlier and more of a tease than others, so don't waste your money on a girl who looks bored or is fake.  Hint #2:  TIP THEM! I saw so many guys not tipping or trying to get out of paying what they owed. If you're going to go then bring enough cash and don't be so cheap.  Hint #3: Don't get super drunk and act stupid. They have to put up with a lot of idiots so be a gentleman.","useful":0,"funny":0,"cool":0},
{"review_id":"-83KJSavgdlCtoj8HtXONw","user_id":"VJ6g2_akNwLvr6M72TTQMQ","business_id":"v_fO8SAvPkF5MNMHahExuA","stars":1,"date":"2016-04-08","text":"My fiancé spent right at $12,000 on a ring at this Jared location. I went in with a concern about one of the diamonds in my ring and spoke with Angela. I have never felt so disrespected in my life. She spoke to me as if I were incompetent. The manager apologized for Angela's actions but I left feeling belittled. This is not the kind of experience\/memory anyone should be left with when making a purchase like this. $12 or $12,000--it doesn't matter. Don't shop here. Shop where your business will be appreciated. From: a very unsatisfied former customer.","useful":0,"funny":0,"cool":0},
{"review_id":"N6Cz029bnpabv3yddNQZwg","user_id":"6sW_A0JeTbOUsRRnR6D9vw","business_id":"zrcs31Gt6HuWX_RCWW-mCQ","stars":1,"date":"2014-05-29","text":"Went into this restaurant at 10:00 pm (closes at 10:30pm) and was told they had no rice!!! Clearly too cheap to make new batch so close to closing. How does a burrito joint run out of rice? I was hungry so I still ordered a burrito and they made no effort to add any extra ingredients AND charged me full price!!! \n\nDo yourself and stay away from this place. Go to a restaurant that respects its customers.","useful":0,"funny":0,"cool":0},
{"review_id":"5-2EyGDZA0y0vv9rb0YeOQ","user_id":"y3AK06X2A1bj2VVtgzCdsg","business_id":"WAy40TR86OYpU5nAcqCtEg","stars":5,"date":"2015-01-16","text":"I booked a microdermabrasion appointment which was done by a girl called Stephanie. I've had micros in the past and have to say that this one was honestly the best I've had. Stephanie, who seems to have been doing these for a while, did an awesome job taking her time by doing a thorough job. She even doubled back with a bonus round to get to my concern areas (which she spent time at the beginning asking me about).\n\nI was thoroughly satisfied with the service. I've had acne scars and sun spots for quite a while now which made my skin look so dull and tired looking. My skin looked noticeably better after the micro. The blemishes look more faded and my skin felt soft. The small black heads I had around my nose were noticeably diminished, and I had an instantly noticeable glow to my face that made my colleagues at work ask of I had done something different :) I had also had the luxurious Hibiscus facial which felt as if it had cleaned out every inch of my pores!\n\nThe store ambience is very chic and sophisticated and the private rooms are very clean and relaxing. The chair beds are comfortable. This place is relatively new and had some amazing promotions going on when I was there. With my micro they also gave me a skin care program to follow. I bought the organic Kabucha cleanser and skin toner and the Daylight Brightening Cream with SPF 50 (incredibly light on your skin). I'm totally loving these products and have seen results after only a few days. Finally I have a beauty regime that works!  \n\nI've already booked my next appointment and I would like to get my makeup done for an upcoming wedding. I also plan on getting the services as gifts for family and friends (especially great teacher gifts!). Sue is a very attentive owner and I will continue to entrust my beauty needs to this wonderful team!","useful":3,"funny":0,"cool":2},
{"review_id":"TYBhM6ABPQsl9t93qW3ZQw","user_id":"bz4zaBCM3t2d3mwHLL-vsw","business_id":"lcsfb0Sz5vzpBVShDsu2gw","stars":1,"date":"2016-03-14","text":"4 fingers ( two of them wouldn't even count as a kids meal nuggets ) for $13.... Sad how a company as BIG as PT's would take advantage with false pretense of a BUCKET of finger ( not say 4 fingers for $13 ) ...... NEVRR AGAIN SHAME ON YOU PT's ... What a ripe off ! ! !","useful":0,"funny":2,"cool":0},
{"review_id":"C2NRu623082XDcEUg5_HqA","user_id":"bz4zaBCM3t2d3mwHLL-vsw","business_id":"9zokrwSsNz0fFOUBRIVyNQ","stars":1,"date":"2016-11-15","text":"To bad you can't rate NO STARS... 45 mins on line and only 3 people ahead of me ! ! Twenty questions from sales associate Chris (I'm sure short for Christina) for each person then try's to push the crap you don't want ! Amazing people who don't want jobs have them and people that do can't find one cause the Chris's of the world are taking them up and making everyone as miserable as they are","useful":0,"funny":0,"cool":0},
{"review_id":"1sSABXCCOxeK5Slog4iU-w","user_id":"AgwvjeJJBGwg9pOybn9agw","business_id":"1QJFpZxLbHbXSKohWp9uIA","stars":5,"date":"2015-04-08","text":"Our all time favorite restaurant in the Mesa area!  We've never had bad service or food we didn't like.  They always have a wonderful choice of daily specials.  There pizza is very good and the breadsticks are over the top delicious!  We especially like the fresh fish options on the daily specials.  The servings are very generous so usually we end up with 2 meals.  Nice added touch is the personal door service.","useful":0,"funny":0,"cool":0},
{"review_id":"hEFZtBxai1lXRw5WjMy0eQ","user_id":"AgwvjeJJBGwg9pOybn9agw","business_id":"eMnCAvoCsZ3L1UuI4A0Vtw","stars":4,"date":"2015-04-08","text":"Always a great place to get filled up.  Food is prepared fresh and you can see them actually cooking and cutting up fruit, and baking.  The management seems to be very visable, which is always a good sign.  Large assortment of food.  The steak is usually very good, and love the flavor of the ham.","useful":0,"funny":0,"cool":0},
{"review_id":"8ToYYGnB196p0ioQ9c9r6w","user_id":"AgwvjeJJBGwg9pOybn9agw","business_id":"fi-cvgNbAWUwyeJwM7fwgA","stars":5,"date":"2015-04-08","text":"Our go to spot for Breakfast!  Love, love, love the raisin toast.  Fast friendly service, great food.  Can get busy on weekends, but they open quite early.  Have had lunch there a few times also, always good.  The prices are very reasonable.  Try a cinnamon roll, you won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"7RuA07wPnM6T79J47yv2lg","user_id":"UYmBh-YVL67Pe---3Ixlxg","business_id":"OFhlZImG34476xPfyCtQCw","stars":5,"date":"2016-07-02","text":"it's the best food in the entire northeast ohio.  the seared tuna and scallops combo is out of this world.","useful":1,"funny":0,"cool":0},
{"review_id":"6teKSoaYmBOcsW1qwRlkPA","user_id":"Ft6xMdGut4XH78chSrOcnQ","business_id":"GdnLAgRXt43eISMtJEOZRg","stars":1,"date":"2013-06-05","text":"Never order from here. It takes more than one hour to deliver, and the food is disappointing.","useful":2,"funny":0,"cool":1},
{"review_id":"hb61xxQqIOGsIkE4vTAdug","user_id":"BV-0cNJG4EK58OC3NUvXDQ","business_id":"VLM7exTU8wRmPVxI4uKi1w","stars":5,"date":"2013-02-27","text":"The burgers are amazing and ridiculously reasonable! The staff is friendly and attentive. The place is super clean! They do everything right at Players! Good drinks, great lunch specials and awesome service!","useful":2,"funny":0,"cool":1},
{"review_id":"In84Xysg3hYePaCyVGHOMA","user_id":"BV-0cNJG4EK58OC3NUvXDQ","business_id":"wQgY7CdljLdCJm6XIk1HuA","stars":5,"date":"2013-02-27","text":"I had to bartend down the street at The Lava Lounge on Friday night for state wrestling and stopped in for a sandwich. The place is bright and very clean. I was greeted immediately and ordered...The sandwich was awesome! The cereal bar snack was delightful! I never write yelp reviews and I felt compelled to because these guys have it figured out!! The staff was super friendly! I will tell everyone I know!! Five Stars!!","useful":4,"funny":0,"cool":1},
{"review_id":"L485oshlwOcPXBo77OrriA","user_id":"S1cvi1nTcJSbIn4Ma5vydw","business_id":"YYzHvjD16a8Vn6AeaWBKJg","stars":5,"date":"2016-10-13","text":"Place has def become 1 of my favorite spots. Everything looks amazing on the menu but can't bring myself to not always get the O.G bowl with added spicy tuna and spicy mayo on top . Portion size is great with just the regular size, I got the large last go round and had to save some for later. Restaurant is always very clean and staff is nice. Mochi pops are great, my girl is a big critic of mochi having lived in Japan for a year and she loved them!! Do your self a favor and stop by you won't be disappointed!!","useful":0,"funny":0,"cool":1},
{"review_id":"7CVThom8ywLhyzm5Vsn-pw","user_id":"S1cvi1nTcJSbIn4Ma5vydw","business_id":"fxY2-nXlAZUrawrSC2FeRQ","stars":5,"date":"2016-10-13","text":"Never been to a Crossfit spot so this was a new experience to me! Didn't jump right into a class, will be getting into one next go round! Staff was super friendly and inviting and def were very knowledgeable. Good thing though this it isn't just a typical crossfit spot, I was able to jump in on equipment they have set up if you opt to want a more traditional workout. Def recommend if you are looking to ease into the crossfit world or if you need a good spot to throw up some traditional weights!!!!","useful":0,"funny":0,"cool":1},
{"review_id":"4oh-uA7UI_UZVibwu86Gvw","user_id":"kbGMK9ej6k7VRY2i6pr_qg","business_id":"pu7maVMRHbIUv2x3B_xMHQ","stars":1,"date":"2016-10-23","text":"Went to Rico's because it was late and we were staying at the resort.  The place was practically empty on a Saturday night. The service was very slow. I ordered a glass of wine which took 10 minutes to arrive. I ordered a Mexican chopped salad and my boyfriend ordered a burger. The salad was a disaster. Limp, stale bagged lettuce, bland chicken and watery dressing with no taste at all. I sent it back after 2 bites. The server was not surprised  at all.  Seems like this may be a frequent occurrence. The burger was better but still not good. Soggy bun, and not quite cooked. To their credit we weren't charged for the salad.  Better to go off site for a good meal if you are staying here.","useful":0,"funny":0,"cool":0},
{"review_id":"Oek1pIwHa1jDyiZQKFCtbQ","user_id":"mG9u7pyy6DksVJ0T10r17g","business_id":"rdXAuI2fKilcf65W-QoASQ","stars":5,"date":"2012-09-26","text":"My girlfriend and I love this place, it's one of our go-to dinner spots!  The peanut sauce is especially good, although I've never ordered anything I haven't liked!  (The shrimp soup is wonderful as well)","useful":0,"funny":0,"cool":0},
{"review_id":"cAYcDzGxmSerD8LrUqHrbg","user_id":"ER7dl7bbWHigdbY-KoQN3A","business_id":"KWxTv7S3cWaMhv3QiW5C2g","stars":1,"date":"2016-08-23","text":"Supervisor was very inconsiderate!!!! Treating his employees like trash and ignoring them anytime they needed help with something or were disturbing what he was doing. One employee was trying to get help voiding an item for a customer and not once did he go help. Employee tried getting his attention multiple times and he just kept ignoring her. Supervisor went to the kitchen and never came back. Would really consider replacing this supervisor with someone more helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"StvRGOUvECgiP3518zXT-Q","user_id":"v_0t85CRlm6J0nwTCEuxbg","business_id":"LYWbyu1EQM2o5hwHG5_Ldg","stars":1,"date":"2011-02-14","text":"Never got to even try the food as service was horrible from the start.  This is the first time I ever walked out of a restaurant, as hostess stand wouldn't seat us despite our reservation and refused to seat us in the many open tables in the lounge.  I hate hate rating a restaurant solely on service but this one is well deserved","useful":5,"funny":0,"cool":2},
{"review_id":"uO4_VbsShOsuhNlTNNL60A","user_id":"v_0t85CRlm6J0nwTCEuxbg","business_id":"xkVMIk_Vqh17f48ZQ_6b0w","stars":4,"date":"2009-03-06","text":"Being a Top Chef fan, had to check out Tom Colicchio's empire of restaurants...unfortunately wichCraft closes at night, so I decided to try the steakhouse.  First, let me say the ribeye steak I had was excellent...simply seasoned, well cooked and flavored, and cooked on the bone.  However, I did have some gripes: (1) the beer selection was terrible...not a huge wine fan, and I like a nice hearty beer, preferably something local or unique, but all they had were the standard Bud, Heiny, and Corona set; and (2) bread service and sides were uninspiring (although interesting in appearance, taste of bread was similar to what you would get in any hospital cafeteria).  Plus for the fresh, briny Kumamoto oysters though...overall, a nice steakhouse, but didnt met my lofty expectations","useful":0,"funny":0,"cool":0},
{"review_id":"J9DJEmLP1bPj5SSkDdL7lw","user_id":"WnQ6n4rJfYkDjR0yWsF-WA","business_id":"nVq71VBsxShp7dHxPIqlOw","stars":4,"date":"2013-05-20","text":"Absolutely eveything you need for kitchen. It usually caters to restaurant owners but also open to public. Pans, pots, mixers, knives, restauran equipment, blenders and list can go on and on and on.. Recently they moved to a much bigger warehouse and i tell you the choices are mind boggling. The prices are excellent as well. I am amazed that nobody has written a review yet. Customer service was erratic but it has improved recntly.  I really like the choice and the prices they offer. A must  see.","useful":5,"funny":0,"cool":1},
{"review_id":"p88WYG4bunclgMyqts4O9A","user_id":"sgfWoGCzZMGuJ_pnn994kQ","business_id":"fYCRrN3sIQnioWMzF8miIA","stars":1,"date":"2013-10-23","text":"Horrible from the very start went in to purchase a new car. I was supposed to meet the internet sales manager but instead im told he no longer works there and have to meet with someone else. We talk and i let the employee know that my trade in is non functional and that if i need to get it towed i can. She tells me no problem there are people she has that can take car of that. Sounds too good to be true. So we go out to look at the type of car i wanted. Test drive one she pulls up and comes back we are discussing terms when i realize this car is no where near the true car value. So i discover a preowned for a reasonable price. I talk to the sales manager and we are making terms i notice a kar alarm is on there so i ask where the alarm is and they day it hasnt been installed yet. WHY WOULD I PAY FOR SOMETHING THAT IS NOT IN THE CAR. Told them to take it off the invoice i dont need it. So be careful they will try and sneak things in on u.  Dont forget to put down any and everything you desire on the due bill and make sure they fufill it. All i wanted was a full tank of gas they gave me a quarter tank smh. Also beware they wont tell you if u been approved or not until they talk to the bank and will have u come back 4-6 times to talk about stuff u already have. They try to stress they dont get paid commission but im sure they do. Beware this is just another shitty ass dealership.","useful":10,"funny":0,"cool":1},
{"review_id":"tIXJBMWvCLSQIIe0SE5NdA","user_id":"9BIJP_jG4SQHjBYVU2FOZw","business_id":"hCSnoByvGjOfcxMeDmxkZw","stars":5,"date":"2015-08-11","text":"The team at Retina Associates save my eyesight by properly diagnosing and treating a torn retina within 24 hours of discovery.  Drs. Miller and Novak were particularly competent and did an outstanding job of diagnosing, performing surgery and following up.  They also kept my regular ophthalmologist informed of my progress and coordinated care to minimize duplication.  The convenience of the Mentor, OH location made my experience all the better.","useful":0,"funny":0,"cool":0},
{"review_id":"-g09xR3qgAZVm5JpoRuM1w","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"VsHhy9ixEze-AxNYt6UxLA","stars":5,"date":"2015-05-07","text":"We recently discovered Crust.  We went for the pizza and have returned for the dining experience.   We dine out several times a week and this restaurant rises above the rest.  The pizza is amazing but we keep returning for the appetizers, pastas, drinks and more.  The desserts are worth saving room for!  This establishment does everything right. The staff are professionals in service they have great intuition about your pace and overall epicurean adventure.","useful":0,"funny":0,"cool":0},
{"review_id":"TnoRdEcZdc5kowuW2PWZKA","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"UCJNYqADdMzn6p164RBr-g","stars":1,"date":"2015-09-18","text":"If I could give less than zero or a negative star rating I would.  I took my car in with coupons for the $19.99 oil change and $89.99 complete brake service.  The attendant explained that the oil change coupon was only good for cars more than five years old since 2011+ model years required synthetic oil.  He informed me that my oil change would be $60.00.  The complete brake service?.......$290.00.  I left my freshly washed and garaged car with them so they could do the work.  They left it out in the rain so by the time the work was complete my car was filthy and covered in muddy residue.  $30.00 car wash completed my expensive experience with Brake Masters.  I am not sure if I am more upset by the false advertising, sticker shock careless custody of my car.   Stay away.","useful":0,"funny":0,"cool":0},
{"review_id":"uKIHb5dK5E-jJGJyYtKIaQ","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"e7bcP2P8WO0NFe1DjjoYQA","stars":5,"date":"2016-06-27","text":"Best fried chicken EVER!  Love the old west ambiance.  The service is very friendly and dinner won't break the bank at this Cave Creek, AZ institution.","useful":0,"funny":0,"cool":0},
{"review_id":"BE8Ijr03EkckH9yl8iFoYw","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"ApHiz1xxENwjkp8MKrE4Dg","stars":5,"date":"2015-05-07","text":"We recently discovered Crust.  We went for the pizza and have returned for the dining experience.   We dine out several times a week and this restaurant rises above the rest.  The pizza is amazing but we keep returning for the appetizers, pastas, drinks and more.  The desserts are worth saving room for!  This establishment does everything right. The staff are professionals in service they have great intuition about your pace and overall epicurean adventure.","useful":0,"funny":0,"cool":0},
{"review_id":"9tstcp3CyQ6KdECeCv36_g","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"IsoLzudHC50oJLiEWpwV-w","stars":2,"date":"2014-12-28","text":"Delicious food but perhaps the most pretentious dining experience ever.   I can't believe we waited for 45 minutes to down a $15.00 cheeseburger.  By the way, the cookie bell at the front door is a \"hot zone\".   Stay away from it.  We witnessed a never ending grab of grubby fingers instead of use of the provided serving utensil.   Nice try Chelsea's but not worth the wait.","useful":1,"funny":1,"cool":0},
{"review_id":"XhhJrXtoldeYUC0AhijPlw","user_id":"ANi9mkuLHi6kMjBdV39GWA","business_id":"OwOMoh48nxjIgPkGU9RxGQ","stars":1,"date":"2013-11-23","text":"Horrifying!  Friday night after a long work week we were looking forward to trying the new restaurant in our neighborhood in north Scottsdale,  We were seated immediately and our waitress introduced herself moments later.  We ordered drinks and an appetizer of guacamole and chips.  The house chardonnay was exceptional but the beer was warm.  The guacamole was so spicy it left blisters in our mouths.  We waited nearly a half an hour for our waitress to return to take our order before we gave up and left.  Our bill for uneaten guacamole, a warm unfinished beer and a most enjoyable glass of wine was more than $20.00.  Lastly, although I don't think that north Scottsdale Los Sombreros will be in business 10 months from now, the staff should be advised that fragrances are a \"no no\".   Chanel's signature fragrance should be saved for \"date night\" since diners would rather smell their food if they could get an order in.  North Scottsdale has many excellent Mexican restaurants.  Los Sombreros is not one of them.  Skip this one.","useful":1,"funny":2,"cool":1},
{"review_id":"29lV-7uHKaIcJF7qi_RWzg","user_id":"9U2UeSeTX2w81yrp2BderQ","business_id":"NblDm3wwmniqsAgedLSTwA","stars":2,"date":"2013-11-03","text":"I really liked the atmosphere but was a little disappointed in our meal. The clam chowder was good as was the spinach salad. The crab cakes were good but the sauce was not. tasted like straight horseradish. My husband had scallops-just ok and I had the coconut shrimp-ok. Our rice was so undercooked that it was crunchy and uneatable. We won't be back.","useful":0,"funny":0,"cool":0}]