[{"review_id":"YE4EQkq0gYBdH3KONuM-YQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"ezrNxiPJUYLJpDtTQyj9eA","stars":3,"date":"2015-08-25","text":"The potato was good size, expected garnishes, but really nothing special in that regard.  But, the sweet potatoe biscuit? was different and good.","useful":0,"funny":0,"cool":0},
{"review_id":"g5kQUkCG2MweEitM-23NiA","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"LelAlfuj5oVRF9CQdWLsNQ","stars":3,"date":"2015-08-13","text":"The wait was twice as long as they said it would be, the ambiance is refined, the drinks were cold and tasty, the appetizers expensive for what they were, the food was good but not great and on the expensive side.  We might try it again just for drinks, but it was not as good as we had expected it to be.","useful":0,"funny":0,"cool":0},
{"review_id":"8mLVJQoTmTNqxVbxWM-oLw","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"CKq7VBd1Z2U8wGIgGKd6Bw","stars":3,"date":"2015-08-13","text":"This place is okay, nothing spectacular.  We were there on a Wednesday, from the sound of reviews that we looked at after we went, should have tried them on a Tuesday.  Food was okay, typical, not too expensive.  Drinks were okay, but I think they were short on staff or something because it took awhile for most every thing,","useful":0,"funny":0,"cool":1},
{"review_id":"Hc8jdEctDwZcso8mAgfU_Q","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"S6TMBqrsi4PLRFoQFPScjQ","stars":4,"date":"2015-07-02","text":"This was a really great place, busy and a bit pricey, but they do deliver on the food.  The drunken mushroom chicken was great.  Not only the taste was better than most \"real\" chicken, but the texture was as good as I have tasted.  Save room for dessert though, as you have got to try their vegan soy ice cream, watch out 31 flavors!","useful":0,"funny":0,"cool":0},
{"review_id":"QZsUSzBqFI0QrcqKBHJP0g","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"cq6SQkWKVT3TH-6YzGFn4g","stars":3,"date":"2015-07-02","text":"Good place for a quick meal, really was empty except for one person when we arrived for lunch.  It was clean, well lit, and had friendly staff.  Portions were large and prices average.  One of our gyros had some relatively dry meat in it.  Fries were good, not as seasoned as I like them, but good.","useful":0,"funny":0,"cool":0},
{"review_id":"9YSUH_ojgr21cdaVY3guIg","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"csy-xJWM68SXabizUIhucA","stars":4,"date":"2015-07-16","text":"Came here for the happy hour, stayed for dinner.  The parmesian brussel sprouts, roasted mushrooms, and quinoa salad were great.  The size of the place (small), and the noise level were not so great.  Will want to come back in the fall and try the patio.","useful":0,"funny":0,"cool":0},
{"review_id":"gFUGQbGnvvDcBn2Qq2AEfw","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"N6TlJ00AYkwb5P4sOiR3Xw","stars":4,"date":"2015-08-25","text":"A lot of fish and chips places either do not seem to use the freshest fish or get the batter wrong, these folks do fish and batter right, nothing frozen fish tasting here and the batter is excellent.  Granted it is not your typically appearing fish and chips, but taste is what matters and taste is great here.","useful":1,"funny":0,"cool":0},
{"review_id":"7n7NXa6aWfnjtzEaVg_pLQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"n8fGqb4CCheGyWtr9KM6qw","stars":4,"date":"2015-03-05","text":"Went here on a fluke, what a gem!  Food was great, wine superb, wait staff excellent.  More expensive than I thought it should be, but it was a good time.","useful":1,"funny":0,"cool":0},
{"review_id":"eAX6uzVfxLgQ04PNL0OqWw","user_id":"Nm8x7X4uhDh8o4xMguol4w","business_id":"wUKzaS1MHg94RGM6z8u9mw","stars":5,"date":"2015-10-24","text":"Looking for some good Italian and this place is a home run!  Loved the sweet potato cannelloni. Kale salad was delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"RUypIFlxNaoKNRZDuDqWkA","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"mIlQi6nZdFbEAjZuQ6pFfQ","stars":3,"date":"2011-09-23","text":"Ive been eating Verrazano pizza for years, 20 to be exact and enjoyed all of their food until today.  This place has really gone down  lately. They changed their sauce about a year ago, Ive been told and that is where the problem lies.  The chicken parm used to be the Bomb, no more. The sauce is now like jarred sauce, bitter and acidy. Today I decided to stay away  from the sauce and ordered the Chicken Philly, it's like they used the leftover gristtle, all hard and dry and full of grease. Went right through me if you know what I mean. Damn, now I'm going to have to find a new place! I think the owner Rick is cutting corners!","useful":0,"funny":0,"cool":0},
{"review_id":"gOWE2-w6vVZ0oph02Z-s8Q","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"3GEEy7RP6e4bT4LAiWFMFQ","stars":1,"date":"2013-10-21","text":"Made a special trip down there Sunday the 20th at noon and they were CLOSED!!!! Website clearly states they open at 11:00am. Very disappointed :(","useful":5,"funny":0,"cool":0},
{"review_id":"VVbUW5X2n0k4kFWfen3ZkA","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"olmCDBoMF-EhN8U2livBSg","stars":2,"date":"2011-08-01","text":"The surprise B-day cake i got for my husband was a surprise indeed, it was awful! I drove 13 mile one way to get this cake because I know Freeds is the best, or was the best. The new location is terribly disappointing, no breads or muffins like before, just pastry and cookies. But the biggest disappointment was the Boston Cream Pie cake, which was dry and the cream is susposed to be like a pudding\/custard, and it was instead cream!  And the frosting was layered on so thick we scraped it off! Save your time and money, because it's not cheap. So sad, another Las Vegas favorite down the drain!","useful":2,"funny":0,"cool":0},
{"review_id":"qToPh_EfzvjdX4t45Md71Q","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"TrGBHqHVzJM5tk2C1D1ctQ","stars":5,"date":"2017-05-29","text":"OMG! Saw a write up  in the paper about this place and went to check it out. Right as you walk in the door you know your in a good place because the smell makes you drool. Smells like a New York deli. I  had the Carter#16 cold, including all the ad on's  as suggested by many and they were right on!  Must try it on the Dutch Crunch roll. I could ony eat half. My husband had the Super NoVa #24 on the Dutch Crunch and said it was equally as good. Even though we do not live on the side of town, WE WILL BE BACK!!!! Super friendly staff as well. Good job guys!","useful":0,"funny":0,"cool":0},
{"review_id":"Y67iTNT-NTidm0dSbxq0qg","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"urALunwW79g5ZzWzHQ250g","stars":1,"date":"2013-01-01","text":"What a waste of time and money! The guys working up there clearly don't like their jobs, no fun what so ever! They made me take my glass's off when I told him3 times that I can't see without them!  Would NOT recommend this to anyone.","useful":0,"funny":1,"cool":0},
{"review_id":"Fco3VO_HRSWJAA-T4uRiDg","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"ZsGnt11KrZdvtuY67sxpQw","stars":1,"date":"2016-03-15","text":"Food is bad bar food. My friends Club Sandwich's toast was burnt. Kitchen staff should know enough to re-toast some more if it gets burnt. I asked for no bacon on my salad, came with bacon.  The worst part was the service. Waited 10 min. just for water, 15 min to place our order, 30 more min. to receive our food! The waitress knew the people at the next table and catered to them even though we came in before them.   Thanks to Anni, we will never be back, I have never been treated so badly. Poor attitude.","useful":2,"funny":0,"cool":0},
{"review_id":"IqAflPVbbocQ4Yyi0uFXzA","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"5cL4skmU3Y6g1_tWiaoPDw","stars":5,"date":"2015-08-25","text":"I could not be any happier with the service I received at Gentle Dental. Everyone from the front desk girl greeting me by name to the dentist, Dr Cressman showing  interest in my care made me feel special. I know that no one like going to the dentist, but I actually look forward to my visits now thanks to john the hygienist who does the ultra sonic scaling on my teeth and gets me out of there lickety split! Love this place!! :)","useful":0,"funny":0,"cool":0},
{"review_id":"Q6_oPDIl7Yx4pXB4sMhm0Q","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"wqEsh0Dzam7HPvtl0TiGQA","stars":5,"date":"2017-10-17","text":"I found Connie as a walk in  over 2 yrs ago and I won't be going anywhere else! She is a great stylist and down to earth girl. My hair is baby fine and she always steers me in the right direction about my style, color and cut. I trust her completely. Plus, she NEVER overbooks her clients. She gives me her full undivied  attention,  which I truly appreciate. A true professional!","useful":0,"funny":0,"cool":0},
{"review_id":"GBQWeXweLpzai5a9CyDNtw","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"UOtSC6RjXYdL6U8sJbEekA","stars":5,"date":"2015-03-02","text":"We bought our Lazy Boys recliners here in June 2014, the were ALL very helpful and friendly, we choose a custom fabric that had to be ordered. We were told 6 -8 weeks for custom orders and much to my surprise  they were done in 4 weeks! My husband and I also  enjoy the clearance room from which we bought a throw rug, the manager carried it out to the car for me! Love this place, I drop in often to see what's new.","useful":0,"funny":0,"cool":0},
{"review_id":"DMaYGP-xGCV5FSPG4ah89A","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"rltH_DYPlQ40OE1aScOE0A","stars":5,"date":"2016-07-04","text":"I have been going to Tip Top for over 10 years and love them all! Everyone is really friendly and do a great job. There is always a lot of activity going on, there is never a dull moment! There is a reason they are always busy, it's called great service! Keep it up ladies!! :)","useful":0,"funny":0,"cool":0},
{"review_id":"gsXY84PHyj9gOwkWR9vQ7g","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"5vTdyRqZ-wnOZ4ZANrzFOQ","stars":1,"date":"2015-01-24","text":"I was dying to try this place being of German\/Polish decent, boy was I disappointed! Hubby had the German Bockwurst & fries, it was like a giant boiled hot dog, fries OK. I had the Schnitzel Vienna Style, the pork was very dried out, no taste. Now I have eaten quite a few potato pancakes in my day, my mom used to grate them by hand, and fry them in a pan. These were like the took leftover mashed potato formed them into a patty and deep fried them! MUSHY!  Needless to say my long awaited adventure clear across town was a bust, save your money!","useful":1,"funny":1,"cool":0},
{"review_id":"2VbEqRAwJuKIKAa7R03EmQ","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"klddGAcNIpE_aB5sd1hNXw","stars":2,"date":"2011-01-13","text":"Very Disappointed!!\nI dinined here for lunch with a friend on Monday and won't go back! First, we walked up to the hostess station and the hostess's continued their conversation instead of greeting us, we felt totally ignored. Then we had to wait to be seated and there were about 50 empty tables???? \nWe ordered the veggie flat bread pizza(very good), the meatball appie(sent it back) and salad with steak(tough as leather), and mile high chocolate cake (only ate about 2 bites). Our waiter never came back to check on us for at least 20 minutes after our lunch was served. I'd rather spend my money somewhere else!","useful":0,"funny":0,"cool":0},
{"review_id":"8XpXSH-EgbSJdinsG4anUw","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"nzUvzv8fOuEioaOlL1G2uw","stars":1,"date":"2015-08-01","text":"Just received delivery  and and it was horrible! Eggs rolls and tempura were burnt, salmon was dried out and no flavor.  Crunchy roll avocado was brown and everything was cold. For $43.00 I was very displeased! Don't waste your time or money!!!","useful":0,"funny":0,"cool":0},
{"review_id":"C-S15Q1NHF188AkYiYHX5Q","user_id":"KMbPhOkpK5xJjOtnxQBEdA","business_id":"Tf13Wexrt6WmNw-CDW5Gyg","stars":2,"date":"2013-03-26","text":"First time there they had only been open for about a week, the service was bad and the meatballs were just OK, my where burnt. Decided to give it another chance and it got worse. Got seated, but did not get service until we went to the hostess and asked for a server. The meatballs are pretty tastless and the thin silver of bread they give you could break a tooth. We ordered a full salad, 1\/2 salad came out.    Our server, when we finally got one, was nice and friendly, probably the best thing about this place. Sorry, two strikes and we are  out of there!","useful":1,"funny":0,"cool":0},
{"review_id":"nowVphiN_7UvbJXvKSeVRw","user_id":"QQG9UaToKQveUWFJyProxw","business_id":"AiQTF_hKZiPqdO7ljNxqfA","stars":5,"date":"2017-02-25","text":"We purchased an entire business office full of furniture from Arhaus Biltmore and it is the highest quality and great service from the Biltmore store.   If you are looking for furniture, go to Arhaus at the Biltmore. Lots of quality furniture on floor sample sales. Huge savings. Ask for Terrie Overstreet or call her at 602 840 3198 Tell her I sent you. She is very nice to work with and is also a professional interior designer.  I know there are lots of low stars but no matter what has happened in the past, the new manager Julie is doing an amazing job and you can't find a better person to help with your decorating needs than Terrie.  Making another furniture purchase tomorrow.","useful":0,"funny":0,"cool":0},
{"review_id":"zn_8skg3FWemhDMLQA0GgA","user_id":"pZ5N-iMkBPWmfXKya5QQTQ","business_id":"PM5vkmr8FqOIWE0pe3C2Fw","stars":5,"date":"2017-01-18","text":"Great Chinese traditional food and excellent service!Whenever and whatever you need they will come to you ASAP.Definitely recommend the staff Shade and Yan,they are super nice and very helpful.Will be back for sure!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"bvze1AYD_H9BL_oEWocrFQ","user_id":"FXi0jQt_fqrCqjXlLXjl2g","business_id":"MQiNywdecInMlkW06WYaCg","stars":1,"date":"2014-11-17","text":"There wasn't anything special about the food. We went to have all you can eat sushi and didn't feel like we got what we paid for. The service was average. The food literally took 50 mins to come out. Come on the place has a 1 hour time limit and took that long to serve. Basically we only got to order 1 round and that's it. The fish also wasn't really fresh and was obvious.  I felt the place was a rip off. Not everything was horrible, the restaurant has a nice interior design and atmosphere. But other than that theres way more better sushi restaurant better than this in las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"Bqihgoc1i74sz-h3fiKEFg","user_id":"XBudrkh_eRO1EeiiFudMcA","business_id":"j3IEZP4nQAt7fkxmerLMbA","stars":5,"date":"2011-04-04","text":"My husband and I are from DC and came to Pittsburgh to visit family. We stopped by Wingharts for lunch and I could not have been more impressed. The staff is extremely friendly and you can tell they LOVE what they are doing. My husband and I both ordered the 'Shipwreck Burger' and fries. The fries are delicious! The burger was huge and the best I've had!! There were lots of burgers to choose from- it was hard to pick just one. Needless to say we are excited to vist Pgh again so we can stop by Winghart's for another burger!","useful":0,"funny":0,"cool":0},
{"review_id":"u1ph49WrLIrTvoed1LfSUg","user_id":"18CG7vYfmAzP8ALgrFl5gw","business_id":"p1IliTmKor7ol01AyE6ZRQ","stars":5,"date":"2011-10-29","text":"Es una pasada, se esta de lujo es romantico y discreto,tiene unos detalles fantasticos y el jacuzzi funciona de maravilla y las luces son alucinantes.","useful":0,"funny":0,"cool":0},
{"review_id":"Rq3Z17jSqRCPLyOYyM0UYA","user_id":"VM1IXPaTQnyudpOuJp6PZQ","business_id":"9kef9J6Vo70RUXCnWUQVNQ","stars":1,"date":"2015-09-27","text":"I was waiting for a haircut while I saw one of the workers vacuuming but when she was done she just looked at me and said nothing. I saw her go on her phone while walking to the back of the room. Unprofessional.","useful":0,"funny":0,"cool":0},
{"review_id":"M0XY3aX5P8Y5EV-AeSBk_Q","user_id":"VM1IXPaTQnyudpOuJp6PZQ","business_id":"BncM7h87xJr7_-6CCfh3Xg","stars":5,"date":"2015-05-31","text":"Definitely recommend this place. Quick industrial bar piercing and super friendly staff. Kelly was my piercer, nice and professional.","useful":0,"funny":0,"cool":0},
{"review_id":"AsdW-v_gq6Zj-d5C1HxDKQ","user_id":"ulTFttandV6O3jZVkWLJvQ","business_id":"giCq1MmW-_S2tvNOAHvJcQ","stars":1,"date":"2015-10-11","text":"What a bizarre evening at this establishment, the kale salad was delish but it went down hill after that, wrong taco served then taken away, new right taco served, it was shrimp and 1 of 3 shrimp still had its tail hmmm tasted crunchy. Then the waiter says we would like to give you desserts and one slice of pie is brought to a table of 8 and I was charged for the shrimp tail taco, shame on you Tarbell's, the pie was ok.","useful":1,"funny":0,"cool":0},
{"review_id":"VmLrvZylYB85wZBDVyh3yQ","user_id":"RbxkR24Ygt675h0RagHW2w","business_id":"u0YqV9eoMDVdYxMegrSxqw","stars":5,"date":"2017-05-01","text":"We found this place on Yelp, because we were heading to the neighborhood to get baklava at Crown Pastries. This is the first time we had Tanzanian food, and it was awesome!!! It is mostly a takeout place, but there were two tables where you could sit down. The owner was super friendly and really nice to talk to and made great suggestions as we had no idea what each were. We got the grilled platter for three people with enough for a leftover meal for one. Really awesome place, I highly recommend making the trip!!","useful":0,"funny":0,"cool":0},
{"review_id":"YhL40kqDH5C2LI14DK6rdA","user_id":"sEQ7pw0GApVrV8rb4wSoBQ","business_id":"ZIUs7gncPOX0OXr1ZYviAQ","stars":1,"date":"2015-08-09","text":"Great sashimi.  Thought I'd test the so called \"world class\" tuna melt, like there really is such a thing, but if one wants to use great tuna then possibly,  but otherwise not world class by any  means except the tuna, which great, but then really just a great piece of tuna between 2 sliced of bread.... Hard to beat a \"real\" tuna melt folks!  Especially for the price!","useful":0,"funny":1,"cool":0},
{"review_id":"ikwq8m1DUx6885B5P3pPiw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"nxbVyDfknWtycymHluAzSA","stars":1,"date":"2016-03-10","text":"my butter chicken flatbread tasted like tiny chunks of cold chicken in ketchup on toast. my \"large green salad\" was about the size of a tennis ball. seriously I got a LARGE SIDE SALAD and they served it to me on a massive plate when the salad only took up about 1\/20th of the space. hopefully nobody drags me to this poorly named restaurant ever again.","useful":2,"funny":3,"cool":1},
{"review_id":"l63NsgMrYp1Q6n3CawIvng","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"tZt9k3BZ0AaXT4XCOEeRwQ","stars":2,"date":"2016-03-10","text":"the patio is really great in the summer. I don't have a reason for going here in winter though. I ordered some jerk chicken thing, and pieces of rubber were in it. the server apologized and took it off the menu. other than the pieces of nasty plastic, the chicken was meh.  then I saw a drunk man stumble out of the restaurant and get in his car and whip down queen street.  what a delightful meal.","useful":1,"funny":0,"cool":0},
{"review_id":"jZA000RGzVtqWH9Y2CHTbw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"Iojwvqi475VZ7n27LGfnBw","stars":2,"date":"2016-03-13","text":"okay, so I had this \"savory oats in a hot skillet\" thing for brunch and I still gag when I think about it. also, who runs out of coffee? this place is a no no #no #no","useful":7,"funny":2,"cool":1},
{"review_id":"NI_V_oLlPk2EUeAbbgZOoQ","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"eHHqjRVQXQhlNf_ZNIgwiA","stars":3,"date":"2016-03-10","text":"I've found some pretty good things in this store, and the service was also pretty good. however, I think a kid took a huge crap in the isle because it smelled like SATAN'S BREATH","useful":1,"funny":6,"cool":0},
{"review_id":"KAk9aurH7_AV8NkFBz1MIw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"fWeCh-xYQxo8VSemQrqYDQ","stars":2,"date":"2016-07-01","text":"the managers scream at employees in front of customers. also, how do you eff up spaghetti and meatballs? yuck","useful":0,"funny":0,"cool":0},
{"review_id":"e0xbc8Fpcj0xRWTf0DE0Iw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"l8NsRjvc9rsxzqmWA4BLeg","stars":4,"date":"2016-03-10","text":"say what you will about starbuck's coffee and food, but this location is really great. the staff are friendly as heck! one time, I even saw two diva moms get in a screaming fight in line. 10\/10, can't beat it.","useful":0,"funny":0,"cool":0},
{"review_id":"jccybgkTZrBPk4PRQH1cnw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"2Xh-ZYlvm1SxcKdEaD51DA","stars":5,"date":"2016-03-19","text":"amazing!!! I am so happy I found a Hungarian place that serves AMAZING food. the owner is so so nice, and the food was fantastic. these people deserve your money!","useful":2,"funny":0,"cool":1},
{"review_id":"aGgHhf1TOTnKFamaAhJ95A","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"mU4mvQSf81nLuxW1IC_mAA","stars":5,"date":"2016-03-10","text":"THIS PLACE IS THE BEST. great service, amazing food, and a relaxed atmosphere. I still dream about their butter chicken. amazing!","useful":0,"funny":0,"cool":0},
{"review_id":"9q8Qt5GpVuAQfHf_b3a6Bw","user_id":"bF0I-o4PgitU0cuoI6VgSA","business_id":"0MQpSRqp6tegDHFJthKF5Q","stars":5,"date":"2016-03-18","text":"this place is great! has great food and coffee, super nice staff, and is cozy. this place makes Kingston road a little less lame! and definitely deserves a higher yelp rating!!","useful":0,"funny":0,"cool":0},
{"review_id":"KukqtYV-EX3ykgC2fFTEpw","user_id":"QWadkF8j5E57OaBgU1lyWg","business_id":"QBeQhcGrnDrc435u2F4CXw","stars":5,"date":"2014-06-22","text":"Just got a stone pedi here. It was amazing! They really take their time and massage you thoroughly and they pay attention to detail when painting your nails. Prices are very reasonable. Definitely going back!","useful":1,"funny":0,"cool":1},
{"review_id":"eNorxu1aVbP6zxqS4VPaKQ","user_id":"QWadkF8j5E57OaBgU1lyWg","business_id":"kULyjAdIe8n-WhPoHw893w","stars":5,"date":"2014-09-28","text":"Got my eyelashes done here and they look amazing! I don't even feel like I have anything on my lashes they are so light weight. I got a groupon for $79 and then I upgraded to silkys for $30 more.","useful":1,"funny":1,"cool":0},
{"review_id":"6M4nw786I4A7hqBr5co2yA","user_id":"-N1hZ886u6T0KbtniwD5Ag","business_id":"le3JWiS5uZTkofP90Rm0pA","stars":5,"date":"2017-03-09","text":"local wonderful place. very delicious garlic sauce. special Colombian taste.","useful":1,"funny":0,"cool":0},
{"review_id":"tgnlYkOjwaYt9izNnrb1Sg","user_id":"-N1hZ886u6T0KbtniwD5Ag","business_id":"Xny0n0s98TpP82sQxfgIMQ","stars":4,"date":"2017-03-09","text":"very interesting place, special polish dishes, great experence","useful":1,"funny":1,"cool":1},
{"review_id":"n-_fRFHRsSRxfnvO-JQbtw","user_id":"-N1hZ886u6T0KbtniwD5Ag","business_id":"qGJZ1C3rUjqZ6LAtNMjQtw","stars":4,"date":"2017-03-09","text":"Unfortunately, the dove is not working. we want to try curry pizza. however, the pita is also very good","useful":1,"funny":0,"cool":0},
{"review_id":"pk7jMFOVNnBUvh_f52yMog","user_id":"-N1hZ886u6T0KbtniwD5Ag","business_id":"uN07PMXEg1RY5IoP90Eghw","stars":4,"date":"2017-03-09","text":"The ultimate dish is good. good place for people like spicy seefood","useful":1,"funny":1,"cool":1},
{"review_id":"EQ3SrnWag-tNuPNdQixlXQ","user_id":"KpvLD2cwB6XCGqpy7YdLZA","business_id":"jW_hNGlYJw2Q2ssYDHihfg","stars":5,"date":"2017-03-02","text":"Ambiance agréable, un peu bruyant pour une bonne conversation, mais un endroit intéressant particulièrement pour déguster votre Gin préféré ou faire des découvertes.","useful":0,"funny":0,"cool":0},
{"review_id":"wNWVSWszsifouytZxuVovg","user_id":"OyDTDmQpFbXP0wVxjeVZMQ","business_id":"DXraw_cmJEmukKj8AqFOMQ","stars":1,"date":"2015-09-18","text":"ZERO STARS IF POSSIBLE, NEGATIVE STARS AT THAT! They have the worst customer service imaginable. the girls lack common sense, empathy, the basic ability to assist their customers. these cast members are a JOKE!","useful":3,"funny":1,"cool":0},
{"review_id":"ElE2V5FMAqqIhil6l2ylKA","user_id":"OyDTDmQpFbXP0wVxjeVZMQ","business_id":"7m1Oa1VYV98UUuo_6i0EZg","stars":5,"date":"2015-02-22","text":"our first time here with a couple of friends, we all loved every bite! delicious & creative menu, definitely something different and a new favorite!","useful":1,"funny":1,"cool":1},
{"review_id":"sBrcXCJwHnH1yGWFJf64Tw","user_id":"OyDTDmQpFbXP0wVxjeVZMQ","business_id":"ev579etLIePHQxuHx9XN-A","stars":5,"date":"2016-02-01","text":"huge store, nicely organized, well stocked, amazing prices, & great customer service!","useful":0,"funny":0,"cool":0},
{"review_id":"GPVKOtgWHQXb_KmESYVq9A","user_id":"NkazTvmy9C_inITSo9SukQ","business_id":"WshwlvpuxGRjivC-J7RLcA","stars":2,"date":"2015-03-03","text":"Place was empty for a Friday night around 8, but we were starving and wanted to try something new.  I am not going to complain a whole lot about the food quality.  I ordered the Lasagna and it was quite good with a great bolognese sauce and garlic toast.  My wife had a burger that she devoured with good fries as well.  Serving size was average but adequate.  I would give food quality 3.5 stars.\n\nHowever . . . sticker shock was an understatement.  Read the menu for yourself and make your decision, but this food was worth at most 60% of what they charge.  (It's Vegas . . . probably 40% in any given home town place.)\n\nThe service was spotty . . . the people there acted a little like they didn't know why they were there.  And the most memorable thing?  I think the sound system is being driven by an old CD player - as about every 90 seconds the cookie-cutter pop music would skip for 2-3 seconds like you used to experience when carrying your Sony Disc-man around.  At first I thought it was just a song or two, but it happened in every damn song they played.\n\nUnless the prices come down - we will trudge our way to the Food Court for a quick bite, so I expect a new venue to fill this void sooner rather than later.","useful":0,"funny":0,"cool":0},
{"review_id":"pF0rV2gIn99ZfmWhj0riGw","user_id":"NkazTvmy9C_inITSo9SukQ","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":5,"date":"2015-08-04","text":"For the first time ever we decided to try Hash House for a meal other than breakfast - and we were so glad we did.  I ordered the Meatball Pasta - which was actually reasonably sized (if you've been here you know what I mean) compared to other entrees.  Five rather nice sized and delicious meatballs were underneath a bed of perfectly cooked thick spaghetti and a great marinara with chunks of sweet tomatoes.  I ate the whole damn thing.  Outstanding.  My wife went with the Baby sized burger, which is still bigger than 3\/4 of the burgers out there and it was also outstanding.  The highlight was the Cheddar Cheese Bacon potatoes on the side.  If you like that tasty cheese that slightly burns on the edge of a grilled cheese, you'll get a small plateful of it on top of delicious potatoes.  Drinks were also good, and all of this for an extremely reasonable price with OUTSTANDING service.  We will be back here again!!","useful":0,"funny":0,"cool":0},
{"review_id":"T9OyNyL9teuwpFphl4PD5A","user_id":"NkazTvmy9C_inITSo9SukQ","business_id":"63Qj5E-GzHJ6vhjhGR4XDw","stars":2,"date":"2015-08-04","text":"Will have to echo other recent sentiments . . . the service here is absolutely horrible and SLLLLLOOOOOWWWW.  I ordered the Garlic Knot Meatball sliders, and the cheese added to the luke-warm meatball slices was almost frozen it was so cold, making for a very unappetizing meal - which is too bad because they had such great potential.  My wife had wings that were actually quite tasty and very, very meaty.  The tiny cocktails for $12 were fine, except they took about 10 minutes to arrive each time.  Food took almost 20 minutes, and the atmosphere was a little uncomfortable because they don't seem to have a staff to bus tables.  A corner booth was left covered in food and garbage for over 30 minutes before presumably a manager came over and took care of it himself.  Was looking forward to a neat place for a quick bit, but this will not get a second visit from us.","useful":0,"funny":1,"cool":0},
{"review_id":"ZaynQBwjmneP3HW1x9BNbg","user_id":"4j018YAs2LZEvUkn_z9eUw","business_id":"RleTq9ZOSE2ymZwxtRkEtg","stars":1,"date":"2015-11-17","text":"No story is needed here.\nService is bad.\nThe chicken is dry out.\nNo lunch sets \n\nOrder 2 meals and 1 didn't come after at least 30mins.\nAnd waitress didn't follow up even we ask her to check.\nAnd we ask for bill and they didn't cancel the one which never arrived until we said how can u charge us....","useful":0,"funny":0,"cool":0},
{"review_id":"zJCFxwel4psZeHSrH21qxw","user_id":"4j018YAs2LZEvUkn_z9eUw","business_id":"bNqBMZ00lnhhfxzV8OhLfQ","stars":4,"date":"2015-10-22","text":"With ribs, wings, coleslaw, beans, bread, onion ring it is such a good deal for under $30 in a friendly environment restaurant!!!  Ribs are excellent tasting, we love it!!!  Definitely, we go back and try their sandwiches!\nRestaurant are very clean and tidy even washroom!!!","useful":0,"funny":0,"cool":0},
{"review_id":"93SHZ_yjNAvBr6_memSNdg","user_id":"4j018YAs2LZEvUkn_z9eUw","business_id":"0PM5oFKO29sZmL5efmHxug","stars":4,"date":"2015-10-20","text":"Price, Food Size, tasting all great in here.\nThis restaurant is my top favourite list for the past 5 years!!!","useful":0,"funny":0,"cool":0},
{"review_id":"J2PxBXkfpPByzgrg1qMQhg","user_id":"4j018YAs2LZEvUkn_z9eUw","business_id":"YNpwfdqBeP6j8aFrJp2sQw","stars":4,"date":"2015-10-20","text":"Good experience with the hot plate and great services!!!  Reasonable prices and earl grey ice cream is gooooood!!!","useful":0,"funny":0,"cool":1},
{"review_id":"n9et90F_RsyXsEYtTLGhPQ","user_id":"4j018YAs2LZEvUkn_z9eUw","business_id":"nrOxXGd3Vx6iz5xuIJT8cw","stars":1,"date":"2016-01-03","text":"Any all you can eat Japanese restaurant are better than them.  Rolls are horrible, they r wet and rice falling apart, tempura mix they only give u 6 slices of pumpkin and 3 small shrimps at least they r fresh, seafood udon they only give u tiny tiny squids.\n\nNo more chance to go back again","useful":3,"funny":0,"cool":0},
{"review_id":"-LACW9Ke_nfn3KSgLdIsCg","user_id":"SPE1_6jIZf7DW1OEni7Xzg","business_id":"9fH0ow907crGLmPnHFeI0A","stars":1,"date":"2015-08-13","text":"I work closeby and was looking for something new to try for lunch. My coworker and I each ordered a salad and I ordered a side of pasta. I picked it up 10 minutes later. It was ready and hot. The service was great. The salads that were each around $8 were unimpressive at best. The portions were that of a side dinner salad. The chicken Ceasar had bland strips of boiled chicken and no cheese. The tuna salad looked like they opened a can and dumped it on top. The hard boiled eggs were just over halfway cooked and the outside of the yolks were a darker green. The pasta had Alfredo sauce and it was so oily and chunky. It was hot and tasted OK, but not great. I would have gotten more for my money and had a heartier salad from a fast food drive thru. Very disappointed. Will not be back.","useful":0,"funny":1,"cool":0},
{"review_id":"ff74f-vXCESjyIA_Pnbiew","user_id":"orfLgQGcjkehWGKytgiyjQ","business_id":"q5bUGou5kwByRrKkYWzA0w","stars":1,"date":"2017-01-29","text":"I purchased prevagen for my husband a month ago. After leaving the store, I read more on the side effects and decided to return the product (within one hour of my purchase). I later realized on my credit card bill that I was only refunded 40% of what I had paid for the product. I went to the store, and rather than apologizing, the clerk and management brought up a million excuses rather than correcting the refund. I have a receipt that clearly shows the purchase and return were within an hour of one another. Terrible customer service. I will never shop here again. Beware when you make a return!","useful":0,"funny":0,"cool":0},
{"review_id":"YplzEUbcZxqzJvn1pdiiXQ","user_id":"2IspOdciilwCDe7smBqFng","business_id":"M5JBwESu_5kJr1PUhOl5sA","stars":1,"date":"2017-10-28","text":"If I could give this place less than a 1 star I would. DO NOT CONSIDER THIS APARTMENT COMPLEX AS YOUR NEXT HOME. The whole complex is just very very sketchy, neighbors are very inconsiderate and when you try to file a complaint through the office and they tell you they are going to send security, DO NOT BELIEVE THEM they will never show up. I can't believe with all the dangerous activities that happen in THIS complex, there are no security to be found.","useful":0,"funny":0,"cool":0},
{"review_id":"2tqHHD1kmoGyRn71f7bX-Q","user_id":"2IspOdciilwCDe7smBqFng","business_id":"rqWIntPaV8TpJvgT6H9UNw","stars":5,"date":"2016-10-01","text":"Best kft location in Las Vegas! The staff are very friendly and the energy in their store every time I walk in is always positive! I also love that if you're not satisfied with your drink they willingly remake it for you without a problem!","useful":0,"funny":0,"cool":0},
{"review_id":"RIyyfxXlb2B3N3Bu93VVZQ","user_id":"2IspOdciilwCDe7smBqFng","business_id":"sH9WsMj8sNTTSAUWv4UEEg","stars":5,"date":"2016-10-01","text":"Love this location! The store manager Rafael and his team are amazing, they were very nice and very helpful! Long story short, I left their store completely satisfied and happy.","useful":0,"funny":0,"cool":0},
{"review_id":"iW54wc6AEpyvfeH__RMMMQ","user_id":"XwP3bIA-uLdGM1E-eHiRCQ","business_id":"U_ZddYFt19qaVj4eW8lgAA","stars":5,"date":"2015-04-09","text":"I have nothing but positive things to say. John showed up on time, totally prepared, very cordial., he fixed the problem I was having with the way my pump had been installed by another company, he also informed me of several things about my homes telectric system (some good, some not so good). my home is about 60 years old and electrical codes were very different.\nI would definitely recommend them highly. if you have any problem with you electrical system be sure to ask for John, he did a great job.          \nThanks John, \nMark  (aka Howard)","useful":1,"funny":0,"cool":0},
{"review_id":"37ptzaN-NW06iEx7Vz297Q","user_id":"i6DCqwxgxevPd4MFYhd9vA","business_id":"M95OX2nED7rjPxOURJtOCg","stars":5,"date":"2013-08-22","text":"Found a good deal on Yelp that led me to a great lunch spot!! Large sandwiches that come with chips! We also got potato salad, which is yummy..would come back! Good service & friendly staff","useful":0,"funny":0,"cool":0},
{"review_id":"ssseK0wwhqruxud8-XJ9_A","user_id":"ZTntQd4KI_kO3YDD4n_Ogg","business_id":"yNBVOKSZN_AIjSJdhF_rqA","stars":4,"date":"2015-03-30","text":"The service was excellent and the food was yummy. I'm excited to come back and try more things.","useful":0,"funny":0,"cool":0},
{"review_id":"iKoaQcMO0PeJNhf51_Y6eg","user_id":"uO0M_cZRg8iviuhf-szyJQ","business_id":"MRdFBVRSY9K0JiEHnV3iGg","stars":5,"date":"2017-10-02","text":"Two very friendly and fast men came on time and ready to work.\nTook them about 2 minutes to diagnose and about 3 minutes to fix the ice maker.\nAnd now I can have my scotch on ice YEAH!!!!!\nI will use these guys again...and they are now my goto guys.\nBob","useful":0,"funny":0,"cool":0},
{"review_id":"AG0acrw7uZtG_G9e3mje7A","user_id":"uO0M_cZRg8iviuhf-szyJQ","business_id":"j2bx_ctb_ED3zbfSaqhQmQ","stars":1,"date":"2015-06-11","text":"Noisy beyond belief.\nA huge party at a long table screaming at top of their lungs. Ruining the whole room . The staff , specifically the female mgr refused to suggest to them to be more quiet. \nBeen going there for 15 years. \nNever again\nToo many better options","useful":1,"funny":0,"cool":1},
{"review_id":"PoT-TvflLt8KIs5GFR1Feg","user_id":"uO0M_cZRg8iviuhf-szyJQ","business_id":"AwPCJ1DjQ2vw0EMq3zUnAw","stars":5,"date":"2017-11-08","text":"I have had my first pair for two years now and they are now a part of me...\nKathy has been wonderful...\nInitially I thought the price was high... I considered doing Costco.. or a private wholesaler.. to save about 30%...but my decision to stick with Audiology and Kathy has turned out great.\nI go back to get things fixed.. the tiny amplifiers speakers...the tiny ear guides that break... the small ear cushions ... and batteries... and to check for updates... all free...all easy... all painless...all included in the original price..cool.\nThey are 5 star plus.","useful":1,"funny":0,"cool":1},
{"review_id":"H-4suPR91aBTVTwVaSVX_g","user_id":"uO0M_cZRg8iviuhf-szyJQ","business_id":"nYkbkUkhJA3oa71HkrjObg","stars":4,"date":"2014-04-02","text":"Dinner last night...was exceptional for Scottsdale...small,busy,friendly...good service...open to changes in a dish...split in the kitchen..a lot home made...owner on premises..wine by glass superb..Antinori...well worth the 10$...all hot tasty fresh...good mouth feel to sauces...even though half full..not noisy....decoration better than location ...a bit out there in the boonies but worth the drive...will go back....bar crowded...all good.","useful":0,"funny":1,"cool":0},
{"review_id":"en8aG4biu2RMf9mLdKNsRA","user_id":"uO0M_cZRg8iviuhf-szyJQ","business_id":"xAg2w4pxJURbB2edAg2wMQ","stars":5,"date":"2013-04-05","text":"A new culinary 5 star treat in Phoenix\/Scottsdale area...It goes into our top 5 places in AZ to dine out...Bink's is as good as It's \"parent\".. Binkley's and different at the same time...If this were in a major city they would get a Michelin star for food alone.\nWe ate at the bar because they said they had no tables(not true based on our observation)...But The bar and the bartender create a good place to dine...Each and every dish we had including drinks was special...What makes it special?..Everything was cooked to order,fresh,the spices and sauces were extraordinary and interesting.\nOK..We had..For cocktails.and Elder flower Manhattan..a little bit on the sweet side(I had it with Canadian Club).and a Glass of Magnus wine..Our biggest critique is the limited wine selection and OK not great..The bar has small cones of popcorn that has been spiced up a bit and went well with cocktails...Appetizers were A Pork Shoulder Papusa(Kind of a Empanda and unique) and a Beignet Foiegras mousse..with a smidgen of cherry preserve...again a unique item For the main we had Sand dabs(in butter and almandine) and \"Amy's Bolognese on a bed of what I would say was a block of corn bread but they said it was breadpudding and tasted great.","useful":0,"funny":0,"cool":0},
{"review_id":"BuW8brGFbh_GTmQKtv3t4A","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"KBP7x08WfD__BUoE4kY0lg","stars":5,"date":"2011-12-26","text":"Definitely the best carne asada tacos in town. Have recommended this place to several friends and no one has been disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"gW5P0mznUm0tlsqbaytqbw","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"oZcbn7ENit23xbCsyu9xbA","stars":2,"date":"2011-12-26","text":"Seems like the service has gotten worse since our last visit.  It took forever to get our orders. Waiter forgot one of our orders and they didn't have one of the items on the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"7irG_kzs02LA546kKF4c2Q","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"u0fHb6lH4Xj7FH_huN3aRA","stars":5,"date":"2011-08-09","text":"I would like to compliment Derek and his team. They have helped me out on numerous projects and their commitment to service and quality is second to none. Their pricing is always competitive and they get the job done right and on time. I would definitely recommend working with them!","useful":0,"funny":0,"cool":0},
{"review_id":"KxLbsqxkraP1Gl5Rhg4ehQ","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"leJo2p90gVq1JQzR-QP-hA","stars":5,"date":"2012-01-20","text":"16 flavors & So many toppings to choose from and they have pomegranate seeds! Indoor and outdoor seating options. My new favorite yogurt shop.","useful":1,"funny":0,"cool":0},
{"review_id":"0c09uSWt5HDhVi9xeU5i6Q","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"QyFciCaAJkniP506PP43ng","stars":1,"date":"2014-01-15","text":"I live nearby so I thought I'd try their wings. I was very disappointed. The wings were so small that it would take 3 wings to equal one regular sized wing. I won't be back.","useful":1,"funny":0,"cool":0},
{"review_id":"Wvg66uJCoagePltIgimZKA","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"sW1XlY-IkcvP1XsOoJ3O5Q","stars":1,"date":"2012-11-08","text":"Brought iPhone in to replace broken glass.   After repair, microphone not working. Employee would not take responsibility but eventually agreed to repair. It's been several months and they still haven't repaired phone.","useful":3,"funny":1,"cool":0},
{"review_id":"BEjHsUMVOeqweG2RWnkLrw","user_id":"yiUIdrHyEO7X_cmx-QMomg","business_id":"825nC-s-cQG6Hsul5Gm2cA","stars":3,"date":"2012-10-03","text":"I was expecting a little more based on the good reviews. I ordered the brisket and wife had the monster. The barbecue sauce was fine but the meat was a little dry. Sides were fine. The service was minimal, no smiles and the cashier wasn't really helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"ALpov95HyKPeoU5P76cuDw","user_id":"tETUv3MUBrwgb6_cxe-Caw","business_id":"zw74kL1IvT65yRvNLx5UxA","stars":1,"date":"2014-03-04","text":"Worst service. They mess up my orders all the time. They also hung up on me when I tried to order one time.  I don't think they understand English very well.  The way they cook dishes varies, so you don't know what to expect when you order the same dish.  They also do not pay attention to allergy requests.","useful":0,"funny":0,"cool":0},
{"review_id":"k8Wz7wHkUE_6R_hcizrPlA","user_id":"Lc7nBEs53aF1h7xI7Qz-Pw","business_id":"qX116WMOppAblGKxoQwlYA","stars":3,"date":"2013-07-20","text":"Very funny! BUT!!! be careful of a couple things:\n\n1.) Don't order tickets on the website (go to location to get them), they charge way too much for a \"service fee\" which can be as much as $10 extra per ticket. \n\n2.) Don't get the fish tacos....I know, I love fish tacos too, but not here. Almost everything else to eat there is very good though so done be afraid to eat!","useful":0,"funny":0,"cool":0},
{"review_id":"UxBmCYSiPAInbbzQCTnLFQ","user_id":"FRQEqjYYfiZzSyNvyhO3Zg","business_id":"dnUEw7WLXVTPFpNBhgWFMA","stars":1,"date":"2016-08-11","text":"Bad customer service. We are having to send back our Vitamix because the knob on the base is coming loose and was not offered a replacement. We will have to do without a machine for 2 weeks while you repair ours. We should have been offered a new replacement.\n\nWe will let our friends & family know of our experience and that if they should purchase a Vitamix, that it may be of poor quality and may start falling apart. And that even with the \"Lifetime warranty\" they may have to do without a machine while theirs is fixed by Vitamix. You spend that amount of money for a product you expect it to be of good quality and not fall apart.","useful":0,"funny":0,"cool":0},
{"review_id":"WsLiMU6bmwc03W7sVJdcvA","user_id":"gB4zpi2IRUvh5w3edaYZ0Q","business_id":"ajoqEHnCZTD8-8GqGLq9-Q","stars":4,"date":"2015-09-10","text":"I had a overall good stay. Everything was convenient . I'm lazy, so to have almost anything I want all in the same place works for me. My room was very modern and the colors popped. Adding a retro feel to it. Bathroom was beautiful and sleek too. .  Still a short ride to the strip , but all and all it was good.","useful":0,"funny":0,"cool":0},
{"review_id":"M0k2YQBQF_H3nRahUgPP8A","user_id":"QK10KxcDaQdk_JEF3Ur1HQ","business_id":"lJQp_huDv88wBdl4S8LO9w","stars":5,"date":"2011-10-11","text":"I've been going to Lauren for over 5 years and have followed her from different salons cause I think she is top notch! I really like that she is such a nice person and my hair always turns out great. She is efficient and always on time. I've recommened several friends to go to her and they were happy as well.","useful":0,"funny":0,"cool":0},
{"review_id":"W7z0WS15HmNkijl7-JkGhg","user_id":"uTSzKL3jBe3ARecxolTlfA","business_id":"xcgFnd-MwkZeO5G2HQ0gAQ","stars":2,"date":"2015-11-20","text":"Eating at this restaurant\/bakery entails listening to the owner rant anti-Muslim sentiments. If challenged he is quite intimidating!\n\nNot a pleasant way to dine!!!\n\nM. Shaw\nToronto","useful":5,"funny":0,"cool":0},
{"review_id":"CwyXhfLhIXC5ydSikPAzSg","user_id":"Or2JSL9xLaMszgaeyEUqnA","business_id":"zdE82PiD6wquvjYLyhOJNA","stars":5,"date":"2015-11-05","text":"Had the Chimi, Tacos and Bugogi fries.  Had no ides what to expect of the fusion taste.   Simply put, I was blown away.  Definitely on our return to list of places!","useful":0,"funny":0,"cool":0},
{"review_id":"xjq8A_-_GPJfjAr9XB1EhQ","user_id":"Or2JSL9xLaMszgaeyEUqnA","business_id":"TnaNION9PogHP1kfsMghDQ","stars":5,"date":"2015-11-05","text":"Getting a \"Bobbie\" is how we start our Vegas visit each and every time. Its Thanksgiving on the go!","useful":1,"funny":0,"cool":0},
{"review_id":"cLuOhXwbE8g8gLVT5qWxzg","user_id":"Kp91LTWYuC6qp6_qJRykbA","business_id":"FOqYmI24hSVP4EUibW-9zQ","stars":1,"date":"2016-02-18","text":"ACRYLIC NAILS WITH GEL NAIL POLISH. Definitely will not be spending my money there again. The people are very RUDE! And the did my nails so half ass. When I asked to speak to MANAGER there isn't one there, when would she be in they told me they didn't know. I normally don't get my nails done but I decided to treat my self and I told the lady just make them look super nice. IT LOOK LIKE I WENT TO WALMART AND GLUED ON MY OWN NAILS THEN PAINTED THEM 15 COATS THERE BIG AND BULKY. she didn't even push back my cuticles so u can see the GAP very easy 3 of my nails r crooked.when I told her y it goes to the side she said that's the way my nails grow. this place sucks!!I PAID 50 BUCKS WHAT A WASTE OF MONEY.","useful":1,"funny":0,"cool":0},
{"review_id":"3CO0Yl3eiTw2-zyVXvoeXA","user_id":"C0Bp1fg8mydCRRc15X8-JQ","business_id":"pCJ2uItb84ZyA99ULOKHPg","stars":5,"date":"2015-04-23","text":"Have had my taxes done here for almost 30 years.  Wouldn't dream of going elsewhere.\nMichael is the best.","useful":1,"funny":0,"cool":1},
{"review_id":"LLTj4XfY5XBQcfAV0qHncw","user_id":"KZLNrHvPMKxb8qiS8C_35w","business_id":"VLDFjeqpUgWhnVuB_8GuEg","stars":5,"date":"2014-09-06","text":"Love the juice bar! Try the kaleaid. They now have bottled cold pressed juice. It's expensive, but so good.","useful":0,"funny":0,"cool":0},
{"review_id":"BJeGozQcHmfcyG6b5b8-dQ","user_id":"KZLNrHvPMKxb8qiS8C_35w","business_id":"ZVd67stmK5Yyn4qYmbvqug","stars":3,"date":"2014-09-06","text":"No complaints. The pool was nice and apartment was big enough, but could have used some updates.","useful":0,"funny":0,"cool":0},
{"review_id":"eshEGncBBlNnbKhGCLnv6g","user_id":"KZLNrHvPMKxb8qiS8C_35w","business_id":"fjapWp89YVCeKvW51KUDQw","stars":4,"date":"2014-08-12","text":"Love their coffee and food! Very friendly staff.  I just wish they had more seating:-(","useful":0,"funny":1,"cool":0},
{"review_id":"vDT1l3oJI0OrTf88QtLM0w","user_id":"KZLNrHvPMKxb8qiS8C_35w","business_id":"dL8678EqgOvovCaK31tSrQ","stars":4,"date":"2014-08-12","text":"This place always has cute clothes, plus the owner is super nice and very helpful. Great clothes for a great price.","useful":0,"funny":0,"cool":0},
{"review_id":"5gXls0HE3ayoCmvT3kpsSg","user_id":"rZWj_B-7afKQQKz08tgiUQ","business_id":"qqs7LP4TXAoOrSlaKRfz3A","stars":5,"date":"2015-03-22","text":"I thoroughly enjoyed my oxtail meal. This was the best meal of my 4 day trip. Hands down!  They have great menu choices, if you enjoy Carribien cuisine or not. The spices were superb and the meat and potatoes were full of flavor. I savored every bite. The waiters were nice and friendly and they could describe the flavor of the meals we chose. I can honestly say that DW Bistro will be my restaurant of choice in Las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"UhaOkyKw_lSiDaJi2GnDAA","user_id":"oHfx__bffJ5iY2QegWXYGg","business_id":"0CElIQnJdQYF2bmsAiWczg","stars":1,"date":"2016-07-19","text":"BAD FOOD AND VERY BAD SERVICE.  CUSTOMER SERVICE NEEDS OVERHAULED.\n\nDo NOT go here.  Poor food quality.  Rude service.  Not dog friendly, even if you had a tiny dog.     No shades.  Too bad they did not consult a landscape designer to transform the nursery to a comfortable place to hang.","useful":0,"funny":0,"cool":0},
{"review_id":"fCOYi9Jo10gSuh1O7rSQ-w","user_id":"oHfx__bffJ5iY2QegWXYGg","business_id":"X8wtNfS7OwfHV3QSLrBEcw","stars":1,"date":"2013-07-26","text":"STAY AWAY FROM THIS DENTAL PRACTICE!!!   I randomly chose this practice and due to change in dental plans.  I just wanted teeth cleaning and am fanatical about cleaning in regular interval, which had done recently 4 months by regular dentist.  This office (Thomas & Thomas and other names they use to confuse patients) insisted that I had this and that issues and had me sit down with its used car finance person to go over the charges. Accordingly to my DHMO plan, teeth cleanings are covered at $0.00 copay twice a year, but this practice insisted it needed to charge me $104 above the negotiated price the carrier will pay and added a whole bunch of other unneeded procedures.  The next day when I came back to ask for my x-rays, the used car finance manager told me that I couldn't have it until I stated my HIPPAA and patient rights, and insurance contracts, then she realized that I was not one of their other ignorant patients that they can scam.   I should have walked out when I first notice it poor practice in having another patients record in plain view in front of me, and dirty equipment.\nSTAY AWAY FROM THIS PRACTICE.  IT ALSO GOES BY THE NAME OF PREMIER DENTAL GROUP, THOMAS & THOMAS, AND by other names to hide from bad reviews.","useful":4,"funny":0,"cool":0},
{"review_id":"6ocRMQxDkIISIxmawdVHow","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"UK2Onb024Azao0DrTHSvhg","stars":5,"date":"2017-06-30","text":"I went for lunch as first time customer and walked away very impressed....and full! I had the Greek salad, a side of hummus and pita and garlic feta fries. The service and kitchen time was above average. The food was also above average, just excellent. The salad was perfectly dressed, fries cooked perfect and pita nice and warm. I would recommend any Greek food lovers to go here!","useful":0,"funny":0,"cool":0},
{"review_id":"x4vCPn9NqrvnMk7id2916w","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"McPUgVVyRhNf0v06pPuV4w","stars":4,"date":"2017-06-30","text":"I love that it is open later than others. They are fast and accommodating. This location is well kept and feels clean. My nail tech was not very personable, BUT I actually appreciate that. I am not a fan of small talk while getting my nails and toes done. I have only been once so I am reserving that last star for when I go again to make sure the service is consistent. As of now I would highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"0PgbTCLdvKimd5fSTyYWkw","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"myQEB6ldvn-1oRHmauozDA","stars":5,"date":"2017-07-04","text":"I recently moved to Henderson and stumbled across At Your Service and am so happy I did! What a wonderful pet supply store, I prefer it to any chain hands down. The selection of premium food is unmatched and their fresh treats are an added bonus. You will not be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"i2C5AAktffS1MnUn_ZAXMg","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"aUWc_viqJs2SAYSFXwvXDg","stars":5,"date":"2016-11-09","text":"I contacted Ron to arrange a bouquet, pin, and flower crowns for my recent wedding. He took a considerable amount of time out to speak with me regarding flower colors, types and arrangements. The end results were beautiful! I was floored when I saw what he had created. Just gorgeous and ready exactly when he said they would be. I would recommend Bloomers to those looking for bridal flowers or just an every day arrangement.","useful":3,"funny":0,"cool":0},
{"review_id":"0ImNyeq-3-60VHplR_bLJg","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"m-JA0YN5qFKwhygW1bb1sQ","stars":5,"date":"2017-04-07","text":"Jordan is an attentive, hard working attorney willing to fight for his clients. Throughout a difficult and nail biting litigation, Jordan assured me that the result would be worth the stress in the end and he could not have been more correct. I am happy to recommend Jordan to anyone seeking to hire an attorney who will fight for their best interests with compassion.","useful":0,"funny":0,"cool":0},
{"review_id":"HFekXsr0DA0Q6mTW0UZAkQ","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"rnNFE7-zE5BFKjFURBEpJw","stars":5,"date":"2016-10-31","text":"I came here today to have a full set with gel polish done for my upcoming wedding! Gee was amazing! She is a perfectionist and was able to do exactly what I wanted. I will not be going anywhere else.","useful":1,"funny":0,"cool":0},
{"review_id":"ckCRsmBpLNyRZYhDLQuvzw","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"I0f12eU-xFn6Kd_4H57jrQ","stars":4,"date":"2017-07-04","text":"I am kind of sad I am just now discovering Napoli, because wow! We ordered a pepperoni and cheese pizza, mozzarella sticks, BBQ wings and fries. Every single thing we ordered was delicious. I cannot give 5 stars however because some of the food took a really long time to come out, but the customer service was still fabulous. I will definitely dine again here.","useful":0,"funny":0,"cool":0},
{"review_id":"cXvcUsZsN9SuKcjJ0CIgNw","user_id":"235zPC8XA5cW8QIKNeaCQQ","business_id":"xgJ0Rpo85SIIuF0h8ZCTYg","stars":5,"date":"2016-11-09","text":"I contacted One Luv Bridal for my wedding and have been so happy with the customer service from day one. Whitney was wonderful and fast in responding, her prices are competitive and she really takes the time to try and understand what your needs are. I asked for hair\/makeup for myself and hair for my two flower girls. On the day of my wedding, both hair and makeup girls showed up at least 15 minutes early. They were personable the whole time and really took the time to understand the looks I was going for (even if I was confused myself). I cannot recommend One Luv enough to all brides. It was a stress free morning and I was so happy with the results.","useful":0,"funny":0,"cool":0},
{"review_id":"FIzrW97xb2A2rpLFuopQtg","user_id":"4r2OvYJcub4--a-iXJiQ8A","business_id":"vUDqNV3RhI3FmZRwS7039g","stars":1,"date":"2012-08-26","text":"If you like precooked food and tacky decorations you have found the right place. From the frozen garlic bread to the terrible cheesecake, Bobby's must have a phobia of fresh food. Save your money and avoid this over priced disaster!","useful":1,"funny":0,"cool":0},
{"review_id":"0rfy0e_9UuvCu3kHUPWopA","user_id":"4r2OvYJcub4--a-iXJiQ8A","business_id":"ojYDE5eeEgvTyHWoFoC9iA","stars":5,"date":"2012-08-28","text":"I love love Midge at Prova salon. She does great color and cut. And I am very picky! She is very nice and easy to talk to. I am never disappointed with this salon and excellent stylist.","useful":0,"funny":0,"cool":0},
{"review_id":"yt4lfB-f3EWiH-84dR8DKw","user_id":"xVq2HKK-M0GBzI5WdmEG2w","business_id":"-HhGpFRmOPxJuzmNTWHqhQ","stars":5,"date":"2017-04-30","text":"I have been a regular customer and it has never disappointed me... It's one of the better sushi places in Calgary and it's absolutely the best Sushi kyost in a food court in all of Calgary by a country mile... I've tried most of them if not all...!","useful":0,"funny":0,"cool":0},
{"review_id":"zj17_3GM5yC4oZ2oZWfixg","user_id":"FwK8zKp2M7X6athqIIjmpA","business_id":"uQavb7YPhMo89AjwZcjb0w","stars":5,"date":"2013-12-31","text":"Excellent food. Great service and at a great price. From where I come from. This is a reasonably priced out all you can eat meal. \nLand unlike other places. They bring the food to you , saves you from exercise. \nDefinitely coming to eat here whenever I'm in Vegas !!!","useful":0,"funny":0,"cool":0},
{"review_id":"ErZ-nBRWSo8Vn7-rX8fP-g","user_id":"TVdJckIChoE1ZhzZijU-Mg","business_id":"0jJfQEWEe-6ODl62XSynDw","stars":2,"date":"2015-11-05","text":"This store has an ok floral departmen but here's a hack to get the best arrangements; they keep the fresh flowers in the back store room. You're welcome!","useful":0,"funny":0,"cool":0},
{"review_id":"AgWQPKAdGrzYpGh3FFnSkA","user_id":"TVdJckIChoE1ZhzZijU-Mg","business_id":"_Jt596tjji2NG9tKhIsW2g","stars":4,"date":"2015-07-15","text":"The piercer was professional and courteous and  I was helped very quickly.  The only reason I didn't leave five stars is because in addition to what I had done I wanted my tongue pierced and they were out of barbells for that piercing (which I'd think they'd have because tongue piercings are fairly popular as far as I know) . I will be back when I heal to get that tongue pierced","useful":1,"funny":1,"cool":0},
{"review_id":"4Qbh0A50B6HR9kFvH0lD6g","user_id":"P2KU6H5Qnc1YbhtbA0GuHw","business_id":"7jl9EJQCGBiTyXTDXMsRIw","stars":1,"date":"2014-02-14","text":"My wife and I visited this place since we heard good things. We went for my birthday and ended up waiting about 1 hour and 45 mins for our food to get to our table. My steak was fine but my wife ordered med\/well and they pretty much brought out a rare steak. They eventually took it back to cook it, and then brought the steak back another hour later. After spending about 4 hours in the place, we paid the $200 bill and left. The next day I noticed they charged me $1043 on my debit card! That is totally ridiculous! I called and spoke to John Simich and he said he would \"make everything right\". So after a week of not hearing anything and the $1043 still on my card, I talked to Chase to get it removed and Chase eventually took care of the fraud. I guess John Simich talks a big game but can't back it up.","useful":1,"funny":0,"cool":0},
{"review_id":"JgtEVMWIzadFtFW8HOFYrg","user_id":"Th5gC7G3CKU4wU5TSfj2jQ","business_id":"-ZrgivYktB5OJB78SjZ-XQ","stars":5,"date":"2016-09-28","text":"My husband and I absolutely love car2go in Montreal!  We have recently returned to Montreal to live and will not be buying a car as long as car2go is around. Not only are they readily available, clean and reliable but the staff was very responsive when I accidentally locked my phone in the car at the airport and then could not retrieve it since the car lock is phone activated...i used another phone to call them and they were able to remove the car from the app and keep it locked while they sent someone to retrieve my phone and take it back to their office for safekeeping while I continued on to take my flight. When I returned from my trip, my phone was safe and I was able to pick it up. It's great to use this wonderful service that also helps keep the planet green with a well managed ride share system!","useful":1,"funny":0,"cool":1},
{"review_id":"kygCdkHtD-ZVPakNm8nf6w","user_id":"Th5gC7G3CKU4wU5TSfj2jQ","business_id":"t7R-p3dhGV78dSARAFKEOA","stars":5,"date":"2016-06-21","text":"Best salads ever! Great portion size at a reasonable price. My husband had the \"man salad\" and it was even more amazing then my terrific \"wolf salad\". We will be back!!","useful":0,"funny":0,"cool":0},
{"review_id":"ZS1fpzECSjAWNA2NXa1-IQ","user_id":"Th5gC7G3CKU4wU5TSfj2jQ","business_id":"vb91ALDyUVuaQRPio8a1sA","stars":5,"date":"2017-01-09","text":"My husband and I stopped in to Kiffins for the first time last week. We met the lovely young couple that own it and they shared their passion for creating great, accessible, local and sustainable food. They arrived from San Francisco, Ca., where realestate prices are choking out creativity and accessibility...and moved to Montreal to realize this dream. As a Montrealer myself, I must say, I was delighted to see how much love they put into restoring the beautiful historic space they are in....Montreal is full of treasures, buried under too much paint and alterations...this couple took the time to reveal and honor this space and breath life back into it's stunning architecture and fill it with the aromas of great food and coffee....I wish these two the best of luck and hope anyone reading this will stop in when in Montreal.","useful":4,"funny":0,"cool":3},
{"review_id":"8mDQcHd765qsBSb-C6yHfQ","user_id":"Th5gC7G3CKU4wU5TSfj2jQ","business_id":"feG82UW01BkyPvuSTeDCsg","stars":5,"date":"2016-10-26","text":"St. Henri is just percolating with new eateries that delight the taste buds and our latest little treasure is Chez Fred's on Notre Dame St, just a few blocks from Atwater Market.  \nI popped in on their very first day at this new location and, even as they were still setting up decor, it was clear that this is going to be a neighborhood favorite.  The breads are beautiful and varied...the buckwheat, poppy seed baguette I took home for dinner had wonderful flavor and texture and was a hit with everyone.  I also ordered an almond croissant to eat there and it was pure buttery, flakey, almond yummy-ness. I went back a few days later to try one of their tarts and ordered the citron cream one...all I can say is, wow! Yum! I am now on a mission to try everything behind the glass counter!\nWe have great pastry in Montreal...but this little place reminds me of the little shops of long ago...a great little place in the neighborhood with fresh breads, croissants, pastries, desserts and tarts deliciously waiting to make regular days special and special days exquisite.  Thank you for bringing us such an adorable little shop!","useful":0,"funny":0,"cool":1},
{"review_id":"yHDrzxhi8lUgPnL8ptMH-g","user_id":"Th5gC7G3CKU4wU5TSfj2jQ","business_id":"gmRoqDnXnA3PLk0JbOZZ3g","stars":5,"date":"2016-02-16","text":"I have been around the world and eaten more than a donut or two in my now middle aged lifetime....I am a dual citizen just returning to Montreal after a career in Silicon Valley, California and all I can say is, WOW! Move over Psycho donuts and get out of the way VooDoo donuts! You don't even stand a chance!  I just had the best donut of my life at Leche Deserts....lemon meringue and I can't wait to try the other flavors!  Well done!!  Amazing! It is almost impossible to describe the excellent flavor, texture and delight of what I just ate because it isn't normal for something you eat, even when good, to be that memorable. Bonus was that the coffee was also excellent....right on!","useful":0,"funny":0,"cool":0},
{"review_id":"bDnqesvVdfTE7xmNwOgPIQ","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"ROMFVEFKEYi7qhyITX6jfA","stars":2,"date":"2014-04-28","text":"My first impression was very disappointing. Ok, to give them the benefit of the doubt, their register crashed causing their disorganization. There wasn't a lot of people though and the four of us only ordered juices\/smoothies. How hard is that?! I also ordered one of their chocolate balls from their bakery. \nThey forgot it, so I had to go back up to the register to ask about it. The guy was apologetic and said he's bring it right over, which he did. \nEveryone got their smoothies and juices but me. I remained patiently waiting until my friends finished their drinks. I realized they forgot me again. I went back to the register and notified the girl there that I never got my cucumber cooler. She apologized, they made it right then and there and gave it to me. \nI was a little annoyed at all this.. So much that my review so far is solely based on customer service. \nWhile waiting I did have a sip of the Good Juju and berry smoothie. They were both delicious. This is the reason I might come back, but if the service is the same I certainly won't.","useful":1,"funny":0,"cool":0},
{"review_id":"y2n_1P8QIPgzHsuLkr1U1g","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"KW3EG4v65QeNqXh4O6tUAg","stars":5,"date":"2014-07-04","text":"I'd been going to a salon in Tucson for 20+ years, but after moving to Tempe I had to find a new go-to place for waxing, so I looked to Yelp to find one. I came across excellent reviews for Glow and decided to go with them. \n\nWhen booking my first appointment, the receptionist had such a friendly voice and was very accommodating. \n\nMy appointment was with Rachel. She's super sweet, funny, and did a very thorough job. She took the time to explain what she was doing...even stopping at times to check my comfort level. Afterwards, she sent me home with a sample of cream to calm the waxed area. No one there was pushy about selling product either!\n\nAs I was checking out, I was given a welcome gift with sample goodies for being a new client. \n\nI'm so happy with how personable the staff was and the service I received that I left booking my next appointment.","useful":2,"funny":0,"cool":2},
{"review_id":"ptOng5Kmx6czkvdv90YXjg","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"Q9Au4xfQNdWeVuYYJonY3Q","stars":5,"date":"2014-03-29","text":"After having finished dinner nearby we headed to Rita's to satisfy a sweet fix. We were expecting to just get custard, but they have a variety of Italian ice making our selection harder. \n\nThey offer you samples, so we tasted marshmallow peanut butter, piña colada, mint chocolate chip, and strawberry. Strawberry was by far the BEST!  \n\nWe went with a gelati. It's Italian ice with custard on The bottom and top. OMG! The vanilla custard was so creamy. It paired well with the texture of the Italian ice. Let the ice melt a little and you have PERFECTION. I will definitely come back.","useful":3,"funny":0,"cool":1},
{"review_id":"a5E06UmipSslZGrKzeC6Pg","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"momjERcb6G6ienrfPuNArw","stars":3,"date":"2014-06-07","text":"I'm serious about soup; so much so that I eat it in 100F.  There's something so comforting and relaxing about it. \n\nWent on a Friday at 6:30pm and it was pretty empty, so we got sat right away by a very friendly server. \n\nEver since I tried Pho Ga at Noodles Ranch in Old Town, I've been trying to find a place just as amazing mostly due to location. I've tried two others in Mesa off Dobson rd. NOTHING has topped it yet. Here's why...\n\nPho Dalat's beef based broth was very tasty; I'll give them that, but there wasn't much chicken. Other then the usual add-ins provided with Pho, the soup consisted only of shredded chicken breast pieces and noodles. At NOODLES RANCH the Pho Ga comes with bright greens of broccoli and baby bok choy. \n\nI'll continue my quest for a nearby pho place !","useful":0,"funny":0,"cool":0},
{"review_id":"7t89VXc9ZlezGEQwnjTPYw","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"N77ZbAU_R-38OXWDaEnT2Q","stars":1,"date":"2015-07-06","text":"I called and left a message on 7\/2\/15 at 8:26 AM to get a quote. I have yet to hear from them. \n\nMaybe he's  on an extended holiday vacation. I'd be willing to update my review when he calls back.","useful":3,"funny":0,"cool":0},
{"review_id":"QWD4QSVJgRZ81f5fhs6FGw","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"qaPSbg690KaX5av6xsSV4Q","stars":5,"date":"2014-11-23","text":"Such a cozy and cute coffeehouse! For my first time here some regulars behind me suggested a Dirty Chai, half sweet\/half spicy. AMAZING! I've had chai tea lattes at many coffeehouses but never a spicy one. The heat is just the right amount. It comes up unexpectedly too. I think it's cayenne, among other spices. \n\nGREAT SERVICE. Michelle is so friendly and chatty. I'm so happy with my experience. I can't wait to be back. I wish it were closer to me!!","useful":1,"funny":0,"cool":2},
{"review_id":"f1myDees9O8cF7P2MXSUFQ","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"kj1p6NwUGROOoqNySf0I1Q","stars":5,"date":"2014-03-24","text":"We came here on a double date and both parties where blown away by the flavor of their entrees. This visit was on a Friday night, and we all know going out to dinner on a Friday is gonna be a wait. This place is really popular, so if you don't want to wait go before the dinner rush. \n\nThe food and service once we got sat were well worth the wait. This is why we've continued to come back. We always seem to get sat in Clarissa's area. She is so upbeat and genuinely happy to see us. Whenever we have questions she provides with more than enough information to help us make our choice. She's even brought us samples of the sauces used in dishes to see if we'll like them. This is AMAZING customer service. \n\nHere's what we've had that I HIGHLY recommend:\n902 (yes, I know it's fried rice, but the flavor is unlike any other typical fried rice I've had)\n403,400,306,854.  \n\nThe only I haven't been too crazy about is the golden curry puffs. I felt they were bland. One out of the many we've had isn't bad. \n\nCan't wait to try more dishes!","useful":0,"funny":0,"cool":0},
{"review_id":"s7gWfIJI05yhxFdyFqcsDA","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"aVTcYZ1h7QoF_lDdH_RLqg","stars":2,"date":"2014-04-13","text":"I've been wanting to try this place for a while. Now that have, I'm good. \n\nIt's the kind of place you go to after a night of partying when your standards aren't so high. It wasn't all THAT bad, but not great  either.  \n\nI judge Latin-style restaurants on their chips and salsa. If it's not good, I know what to expect from their kitchen. With that said..\nthe chips were greasy and salsa tasted like Pace picante. \n\nI had the two taco plate of grilled chicken and steak tacos with re-fried beans and rice. The grilled steak taco had good flavor, but the chicken was VERY dry. I added lime and salsa to try and moisten it up. All and all...it was decent, but not any better quality than a late night taco place. \n\nService was ok.","useful":1,"funny":0,"cool":1},
{"review_id":"92IBtSZ2M9cm-Qkf2zNaug","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"-GPA5nvQ7Gfhdyy624bDyg","stars":5,"date":"2013-11-13","text":"After calling 8 companies for estimates, Harris & Sons was by far the lowest. I didn't want to go with just the least expensive either, so I did my research first. I only called companies with excellent BBB ratings which would also ensure that they were licensed and insured too! \n\nI wanted estimates on the removal and stump grinding of a 60+ ft pine tree, 50 inches in diameter whose roots had cracked the corner of our perimeter wall. It was also leaning over our neighbor's house. You wouldn't believe the difference in pricing!! I actually got an estimate for twice the amount that Harris & Sons offered. What I liked about them was that they didn't start off with a high price and then try to negotiate it down to get my business, they were low from the start! \n\nI spoke to Jerry, who was very pleasant over the phone.  A few months later, (my research took some time)  I called them to schedule the service. I didn't even need to be there. Yeah.. it made me  little nervous, but these guys are professionals. They came out October 18th, 2013 in the morning while I was at work. NOT ONLY did they do an EXCELLENT job removing our tree, but they even cleaned up the area and took branches lying around that my husband had cut off another tree. \n\nI'm so HAPPY with their service. I would definitely recommend them and use them in the future.","useful":3,"funny":0,"cool":0},
{"review_id":"ZSSMXOw0yRzX49-J6a9CgA","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"3KFWuiz8lla9SospgQn6Yg","stars":1,"date":"2014-03-31","text":"The price is a great, but I was disappointed that it wasn't homemade ice cream. The girl behind the counter said one of the ones they use is Blue Bell. \n\nStill, I got a strawberry milkshake. It was incredibly bland. Other than knowing I picked out strawberry, there was nothing else to indicate it's flavor. \n\nNow, they have a selection of cookies you can choose from to make ice cream sandwiches that they indicate are made from scratch, but they didn't look all that appealing to me. \n\nSorry, but there's nothing that would bring me back.","useful":2,"funny":2,"cool":0},
{"review_id":"thRiwrWpcnsaMvvVg3Bhqg","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"pHpU8lnnxMuPWRHOysuMIQ","stars":2,"date":"2014-11-23","text":"I was embarrassed to bring my out of town guest here last night for dinner, especially after going on and on about how delicious this place was. \n\nService was GREAT but something was really off last night; perhaps it was the cook that night. \n\nMe: Chicken panini with Salut fries. Too much oil was used in grilling it, because it came out greasy, leaving an oily residue on my fingers. Fries were good, but I liked the way they used to serve it with the crumbled feta not shaved\/dry feta. \n\nGuest: Malbec burger with regular fries. Ground meat used for burger had chewy nerve endings and her fries were too salty to eat. \n\nI'm just disappointed. Our meals certainly weren't worth what we spent on them. After this experience, I don't think I'll be back. Maybe this is a sign of things to come for this restaurant.","useful":1,"funny":0,"cool":0},
{"review_id":"Er4acbMCRbU7xoJPJsUhGg","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"JgTA3AqVrDbceTyp-YP5_Q","stars":5,"date":"2013-10-16","text":"We recently moved into our first home a couple months ago and couldn't be happier! I must say it was frustrating at times due to the lack of inventory and aggressive housing market, but with Tanya Shield's persistence, great customer service and wonderful personality, we finally purchased our home in a great Tempe neighborhood. \n\nI cannot say enough good things about this company. I really felt as though we were our agent's only customer. She was extremely flexible with her time and even called me at 10pm to answer questions I had! \n\nI recommend using this company when looking for your dream home! \n\nThank you Velasco Group!","useful":4,"funny":0,"cool":0},
{"review_id":"nG_Qp2MQKHsKccGju6sGDQ","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"2lYMhZL2oHUpOQ2KjR5aJQ","stars":5,"date":"2015-07-29","text":"After posting my review the owner promptly apologized and offered a complimentary pedicure. It took me by surprise. I wasn't expecting to hear from the owner. To me, this is a sign of a great business. The owner truly cares about the customer experience. \n\nWell, I decided to try it out again, this time going with his suggestion of seeing Kai. WOW! What a difference! She was FANTASTIC!! She paid great attention to detail, was incredibly thorough, and VERY gentle. I really liked her. \n\nThank you. I will definitely be back!","useful":3,"funny":1,"cool":3},
{"review_id":"sulgaZLGF9VQOwLoo1j3kg","user_id":"ge2RrbND3RV8g1kN9725jQ","business_id":"Zt4ljpwfmBufatNM1zPNcQ","stars":4,"date":"2015-02-17","text":"I'm updating my review to indicate that General Manager; Natalie, Hecht, responded to my feedback. I'm giving Picazzo's 4 stars because of their response. Recognizing customer concerns\/complaints are a sign of great customer service. I will be going back. Thank you Natalie!","useful":0,"funny":0,"cool":0},
{"review_id":"w5RS2XiZMNS3ckxwrB3m5g","user_id":"YKYoyv07Mqyvh2K-4rjy3A","business_id":"uqu1jy6Q0fXwl8tax-79oA","stars":5,"date":"2017-06-23","text":"I had a great experience with this nail salon. The staff are friendly and knowledgeable and we're able to answer my questions and concerns. The inside is nice and professional looking as well. Overall, I enjoyed my experience and love how my nails turned out.","useful":0,"funny":0,"cool":0},
{"review_id":"TF-0Mm-dzk5ko2TLXsUzFw","user_id":"9dOf_aB5IVfZEV3ffXVDbw","business_id":"NyydghDh6p1rGJim6lPeMA","stars":5,"date":"2017-07-04","text":"Well run. Informative tour guides kept things moving. Access all over the facility and great vantage points. Kids loved it. Ticket prices cheap. Gift shop and store immaculate and 50% off OOPS products.  Great way to spend less than 2 hours.","useful":0,"funny":0,"cool":0},
{"review_id":"8LpHAAtEJmsi6c8xhCsE9Q","user_id":"OChd58NTOvqhrMe5dUJHPw","business_id":"P8y_F6OBbLHpQ8MpRsEwjA","stars":5,"date":"2013-07-11","text":"Surely no one ever wants to have to put their pet down, but when that inevitable time comes, it's supremely comforting to know that there are veterinarians like Dr. Carrie who provide compassionate and thorough care.  My cat has been on a slow decline for about a year now.  I always felt I'd know when he would be ready to pass on, but it didn't make the decision easy by any means.  From the moment we walked through the door, Dr. Carrie and her assistant made me feel calm and helped assuage the guilt associated with putting down your beloved pet.  Her calm, pleasant and extremely caring nature helped make the whole process much easier to deal with.  It's clear that she cares as much about the human clients as she does the animals.\n\nI hope it's a long time before we meet again, but in the meantime I hope this review helps others to find a peaceful and caring way to end their pet's suffering.  \n\nThank you so much.","useful":0,"funny":0,"cool":0},
{"review_id":"KAeBhGIT4rUsvOyD6fLh5g","user_id":"OChd58NTOvqhrMe5dUJHPw","business_id":"M-caugKzJ9qLOmCBfD9Nyg","stars":1,"date":"2013-11-18","text":"Maybe you're not supposed to visit a restaurant an hour before they're about to close, but we stopped in for a quick bite of late lunch this weekend.  What a (pricey) mistake.  Their weekend menu is really lacking, but the BF and I found something to satisfy our light hunger.  After returning to ask what I had ordered, we did not see the waitress again until she plopped the bill on our table.  No water refills, no coffee refills, no asking how the food was (not great--over-poached eggs on the benedict, and WAY overly spiced squash soup).  The size of my portion of soup was wrong (I had wanted a cup and received a bowl).  \n\nDespite trying to get her attention as she passed by our table a half dozen times, I was unable to notify the waitress that she had my order wrong and that I would really love a glass of water.  When she passed by the last time and saw my BF with his card in hand she suddenly noticed us...not that she asked how anything was.  I didn't even get a chance to see if we were charged for a bowl of soup instead of a cup because she snatched the card up before we had the opportunity.  \n\nI get that it's a Sunday afternoon and you probably just want to go home.  That's no excuse for treating your restaurant patrons as if they're burdens.  We spent $27 on a \"quick bite\" when we could have gone to Panera, had great service and walked out $15 richer.  \n\nUnreal.  At least I'll never again have to face the always full parking lot to eat at this pretentious restaurant.","useful":2,"funny":0,"cool":0},
{"review_id":"UrQ0H7m1Af_h6Tx7xzO_gQ","user_id":"ALxGjiXIImtejBE3s7JrFg","business_id":"Hs68UjZqsTncXTT7V0J9fg","stars":5,"date":"2011-07-28","text":"If you love seafood, Salmon Dave's is the best restaurant in all of Cleveland.  Their salmon is exquisite.  It melts in your mouth and ithe ginger sauce that it came with was delicious.  It did not overpower the taste of the fish filet, but added to the flavor.  I also enjoy their shrimp and scallop dishes.\n\nBut what really separates Dave's from other restaurants is their risoto.  I grew up on risoto, an italian rice dish.  I love it, my children love it and my grandchildren love.  To me the risoto at Salmon Dave's is the best I have ever eaten, even better than the risoto my made.  So I suggest that when you go to dinner there, make sure you have one of their risotos as a side dish.","useful":0,"funny":0,"cool":0},
{"review_id":"I9ynt_7Cy_LCT90YTh7OHg","user_id":"967nU8KUHvVzs20q8wKWUg","business_id":"G-5kEa6E6PD5fkBRuA7k9Q","stars":5,"date":"2015-10-04","text":"Our server Dave was awesome and made our experience perfect. He was so accommodating to our dietary needs and made great suggestions. Our food was delicious and we really enjoyed our meal.","useful":0,"funny":0,"cool":0},
{"review_id":"FcfZf0tPsphMkRILNVzPqg","user_id":"2k9CtwQJt5FVo0y9VO50Wg","business_id":"4AFjm5H4GxHASUx-lObXvw","stars":5,"date":"2016-09-25","text":"My wife and I have four Lexus cars we take to Leksfixit. The service and customer care is second to none. I know when my kids go there they are well taken care of!","useful":0,"funny":0,"cool":0},
{"review_id":"QQ9_PC3tWDGH-GVtx2w1_A","user_id":"6WQLpez-ItS5DygqcXb30w","business_id":"zCrjPjc4QFil2R4-H7kSTQ","stars":5,"date":"2014-11-30","text":"This place is AMAZING!! The food is top notch and the service is excellent. The owner has a passion for his restaurant and it really shows. I absolutely love their chicken salads here and their pizza is mouthwatering. Everyone we have introduced to this place has nothing but great things to say!!","useful":4,"funny":0,"cool":0},
{"review_id":"VeXwVikGkvvqlYTfiSgDpA","user_id":"6WQLpez-ItS5DygqcXb30w","business_id":"3l54GTr8-E3XPbIxnF_sAA","stars":5,"date":"2014-11-30","text":"Quality of food combined with amazing service makes this place a new family favorite. We were out and about exploring Scottsdale, i told my husband I was in the mood for a burger and so we ended up here. The food is amazing and we will be going back for sure!!! I really wish they had a location closer but we will make the drive for this place!!!","useful":0,"funny":0,"cool":0},
{"review_id":"60nnzMzpdYGNsox5LPXLtQ","user_id":"aaxZW0vKNK88d2JYZHVNOw","business_id":"r_BrIgzYcwo1NAuG9dLbpg","stars":4,"date":"2016-07-18","text":"Really wonderful spot. Delicious, flavourful, authentic Thai food. The decor is unique and fun and service was great, too. I've been numerous times and have always enjoyed everything.","useful":0,"funny":0,"cool":0},
{"review_id":"FLvn0yR3BCCHQoM2n751Pw","user_id":"aaxZW0vKNK88d2JYZHVNOw","business_id":"YLc7Djf3GsC8IT84YkZMzw","stars":4,"date":"2016-07-18","text":"5 stars for the food itself. \n\nMinus a star because of the inconvenience of their delivery service. Sometimes it can take 90 mins for a delivery time to open up. \n\nWith that being said, this is - in my opinion - the best Thai food in Toronto. Their Tom Yum soup is ridiculously good; such a density of flavours, it just blows your mind. \n\nAlso the best Green Curry. At *medium spicy, it's the perfect marriage of sweet and hot. \n\nThe interior is smaaalll and the decor is very simple, clean, straightforward. Nothing to really remark upon. Getting to its location is an adventure in and of itself.","useful":0,"funny":0,"cool":0},
{"review_id":"y0A90RN3qJNw1x4dX9VmzA","user_id":"8016-hOOzbED5gjDSBKsrw","business_id":"tA1YZNIngWh3icwwXi1yuw","stars":5,"date":"2017-04-06","text":"I've been going here for over three years now and couldn't be happier. I've never had a bad experience. Everyone is always super friendly and professional. Carolyn, the manager, is so nice. The location for me is accessible and convenient, and the atmosphere relaxed and comfortable. I was sad to learn that Stephanie had moved to Boston, but everyone here is so talented that I knew I'd be in good hands. Today I had a cut with Kristy, and it was awesome. She's really attentive and does great work. I have really dry, thick, coarse hair. She suggested a deep conditioning treatment that lasts a month (for only 10 bucks!), and now my hair is really soft. I love it. Highly recommended!","useful":4,"funny":0,"cool":0},
{"review_id":"AeuUFgOqQ4ReRYlYRccJIw","user_id":"6QdVYi9qLT7szm2KME6Cpw","business_id":"an97jMgR4kOHXOPMcboWRw","stars":5,"date":"2012-10-16","text":"This is one of the most inventive, loveable fusion restaurant in Vegas that I have found so far.  By embracing not only the French influence but also the Italian on Vietnamese cuisine , it makes the food more exceptional and unique. I have been to many restaurants in Vegas but this is the only place that keeps me coming back for more. My favorites dishes of this restaurant are Spicy Beef Noodles Soup, Garlic Rice with Marinated Short Ribs, and last but not least, the House Special Crab. I think i would give this restaurant an A plus for not having MSG and also not letting the food get so greasy . \n The ambiance is lovely and soothing. i I think this restaurant can be a better suited place  to a quiet evening with the family\/casual dinner with friends. I would come back to try more food here for next  time visiting Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"7e1nr18ZzLz4Z1-czX5z1Q","user_id":"uA6jOVyeAXR8juuNqU_m9A","business_id":"FcYAwxuOys7NtnUPhRkA_Q","stars":1,"date":"2011-12-30","text":"Food was crap. Everything tasted the same. Like they have one universal sauce. Service was decent. Won ton soup suckd. Broth with one won ton. No vegetables. Wont eat here again","useful":1,"funny":0,"cool":0},
{"review_id":"5RWU-MOLa3SByvh1JtVBLw","user_id":"lM4Gapor-cxyAikK_RQGlg","business_id":"34VuBMNaG9nJiyqsnoEgPg","stars":5,"date":"2014-04-25","text":"Nori is always a great experience. Not only is the fish the freshest you will find in Arizona, but the service is extraordinary. The ambience is a cool, modern look with lime green colors and dark woods. \n\nHappy hour runs until 6:00 and features some basic rolls. However, for those who are a bit more experienced, go with with an adventurous roll on the main menu or a chirashi bowl (not on the menu).  Enjoy!","useful":3,"funny":0,"cool":4},
{"review_id":"WPv9IQOthJNRkNLzNG0ZOA","user_id":"DZDQMT3Iqv7HOx7U-SZSBA","business_id":"ckCa7zH6tJUMiZvgP6IbMA","stars":5,"date":"2015-08-17","text":"Great Company!!! I did my homework prior to using BSV, Everyone else gave me High Prices but BSV gave me the best prices by Far !!! Blowing everyone else out of the water . No problems getting in at any of the clubs or pool parties we went to . I am definitely using Bottle Service Vegas next time I'm in Vegas and I recommend them to everyone . Thanks Brandon !!! Your the man !!!","useful":0,"funny":0,"cool":0},
{"review_id":"NpeYhag5JYol_CF3l-y_xQ","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"EQDJVVIgenbyNZpRcqUWcw","stars":5,"date":"2015-08-13","text":"Always a great price the specials are only $4.25 and cooked after you order.  Its really good to get a fresh cooked dinner under $5.  They are pretty quick and I always go thru drive thru.","useful":0,"funny":0,"cool":1},
{"review_id":"lPjbYzOjX_C9QmU_lGOL3w","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"7w9UhH7Hz14N736FAe5_Fg","stars":1,"date":"2015-05-15","text":"Just go somewhere else!  Really really terrible service and if the guy is not out front smoking he is going from handling cash to touching food.  They need more staff and staff that knows how to clean.  The one guy is overwhelmed and probably nobody wants to work with him.  We call him \"piggy\"","useful":0,"funny":1,"cool":0},
{"review_id":"KPXfZr2TIoZx2jVa7_8cww","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"8Yz1eFsaUy-ny3B6YZDOrg","stars":5,"date":"2015-07-15","text":"Always a great steak but tonight I'm having the burger and onion bloom. With a cold beer of course.  I got the app 365 on my phone so Tuesdays free onion bloom....or whatever they call it.  Very attentive staff so far.  Really tasty onion.  Really impressed with the burger its best I've had in awhile.","useful":0,"funny":0,"cool":0},
{"review_id":"AnHtiLL6mbABJtNitDADLA","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"fcUZ0HlaO1bMW26tzQZVOQ","stars":5,"date":"2015-07-01","text":"They are always getting it right at this location.  This is one of the best Mc Donalds in Las Vegas.  Never had any problems an its nice to eat in a clean restaurant.  Flowers on the table an food always fast.","useful":0,"funny":0,"cool":0},
{"review_id":"GDx2z6UeuOsNGOpncdzUfw","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"jNGIUPDbFDOUDk3yw9gEuw","stars":1,"date":"2015-05-15","text":"Beware prices on menu are less than those in computer. They are charging more than advertised. Mangers are aware an if you complain they will tell you to come back tomorrow?  Easy thing would be to fix issue then but no the manager tells me to bring my receipt back tomorrow to get the over charges refunded.  Why even have a manager?  So price for all American on menu is $5.79 for the 1\/3 pound the computer rings up $6.39. Be sure to check your receipt then be prepared for an argument if you want it corrected.  They are aware of it because its now happen to me twice.  Tonight I just asked for my money back and left discussed with the ignorance of the manager.  06\/26\/15. 9:30 pm.  Should be zero stars cause its simple to treat people kindly.  They failed again............sad cause it seems they fail a lot at this location.........just go someplace else......not worth having to teach the manager how to do math......","useful":1,"funny":0,"cool":0},
{"review_id":"Ju8avdoRFd1KP5W29YvMEQ","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"eRQwgSQD1KyCmJk_PAGOXQ","stars":1,"date":"2015-10-10","text":"Free spring rolls on the house she said as she sat them on the table.  Very friendly staff an I feel welcome even as a single diner.  I ordered the cashew chicken mild you have the option of getting it spicy spicy if you chose.  Well they brought out catfish instead of chicken.  I tried it wasn't bad but I would not be the person to order fish.  Another waitress noticed it was wrong an went an re-ordered the chicken for me.  I would suggest maybe pointing to the menu when you order.  Cashew chicken arrived undercooked veggies maybe they rushed it after getting the wrong order the first time. She didn't bring any plates so I could eat on this time.  Clearly she is mad because of the wrong order.  Kind of an attitude when she brought the chicken out.  Asked for a Togo box I can go home an finish cooking it.  Very disappointed in my first time here.  At home now finishing the cooking myself.","useful":0,"funny":0,"cool":0},
{"review_id":"Bbf1LBP5D9QiYhK89lbD_g","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"Ic3YMUPg_DCNpp4y3B-2bw","stars":1,"date":"2015-10-30","text":"Not allowing an old lady to use your restroom!  I think it is illegal to not allow customers, visitors and guest to use the restroom in Nevada.  Building codes require them for a reason and your business is violating the law.   And putting those tacky signs all over the store does not change the law...","useful":1,"funny":0,"cool":0},
{"review_id":"LhAcWiNpFg7QoHS8P1QmEQ","user_id":"i1zH7hGJs_accdfjEzrwUQ","business_id":"jv1sbEWUJRHeUff1xZtqWg","stars":1,"date":"2015-06-19","text":"Just got three tacos.  Ordered no cheese as I'm allergic and they confirmed no cheese then the asshole making to food put cheese lots an lots of cheese on the two on the bottom.  I checked to one on top before leaving.  He did it to be an asshole.  Great way to loose a regular customer.......","useful":0,"funny":1,"cool":0},
{"review_id":"Gztf9K0yeqRNB-o50rg8ag","user_id":"VkSyLvfCNjw4QwCo9D3ruQ","business_id":"pI80LiWwokyQLpjlH702KA","stars":1,"date":"2015-11-10","text":"Just over 2 years ago we purchased 2 double Flexsteel recliners.  We were sold on the fact that the arm rest would never show dips from elbows resting on it and if it did, it would be repaired and re-stuffed for free.  Also all the mechanics were warrantied for a lifetime.  They talked us into purchasing a Guardsman warranty and was told that if anything was ever accidentally spelt on the leather it would be cleaned and restored for the 1st 5 years.  Basically we thought we had full protection for 5 years on anything that may go wrong.  Well, 2 years later we had all sorts of problems.  We sent design source pictures of all the problems.  Some mechanical. but mostly seams that split. and the stuffing where our elbows rested was showing very deep dips as we were told would not happen\n\nAll the sudden, nothing was covered.  Then after some argument they said they would order parts for the mechanical problems and the elbow rests and we would have to pay for the labor and the seams would not be covered and would have to pay to get that fixed.  The seems were the biggest problems.  We called Guardsman, as their warranted stated the seems were covered as well as any stains. but they advised that they would not cover the seems or bother to work on the leather stains in any way, period.  They couldn't tell us what they did cover.  Apparently nothing.  It was just a way for sellers of furniture to make more money.\n\nToday the repair gentleman showed up and advised the would put on new covers on the elbow rest and repair the minor mechanical problems for $350.00. No new stuffing would be involved or was provided.  Also, he would not fix the seems and said if they did get fixed they would just do it again.  Something about body oils at the seems where the real leather meets the vinyl.  So we told him to forget it. We would have paid him the $350 and more if he could have returned it to look new but he said that wouldn't even be attempted.  \n\nI suggest you don't buy anything from this store.  They really make their furniture sound good, and are very good on convincing you they will last without problems and if problems do occur they will be fixed.  All lies.  AVOID THIS STORE AT ALL COSTS.  If you get taken - remember you were warned.","useful":2,"funny":0,"cool":0},
{"review_id":"RtLq4DuODjvwOfEyo7JA2A","user_id":"1namJ6fTID8LxrgEiU-9dw","business_id":"S5bNE4Pmin8OQUMOFod8bQ","stars":1,"date":"2015-01-12","text":"Four of us attended Ciao on a January evening. All of us were sorry we did. \nThere we a number of issues, but the primary one was the food had a \"bad\" taste to it. As if the food was off, or spoiled. Two people had the same thing, the other two had something different. No one finished the entre. \nWe had appetizers which were ok and much more tasty then the entre. \nThe service was good, very nice young man. \nWe didn't complain about the food, we just all agreed what's the point. \nWe sat eight feet from the windows and were very cold all evening  it was a cold windy night. Most of the cold was coming in through the open doors, they need a improved system to keep the cold out. Needless to say we won't be returning, and suggest that you save your night and eat somewhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"X8nuDa7dpmbSBjg733g27Q","user_id":"1namJ6fTID8LxrgEiU-9dw","business_id":"Q4RSmF0s-AkaegrLFCLEbg","stars":4,"date":"2013-08-26","text":"We had a great dinner again at Donatellos. We have been coming here for years, actually followed them down the street when they moved. The service here is friendly, attentive, and the servers know you are there to enjoy an evening. We like to have our appetizer while we stroll through the menu. I tried the grilled peppers appetizer, it was not what I had expected, the server took it away, replaced it with something else, and it was removed from the bill. My entrée was the veal Marsala, an amazing dish. The veal is so tender, and the Marsala sauce incredible. This seems to be a family run restaurant, very welcoming, and caring staff. I can comfortably recommend it to my friends","useful":0,"funny":0,"cool":0},
{"review_id":"KSrgEpO7c-4Z7PEyYj9c-g","user_id":"r5qDw8gOmlDyN7K0rd94-w","business_id":"O263SR-btj7hzsb0l2t77w","stars":5,"date":"2016-10-20","text":"I just recently signed my lease and am overly excited!!! So far I've talked to 3 different women from the leasing office and all were super friendly and extremely helpful! The location is prime and the complex itself is very well kept. They even have a cute dog park :) can't wait for that!","useful":0,"funny":0,"cool":0},
{"review_id":"DXyzU5-P3b8Qo_wlQyuF3w","user_id":"r5qDw8gOmlDyN7K0rd94-w","business_id":"-F5mm0-YeCI7viSiOwVAAw","stars":3,"date":"2017-10-19","text":"Used to love this place. Have a lot of amazing memories here. Grew up with lox being the best place to have breakfast with all our friends. Gonna start having my boyfriend pick up our food. The blonde older lady there is exceptionally rude. She always seems to be messing up my order, and has this look of disgust on her face when I come in. I've always been very sweet to her, but for some reason she doesn't seem to like me one bit. This post isn't about the restaurant in general. It's more about her and her lack of customer service.","useful":1,"funny":0,"cool":0},
{"review_id":"ib2nIYlD4-CTeEXd5P3x7g","user_id":"wyTsy3kiFhXuaCsxD9ku6Q","business_id":"W537pidoTVQmn9x1GPpxgA","stars":5,"date":"2015-07-02","text":"In the area and decided to stop for lunch. My wife ordered the loaded nachos and I ordered the loaded hot dog. Both were truly spectacular.  Good flavors. Big quantities. Nice people behind the counter. We're going back for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"_QZ8oVG_3IV-K9r6eErIeQ","user_id":"wyTsy3kiFhXuaCsxD9ku6Q","business_id":"-ZBfr1BHvArFp1d6XH8jOQ","stars":5,"date":"2015-05-23","text":"Chili dogs were fantastic. Ruben sandwich equally fantastic. Diversity of soft drinks second to none. Great place with great prices.","useful":0,"funny":0,"cool":0},
{"review_id":"g3rvB7VKbnQPF34LXx1LZQ","user_id":"cEQs5eXLEihbmmoQ63k9Pw","business_id":"oiob4D6ukvLznGo47xSTCQ","stars":5,"date":"2016-06-12","text":"The BEST DINER EVER!!!! We love the staff and one of our favorite waitresses Ms. Nanci!!! These diner is a must \"eat\"...lol!!!","useful":1,"funny":1,"cool":0},
{"review_id":"UYOl6UBC93MqgZpWKSyc3Q","user_id":"FpR76ZvE1XDbGRXrQ6FofQ","business_id":"JTFFtWy_chbsHTs95yD_2Q","stars":3,"date":"2015-03-08","text":"My husband and I visited Las Vegas and stayed at Bellagio for a little vacation to celebrate my birthday. One day we decided to skip restaurants and have lunch at the Cafe. Eggs Benedict or cafe Benedict are really very good. Especially given you can order them 24\/7 OR visit the place any time of the day and night you want. There was one thing, however, that ruined the whole impression. The fork they gave me was dirty! It had food leftovers dried and stuck up to it, apparently, either from a dishwasher or whatever they use to wash their silverware. I informed our waiter and he replaced my silverware with a new set. Never in my life have I seen dirty forks wrapped in a clean white napkin! Also, during the \"rush hour\" we had to wait for our waitress for over 30 minutes! \n\nWe picked a table overlooking the Conservatory. The view of the Chinese New Year decor was nice. But, like I said, the dirty fork just turned me off and ruined the whole experience.","useful":0,"funny":1,"cool":0},
{"review_id":"6WnmL4ZaWrOKZfBfWXsH6g","user_id":"3YcK7r--xwspBdNEW3b2aQ","business_id":"iNkdV6ggGJFa3lYU3fKuqw","stars":5,"date":"2015-03-04","text":"Hired them to paint the outside of our house in QC.  Great work, cleaned up after themselves daily. Worked hard and busted it out quick.   Great results.","useful":1,"funny":0,"cool":1},
{"review_id":"8N5ODj4x18MVEpwn_Og_PA","user_id":"dg3HlAOl7iTJQH2-0IVOYg","business_id":"aghOCY7m-I_8tNA9FnRcjg","stars":5,"date":"2015-12-15","text":"The foods are really nice. The place is cery clean and modern. Would recommend thus food to anyone and any age. Good jo Chiam!","useful":0,"funny":0,"cool":0},
{"review_id":"5OUpDez5qRSujlP6wGhI9g","user_id":"gJer6bBX5hgawttXyXWGtA","business_id":"EpEzNNt6ynLRyae2pyvEqg","stars":5,"date":"2013-04-05","text":"The service was fantastic. The job was done in a timely manner and I was happy with the work done.  I would visit this place again if I have to. I like that the staff was very friendly and was very helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"B2NhDE4rWECLfv-dZDWmZA","user_id":"hq8OJ7owwbTUaFJHhJ5e-A","business_id":"izOgTz2GgHABbK42C97wNw","stars":1,"date":"2016-04-29","text":"Let me start by saying that I have been a customer at AOK! for about 5 years.  I enjoy the classes offered, there is a great variety and they staff\/teachers are friendly. After 5 years, you would think that my business would be appreciated.  Nope.  I purchased a package in January of 2016 - it was access to all classes (Zumba, TRX, Barre, Ride, etc.) for $199 for four months.  The policy known at the gym is once you start your package that it starts calculating your time that day.  Well....what if someone at check in made a mistake and inadvertently signed you in for a class you never took?  Well, that happened to me.  I messaged today to check and see if everything was ok with starting my package and was informed I only have 18 days left.  I have never used this package!!! I had surgery at the time they say I used the package - not possible!  After several e-mails with one of the owners, Kim, she was not willing to hear me out and accused me of being \"one of many who purchase packages and never use them\".  Let me tell you, I work HARD for my money and am not just going to throw around $199.  I am so disappointed to have been treated this way.  Even if they did make this right, I am so upset and displeased I am not sure I would even want to go back.  Very sad AOK.","useful":4,"funny":0,"cool":0},
{"review_id":"umSypviy8yXULPUf-93ERw","user_id":"0oaZN56uubTvtFve5D1okQ","business_id":"vEoha9eFCAP3AikuOmSusA","stars":5,"date":"2013-11-26","text":"Was on vacation in Scottsdale, looking for the perfect gift.  I stumbled upon Gotta Have It! and wanted to buy everything in the store.  Not only was their merchandise adorable, the customer service was exceptional and the prices affordable.  I highly recommend this store for anyone looking for a cute piece of jewelry, clothing, handbag, or knick knack.  My favorite item was the reading glasses with the lights on the frames.  Who doesn't need those when reading a menu in a dark restaurant?  Definitely stop by this store in Scottsdale and\/or Phoenix!","useful":0,"funny":0,"cool":0},
{"review_id":"jJfqespkC0XW1jDmXWv1MQ","user_id":"haEnbnT5g07jo5akpa8myQ","business_id":"M4RwZL5bTBTwwbVcoaDbtw","stars":5,"date":"2017-10-26","text":"What a great find!  We were touring The Christmas Story House next door... we were getting back on the road, so needed lunch.  WOW...pierogi... hadn't had this since I was a kid in Ohio.  Our food was home made AND SO good.  This is a clean, friendly and fun place.  Great neighborhood vintage pub!!!","useful":0,"funny":0,"cool":0},
{"review_id":"rWQLUPK1ijoI9DEuLNZl5g","user_id":"haEnbnT5g07jo5akpa8myQ","business_id":"cJWbbvGmyhFiBpG_5hf5LA","stars":4,"date":"2017-04-27","text":"We had such a great time!! The good is very good..kinda wished the potato saLad was warm, but it was good.  The entree's we ordered  were great, beer good and cold...music was live and lots of fun.  Our waitress was sweet and efficient...AND VALET PARKING!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"Y7b1lY9oHrHCdR_fSwODOg","user_id":"1wukwqNH4iz2IHfT51-oyg","business_id":"e9sB72njxz87r5TL6kG-Fw","stars":4,"date":"2014-10-31","text":"The food and service was amazing!  You will be hard to fine a better whiskey special downtown.  Will definitely be coming back here.","useful":0,"funny":0,"cool":0},
{"review_id":"JhdZNzoD3N1C75YcHLUP4w","user_id":"1wukwqNH4iz2IHfT51-oyg","business_id":"l_kefVF1frmC0xRW2YkvUA","stars":4,"date":"2014-10-31","text":"Had a VIP evening here for night 1 of my Brother in-law's bachelor weekend.  The service was good and there a was a real party atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"ZUkm-yvyFd_ooReAfn8SiA","user_id":"0C9s351Ea7J2wS6KVSgbgQ","business_id":"EryvpcMxoaOr_BnQVMqQIg","stars":5,"date":"2015-01-24","text":"This place is just too good. The cheese enchiladas are amazing! The rest of my family loves it too anything from shrimp tacos to veggie burritos everything is delicious. I'm so glad I discovered this place with my cousin a couple weeks ago!","useful":0,"funny":0,"cool":0},
{"review_id":"l6i_1PynyKA3_2d8DkxYhg","user_id":"6jHx19hQiK3ngIdKjgynbQ","business_id":"8lB2DlGAMJv6P2XS_AYxMw","stars":4,"date":"2017-10-15","text":"Niku Soba Ramen...my favorite but daughter loved the Char Siu Ramen. Nice modern ramen house decor. Will definitely return. Great location, too.","useful":0,"funny":0,"cool":0},
{"review_id":"0AUzieA0SwJEf1s_ti9eZw","user_id":"6jHx19hQiK3ngIdKjgynbQ","business_id":"lG759ODx7tj6wbS7rYip1g","stars":1,"date":"2017-11-02","text":"1 star for the poor service.  The one woman running the front of the house lacked customer service skills.  She was not pleasant at all. Food was mediocre and was served without serving utensils. When we requested serving utensils the woman was displeased that we even asked for them. The only time she somewhat cracked a smile, if it was even a smile, was when I asked for the check. There are definitely much better Thai places in town. Not coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"7FQfqf3hFNNz3COgwurWAQ","user_id":"88UNV_UljSiUc2ZuhR9IYA","business_id":"-QjnuSMIAJhcwOc-8BqalA","stars":1,"date":"2015-11-12","text":"This was a terrible meal. The Case Western chicken barbecue melt: Texas toast bread soaked in fake butter and toasted with barely 2 tablespoons of shredded BBQ chicken on it and some melted cheese. The barbecue flavor was too sweet. The french fries that came with it were mushy. The tomato soup tasted like it was made with ketchup. All that in a metallic, cold cafeteria style environment made it just plain inedible. This soup and sandwich plus a mound of soggy fries, with only water, cost $16!","useful":0,"funny":0,"cool":0},
{"review_id":"KsTeqGd4AFhLBKi7YpYXtg","user_id":"MyCoA4-Xz2UWePanW-8h-A","business_id":"xYonRlhqbwdHLhPs1PLdCg","stars":1,"date":"2017-04-15","text":"The worst place I've ever been. The owner is so rude to the people and the food looks shitty. One of my friend found a dead cockroach inside her dish too. I'll never going to this shitty Indian place again. Please don't go there for gods of sake!","useful":0,"funny":0,"cool":0},
{"review_id":"zMT8uBuZYuCljqA2CcHnKA","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"aeXwUDNI4e7NRQpRpHN-Rw","stars":5,"date":"2017-08-07","text":"In my last review I was not thrilled with the service. I guess someone noticed. We've been back several times in the last couple of months and now the service is very good. We have also tried several more of their food creations and they are all delicious and nicely presented. They have a special summer menu offering some terrific salads and beverages. Also, their filtered coffee is some of the best in the city, served with a small biscuit drizzled with chocolate on the side!","useful":0,"funny":0,"cool":0},
{"review_id":"sSxPDKSaWGKE6uiW-Ga0oQ","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"Tploz4rpAFAdUIBwePkZ5A","stars":1,"date":"2015-05-30","text":"We used to frequent this location frequently but It's been over a year since we we're last here. You can't imagine how disappointed we were. Service was almost non-existent. During the time we were there, three diners from the terrace had to come inside to get the waitress to come to their tables. Other than to take our order and bring our food, the waitress never visited our table. The coffee was hot, but pretty much tasteless, so the fact that we were never offered a refill wasn't a problem. The omelette was a bit runny, but otherwise acceptable. My wife had a breakfast sandwich which was pretty good. With so many other choices in the city, we won't be returning.","useful":0,"funny":0,"cool":0},
{"review_id":"ldOUVjXjFWXfP_1UMgYuOA","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"CqKa_LEbFfhwCVCmcn1Q4g","stars":1,"date":"2014-06-30","text":"My wife and I eat out often and like to try one or two new places each week. This was the worst service we had experienced in years. The restaurant was not busy when we arrived. We asked to sit on the terrace and were told to go ahead and pick a table. About 5 minutes after sitting down, a busboy brought us water. We waited at least another ten minutes before the waiter showed up, and asked if we were ready to order. No one ever offered to take a drink order. We ordered a pizza and salad. The pizza was brought out by a \"runner\" who placed it on the table and left. That was the last time anyone came to our table, or any other table near us, for the next half hour, The waiter finally showed up and, noticing our empty plates, apologized for forgetting our salad. We asked for the bill, he brought it, and then disappeared again. Fifteen minutes later we left, leaving exact change in the folder.\nThe pizza was okay, nothing special. Prices are a little high, but not unreasonable. There are many many better places for pizza and Italian food in Montreal. We will not return to Geppetto's.","useful":3,"funny":0,"cool":2},
{"review_id":"KvNyG6jak4AZH6sGM_ImGw","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"58APdML-PG_OD4El2ePTvw","stars":5,"date":"2015-08-30","text":"Love this place. The breakfasts and brunches are original and delicious, and the coffee excellent. Service is fast friendly and attentive. The one downside is that you often have to wait for a table, especially if you want to sit outside. It's well worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"k9DG52om7OKLZp_cCY_LmA","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"AqUGDt9A3NLkBX-cKI2MNw","stars":5,"date":"2016-06-29","text":"My wife and I recently purchased new bicycles here. We spoke to several staff members about the various bikes and accessories we were interested in. They were all friendly, knowledgable and took the time to explain everything and make recommendations. When we picked up our bikes, once again they took all the time needed to make sure everything was in good order and adjusted to fit us properly. We highly recommend ABC Cycles.","useful":1,"funny":0,"cool":2},
{"review_id":"1AtsJyfpCw0_T5oW5P8ieA","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"ey9c-TjWXgTJ5OlD0HPd_A","stars":5,"date":"2015-05-30","text":"What a pleasant experience! Service was friendly and attentive. There were 6 of us and everyone tried a different waffle. They were all delicious. The juices and coffee are fresh and tasty. We even brought home a few treats for later... Also delicious. The prices are quite reasonable too. If you're in the mood for a great waffle, with a tasty difference this is the place!","useful":0,"funny":0,"cool":0},
{"review_id":"uengA8BYodJ_sn9f-A6ovw","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"VqT-IURXmVS_fVRLTKxTFQ","stars":5,"date":"2014-06-30","text":"Stopped by for Sunday brunch.  Both the food and service were excellent.  We were seated as soon as we arrived and for the entire meal the service was fast. Our waiter was friendly, attentive, and answered all our questions. The menu is full of choices, so we will have to return again and again. Our crepe was very good and came with an \"appetizer\" of fruit and chocolate dip... a nice touch.  The granola with fruit, yogurt and chocolate drizzle was also very tasty. We highly recommend Cacao 70, but time your visit carefully, it can get very busy.","useful":1,"funny":0,"cool":0},
{"review_id":"9zqmCj5GEHqD26S91bsgzw","user_id":"3zoERc1HMSfMEEkkqBgNiw","business_id":"nspY01_h-1uiGFjF1gmpew","stars":1,"date":"2015-08-30","text":"I wish we had read the reviews before coming here. It was the worst breakfast we've ever had in a restaurant (we go out almost every day for breakfast), and 1 star is really more than they deserve. I understand they are in a tourist area, but prices are close to what you'd pay at a fancy downtown hotel: 2 eggs, toast and coffee came to $16.49 per person plus tax and tip. It's hard to screw up a fried egg, but they did. Over easy came out with crunchy brown edges and hard yolks. The bacon was tough, and the coffee, passable at best. Service was pretty much non-existent. Don't waste your time and money here, there are much better alternatives in the area.","useful":0,"funny":0,"cool":0},
{"review_id":"lWXjKcU8PDRaq4tzvC589A","user_id":"Xx3iJroZkAMJq593-cCJxQ","business_id":"-jfUzBSkFc4bxTOoi2BViA","stars":1,"date":"2014-05-21","text":"I've purchased their downpipe for my 2013 civic si. However, downpipe doesn't fit properly it is hitting a bottom of my car causing very loud rattling\/vibration, horrible sound . I did some research, and I found  that all 4 doors civic si 9th gen have the same issue. Jeremy from full race, with the biggest attitude (worst customer service ever experienced) was trying to tell me to buy a new mount for the engine and that that would solve the problem. I tried to explain that other downpipe brands, like ultimate racing, don't have the issue and that their merchandise is faulty. Very disappointed!!! I'm selling the downpipe and buying different  brand.","useful":0,"funny":1,"cool":2},
{"review_id":"pB6Kjv0IpJXYIMQBrsNTZA","user_id":"arordpa8sZ43yGRNG1Vzxg","business_id":"q2kpGK7pcYR8uAYNaqFFog","stars":1,"date":"2016-12-05","text":"I purchased my flooring from Home Depot. Western State flooring is Home Depot's installer which to this day I am wondering how and why. The entire experience was disastrous.Home Depot requires that the materials be in your home prior to scheduling an install. Western State was super busy which meant the flooring and supplies sat in my apartment for a month prior to the install. Not their fault but still annoying. Home Depot would not provide any timeline related details prior to making the purchase- now I know why. The install was scheduled and I made sure to take the day off of work to facilitate. I live in a high rise and had to make sure I was there to let the guys in and out of the building. Well, the evening before the install, at 4:58 (they close at 5), I got a call from Western State. They had to cancel and needed to rebook for the next week. I was super frustrated- I had taken the day off of work and they waited until literally the last minute to call and cancel. Whatever. I rebooked for the following week with the contingency that I would not have to miss work. The manager said not a problem-the installers would be there at 7 am. This gave me enough time to pass my keys off and make it to work on time. Great. The day of the install 7, 8 and 9 am pass. No call from Western State. I for sure thought I was being punked or somebody had placed some flooring curse on me. When I called and asked what was happening the gal told me \"your installer had to drop something off at his dad's\". WHAT. I don't even know what to say about that. At 9:30 two young guys show up and immediately one of them asks how much I pay for rent. Inappropriate. Then they get up to my apt, knock on the floors and long story short decide they can't do the install after all. I have a synthetic concrete which apparently is a liability. I received my flooring materials in July, late September Western State tells me they can't complete the install. I ended up calling another local flooring install company, they sent someone out the same day and finished the job and I saved a few hundred bucks! Do yourself a favor and never use western state flooring unless you enjoy being terribly inconvenienced for months.","useful":6,"funny":1,"cool":1},
{"review_id":"1x3SA_GrqZHTRXi9Ucua8Q","user_id":"hF2i5vSqTcnbxJr6ODEUTw","business_id":"D1MI5G3jUw5CYEOleIPnMA","stars":1,"date":"2013-03-10","text":"Went here for a friends birthday and was completely appalled with this place. Our bottle service girl was horrible, each time she brought our juice canters shed drop one or a couple of our drinks and just walk away! I asked her to bring some napkins for us and she came and handed me the napkins as I was dancing with the birthday girl instead of putting them on the table. Also they basically give you half a booth you share half with someone else. Also my fiancé wanted to have a cigarette was told smoking was outside where the lineup is and was then told they weren't letting anyone out very annoying especially when the bouncer he asked inside was smoking in the corner inside the club. Music was okay, it was a very young crowd. This place is basically just a cash grab for young kids. Regular cover without comps is 20$, dont know how they charge this and get away with it, you couldn't even pay me to go back in this place. If you like the teen dances by all means come to this place!","useful":3,"funny":2,"cool":0},
{"review_id":"SHCxOUp-WJ80Bfqeun0KEw","user_id":"hF2i5vSqTcnbxJr6ODEUTw","business_id":"NPbc4tEKROH45GrIfWlYhg","stars":5,"date":"2013-11-16","text":"Amazing! I've been to many tanning salons and this has been the best experience the beds are amazing! They give off the best color! 5 star +++++ experience!","useful":4,"funny":0,"cool":1},
{"review_id":"5dRMeflyV_5W4p_QLqcDxQ","user_id":"hF2i5vSqTcnbxJr6ODEUTw","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":3,"date":"2015-08-31","text":"Good pad tai but asking to simply add basil into the chicken pas tai was not able to be done....","useful":1,"funny":0,"cool":0},
{"review_id":"DpkyhKtEweUYkqJhfpyLiQ","user_id":"0rWET8ihzKS6-83MaYDP0A","business_id":"mIdAnF5MjGXlu8K51w4QwA","stars":1,"date":"2015-12-18","text":"Dirty, run down bus that smelled like vomit. We have used these guys for 9 years but will look elsewhere now. This year we went on a Christmas light tour with friends and family on a route we planned. At the end the driver was upset that he did not get a large enough tip (we figure he received $70-80) and suggested his boss, James would get upset if we didn't give him more. In fact, he sat in front of the house blocking my guests from leaving until I would go out and pay him more. Once he saw I was very upset and I educated him on how tips work he left. Not a good experience and unacceptable in front of our guests in what should have been a joyful time.","useful":1,"funny":0,"cool":0},
{"review_id":"2hpMtzRTIdWiOrQhJDuM7g","user_id":"NhGyfwWU0f3TMnxjQ8AT4g","business_id":"FudpYlLuoqeetWX6UCt3PQ","stars":4,"date":"2014-06-25","text":"Absolutely love this place me and my boyfriend are regulars heres after trying it. They also deliver and have pickup if you don't feel like dining in which is great with a busy schedule. The peanut delight is alway a great go to my personal favorite is the panang chicken curry. Lots of options for if you are vegetarian or if you eat meat.","useful":0,"funny":0,"cool":0},
{"review_id":"5iD2VJYF1t8c_jjK588hYQ","user_id":"NhGyfwWU0f3TMnxjQ8AT4g","business_id":"wsmVIHJEi9J_38dXx2qLKA","stars":5,"date":"2014-07-04","text":"Was craving some Mediterranean food and had heard some good things about Bunky's  . What I had heard was definitely correct. I went with my boyfriend he got the lamb kabob and i got the chicken plate. We both got the lentil soup. The server was very friendly even when my boyfriend knocked over his water.\n\nThe lentil soup had really good flavor and was a great start to the meal. Our main dishes were awesome the chicken was flavorful and had really good seasoning. The bite i had of lamb was also very good my boyfriend wished it was a little more on the medium side but everyone has there own preference. Veggies on the plate had a great grill on them. Overall it was a great meal we will definitely be back again.","useful":0,"funny":0,"cool":0},
{"review_id":"oSR8NFBNWOYkhZpsIWlrhg","user_id":"WYcuRyWUWlmFZN7EhAMUHA","business_id":"7q7qaGPUUCqMljdIGwzvFQ","stars":1,"date":"2015-08-17","text":"Food was terrible. 3 of us ordered eggs Benedict, one ordered a skillet and all was over cooked. Should have been clued in by the fact the whole place smelled like burned toast. We sent plates back, and they got one egg out of 4 poached correctly. Nothing was fresh, all processed or frozen. It was 10am on a Monday, so the place wasn't busy, but service was very slow. Service wasn't the worst, but also not even as good as mediocre. So if you like your breakfast to taste like it came from a can, then this is your place. I will not be coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"9ansqbW2m3r9JlnlGtUqWg","user_id":"4C2NpDb2mobu0UtCdNB5RA","business_id":"9wjTzw8bEYOTQJk41V8WQw","stars":1,"date":"2012-06-06","text":"You get what you pay for... and in this case, I wish I paid more somewhere else! I ended up staying one night here because I didn't want to be duped by Memorial Day Weekend prices.\n\nThe rooms look like a motel and are outdated. In all honesty, if you just need a place to sleep and wash up (and not spend time in the room admiring the amenities), this would be an \"okay\" option.\n\nThe worst thing are the rooms by the pool (which I had) because for some reason, there is a damn pool party all day, everyday. So, if you are trying to take a mid-day nap to sober up or rest up for a night of fun... THINK AGAIN. You are going to be up and annoyed at the party people at the pool, the children at the pool, or the DJ who plays bad music. I swear the pool party noise starts at 11 AM and doesn't end until 6 PM! SO. ANNOYING.\n\nThank goodness I moved to Caesars Palace the next day. As someone told me, I went from a brokedown (Imperial) palace to the \"better\" (Caesars) palace!","useful":6,"funny":6,"cool":1},
{"review_id":"jPx8aztM2RWxrGVe67vgqA","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"QgBZFQzHJ74pjYzDE3uRnQ","stars":2,"date":"2014-04-04","text":"While it is hit or moss with the masseuse you get, and this isn't a review of them per say (although they did range from one star to three at best- and then when booking the second appointment with the good one they talk your ear off because they're soooo bored), the whole experience is definitely lackluster. Massage Envy is the Supercuts  of the massage world. Really. I got lured into  their \"39$ a massage deal\" like many others have before. Well...then you can't cancel unless it's in writing 30 days prior, and can't use the massages past the date of cancelation. The last 30 days of my membership I was cramming massages in left and right, but the whole experience is the opposite of relaxing, so those 20 days were just more stressful than anything else. I waited two months, saved up my money and went to Desert Song, where for a little more but no contract you can get a genuine massage. One with a person who is clued into what you need, experienced, and actually makes you feel better.","useful":2,"funny":0,"cool":0},
{"review_id":"UJICiPFR0ncNEtD9_FoHEg","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"XMMLRvV4IMxIGyc4H37LxA","stars":2,"date":"2014-03-27","text":"This place is not good for vegetarians and don't really seem to want to work with you to make anything a healthy vegetarian option that's also tasty.  Beware! Most of their noodle dishes have fish sauce, chicken stock or the like. The server seemed annoyed that I even asked, and also said it wouldn't be possible to have a veggie protein in a salad. Their seitan was one note: salty. Better to try seasons 52 next door, which at least has some flavorful vegetarian options.","useful":1,"funny":0,"cool":0},
{"review_id":"4XqBBhDzaDR_u7eTreZEHw","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"57Ot-sRTzL925ipv-5SzTg","stars":4,"date":"2009-07-20","text":"I love amsterdam!  Nothing is better than the Sunday night Karaoke and the $5 martinis and manicures on Mondays.  It can definately get very crowded on the weekends so be prepared to wait for a drink.  Oh and Sam Adams Cheery Wheat is on tap.","useful":1,"funny":0,"cool":0},
{"review_id":"8gmQRrvts3c80wNkO1emxQ","user_id":"vm6FWtfCglIH06imL1m2wQ","business_id":"eZQbDYQTZk0_cBroVxnPWg","stars":5,"date":"2013-09-17","text":"I love this place! The delivery is fast and the food is delicious.  The delivery driver cracks me up! He can never seem to find our house even though he's been here a bunch of times, it's hilarious!\nI usually order the mu shu...get it! I'm a vegetarian so I add tofu to it, no problem. I also love their mixed vegetable and family style bean curd. They never have a problem altering things for me, and delivery is awesome! Get Sui Wok tonight!","useful":2,"funny":1,"cool":0}]