[{"review_id":"GmbjPsHLoBOBySl4nc0sKg","user_id":"Vcyw3p27F57xhHvJ-mjZYA","business_id":"oE6gKgUfMd74m77d6hG9qg","stars":5,"date":"2017-07-31","text":"This is the best tamales! they have a variety of different flavors- and they're all delicious. The one that I always get is the pork, it's mild and it's delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"3774lrTHUTF0KaQy3HCqYg","user_id":"7Jr3La0va81tnuiHjZ_fOw","business_id":"wcLX8aToZJF4AR-qkpI2Ag","stars":4,"date":"2011-10-18","text":"I booked them over the phone (which was a breeze) and I was told I'd get an email confirmation (which I didn't), but they were they were on time and ready to go.  \n\nOur driver was very accommodating, he took my whole wedding party and photographers to the LV sign, Downtown and reception venue in a 2 hour span.  There was plenty of champagne, but we were so parched that the bottles of water went fast and the limo felt like a sauna even with the A\/C going (it was mid-August with temps reaching 107 degrees)","useful":0,"funny":0,"cool":0},
{"review_id":"Vw5CeyY1LYBlEjFC9LPpyw","user_id":"7Jr3La0va81tnuiHjZ_fOw","business_id":"7dwz8CKjFDRDW5pUccfgpg","stars":5,"date":"2011-10-18","text":"I found them through my reception vendor list and we're so happy with our DJ Lantz.  He was so  nice and on top of things. We changed the Father Daughter song just before it was time, we flopped back and forth on doing a money dance and my dad decided to give an impromptu speech that had the whole room crying, but Lantz rolled with it and kept the party going.","useful":1,"funny":0,"cool":0},
{"review_id":"HiCs4sk3wUC-QfMpbib9-Q","user_id":"7Jr3La0va81tnuiHjZ_fOw","business_id":"zTIIK7Y3uLYWDFIxnnipIA","stars":5,"date":"2011-10-04","text":"I was referred to Deacon by my make-up artist an 1hr & 30min before my wedding ceremony.  I had just found out the photographer I booked was out of town and I was frantic.  \n\nDeacon swooped in to the rescue and he and Sarah were absolutely amazing!  My husband and I are a bit camera shy, but you wouldn't be able to tell from the pictures.  They captured us looking so relaxed and in love - we definitely have photos we can be proud of, look back on and treasure!","useful":1,"funny":0,"cool":0},
{"review_id":"H5iDKP2vOZI79FfIyIkApg","user_id":"7Jr3La0va81tnuiHjZ_fOw","business_id":"QN1IDeP8Bm7chYQ4kRCigA","stars":1,"date":"2011-10-26","text":"A NO-SHOW ON MY WEDDING DAY!\n\nThe day before my wedding, I attempted to verify call time & location & didn't get a response.  It wasn't until 2 hrs before the ceremony I was FINALLY able to get a hold of Todd Wilson.  Apparently there was a \"scheduling error\" & he was out of state. At first he was very unapologetic & didn't even offer a replacement (but eventually had one call me 30 mins too late because during that time, I had not choice but to find another photographer w\/ such short notice & ended up paying 2x as much as intended for 8hrs instead of 10hrs & no professional set up photos).\n\nI got my deposit back a month later (after a number of emails & phone calls) & now I'm forced to file a case against them for the overage I incurred (I've tried working the situation out with him, but he is no longer returning my emails & likely wishing I would just GO AWAY)","useful":4,"funny":0,"cool":0},
{"review_id":"wI8ojxQ8vr0r19JeyE7mfQ","user_id":"7Jr3La0va81tnuiHjZ_fOw","business_id":"dM8Yp8StA1NdusK5Ta_j-g","stars":5,"date":"2011-10-04","text":"SCRUM-DIDDLY-UMPTIOUS!!\n\nI used them for my wedding reception.  Being from out of state, never having been to Retro prior or ever tasting their products, I booked a cupcake tower with a 6 inch cake on top, based on the delicious sounding cupcakes from their site.\n\nThey were so easy to deal with and we were so delighted with how everything turned out.  The cake flavor we chose was PUCKER UP (my favorite - I've been searching for a similar substitute locally ever since) and we chose 3 flavors for the 70 cupcakes we ordered - VANILLA LOVES VANILLA, MINT CHOCOLATE CHIP & RED CARPET. \n\nThe guests raved about how delish everything was!  And the day after, the husband and I went to the shop (that smelled AH-Mazing!) and ordered a couple more cupcakes for ourselves.  I do plan on making Retro Bakery a necessary destination stop whenever we're in town.","useful":2,"funny":1,"cool":1},
{"review_id":"QxD_nf5BVkqXOeWG8VGEgQ","user_id":"zvsx526yJDhl-ckbz7B97w","business_id":"LAKs5UatFvOhlaF4sZ1obA","stars":2,"date":"2017-02-08","text":"The food is not the greatest and they really need quality training in customer service! I found hair in my food and when I called to report it for a refund, I was asked how long the hair was! And then I was told I will not be given a full refund...I will not be returning!","useful":1,"funny":0,"cool":0},
{"review_id":"cVT-6BbyHf7erSyMpYAeSw","user_id":"xqAzj2bkLfp5VlmcXcFYWQ","business_id":"TVbVii4EUQt9DG7y698zIw","stars":1,"date":"2016-07-31","text":"I would not recommend this place at all. I've only eaten there for breakfast and do not plan to find out if the other meals are any better. It is way over-priced and the service was poor.","useful":0,"funny":0,"cool":0},
{"review_id":"EgeJVEWLV4_yG5mxRKfh6A","user_id":"QoXvCLhWS58x_HSJ5T0J2A","business_id":"nG28kqPcAGDgFmnyzfEWXA","stars":5,"date":"2016-06-06","text":"The Pavilions @ Providence Apartments have treated me very well. They have great customer service and have worked with me in time of need. The maintenance staff are very good - quick, fast, and efficient. Things have been improving every year. I'm satisfied.","useful":0,"funny":0,"cool":0},
{"review_id":"iH-ZtToCfhOd6WEAtsnR9Q","user_id":"WkoBdiMimJQoQuFWRlTfHw","business_id":"_ZKsdEkQ5K_CUSBtahjFAA","stars":1,"date":"2013-08-18","text":"Hands down the worst breakfast I've ever eaten. Bacon over cooked, potatoes under cooked, fruit plate I wouldn't even eat and an English muffin that was as hard as a hockey puck. The only good thing was the eggs and fresh orange juice.","useful":2,"funny":0,"cool":0},
{"review_id":"cRHQyhqTv1LyEGi2bf2UOw","user_id":"pi-_rDWRKdTZ-f6agGs0ig","business_id":"FtSK1DUovXDJgvK10iuKiw","stars":1,"date":"2013-04-10","text":"Gary promised to supervise our move. He was not there.\nWe had a large display case that two large panels of glass were broken on.\nIt was dropped in front of my husband.\nWe called Gary and he told us he would pay for damages.\nWe moved the end of Jan. We arrived in Hawaii on Feb 11. Gary has been contacted by email, certified letter and phone calls. We sent him invoice of the work. He owes us $536.07 and had not paid it. April 10,2013. They talk a good talk but do not walk the walk.","useful":1,"funny":0,"cool":0},
{"review_id":"J1bDqccMjFxAhtg28uJy0w","user_id":"Amk_2ev7c3nmRwsYOl2htA","business_id":"ydj6cSmcOM_jVYJLkHzdOA","stars":2,"date":"2016-09-05","text":"Dropped in here with a couple friends for a quick bite and a few drinks, but came away wondering how these folks expect to survive.\n\nOur visit went downhill almost immediately when the lone server ignored us for a good 15-20 minutes, despite our best efforts to get his attention. We didn't bother with the food. It's almost as if they don't want you to order it anyway. There is no food or drink menu .... or chalkboard with items listed ... or pretty much anything else designed to illuminate the culinary options. If you're hungry, be prepared to pepper the server with questions. And while there is a fridge full of appetizing craft beer, and several offerings on tap, we left after one drink. Thank God the Wren is only a block away.","useful":3,"funny":0,"cool":0},
{"review_id":"kXlZFmHT0trlLKNwE7FZLQ","user_id":"Amk_2ev7c3nmRwsYOl2htA","business_id":"ngpwNIImAFfEl1wzaDDWGA","stars":4,"date":"2016-09-06","text":"This is a very nice addition to this stretch of Gerrard ... Large open and inviting space space with nice decor and laid back atmosphere. Place was packed with families and couples. Our server was amazing in helping us figure out which pizzas to order, which were both amazing. And the price was below what we expected.","useful":0,"funny":0,"cool":0},
{"review_id":"NE3T9OiaSEqAjSJGLYpqvw","user_id":"TYRJ0l8BJQZyExcqXObrSQ","business_id":"RyupMPEgqaIW2abzMw2TLw","stars":1,"date":"2017-07-17","text":"The rudest experience as a customer I have ever experienced. I went in to by a cowboy hat as remembrance of my trip. Ya kind of touristy  was told I was a wannabe. I gave the clerk the opportunity to be less rude saying you you got to admit I look good in it. Her reply was still a wannabe. Straight face no smile. I thought am I really hearing this. Is this how you treat paying customers? Came back and returned the hat. No apologies. All i gotta say wow.","useful":0,"funny":0,"cool":0},
{"review_id":"k75omF3Yl5fWchZkZWJnbw","user_id":"vD0BzSh55cboObQE4e2XSA","business_id":"YSYDJTCt5kzY2kKnLNGRiA","stars":5,"date":"2017-09-01","text":"Sol in Scottsdale Quarter is consistently excellent.  The waitstaff are all very nice, but our favorites are three brothers who work there--Israel, Rodrigo, and Armando.  (If you go for brunch, they're usually there. ) . They remember the drinks we like, are super fun and nice to our 3 children, and are all around happy people.  The food is great!  Our favorites are the crab stack appetizer (amazing crab meat with spices, mango, jalapeno, and avocado with a lemon avocado oil), the wet carnitas burrito (really, it's a GREAT burrito!), and the quinoa is an unusual and sophisticated side with interesting flavors.  The short ribs barbacoa are a great GF option. \n Our kids (one of whom is a VERY picky eater) like everything they've tried, and Sol has no problem splitting an adult meal between kids.  As for the TEQUILA, it's a great selection if you're an aficionado, and upscaled everyday margs if you're not.  I love the frozen margarita with fresh muddled berries (they have all kinds).  All drinks are made from scratch and to order, but it's worth the short wait.  If you love mimosas, ask for the FroMo, which is orange juice and prosecco, mixed with frozen margarita.....DELICIOUS and yummy at any meal!  Brunch is served Sat\/Sun, and it's a lovely menu all on its own, although you can order from the regular menu as well.  This is one of our favorite restaurants, for guests, date night, family dinner......all of it.","useful":1,"funny":0,"cool":0},
{"review_id":"mwt4gN9H2Dr6WOvFfvgMFA","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"QDQM2DH2gKGig8LJ3LiFiA","stars":1,"date":"2016-12-17","text":"Staff was unfriendly, was not busy just four or so people sitting at tables. And three workers behind the counter.\nOrdered my usual Iced tea, was so cloudy it looked like you needed a spoon to eat it and it tasted so sour I ended up just throwing it away.","useful":0,"funny":0,"cool":0},
{"review_id":"OCESL-0jQKFzjd2oF9Wgow","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"YKQtYkJy7YqxcI35CzQmQA","stars":1,"date":"2014-02-17","text":"This place needs help in the customer service department for sure! The associates are rude. On top of that,  no matter  what time of day you go in they have a VERY, VERY limited selection of donuts, very disappointing for the kids!","useful":2,"funny":0,"cool":0},
{"review_id":"7H7nyUj7QHSRW2qTvbK32g","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"uuxiWohekdxlN3GmA5fl3A","stars":1,"date":"2012-06-24","text":"Had to stop going to this location because they always got my order wrong. Not only that the drink I do get on a regular bases tastes bad, I dont know what they do it. Now I avoid this location and just walk into theTarget Starbucks","useful":0,"funny":0,"cool":0},
{"review_id":"yZqP-_K-u1YBeBcbUnJ0CA","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"ljLq8ZTLO52rzwsEeaWZKg","stars":4,"date":"2017-07-11","text":"Great little place, kids favorite! The cheesesteak is awesome. \nSeating is limited, can be tricky on the weekends but worth it","useful":0,"funny":0,"cool":0},
{"review_id":"pK743GX7XmVengO5lvzvyw","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"UDeZM2rXeubCOKKbQ4bm7w","stars":1,"date":"2014-07-22","text":"This one has never been the place to go if you want to experience good customer service, but its the closest to us and unfortunately the kids like it. \nBut our trip yesterday but a end to it. We took the kids and after a painful ordering time with a very rude cashier we go to find a nice big hair in our cheeseburger (and defiantly wasn't one of ours) we took the uneaten cheeseburger to the manager which she didn't even apologize for it, in fact she didn't say anything until my husband ask if we can get the money back for the cheeseburger and she then said yes.","useful":1,"funny":0,"cool":0},
{"review_id":"TO5mIItngH2uZZen_aoyXA","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"6syNyecOEcdrp1Q7gv4XhQ","stars":1,"date":"2015-12-24","text":"Stop by for a quick dinner last night even though I have not heard good things about Panera, we thought we would give it a try. My husband and I got and steak and cheese panini, kids got a ham and cheese and the husband also got a soup. The kids sandwhichs were just ok (how can you go wrong with plain ham) which helped them get the one star, and I will say also that the employees were very friendly. However, my husband and I sandwhichs were inedible. The meat was so tuff you could not bite through it, I ended up just throwing mine away.\nI have heard that all Paradise Bakery's will eventually switch over to Panera which makes me very sad because it is definitely not the same!!","useful":0,"funny":0,"cool":0},
{"review_id":"jOQoSMw6mGNxHB70bLqDkQ","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"YyVeZdwsjkMnys0eHNnfUg","stars":2,"date":"2012-06-28","text":"I went with a level 2 stylist, big mistake. My cut was alot shorter than what I asked for, which isn't to big of a deal but the problem was that the cut is VERY uneven.  I also had color which she struggled with. Luckly  I ended up leaving with a normal color after she said it had turned purple. Highly suggest you go with a higher level stylist!!","useful":2,"funny":0,"cool":0},
{"review_id":"TG76lj5x81__0qXTwADQPQ","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"fbbyP0hbsqRA0Jdy54AlsQ","stars":2,"date":"2017-06-04","text":"We have been going here since they open and their customer service has always been something to desire, but it seems to only be getting worse each time! \nWe have only continued to go there because the doughnuts are better than Dunkin. \nAlso they only make doughnuts first thing in the morning despite being open until 6, so unless you get there as soon as they open good luck getting ones you want. (Although they always seem to have a ton of cake doughnuts) \nAnd if you happen to go in later in the day that means they have been sitting around for awhile.","useful":0,"funny":0,"cool":0},
{"review_id":"p9oi7MeOJl5u3RHJ_k-dbA","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"yZb6xTr89Walnpr7QphcIA","stars":2,"date":"2014-01-15","text":"Dr. Tom is wonderful, at least the couple times I have been able to see her. \nThey have so many patients that you can never get a appointment with your doctor, they are booked at least 3 months out. It's about volume here.","useful":2,"funny":0,"cool":0},
{"review_id":"u_2ji-ipgMa1NLhehfi8Qg","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"dAVgrmzqBfn85zTgDP1UgQ","stars":5,"date":"2016-07-24","text":"Found this place on Yelp and thought we would try. Husband and I had the brisket, kids had pulled pork have to say we were really pleased everything was very tasty (highly recommend the cheesy potatoes.) The staff were extremely friendly and we will definitely be back. So hard to find decent places to eat in the valley, love to support local business and hope this little place makes it!\n\nUPDATE! \nWe made our second visit, I am changing my first rating of 4 stars to 5 stars! This place is probably one of the top restaurants we have been to. Staff once again was very friendly and the food was awesome!  I hope they are around for a long time!","useful":0,"funny":0,"cool":0},
{"review_id":"mYDlCtlR3O_V-JP7TGY5Nw","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"-De4AV1Fx67mDMGrFOw44Q","stars":2,"date":"2015-12-07","text":"The mall is just ok, typical mall stores. They are doing some remodeling which helps, but our biggest complaint is the only sit down restaurant is pretty much Johnny Rockets which needs a serious visit from the health department. Very sad for being the only mall on the west side.","useful":0,"funny":0,"cool":0},
{"review_id":"A26yLyHQmn9cFOiI3-3W0A","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"m63NTcEP4p43ZvXnmPuNjA","stars":1,"date":"2017-10-01","text":"We were excited to give this shop a try based on the reviews. We went in on a Sunday morning about 10:30 and there was about 4 other customers in the store. They had maybe about half a dozen doughnuts in the case. We left without any.\nI don't understand why these shops don't keep their cases stocked","useful":0,"funny":0,"cool":0},
{"review_id":"ONY-XjpBYVTHsg6yn9ooYQ","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"2_RmQxF3if15GA_S-ncJog","stars":1,"date":"2014-10-01","text":"Can't coment on the Doctors, but over a month wait to get in to see them on a half way urgent situation is crazy. Talk about patient overload.","useful":1,"funny":0,"cool":0},
{"review_id":"A3_m99s6i8MmCs2KF9mp4A","user_id":"GWu_I43fqsWLn7lfRzx9lw","business_id":"uWTTj8q4FVRkXgGHOnfVSg","stars":5,"date":"2014-07-22","text":"We love this place. Always friendly service, and we like the food better than the bigger BBQ chains. My son loves the ribs and the brisket is outstanding!\n(FYI. The food at this location is far better than the Westgate location)","useful":0,"funny":0,"cool":0},
{"review_id":"9Y6vckHxAk592UqZcCbT9A","user_id":"hFa1yzgt5jQ1oUaEpN4tWQ","business_id":"A4zLP5AyKEEHQr_dWEZKig","stars":5,"date":"2017-02-20","text":"This is probably the best Mediterranean that I have ever had. We wanted to try a conceptual restaurant on our anniversary and Cleo seemed to be a nice option. \n\nIt turned out to be awesome. There is an artsy black and white Cleopatra picture outside the restaurant. Beauty of the restaurant starts here. The interiors were fab.\n\nThe unique thing about this place is - Though its a high end restaurant, they serve decent quantity plates for reasonable prices. So you can try many dishes with no worry of shelling out lots of money. \n\nEvery dish we ordered was top notch. Chicken Tagine was the best. The rice in it was so full of favours that I might go to Vegas just to have this again. Moussakah was another gem. You got to try these both here. Hummus and Peta were so different from other Mediterranean places we have been to. \n\nThis is going to be a tradition for us to visit this place whenever we go to Vegas","useful":0,"funny":1,"cool":1},
{"review_id":"yWwxBnrp4P-BLccpYYfErQ","user_id":"hFa1yzgt5jQ1oUaEpN4tWQ","business_id":"UV2Jt8slktGu14gLZeNCjA","stars":2,"date":"2016-12-19","text":"I had been here during Thanks giving holidays. I was told that there are many Indian buffets in Vegas and a lot of varieties when compared to the place where we live SlCC, Utah.\n\nAs this was the closest and on the way to Hoover Dam, we decided to stop by here. The food was terrible and I don't remember  any dish worth mentioning here.  It was a buffet and not a single dish was tasty enough for the second serving.  The only manageable one was chicken Tikka masala.\n\nI would never go back to this place ever again !","useful":1,"funny":0,"cool":0},
{"review_id":"ClkOwSh4h6YNMieHJFZfxQ","user_id":"BlZFZJqd2sgzfZxRUG1ScQ","business_id":"vx3nrYsVvissEar4XeGRDg","stars":1,"date":"2015-07-24","text":"I love the food here and come weekly! However the service when ordering is terrible, really ruins the experience and if the food wasn't as good as it is I wouldn't come back. But after today's experience I think it will be my last.","useful":0,"funny":0,"cool":0},
{"review_id":"-ndiHH5G5rk49TkbG7h_HQ","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"YO8sWa0wYChH6DQWnE6NFg","stars":4,"date":"2014-03-28","text":"Happy busy yummy breakfast joint.  Good coffee - nice service - bustling clientelle.  Nommy Lyonnaise potatoes.  French bananas on Whole Wheat French toast.\n\nBoardgames all over the wall - just like my kitchen!","useful":0,"funny":0,"cool":0},
{"review_id":"D9dp6gj7Z_p86jo1VRVwyQ","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"JzOp695tclcNCNMuBl7oxA","stars":3,"date":"2014-03-03","text":"Line out the door.  45 minute wait on a Wednesday night.  Cramped noisy tables all with the dreaded Barstool.  \n\nSeems like a good scene if I hadn't been hiking all day.  You obviously don't go there to relax!\n\nThe beer was OK.  Their Peachy Lambic was pretty good. The food is OK.  The service was friendly.\n\nFour Peaks wins Pheonix's shortest dress award - that might be a huge draw for some!","useful":1,"funny":1,"cool":0},
{"review_id":"ks2VC7rP1OKXtR_-cFzkpw","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"MWmzRP7YYt1vufeiCwZzQw","stars":3,"date":"2014-03-29","text":"If I die before I wake, make heaven something like this store.  \n\nChocolate here that I've never seen before.  Expensive!  I am used to high prices for great chocolate - but hey- I think you gotta sell a lot of candybars to make a living...","useful":0,"funny":0,"cool":0},
{"review_id":"wRrAKZTMHtdo7l_mzcT6HQ","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"-FLnsWAa4AGEW4NgE8Fqew","stars":4,"date":"2014-03-02","text":"I wanted to dislike this place in the worst way.  The Decor and Staff, like Scottsdale in general are a little too pretty - but I was proven wrong.\n\nI had a Tuscan Omelette - Buffalo Mozzerella Cheese with Pesto, and Husband had Huevos Rancheros which was served with an insane amount of Beef on a Baked Tortilla.  It was good - Really good.  The side potatoes had nice fresh green and red peppers which was a cut above the rest of the homefry mush we'd been having all week.  Coffee - meh.\n\nOne amusing item - the \"Breakfast Cocktail\" list offered to supersize them!","useful":1,"funny":1,"cool":1},
{"review_id":"vfkFTxzZxzy6P2wlaEPZuA","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"sJNcipFYElitBrtiJx0ezQ","stars":4,"date":"2014-02-27","text":"On our Arizona Brewpub adventure, we hit the Phoenix area just after \"typical lunch\" time to sit down in Chandler and enjoy a flight of their 5 tap beers.  Space has a fun vibe, an outdoor patio with some good music * sacks of hops in the dining room and the brewing equipment right next to the bar.\n\nHusband is enjoying the hoppy selections of beer while I am pretty excited about the Bear Wallis Berliner Weisse Grapefruit.  Light but tart - instant fan here.  Oaked-n-Ordinary bitter light wood casked - was really great too.\n\nService was cheerful,  rosemary on the fries made catsup completely unnecessary   House salad with chicken - which seemed like an afterthought on the menu, was fresh and satisfying.  Burger rocked.\n\nBobby sat down with us an helped us make a plan of attack for more Phoenix.  Thanks Bobby!","useful":1,"funny":0,"cool":2},
{"review_id":"QzTlEFwRB9B1e_DAMMyWYg","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"o__g2Q64FnNc_Q4O70EhbQ","stars":4,"date":"2014-03-29","text":"Great beer.  Cherry Chocolate Stout.  This is a tasting room - but yay!  They sell potato  chips!  \n\nThey also share space with Commonplace Coffee Co. who's mean Macchiato I am hoping will allow me to keep pace for more Pittsburgh adventures.","useful":0,"funny":0,"cool":0},
{"review_id":"Xg4b3hmFfBFVnv7-uxmzRA","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"bqW0f0RigwpYyz1lbxhHlw","stars":5,"date":"2014-03-28","text":"Beer sampler flight - take the whole 10.  It is rare (unlike my husband)  that I can go through 10 different beers and go , yeah - I like that..  AND 4 beers that were so good they actually forced my eyeballs to the back of my head.  Weizen - a wheat with banana undertones, Chocolate Stout - a collaboration with a local chocolate artisan, Nut Bowl- served with sugared rim glass, flavored with yumminess and their St. Nick Reserve.  Their Penn Gold and Dark rocked - close eyes - think Octoberfest in Munich.  Even their hoppier pilsners were really well balanced.\n\nFood, service, band, locale - perfect.  The brats were wonderful.  Good chili.  Fresh salad.  Gluten Free menu offerings were clearly indicated.  \n\nIs a manager reading?  Offer cider or a Gluten Free Beer alternate as well as a GF dessert choice.\n\n I love you Penn Brewery!","useful":1,"funny":1,"cool":1},
{"review_id":"XE0_66jOuL2y9NyqCSzScg","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"LnOQxu8snN8DxMCzlFWtxQ","stars":2,"date":"2014-03-02","text":"Um, I don't think this place merits \"WORST Western\", but it was not impressive and relatively expensive for this class of hotel.  A big part of the problem stems from the room we were placed in.  Our bed was about 15 feet from Camelback Road - a very busy road and LOUD at night.  The room smelled stale and had the charm of a Prison cell.\n\nWe had a really large room - which I guess they try to make up for the proximity to the street, the construction site next door, the driveway adjacent to the other side of the room, the inoperable windows,the fact that the walls are stone - no drapes to help with acoustics (just shutters) - which makes for a great sound chamber for unmufflered motorcycles at 3 am.  The Bathroom doors were shutter type - I guess great for ventilation but hello?  privacy?  \n\nAdding to the charm, the Building lights shone right into our undraped windows, the TV had horrible sound and the shower drain was backed up.\n\nAll of the hotel room doors are \"open air\" - completely accessible to the street.  I am not necessarily creeped out about this.  Scottsdale seems pretty safe - but it couldn't have hurt with the acoustic problem.\n\nWe asked for another room.  Can't blame the staff but they didn't seem eager to please.  The guy on 4 am duty when we checked out seemed cool though.","useful":2,"funny":0,"cool":0},
{"review_id":"KDtahvZteSx1cT_T0x-VhQ","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"pBFewLcdLnf1XwPTE4jtyQ","stars":4,"date":"2014-03-02","text":"Our last stop on the Arizona Brewpub trail.  FATE did not disappoint.  It had the most interesting and varied Beers by far.\n\nStrawberry Rhubarb Berliner Weisse!  A beer that smells like cheese - which I wouldn't think would be a good thing - but what do you know..  So Good.  Try a Chocolate Chili Milk Stout for dessert. Waiter told us that they keep the beer selection pretty fresh - coming up with new ideas all the time.\n\n20 minute wait on Thursday night was OK.  Staff was friendly.  Pizza, Burgers and Salads held the standards well above average bar fare.  Kind of \"out of the way\" in a little strip mall, it was worth the trip.","useful":0,"funny":0,"cool":0},
{"review_id":"lOn52MGlwRH0x5aVBP2LkA","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"Bqz24USKl4Rpb2nfGKo1XA","stars":4,"date":"2014-03-29","text":"This is a beer sampling stop.  No food, no seats.  That said, great beer.  As usual. Lovin,' the nut brown, availb in cans.  Fresh Pot of porter - coffee tones - will keep you up at night!\n\nNewbie shop is all handmade.   They are growing local hops which is pretty cool.\n\nBring your growler or buy there to bring home and enjoy.  Good luck Hop Farms!","useful":0,"funny":0,"cool":0},
{"review_id":"gd9L3U5NWCTsos5AZG7o7Q","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"d_xS_AZ1uqO1XHY3V51qtA","stars":4,"date":"2014-03-29","text":"Order breakfast up at the Counter to the perkiest. , sweetest girl ever.   She will send you to your table with really good coffee and about 2 seconds later your steaming hot fresh breakfast arrives at your table. Vibe is totally mellow and friendly.\n\nYummy baked goods and fresh sqoozed OJ at counter.potatoes this am a little too salty and a little dry.  But overall - happy bellies.\n\nThe Strip here is a lot of fun. Old Italian meat markets meet high end chocolate and entry of Steelers t-shirts!","useful":0,"funny":0,"cool":0},
{"review_id":"Es76uuc-qm2TiTW9tcraZQ","user_id":"f0JHYn-MoQ9KP1Fjifel_Q","business_id":"VVCi2_DIeRYZ9r5fez0KIA","stars":4,"date":"2014-03-29","text":"Mighty fine beer from a new start-up.   This is a tasting room - no food, no seats but you can fill up your growler or buy one there.  The couple who runs it has whole lot of knowledge and experience under their belts.  They are working to give their Ginga beer (a ginger wheat style) more bite.  I'll return for that alone!","useful":0,"funny":0,"cool":0},
{"review_id":"hYaHYcDFUe8RjovbfGOTnA","user_id":"Ns2Aqs6VuGMau1xPk0evMw","business_id":"mTLWHF64OcZEsFJPg0_AjA","stars":5,"date":"2013-04-15","text":"Purchased a groupon for the 16 x 20 canvas and ended up also ordering another 36 x 24 canvas. Just received them and they are absolutely amazing! I would highly recommend this company.","useful":0,"funny":0,"cool":0},
{"review_id":"-L9vvkZhfQe30eFD3NFvlQ","user_id":"9REmdvlZyQDaYBt0clKHew","business_id":"f-YSIEOvEigc4oPwgb0q1w","stars":1,"date":"2014-11-02","text":"I had always had my car serviced at Freddy's or Ed Bozarth until one day (about 6 months ago) I had a flat tire I took it to this Firestone location and the woman at the counter was just super friendly and had my tire repaired an mounted on the car for  think $20. I had such a good experience that I started having my oil changes and smog checks done there as well. Last Friday 10.31.14 I stopped in to have my oil changed without an appointment, they were very busy so i decide to make an appointment, the attendant suggested to me that Sunday was their slowest day so I made an appointment for 8 am Sunday morning.\nI arrived at 8:02 am to find 5 people in front of me to drop off my keys and only one person attending to people, not a big deal they got busy, I understand. In listening to the people in front of me I realized that none of them had appointments so when I got to the counter at 8:20, just to drop off my keys I asked if what the man on Friday had told me would still be true, that I would be out of there by 9:00 AM? \nHe said that I was not on time and now there were many people in front of me. I said again I have an appointment and I WAS there on time and had been standing in line for 20 minutes and I want to make sure that I would  be in front of the people that did not have appointments?\n\nHe told me again that I was not there on time, I said I was there on time and had been standing in line for 20 minutes which he clearly knew. He then started to argue with me about what time I arrived in front of the whole room full of people, stating I was not in line when he opened the doors at 8 am, which i was not. I was there at 8:02 am.\nI again said I just wanted to make sure that since I had an appointment that my car would be serviced before those that did not bother to make and appointment. He then went on a rant a bout how whenever he has an appointment he is there on time etc. He just wanted to argue IMO.\n\nWhen I made the appointment on Friday I asked the attendant at the time what the earliest was that I could drop off the car and he told me 8 am, I didn't realize at the time that making an appointment to help them with their staff scheduling was a waste of my time and that it all depends on your place in the line before the place even opens. I then asked for my keys and said we were just going to leave. He then made a some comment about not being able to do magic. Basically a good riddance.\n\nKeep in mind all i did was ask the question, not in a confrontational way at all, I just needed to  verify that my appointment would still put me in front of the walk-ins as it should. I have since discovered that he is the manager and  that he has a history of rude and unprofessional  behavior. I took the car to Freddy's and paid more for the work which I am happy to do for good customer service. It got in at Freddy's right away.\n\nBottom line? Avoid this location unless you like abuse and very poor customer service should you be unlucky enough to get this guy. it had been about 3 months since I was last there so I don't know if this guy is new or what but my experience definitely changed.\n\nFYI, everyone else I have ever dealt with at  this location was great. I feel sorry for them working for this man.","useful":0,"funny":0,"cool":0},
{"review_id":"MwW9G0eh_btpHQV_bd-miQ","user_id":"IhXJ-gQyeMN685Lj7Ey38g","business_id":"K5KbN4lqsJKKptVbqKEWtA","stars":3,"date":"2015-12-23","text":"Personally I hate shopping (no one could tell by looking at my wardrobe) and this store is the very reason. The girls in the store profile individuals that come into the store, only helping those that look the part. I dress well I have been a Manager and a Buyer for some high end stores. I came from a spin class just showered, hat on joggers on looking for a gift for my sister. She had just graduated and wanted to get her some professional clothing as she starts her life as a adult. I had a couple of pieces in hand no one asked if I wanted to try things on (not that I did), I do not even recall someone saying Hi. I left with nothing that morning. Later that evening myself and my boyfriends went in (dress nicely as we were going for dinner later) and got the complete opposite. Spent $800 on that little girls cause the young lady helping me was so GREAT!","useful":0,"funny":0,"cool":0},
{"review_id":"YWmvExoxKRtZxa2SBNFJqw","user_id":"IhXJ-gQyeMN685Lj7Ey38g","business_id":"yzfWqQl-DFGnur2PXb9H6A","stars":5,"date":"2016-01-01","text":"I was looking around and was approached by a young lady named Ray. I have come into the Sephora numerous time and have had to beg for the service that I required BUT not this time! Ray took into consideration everything I said in regards to skin type, made recommendations, and even gave me samples of items they were currently out stock. I went in looking for 1 maybe 2 items and ended up leaving with 6 items and  2 samples. The sales did not seem forced as she gained knowledge but simply asking me questions. I felt like I was shopping with my best friend!","useful":1,"funny":0,"cool":0},
{"review_id":"jnNsiHvOg5U_ayLkvuQpYg","user_id":"IhXJ-gQyeMN685Lj7Ey38g","business_id":"iA-eiMJm-XS4LnQ3JtwaWA","stars":4,"date":"2016-01-01","text":"My boyfriend got me a pair of Specialized Motodiva mountain bike shoes for Christmas. Unfortunately when I went to put them on the Boa dial was broken. I went in to exchange the shoes and was given no problem. Dillion help me find a pair that I like and were both SPD and Look capable. I ended up getting a pair of shamino shoes there were not even on the floor. Dallion even took the clips off the old pair and put them on the new pair. Only reason why i give this place 4 stars is due to the fact the shoe left the store broken and was not tested before.","useful":0,"funny":0,"cool":0},
{"review_id":"yU8FvvYsiajjJSePN8_rCw","user_id":"IhXJ-gQyeMN685Lj7Ey38g","business_id":"X-dlBiQcv-BcKQPEvs3cig","stars":4,"date":"2016-01-09","text":"Get family own resurant. I wish the customer service was a little better but other then that I ate my food left with my belly full and happy.","useful":0,"funny":0,"cool":0},
{"review_id":"su9IhMtLahkHJyrfFC7T9Q","user_id":"U1TPrVfpdvbVNVhWsstPDw","business_id":"vATlDG1ZYad74S8SODOu_A","stars":5,"date":"2016-12-10","text":"I found Karen through a mutual friend and she has been a true blessing.  I am suffering from frozen shoulder.  She has done more for me in just 2 visits than 12 physical therapy sessions.  She listened to me and went right to work on my shoulder. I have more range of motion and less pain.  I can even sleep through the night.   I can't wait for my next session.  I actually have hope and see the light at the end of the tunnel thanks to Karen.   She really knows her stuff, she is a pro at what she does and I am so happy to have found her.","useful":0,"funny":0,"cool":0},
{"review_id":"oSFWjaFz2KZ9NbwFnzkMIg","user_id":"U1TPrVfpdvbVNVhWsstPDw","business_id":"rDhYdFjECYwOrXsKQJckoQ","stars":5,"date":"2016-08-22","text":"Red Carpet Moving was amazing.  From start to finish.  Michael sent me a professional bid and answered all my questions in a timely manner.  On moving day, our team arrived on time, introduced themselves, assessed our home and what needed to be done and quickly got to work.  Not a scratch on any wall - and we had some stairs that always gave us trouble.  It was amazing!  They were true Pros!  The job was done under the bid time and we were very happy.  Thank you to our team....Nick, Ash, Miguel and Andy!  We will definitely recommend them and use them again.  Did I mention it was the HOTTEST day of July, no kidding, it was on the news that evening.  Thanks again Red Carpet Moving.","useful":0,"funny":0,"cool":0},
{"review_id":"1xXYmY-w86QyJFUNsolZ5A","user_id":"i5EG4P8_SjehzClTLDQF1Q","business_id":"sc__kdcFV4IcNTfBx1707w","stars":4,"date":"2016-08-13","text":"Pamela's was great! The food and service were excellent. I got the Pittsburgh hash and it was delicious. It's a great value too. As many others said, they only take cash so be prepared.","useful":0,"funny":0,"cool":0},
{"review_id":"Bunw8W2k6Tyk6aCEAedHVQ","user_id":"_cnPiXlOBTxl_rSBjQ3Oig","business_id":"3dMVYJJKVbPtS0gK7pEC7g","stars":5,"date":"2013-11-15","text":"Great workout place! You get customized workouts to suit your own goals and level. The trainers teach you proper posture and pushes you. The staff are all really friendly and helpful if you have any questions. There are check in sessions which shows how you are progressing through the program. The programs definitely gives you results.","useful":0,"funny":0,"cool":0},
{"review_id":"zsS3JwWbzzcSlWxSyqOf8A","user_id":"_cnPiXlOBTxl_rSBjQ3Oig","business_id":"9666LeMEY-xrjlwr4Lx8cA","stars":4,"date":"2014-08-09","text":"If you want affordable good service foot massage then this is the right place. It's not a fancy luxurious atmosphere however, its clean, professional and well serviced. I would recommend this place if you just want to have a nice relaxing massage.","useful":1,"funny":0,"cool":0},
{"review_id":"Dd3myp9IUzNjJnDglFPs2g","user_id":"EWK0I0eVUJ2a0ECJ5pLLKg","business_id":"IOH-i7_yyEKn7EOws0jUfw","stars":5,"date":"2017-03-01","text":"This is a great dog park, my dog loved it when i lived there. To much sorrow I had to put her down 2 days ago, she was 15 years old. This was the first park I took her to when i lived in Henderson. Henderson and Las Vegas are the best places in the U.S. for dog parks,hands down....","useful":2,"funny":0,"cool":1},
{"review_id":"ZwMsMguRtkKSOZ6XyVIJPg","user_id":"EWK0I0eVUJ2a0ECJ5pLLKg","business_id":"jt9O4tqBb-a7encP9ZEGVQ","stars":5,"date":"2014-11-19","text":"Jason and the staff at Aloha Auto repair are the BEST..Truly the best place to take your vehicle, They are honest and don't try to rip you off like a lot of places..\nIt figures I found them and now I'm moving..\nI took my car there because of all the great reviews.. and they are correct\nThey are the BEST..","useful":2,"funny":0,"cool":0},
{"review_id":"_sXjuNLGpJmvwg14TIpvNw","user_id":"c5cEYeQd2FajgBaPhkBSPg","business_id":"IB3SH76wQiuZr-NVOiflJg","stars":5,"date":"2015-11-26","text":"I have had my dog Gizmo boarded there on several occasions and was happy with how they took are of him, he is shy around people and will often growl or run away, but HE loves the staff there!!!  Also, I have taken Gizmo there for shots and other medical issues, he even had to have some teeth pulled out, they always communicated with me and explained all of the expenses while giving Gizmo the best treatment.  I would HIGHLY recommend this clinic to anyone they care and my dog does not take to too many people.   I respect his judgment!!!!","useful":0,"funny":0,"cool":1},
{"review_id":"Jx7ehwO3y1e-W-A8Bh53Sw","user_id":"dyvqxQfmNueNO8FnS9_QTg","business_id":"5wWYwiWEUFfrLc173h0fIg","stars":5,"date":"2017-04-06","text":"Was one of the most exciting experience of my life friendly staff Jane was very sweet along with Ron and Joe Potocnie thanks for being my pace car driver on the track.I will definitely be back hope the same crew will be their .This was a 60th B.D gift from my wife.","useful":1,"funny":0,"cool":0},
{"review_id":"cveOokMLxvnB4Q_-pFVSNA","user_id":"O8HMkMiB-pRE0XsRuVr-4A","business_id":"j3fV3e1xNK6NPFmVmFRmeA","stars":1,"date":"2016-05-14","text":"Worst manicure I've ever received, they have many \"deals\" and I can see why. The shop is dirty(I was literally shooing away flies the entire time) the manicure was done in 10 mins and the color looks terrible. Do not waste your money, even with the deep discounts, you don't get your money's worth.","useful":0,"funny":0,"cool":0},
{"review_id":"M_lYdoqU7eFg97Sg4t5L1Q","user_id":"e1XN2v-fxmkrWTHBmmXBUA","business_id":"WgoszuyljJ2yAiiqypOuoA","stars":5,"date":"2015-05-25","text":"I went to Danielle for micro links, and then eventually tried the tape in. She is super sweet, and knoweledgable about extensions. I loved mine! I prefer the tape in method, because they feel more secure, they don't come out (micros come out sometimes it happens) and their much faster to install.","useful":0,"funny":0,"cool":0},
{"review_id":"bCb0ObiP9fJm14KYs3Slpw","user_id":"e1XN2v-fxmkrWTHBmmXBUA","business_id":"n4TNmMRDuX1k6Ywr704xrQ","stars":3,"date":"2015-05-30","text":"I have no complaints about this gym, the staff is nice, plenty of parking, open 24 hours, and there is a significant amount of equipment. I am giving it 3 stars, because it is a royal pain in the ass to cancel your damn membership!","useful":1,"funny":0,"cool":0},
{"review_id":"V_h2wSkhAXHTh3NDweTKng","user_id":"iPSEto6vGYss27Ww8nFKWw","business_id":"JKD8TFBBbVU4h0zRja_UiA","stars":5,"date":"2014-06-09","text":"Being the wife of a dentist who is no longer practicing, you can imagine how picky I was in selecting a new dentist after 30 years of using my husband only.  I found Dr. Price and his staff to be very welcoming, efficient, and clean.  I am also dental phobic and his hygienist, Renee, was outstanding and quick.  Dr. Price repaired a front tooth of mine and you would not know it is not my natural tooth.  He did a beautiful job and was very, very patient with me.  I wholeheartedly recommend their office.","useful":0,"funny":0,"cool":0},
{"review_id":"LDB_uQeSRoxx7LWNeJvQZA","user_id":"iPSEto6vGYss27Ww8nFKWw","business_id":"Les-sxkMK4beV0FgsxtvBw","stars":5,"date":"2013-09-21","text":"I was hesitant to try a new nail tech, after several years with the same person.  I found Pam on Yelp and she truly does an amazing job.  She takes her time, is very thorough and has a HUGE selection of products.  She works 7 days a week, is very accommodating with her hours.  She is very knowledgeable about nails and products.  I am glad I found her and made the switch.  You won't be disappointed as she is a perfectionist.","useful":1,"funny":0,"cool":2},
{"review_id":"m09MfIzZOd-s0pSq0ly_kA","user_id":"iku8LeNeBf0P3TOGiQOJbQ","business_id":"AyZePvrWz73d3B0hafFCKA","stars":4,"date":"2010-08-03","text":"Great wings...cool place to chill","useful":2,"funny":1,"cool":1},
{"review_id":"plwQq1qeukn7_MUhTLlLbA","user_id":"iku8LeNeBf0P3TOGiQOJbQ","business_id":"NpgOB1s1qnWBfVykqe5zpQ","stars":5,"date":"2010-08-03","text":"Went one weekend for a friends birthday and had a small minor issues. We mentioned it to the hotel staff and they went well above exceptions to fix it. They have a great bar that's good for happy hour. The food at their main restaurant is amazing! Wonderful for special occasions or a business dinner. They get 5 stars because they care about their customers...and serve awesome food.","useful":0,"funny":0,"cool":0},
{"review_id":"WKaYnesbPBtGJv019j0Z-A","user_id":"iku8LeNeBf0P3TOGiQOJbQ","business_id":"zzwaS0xn1MVEPEf0hNLjew","stars":4,"date":"2010-08-03","text":"A real bar! Great drink prices.","useful":0,"funny":0,"cool":0},
{"review_id":"YEq9iloXoDESnMNzxMKwqw","user_id":"MU43o1Tp4MzAmi1LW0TtIA","business_id":"p2_npu4-bMQsCWC-GtRnyg","stars":5,"date":"2014-01-12","text":"Got married here on 1\/3\/14. Everything was handled and went very smoothly. \n\nThe chapel and grounds were very pretty and as shown on he website. The limo was great, and everyone was very friendly.\n\nThe photos can get expensive.  That's how photographers make their living. \n\nThe DVD broke in our luggage and they sent us a new one free of charge. \n\nI'd recommend this to anyone looking for a no fuss Vegas wedding.  For the price everything was taken care of for us. No planning needed on our part.","useful":11,"funny":0,"cool":2},
{"review_id":"1vXaAMhDZ4aE6b4M2Ty2jA","user_id":"fvkPLWnYTZz3gm1h0h7FHg","business_id":"O14YiPqe_1y3PNHHiKjj9w","stars":5,"date":"2014-02-19","text":"TR3 is way different than other gyms I've been to, but in a good way! It's open 24 hours so you can come whenever you want and isn't super busy so you can come in and get to your workout right away and not wait in lines. I really enjoy the turf and the different equipment they have unlike other gyms, and the trainers are willing to work with you on your schedual which is GREAT with my busy schedule. Everyone needs to check this place out it's fantastic!","useful":2,"funny":0,"cool":0},
{"review_id":"I0brZ5hvA2HS8LDpup5OZQ","user_id":"QmoSnuW52f_UsIJUva-kOw","business_id":"MxHmZMH0mHlW2YM2m6EOHQ","stars":5,"date":"2015-07-21","text":"There are just not enough good things I can say about Jessica!!  I always come out of her chair feeling and looking like a million bucks!  She has a knack for creating the right look for me!!!  She is extremely talented in her field!","useful":0,"funny":0,"cool":0},
{"review_id":"RDGqaPtlAYdslBXMa9Iuog","user_id":"P5pW23GgvKcgWo-uFU1s-g","business_id":"S0VH8Rb-EU0_YO2vc7-u9Q","stars":5,"date":"2016-07-24","text":"This place has the lowest prices I've researched in the Las Vegas area. Not only that, they come to YOU to fix your iPhone. The techs are nice and professional as well. I would highly recommend them for any iPhone issues you may have!","useful":1,"funny":1,"cool":0},
{"review_id":"h4iSrQhtORk7YzQe0bXq7Q","user_id":"ujlC8XqiTNObJtZ1A4JwmQ","business_id":"eG1qXGgn0g9clJsfT054Eg","stars":2,"date":"2013-12-02","text":"Great yogurt and open later for thay craving\nThe girl that works on Sunday is not the friendliest person in the world.  I was the only one in there, so I tried to say hello etc. She looked and really said nothing.  BLANK STARE","useful":1,"funny":0,"cool":0},
{"review_id":"oi6fwlh10mC2bGylBSh2-w","user_id":"ujlC8XqiTNObJtZ1A4JwmQ","business_id":"OwZM33ZI8LZVknaLICWIhw","stars":1,"date":"2015-04-04","text":"They have changed the Pita bread and I don't think it is good. They used to make it fresh on the grill, but now they use store bought already made. \nTo bad.","useful":0,"funny":0,"cool":0},
{"review_id":"IwdKCzqMxNzsZRAiCk6dvA","user_id":"ujlC8XqiTNObJtZ1A4JwmQ","business_id":"3QsTU7MZp2jKumN1c1BKrw","stars":1,"date":"2014-06-05","text":"I'm not sure who voted Starpower #1 in service in Arizona, but I am not impressed.  They cut some speaker wire for me that was the wrong length, when I went back to get the correct length they charged me for the new wire and said that they cut it right the first time clearly they hadn't.","useful":2,"funny":0,"cool":0},
{"review_id":"8_fn38OZKJL7EMH-a_VFYw","user_id":"ujlC8XqiTNObJtZ1A4JwmQ","business_id":"WVY0KpGkKC6l4rhCmeMlCg","stars":4,"date":"2014-12-24","text":"They really do a great job here, and my boxer KING loves to come in before he goes out on the road to show.","useful":0,"funny":0,"cool":0},
{"review_id":"FVh1JAApJgsDoh7JvzL_MQ","user_id":"Q0FYL8z1o536PsyMG71k9g","business_id":"dTU3z3SlQ2n49e1zbOkujg","stars":1,"date":"2016-08-02","text":"I would definitely avoid Herman Landscaping. We hired this company because the came in with the low bid among several highly regarded landscape companies that we interviewed. In retrospect, we really regret this decision. \n\nFirst, the small stuff. After they seeded the lawn, wind blew much of the seeds into the mulch beds where the grass grew much better than it did where it was supposed to grow. It's been a couple of growing seasons and our grass hasn't fully taken off, largely because I suspect they didn't use enough top soil. It would have been nice if they had checked back with us to see whether the seeding was successful. \n\nMany of the shrubs that they planted have failed (some were replaced under warranty). Again, I suspect inadequate topsoil is at least partly to blame. \n\nThe garden trellis that they built initially was flimsy, collapsed and had to be replaced. \n\nFinally, they built a large patio out of pavers. This project was a substantial investment on our part. Within a year, the patio collapsed into a hole. When they came out to look at the job, they claimed that there must be some issue below the surface and thus was not their fault. They then presented us with a large estimate for repairing the patio. Because we were dissatisfied with their services all around, we sought alternative bids for fixing the project and went with a different company to repair it. During the repairs, the entire patio had to be excavated and we found evidence that the base underneath the patio had not been properly compacted (as required by the paver company). Moreover, there is other evidence that the patio was improperly installed in terms of the sand that was put in between the pavers. That sand began washing away shortly after installation and will take several thousand dollars to redo. \n\nSo, it was bad enough that our project had so many failures, some of which have involved very expensive fixes, but what was most disappointing was the unsympathetic and utterly unhelpful response on the part of Herman Landscaping.","useful":0,"funny":0,"cool":0},
{"review_id":"BLlm2bQDF6cBMBe5V7xBCA","user_id":"gVq5TGQyES824vA08WMamA","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":4,"date":"2009-05-12","text":"I stayed at the Luxor about two years ago when they were doing some work in the lobby. Thought the rooms were good. \nI returned this year but stayed in the New York New York Hotel and found this one to be a better hotel more for the type of restaurants and location.\nI went back into the luxor to see the changes. They have made great improvemtents to the gaming area the new bars are stunning and the LAX Club is one to try.","useful":0,"funny":0,"cool":0},
{"review_id":"ZzNNdYN-W8v_bDsudw0alw","user_id":"g4bggXibDjBKaZHblAC07A","business_id":"qjcxNsGEcFn8Eh4IPjURoQ","stars":1,"date":"2015-04-06","text":"Pizza was 20 minutes late and cold.  The Coca-Cola was the warmest thing in the order.","useful":0,"funny":1,"cool":0},
{"review_id":"A_13yViNqtf-HbojU4CZ-w","user_id":"TbGgl0-C3i-JtoIWAXNyOQ","business_id":"BLIJ-p5wYuAhw6Pp6mh6mw","stars":1,"date":"2012-06-21","text":"I was unfortunate enough to stay at the Planet Hollywood Hotel\/Casino in Las Vegas. When making the reservation I was looking forward to the opportunity to try out one of the few hotels of Harrahs I have not stayed at yet, as my family and I regularly stay at Caesars, Flamingo, Ballys and Harrahs in both Vegas and Laughlin. In addition, I know Planet Hollywood has a reputation for catering to a younger crowd. \n\nUpon arrival, we were forced to drive around the poorly designed parking structure for over 10 minutes trying to find a spot - unacceptable for the hotel, casino and shopping experience the Planet Hollywood claims to be. Once parked, we made the 15 minute, very confusing, trek with our luggage to hotel check-in. Not only were there very few signs directing us on how to get to hotel check-in from the parking structure, we were faced with 2-3 uneducated employees who each pointed us in a different direction. One employee simply responded \"who knows I have only worked here a week\". \n\nOnce arriving at hotel check-in, we were told we would be upgraded to a \"strip view\" room with a view of the Bellagio fountains, needless to say we were ecstatic as it was both mine and my boyfriends first stay at this hotel. This excitement was short lived, upon arriving to the room we found the furniture covered in what looked to be body fluid stains, poorly patched up holes in the bathroom doors, a dirty sink and tub, chipped & damaged furniture, a television without a working remote, a noisey toilet that kept running our ENTIRE stay, etc. I really could go on and on. In addition to all these, we were disappointed to learn our \"Strip View\" was out of a dirty window smaller than our television screen. I feel sorry for your guests who actually pay for this upgrade expecting a \"view\". \n\nWe put all this past us and went down to the Miracle Mile shops for some shopping, dinner and drinks. Again, we were presented with uneducated staff who couldn't tell us where Fat Tuesdays, Victoria's Secret, or if there was a Bath and Body Works located in the mall - we were simply told \"I don't know, go find a map\". The only person who was of any assistance to us was one of the non-english speaking janitors who my boyfriend was able to communicate with in spanish and could properly direct us to Fat Tuesdays. \n\nUpon arriving back to our room around 6am, we were kept awake by what sounded like trucks driving over our room, we then realized that the monorail drives behind Planet Hollywood and what I am to assume to be directly above or behind our room. In addition to this, we were disgusted by the ill fitting sheet on our king size bed, which left a large piece of mattress uncovered at the foot of our bed, because of this we were forced to sleep with on top of the sheets without covers. We finally gave up and joined my family who were smart enough to stay at the South Point Hotel. We spent most of our day there getting some rest and real relaxation. We went back to our room at Planet Hollywood around 4pm on Saturday to again hear the non-stop monorail. \n\nWe went downstairs to give shopping and dinner in the miracle mile shops another try. We went to the Cabo Wabo restaurant and received some of the WORST service I have ever experienced. Both my boyfriend and I have worked in restaurants while going through college, both of us being Corporate Trainers for well known, national restaurant chains - the service we received was UNACCEPTABLE. We had to ask for my drink 3 times because our server kept forgetting it, my boyfriend's food came out covered in cheese even though we requested it without (as he is lactose intolerant, which we told the server) and when we asked one of the hostesses where we could find the \"rain show\" she responded \"I don't know I don't work in the mall\" which was confusing to us as Cabo Wabo is listed as being located in the Miracle Mile shops. \n\nWe gave up and went back to the room around 11pm and forced ourselves to sleep through the noise of the running toilet and monorail. We awoke at 8am the next morning almost immoble from the completely worn in bed. I travel quite a bit for work and have NEVER woken up in so much pain from a mattress. \n\nI am extremely disappointed in the Planet Hollywood and the Harrah's Corporation for allowing an experience like this. I have had great experiences in the past with your other hotels but am at the point where I don't feel I could ever stay at another Harrah's resort. I spent $250 on a room that I could barely spend any time in. I will NEVER stay at the Planet Hollywood again and most likely will NEVER stay at another Harrah's Corp hotel again. For an industry based on customer service and a great customer experience the Harrah's Corporation has failed! Like I state in my subject I am very disappointed and upset I spent my hard earned money on such a terrible experience.","useful":8,"funny":1,"cool":2},
{"review_id":"Lr_bkD6R7mwwQL5_DRYP3g","user_id":"Ki7-Ey8ILl1nTzErg9nP8Q","business_id":"jxbEwtV8Et1lm8ubk4AGuw","stars":5,"date":"2017-05-17","text":"Amazing place to eat. I ordered the churro waffle, which was spectacular. Great portions served here. The only issue was that there were no champagne for mimosas, due to these guys not having their liquor license yet. My wife asked could we bring our own liquor in, and the waitress said yes. So a 5 star went down to a 4, and quickly shot back up to a 5. Enjoy!!!","useful":0,"funny":0,"cool":1},
{"review_id":"NRCdIW2SstRXx724kGcC7Q","user_id":"Ki7-Ey8ILl1nTzErg9nP8Q","business_id":"I1gRYCt2exnOMsTr-lEJVA","stars":5,"date":"2017-05-16","text":"Hands down great service and great food as well. The food portions are more than enough, so I'd advise anyone to not eat with their eyes. You come here, guaranteed you'd be pleased. Wide variety of food choices. Great place for either breakfast or lunch.  Andrew was very attentive to my wife and I. I'll recommend this place to anyone. Enjoy!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"o1wR5ucQoyUHIANuQ8OhJA","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"Qpx15FbtJpQRY113E3yuZw","stars":4,"date":"2017-10-21","text":"Staff is super friendly. A big plus that they were able to make a same day appointment. First Brazilian wax is $60 w\/ tip, which is kinda pricey, but I don't mind paying $35 for maintenance. Pleased with my wax results.","useful":0,"funny":0,"cool":0},
{"review_id":"G0z6NqST36Sxo4Wnibg7Sw","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"LtO6vTBfYzlgWArn3kRe_A","stars":4,"date":"2015-11-01","text":"This place is soooooo goooood!!! Must try!!! Avocado creama is bomb. I get the adobada tacos and fries every time. Best tacos in town. The only downside is that you smell like meat when you walk out. The staff could be a little bit more friendly too, but I mainly go for the food and not the customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"MB8TUMBLfVtCP4_1N0yiTw","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"ewmTwsZqCHH2gvCeDKz0dw","stars":4,"date":"2015-11-01","text":"Poke is super delicious and fresh tasting. This place is hella expensive tho. Basically $15 per pound. My wallet is crying","useful":0,"funny":0,"cool":0},
{"review_id":"taVOtm0bZhGHmrZZGwqhKw","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"dzKDFiWLkspVBJKGfT0M2g","stars":1,"date":"2015-11-01","text":"It was alright. Still think YAMA sushi is the best. Too many rules here. Didn't like how there's a limit on baked mussels and desserts!!!! And how you can't order half rolls. There ahi poke salad sucked and barely had any fish in it. Most likely won't be back.","useful":1,"funny":0,"cool":0},
{"review_id":"0VcvUAwesA12aEtVXGev1A","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"IhNASEZ3XnBHmuuVnWdIwA","stars":4,"date":"2017-06-03","text":"Best boba in town hands down!!! Friendly staff and fast service. All the milk teas are super good & not overly sweet. Always the perfect amount of ice to keep my drink cold too. \n\nOnly downside of the place is that it gets crowded fast. Wish they had a bigger lounge area.","useful":0,"funny":0,"cool":1},
{"review_id":"AYnzsoyZWbm1AMfxpp4EoQ","user_id":"5rljRZuV-cQI599k_SwhBQ","business_id":"gqGvV1NUVjtLeiCGV4NpDA","stars":2,"date":"2015-10-26","text":"Fast service, average food, and kind of pricey.  Ordered fettuccini alfredo pasta and that was kind of greasy. Maybe I ordered the wrong menu item. Overall, it's just okay not great.","useful":0,"funny":0,"cool":0},
{"review_id":"TFL_lo9te0DBXTGXIpYvqA","user_id":"LDYBjZhtyJywiqPTyuEqEA","business_id":"dWFUKB_HPBIE87AFBHEb_w","stars":4,"date":"2014-04-22","text":"i have to say i had incredibly low expectations of spirit after reading all the negative reviews on here. i honestly dont know what you people are complaining about. i flew from vegas to new york city with a layover in chicago. i'm 6'1, 210lbs and felt like the seats had enough leg room and space for me. as for the fees, i took the time to read up on the bag policies and knew how much it was before hand. even though i had to pay $50 for my bag, it was still cheaper than what other airlines were charging. as for the flight crews? they were great, specially the chicago based crew. they WERE AWESOME. this one flight attendant had everyone on board laughing at all the jokes he was cutting over the loud speaker. it made me forget about how banged up i was after spending a few days partying in vegas. i honest to god wish i could take that crew and place them on any and all flights i take for the rest of my life.\n\nbottom line? if you are low maintenance and are content with bringing your own food\/entertainment with you on a spirit flight, then you'll be just fine. i absolutely will not hesitate to fly with them again.","useful":1,"funny":0,"cool":0},
{"review_id":"hAVFQnZF3BkjX1npE8MkJA","user_id":"GSoQdC9byF4pQdMCeqgnbg","business_id":"cJWbbvGmyhFiBpG_5hf5LA","stars":2,"date":"2017-11-26","text":"Pros:  Great German Bier and entertainment.  \nCons:  Food is terrible.  No German Bread Basket.  Spaetzle was \"rubbery\", the sauerkraut had no flavor, the mustard was NOT typical German spicy mustard, the wurst plate was fair, the chicken lacked flavor. \n\nI came here three times to give it an honest review and tried multiple dishes...they claim it is \"just like the Hofbrauhaus in Munich\"...not so...been at the Munich HB House and the food there is excellent. \n\nBottom line, if you want good German Bier and fun night time entertainment, then this is a good venue...but stay away from the food.","useful":0,"funny":0,"cool":0},
{"review_id":"BgPsFEcPZSMloFvWBa8XaQ","user_id":"X5LToG4s6lQK-iwp5bssMQ","business_id":"5iSmZO0SrKU6EoXK_1M8Kw","stars":2,"date":"2014-08-25","text":"We booked our room on Expedia like most people would. Requesting a king bed non smoking. When we checked in the hotel told us that room wasn't available. Instead we would get a double queen bed. They said our reservation on Expedia doesn't guarantee any requests. We complained and got no where. They did t do anything for us. I guess this is pretty standard practice for this hotel. The room was terrible and we demanded a room change. They accommodated us. Still in a room that had two queens. The hotel room is very out dated and looks terrible. Bathrooms looks like you stepped into the 1990's. I will never stay at that place again.","useful":0,"funny":0,"cool":0},
{"review_id":"p8b1u9LcmHfeIrvDbahZcg","user_id":"X5LToG4s6lQK-iwp5bssMQ","business_id":"J4CATH00YZrq8Bne2S4_cw","stars":3,"date":"2015-02-07","text":"The 0lace is located I  the palazzo hotel. Dim lighting and very romance atomsphere. The service is good. The steaks are not that good. Very dry and rough. I was shocked. The prices are I sane and for no reason.","useful":1,"funny":0,"cool":1},
{"review_id":"ZPCeRRC2bbeu_5huCmZtzg","user_id":"X5LToG4s6lQK-iwp5bssMQ","business_id":"WYw3Uf56DT5IwpaLNnCH5Q","stars":2,"date":"2012-11-12","text":"For starters no casino. What a way to start. All the rooms are so-called suites which means one king size bed and tge rooms are small. They attempted to create a \"kitchen\" , but no plate, silver wear and no coffee maxhine. What a joke . They only give you soap, shampoo and lotion. You want anything else you have ti call them. Its a bother. I didnt get any comps...no perks . Nobodt even offered a discount on any shows. The pool is a joke.....clised at 7pm efen on weekends??????? If you want a las vegas experience this place aint it. Priceline f#$ked me. What a terrible las vegas trip. Good news i won alittle money at poker.","useful":0,"funny":0,"cool":0},
{"review_id":"wj-QyKt1KFHHIuPsdj279w","user_id":"P-wOD5nbxybCSvxZjqOkQg","business_id":"oZcbn7ENit23xbCsyu9xbA","stars":5,"date":"2014-10-12","text":"Go. Get omakase. You will not be disappointed.\n\nI went to Yasu last night with a group of 6. We were undecided upon looking at the menu(s) and decided to just have the chef send us whatever (omakase). We probably got 12 or so courses. Each one had amazingly fresh fish and incredible flavor. We're already planning the next dinner and haven't stopped thinking about it since.\n\nFairly pricy for Phoenix standards but inexpensive compared to similar quality sushi restaurants elsewhere.","useful":0,"funny":0,"cool":1},
{"review_id":"Ut4OxaoNMLs1j-4MMaqggw","user_id":"P-wOD5nbxybCSvxZjqOkQg","business_id":"Awz0pdZbfSHnprg3cyq2aw","stars":5,"date":"2016-06-10","text":"I'm writing this review over a year after moving away from Phoenix because I miss Elite so much. Incredible attention to detail and everything you'd want from a dry cleaner. If you think all dry cleaners are the same, that's because you haven't tried Elite yet.","useful":0,"funny":0,"cool":0},
{"review_id":"0NyHv5j5SKUUQxmvVaIdJQ","user_id":"P-wOD5nbxybCSvxZjqOkQg","business_id":"T1HBJyu_wNcpvsGlMHlODg","stars":5,"date":"2014-06-17","text":"Had the pleasure of working with Shane to do an appraisal on my engagement ring for insurance purposes. He was friendly, knowledgeable and walked me through how he got to his calculation so I left feeling really comfortable with the appraisal. I'll definitely go back to them next time I'm in the market for some jewels :)","useful":1,"funny":2,"cool":1},
{"review_id":"vovh-450iTniA01MRu9m3A","user_id":"CYwsQ6tjFMcqHe_okpnMcA","business_id":"8Y5p2IQMLX6QjGPzxanexg","stars":5,"date":"2014-01-23","text":"Restaurant is cute, Korean dishes and sides amazing.  Great sushi prices.  Will go again","useful":0,"funny":1,"cool":0},
{"review_id":"O1B3clpYIpz5jZ5lYmd_SQ","user_id":"CYwsQ6tjFMcqHe_okpnMcA","business_id":"bExRK7F4As0o4CdEHUMFcw","stars":5,"date":"2016-07-10","text":"Great place for pedicures.  The location is beautiful and has great chairs.  The staff was friendly and very thorough.  I will be coming again.","useful":0,"funny":0,"cool":0},
{"review_id":"UTV3r3ABKq9STWUTxTpxaw","user_id":"FAfF_PKcfiCAtj3QrXfndQ","business_id":"DQtxU4uae3MzlnP_JZXqPQ","stars":1,"date":"2013-10-31","text":"Worst service I've had at a resturant in a long time.  If I could I would rate this lower than one star. Food was cold, I had to pull teeth to get a drink refill and my server was rude.","useful":0,"funny":0,"cool":0},
{"review_id":"I6JvA5Tx7jUW6s1U-bvqFA","user_id":"_2zpuBHkTneN1cz2_uH0Zw","business_id":"z8XIldYr65CKOz8yOI5R8A","stars":2,"date":"2013-07-15","text":"We're locals and picked this place as our staycation. We stayed 2 nights and had a great time until we checked out.  My wife had roughly 25 bug bites to her body that she noticed when we got home. We called to let them know and they were attentive.  However, they said they tested the room and it came back negative. After researching ourselves to find out what it was, it's shocking to find out they have recently admitted to having them. We were disappointed they didn't try to rectify the situation other than a \"sorry\". My wife both work for the hospitality industry and this response isn't the norm, especially with something as serious as bed bugs.  We can now take this place off of the \"let's do that again\" list. You've been warned!","useful":0,"funny":0,"cool":0},
{"review_id":"OZR7LHKyN7vsl-apyJSbOg","user_id":"_2zpuBHkTneN1cz2_uH0Zw","business_id":"j0pfafJ10YApv5jXtogW5A","stars":1,"date":"2015-10-27","text":"This business is a joke!  I was given this massage as a gift for Father's Day.  On 8\/17\/15 I tried scheduling.  The website is a joke and you can't see if you're writing anything.  I tried calling and I get a text to say \"text please\".  We go back and forth and the 1st opening is 10\/19\/15.  Two months to get in?  No problem, looking forward to it.  The day of, I text to confirm my appointment.  He indicates he isn't feeling well and can't hardly move.  Irritated, but fine.  He says to remind him to reschedule.  I tried rescheduling yesterday and he replies with \"who's this, I lost all my contacts.\"  I tell him and I have not heard anything back. At this point I'm done trying to work with this guy. There are thousands of massage therapists in this town.  Don't waste your time dealing with this one.","useful":3,"funny":1,"cool":2},
{"review_id":"NZqF56E7-9u1REQYTosOgw","user_id":"_2zpuBHkTneN1cz2_uH0Zw","business_id":"KqGOFK0v45x8evM9Bxly_A","stars":5,"date":"2015-10-27","text":"We took our 9 year old here for her birthday and our 5 year old was also able to do it.  Words cannot describe the excitement I felt watching my kids have the time of their lives!  Living in Vegas for almost 12 years you get inundated with all types of service.  Everyone one that we encountered that worked there looked like they were having as much fun as our kids were.  Truly exceptional customer service!!  Only downside is that it can get pricey if you want to do it over and over again.","useful":0,"funny":0,"cool":0},
{"review_id":"ABMyjb0ZF88dV8G_py6-xA","user_id":"ARIyub7CHrNZLEBzjm7ALw","business_id":"GzNbN1Y2OWVk_QJ1zLZbtg","stars":5,"date":"2015-06-14","text":"Dropped my MAC pro and expected the worst... In my fortune no cracked screen or anything that looked out of the ordinary until I turned it on and realized it made a weird whizzing noise seemingly coming from a fan or the hard drive.. It work perfectly but now just emitted a really annoying buzzing\/whizzing noise.\n\nFound these guys on Yelp! And decided to give it a shot. I'm not sure about other people's experience with \"poor customer\" service but I felt like these guys were great! Came in made our introductions described the problem and after they asked permission to look at it they took it out back to work on it. I barely finished a free arcade game that's provided in the waiting area where they came out and said they cleaned and adjusted the fan which looked like it was knocked loose. It was like a 10 minute turnaround!\n\nI asked how much for their time and work they simply replied don't worry about, if it starts making the noise again or it malfunctions just bring it back and we'll take care of it. These guys were professional, courteous and prompt. Two thumbs up or in this case 5 stars! These guys definitely earned my business.","useful":2,"funny":1,"cool":1},
{"review_id":"u2LqpKewzBnbzKwy9lBDEA","user_id":"ARIyub7CHrNZLEBzjm7ALw","business_id":"oyJp7RYNKqJq3aQVIvIxPA","stars":5,"date":"2015-06-14","text":"John is the man... Told him I was looking for a Father's Day gift for my father and brother in law not only did he lend his expertise when he inquired about their tastes but also suggested some really good choices and gave me a great deal since I ended up spending a substantial amount of money but for some kick ass Father's Day gifts that I know they'll both love.\n\nThanks again John you're the man. It was a pleasure talking to you and will definitely be referring others to your business.","useful":0,"funny":0,"cool":0},
{"review_id":"AcMQiizll0GjKAuQN9uNNA","user_id":"ARIyub7CHrNZLEBzjm7ALw","business_id":"3l54GTr8-E3XPbIxnF_sAA","stars":5,"date":"2015-06-09","text":"Was in the Scottsdale, AZ area and heard people raving about this place figured I had to stop by and check it out for myself.\n\nFirst of all definitely not what I expected, to be honest I was expecting more of a \"Five Guys\" setup but to much pleasure it was a more intimate, personal and relaxed environment.. The surfboard outside kind of hints at the environment inside.\n\nBut wait I was in basketball shorts cross trainers and a tank top normally I wouldn't wear this to a sit down restaurant just personal preference but the very nice lady informed me they do take out as well. Perfect. I paid after settling with \"The Hangover Burger\" which sounded amazing. It was about $14 not the cheapest but I'm from CT and that's what I would expect to pay for a good burger. \n\nI waited outside in my car since she said it would be 15 minutes, called a friend and in 12 minutes she came out with my food without me asking. That was very sweet of her to do so. I drove back to the hotel go to my room then remember I didn't ask for any utensils or condiments! To my surprise though it was all there paper plate, utensils, napkins and even an assortment of condiments. Wow, I was pretty impressed with the customer service and I haven't even tried the burger yet. \n\nSince I know this review is getting lengthy let me just say the above and beyond customer service was not let down by the phenomenal food. Cooked a perfect medium as requested with some sweet potato tots I have never tried that were simply put, addicting.  \n\nI will definitely be recommending this place to friends and those who love to get lost in different cities and try great food. Bravo Rehab Burger bravo.","useful":1,"funny":0,"cool":0},
{"review_id":"zUYOEdbw0PpZHYPqmbpShQ","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"JweD4oBHn1R5NRvF8lcxKQ","stars":4,"date":"2009-09-07","text":"Stopped in for a snack with my gf the other day and was quite impressed. They were out of pesc. friendly food, but the owner didn't mind whipping up a smoked salmon sandwich for us to go with their butternut squash soup. The sandwich was a little thin and unexceptional, yet passable. However, the soup was amazing! (Turns out he has a woman in North York making his soups. I'm guessing family\/friend)\n\nMaybe because it's on queen, the prices are a little expensive for the sandwiches ($8.5). And maybe because they've just opened they made a little mistake with the register, but after tax and tip, our sand+soup was nearly $20. But all this is forgivable; it's nice to have another good cafe on queen.\n\nI love their wooden tables, and the ambiance is quite relaxing. Can't wait to go back to try their coffee and read.","useful":2,"funny":0,"cool":0},
{"review_id":"q0sMO8QIH9z2wa7olZ_POw","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"jcImllIYQzaRNRV40gm1lg","stars":5,"date":"2009-08-21","text":"The french toast is amazing. Comes with a crunch piece, one stuffed with cream cheese and a regular one. I love the crunchy one. Just make sure to get the big juice when you go. It's only a dollar more and double the amount of juice.\n\nLiked our waiter. He was charming.\n\nIt's a great environment with nice art on the walls and great antiques. The record player adds a nice touch.","useful":2,"funny":0,"cool":2},
{"review_id":"0NThT-14evVx5X5aMsrZLw","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"x5yBZsTnFb1ah75XRXJz9Q","stars":2,"date":"2009-09-07","text":"I can't believe this place was full!\n\nWent for a quick dinner before a movie, had: wakame salad, spicy tuna roll, rainbow roll, and sushi inn pizza. Everything fell short, and tasted pretty bland, except for the sushi inn pizza. On the plus side, it was quick.\n\nMoral of the story: Sushi on Bloor.","useful":1,"funny":1,"cool":1},
{"review_id":"G9-XiMqhsMfzeBcWQJK75Q","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"YgtWsddIjReYrpqrwc-D2g","stars":5,"date":"2009-08-24","text":"Aside from Pages [r.i.p.], the only good bookstore in the city, The boutique selection is tailored to people who actually read, rather than line shelves.\n\nThe guys who work there are amazing. They'll give you all the time in the world to help you find your next book. I said I loved The Believers and Steve Erickson and he pointed me to this brilliant Russian book about a mass serial killer. Haven't read it yet; I'm not a person who actually reads.","useful":2,"funny":2,"cool":2},
{"review_id":"duRlr2YjQlkhX4_eH11L3w","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"2IKkooPTSW4YdrdptyBKbg","stars":4,"date":"2009-08-24","text":"Lit's a great little espresso bar. Basically, Manic on Roncesvalles with Wifi. They also serve Intelligentsia coffee.\n\nI love the communal table (though I've never sat at it), as well as the layout of the place. The staff has always been pretty good to me.\n\nDownsides: The green. Really? Telus sponsorship? The upholstery is getting stained already. The sandwiches are good, but could use a little more substance.","useful":1,"funny":1,"cool":1},
{"review_id":"47oaiE2SiVJFKKNTCnlaJw","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"eZaCQPZYmETSNiHRagNu2g","stars":5,"date":"2009-09-07","text":"sour cherry pie.\nthat's it. the rest are crap.\n\nthe sour cherry pie is perfect & reminds me of twin peaks.","useful":0,"funny":1,"cool":0},
{"review_id":"RiX5D6LFkRIzQ7A2EOLVsA","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"6n_MDeYxU1ihB38be9TkVA","stars":5,"date":"2009-08-16","text":"Great cheap sushi.\nLove the bloor street roll and the wakame salad.\n\nEdit: The Bloor Street Roll is sushi with very little rice. A big slab of salmon wraps around the outside with basil and salmon roe in the middle. Really wet. Really fishy. Such a good roll.","useful":2,"funny":0,"cool":1},
{"review_id":"X_rPaPWKzW2XDLBHbsA8tQ","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"ZNk4hO2EOVoSKcCBSwH-yw","stars":5,"date":"2009-08-25","text":"The wood plank floor boards and matching tables won me over, but really this is a great cafe. They run americanos like allonges. They make a fabulous sandwich with raisin bread, bacon, and old cheddar - the sweet and savory work perfectly. Finally, Luigi is a great guy and he likes old movies.","useful":2,"funny":0,"cool":2},
{"review_id":"FOHN015-CCulhJo8EcWQ-w","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"RjpyCT_oQCoXd-sLy-eFUA","stars":3,"date":"2009-09-07","text":"Your standard 90s coffee shop -- a dark, dingy, little nook. The coffee's fine. The iced chai is good. The open-faced veggie pate sandwich is great. \n\nFor the brewed coffee, you get to choose your own mug, though it'd be nicer if they added a few more iconic mugs -- currently they look like sally ann leftovers. They have coffee sold by the pound. I've never got it, but the people who do, love it.\n\nAll in all, a cafe to go to when you're on Roncesvalles.","useful":1,"funny":0,"cool":1},
{"review_id":"ZJY62owMt7ZNT7A8pAUNKA","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"2xlQ1OA8iU2V460CgS37-w","stars":4,"date":"2009-08-24","text":"I've been here a few times. The idea of a wafflery is brilliant. Definitely disappointed by their potato waffles, but their regular waffles are great. The big problem with this place is they haven't perfected their sides yet. Hopefully they will.","useful":4,"funny":0,"cool":2},
{"review_id":"vgejUJrr_tSzLHbduit9WA","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"_F1_05YYlvePzomZ_NFijA","stars":4,"date":"2009-12-28","text":"Went in not expecting much; the decor is kind of typical Japanese. So when they brought out elegant dishes of great modern Japanese food I was impressed.\n\nWe started with a Kaiso Salad and Sushi Pizza. Both were good. The Sushi Pizza was a tad oily, but I think I'm saying that only to criticize something.\n\nFor rolls, we had the Sky Dome and the Volcano Roll, which looked like an erupted volcano on the plate -- covered with the minced tuna\/yam filling. The Sky Dome roll was a really nice mix of sweet and savory with tempura'd shrimp and japanese pickles. \n\nThe portions of everything were pretty generous and were great at decorating dishes, which I'm curious to see if they can keep up as it gets busier.\n\nBest part about the night: the staff uniform is miniskirts!\n(Really, who wears miniskirts?)","useful":8,"funny":4,"cool":11},
{"review_id":"Ud1IjlW197EMBepiJ4rWpw","user_id":"16Ple1ORzeLBWUEjuht9fg","business_id":"DQf63-KJ25m-kDIMto614g","stars":2,"date":"2009-08-24","text":"I love the aesthetic, the unique menu, the design, the space, the staff, i even love waiting outside and browsing apt909 next door, but at the end of the day everything I've ordered from Saving Grace has needed a pillar of salt to be palatable. I want to love it, but I can't; the food is a little too bland.","useful":2,"funny":2,"cool":0},
{"review_id":"Hh77jlqNsWZBhlAbbe2Lww","user_id":"lbX4IEKMfMYDkHt1SmbwSQ","business_id":"em3TpGN9BAA85u2lXewDiQ","stars":5,"date":"2013-08-18","text":"This was the second time we've Ming Fu, this time for some birthday celebrations. The atmosphere continues to be energetic and upscale. Comfortable seats, good prices, great food. How can you go wrong? We ordered the chicken in lettuce and fried shrimp as appetizers. I loved the sauce on lettuce wrap! Comes as four and the three of us fought for the last one! We had the seafood fried rice, Hunan chicken, and the Dragon Phoenix (my favorite on this visit). Great combinations especially as we are family style eaters! We will definitely be coming again! And a surprise dessert at the end to help celebrate the birthdays!","useful":0,"funny":0,"cool":0},
{"review_id":"II9ovfZy5S5a2DzsPBkGwQ","user_id":"lbX4IEKMfMYDkHt1SmbwSQ","business_id":"yWUBX9Pe6pzh1PjVj04UmQ","stars":5,"date":"2013-05-19","text":"I've eaten at Bad Daddy's a couple times. Always a great atmosphere, great burgers and salads, and good service. Gotta try their Ghirardelli chocolate and peanut butter milkshakes!!","useful":0,"funny":0,"cool":0},
{"review_id":"tR6v5QBsYa3WNso7lyb7ng","user_id":"lbX4IEKMfMYDkHt1SmbwSQ","business_id":"yesClkCZlpLGTYZROkx4SA","stars":5,"date":"2013-04-28","text":"The Szechuan wings and Shrimp and Grits are amazing!!! Came here for a late lunch with some friends and the food was absolutely amazing! Great atmosphere, good prices, amazing food. How can you go wrong?","useful":0,"funny":0,"cool":0},
{"review_id":"x08st5MQ9lXZ02L7WiQlmw","user_id":"hhb92hGbbl5Ye90usGWfIQ","business_id":"2kfXHEV-bx0nTp0MzLQgSA","stars":5,"date":"2014-11-23","text":"Awesome food.Great staff ! Glad to see a place that's going to make it in this spot! Definitely try the margaritas ... Ariba Ariba","useful":2,"funny":0,"cool":1},
{"review_id":"juDkA1WXKxqMA6K608FcMA","user_id":"hhb92hGbbl5Ye90usGWfIQ","business_id":"VbY4yD6UmA9jKKxHscrxvg","stars":2,"date":"2016-06-04","text":"One of the most awkward sushi experiences! Only the all-you-can-eat menu was given to us at first so it made sense (fyi menu says we would pay for some foods not finished). We ordered light apps and were told rolls were 6 pieces. Apps came out in very small portions of salads (seaweed\/squid), so then we ordered a few rolls- small but delicious! So we decided on a couple others and before we know it, here comes a forgotten app and 2 huge 10 PIECE rolls that we could not possibly finish! Great sushi but heres the kicker...we were asked immediately if its our first time, if we lived near, how we found them, THEN each question over again! We were told we would need to pay for what we didnt eat...we honestly felt like we were in trouble for not finishing our plates! They ended up not charging us for extra 2 rolls (we had NO PROBLEM with paying extra), but were reminded 3 TIMES that next time we would need to pay. No need to treat us so differently when we didnt finish...bummer i was hoping this would be a good experience :\/","useful":2,"funny":0,"cool":0},
{"review_id":"vXONiY1VrSiMl4TKabLigA","user_id":"qcR0WBI1Tys54YUTIoRoZQ","business_id":"aBLx9JlAMq_AuW6VAImSwg","stars":1,"date":"2017-03-06","text":"It's hard for me to only give Zada Jane's a 1-star review, because my husband and I have relatively enjoyed our experiences here thus far. But after yesterday, I have to say this place has probably been taken off our list of regular spots. \n\nWe decided to stop in on a Sunday afternoon for a bit of brunch before our 3 o'clock appointment. 2 hours should have been plenty of time, right? Apparently not. We were told the wait for a table would be about 20 minutes; 45 minutes later we were finally sat, after watching several tables remain empty on the patio the entire time we waited. Given those 45 minutes, we had plenty of time to look over the menu so we could put in our order right away. By the time we ordered our drinks and food (at the same time) it was about 2 o'clock. \n\nBy 2:30, I'd had enough. Our waitress didn't check on us the entire time we sat there. 40 minutes without a table touch... 30 MINUTES. We finally tracked her down and told her we needed our food to-go, as we had somewhere to be. She assured us she'd go check on our food and have them put it together as quickly as possible. But this seems to be relative, as 10 minutes later she returns and tells us it'll be another 5 minutes before our food could be brought out. Unfortunately at this point, we'd already decided to pay the bill preemptively because, despite everything, we were hungry. Bad move on our part, I will say. \n\nFinally, our food was brought out by (what I assumed to be) a manager, because she gave us a gift certificate for our trouble. However, this seemed to be only an afterthought when my husband brought up how long we'd had to wait for a table and for our food on top of that. I felt it should have been our waitress that tracked down a manager for that sort of thing. \n\nOn top of all of that, they put the wrong ingredients in my husband's order of the Bunny Rancheros. If the food was fantastic, I might be inclined to give them another chance. But, unfortunately, it's a bit average, and the headache is not worth it. Guess we'll have to find someone else to use our $25 certificate. Any takers?","useful":0,"funny":0,"cool":0},
{"review_id":"4W5zwutngurjTGoXVOwIhw","user_id":"tc75j4ausypjv0BAiC0FdA","business_id":"y0x795PyDX8JL_oyIaTUiQ","stars":5,"date":"2017-08-17","text":"This is a great restaurant!  Went here multiple times with our 4 kids.  The food is so yummy, especially the pancakes and bacon!  The waitstaff was wonderful.  We will go back!!!  \n\nKids plates were adult size servings, so consider having little ones share.  We always had leftovers.  The value for the money was right for our budget.","useful":0,"funny":0,"cool":0},
{"review_id":"8c5JTKGBkKiaLatYRDeyvw","user_id":"iB9pyAyZrF_sQZ5G2reLwg","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":5,"date":"2017-06-11","text":"This restaurant never disappoints .. second time coming here.. our server Tamara was very attentive and the food was delicious .. I had the original breakfast burrito with the diablo potatoes and the chicken enchilada soup, everything was tasty...their banana nut muffins are a must try .. we always come here when we come down to vegas","useful":0,"funny":0,"cool":0},
{"review_id":"5-uX31hgEvbD0lBqajUI8Q","user_id":"164h2iWOdT6DSZ1xxObdIQ","business_id":"b18ykC-gQf2o81qsX-NVgQ","stars":4,"date":"2015-08-15","text":"I feel like a lot of people only write reviews when they've had a bad experience. I went in to get short box braids (burned) and the lady quoted me at $200. I told her it was okay that I'd come back later and she asked me what I expected to pay. I told her no more than $180 (because I'd been there and knew the braids would last) she agreed and we picked out hair color. \nUsually for long box braids it takes them about 5 hours, mine took nine only because there was only one lady trained to burn hair. She was sweet and got my braids tight without killing my head, and didn't take a single break!! I was impressed and my hair looks great. Again. I've been a total of 4 times. They're the best in Charlotte.","useful":7,"funny":0,"cool":0},
{"review_id":"8C89bKRIhmp5VbM9vbggjw","user_id":"164h2iWOdT6DSZ1xxObdIQ","business_id":"iyFS4twFjCKfaKl7kUl3sg","stars":5,"date":"2017-05-05","text":"Amazing. I had the salmon, my friend had the ny strip. Both were flawless. The fries were also incredibly perfect, and the server was super nice and attentive. Absolutely no complaints.","useful":1,"funny":0,"cool":1},
{"review_id":"FtULk75UGkpJ2iwN2mHG0A","user_id":"YkQ6yFhaiFxdX3ujhfHjgw","business_id":"RA00GtlU25TkIP9i9wd8bg","stars":4,"date":"2014-01-23","text":"Overall I feel the aquarium did an exceptional job in many areas, and needs a little help in others. The exhibits were beautiful, with a great variety of sea life to see. The price is a little steep but I feel you will have a good time and be in awe of many of their larger tanks. A perfect spot to take the children for an afternoon and let them play and learn hands on. I do hope they have the staff for maintenance of their interactive displays as well as the numerous television screens - they provide an abundance of information and I hope they haven't overlooked the amount of wear and tear that will come to them. I am concerned for their busy summer seasons as I feel the crowds will hinder guests enjoyment, as well as the restaurant is a huge letdown.","useful":0,"funny":0,"cool":0},
{"review_id":"qsGIfl0HPrOiOKsXoeejXw","user_id":"YkQ6yFhaiFxdX3ujhfHjgw","business_id":"VZbKJBbcxCOvuZyuEOojsg","stars":4,"date":"2014-01-23","text":"LOTS of animals (which means lots of babies year-round), exceptional hours making for great off season visits, upgrading and welcoming more species\/individuals all the time. I would highly recommend this zoo for every visitor. Great for families, young adults, seniors, and everyone else!","useful":0,"funny":0,"cool":1},
{"review_id":"k-e0KLGLEh_5QnJMxDf-KQ","user_id":"YkQ6yFhaiFxdX3ujhfHjgw","business_id":"Ux2wCjtzYHiwtbPWa892ug","stars":4,"date":"2014-01-23","text":"Overall I was impressed with the Montreal Biodome. The exhibits were beautifully done and if you want to feel immersed in the habitat of each animal this is definitely the place for you. Those wanting to check off seeing a lot of animals would surely be disappointed. It's a great trip if you have the afternoon off - to make it more worth your while I suggest combining it with admissions to other attractions within the Space For Life.","useful":0,"funny":0,"cool":0},
{"review_id":"cje7VZORwHwh2liUZGuUMg","user_id":"YkQ6yFhaiFxdX3ujhfHjgw","business_id":"W2W3tTQkid1Z5PXTnVQP6Q","stars":3,"date":"2014-10-28","text":"All in all this was a surprisingly well implemented zoo. For everyone wanting to learn more about the slithering species of the world this is the place to go. The exhibits were stunning and they have live feedings every day. Perhaps their best features are the extras - their programming is phenomenal!","useful":0,"funny":0,"cool":0},
{"review_id":"-gL10Yxv5G9al04jTGANCQ","user_id":"o6r0hORdfnXM2Yruu8GKLQ","business_id":"r_BrIgzYcwo1NAuG9dLbpg","stars":5,"date":"2016-08-29","text":"This has to be my favourite Thai restaurant. The food is superb, the staff is welcoming and the decor gives a great warm home feeling. The curry here is the best I've ever had. The Tamarin curry is exquisite and a culinary perfection. Their fried squash appetizer is a great meal to share and is full of flavour. The food came out quick and the servers were very generous. I liked the unique posters and paintings scattered around the restaurant for the decor. I live an hour away from this restaurant and I still drive the distance because of the top notch quality of the food.","useful":0,"funny":0,"cool":0},
{"review_id":"pBm8PGOE-4CgC7gX9f6qmQ","user_id":"o6r0hORdfnXM2Yruu8GKLQ","business_id":"0u47y3RqsQ_UpTSJGEpGrw","stars":2,"date":"2016-08-30","text":"This restaurant with first impressions seems quite promising, the decor is nice and elevates the whole place. This place has mediocre, bland food and slow, dis functional service. The staff are nice, however, are so slow and will never check on your table. I ordered a pasta Alfredo and was disappointed to receive flavourless noodles and water downed sauce. I would not recommend this restaurant at all.","useful":1,"funny":0,"cool":0},
{"review_id":"nbNVDxNy66fVSqn0QcdF6A","user_id":"o6r0hORdfnXM2Yruu8GKLQ","business_id":"AoW2A9bi4g_0AS2uKOPLUw","stars":5,"date":"2016-08-29","text":"Personally, I think that this restaurant is stupendous. Hands down one of the best seafood restaurants I've ever had. The lobster Mac and cheese balls were excellent and had to be my favourite item on the menu. Their harbour sauce was delicious and flavourful. The staff was very welcoming and nice. The decor was also very innovative and unique, it was cool. Overall, the place was well worth it and I would definitely recommend it to a seafood lover.","useful":2,"funny":0,"cool":0},
{"review_id":"P_sDXcKVuqQfqt9aZh32iw","user_id":"o6r0hORdfnXM2Yruu8GKLQ","business_id":"O1TvPrgkK2bUo5O5aSZ7lw","stars":4,"date":"2016-08-29","text":"This restaurant is most definitely the most clean of any Chinese restaurant within China town. The service is mediocre like any other restaurant in Chinatown. It's really expensive and the quality of the food is what makes it stand out. I personally enjoy the spring rolls and siumai. All in all, the food is really enjoyable, however and service is lacking.","useful":0,"funny":0,"cool":0},
{"review_id":"_uDR_-jtWTT0vl-Nt9yZyw","user_id":"xXce1YRJAURg2SIFl5WfOw","business_id":"GnGjeLuG4EmjcYrhHlvP7Q","stars":5,"date":"2015-02-13","text":"Extreme professionalism, well priced, very detail oriented. I called Jeremy and had an appointment within a day. They performed all the work and way exceeded my expectations. I would highly recommend Jeremy and his company to anyone.","useful":1,"funny":0,"cool":1},
{"review_id":"7NHPLyxW98ErXm1OhP6z1Q","user_id":"xXce1YRJAURg2SIFl5WfOw","business_id":"_FKn9oxlNDBl-lswKZt1Gw","stars":5,"date":"2017-04-30","text":"I have been looking for waverunners for several months. Jimmy was very easy to deal with and incredibly knowledgable. Anyone who is interested in water sports I would highly recommend coming to Ridenow. Had a first class customer experience.","useful":0,"funny":0,"cool":0},
{"review_id":"P9Og_bF-U3NDuP-dhctQag","user_id":"J7Sw8f3OrvDtZpOLFIRb-Q","business_id":"R5CgYUeSSd9OQPW6ihLw0g","stars":4,"date":"2010-05-02","text":"Moving from the East Coast several months ago, I hoped and prayed (Literally) that I would find a hair salon that specialized in my type of hair-relaxed and gorgeous of course! \n\nFound it at Belle Melange. I usually go for a basic wash and wrap style, nothing too complex. The staff is always friendly and I leave the salon feeling like a Diva. \n\nThe cool thing about this salon, what you wouldn't normally find on the East Coast, is that it's multicultural. You'll find beauticians of all nationalities working on all types of hair. Very cool.","useful":0,"funny":0,"cool":0},
{"review_id":"ZjbzplqMFmbr6zCAWpuoqA","user_id":"J7Sw8f3OrvDtZpOLFIRb-Q","business_id":"CLwYR316PDgRtT1ngeEkPA","stars":4,"date":"2010-05-10","text":"Love this place. The decor of the place is contemporary, yet the atmosphere is warm and inviting. My five-year-old daughter and I go at least once a month. \n\nPrices are reasonable, nail techs are personable and the place is tidy.  Ask for Sandy!","useful":0,"funny":0,"cool":0},
{"review_id":"OD4A7QUa16TpSeX7f-oshA","user_id":"J7Sw8f3OrvDtZpOLFIRb-Q","business_id":"IJWPryPUQVqAD6iMkLEHDQ","stars":3,"date":"2010-05-04","text":"An embarrassing moment in my life- pulling out of my garage, I knocked the driver-side mirror off of my car. I did this totally sober and rested and still can't tell you a \"good\" reason why this happened. \n\nI am still driving around my rental and haven't seen Gerber's work. Still felt the need to show my appreciation for the partnership between Gerber, Geico and Enterprise. I dropped my car off at 7:40 a.m. and was on my way to work (via rental) at 8:02 a.m.\n\nThanks guys. For the hassle-free and efficient customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"i5hEW56EoIVRumtNkVX8Lg","user_id":"J7Sw8f3OrvDtZpOLFIRb-Q","business_id":"3188t5PMa_XLlah-2UBRoA","stars":4,"date":"2010-04-24","text":"Oh my! I love this place. No smells of formaldehyde nail polish or whale sounds and incense. Where else can you go for the sole purpose of getting \"your wax on?\"","useful":2,"funny":0,"cool":1},
{"review_id":"G6AUPG946hUIdECZFtPC3Q","user_id":"Vs69Q_nKLfBcviqTUnZAzA","business_id":"tw1ure9rLoboPZ0h-ooyWw","stars":3,"date":"2012-12-17","text":"I've eaten here a fair bit over the last year. Most things have been very good. It's a chain so don't expect anything too authentic. I always enjoy the fajitas. One meal that was a disappointment was the steak. I ordered their signature steak, and paid a good sum for it. It was cooked alright, but it was probably more grizzle than meat. I'd save my money and get something else on the menu. The complimentary chips and salsa are always satisfying.\n\nOne thing I don't get is the \"Texas\" names they seem to make the staff use. I'd rather know my server's real name. I'm sorry, no one is named Thelma-Lou in this day an age.","useful":0,"funny":2,"cool":0},
{"review_id":"XgH7WqQ_5c3dsebYuRjC-Q","user_id":"Vs69Q_nKLfBcviqTUnZAzA","business_id":"upV1mQ5v0wcKUuA2AY85WQ","stars":4,"date":"2012-03-11","text":"Another gem at 130 Davis Drive, the strip mall of many dining choices. I was a bit concerned when I arrived and found the place to be completely empty at 6:30 pm on a Thursday. The decor was quite nice though, and I figured Yelp would not have steered me wrong. Several groups did show up just as we were leaving. Maybe people eat Indian later in Newmarket?\n\nThe host\/server was quite friendly, and he turned on the house music for us, not that I asked. He cautioned my dining companion that the Korma was mild, which is usually the reverse of the typical \"that's hot\" warning you get at most Indian Places. I thought that was interesting.\n\nWe ordered a murg (chicken) korma, murg dhaba, both with naan, and a paneer pakora appetizer. The appetizer was pricey at $11, and there were only six pieces. It was good, but definitely not worth the price.\n\nBoth curries were delicious; the korma had an aromatic flavour, and was quite enjoyable. I had no idea what dhaba was when I ordered it, and it turned out to be a slightly spicy butter chicken-type dish, which was quite tasty. The naan breads were the show stopper for me. I'm a naan snob, and I was very happy with the naan here. I also ordered mango lassi, my go to drink at Indian places, and I was very pleased with it.\n\nOther than the overpriced appetizer, I was very happy with my meal here, and I'd definitely like to sample their extensive menu in the future.","useful":1,"funny":0,"cool":0},
{"review_id":"PF-8unK2OGnzp7S7cK-AIA","user_id":"Vs69Q_nKLfBcviqTUnZAzA","business_id":"aseAn8QYq5CGe4asNNRpzA","stars":4,"date":"2012-03-11","text":"I made it to Sushi Sushi just in time to catch the lunch special, which runs until 3:00pm.  For sushi (there are noodle and teriyaki dishes as well), the special was a choice of a variety of rolls or sashimi, along with the standard Miso soup and salad.\n\nThe Miso soup was quite good (amazing that sushi places can do this badly) and the salad was basic and fresh, not a wilted piece of lettuce to be seen.\n\nI ordered the Tuna special, and it was very good; fresh tasting and flavourful. The rolls and pieces were well built, and the rice was as good as I've seen. No crumbly, falling apart sushi here.\n\nSeating is quite limited, and it's not fancy in anyway, which suits me perfectly. I'll definitely be back.","useful":2,"funny":0,"cool":1},
{"review_id":"UiIN4wLoeWbtSi5cNG_qDw","user_id":"Vs69Q_nKLfBcviqTUnZAzA","business_id":"8QaSSzZfdZTCAUlZZ2TLCg","stars":4,"date":"2013-07-11","text":"Nestled away in an industrial area, Tom's is my favourite place to do for breakfast in Newmarket. The prices are very reasonable and the food is always good.\n\n I usually get the Eggs Benedict, which has never disappointed me. The Hollandaise is much better than what passes in some breakfast spots in town. There's something about Newmarket and three eggs being the minimum at breakfast, but it holds true at Tom's as well.\n\nI was hesitant to post a review because I can always find a seat here, but it was time to share this hidden spot with Yelp. Consequences be damned.","useful":3,"funny":1,"cool":1},
{"review_id":"wQRAtqruKXXKPt3ESABs8Q","user_id":"Vs69Q_nKLfBcviqTUnZAzA","business_id":"xCFdXTSHEMA-8VMrUrQUiw","stars":4,"date":"2012-03-11","text":"Tucked away in a strip mall that has a ton of eating options, Piccola Italia is definitely worth a visit.\n\nWalking in, you feel like you're in a 70's style pizzeria. Fairly impressive for a strip mall. The first thing I spotted was a stainless steel pizza tower on one of the booth table. It definitely brought back fond memories, as did the hot pepper flake and Parmesan shakers. Definitely the makings of comfortable restaurant for comfort food.\n\nWhile the menu isn't gigantic (not a bad thing), there were more than enough choices, and tough decisions had to be made. I was very tempted to try the pizza, and while I was looking at the menu I caught a glimpse of the gigantic panzarottis served here. In the end I went with the Veal Parmigiana sandwich, with a side of fries.\n\nThe sandwich was gigantic and absolutely delicious. The bread was perfect and plenty of cheese, sauce, hot peppers, onions and mushrooms, along with a tasty veal cutlet. Truthfully, the sandwich would be two meals for most people, but I was happy to finish it. I definitely did not need the fries, but they were served hot and crisp, but not fresh cut.\n\nThe desserts looked amazing as well. I caught a glimpse of a piece of cheesecake that was tempting but there was no way I could have fit that in.\n\nNext time I'm in Newmarket, I'll definitely go back and sample more of the menu.","useful":4,"funny":1,"cool":4},
{"review_id":"O1H732bL6Q0a63AGm75_JQ","user_id":"LqakfyFxlKUmPnUPVpIUZQ","business_id":"56d3dE1LoZZMxA-kTQvqew","stars":5,"date":"2016-07-24","text":"Came to Studio21 after reading glowing reviews. For starters, very clean place. I had a pic of what I wanted.   I didn't make an appointment but showed up and they got me in with Mike right away. Mike did an amazing job. Very clean lines and did exactly what I wanted. Joey up front was friendly and chatted with my friend and I as we waited for our artists to get things ready(she saw Nick and he did an awesome little ankle tattoo for her). Highly recommend Studio21.","useful":2,"funny":0,"cool":0},
{"review_id":"2zg7LHJQE904mpBVoPVQvA","user_id":"bbShTaojDODdpI536aqSHw","business_id":"UZm77e_RM65rlxHpiug6tQ","stars":5,"date":"2011-12-22","text":"I have had the pleasure of training with Mike at Raw Fitness and I cannot say enough good things about the quality of training he provides. Mike is not your regular cookie-cutter trainer from one of the big warehouse gyms. Mike is a trainer's trainer (he literally trains other fitness trainers) and he REALLY knows his stuff.\n\nWhether you are an elite athlete looking to stretch yourself to the limit or just looking to drop some weight or get in shape, Mike and his staff will tailor make a program to fit your goals. They focus on real-life, functional fitness and have a huge bag of tricks to help you get where you want to go. You'll be blown away with some of the stuff they do here. Mike is also great at working with kids and young athletes, so you can bring them too.\n\nThe best thing about Raw Fitness is the warmness of the staff. They aren't there to just to get you in and out as quickly as possible. They really do care about you and want to help you achieve a better quality of life by improving your health. If you are willing to show up and put in the work, they WILL help you get results.\n\nI have never been in better shape than when I was working out with Mike. I almost want to move back to NC just so I can work with him again. If Mike can take a pencil-necked guy like me and turn him into a powerful fitness machine, he can do it for you too. Drop by sometime or give him a call and ask him to hook you up with a free session.","useful":2,"funny":0,"cool":1},
{"review_id":"Wry1fYNmGa8xKYb-8KcyRA","user_id":"yVLEZSQPmO00JjPZPvJ-CQ","business_id":"3LWsVfsSmb_Nzbi2YQ-NIA","stars":5,"date":"2014-10-15","text":"my husband and I came here after the sales associate at the pandora store at the forum recommended it. \n\nfor apps we had bhel puri, chili chicken and chicken momos. the bhel puri was nice and spicy. the tamarind chutney is as good as homemade. the chili chicken is a huge portion and could double as an entre. the momos were tasty also.\n\nwe then shared a non-veg thali and everything was divine. the best part was that the tabdoori chicken appetizer that comes with the thali wasn't hot pink in color (and it shouldn't be people just FYI) it was nicely BBQ'd and spiced beautifully. loved it! \n\nfinally, a true test for me, was the chai. perfection! I really enjoyed thai place and will definitely be back. \n\nwell done!","useful":2,"funny":0,"cool":0},
{"review_id":"cohgYqHJVxzNTQ4Lq1TcRQ","user_id":"AcSRRGi5fQoWQK5_VbgQ8g","business_id":"RESDUcs7fIiihp38-d6_6g","stars":5,"date":"2015-01-10","text":"A must stop for us each visit to Vegas! Offers such a Wonderful assortment of dishes and most of all desserts. My entire family enjoys eating here :)","useful":0,"funny":0,"cool":0},
{"review_id":"pLpWOVUjiLbSZcgGYoM_Fw","user_id":"62tiRBjn0qGE15eB_G0caA","business_id":"O7uA5Rlo4vIVoh7KthEEXg","stars":5,"date":"2013-03-06","text":"Eric Burch is GREAT!!! He always does a really good job making sure he sprays all the areas around my house.  He always has a smile on his face and is very couteous.  The inside of my house has been pest free ever since I started using Bulwark.","useful":0,"funny":0,"cool":0},
{"review_id":"oxbodsV5PTb142AXRgfjSA","user_id":"7FpHbRTtV7prW9taZ2WHHw","business_id":"BgQ5ob0QiZfO5YbgI7VyFw","stars":4,"date":"2013-10-21","text":"Ate lunch here this weekend with a group.  We received excellent service.\n\nI had the high desert  pasta and I plan to return as soon as possible and enjoy this dish again.   linguini, garlic, pine nuts, tomatoes, mushrooms, asiago cheese and cilantro, tossed with white wine and olive oil--I'm hooked, but now I'll never get to try all the other dishes.","useful":1,"funny":0,"cool":0},
{"review_id":"uqo4y6W6XDiOADdkdBxvbw","user_id":"7FpHbRTtV7prW9taZ2WHHw","business_id":"nn4ZkIZTCd7jJhxs-P9tHA","stars":5,"date":"2010-10-20","text":"Last night I was part of a group of 15  that gathered on the patio at 5 & diner to enjoy the good food  and the beautiful weather.\n\nAs usual the service was outstanding and the friendly staff went out of their way to show they appreciated our business.\n\nLooking for a place that serves breakfast any time of the day or  night?  You've found a home here.\n\nThis is excellent, low cost, traditional diner food.  I love the type of music that is always playing in the background.  This is one of the few places to eat on the patio where you are far enough away from the street.","useful":1,"funny":0,"cool":0},
{"review_id":"YdBpR-tlk_naRmbIYep0dA","user_id":"7FpHbRTtV7prW9taZ2WHHw","business_id":"fYISBJhVMef0wOqX8JUxlQ","stars":5,"date":"2015-05-02","text":"Awesome!  Really great service.  Excellent staff.  Good food and drink.\n\nRobert Ray, magician, entertained at our table with close up sleight of hand tricks.  Added so much to the evening.\n\nLachlan Patterson was brilliant.  We went with high expectations and were not disappointed. \n\nA heartfelt thank you to the management for keeping the temperature at a normal setting. The other clubs around the valley keep their rooms like a refrigerator.  From now on,  House of Comedy is our only comedy venue.  Other reviews have already told you to bring the sound down on the film.  Pay attention.","useful":0,"funny":0,"cool":0},
{"review_id":"gmI4VD-yGpAPHzammv1T6A","user_id":"7FpHbRTtV7prW9taZ2WHHw","business_id":"7fOZVdXQfEhZkZ9ZOcHOjA","stars":5,"date":"2013-10-09","text":"I was so impressed by the wonderful service. I think the store was crowded because today they were offering a discount to seniors.  But the staff handled the rush very well. \n\nThis is not my  neighborhood Walgreens.  I stopped in after a class at Devonshire Senior Center and was amazed by the staff.  The manager was up front.  very welcoming.  directing the staff.  checking the outside of the store.\n\nA clerk, Jesus, directed me to the right isle and when I was checking out, he asked if I found everything.  I described the one item I did not find and he went back and found it for me.  very polite.\n\nThis was about two in the afternoon and the parking lot was free of pan handlers.  I would guess that there is new management  at this location and that people in the neighborhood should give this place another try.","useful":0,"funny":1,"cool":0},
{"review_id":"TDT79n97SE-SY4RdLSvx9A","user_id":"tDpf2hQyV-N71ImyQLb3YQ","business_id":"-SJcjOv88ZHjIU44U4vWTQ","stars":5,"date":"2015-07-13","text":"I found a groupon and spoke with David in regards to my move. He was very helpful and communicated very well. Called back in a timely manner. I was quoted for my move and they completed the move in exactly the time frame.  There was no additional charges or fees added at the end. Cory, Cody, and John were very nice and hard working. I would recommend them to anyone and use this company again for a move.","useful":0,"funny":0,"cool":0},
{"review_id":"uF5vNkTVlPrY3izebsPHMg","user_id":"tDpf2hQyV-N71ImyQLb3YQ","business_id":"KOEBBp2PhiV_4PkW9eo9Sg","stars":5,"date":"2017-09-26","text":"It's probably one of my favorite spots in town. The salmon is always cooked to perfection no matter if it's in a salad or with an entree.","useful":0,"funny":0,"cool":0},
{"review_id":"qpHkwWYGyoBKzxBsu3IS_w","user_id":"MOPA8zKFx0YZQz3T4speyA","business_id":"3Hu-IPhq5I_jyb3YfeHpGQ","stars":3,"date":"2009-07-08","text":"This is a chain, but not all chains have to be bad news. They're Arizona-based, so if you live here, why not patronize their business? The money is still staying in your state. Most chains are bad news and grace the armpits of major cities like rampant pubic lice (also known as \"strip mall Hells\"), but these guys might restore your faith in that all-too-often abused model, a little.\n\nSomehow, though, they still reminded me a bit of a tiny Souplantation where the food is brought to you and the menu is innovative. It's probably just the pale wood interior and glass sneeze guards. But these people are reviving the ancient art of breadmaking and turning it into something trendy and accessible to people who don't eat at anything but chains. ( I saw a picture of someone making bread in a book in an antique shop once.) They need at least some kudos for this. \n\nOn to my meal: the Caribbean Jerk chicken salad is pretty darned good. I didn't find it spicy enough, and I would have put fresh thyme, some shallots, scotch bonnet peppers, and the tiniest breath of allspice in it, but I did field research in the Caribbean and know how that stuff is supposed to taste. This was the first Caribbean jerk anything that I've ordered on any menu and didn't find deeply disappointing. The size of the salad was perfect--not too big (salads don't keep well as leftovers), and not too small (it was sufficiently filling and I'm 6'3\"). The pieces of nondescript bread on the side were homemade, so how could I complain?\n\nMy wife's roast beef with gorgonzola cheese was gone before I could demand my own bite. Her little sister's roasted sweet potato sandwich (carb-on-carb seemed redundant, but what else can vegetarians really eat?) was also much appreciated by the little sis, and was gone before I could bully the slightest smidgen out of her. There wasn't much service, but it was fast; the atmosphere was industrial, but I saw a lot of cool combinations of ingredients. \n\nI would have liked to have seen less of a \"we're trying to make mega bank and stick only to things we know we do well\" atmosphere, but a chain is a chain to some degree. There are also very few items for people with gluten allergies or who can't eat bread. But for lunch on a Sunday afternoon in strip mall Hell, this place was more than adequate, earning it an \"A-OK\" rating of three stars. Most chains have a repulsive formula, but this chain's formula is far less odious than most.","useful":1,"funny":1,"cool":1},
{"review_id":"rquUxTXjkwUWNlS1d8hDrA","user_id":"0Cd37WMp6zoRXjPPVYhKHQ","business_id":"LcTlT1Uf6XckMjWwRr49sQ","stars":2,"date":"2016-06-03","text":"I went to order on Tuesday 1 bagel and waited about 10 minutes about 4 people getting there orders and i only order 1 for the first time at this store.  then went the next day and a lady was waiting for her bagel she said for about 10 minutes people passing her up i told her same thing happen to me at this store. Today i went to get another bagel for my husband and i decided to order one for me and they give me the wrong bagel and i work 10 minutes from the place and have to be at work on time and its frustrating to open your bagel and get the wrong bagel. They have at least 5-6 people on staff and seems like they don't know what is going on.  I have to go to market buy my bagels and toast at work now. the bagel shop was on Summerlin Cheyenne by Albertsons store. I got to work to call them they gave me the wrong bagel and phone rang at 8:50am 10 times on one answer and  i called the catering ext and they are going to send a request to the store for me.","useful":0,"funny":0,"cool":0},
{"review_id":"oXcB_jeWFYYXk2tsYPeGrA","user_id":"NTuY-w2TAR-LGqwMXznAOg","business_id":"JIETwXSEGIHMNyxZVEnNKQ","stars":4,"date":"2014-11-22","text":"Excellent food - high quality ingredients and a simple, satisfying menu full of healthy options at reasonable prices. Good ambiance and friendly service. I'd recommended this place to anyone looking for a healthy and delicious breakfast or lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"HDB80T8_mCxAfmyLSwfGcg","user_id":"NTuY-w2TAR-LGqwMXznAOg","business_id":"W2NzlS8OJzGfDfr9oRz11Q","stars":3,"date":"2015-07-26","text":"I recently went here for dinner and ordered the gazpacho, Drake Salad and the halibut entree. The soup and salad were both simple but fresh. The halibut was cleanly presented and the sauce was well flavored, yet the fish was over cooked and didn't have that flakey texture and buttery mouth feel that well prepared halibut should. \n\nThe ambiance of the restaurant is trendy but relaxed and the waitstaff was attentive and friendly. Overall, it was a decent meal but none of the dishes were close to being a \"Wow\". The prices leaned towards the expensive side.","useful":0,"funny":0,"cool":0},
{"review_id":"1lQumdpmuP2LUqNflZem3g","user_id":"aRsyvbrZza5QEMFBeRGxLg","business_id":"2mNm4GjZW_z1L6JKKH4tww","stars":5,"date":"2016-11-13","text":"I had been hearing great things about the facials and products offered by Debbie Davis at Sleekskin Aesthetics, so I decided to check it out myself, and I was NOT disappointed!  Debbie is a lovely person and very well informed about the science of improved skin care; and I love that she customizes the facial and suggested products for every individual.  The facial felt wonderful and relaxing and included an LED treatment.  When I left, my skin looked visually plumped and brighter.  I'm excited to try the various products that I bought (both serums and creams) because they were designed by Debbie based on extensive research and proven results. Cheers to Debbie and anti-aging!","useful":1,"funny":0,"cool":0},
{"review_id":"urO9ICEtWBIRBJSIIxysCw","user_id":"aRsyvbrZza5QEMFBeRGxLg","business_id":"2ksAPIhObAGEaYU4Y3ZbpA","stars":5,"date":"2017-05-19","text":"I am so happy with a recent experience at The Paper Place in old town Scottsdale, that I'm compelled to write a review.  I'm hosting a bridal shower 'cocktail party' for a friend's daughter in a month, and I knew I wanted to make it special, but also the timing was tight for me to mail out invitations.  I didn't want to go electronic and thought my only other option was hand-written.  I was so wrong!  I had heard great things about The Paper Place, so I went in to see if they could help.  Judy is the sales associate who worked with me and she is absolutely a delight -- knowledgable, creative, efficient and lovely personality.  In less than an hour, we selected the perfect invitation 'off the rack', received wording suggestions from Judy for all our particulars, decided on font, selected coordinated cocktail napkins with matching print font, and then she put a rush on the printing of the invitations and envelopes... no hand-written anymore :-).  She even suggested I buy floral stamps which I never would have thought of, but love. When the invitations arrived 2 days later, she helped me stuff and stamp, and suggested the main post office so they would be sent out that day.  And the price was very affordable.  So if you want an extra special event, look no further than Judy at The Paper Place.","useful":1,"funny":0,"cool":1},
{"review_id":"ha1Dedh5MFNhb7MTqZo2hw","user_id":"aRsyvbrZza5QEMFBeRGxLg","business_id":"Bs2fG7gN1qIe-oDJSvfyBw","stars":1,"date":"2017-09-23","text":"Mine is a story of 'buyer beware.'  I have very fine eyebrow hairs and went to Julia for microblading in the hopes of having beautiful, hassle-free eyebrows.  The result is that I am emotionally distraught and aesthetically maimed with mis-matched eyebrows now because of Julia's work.\n\nI take responsibility for not doing significantly more research before deciding on someone to do my microblading, or I certainly would not have selected Julia.  She lacks close-up photos of her work, has only 3 reviews on Yelp, and not many more on her website where she can cherry-pick the best ones.  But shame on Julia for trying to convince me that her microblading on my brows looked great, and that what I was seeing in the mirror was \"just a reflection\" and not what my brows really looked like.  Her analysis would be laughable if it was not so flawed and deeply upsetting.\n\nI last saw Julia about a month ago for a touch-up to the original work where she promised to \"even out my brows and make them perfect.\" She did not improve the mismatched shapes at all, but only made them darker which I did not want.  Since then I have had numerous consulting appointments with professional microbladers and have heard a consistent theme to date... that my brows are definitely mismatched with one having a high arch mid-way in the brow, while the other is relatively flat with a rounded arch at the end; additionally, I've been told the brows are over-saturated so that the individual hairs are not visible which is the whole point of microblading to achieve natural looking brows.\n\nI can only pray that my brows lighten and completely disappear over the next few years.  At that point, if they have not completely faded, I will need to resort to time-consuming and expensive saline treatments to remove Julia's work before I can have my brows properly microbladed.  \n\nIn the meantime, each morning I must re-shape each brow with a brow pencil to get a closer match so that I'm not embarrassed to go out.  Needless to say, the past several months have been emotionally devastating to me and I don't know what the future holds.\n\nJulia has offered to \"fix my brows\" if I come in for a third appointment.  In my opinion I would be crazy to let her work on me again given the outcome of my first two visits.  The damage is done.\n\nBuyer beware.","useful":0,"funny":0,"cool":0},
{"review_id":"UhLJG5aHwIK2xwFIQ5iL5Q","user_id":"aRsyvbrZza5QEMFBeRGxLg","business_id":"Rg43a31sV7gNLZMjy-ZdCg","stars":5,"date":"2016-12-27","text":"Can't believe it's taken my husband and me so long to try this place.  I'll admit that the name had me thinking it was traditional bar food with more pork than chicken or beef.  Boy were we wrong, and pleasantly surprised. It's truly fabulous! The atmosphere is casual and easy going, but the food is sophisticated and delicious, and the price is seriously reasonable for the quality.  I had the pork shank and my husband had the skirt steak.  The flavors were savory and delicious, and beautifully combined with the sides on each entree. Mine was so large, I took 1\/2 of it home. But I'm getting ahead of myself... you must try the fried brussel sprouts appetizer with a fried egg on top... amazing! And we had to have the bacon bourbon bread pudding for dessert... makes my mouth water thinking about it. My only complaint is that they don't have decaf coffee... I mean who doesn't serve decaf??  I hope the management fixes this glitch so that the dining experience is perfect.  And ask for Lotti as your server... she's wonderfully helpful and attentive without hovering.  Enjoy!","useful":0,"funny":0,"cool":0},
{"review_id":"qSE_QrG4R6y91d0VV12SNA","user_id":"YDbxUupEoxF0KQEAGL6NKg","business_id":"PwI8GeyzjKvEILMrLrj2cA","stars":5,"date":"2014-09-21","text":"I had a manicure and pedicure here today. The price was very reasonable ($50 for both) and the service was very good. Everything was clean, Kevin was very nice and gentle, and my cuticles were trimmed and cleaned well. I would definitely return! There is lots of free parking too as it's located in an outdoor mall.","useful":1,"funny":0,"cool":0},
{"review_id":"LiH-okRRzC0MfkkVQ2Ivlw","user_id":"jB9w9VOXL7IvZgTm0fDv-w","business_id":"jayJIsjK3tUi8Kg4-8MNdg","stars":4,"date":"2017-05-23","text":"Stopped in for a late lunch on a Sunday afternoon.  Sat outside and enjoyed the BBQ pork platter with baked beans, coleslaw, and hush puppies on the side.  My husband got a burger and onion rings.  Food was tasty though portions weren't as generous as at similar BBQ places in the area.  It was enough for me (an average female) though some men or big eaters might wish there was more.  Our server was friendly but the food took quite a while to come out, considering that we were the only customers.  Not sure why the kitchen was so slow. Still, the food was a pretty good value so we will likely return","useful":0,"funny":0,"cool":0},
{"review_id":"xgNzEwUjR9ImhJk2M3yRTA","user_id":"pTJFxW90r9tsVCBUIC-qfw","business_id":"FTKxYJj7d5u3GiEHG5cQSQ","stars":1,"date":"2016-03-19","text":"This was one of the worst restaurant experiences I've ever had. I wish there was an option to give out negative stars. It took over 90 minutes for our food to arrive and that didn't include food for our entire table. We watched over 8 trays of food be delivered to other tables that had arrived after us. We asked multiple times to speak with the manager and we were ignored. Our server, Ashley, was amazing. She was the one positive thing during lunch that day although it was painful to watch her be ignored and yelled at by the manager because she asked him to come speak with our table. She tried numerous times to speed up our order without success. I was there for Mary Kay Career Conference and we missed part of the conference because of our choice to go to this restaurant. I expect better when I eat out. Disappointing.","useful":0,"funny":0,"cool":0},
{"review_id":"-lFGD2znVXlFeaVNUTNRAA","user_id":"vrb1QamRmR-hudIs-FNGMg","business_id":"quD839G-_0HIwAIE0knV6g","stars":1,"date":"2014-07-05","text":"Worst service of my life! Even though we had a reservation, we had to wait for almost 3 hours in 4 different queues to pick up the car. Reservations mean nothing! When we enquired of the staff why it was  taking so long,  we were told that they only phone down to have the car found,  cleaned and fuelled up, when you arrive to pick it up!  In South Africa where I \nTravel regularly I'm used to collecting rental cars within 15 minutes maximum.  When we finally received the car it was not completely clean. None of the other rental companies had long queues at that time. You would think this is the first time they have rented a car!","useful":0,"funny":0,"cool":0},
{"review_id":"Yc5q4JOhkQEzyESbI_LcuA","user_id":"dX1zbnatpn62k4Myqhdlgw","business_id":"AWHNeK6i4SN8zpsfUrRXJA","stars":5,"date":"2015-05-11","text":"The food is so delicious and totally cheap (averaging ten bucks per dish) and the staff is so friendly. The only issue I have is that the sauce always leaks into the bag. They should find a way to close the dishes or just make sure everything's clean before putting it in the bag. But I can't even take off a star for that, it's such a great place, highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"W8Ya6TOYHdKrG2gjEWvYBw","user_id":"PmiVJDxktF7CX6uMStltWw","business_id":"wFNxIIn4_G2hf6R8PJPU5w","stars":5,"date":"2017-04-21","text":"They came to my job and took about 2 hours doing my executive detail inside and outside and I got the wax and headlight restoration and I must say my car hasn't looked this good EVER. I bought the car from a private seller almost 2 months ago but the car looks even better than when I bought it off him. Interior is looking great all around, exterior is looking sexy as hell with the waxing and the night and day difference between my headlights. My headlights even shine brighter now which is great. Oh and my wheels also look better than ever. Would definitely recommend and will be going back. The owner is a very cool and friendly guy.","useful":0,"funny":0,"cool":0},
{"review_id":"pHJyzXMTIBNeS2rM47UFlw","user_id":"PmiVJDxktF7CX6uMStltWw","business_id":"7fIPoM0scol228W2bx7G1w","stars":5,"date":"2017-04-20","text":"Honest Mechanics here. Only been here a few times but they have given me excellent service. From something as simple as taking off some of my plates that were hanging from underneath my car (for free) & also just went and got an oil change for my 350z. Full synthetic, did everything well. Even had a problem with the heater hose in my car breaking. Instead of trying to up sell me he told me to go to auto-zone and get the part and he would install it for $20. Some mechanics see a nice car and try to take advantage of you but that's not the case with these guys. He could've tried to tell me I needed a whole new hose and try to break me but he didn't. Very honest so I got the part and at first they said it wouldn't fit but they called me hours later while I was waiting and told me that he part did actually fit and that they wouldn't charge me for putting it on or for the topping off of the fluids. They did tell me to leave the guy a tip because that was his labor but nothing wrong with that. Great service so far overall. Definitely goig to keep going back and would definitely recommend you to bring your car here.","useful":0,"funny":0,"cool":0},
{"review_id":"bYNhiMb2vH-jTEoNvgErGg","user_id":"PmiVJDxktF7CX6uMStltWw","business_id":"bllbhpF4iReTO68tG0WgkQ","stars":5,"date":"2017-05-02","text":"Best massage I've ever had! It's so different than an American massage but also so much better than American Massages! I felt like a whole new person after the massage. They do so much stuff to you in 1 hour it's amazing! I felt like every bit of tension in my body was gone afterwards. I felt like a huge noodle. I'm also a therapist so my hands and forearms where really bad and I felt like the lady gave me a whole new pair of hands. If you haven't tried a Thai massage yet you need to ASAP!","useful":0,"funny":0,"cool":0},
{"review_id":"MIYfF8HNelWTjvQ4Ltiz4A","user_id":"rSlsywnkymvlvggoGDCx3g","business_id":"MJ_5HIvJMqu1fREQgUjWTA","stars":4,"date":"2017-09-17","text":"Visited The Highwood for the first time understanding it was a teaching restaurant. The price for a 5 course meal is very reasonable and the food is well presented\/plated and of great quality. Our favourite courses were the butternut squash soup and the entrees (lingcod and gnocchi). Our only area of improvement would be that we would love to see the waitstaff explain what's on the dish a little upon arrival to the table. During our salad courses we were not sure the sauces being used and would have enjoyed an explanation. \nIf you go here you need to be patient with the students and encouraging and remember we were all new to our roles once too. Will go back for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"hAIrki2p0QLomSLN4y-RkQ","user_id":"rSlsywnkymvlvggoGDCx3g","business_id":"w9hczkpc2wtB63Z7dvYD3g","stars":3,"date":"2017-08-08","text":"Tried Anew for the first time with high hopes for an exciting and exclusive night out. Their affordable prefixed menu stands out from the crowd. The restaurant itself is beautiful and the wait staff is knowledgable and kind. Where it fell flat for my party were the items on the menu and the food that came out. We had noted an allergy in the original reservation and after a phone call and promise of the allergy being taken seriously, it presented as the main fish on the menu. This limited our ability to partake in the 5 course tasting which is why we originally went. So we opted for 3. The food focused on small portions with unique gastronomy and plating. The taste and overall finish of the food could have been improved upon as my pork dish seemed under cooked and was leaking blood, it had the texture of raw bacon. The worst part for me was, I wasn't certain if this is how fancy restaurants cook meat and I was uncomfortable saying anything. The serving sizes are small but I suppose that is to be expected with the price of a multi-course dinner being so fair. So the reason I gave a three rating isn't because we hated it nor because we really liked it. It simply was an experience that we likely wouldn't repeat. We would rather spend our money somewhere that was more comfortable with larger portions and food that focused on taste and less on fancy cooking techniques (there was a lot of foam) and left us feeling fulfilled.","useful":0,"funny":0,"cool":0},
{"review_id":"nMS0zaoJDzUrSylqwwf_3Q","user_id":"rSlsywnkymvlvggoGDCx3g","business_id":"tdmpHupBal8ctbYyI8HtBw","stars":3,"date":"2017-05-12","text":"If \"meh\" could be a description I would use it. This restaurant left us indifferent. We went while it was relatively slow, four tables were full. Our waitress was slow to take orders and a bit spacey. Our food came out of the kitchen missing main components and we had to correct them. The meat however did taste good and the beer selection is decent. Overpriced for the quality of grub. I probably wouldn't visit again.","useful":0,"funny":0,"cool":0},
{"review_id":"p_bXAuEJafq2mRjGUOf5fA","user_id":"rSlsywnkymvlvggoGDCx3g","business_id":"Y2Z7sMQV8vK3Uva3wWXjPQ","stars":5,"date":"2016-01-21","text":"Bubbles is my favourite car detailing place in Calgary. I take my car here anywhere from 2-4 times a year depending on how much I travel and the weather. They always have friendly staff, do an amazing job and are timely. I would recommend bubbles to anyone looking for a quality clean!","useful":0,"funny":0,"cool":0},
{"review_id":"7hDcQoidqL0MzYm_lfuehA","user_id":"rSlsywnkymvlvggoGDCx3g","business_id":"r1yhavKIFik5sH0ovujlYw","stars":5,"date":"2017-09-30","text":"Outstanding Southern Fried Chicken!  Quality chicken, with a flavourful crispy coating. Some of the best I've ever had!  Coleslaw was fresh and uniquely seasoned. Def go back!!","useful":1,"funny":0,"cool":0},
{"review_id":"5voO1GVvpgeeanJBpTJ_SA","user_id":"Dyifp3W0a8ayisbTmy6m4g","business_id":"qpBfYbkPmXIFWVQ7pLkQ_w","stars":1,"date":"2014-04-07","text":"First of all, let me say that I love our local Olive Garden in Rochester, MN.  I love Olive Garden's menu, so we dine out at the chain somewhat regularly.  We went to this particular restaurant yesterday for a dinner with an elderly relative.  I suppose when we walked in, they profiled us and didn't feel we merited any kind of special or polite treatment.  We were led to the most cramped, dingy and dark booth I had ever seen in an Olive Garden restaurant, where the lighting was so bad, we couldn't even see our menus.  Our server was Sergio, and he was just going through the motions--quite badly.  He didn't smile once, or come back and ask us how we were doing.  He brought the salad, and then we didn't see him for a half hour or more.  Then he came and picked up our salad plates before he served our entrees and actually left the dirty salad plates on the tray beside our cramped dungeon-like table for a long time.  To top everything off, the family behind us were the rudest, most uncouth trash I have heard or seen in some time--they need their own reality show on some trashy network.  Their 2 or 3 year old brat was allowed to screech inhumanly for their whole meal, which unfortunately overlapped ours.  When we finally got our food, it was hot (unbelievably) and tasty, but everything else about the visit was a complete and total fail.  I would be surprised to imagine that the Olive Garden franchise can condone this kind of service and atmosphere.  Luckily I was just traveling through and don't have to ever eat at this hellhole again.","useful":0,"funny":0,"cool":0},
{"review_id":"zw2I3S4wCUiyNKGSKi4-tA","user_id":"LYkIBWee3WwvAHg7XugmJQ","business_id":"1N5Wjt-EbMCxU3--19WcAA","stars":5,"date":"2017-08-01","text":"My whole experience with the group at Reynolds Plastic Surgery, as well as with the anesthesiologist, Paul Reynolds, could not have been better.  I personally think both men are geniuses, and would never have entrusted my face to anyone else!  Each of the members of the office were so consistently kind and knowledgeable that they put me immediately to ease, and, in fact made me laugh!  The whole experience was a joy.","useful":0,"funny":0,"cool":0},
{"review_id":"809J-X9fyn7XTBo0P0H-Kw","user_id":"LYkIBWee3WwvAHg7XugmJQ","business_id":"G5kOmXY9E7_8_-WaUsjojw","stars":5,"date":"2017-08-09","text":"We love our new deck cover!  Every part of doing business with Perfect Home Products was excellent.  From the beginning phone conversation with the office for an appointment, through the gentleman who came out and did the measurements and quote, and especially the hard-working and excellent builder who constructed our deck cover, all transactions receive 5 stars.  The finished job is beautiful, and well-worth the reasonable cost.","useful":0,"funny":0,"cool":0},
{"review_id":"FRwCUyAiHSfO6YxK0Y5Gtg","user_id":"L_6cWisEULmKs-XIdeDCzw","business_id":"Ac7C2H4E363qVQEHpONLLw","stars":1,"date":"2011-05-05","text":"Is this South Central Los Angeles?  Cause this place is GHETTO. \n\nWas in from out of town visiting friends and my wife wanted to grab some bubbly.  Narcisse came up as closest place on my iPhone so we gave it a shot.  What a bad, bad decision this was.  \n\nWe walked in and thought we were transported to Russia circa 1990.  The decor is so over the top nouveau riche we thought Tony Montana was going to walk out.   \n\nWe were sat pretty quickly but did not get even a hint of service for nearly 10 minutes.  When the waitress finally came over she was a bit pushy as though it was some how our fault we didn't have a drink yet.  Whatevs.  So we ordered some pagne and while it was decent enough, it was definitely overpriced.  \n\nOrdered a couple of the small plates and the food was mediocre at best.  We had the fries, which were overcooked but sauce was decent, and chicken drums which were overly greasy.  \n\nNext time we are in Scottsdale we will avoid this place like Abbottabad","useful":6,"funny":10,"cool":0},
{"review_id":"c7jI4EytMCj8iD2g-gT1MA","user_id":"WsAf0ocPEc8bh0xAWsB1Og","business_id":"ZPWEawq1b37IcMFH9zA-_w","stars":5,"date":"2014-08-01","text":"Love the Italian sodas that they have here! Will go out of my way just to have a soda! I've had their coffee too but the soda is my favorite. \n\nThe only thing I wish they would do for more convenience would be to stay open later than 5 pm.","useful":0,"funny":0,"cool":0},
{"review_id":"fR_EMDYaI1VCGZWEzGximQ","user_id":"WsAf0ocPEc8bh0xAWsB1Og","business_id":"g-E12y45gBKedax5N20YmQ","stars":4,"date":"2014-08-01","text":"My family has had this before but today was my first time. They were very friendly and patient. Allowing me to look at all ingredients before preparing my food to order. \nThe food was a huge portion for the price, making it a great value. Will definitely be returning.","useful":0,"funny":0,"cool":0},
{"review_id":"Hsq-NGQweojoMJChkBqnpA","user_id":"i5ZAAwI-ihrr350V6MgOAg","business_id":"e7g2AnsvfeQBga5_F84oUw","stars":5,"date":"2015-06-17","text":"I have the distinct advantage of working with Dennis Sage Home Entertainment as a vendor, customer and competitor.  We have a nearly 15 year relationship which has been incredible.  As a competitor in the early 2000's, he and his company demonstrate the highest level of business ethics.  As my customer, DSHE was a joy to  work with, helping me grow my business and supporting our technology initiatives with his insight to this ever changing industry. Then I had an opportunity to be a customer.  My mother needed a flat screen TV and installation of all the associated gear, and DSHE was awesome - my mother could not have been happier.\n\nOh yeah, Dennis has also become a trusted and true friend over the years.  If you check out his web site, you will see he is also a trusted and true friend to many charities in Arizona; and he plays the guitar - how cool is that.\n\nBobby Russo","useful":0,"funny":0,"cool":0},
{"review_id":"uf-BU4MquHapVtFt6E3amQ","user_id":"WjmWNxvDNcnjTT0t_uDofA","business_id":"3FlWR_osNPb8dcqLgHebHw","stars":1,"date":"2012-03-10","text":"Should have gone to Dunkins Donuts.  At least we could have gotten fresh bagels.  Eggs benedict had no english muffin and even the carrot muffin was stale.  The butter was cold and hard.  The food was awful and there's a lot of old people around.  When did Mimi's become Coco's??","useful":0,"funny":0,"cool":0},
{"review_id":"xzwzwzoj2PXV7EpdQ6n4iA","user_id":"WjmWNxvDNcnjTT0t_uDofA","business_id":"Cni2l-VKG_pdospJ6xliXQ","stars":5,"date":"2010-02-06","text":"Not only is the meat good, but it's cooked to perfection.  When you ask for medium rare it's medium RARE.  Good job.","useful":0,"funny":0,"cool":0},
{"review_id":"8JrUFRSpevqsm-CEodjyRQ","user_id":"WjmWNxvDNcnjTT0t_uDofA","business_id":"IqCvkoDvvImXuzGrpeiDMA","stars":5,"date":"2017-11-25","text":"Pretty amazing place from top to bottom. Drinks were great too. We had visiting chefs from Bravo's so not sure how accurate this review is on regular biz days. Everything was fresh and the chips are great.","useful":0,"funny":0,"cool":0},
{"review_id":"oHs6RYZQWi3MhRu_84mHtA","user_id":"fXzCO0bwxw8gZUe0r6jvhA","business_id":"ArmAaGCdCVAlkhdtaT6RzQ","stars":4,"date":"2014-08-05","text":"We really liked this place. Great set up and very friendly. My jalapeo BBQ burger was very good and the salted caramel milkshake was excellent. The truffle fries were much better than I had read in reviews - in fact some of the best I have enjoyed. \n\nWe look forward to going back and trying some other items.","useful":0,"funny":0,"cool":0},
{"review_id":"qvvnx8C7V8amK8pEA2adFg","user_id":"fXzCO0bwxw8gZUe0r6jvhA","business_id":"7b-oOlOWK8T5ceVH1sMz3Q","stars":5,"date":"2015-10-09","text":"Great honest people!  Lance and his crew rock.   Sold me what I needed and did not try to push me into something I didn't need.  My 2003 Jeep Rubicon's system sounds awesome and did not cost a great deal.","useful":0,"funny":0,"cool":0},
{"review_id":"J_K0PAP4I5sKtVGkdjTIgQ","user_id":"ZQ0qR2raVrk9MC_Fh147lg","business_id":"icco2swWSWYyItdI_ktyvg","stars":5,"date":"2017-07-05","text":"Wow we are visiting relatives in town. What a delicious tasting pizza. Sauce has a slight kick to us it was the best pizza we've had.  Thanks will be back when we are visiting again. Damn can you open a store in Anchorage?","useful":0,"funny":0,"cool":0},
{"review_id":"ShFefzdYKb-FKkCALbGEhQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"9kk7eaffUzXwh-KLmKLxzw","stars":4,"date":"2015-10-23","text":"This is a nice place!  Fresh fish, polite staff, and generous portions.  We tried the salmon and snapper, both were great.  We probably ordered too much because we loved the chips and salsa that we started and finished with.  Would recommend their margaritas!","useful":0,"funny":0,"cool":0},
{"review_id":"9IGBmxzYveMkIgT8v3xrWQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"EV1jAj7NFNmNIqOnwZ4Acw","stars":3,"date":"2015-08-13","text":"If you like music, bands, dancing this is for you.  If you like food and drinks, it is okay if you can get past poor service and staff that do not seem to like to work there.  We enjoyed for the music and dancing, so it was okay for us, but service really needs to be improved.","useful":0,"funny":0,"cool":0},
{"review_id":"w9f2AaSo0XPnX5JN4iB_rg","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"lsKv0IDdj3c6Y8bT6taxSA","stars":4,"date":"2015-07-20","text":"This is a true bar\/grill and we liked it.  The zucchini appetizer and the fried dills were fabulous to start with.  I had the veggie wrap and it was really great also, fresh and tasty.  They have a lot of choices on burgers and sandwiches, which all seemed popular as we saw multiple different sandwiches being served adjacent to us.  Prices were average to slightly on the high side, but the food was good, service fast and friendly.  The 20 ounce very cold beers during happy hour really can't be beat!   It is supposed to be a sports bar, but it really does not have that feel, not many tvs, or loud groups. Great place, will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"02_u8zXxJRbLWU2Fc5vyLQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"lHgr2wxDiOcEt3n40BcKmg","stars":4,"date":"2015-09-03","text":"Really liked a tiramisu cake that a co-worker got for a party, checked this place out and was pleasantly rewarded.  The white chocolate mousse was a great flavor and texture.  I tried the macaroons and really liked them, never have been a fan of them before, but I probably never had French macaroons.  Would recommend them.","useful":0,"funny":0,"cool":0},
{"review_id":"TBfOfErg1LKwYK_4Wpv4GQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"iJi7yebXoPVXRyGqqL-v8g","stars":2,"date":"2015-07-09","text":"We tried this place after looking over some of the reviews, noting that many are good, but not some were not so good.  We were hoping for a good experience, but ended up in the not so good group.  The general appearance of the place was above average, but our waitress immediately gave us the impression that she did not want to be there.  Maybe it was a bad day for her, but it led to us waiting a long time for initial service and a long time for drinks and food.  The wait might not have been so bad, if the food was great, but it really was not.  The mac and cheese was too little cheese and too much on the chilis.  The hummus was blah, no real taste.  The drinks were okay, nothing special, but the overall prices were on the higher end.  Won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"WFkckEJ2cRuf6tOrnVerHQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"pjpUOlJLlkIxBZ5BquA2PA","stars":3,"date":"2015-07-21","text":"I think sometimes a when people hear a place is great, it may influence the reviews they give it, and I think this place is an example of that.  This place serves okay food, has an okay wait staff, has average to high prices, but really does not live up to the many glowing reviews that it has, rather it appears most consistent with reviews like this, where it is okay, but not tremendous.  We ordered three pizzas for the 7 of us, and our opinions were all about the same, they were okay, but not great, one was truly sparse on the toppings.  The beers we ordered were good, but not cold and the glasses not chilled.","useful":1,"funny":0,"cool":0},
{"review_id":"so2zrWzSStK1S4hGsAo2WQ","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"Kq8v2R5g9cpQF7QRSlQOMw","stars":4,"date":"2015-03-10","text":"So, a friend told me I should try the Veggie Bobbie, and I did.  It was like having Thanksgiving Dinner in March!  It was tasty, big, filling and fabulous.  If you are a veggie lover, just try this!","useful":0,"funny":0,"cool":0},
{"review_id":"zP0wy0GGbCyj5zOUxGOOFg","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"E-LZ0Xl1ETDeMrtM9H3-PQ","stars":3,"date":"2015-08-04","text":"Second time here for a Sunday lunch, this time, not so great as the first.  The really limited 5 entre menu is fine if you find something you like and really want, or if you could find two that you want to share, but if as it was this time, you really do not find an item that jumps out at you, then it is not so fine.  The food was good and fresh, both times, but selection is a weakness here.","useful":0,"funny":0,"cool":0},
{"review_id":"I-EPiOqqzr_7pqOXWZ22Iw","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"poX-2lODvtmkR6pve8FXFA","stars":4,"date":"2015-08-04","text":"Really good sundays on national sunday day for $2!  Can't beat that.  We liked the place, clean and kept that way with circulating staff in the dining room.  Try it!","useful":0,"funny":0,"cool":0},
{"review_id":"XrC43n8UlLJn6CK-qxD1IA","user_id":"p4Yw4GqZIabkNRZUsp5KGg","business_id":"eS29S_06lvsDW04wVrIVxg","stars":4,"date":"2015-09-04","text":"There are nachos, and then there are Barrio nachos, a bit spicy for my tastes, but the toppings and tastes just do not quit.  That with so many tequilas to try, it will make your head spin, literally.  Will be back.","useful":0,"funny":0,"cool":0}]