[{"review_id":"brCfER-ZntkUbb6QzSsbuQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"qFqueIKCVF5PlXmjl1YY9Q","stars":5,"date":"2015-12-12","text":"This little gem squeezed in between shopping stores in Gilbert is heavenly. The flavors are endless and I I love how they allow you to taste test the gelatos. My favorite is the sea salt caramel also the cinnamon apple pie. Even with this cool weather out there, I still crave a scoop of Frost. I wish they had a location in Mesa.","useful":1,"funny":0,"cool":0},
{"review_id":"t63o_lu8ZkxfHDHpmf8atA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"AP1KgDB5dzaykTkY0dRFgA","stars":5,"date":"2013-05-03","text":"My dentist (Dr. Moeller) is nice and professional plus he's fast. I haven't seen him in a while so I thought he was going to give me this long speech about teeth, etc. but it was the opposite. He is very caring and I would recommend him to all my friends and family.","useful":2,"funny":1,"cool":0},
{"review_id":"smdqEENtSy4sSWGZ8CxwzA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"u6xb2aUAvX6i1WhsQWqgWg","stars":4,"date":"2010-11-17","text":"This wasn't a word-of-mouth situation, I was simply surfing the net to find something similar to LA's Roscoe's chicken and waffles and found this tiny spot squeezed in downtown Phoenix. I wasn't expecting anything impressive, but Lolo's took me by surprise. I didn't care much about the presentation on the plates but the food was tasty, well-seasoned especially what I ordered the fried catfish with scrambled eggs\/cheese, i'm not a cornbread person but it was offered on the plate and it was good. The atmosphere was great and the service there is on point, they were coming by the table making sure everything was ok. I went on Sunday early afternoon, so i'm not sure how it is on a Saturday. One thing for sure, you won't be disappointed. The price is also very reasonable.","useful":1,"funny":0,"cool":1},
{"review_id":"eiJu9MDe9wXOCV7-LlFJ5Q","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"qq3TGTiNVTDSPf9rHpizPw","stars":5,"date":"2017-06-23","text":"He is very kind and very patient...I am dealing with bell's palsy and he is helping me deal with it. He has been my doctor for three years,  I feel very fortunate to have him as my doctor.","useful":1,"funny":0,"cool":0},
{"review_id":"Tr31u01Lah6y2cN38_nRNw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"zT45hBptOygpgCddHZRsjA","stars":5,"date":"2013-05-03","text":"It's like entering a Wonderland of books and gifts, I get lost whenever I enter this store. It takes me back to my childhood and always gives me this NY feel, you can tell how much I miss NY cause I'm always going back to Changing Hands to see what's new, what's the latest event going on. They also keep things up to date on their website. I get all my journals there since the price is cheap, not expensive like Barnes and Nobles. Journals start at $10 which is not bad compare to $15 B&N price.","useful":0,"funny":0,"cool":0},
{"review_id":"9RJkVSL6oz0DYABU5SzLeg","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"0FUtlsQrJI7LhqDPxLumEw","stars":5,"date":"2015-12-12","text":"I don't have anything negative to say about Joe's Farm Grill, they offer plenty of healthy choices, the food is not greasy and I LOVE their sweet potato fries. My first time there I wasn't sure whether I was in a restaurant or fast food joint, then I was surprised to find out you can enjoy nature by having your meal outside where there are plenty of seats, shaded trees and chirping birds. Although, I wouldn't sit out there in the heat when summer crawls back again. This is a great spot to even take professional pictures. Once I was there eating when a bridal party walked in to take pics. It was a nice treat.","useful":4,"funny":0,"cool":1},
{"review_id":"6khXTSXtEMkMBl8ZPG8MrQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"BngVzrOVcYoCTmPT7CpIlg","stars":5,"date":"2015-12-12","text":"When Pita was at their original location in Mesa it was my first and last visit there. I walked in with my friend, not knowing what to expect and we were the only customers but greeted warmly. I was impressed with their food especially the hummus, the rice and their tender meats. I did grab a business card knowing I would go back for sure then found out they closed. I am excited to know of the new location in Tempe. The food is amazing and employees are very friendly. Also the atmosphere\/decors makes you feel like you're not in Arizona, as if we are taken away in a time capsule. Love it!","useful":3,"funny":0,"cool":0},
{"review_id":"WWvrJyxWLpfNq1Xtcm-euQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"ydhgMcBh4A_eihzEAg9LLQ","stars":5,"date":"2013-05-03","text":"I don't even know where to start when it comes to this place...let's just say the day I move out of AZ that's the ONLY thing I will miss about it is In n Out. I can't say the weather or the red mountains or lakes, nope...BUT I WILL for sure miss the burgers\/fries of In n' Out. In a couple of weeks I will be there to splurge on another double double (I don't have it often). I try my best to resist, but the smell alone makes me crawl back to this comfort food and keeps me in the zone. See what I mean...I just had a moment.","useful":1,"funny":0,"cool":0},
{"review_id":"BAhQERdP2tUqdLi-DisECw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"EIol8eFrS4WtRUhGbOUUgA","stars":5,"date":"2013-05-03","text":"One day I complained to a girlfriend who is from Queens NY how much I miss NY pizza and she was the one that mentioned this place to me. But I ignored her wonderful comment \"this is the real NY pizza and it taste just like it\". The place is down the street from me, so I stopped by and when the smell of their pizza hit my nostrils I remembered her comment...she asked them if they were really from NY and she was told the entire family is from Long Island. After one bite of my one slice of pizza I was taken back to BK (Brooklyn). With closed eyes I had another bite and another and I found myself coming back for more. I am glad my friend told me about this place and I've taken other friends to experience the same excitement I have.","useful":0,"funny":0,"cool":0},
{"review_id":"Aj48VHm6vuq6YRHLwx4R8Q","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"XEnEtoa25olB0tyjc6Jzqg","stars":5,"date":"2013-05-03","text":"I love stopping by this secluded spot. Quiet, relaxing and their employees are always helpful. I'm there when I am under the weather and need their assistance with any herbal medicine, from food\/digestive enzymes to milk thistle for my liver. This place is great and they even offer therapy, massages, etc. Never a disappointment.","useful":2,"funny":0,"cool":0},
{"review_id":"end7sWqbzzaYB8eGR6Zd2A","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"_18eAwEHvc6RSa6MeynXag","stars":5,"date":"2013-05-03","text":"My first visit to this restaurant gave me this East coast feel, I felt right at home when I ordered the chicken with rice and plantanos...I was full. Their portions are generous and love the fact that they were very attentive to our needs. The music in the background is cultural, love Havana's and I am sure to come back with some friends.","useful":0,"funny":0,"cool":0},
{"review_id":"PZzUCuYr7R_Na_yzNy7v1A","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"npmFDfZKWEXq7EyWcQ3ujQ","stars":5,"date":"2013-05-03","text":"I love this store which I discovered less than a year ago, the only problem is exiting once you walk in. I am really into natural herbs and being your own doctor when it comes to medicine so this store has all ingredients you need to keep you healthy. The store is clean, the employees are focused, ambitious and helpful.","useful":0,"funny":0,"cool":1},
{"review_id":"zcENac4LXSMzyw1FiWGKQg","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"YPavuOh2XsnRbLfl0DH2lQ","stars":5,"date":"2013-05-03","text":"Love the atmosphere, the art pieces on the walls, music is entertaining. I love coming back and it reminds me a little of Roscoe's in Los Angeles. Their chicken is nicely flavored, love their wings, I can eat 10 of those and still ask for more. Their portions are perfect for the price and service is great...no complaints. I've been there four times and never had a bad experience with them.","useful":0,"funny":0,"cool":0},
{"review_id":"owu_EcR6xLRp5X8NY3nkZw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"IsKUJOHyRX5Trp7Xo1m6LQ","stars":5,"date":"2013-05-03","text":"I love coming back to this library, it's very relaxing with upstairs\/downstairs. I was able to do my taxes there for FREE. The employees are professional and nice, helpful. I've rented numerous movies from them which they give you 2 weeks to return or call to renew them for another 2 weeks.","useful":1,"funny":0,"cool":1},
{"review_id":"Cy8eX-VG82xqJ1eVf_zzIA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"pL-QrHxQ0kHBDA1ZyOjGQw","stars":5,"date":"2013-05-03","text":"Almost every week I was at Wholefoods but it got too pricey to get myself a $2 croissant on its own. It was time to wean myself off and focus on what my body really needs veggies and fruits. I was also hooked on their peanut butter smoothie but noticed it was giving me a bloated belly so I had to stop. I don't recall the last time I had their addicting pb smoothie. I also used to get their wheat grass which the shot is not bad at all. I love their parsley and cilantro which are fresher than Sprouts. I can go on and on about Wholefoods, but it would take more chapters and chapters. In Union Square's Whole food their scones were huge and delish...ahhhhhhh.","useful":0,"funny":0,"cool":0},
{"review_id":"cW6dsom0Axr7-7UyyNi-Og","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"Wi1C9IC7-xcA1a91FtQwog","stars":5,"date":"2013-05-03","text":"Very relaxing, casual atmosphere. Parents bring their kids, music is being played and the workers are very attentive, the scent of coffee keeps you smiling. Two weeks ago I read some poetry there at open mic and although I was the only poet who read they made me feel welcomed. I haven't tasted their food so i'm not sure about their menu but as for the owner, she seems very sweet. I can't wait again for another open mic night. I will for sure try something in their menu.","useful":1,"funny":0,"cool":0},
{"review_id":"OflUpcEI8brA0lln6R1zFg","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"DhRJJ5aUUuBp3XR1JbLeuw","stars":5,"date":"2015-12-12","text":"Sauce has the kind of thin-sliced pizzas you can't stop grubbing (lol). I usually order the chicken sausage pizza with sweet grilled onions. I believe it's eight slices per pie. They also make those amazingly huge chocolate cookies which you will be tempted to grab and run away with since you can see them there staring at you on the counter next to the cashier. The location is great and the employees are friendly. Their service is quick, in less than 15 minutes they have my pizza ready when I do takeout. Their prices are reasonable. Never a disappointment.","useful":6,"funny":3,"cool":4},
{"review_id":"sjLJaGW2OSkVzm92spNqJQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"_S_nsQxbWI5hpSdR_71WPQ","stars":5,"date":"2015-12-12","text":"Beautiful store with endless choices, I take my time going from aisle to aisle. I love their food section where I purchase olive oils also the kitchen section.","useful":1,"funny":0,"cool":0},
{"review_id":"IWhOWafQW66wkWBxT5UULw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"ipFobdM6X_4SNMA9ZBfdAQ","stars":5,"date":"2013-08-07","text":"I have never been to Pita, this was my first memorable visit there during my lunch hour. I thought since it was very crowded that it would take forever to get my food but it took less than 10 minutes. I ordered their broiled chicken pita and it was very tasty. The only thing is that I should have told them without the garlic sauce since it makes my pita a little soggy but besides that I enjoyed it and will definitely go back to explore more on the menu. Atmosphere is noisy and busy, the employees are very helpful and professional.","useful":2,"funny":0,"cool":0},
{"review_id":"KhOY285mmvpKj0UMfVt2kA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"30Q5xBagQHmkwp8Q9I1FCg","stars":5,"date":"2013-07-12","text":"I have been discouraged by the many restaurants in the valley and I'm always very picky about the places I've tried in the past. Today was unique, I decided to dip my toes into this Caribbean spot since I've read the reviews. I got there after 8pm since I was starving and not in the mood to cook dinner so late, I decided to give this place my full attention. I noticed the details as far as the Jamaican music in the background, the décor made me feel like as if I am somewhere lost in Jamaica by the sea. Only the sultry breeze and ocean were missing. There was only one lonely chicken patty left so I ordered it plus ordered the oxtail with white rice and cabbage with carrots. I ate the patty first and was blown away by the flavor,  I had to look around to make sure I wasn't somewhere in Brooklyn. I can only imagine if they have a Labor Day parade party in there, it would be a success because their food is already authentic and flavorful. This was my first visit there and not my last. I will make sure to stop by again maybe on Saturday to get some more patties. This patty had my eyes closed and toes curled and when that happens, to me that's a good sign. Not at all disappointed and the employees there were very approachable and nice. I had my food to go and splurge at home, I ate my patty before exiting Ocean Blue and got so excited, wish they had more patties. Again, I was blown away. The only negative to me is that the patty was a bit pricey, $2.25 for one patty but hey, at least I can close my eyes and pretend I am in a hole in a wall in New York.","useful":1,"funny":0,"cool":1},
{"review_id":"N2hFtSI6MBtGMIq5Nu7SXw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"z-m0Dj_ea_SQra2kYds1Dw","stars":4,"date":"2013-05-03","text":"I am very picky when it comes to my bread. I don't buy cheap-looking breads. I either get them at Trader Joe's or here. I happen to be at the mall with a friend when she suggested Paradise Bakery, of course I wasn't impressed since I don't usually eat out. But I decided to order something simple, I decided on a Blueberry bagel. She asked what kind of bagel? Saw blueberry on the menu and I asked toasted. Once I spread the cream cheese on the toasted bread, I was hooked. I devoured it in less than a minute, it was like a vacuum and before you know my girlfriend who was still having her Chinese food asked me if that was enough. I replied nope and she said \"have another one, my treat\". I couldn't say no, the blueberry bagel was the freshest bagel I've had in a while. Again, i'm not a bread person, well I thought I wasn't, until this experience at Paradise. It did give me a preview of Paradise ;).","useful":0,"funny":0,"cool":0},
{"review_id":"OHzu6Z20-S1Q2JpYextP1A","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"ZHQU79PMUGCX0fEoyCcWlw","stars":3,"date":"2013-07-18","text":"I had high expectations for this place and when I called them late last night to ask if they had any patties I was told \"many patties\". I got there after 9pm and ordered 2 chicken and two beef patties plus jerk chicken with white rice and cabbage. The jerk was flavorful but a bit too salty for my taste, although the chicken was tender, falling off the bone, I feel it was a bit too salty and the white rice was ok, not dry which was good. Now, when it comes to patties, I go for texture and taste of the meat. First I had the chicken which had spice but the crust of the patty to me wasn't all that great, a bit soggy which I think they put them in the microwave, to me that's a no-no with Jamaican patties. Patties to me are supposed to be flaky and the meat should have good spices. Both patties were ok, not all that thrilling. The place was clean and empty, the employees were friendly but both were in the kitchen area leaving the front desk empty, I had to raise my voice to have someone help me in the front. So it's not Ocean Blue Caribbean restaurant where I felt right at home.","useful":1,"funny":0,"cool":0},
{"review_id":"2GSq1kxKHRdwLeAXF9pm6A","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":4,"date":"2014-02-19","text":"It was on a Sunday afternoon when I planted my heart in this restaurant. I didn't expect to fall in love with the décor not to mention the food...I was a little nervous ordering but after I ate their pizza my belly didn't have any bad reaction to their cheese or meat so I was relieved. I will definitely return","useful":2,"funny":0,"cool":1},
{"review_id":"yIU-sbkk4t1nDnT_MCsQiQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"2lF1UsGcDpDpaI1lXgRX_g","stars":4,"date":"2013-07-12","text":"I ended up in this restaurant by accident. The only reason I didn't give it 5 stars is because their nachos were not enough for 2 people, they had to refill our basket twice since we were munching on them like they were the last snack on earth. As soon as we walked into this place I felt I was eating at an upscale museum, the décor is simply beautiful and refreshing and I even told my friend I feel I am not in Arizona, feels like we are somewhere in Mexico. I ordered their lemon salmon with veggies and rice, again food is very flavorful but to me the rice was too small not enough, the salmon was a good portion but rice and veggies to me didn't fill the plate cause I wanted more. I would definitely come back with friends and try something new on the menu or maybe order the same salmon again since I wanted more, it was very tasty with the lemon butter on top. The waitress was sweet and helpful, our order didn't take too longer to come to our table. I was a  happy customer.","useful":1,"funny":0,"cool":1},
{"review_id":"m8ONS-Jl2PYICyYlZltDJA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"DE37j9FjAfysF5q7jQ507Q","stars":5,"date":"2013-07-15","text":"I can't deny it and even if I wanted to it wouldn't be in my nature to lie about this, but I went to Mayo to run many tests that had to be done all day and so I was starving when I stopped at their cafeteria and was blown away by all the choices offered for lunch. I ordered myself a turkey burger that day and it was quite tasty. I love the ambience and how the employees were very friendly. Also this cafeteria is huge and CLEAN.","useful":6,"funny":0,"cool":2},
{"review_id":"OGGrMpvhLRX0x58DEPGJSw","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"SOwXfqwUr6NWmbBS0tx_GA","stars":5,"date":"2013-05-03","text":"Weekly I stop by Trader Joe's and it comes to mind when I think of a good piece of baguette bread.  Their Garlic & Thyme bread has my name on it...I usually put it in the oven until it's crispy then spread my cream cheese over it or Trader Joe's garlic butter. At least 3 times a week I am strolling their store for either my polenta or garlic bread, kale or turkey meatballs. I keep telling myself to stop shopping but I go for quality when it comes to my food and that's the best quality so far especially if you are into organic or good quality.","useful":2,"funny":1,"cool":1},
{"review_id":"HtJjpQrICi1fdvgfcY-1dQ","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"d48RG4PGGtz4qy_wmNVKIg","stars":5,"date":"2013-05-03","text":"Four years ago I met Rambha when she didn't even have her own store yet, she was renting a space at a nail salon and when she first did my eyebrows I was totally amazed by how clean it was and she wasn't pricey. Four years later she has her own place and the price is still reasonable. She is still the same sweet lady I met four years ago, very humble and sweet. I don't  trust no one else with my eyebrows and she knows it.","useful":11,"funny":0,"cool":1},
{"review_id":"XTtHsyPExgJLw6qh3UrEKg","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"jlbP9Yd0AQP8OlcsFkZ4hQ","stars":5,"date":"2013-05-03","text":"It's huge, you can get lost and not come out without buying something also the food in the cafeteria is all fresh and delish, try out their corn bread and also the grilled fish. Even if I'm not planning to buy anything new for my place, I simply love to walk around just for the exercise and to admire anything new they have out.","useful":1,"funny":0,"cool":1},
{"review_id":"SCzO6112C8URCv3EjaKMdA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"gJ1qSDxS7Gmx_85vmc-_tA","stars":2,"date":"2013-05-03","text":"I've tried to eat too many times at this place and can't seem to \"love\" it. The atmosphere is clean, quiet and I would suggest at least put some Jamaican songs in the background to attract flies. The only thing to me that is so so is the beef patty, but nothing beats New York...I can taste the difference. It's definitely not Golden Krust. I've had their jerk chicken with rice, again to me it tasted funny. I really don't think they're from the Eastcoast. So instead of complaining about it, I stopped going there period. I'll get to taste the real deal when i'm in Florida.","useful":1,"funny":0,"cool":0},
{"review_id":"XWPiG-8stalJOJx8v733bA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"ckDRF9VdNQKZANBBOM4wKg","stars":4,"date":"2013-07-17","text":"The very first time I experienced Zoyo's was in their Tempe location with a group of friends. I had 2 different kinds of flavors mixed together and a simple topping which I don't remember the name but I do know it was delish. I took my time to finish it plus I couldn't believe this was GF (gluten-free). I usually have tummy issues with ice cream or yogurt but Zoyo's didn't give me any headache. I went for more a month later to bring my mom. She loved it.","useful":2,"funny":0,"cool":0},
{"review_id":"XLQYLh-aEplsZTJsRrO16w","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"7CzA5GqrELLJyRoaJQhlGA","stars":5,"date":"2013-05-03","text":"Spanish food to me has to be fresh with flavor. I went to Moreno's by chance one day with a group of friends\/family. I ordered 2 small tamales and found myself wanting more so I ordered 2 more tamales and was impressed by the flavors colliding inside my mouth. I've been to their Mesa restaurant and had the same experience when I ordered their chicken tacos and was blown away. Their food is delish and their price very reasonable. Love the atmosphere and their employees are clean and professional. Two thumbs up!","useful":0,"funny":0,"cool":0},
{"review_id":"vQhchzLliPfnIxPM1n83gw","user_id":"aQyS6I9_36hOKKaCtcahUQ","business_id":"hi09hGiB87ajd1RzEOJ7RA","stars":1,"date":"2014-10-18","text":"Bartenders are thieves. Besides the service is the worst ever, They charge you  whatever they want. I ordered 1 beer and 1 tequila shot and this guy was charging me 25 dls :\/ I asked how much were the drinks and he did not know what to say. Then I went to an other bar station and the same happened again 1 beer 12 bucks??????? I asked why the beer before was 6 bucks And the barmaid said that after 2 am the price goes up Not going back ever.","useful":0,"funny":0,"cool":0},
{"review_id":"V369T6yj_UhbW9Hvhey3UQ","user_id":"aQyS6I9_36hOKKaCtcahUQ","business_id":"TtsaJ5aWVrvE2fybKPwdjw","stars":1,"date":"2014-12-06","text":"Service is really, really, but really bad :'(  our waitress came to our table once to take our order 25 min after we arrived, no coffee. I had to stand up and served it myself . then the food came 45 min after we ordered it and our waitress did not give a fork as I did not have any utensils.","useful":0,"funny":0,"cool":0},
{"review_id":"TqJiOUhLfdeITHE6lyy2ow","user_id":"aQyS6I9_36hOKKaCtcahUQ","business_id":"P8rCpSJ4uWNE__pypJsgGA","stars":3,"date":"2014-10-29","text":"Place is cool with a different stile. The only thing I didn't like was the price for what you got,I ordered a double mojito and thought it was going to be a big drink such as la destillerie type BUT no way.... I got a really small drink and tasted like water for 15 bucks plus tip????  then the food  looked good but for that price I prefer not to spend 17 dls on 2 quesadillas.","useful":0,"funny":0,"cool":0},
{"review_id":"FWgU8rn0ZuCV7qYzVQho2Q","user_id":"GQkrlnGQn1YWYNolUktsyg","business_id":"7mgNBuU68N5fzdG3JxN1XQ","stars":3,"date":"2015-01-24","text":"I went there for buffet twice. Moving from NYC hub of Indian restaurant, I am ought to be biased. I certainly have had better food. It gets crowded on weekend, wait time could be overwhelming. \n\nFood was okay there were plenty of dishes to try, Chicken tikka was good. The appetizer is average. Tandoori chicken was okay could have been better. The goat curry was not something I would recommend some one. Vegetarian dishes were better than the non vegetarian dishes. \n\nI was actually surprised to see it so crowded.","useful":0,"funny":0,"cool":0},
{"review_id":"ejMrSBZA62SIBknw6YziyA","user_id":"m23DOjUcJT5eTOe5UTROSA","business_id":"QUwzjNeegM1543YLphMb9w","stars":1,"date":"2017-05-27","text":"Racist place. So unfortunate in 2017. If you're white this is for you. 1960s. All other races, good luck at the door. Taking my money elsewhere","useful":1,"funny":1,"cool":0},
{"review_id":"bBlqEsdn2Z05btcwbwIqZA","user_id":"K6dBDSwn2lOtyllTEvHJlA","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":1,"date":"2015-08-12","text":"STAY AWAY, A MAN TOLD IS HALF SAVED.\n\nSo, you want to go to Las Vegas and bring you kid with you because you think Circus Circus is appropriate for your child entertainment, well I got news for you; DON'T!!!!. I had an horrible experience in this hotel, let me start by saying that I have asked for a non smoking room and I received a room that has nicotine stain all over the sealing and walls, I have a 3 years old daughter, and that was unacceptable, we literally couldn't breathe. Along with my daughter, my wife and my mother in law, we brought our little Maltese dog, whom is a service dog and he come with us every where we going. We booked this hotel for 2 nights and at 2:00 PM on our second day, a Security person knocked on our door while my 3 years hold was sleeping and rudely and loudly, demanded us to pack and leave the promises immediately. Because of the little dog, I told him that Rocky was a service dog and that I would talk to them after my daughter woke up, he reply again rudely and loudly, that there was nothing he could do and again demanding us to evacuate immediately. Anyhow, to make a long story short, this place was full of drunk people witch I guess in kind of normal for a casino business, also full of pat smoking individuals, etc...... I just can't believe that they kicked us out like we were some kind of criminals, because of a 5 pounds SERVICE dog, and they can't even wait for my little one to wake up, this is 100% outrageous. As I previously said Stay away from Circus Circus.","useful":1,"funny":1,"cool":1},
{"review_id":"FQ2V63d8iE0GZwyLg5AAEA","user_id":"bWBxcPiTixCDjwxSKN48TQ","business_id":"TXNDK-DRjx2cfu7amxcIIA","stars":2,"date":"2014-01-14","text":"There are far better Souvlaki Hut's in the area. The food was sloppy and was not made with care. Salad was soggy, the pita was soggy, the garlic bread was a wet hot dog bun, the honey sticks were stale, the rice was watery and tasteless. For the price you're paying take the five extra minutes and drive to the Souvlaki Hut at Winston Churchill it is worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"8glU4ClgVUiotf1JF-7ASg","user_id":"bWBxcPiTixCDjwxSKN48TQ","business_id":"tmKr2Vvu6I0zJ6kjrS949w","stars":5,"date":"2015-01-29","text":"One of my favourite burrito places in the TO area.\n\nAll of the menu items are delicious, the prices are very fair and the staff is so lovely and pleasant.\n\nDelicious!!","useful":2,"funny":0,"cool":0},
{"review_id":"F0HsGeOHM4OWTW47U9_bmg","user_id":"-eQDYIJvOug9aanYP5JRvw","business_id":"E6p3Ea3740Uj0jaSA0nCNg","stars":1,"date":"2015-05-27","text":"I wanted to like this place. Sad to say, I did not. My dining companion has ordered before I arrived and had the chicken pot pie, but hers looked quite pale. I ordered mine, specifically asking that they brown it more. It arrived at the table still very light colored.  There was plenty of white meat chicken, but the veg in the pie was nothing more than I could have gotten out of a bag of frozen mixed.  Very little sauce and quite dry. The peach pie had a very underdone crust and one could see the raw dough on the top crust. I won't be back, unfortunately","useful":2,"funny":1,"cool":0},
{"review_id":"sTymsAiRYbpVFNnKWjmjTQ","user_id":"2xew5OIiDSoJvoNLQmImPA","business_id":"FnvG2qxyGrByFpFgvZqmcg","stars":5,"date":"2017-04-12","text":"I had the wonderful opportunity to work with JJ on my grandmother's celebration of life video montage for the viewing. It is common in my culture, to do a video with family pictures and favorite songs in the background. I was surprised at the fast turnaround time and professionalism that JJ had during this difficult time. We had less than 48 hours to get this done and JJ did an amazing job capturing all the pictures. Quality was great, sound was awesome as well and the effects and transitions of the pictures were so nice. I was scared to try this company since it was first time, I am so glad I did! Thanks JJ. God bless you. I'm sure my grandma loves her video.","useful":0,"funny":0,"cool":0},
{"review_id":"vMDLoXlbtxwY6_26M9sHzA","user_id":"F1FgNcIsSOhNinvkvXDE0Q","business_id":"GzK0oXjFHmjyJDMIEJCFKg","stars":5,"date":"2012-06-14","text":"The best cinnamon roll I've ever had. (And I've had a lot.)\n\nThe guy at the counter was very friendly and helpful.  I took home some cupcakes and a brownie, which were good but not my favorites.  But I'll be sure to stop by whenever I'm in the area for another cinnamon roll.","useful":5,"funny":0,"cool":0},
{"review_id":"ozaPSDqbyLfcGeEeW40dHw","user_id":"F1FgNcIsSOhNinvkvXDE0Q","business_id":"pJZHHRXNFobm3uFBZIR0dw","stars":5,"date":"2016-11-02","text":"Michael did a great job fixing some issues from a home inspection that I had to get repaired prior to closing.  He worked quickly and charged a very reasonable price.","useful":1,"funny":0,"cool":0},
{"review_id":"v949i6_dpmtMDnETE4XN1g","user_id":"F1FgNcIsSOhNinvkvXDE0Q","business_id":"f4PKzWYI3chNe0BuXCEzSA","stars":4,"date":"2009-09-23","text":"I've been to Combs a number of times and I've always been satisfied with their service.  I also recently recommended them to a friend after the Mini dealer told her she needed $5000 worth of repairs, and Combs took care of her for $1500. But you never really get to know a place until a problem arises.  That's the trial by fire.\n\nIt seems like I've been to a number of shops over the years where they'll fix a problem and then a week or two later another problem pops up in the same general area and they *never* admit to even the possibility that they were responsible.\n\nCombs was different.  They had replaced my fuel pump and a couple weeks later the Check Engine light came on with a code 'evap system leak'.  I guessed it was likely it had something to do with the previous repair since they had had to drop the tank and reinstall it to replace the pump.  To my surprise the service manager volunteered the same guess.  He thought a seal maybe hadn't gotten seated properly and asked me to leave the car with them so they could drop the tank again and check it out.  They ended up finding a hose that had come loose and fixed it.  No argument, no hassle, no charge!\n\nCombs is a long way from my house but they're my first choice when it comes to auto repair.  They're an honest shop.","useful":3,"funny":0,"cool":0},
{"review_id":"Zn0QvLbWKDQ2vTcE7uvp5A","user_id":"F1FgNcIsSOhNinvkvXDE0Q","business_id":"H78yaRnJf8nOX0WRy9CZlQ","stars":5,"date":"2012-06-14","text":"Great service!\n\nI called about a problem with the door lock on my Honda.  Sean, their automotive guy, was familiar with the problem and said it happens all the time.  I took it in right away, no appointment, and he worked on it immediately and fixed it in about an hour for $65.  I went over to Sassy's bakery next door and had a great cinnamon roll while I waited.","useful":5,"funny":4,"cool":2},
{"review_id":"tfNMdLwuDvAxSfQQO8HWzA","user_id":"L4l2BQapWZaEk3xTI0h9Hg","business_id":"4k3RlMAMd46DZ_JyZU0lMg","stars":3,"date":"2015-10-16","text":"Recently came to this ramen spot on an impromptu ramen tour with my boyfriend when we were visiting Las Vegas. I would consider myself a ramen connoisseur of sorts. I tend to seek out new ramen spots frequently. I've been spoiled with the likes of Shin-sen-gumi and Santouka so I have standards set pretty high.\n\nPer my fellow Yelpers positive reviews for Ramen Sora I visited to taste their ramen.\n\nExperience as follows:\n\n-Ambience: great spot, friendly staff. Nothing in particular stands out, typical privately owned Japanese ramen shop. We went around 2 for a late lunch, place was not full.\n\n-Service: service was prompt and mostly friendly. I wouldn't say they went out of their way to give us great service, but I have no complaints on quality or speed of service.\n\n-Food: we ordered the pork fried rice, shoyu ramen, and the shio ramen. We aren't particular for toppings so we usually go plain (bf) or with negi and egg (me).\n\n*pork fried rice: it tasted great. Perfectly seasoned, great balance of pork and flavor. Rare is the day when we get a delectable side more appetizing than the main course. \n\n*shio ramen: broth was weak and had an undesirable aftertase. Noodles were nothing special and the seasoned egg was flavorless. I was very disappointed in the broth.\n\n*shoyu ramen: this was my bf's meal. His words: \"it's plain\". I believe one thing that makes ramen delicious is its ability to give you complex flavors. When a broth is nothing more than dashi stock and soy sauce, you've got a problem.\n\nOverall\/last remarks: while the ramen wasn't particularly good or special, I don't think this is a bad spot. Anyone who likes to have a variety of broths\/styles would come here. But for me, I'm very particular about a ramen spot to take pride in their ramen. Generally that's done when a spot takes care to perfect a particular broth or soup. When they stretch themselves too thin their ramen tends to suffer. I would recommend this place to newbies or anyone looking for a decent lunch spot.","useful":0,"funny":1,"cool":0},
{"review_id":"0Q_2ZI-QaJX2B9haITeWKA","user_id":"BMaJ2_8-QkoqR7Gg43GrrQ","business_id":"1pE3hc4Y13X2wCjhhi1e-g","stars":5,"date":"2016-06-01","text":"Great healthy veggie options with environmentally sensitive packaging. I had the 5 star salad. Delicious!! Service was fast and friendly.   Clean upscale decor.","useful":0,"funny":0,"cool":0},
{"review_id":"gP4ocoFYR6xI27-zsgczMw","user_id":"1ca_7AcEWuJKDgXB3AJvow","business_id":"hcjnOtiW7Bdym3-7PaLUzA","stars":1,"date":"2015-02-20","text":"mediocre, if food they serve is good- its good timing otherwise u  will regret it-- same thing with the staff - mediocre","useful":0,"funny":0,"cool":0},
{"review_id":"H0w6AC0NFD1wStzJFW_kcA","user_id":"Wfu1PH1AiXZBPMWHvjywyw","business_id":"hUgaylJ8gR3BNMcFiASQSA","stars":5,"date":"2018-01-02","text":"I have always thought that being a magician at parties would be a very difficult gig. You have to be prepared to entertain the whole family, keep people's attention, and keep everyone, especially very observant kiddos, amazed and guessing as to how you do what you do. Matt, truly, made it look effortless. He is clearly comfortable with any group and seems to manage interactions with party-goers successfully during his show. As an adult, I thoroughly enjoyed his performance, all the more so because my 5-yr-old daughter was giggling and cheering throughout. (I thought it was especially sweet that, in conversation after the show, Matt revealed that he'd wanted to be a magician ever since childhood. He loves what he does and it shows!)","useful":0,"funny":0,"cool":0},
{"review_id":"o4ynbHDn_1bzYM7pKqIimA","user_id":"Wfu1PH1AiXZBPMWHvjywyw","business_id":"UGom-zvtkuW8mYuRe25m8A","stars":5,"date":"2017-12-11","text":"I recently moved to Arizona and I had been looking for a new stylist. I had read the positive reviews of this salon on Yelp and other sites and found a Groupon for a cut with Marji. It was quite easy to get in touch with her and make an appointment. The salon is cute and the staff are so friendly! Marji is incredibly knowledgeable about all things hair. She was very precise and skillful with my cut and made sure she completely understood what I was looking for before she started. The conversation was so relaxed and comfortable. And the end product was fantastic. I will absolutely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"mZt83C_vI9jCoXuc5etqMg","user_id":"FNL1PPYa5AoP6lrLgX_Eow","business_id":"794S5anOvXONmkZ1n7Mu7Q","stars":5,"date":"2016-11-08","text":"I visited this cafe last week for the first time. I really enjoyed the ambience, more importantly my coffee was beautiful prepared before me. The barista Molly was very helpful in directing me in my choice.","useful":0,"funny":0,"cool":0},
{"review_id":"hYtVVpZBZs1smXy30RQ4xQ","user_id":"QuLOam4xRpzXJlKVpVYxaw","business_id":"alfg8YykqggAUbeyd2nzmw","stars":4,"date":"2017-04-04","text":"A great find. Beer and food are excellent but what makes it different is the staff: motivated, knowledgeable and friendly. We'll definitely be back with friends and family","useful":0,"funny":1,"cool":0},
{"review_id":"Lu-zjPw070Fch-qECRyXxg","user_id":"2joVy6v2Hx1gBmHQiG4ZPA","business_id":"GX1QERgqVS_Ip123zWG0BQ","stars":5,"date":"2013-06-01","text":"My daughter takes guitar and piano lessons here. They are kind caring instructors and teach based on the way each individual learns. I would highly recommend them for private music lessons.","useful":0,"funny":0,"cool":0},
{"review_id":"f9qNP4b15rNf9SyCK210jQ","user_id":"Zx3UF6ouH5R1Zp91fOjmEw","business_id":"I02fZsl5otCPP1XRu0y40Q","stars":5,"date":"2013-11-11","text":"Great product and service. Reasonable pricing and very knowledge regarding home security. Definitely A+ and recommend!","useful":5,"funny":0,"cool":0},
{"review_id":"D1gCDlFKP_yVMCus6wWP4w","user_id":"Zx3UF6ouH5R1Zp91fOjmEw","business_id":"JnjXnu6A9Xb-3wm5fUyL3A","stars":5,"date":"2014-03-19","text":"Prompt service, friendly and knowledgable. Will definitely use again for future plumbing needs","useful":0,"funny":0,"cool":0},
{"review_id":"d6p5ZoazojElIvMOSZzJig","user_id":"Zx3UF6ouH5R1Zp91fOjmEw","business_id":"YLwWi9r9S2LXzZlMG1O2FQ","stars":1,"date":"2016-03-12","text":"The 3rd party vendors used by this Home Depot are unreliable. In 3 months o order a hot water heater and security door to be installed and both time the the vendors no call and no showed. Home Depot did not even apologize for the inconvenience, unfortunate","useful":1,"funny":1,"cool":1},
{"review_id":"drEq1uU4j6Gx3HSWoxp0iw","user_id":"Zx3UF6ouH5R1Zp91fOjmEw","business_id":"QuybD_bJcAB2CHcpTfREYg","stars":5,"date":"2014-02-16","text":"Top notch food and service..wife and I drove from uptown and well worth the effort! Will definitely be back!!","useful":0,"funny":0,"cool":0},
{"review_id":"Zk2VW1G5gaNYc1wZpsvVdQ","user_id":"SldoJgM9ipGjp2URsBz5jA","business_id":"YPBVDjYEsPMnzwo_AcNVYg","stars":5,"date":"2016-10-26","text":"Ari is the best!!!  I have dropped my phone and off course I cracked the screen (( So I looked online at the Apple Store it would cost me $140 ( I was trying to find different options, and I found this place )) If you have any problems with your phone  Go to this place !!!  It was so fast , I couldn't blink )  And it cost me way cheaper than anywhere else!!! Quality is awesome!!! I would recommend this place to anybody!","useful":0,"funny":0,"cool":0},
{"review_id":"nVLpMBRqmzDJRFV1YMfRzw","user_id":"0E5Eo5fG_u5MFDuQ-N1FiQ","business_id":"ooK5Sdbc8GxidmroHfDyIQ","stars":5,"date":"2013-10-01","text":"You cannot find a gym with nice equipement like this for only 30 bucks a month in the area, very spacious compared to other Plateau gyms.","useful":0,"funny":0,"cool":0},
{"review_id":"mGauI_5xD-rLGehBI0JPXQ","user_id":"3Hj1HChX1mgJLzZ7wrvodw","business_id":"gMc6kHrA0e6cn0jHSNDv5g","stars":1,"date":"2015-04-21","text":"I had the worst service from this store on cactus and Decatur. I went in to order two different juices. One Beet and one kale. I told the lady (Elaine)  that i did not want cucumber in either drink. She went and got her supervisor (Kyle)  who informed me that he has to go by what is included?  I informed him that people have different allergic reactions. He said until someone from corporate tells him different he cannot change ingredients?  A real tool?  Corporate should inform this puppet that the customer is always right?! Horrible experience!","useful":0,"funny":0,"cool":0},
{"review_id":"tB9Ttyp-5xtjg3wb_rv9KA","user_id":"ofyvktJU3HEFpcSKaWEhNA","business_id":"OETh78qcgDltvHULowwhJg","stars":5,"date":"2014-06-29","text":"My wife made reservations for my birthday at Gordon Ramsay Steak.  I ate there a year ago and was impressed, but we were with a group and with conversation, didn't pay attention to the details.  \n\nFor meal, we showed up a little bit early and one of the hostesses informed us that they were getting a table ready and walked us the the bar to a couch to wait.  The bar staff was attentive even though we just ordered water... we had a drink at the Eiffel Tower bar before arriving.  A young hostess found us in the bar area and walked us to our table upstairs that was not what I was imagining for my perfect birthday dinner.  It was a small, two-top table at the exit for the staff area directly outside of the elevator. Our waiter took our wine order and the support staff was very attentive, but it wasn't the kind of table we expected for a fine dining experience.\n\nBefore our sommelier arrived with our wine, the nice young hostess came by to ask us how we liked our accommodations. I told her my concerns about the table and she said she would see what she could do.  We expected a move to a similarly tiny table in a better location.  However, the slender teenaged girl who, despite her age, was a consummate professional, informed us that we were being asked to accompany her to the chef's table.  We were walked back downstairs with the sommelier in tow to a fantastic booth that faced the kitchen and was directly in front of the executive chef's work area (if you were wondering... he doesn't slow all night and catches every detail.\n\nOur waiter, Chris, was a fantastic waiter.  He was detail oriented yet personal enough to connect while remaining a professional disconnect large enough to make sure that the dining experience was about me and my wife having  wonderful meal together.  He was there when we wanted him to be and was at the edges of the room at all other times in case he was needed.\n\nThe staff was unflappable in all situations and handled themselves professionally.  Assisting Chris was a wait staff assistant that missed nothing.  If water got 1\" low, he was there to refill it.  If my wife slipped off to powder her nose and her napkin was neatly folded 20 seconds after her departure.\n\nNow the food.  My wife ordered the rib cap and a lobster tail.  I ordered the 22 oz bone in ribeye medium-rare with an accompaniment of king crab legs.  We added the mushrooms and creamed spinach.  The steaks were absolutely perfect.  My ribeye was so good I told Chris that it made me want to \"smack my mamma.\"  I'm not sure he's accustomed to that.  I don't like creamed spinach, but I ate all of it.  It was like spinach crack. \n\nTo sum it up, our entire experience here was fantastic and made us feel like we were welcomed and the staff genuinely wanted to please us. I would return every week if it isn't 2000 miles away.\/\/","useful":0,"funny":0,"cool":0},
{"review_id":"jGvmnO-xmEuwI7iU_a4fDg","user_id":"ofyvktJU3HEFpcSKaWEhNA","business_id":"VR8QvH2g-jEG5EfMzA_G9w","stars":4,"date":"2014-07-02","text":"We went to Nine Fine twice this trip and experienced two different atmospheres.  \n\nOur first trip there was for lunch during a FIFA match (Bavaria\/ Korea).  They did have minimum purchase requirements for seating which is understandable for a big sporting event.  The service was prompt and left us alone to watch the game.  My wife had the fish and chips which was fantastic.  The fish was thick filets and perfectly cooked.  I ordered the Shepherd's Pie and I'm hooked.  I'm no shepherd's pie expert, but it was a fantastic dish.\n\nWe went back the next night just for a drink.  We didn't expect more than the ambience that we experienced during the FIFA match and we were wrong.  Ri Ra, what I gathered was band that plays there regularly, was playing and they were quite good.  We stayed and had a few pints (I recommend the Black Smith), watched the Irish dancing and listened to the band.  The atmosphere was great and the service was excellent.  Even though the bar was busy, the server's were spot on and never seemed rushed.\n\nAll-in-all, a great experience.","useful":0,"funny":0,"cool":0},
{"review_id":"qB37gD97AcxUFmWJyBChIQ","user_id":"ofyvktJU3HEFpcSKaWEhNA","business_id":"nnDLapJk1z2NJE0-XzwMlQ","stars":5,"date":"2014-10-21","text":"We visited about 4 months ago and had a less than favorable experience. After I left my previous review, management contacted me and asked that I give Gallagher's another visit. They insisted that our experience that night was not typical and asked that we revisit the restaurant after they addressed issues with the staff. \n\nWe returned last night and were, if course, hyper aware to the issues we saw in June.  We wanted a good bottle of wine and our questions were a little outside of the expertise of our waitress. The  sommelier was very patient and when given our price range recommended a bottle at the low end of our range. He was spot-on with the wine. \n\nA large party was seated next to us and service did not suffer in the least. All in all this was the kind of great service we expect when visiting a nice restaurant. Let's just chalk the June visit up as a bad night that was the exception rather than the rule. \n\nService was great and the food is exceptional. We'll be back.","useful":1,"funny":0,"cool":0},
{"review_id":"KctvIDJaXbT_HtOCbiXU3g","user_id":"W7h6VbiQ9F8PRh_yGnL_hA","business_id":"in2mIbyc9WvsZcROSw0bWQ","stars":5,"date":"2016-02-07","text":"Juan g was the clerk who took our order. He was very friendly. I never write reviews for fast food but he was so nice and helpful I could not let him go unnoticed. He was very professional and for fast food that can be hard to find. He was kind even when customers where not so kind. So thank you Juan G for being so kind.","useful":0,"funny":0,"cool":0},
{"review_id":"bDcAgkS8UZePukgVcDnGDA","user_id":"W7h6VbiQ9F8PRh_yGnL_hA","business_id":"C5H-eZfnxBkYN40xcNbDPQ","stars":1,"date":"2016-04-10","text":"I'd give them a zero if it where possible. Usually I don't care if the employees are rude and don't want to do there job, it's whatever. Today though one manager was such a jerk and didn't even try to correct the error that was made. Like I get it you have a lame job but at some point you have to do your job. I was so mad I use to go weekly now I'll never again.  I even cancelled the charge on my bank card. So beyond rude. If you hate your job that much don't take it out on the customers like just go home. Rude blonde lady.","useful":2,"funny":0,"cool":0},
{"review_id":"uGln0KD0c7HHUjT68XWNMw","user_id":"W7h6VbiQ9F8PRh_yGnL_hA","business_id":"6vtUbliuqC_B5bA4cmgogA","stars":5,"date":"2016-01-25","text":"The girls that work at this bank are very sweet. I often go inside and avoid the drive up just to chat with them. They always seem to make time for customers. Brittany has helped me with my online banking and has shown me how to use it. She's a real big help to me. All of the girls are really very sweet they are my bank. I enjoy banking because the service they give me is just really great. I'd recommend this bank to anyone and everyone!","useful":0,"funny":0,"cool":0},
{"review_id":"3jr0l6X6iiUhFAJeiLEBJw","user_id":"W7h6VbiQ9F8PRh_yGnL_hA","business_id":"r4_r7Cu0weNzNU6LBGKqqA","stars":5,"date":"2016-02-07","text":"I love this walgreens I go there almost everyday. I love the staff they are all super kind. They remember us and are always very nice to my children. They know my son by name. It's great to see so many good people working there. This is my walgreens and I love it.","useful":0,"funny":0,"cool":0},
{"review_id":"Zda5uLm6pw8xwr9_leEZ5A","user_id":"W7h6VbiQ9F8PRh_yGnL_hA","business_id":"mFGUvyJSdSRjIaN94QW_IQ","stars":5,"date":"2016-05-06","text":"I love this place. The staff is so nice and it's always the same people and I really like that. The food is amazing I love it. It's my favorite restaurant in glendale. This place is great and it's diffentley worth a try. Friendly staff and great food.","useful":0,"funny":0,"cool":0},
{"review_id":"FVR8w5nqt_8cwBx0YOCeDQ","user_id":"w8W5a39Y-SEQXk_LIJJ3tw","business_id":"9kPbAt95kECBGGi_e5yV0Q","stars":5,"date":"2016-11-29","text":"Look no further, Modern Proteins is hands down superb. The quality of food is phenomenal and comes conveniently packed for quick, easy meals. Beyond the food, the customer service was exceptional. Adam responded to my many questions with promptness and professionalism. The attention to detail and accommodations were above and beyond what I ever expected to receive. I will definitely be continuing business with Modern Proteins.","useful":1,"funny":0,"cool":0},
{"review_id":"tQVLrENtvL2qsE1CnMpRag","user_id":"w8W5a39Y-SEQXk_LIJJ3tw","business_id":"LcW9MSlwKusdXg1KZmU5Fw","stars":5,"date":"2014-06-01","text":"What a great find! The ladies here are not only friendly and patient, but do everything to get the dress just right! The alterations I needed were pretty intense and they worked on it, making multiple adjustments until I was 100% happy. It's hard to trust anyone with your wedding gown but you can definately trust Fit For A Bride!","useful":0,"funny":0,"cool":0},
{"review_id":"j-Oky3Wn53w7GMDfcfJgBA","user_id":"l20D1Aso3leDXJA86m-Rzg","business_id":"OHLoGVHAlS3h2_uksEXfIQ","stars":5,"date":"2016-10-04","text":"My name is Peggy evans and I was refered to\nA1 driving school and it  was the best decision\nI could have made in regard to learning how to\nDrive Espicially since I was an older student who\nHad never drove before, my instructor was mr.\nChet DIMOND who I credit with helping me obtain\nMy license he is extremely professional, patient,\nAnd plasesant, he will answer and explain any\nQuestions are concerns as offern as u require\nUntil you become comfortable with and under-\nstand the maneuvers, I cartainly recommend \nHim to anyone desiring a driving license it will\nBe time and funds well spent.","useful":2,"funny":0,"cool":0},
{"review_id":"tsvfE91iPn_nFy0RQ43rXg","user_id":"EmIdjVdvb8EOo2yDf_OIaw","business_id":"wX1ORSDKPkA5ftE7F6UONw","stars":5,"date":"2011-02-06","text":"Stopped in here last week with a friend, and liked it so much I stopped in again a couple of days later. And I don't live anywhere near BFG. It's that good. \n\nThe first time in I had the fried strips which were cooked perfectly. The batter was excellent and not greasy at all. The chicken inside was moist and tasty. It comes with two dipping sauces. I tried the teriyaki and the honey mustard. Both were very good. Along with the strips I had the vegetable skewers, which also were really tasty. The meal came with a small piece of garlic toast and a drink.\n\nMy second time in I had the baked chicken strips which were moist and tender, and because I liked the veggie skewers so much the first time I got them again. Once again they came with Texas toast and a drink. All this for under 6 bucks.\n\nDuring the first visit my friend asked me how these chicken strips compared to Cane's. It had been a long time since I'd been to Cane's, so today I went there to compare. Cane's was decent, but nowhere close to as good as the chicken strips here at BFG.\n\nThe service, as has been mentioned already here many times, was excellent. In fact the only complaint I have about this place is that it's so far from where I live. If they ever open one closer to me I'll be in there all the time.","useful":0,"funny":0,"cool":0},
{"review_id":"omTBevivHgcChLQMRoJDTA","user_id":"epY-pU8xCZCAiZKzr-BOoQ","business_id":"4P1h3LKaCkgQL5dSy5d9gw","stars":3,"date":"2009-09-17","text":"So..this place is cute!  Huge dance floor!  The whole place is huge! Geesh~  Fun decor and nice bartenders.  The guys there seem pretty lame though.  Cool place to get dressed up and dance.","useful":1,"funny":0,"cool":0},
{"review_id":"zNJXo-dAyf5_2T0huN7FwQ","user_id":"epY-pU8xCZCAiZKzr-BOoQ","business_id":"e-cxqDjKEHEcISP2iGcZxg","stars":3,"date":"2009-09-17","text":"Cool place...we got in free..that's always a plus!\nKinda small, although I like the way the bar is set up.\nI like going out, dancing and having a good time.  But sheesh people lighten up on the skanking.  Dude, some girls dance so raunch! eeks~  Drinks were ok, we left in like 30 minutes.  Would maybe go back.","useful":0,"funny":0,"cool":0},
{"review_id":"XT4PAZ4iMSwno0nVA0eFjQ","user_id":"915j0519WX9pMXeMAacOVw","business_id":"OBGHNjeNgdJTbXiO2h01gw","stars":5,"date":"2015-04-14","text":"Calgary Denture Clinic | Pearl Denture Care has the knowledge to ensure that you get a exceptional denture that will leave you feeling confident in your smile! Our Denturist knows whats required to get you the best fitting and most natural looking dentures. We are Calgary Dentures experts and excel at:\n\nImmediate Dentures\nFull mouth premium Dentures\nPartial Dentures\nDental Bridges\nDenture Implants\nAll on 4 Implants\nTMJ Treatment\nDenture Recare\nVisit out NW denture clinic, see the map for exact directions - we are conveniently located in the crowfoot crescent Northwest Calgary area. Our Calgary dentures page can provide more information on our services","useful":0,"funny":0,"cool":0},
{"review_id":"rrEYwN85qoDUp22NTbiv8g","user_id":"Wj-kREyYAQ_lckXG77efmg","business_id":"cYhv7XVpqJIpb6BLzZBaFQ","stars":5,"date":"2014-12-01","text":"Absolutely love the carnitas dinner - best pork you'll ever eat! The margaritas are very good, service is consistently good and staff is super nice. We are locals and this is one of our favorite places to eat.","useful":0,"funny":0,"cool":0},
{"review_id":"zbSywh-oZ_V7vpaSlCi5WA","user_id":"Wj-kREyYAQ_lckXG77efmg","business_id":"BT7FeQ8VkpHrU9qihvGD3w","stars":4,"date":"2014-12-01","text":"Wish the menu was a bit more descriptive - I'm not familiar with what everything is so pictures and ingredients are helpful. Some of pictures on facebook tell what it is some dont. Loved the grilled veggie dinner - added a shishkabob to it and it was awesome! Very good hummus as well.","useful":0,"funny":0,"cool":0},
{"review_id":"zI_f6BWvH8nd6IlNu8E_NQ","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"B7NHFoP1DH9JrpliCHRCDA","stars":1,"date":"2017-12-20","text":"Sheila kept my money when i ended up not needing the divorce i paud her to do. Two months still has my $600","useful":2,"funny":0,"cool":0},
{"review_id":"NeKrCH2sZ_uDqdI9sD8FuA","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"l5oT1q9S6lpteBK7-EUBnw","stars":5,"date":"2015-01-07","text":"At least the people here are knowledgeable enough to work there. Went to the  one on nellis and they couldn't tell a faux gucci from a real one.  They know authentics here.   Plus the guy wasn't sure one bag had a high resell so he looked it up on ebsy saw he was wrong and went ahead and bought it.","useful":0,"funny":0,"cool":0},
{"review_id":"DykOkWYZyM7eKfhb7y8_iQ","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"oLbHJ_qJh78Kw4fhUw1HGg","stars":3,"date":"2014-12-20","text":"Delivery.   They overload on the veggiesi unless you order beef no broccoli.  Higher prices than the quality of food .  Really nice girl takes phone orders .  Delivery driver quicker than their eta usually.  But overall  fair-good.  We order from there often (mostly due to lack of options ) but more often than not are pleased when we do.","useful":1,"funny":0,"cool":0},
{"review_id":"NwUekSPSM2c-6AEflo93Dw","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"DR30lzIHVTF6xhyMI-3IlQ","stars":1,"date":"2014-12-20","text":"If this place was on on fire i wouldn't reach for a phone to call for help.   The absolute rudest most bitter sour people there and the owner is even worse .  A miserablre environment full of staff that hate being there and dont want to talk to you. Overpriced.  You walk in the door they make you feel like you owe them something for doing so.","useful":4,"funny":2,"cool":2},
{"review_id":"_VkJDmLCbvQhY8MeWMgMYQ","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"pFQaji0idkrzv5J-qTQ82Q","stars":3,"date":"2015-01-10","text":"Ive only gotten buffet to go.  Good price but everything was so greasy i wish I'd chosen another restraining to get to go from","useful":0,"funny":0,"cool":0},
{"review_id":"RzgxfnNXL5lgc71j7ODYSA","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"gKlCspjz1Ze6Wq1s1Nc7xA","stars":1,"date":"2014-12-25","text":"The absolute worst place i have ever taken my truck to be worked on.  They lie to ypu about what's wrong with it.  Jack up the price when its not under warranty and are absolute scoundrels","useful":5,"funny":1,"cool":0},
{"review_id":"9f-aIelK7jIetWahDCAZiw","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"kXl44keW3wZaJpjEqHk30g","stars":1,"date":"2015-01-07","text":"Long long long wait in drive thru.  For hard freaking chicken strips.  Overpriced.  Overrated.  Food was either overcooked or under a heat lamp all day.   A waste of a good location they could put a better fast food joint.","useful":0,"funny":0,"cool":0},
{"review_id":"MjAh_ndklkjy-CUGDoHHMA","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"G1lB2bUf1MT1FZT8TBy62g","stars":5,"date":"2014-12-14","text":"Family owned.  Inexpensive. I call my order in and its ready in ten minutes.      Internet jukebox..  nice employees.   Ten times better than competition","useful":0,"funny":0,"cool":0},
{"review_id":"skmOjbE2oWRMQu14rNMLeA","user_id":"Z9iV2vhpnfvlHWhFxTehMw","business_id":"pmsGwCJoMjtj-wwP78PIWQ","stars":3,"date":"2014-12-09","text":"Good sandwiches but prices are higher than quality of food.\nDeliver until like two am which is way later than others.  \nGreat if you're a bar next door to it patron,  they bring food right to yoy","useful":1,"funny":1,"cool":2},
{"review_id":"gdWlv2TdQX8JQc1e5SkyDw","user_id":"NSzec4X11_wu23HOCVHhZQ","business_id":"D-2t7fHQu6hNLjjfRHSZaA","stars":5,"date":"2017-05-29","text":"Excellent service... the food was phenomenal!! Worth checking out!\nOrdered multiple app items including the meatballs, arrancini and flatbread that was incredible. Definitely coming back in the near future.","useful":0,"funny":0,"cool":0},
{"review_id":"G5jsv-Ml6yegWSkPL3x-UQ","user_id":"FQJzQDQtkXqhliT9oTF0_Q","business_id":"PEB5GVYIbCgy4g91QYQ-tA","stars":5,"date":"2009-09-11","text":"we drove 17.3 miles for one of these critters.....mmmmmmmm mmmmmmmmmmmm! I just wish they were open for breakfast, luckily I have to drive by here during my lunch hour three times a week, double up on the dogs and a bag of chips....yea baby, get some!","useful":1,"funny":1,"cool":0},
{"review_id":"LSw4_LGYYW1-AnLqlygQbg","user_id":"tx79PixphRCMZWNbLoz1ww","business_id":"5mlfC3-q8yVq8qdlUfVHLA","stars":5,"date":"2016-07-08","text":"The Z Best Turf crew did an excellent job with the new lawn.  Rob is great to chat with and very knowledgeable.  Pricing is very competitive for a great synthetic lawn.   The lawn and curbing was finished on schedule.  It was a three step process since I wanted concrete curbing.  Time line was very fair and were professional during all steps.  One dog was already running around on the turf with no issues.  Normally with real grass, chunks would be dug out.  I would definitely recommend Z Best Turf for your synthetic lawn projects.","useful":0,"funny":0,"cool":0},
{"review_id":"qVspcuwLvavayeM2vz6arw","user_id":"aXQg9h6gBQwGacYkuMGIyA","business_id":"6DBHF1vxG2vO3f0hNLlLRA","stars":2,"date":"2015-08-01","text":"I really wanted to love this office after seeing some good reviews online.  We recently moved to town and needed a pediatrician for our daughter.  For her first appointment, we waited a long time (in the small waiting room and there are no toys at all for kids, which seems odd since seeing children is such a large part of their practice).  We went just for a regular check up but I really can't imagine sitting there waiting that long with a sick child.  By the time we saw the doctor it was almost two hours after the actual appointment time and by reading the other reviews, it's not a rare occurance.  Dr. George was pleasant and seemed knowledgable and also made a good reference to a speacialist our daughter needed so that was a plus.  Dr. mentioned he's always available by email which I thought was great because our prior Dr didn't give us that option.  I left that appointment feeling neutral and was willing to still come back and give the office more opportunities to prove this was a great place.  Then about a week after the appointment, I emailed the dr some pictures of my daughter because I was concered about a rash she had developed. No response.  So after several days of using ointment, fortunately it got better and I didn't need to bring her in.  Then she got sick and was vomiting a lot in the middle of the night.  I called the dr's office and left a message with all of my information and that I was concerned and needed them to telll me what I should do. NO RESPONSE *EVER*.  This was weeks ago.  I really miss my old pediatrician in California where there was always a Dr. on call and someone would call back within 15 minutes no matter what time at night.  Seriously, how could they have an email and voicemail option and not return messages..  isn't this a potential liability??  I'm not going to stay around to find out at my children's expense so I'm going to have to find another office that really has time to be more patient focused.  Maybe this one is too busy and I would not recommend this office to anyone I care about.","useful":4,"funny":0,"cool":0},
{"review_id":"RCe2z7pzPi1IZsLeLeLYbw","user_id":"aXQg9h6gBQwGacYkuMGIyA","business_id":"Yqgyx8SJ5SqFYc-4yH6Z1g","stars":2,"date":"2015-08-01","text":"We came here as a small group for my mother's birthday.  The restaurant looks very nice walking in, clean, high ceilings.  I had high expectation and felt like this was going to be a great find.  It just went downhill from there.  Slow service, inattentivness.  The dumplings were tasty, nothing else was.  We complained about the hot\/sour soup tasting really gross because there was way too much vinegar. The lady was trying to push back saying it's supposed to be sour.  Well yeah we know that, but not disgustingly sour and bad overall taste.  She then tasted it herself, then just said she'd have them fix it for us.  It never tasted really fixed to us.  There was no mention of just comping that item off.  \nSorry, we won't be returning.","useful":0,"funny":0,"cool":0},
{"review_id":"iHAQANmskgZ88Q1D_fUeVQ","user_id":"aXQg9h6gBQwGacYkuMGIyA","business_id":"v_eEKWfbJ6g8IgN71FVDRQ","stars":3,"date":"2015-08-01","text":"I'm satisfied with what services we get here at this price range.  Seems competitive and you get a discount the more classes your child takes a week.  My son is 3 1\/2 and I signed him for two classes a week and now it's almost been a month.  My goal was to get him comfortable in the water and have fun with other kids around.  What I realize is that's it's all about the instructor and they can be so different from each other.  Very early on (but after we had one terrible one who was apathetic, let my son sink under water several times while panicking cause he couldn't get up breath causing my son to be scared even for the following two lessons with other instructors) I talked to the front desk to get their feedback on what they've heard from parent reviews and I was able to narrow it down to the best instructor for my son. She's kid friendly and teaches good technique.  \nThe place could be managed better because it seems they really should invest some money to fix some things that are started to look a bit run down. Locker rooms are not so nice.  It's like there lots of college kids working for the summer here but I don't really notice anyone really running the place.\nOverall it's a fun place for kids to go swimming indoors in warm water but if I wanted my son to really get serious about becoming a strong swimmer, I would look elsewhere.","useful":0,"funny":1,"cool":0},
{"review_id":"KbH0S9JsJVgVdrHpHnY-hg","user_id":"aXQg9h6gBQwGacYkuMGIyA","business_id":"966W5oXOBW0ZWhNYy0yjcA","stars":4,"date":"2015-08-01","text":"What a pleasant surprise! I wasn't expecting much but we've gone a few times now.  Clean casual restaurant, fast service (which is necessary with our young kids) and tasty food!  We liked it so much we ordered catering trays for a birthday party.  My only complaint is that the servings are too small and when my hungry husband comes here, he doesn't get totally full on one dish (and he's not a really relatively big man or eater).  It's our go-to place when we're out and about and want to stop somewhere for a quick lunch or dinner.","useful":0,"funny":0,"cool":1},
{"review_id":"8B-fuasNT9dRfgcsXDfzgw","user_id":"agDuWzs--mvg5iV7KyLAMw","business_id":"364hhL5st0LV16UcBHRJ3A","stars":5,"date":"2016-07-02","text":"This is the third time returning to Yonaka.  It is worth the quick Uber or cab ride from the strip. This unpretentious site is welcoming, and the staff make you feel welcomed from the moment you sit down, and you are presented with a hot towel. I recommend the omikase; the dishes are always inventive and delicious. They seem to balance so many palate points...sweet, salty, sour, bitter, and umami in one bite.","useful":0,"funny":0,"cool":0},
{"review_id":"7nPHx6hzFvMlWVK6ZJh_lQ","user_id":"BQ5FoYEF8wI5AxROjH1rPw","business_id":"5pgJxcGHN5AhcsKIovdDNA","stars":1,"date":"2013-09-04","text":"Antionette Morgan is an artist alright! A con artist! Alley kat sucks! I went in for one of their fake specials,And i paid the nominal fee . When I brought up a question about my design,the owner Antoinette Morgan blew up calling me a dumb bitch and then told me to leave. I said gladly, and that I wanted my refund. She called me an ugly bitch and told me to read the sign, which said no refunds! I didn't even recieve the tattoo! That place is evil and gives tattoo shops in that area a bad imag!\n                                                                          Katie b","useful":1,"funny":0,"cool":0},
{"review_id":"sdg1_osfz3uPFlRc7Ht_UQ","user_id":"G0BDlaWtX7A7Z1LpWqW1cQ","business_id":"Rie3AW2484Gnb7aMU5rTbQ","stars":1,"date":"2017-08-23","text":"Well.... be ready to be tricked into paying the highest price to get your car washed. I thought they were going to try and sell me my own car back to me!!!.  After you have your car washed make sure you recheck their work. I picked up the ashtray dish and it was flooded with armor all...and guck!  I drove away but was so mad for all the money I paid for a 1\/2 zzz job they did that I went back and asked to speak to the manager.  They recleaned the car.  Keep your punch card...i won't be using it... thank you.","useful":0,"funny":0,"cool":0},
{"review_id":"P2fGvgMHwkEe76IjHh2OiA","user_id":"zkZveXlsjNK-R5GdUvaDXA","business_id":"CQQ1Ts26XqaDaF9SmRoUCw","stars":5,"date":"2015-11-29","text":"We came in from Los Angeles and boarded our doggie Sam here.  To say that this place is AMAZING is an understatement.  Sam has anxiety and wasent feeling well while we were gone so they took it upon themselves to cook him some rice to make him feel better.  When we called in to check on Sam the staff made us feel like we were the only people they were taking care of..  super attentive and patient!!!  They reassured us that Sam was ok and that they would call us if there were any additional problems.  We also liked that the woman (forgot her name) at the front desk that took Sam back let us know that it was ok to ask any questions because she understood that he's our baby.  Overall this place rocks.  They treat your animal as if he\/she were their own and at the end give you the BEST written report EVER.  I actually LOVE this place for boarding better than our place in Los Angeles... shhh.  Oh and the prices rock too!!!  Thank you for taking such good care of our little guy!  We can't wait to bring him back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"iVgoRJPk4bR8v1qiTvt-9A","user_id":"OiZn6ZF_FAt6jJ9YtAE6pw","business_id":"U21YaTK4PVlfNHQSyBkJUg","stars":4,"date":"2009-01-03","text":"When it's tough to find a parking space at a restaurant, you know it's doing something right. This tricked-out taco stand blows away those fake n bake strip mall Mexican restaurants which all somehow end up looking like Applebees with sombreros (and taste like it). Their Chorizo plate is delish, the salsa is an old family recipe, the interior is home-spun and refreshingly informal, and the prices will leave you feeling decent about recessions. Only drawback: not a Mexican face in the entire place (except for the kitchen). Bunch of white tourists looking for (and finding) a sliver of authenticity in the sprawl.","useful":1,"funny":0,"cool":0},
{"review_id":"NefVtn8B7IoNsvmrlAuh7A","user_id":"OiZn6ZF_FAt6jJ9YtAE6pw","business_id":"XvbW-XGOKb5LrWsMjhPrAw","stars":4,"date":"2013-02-26","text":"My dad and I have been big fans of this golf course for many years. We'll drive all the way from Chandler to play it. It's great value for money. Challenging but not unfair. It's not a desert course so there is plenty of room for error, but there's also a lot of water which makes it quite nice. If you can hit the ball straight, you'll make good score, if you don't you won't be punished without mercy. The management here is also really good. They know how to take care of regulars.","useful":1,"funny":0,"cool":0},
{"review_id":"dkAhdWpPdIL0Dh4mZO1VjQ","user_id":"DtRUNnHKkGkoacJy2AwX8g","business_id":"3JekfARgFuMeLTMcOpgqyQ","stars":5,"date":"2012-04-29","text":"Doesn't get better than this   Place is mobbed all for the right reasons. Excellent ice cream, price is crazy cheap and service fast. Trifecta!!!","useful":0,"funny":0,"cool":0},
{"review_id":"hMzEKfeRmOXFIeon3Wtqgg","user_id":"DtRUNnHKkGkoacJy2AwX8g","business_id":"qJnjPNWWIy6Evq0LD5Biuw","stars":1,"date":"2012-04-29","text":"Can it get any worse. 5 tables on a Sunday. Wait time over 2 hours. Place is dirty, service is beyond bad and the food well I can't even remember. BEWARE","useful":0,"funny":0,"cool":0},
{"review_id":"6dSAD53PEyDfBSQCBNiLiQ","user_id":"DtRUNnHKkGkoacJy2AwX8g","business_id":"No7l4LinY1tu-bCL97qi1A","stars":1,"date":"2012-10-07","text":"We really struggled which Italian restaurant downtown to visit and decided the \"best\" option was Palazzo! It was the worst meal hands down we ever had. Caprese salad is that, a salad with sweet over powering dressing in chunks with lettuce and a few tomatoes-not so good. Then my husband ordered Veal Osso Buco which was ice cold, risotto a hard rock and visually displeasing. Sent it back. I ordered spaghetti with plain marinara which I promise you was a can of tomato sauce right out of the can--someone earlier said Chef Boy Ardi and that would be an upgrade. We sent back the veal, should have sent back the pasta and they only refunded for the veal. No apology from the owners, who by the way as mentioned earlier, sat feeding their faces at the bar. Absolutely the worst meal ever we spent $80 with a bottle of wine and TERRIBLE food.  The only positive was the nice waitress, who was caught in the middle, but honest with us which we appreciated.  If we could give a ZERO we would.","useful":1,"funny":0,"cool":0},
{"review_id":"rXyVQyQmaPMB95F8OSND9g","user_id":"jnM7VYMoLWZbnOVDGxTt3A","business_id":"YrC6QKgIrjM4n4eOqN5_Sw","stars":5,"date":"2016-08-20","text":"I have been here a couple times and every time was a great experience.  The tan is very natural and you can't beat the price!","useful":0,"funny":0,"cool":0},
{"review_id":"aapjzdVpO8Hve5rAPGkZLA","user_id":"2I3TaZuF40WSYTUGYwOkwQ","business_id":"LpGCzgAKNSpzDNEUMVVtZA","stars":5,"date":"2014-06-26","text":"I expressed to an employee of a pizza place at NyNy casino that I wanted authentic pizza. The employee hesitated but recommend Grimaldi's, and another employee muffled not to buy their pizza.. Without hesitation, I navigated the pizza place and went... We ordered pesto with meatball n ricotta cheese pizza and pepperoni w sausage pizza. The ingredients are fresh!! Totally worth the $. Dessert was fresh as well! We had tiramisu and Ny cheese cake (not too sweet and creamy and cheese cake fluffy) defiantly not frozen or old.","useful":0,"funny":0,"cool":0},
{"review_id":"BVtNhQ9NVIux4zLtm3FjMA","user_id":"CJkmX1CyGiFcAo5zqyQ2lw","business_id":"8yY7tAd-qrjC0Ineby0cPA","stars":5,"date":"2012-09-30","text":"Had a Groupon for $20- for $40- of food.  We arrived in Vegas pretty late around 9:00 pm and did not get to the restaurant until 10:00 pm on a Wednesday ( 09-19-12) .  No one in the restaurant and a just a couple of people in the bar.  At first we were not sure as it was in a small strip mall about two blocks from The Palms on Flamingo not great looking but don't let the rest of the strip mall  fool you ... the insideof the restaurant is really nice.  Lots of booths too.  Our waitress was really super nice and told us about the favorites.  She started with the Brussell Sprouts .... you must try them !  OMG ... so good.  They bake or fry them and they are like chips in a way and so addicting !  The Empanadas were delicious too !  Everything we had was so good ... worth going to.  Next trip to Vegas we are definitely going back to Marabella !!!","useful":0,"funny":0,"cool":0},
{"review_id":"PL5v2GWSYdtCl6fnMH8wHA","user_id":"7Ra-OyT7mqZobWYCmo2_rA","business_id":"Vm9k7pwQexmf2KpxTVQjRg","stars":1,"date":"2016-10-18","text":"I went into the store at Eastern & warm springs to return a lousy bulb worth $8 that did not work for my fixture. Less than a week since my purchase & they wouldn't budge, said they had a 3 day policy for it. I told them my electrician couldn't get out to me to install it within that time frame, they said it was store policy. I said I have never heard of a 3 day return policy. Jim, the store manager when on to explain the reason saying \" The reason for the policy is that its possible  that  you could have used it a few days, that is why the policy is in place!\" I went onto explain that it didn't fit my fixture. Like I would really want a bulb just to rip them off & borrow it for a few days! I have made fan purchases there before & will never return again. For $8 they lost a customer!","useful":7,"funny":1,"cool":0},
{"review_id":"W0Lc0fKLqc4cw-4EScGilQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"swX3Vj3dQsz1YlCRmwNQEQ","stars":5,"date":"2011-11-06","text":"The new restaurant is first rate - gorgeous interior, great service, great food.  Very busy, great atmosphere.","useful":0,"funny":1,"cool":0},
{"review_id":"QZqkcgBFxLUbNpg1_Q_bHw","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"VGp9Q4E3snyLAOPOmrgQYw","stars":1,"date":"2009-04-17","text":"What a joke.  These guys tried to royally screw me on a quote.  Having used firms like this in the past, I'm guessing they're 3-4x the normal price of other firms.","useful":13,"funny":2,"cool":0},
{"review_id":"7JPy7i0CcXU61n_dzLtChw","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"zr93wrNyXzc-HW4IcK4iRQ","stars":4,"date":"2011-08-19","text":"The food is very good and the decor is nice.  Unfortunately, the service doesn't follow.  Our waiter messed up our order multiple times.  The bartender knows absolutely nothing about wine - don't ask for his recommendations.  The hostess is totally clueless.  The kitchen is the key, not the front of the house.   Looks like they need to totally rethink the staff outside of the kitchen.  Go and enjoy but don't be surprised to be frustrated.","useful":0,"funny":0,"cool":0},
{"review_id":"12pnSfmnAXfLJxa504qmYA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"YAODkC2s68TbF_kB9rFmMQ","stars":5,"date":"2011-09-20","text":"I didn't buy my BMW here, but I do use it for service.  They do an excellent job on the service side - quick, reliable.","useful":0,"funny":0,"cool":0},
{"review_id":"pGp158BuERc_EWwAJklJ3g","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"gIno_cXhvn6Om14D0I2vHg","stars":3,"date":"2011-09-20","text":"The food is good in general.  More of the Americanized version of Mexican food.  On the heavier side for food.   While the food is good, the restaurant lacks ambience - a few American movie posters in Spanish.   The service was very, very slow.","useful":1,"funny":0,"cool":0},
{"review_id":"O8tBbdXADJoojH0jsNJttg","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"flE7Sn2JGs0n3SAtaep6Zw","stars":2,"date":"2011-09-20","text":"I like the place for cocktails, but it has a horrible menu - sandwiches and salads.  The food is not great either.  Needs a new chef\/menu.  Good atmosphere for drinks.  \n\nLots of smokers on the back patio - ugh.","useful":3,"funny":0,"cool":0},
{"review_id":"px9y0FfqDFGyvm4vI1PGIQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"cclDCELdBQmJMWUyVWo5fw","stars":1,"date":"2011-07-04","text":"Another Aaron Mays flop in the making. He's lost his mojo the staff is unfriendly and poorly trained. No wine list. Guessing they're serving Two buck chuck and marking it up.","useful":0,"funny":0,"cool":0},
{"review_id":"PcpXaTBTnPljzmCD9QAWkQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"Y5CTA3S9TVkpr3Yvwaki-A","stars":5,"date":"2011-11-06","text":"The best!  Incredible theatres, seats, screen size, menu.  I can't imagine going back to Harkins or AMC after this experience.","useful":0,"funny":0,"cool":0},
{"review_id":"E2EL2PDusZzSn1wyCYrrOw","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"1d6c6Q2j2jwVzBfX_dLHlg","stars":3,"date":"2011-07-04","text":"This is one of the most overrated restaurants in town.  People rave about it - then you find out they know nothing about food.  The noise levels in the restaurant are deafening. The food is fine, but nothing special.  The wine list is ridiculously long.  Ask for help w\/ the wine list and you'll quickly be directed to some overpriced wines.","useful":0,"funny":1,"cool":0},
{"review_id":"J3zZlDU5ekYgrn2qGDl72A","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"aD-YA02i2xAqLBDon1tzIQ","stars":4,"date":"2009-05-04","text":"My food was very good, albeit the menu is somewhat limited.  The wine list leaves a lot to be desired - too many low end wines at big markups and several very high end wines.","useful":1,"funny":0,"cool":0},
{"review_id":"HZKoRZ5xO8RrW_Bm_00KdA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"U4hpxvKQDNX6cK3DNo9JNQ","stars":4,"date":"2009-05-04","text":"Good food, friendly service.  However the salads are somewhat blah and need to be re-thought.","useful":1,"funny":0,"cool":0},
{"review_id":"p4ri--YRqEaymI-ORYq0-Q","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"IJx1rrQPU5vNxCgV3f4MYA","stars":5,"date":"2011-07-04","text":"Fantastic food.  Decent service.  The location leaves something to be desired.","useful":0,"funny":0,"cool":0},
{"review_id":"Lm6hSVhg4S9PhZC7RrSQyA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"fRKqHIt0H0uLlD8deiY44Q","stars":1,"date":"2011-11-06","text":"We've been going here for years. The quality of the food has certainly gone down hill as has the service.  The restaurant is located in the back of a dumpy mall.  The restaurant has no ambience. The food used to be okay, but I'm not sure that the food is even that fresh.  Receiving a plate of room temperature sushi is never very appetizing.  The waitresses run around like chickens with their heads cut off by day.  By night, they bring in some low motivation waitresses that must be cutting their teeth at waitressing - horrible service, inattentive, etc.   The sushi chefs are without personality. \n\nThere are such good sushi places in Scottsdale, why waste your time on this one that tries so little.","useful":2,"funny":1,"cool":0},
{"review_id":"g2mEQ8GZiOIjHy1vhlaZbw","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"QVTDzJ3OFlXxKFo_EgNYNQ","stars":1,"date":"2010-07-20","text":"I got screwed there.  Service is terrible.  Lots of turnover.  They don't seem to really care about their customers.  Avoid Jonathan Cady in Service - total jerk.","useful":0,"funny":0,"cool":0},
{"review_id":"AR6W6i5M_Y8p4HXTUsOMrg","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"E5AMBRf_2ZdawMMp1nG2eQ","stars":1,"date":"2011-09-22","text":"The service here is terrible. Not sure anyone even cares.  The prices are ridiculously high. The selection is pretty basic at best.  Look elsewhere.","useful":11,"funny":0,"cool":0},
{"review_id":"ncnV2FQM0T5T6rRIIoKrcQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"QyY-RHNROxcIWXQ93QXOvg","stars":1,"date":"2011-11-06","text":"CHEESEBALL!\n\nIf you are looking for the bridge and tunnel crowd, you've definitely come to the right place.  Lots of overmuscled meat head guys who pretend to have money to burn buying drinks for recently enhanced plastic surgery victims.  Home of bimbos and lovers of bimbos.  If you're a guy who buys extra expensive designer t-shirts, this is definitely your kind of place.  After a big night of spending here, it's time to get back to your job at IHOP.","useful":3,"funny":5,"cool":0},
{"review_id":"1oC2BjfBv3iTn4G8RUkZiA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"ohMpNug5zWNxOlL6ShG7Ig","stars":2,"date":"2009-08-06","text":"the ugly stepchild of Binkleys.  I'm a huge fan of Binkleys, but they should have just stopped at that.  The fries are amazing, but I don't spend that kind of money to go eat french fries.  The sole barely had enough meat to justify serving anything on the plate.  Moreover, that minimalist portion of sole was overcooked.  Our waiter was irritating and trying way too hard but still didn't quite get his role.  I'd go back, but certainly not anytime soon.  I'd rather save my money and go to Binkleys.","useful":0,"funny":0,"cool":0},
{"review_id":"zBhJpUufWR7Nc2VUWfDmWA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"e-cxqDjKEHEcISP2iGcZxg","stars":5,"date":"2009-05-04","text":"Went for the first time this weekend.  Amazing looking women.  The cocktails were good too. Great looking female bartenders. A must do if you're single and attractive.","useful":1,"funny":0,"cool":0},
{"review_id":"9NLhq_ZMDVRbFKePrOFMFw","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"0X3P9USnJofwVkM_bCc2Bw","stars":5,"date":"2011-07-04","text":"Great service.  Very customer centric.  Not like going to a dealership.  Totally trust these guys.  Highly recommend them.","useful":0,"funny":0,"cool":1},
{"review_id":"a_sP_AeR8UZet4NoUknD-A","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"RazsWLhKl34XusnHwz7X2Q","stars":1,"date":"2010-07-28","text":"more of the same.  the staff turns over every few months.  the sushi never tastes very fresh relative to places like Pure.  lots of scottsdale attitude for a place barely surviving from bankruptcy.  have you been on a weeknight? how","useful":1,"funny":2,"cool":0},
{"review_id":"D1C_UHqaAcxqQ3qn6UdmLQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"wAQo05JRP0NBcHlNfjzUPw","stars":5,"date":"2011-09-01","text":"THE BEST!\n\nI dropped my iPhone and broke the glass on the back.  The guys quickly fixed the back and charged a very reasonable price.  These guys are super friendly.  I can't recommend them enough.","useful":2,"funny":0,"cool":1},
{"review_id":"wPxIb7t8GxrDKex4stc2HQ","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"R1oI13c1oNxE91wkjYDeow","stars":5,"date":"2009-01-13","text":"hip place, great food.  nice decor.","useful":0,"funny":0,"cool":0},
{"review_id":"qjv_hY9Fp3j8SR0UWQBvkA","user_id":"GWGAv8h20-vkQi1U5rKhEw","business_id":"Ryy16NcZtVB66ggWmKwPjA","stars":1,"date":"2009-03-04","text":"Great place to go if you know nothing about wine and just want to gawk at the ladies.  The wine list does not change frequently.  The bartenders are not terrible knowledgable about the wines nor are they terribly friendly.   The wines in the shop are way overpriced and the manager seems to be very uninformed about the wines.   We inquired about a $400 bottle of wine by Heidi Barrett.    You'd think you'd know a ton about a wine if you were selling it at that price point - apparently not.","useful":2,"funny":1,"cool":1},
{"review_id":"_NDmJfj40HUnM5Fg-Cc98g","user_id":"NepJ9x5v--gkbuqGS5EvQQ","business_id":"trodK1jXLGIn5qjJCooIpQ","stars":2,"date":"2013-06-23","text":"The inside of Rooster's is fine, and the service is nice, but it's sneakily expensive and a little frustrating because of the combination of high prices and a la carte menu.. The meat portions are very, very small. Vegetable and other choices are relatively larger. I ordered the hangar steak and it was literally 6-7 bites for $18. I'd consider this more of an over-priced tapas restaurant than anything else.  Although all of the food was quite good, I won't be back as there are too many other choices providing a better experience.","useful":1,"funny":0,"cool":0},
{"review_id":"86peftlW6H8FLfQkaH3n7g","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"NVsmDL12AWwovFsuBMD1jQ","stars":1,"date":"2014-11-14","text":"It's basically a mini mini mini baked goods store in grocery store form. No attendants. No confusion. Take as long as you'd like without feeling pressured or judged. You take your mini grocery basket, walk into the glass room\/fridge and fill 'er up.\nWhen you're done, you exit the cold cage and make your way downstairs to the cash register.\n\nIt's really not that great. Definitely not worth the price.\nAnd that crack pie is the most overly sweet thing to pass these lips, made me feel a bit sick. This is coming from a girl who sucks on sugar cubes on a regular basis.","useful":0,"funny":0,"cool":0},
{"review_id":"SysXFOsVXtjnixvoYrqYwg","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"vcxvQyAggPqxcHwvJXvjGg","stars":1,"date":"2013-11-26","text":"Just from the food perspective, YUCKKKKKK! HELLLL NO! I was SOOOOO EAGER about visiting this place only because of the gorgeous pictures and OBVIOUSLY MISLEADING reviews! The setting, decor, ambiance, YES!! It's feminine, elegant somehow without being pretentious, refreshing, and inviting. But telllllll me how the food is so disgraceful! I preordered 18 cupcakes (1 of every flavour and then some), and 5 macarons. \n\nFIRST OF ALL, THE CHEF NEEDS TO GO BACK TO CULINARY SCHOOL AND PERHAPS ENGLISH SCHOOL TO RELEARN THE DEFINITION OF A CUPCAKE AND RECOGNIZE ITS DISTINCT DIFFERENCE FROM A MUFFIN! I ordered cupcakes and got muffins -_- their cupcakes are DRY, THICK, AND STIFF...akin to a muffin. And they taste bland, akin to paper. I thought I bit into the papershell initially, nope. That's a feat in and of itself actually, how do you make the combination of  flour & sugar taste like a textbook? Good on you.\nThe macarons weren't as terrible, but they left an awful aftertaste! SAVE YOUR MONEY!!! GO SOMEPLACE ELSE.","useful":5,"funny":7,"cool":1},
{"review_id":"hzrHy0HHuqV8urEsP8lmRQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"JOoblYsQjFT-47tkt6om0A","stars":3,"date":"2013-04-08","text":"My friend and I were bored one late late night, and quite famished, so we decided to google a 24hour restaurant; alas we stumbled upon this quaint little cafe. It wasn't ANYTHING like the pictures and website described it to look like. I was quite disappointed with the false advertising I received. It's not as nice as they make it out to be...AT ALL. It's anything but nice (in terms of what you're promised)...but it's got character, and its 24-HOURS. You can't beat 24\/7...ESPECIALLY when they make desserts as deliciously as they do here. I inhaled some 4 slices of cake in one sitting! It was so moist and soft, it sort of just melted in my mouth. I barely had to chew.\nOh yes, another thing I didn't find to my liking was the TERRIBLE SEATING! In every direction, there are people just an arm's length away. I'm VERY seat picky, they really took the terms 'close&cozy' to the next level. It was uneasy, and uncomfortable, I could hear my neighbour table's entire conversation. TMI lol.","useful":1,"funny":0,"cool":0},
{"review_id":"fYV6tcTlNqVnFFGqPJmW8A","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"3gv9Q4WbwOvU3rj44NmjtA","stars":1,"date":"2014-10-17","text":"I was waiting for this place to open. I thought, hmmm...okay I've been to their original Queen East location had an awful experience, but they're somehow expanding, so they MUST be doing something right...and I must've just gone on one of their off days. NOPE.\nCupcakes were DRYER THAN MY SKIN IN THE WINTER.\nThey're serving up cardboard in the shape of baked goods, I SWEAR. Whoever is the head baker here, give me a quick shout, I'll teach you right QUICK how to bake a proper cupcake, and macaron while I'm at it. \nIf you don't have good teeth, dunk it in milk like an oreo cookie first...you might otherwise lose your teeth.\nThe cupcakes are dense like the baker, and the macarons are WAY TOOO sweet.\nUnless you're getting a complimentary cup of milk, or latte with your cupcake, walk 5 minutes north to Butter Avenue to satisfy your sweet tooth.","useful":0,"funny":1,"cool":0},
{"review_id":"EqwJ93p3s2ppIgbTIc4OUw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"5uHAA5avjVvdDhgDUQs6lw","stars":4,"date":"2013-10-15","text":"They have a delicious assortment of pastries. I'm a huge fan of their macarons, croissants, tarts, cakes, but NOT their cookies. Bleh. I went in with a goal, i wanted to try eveything. So, I asked the nice lady that was helping me to give me one of EVERYTHING she had, she was confused at first but I guess my intent stare and blatantly mundane expression told her I was serious. I devoured the macarons as if they were about to be taken away from me. I inhaled those bitches with ease. The cookies are super hard, stale almost. The other treats were meh...I've had worse, but they were soft, moist, and delicious :)","useful":1,"funny":0,"cool":0},
{"review_id":"J4-Hu7j02CLu1d9oaVDiKA","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"GEwCvQqhAupYmR7NPGS52g","stars":3,"date":"2013-11-13","text":"This is a bakery that's been around for YEARS. You wouldn't know it,  but it started out as a small bakery stand type thingamabob in a Korean supermarket which, like one of many, has gone out of business thanks to galleria. The supermarket was called Toad, odd, I agree. In Korean it was called \"doo-kkuh-bee\". Anyways, with its success and public response, it moved out and became a bakery on yonge street. Where it's been once again fighting its previous nemesis ever since. Galleria, only 5 minutes away has a Korean bakery in it as well, gateaux it's called. Good luck! \nBTW, go early to try their PUFFS. ERMAGERD. FLUFFIEST THINGS. they SELLLLLLLL OUTTTTT EVERYDAY! they're quite comparable to nadege and the rest of them, only difference is, whereas they(nadege) charge you $3 for one of their tiny shits, here charges you 3 for $1 or something dreamy like that. Try it!!!!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"WnzHc-8TUJrrJp7v7rYQSg","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"wKl_DavtR93ruBGR_7pFxA","stars":5,"date":"2014-04-22","text":"There is a God after all. A butter God, or a pastry God perhaps.\nThe name does not lie. It is no exaggeration, nor a coincidence. I couldn't think of a more appropriate and deserving name for this bakery. They live up to their moniker. Crazy desserts indeed.\n\nI thankfully don't live in the same city, let alone the same province as this patisserie. I'd without a doubt be morbidly obese and broke. I won't even try to cover up the stories portraying the depth of my fatassness and affinity for baked goods, ESPECIALLY ALMOND CROISSANTS. I have, on more than one occasion traveled 7 hours ( between work shifts), JUST to get their croissants. Pitiful and hopeless, trust me, I know. But if you too tried their croissant-aux-amandes-et-chocolat, you'd more than just understand, you'd be committing the same abhorrent actions as I. You can't but capitulate to the yearnings of your stomach sometimes, and it cries shamelessly for fous desserts and Mamie clafoutis. The only two I approve of, out of the tens and thousands I've entertained in Montreal. \n\nThey offer THE FATTEST CROISSANTS I've ever had, TRUST ME when I say: I've eaten more croissants than the breaths I took in my lifetime. They're not the largest, just the fattest. They sprinkle a GENEROUS helping of almond slices on the croissants, and load it with their almond filling, which resembles a custard more than a paste, and they use untempered milk chocolate opposed to the typical tempered dark\/semi-sweet chocolates....so it's not only sweeter and milkier, but it is smoother and malleable. Like buttta!\n\nThey also have a chocolatier in the back teasing the patrons with his bucket of couverture chocolate. I sat there gobbling down my third treat staring him down like his hands might've been fourth.\n\nIf you love almond croissants, this is a must! It's more of a dessert as it is much sweeter, but it's a twist on the classic you neeeeeed to try.","useful":0,"funny":0,"cool":0},
{"review_id":"0pTdc3tbPpx1tQdn9BRsIw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"8ZaaUqIp_h__jUIoPfuVKA","stars":3,"date":"2014-10-17","text":"I'm HUGE on service, having said that, if your product\/ food is delightful, but your service distasteful, it will without a doubt translate onto the plate you serve me.\nThese are some of the most doleful looking waiters I've ever met. They genuinely look and act as though you are a telemarketer they want to brush off as quickly as possible. No, like I literally mean they MARATHON away from you as quickly as possible, as if to avoid communication and questions. (What the hell service is that?)\nAside from the servers, this place is great (for the food). The kitchen seems to be trying to make up for the blues permeating in the dining room. Rich quality in the dishes, the freshness and flavours are satisfying by anyone's standards. The Caesar salad was scrumptious! There was not an unturned, underdressed piece of perfectly bite-sized piece of romaine lettuce in my bowl. Creamy as it gets, they are not sparse with that dressing. The pasta is so fresh, and so nice. Perfectly cooked each time. Perfectly seasoned too. MmMmmmMmmmm!\nNote: Their lasagna was not that great...don't order it. Do yourself a favor and order one of their special pasta dishes.","useful":0,"funny":0,"cool":0},
{"review_id":"_tkIuEWKjTH0ptyD8yW9yQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"r395lMbm1ihAQ2sMOcFKow","stars":3,"date":"2014-02-17","text":"SMACK!\nThat's the first of MacLeod's you'll experience and the only thing you need remember. THAT PERMEATING AROMA OF BUTTERY GOODNESS DONE SMACKED ME HARD. The irresistible scent of butter and sugar will invade your inner most private thoughts and poison every disciplined bone in your body. You will find yourself irrevocably gravitating towards the only note-worthy upsdell red door of Queen East. \nPromptly after catching a whiff from a few short steps away, I inadvertently found myself pushing through the second door of the establishment (Yes, even through 2 doors, the smells are still something of a force of nature). Much to my delight, there was a super friendly lady ready to help me with a smile, even offering me a cookie to sample...on the house! \nWith their worldwide sales, prepackaged gift ensembles, and cute little nicknacks, I'm confident Mary MacLeod's will continue to thrive, and will not be superseded with ease, however...the cookies compared to my initial expectations via aroma, were not met or satisfied. Not terrible, to say the least, but unfortunately not the greatest. I would return though, only if it were in my direct vicinity towards another designated area.","useful":0,"funny":0,"cool":0},
{"review_id":"nHmzurAyuXvzKco5GTaxJQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"YEg3lD1c5Dcpl-nzWvFYjQ","stars":1,"date":"2014-07-12","text":"So bland, I thought I bit into my finger.\nTalk about underwhelming flavours. I'm not sure if they just forgot to season every element of the burrito, or if they felt cardboard inspired burritos were going to be a big hit. Save your money and go elsewhere, and if I haven't convinced you and you still want to try it...walk on over to your bookshelf, grab yourself an old book and take a nice bite out of any side. You'll get the same great taste and experience without the disappointment that comes with terrible food you were excited to try moments ago. Not to mention the money and time saved.","useful":0,"funny":0,"cool":0},
{"review_id":"Vk848F8CINcJAyee2E6sug","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"bMTvOepAgtRpD9nrNEy8zA","stars":2,"date":"2013-11-19","text":"People really need to start learning how to review sushi restaurants and how to judge quality maki rolls, as well as sashimi freshness -_-;; I'm sick and tired of walking into these damn highly reviewed businesses with high hopes and dreams only to have them crushed when I receive my less than appetizing platter of rubber and slime.\n\nDON'T DO IT. It may be located in a sublime location, but there is absolutely nothing worthy of its geography. Save yourself the trouble and go eat somewhere worth your while.","useful":0,"funny":1,"cool":0},
{"review_id":"7-dchbJ8qaT0Q4pCBO4nKQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"Q5QaMU0BrMVSOkXa9ZQ5rQ","stars":4,"date":"2012-08-12","text":"MMMMM....Self serve, and when choosing out of the plethora of flavors....you can decide exactly which flavour you like best without feeling an inch of guilt. The taste testers are complimentary and also SELF-SERVE. So you're not feeling guilty by constantly asking to try such and such flavours! OH AND THE WORLD OF TOPPINGS THEY OFFER. Y U M!!!","useful":0,"funny":0,"cool":0},
{"review_id":"pknFMIyCJ9YLZIJ8VNocLQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"AT-og6IROn0hJt-HR5Njlw","stars":2,"date":"2014-09-27","text":"My experience at The Octagon Restaurant was akin to that of a woman's experience on her cycle. It was a clusterfk of emotions...all out of whack, and all undetermined.\n\nThe evening started out good and bad. When we arrived, the parking lot was full, so the valet person told us to go away (WTF?) the valet line was backed up so bad and they were so unprofessional and rude about it; we literally decided to drive onto the separating garden island thing to get out (we keeps it classy lol). We didn't notice the cops on the street watching us from maybe a stone's throw away. They watched us ride first class on that struggle bus as we broke every traffic law in the book. They paused momentarily then LAUGHED (dafuq?!). We finally parked in the next plaza down at the farmer's market.\n\nWe were a group of 14, so naturally they sent us upstairs to one of the private rooms (had a door and errtang). THOSE STAIRS NEED RENOVATING DOE. NARROW ASS CASA LOMA ASS LOOKIN (if you've ever done that journey to the top) 1905-SECRET-STEPS RESEMBLIN STEPS. NO! Tight short skirts\/ dresses, heels, and narrow  steps DO NOT GO TOGETHER. You have to walk by the ENTIRE DINING ROOM to get to the stairs btw. Great architectural planning, Octagon (smh). Anyways, upon entering the otherwise perfectly beautiful establishment, you are immediately welcomed by the owner (methinks). He's possibly the ONLY competent customer service provider on the entire team. A nice small bald man. He takes your jacket off (and on) for you (complimentary coat check). The first thing I noticed after the gorgeous deep mahogany wooden walls, fireplace, framed art, stained glass windows, antique decor, dim lights, and classy ambiance, was the service. We had about 3 waiters assigned to us, and they were absolutely professional...AT FIRST. Lookin' all busy n' shit. They be wipin' down their foreheads, huffin n' puffin all up in my personal bubble in attempt to silently enunciate their strong desire for a generous tip I assume (made me uncomfortable). You're pouring a glass of water, calm yourself. Mind you these waiters are relatively older men, ones who look like they done had their midlife crisis back in the  80's.\n\nFood came, no confusion with orders. Everything cooked to everyone's desired rareness\/ tenderness. Maybe a little under-seasoned, but that's okay, it was still good. The food chapter of this evening was smooth sailing and we experienced no problems. JOKES! You know bout that pms doe, it'll seem all proper and shit until it rears its ugly ass head to bite you in the tuchus! The calm before the storm. Ya feel? So, everyone was I guess just about finished eating. EXCEPT, WE WEREN'T. HOW ARE YOU GONNA TAKE AWAY MY MEAL BEFORE I FINISH IT?! HOW ARE YOU STILL EMPLOYED TAKING AWAY A PLATE FULL OF FOOD! BRO. FACEPALM! I actually have no words for you, actually that's a lie, this review is longer than any essay I've written in my university life. And then you have the temerity to say it was an empty plate. I KID YOU NOT, the mans tried to argue with me that there was nothing on the plate. And then he proceeded to tell me that it's on the kitchen table, he will bring it back, that it hasn't been thrown out yet. Are you ready for this next bit? (As if that last statement wasn't messed up enough on its own, bout \"on the kitchen table, bring it back\"). THIS GUY BRINGS BACK SOME NEXXX PERSON'S HALF EATEN MEAL. #DEAD. Yelp, I can't even make this shit up if I tried. I was so flabbergasted and shocked, I didn't know how to respond to that. So, I kind of just stood there in silence for a moment with bewilderment in eyes, I straight up looked anencephalic. MY GAWD. Oh yeah, and then they asked us to pay for the meal we never ate (These guys lol). The manager got involved, after 15 infuriating minutes of arguing, they offered a free dessert, I didn't want dessert, so it was finally voided. But in a restaurant as \"reputable\" as The Octagon, who markets themselves a certain way and ensures a \"fine-dining\" experience, I feel like it should've been handled much more professionally, and the problem should've never arisen to begin with. The offer to void the meal should've come from their end without a debate. What kind of business argues with their patrons and shames them?! \n\nFinally, PAYMENT TIME. Ohhh muhfkn boy! You ready fuhdis? Our bill was $800?-ish. Which is more than reasonable. (BTW, YOU CAN'T SPLIT BILLS HERE, come prepared with cash). We were never made aware of this over the phone, or before eating even (Thanks again!). So our waiter now starts giving us mad attitude. He made it be known he was irritated with us (who fkd up doe? Don't be displacing your anger onto me, I'm the one with an empty stomach). So, I put the bill on my visa, and WOAH, THIS GUY ACTUALLY THREW MY CARD BACK AT ME. LIKE PHYSICALLY THREW MY CARD AT  ME. O___O WHATTT?! WHO THE FF. I SWEAR THAT'S HARASSMENT. Nope, I'm done. My blood pressure is rising, I can feel a hormonal imbalances just now.","useful":0,"funny":1,"cool":0},
{"review_id":"-vA2t0BLHvCGWecjgevjiw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"YH8Bn-7pLR-SFR8MCgQj1w","stars":5,"date":"2013-12-02","text":"MMMMM...!\nI've so far tried their Macarons, Croque Monsieur, Almond cookies, Chocolate Almond croissant, Heavy Almond Croissant, some kind of custard croissant thing....and not a single one was a disappointment!! And that's impressive. First of all, this is the only bakery I know that gives you the option between the light and heavy almond croissant to cater to the different preferences people might have. Their macarons are larger than most that I've tried, a little uglier, they look plastic, but they taste great! And I could see how the custard cake would be a hit with many, it's not particularly my favourite, but it is nonetheless of great quality.\nThe man there, I think he's the owner, I could be wrong, is super NICE =)\nThe assistant store manager is the black girl I think....she's nice too, but there's this one girl, she's new I believe, started sometime in September....is COMPLETELY USELESS, SLOW, and should not be allowed to work there =.= Every single time she serves me, I get these anxiety attacks from how unintelligent she is. \nSo when you go, make sure to take your appetite, wallet, and PATIENCE.","useful":1,"funny":2,"cool":0},
{"review_id":"UzNuw8uVZ7FtYSWdtg6Npw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"P53-vcUZne1L1CNElu9m-g","stars":1,"date":"2013-12-02","text":"DON'T WASTE YOUR TIME, MONEY, AND SPARE YOUR TASTE BUDS. First of all, I purchased 6 Macarons, and they were ALL THE SAME FLAVOUR--CARDBOARD!! SOOOOOOO DISAPPOINTING. If it's French macarons you're looking for, go elsewhere, I recommend Nadege or Delysees.\n\nAlthough, I will say, the service is friendly =) But, as a foodie, I'm there for the food, not a pretty smile and ass kissing. \n\nRound 2: Okay, as much as I'd love to ameliorate my current rating, I just can't. This is a place I want so badly to like, I love the space, it's even got this cutesy teeny back patio. The macarons are garbage. The meringue shells are overbaked and the buttercream fillings remind me of paper mache. Their croissants, almond croissants, danishes were just banal and uninspiring. \nI will however compliment them on their quiches; so incredibly light, airy, and rich. They perfectly seasoned, and beautifully cooked, I went back for a second slice!","useful":2,"funny":0,"cool":0},
{"review_id":"AUB_x4i-Q0qWn7NfJI8J9g","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"61Llhn62hVdHy9t8c9LSuw","stars":1,"date":"2013-12-02","text":"Cute hidden bakery, check...NOT WORTH THE PRICE YOU PAY. I got sick after eating their macarons. I couldn't even finish one of them, they were so GROSSSSSSS. I'm a DIEHARD FAN of macarons, my bank account is not shy when I purchase macarons. Let me telllllll you. These were so nasty, I spat a few out. and I can without a doubt in my mind say these are Toronto's MOST EXPENSIVE macarons.\nI will however give this place points for their unique flavour choices (Unique, but not necessarily tasteful), and selection of tea, and of KUMSI BRAND. I've only ever seen and purchased Kumsi tea when I was in Paris. Nice to see they are serving quality imorted tea!! Thumbs up there!\nI've not tried their other pastries, and after that horrible experience with their macarons, I'm not sure I can bring myself to do so. I literally wanted to drink acid to wash my mouth out. Maybe though...One day. If they don't go out of business before then. Which I strongly see in their near future. =( \nI mean, I don't mean to be a debbie downer, but reading these other reviews, it looks as though they've been marketing on Groupon...that means you're not doing so hot!","useful":0,"funny":0,"cool":0},
{"review_id":"m7rKSe1R6BesOVHIZnj1Ng","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"LnSjzFXh1GrOObsRP6LhBQ","stars":4,"date":"2013-11-26","text":"Wowwwwwwww!!! The term \"looks can be deceiving\" come to mind. I walked into a very generous space, first off! and they have their food separated categorically in different display windows. Croissants, viennoiseries, danishes in one, dessert cakes, tarts, miscellaneous treats in another, cookies up top, and a relatively capacious drink bin fridge completely detached almost acting as a wall setting up boundary markers.\nI was kind of turned off by their food, let me tell you how they just DID NOT LOOK APPETIZING IN ANY WAY. Their selection was ABUNDANT, but their viennoiserie just looked dry, burnt, and blehhh. BOY WAS I EVER WRONG AND GLAD THAT I WENT AGAINST MY BETTER JUDGMENT AND BOUGHT MY FAVORITE-almond croissant!!!!! Most, or rather ALLL almond croissant in the city taste relatively the same if they're good, be it nadege, Jules, la cigogne...etc, if they're praise worthy, they generally don't  have too much distinction between them. Brioche doree broke that stereotype and knocked it out of the park. They just put up a new set of rules and changed the almond croissant game. Not only was I turned off by the esthetic appeal of their pastries, but also their RIDICULOUS PRICES!! NO WHERE in Toronto have I seen an almond croissant so expensive!! But now I somewhat wearily say, rightfully so! \nTheir almond croissant is not soft and filled with paste like most others, it's the right amount of sweet and the consistency is a little more coarse, it's CHEWY, if you will. Might I dare say: if caramel or toffee were in bread form, THIS IS EXACTLY WHAT IT WOULD BE LIKE!!!!!!! Yum! I devoured the  croissant with frightening ease on a full stomach. Thank God I live nowhere near there.\n\noh yes, there was a esthetically appealing guy sitting alone eating dinner and reading. Good eye candy in the patrons compensates for the ugly treats I guess.","useful":0,"funny":1,"cool":0},
{"review_id":"3Q71idl0Cd1dw5N6Q8DdKQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"l1HpKfHq50qi1DRbVDJZSw","stars":2,"date":"2013-11-14","text":"THE SHITTTTTTIEST SERVICE OF LIFEEEEEEE. PARDON MY LANGUAGE, BUT THEY WERE BEYONDDDDDDD RUDEEEEEEEEEEE! I kept my sweet bubbly demeanor the entire time to see if they would change...NOPE. RUSHED ME OUT (I WAS THE ONLY CUSTOMER IN THERE) and started turning off the lights while I was in there. Smdh. They close @8, I got there at 7:47 and left at 7:54. There is NO REASON FOR ANY BUSINESS TO MAKE THEIR CUSTOMERS FEEL UNAPPRECIATED, UNWELCOME, AND SOMETHING OF A NUISSANCE. It's a shame, because I want to give my opinions on the food, but the service really left a large impact on me. I'm giving them 2 stars opposed to negative stars because the food was actually not bad. You know how custard things leave that waxy feel in your mouth?  This didn't have that at all. They mean butter, and nothing short of it.","useful":3,"funny":0,"cool":0},
{"review_id":"D2aXOOebdT75q3s6i-4afA","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"67Pa_CtXthgJzXfY8JzLDQ","stars":4,"date":"2014-03-02","text":"H O L Y    C H U C K.\nSeriously.\n\nThey need to E X P A N D their booger-sized estate. The space is tiny compared to the ever so large patrons...both in size and quantity. I mean really \"our business is burgers\" (I don't know anyone that would disagree with that statement) they didn't think they're customers were mostly going to be chuck e cheese goers, did they? As a burger establishment that sells the city's GREASIEST, YUMMIEST, FATTIEST, BURGERS...they should've foreseen the inevitably obvious future of their not so pint-sized fans. Just READ THE MENU, people who've just completed a marathon, smoked a fat blunt, or truly enjoy good food without a conscience would patronize this burger joint. Grilled cheese buns, layers of grease and bacon, patty after patty, no veggies, cheese slices every layer, caramelized onions, fries, etc. is what their burgers consist of. \nThere's no need for chewing these burgers, the second you get it, the first thing you'll realize is the DRIPPING GREASE. EVERY DROP COUNTS, DON'T LET IT DRIP, SHIT IS UNBELIEVABLE. That grease is what LUBRICATES the esophagus, allowing the (chewed or unchewed) food to kind of just slide or drizzle down the tube to your stomach. It's softer, lighter, and airier than cotton candy. Someone wanted burger\/ meat\/ bacon\/ cheese flavoured cotton candy? Oh, no bigs, Holy Chucks gotchu. It's so airy, even if it went down the wrong tube into the trachea, you wouldn't choke.\nThe only other issue I might have to go along with their booger-sized estate is maybe their BOOGER-SIZED BURGERS! EXPAND THAT TOO. (Though maybe it's for the better and sparing the arteries and heart attacks of the general population)\n\n** FOR THE MONSTER WHO KILLED THE HOLY CHUCK CHALLENGE IN 2:40. DAMN BRO. You have my respect sir.","useful":0,"funny":0,"cool":0},
{"review_id":"pFvpWDqob7M06CrVTl95NA","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"wGwib7KvPzs5_6aPCk_Fzw","stars":1,"date":"2014-10-17","text":"There's a golden light that scintillates from this place. It knows of hygiene and cleanliness. I am appreciative. Though, the patissier here is a pretentious she with a head so large I wonder how it fits through the door every morning (figuratively speaking). I walked in to order macarons, this lady did not blink once to withhold her tongue to promptly correct my accent, suggesting I didn't roll my 'r' the way the french do.\nI'm sorry, I thought I lived in Toronto, a predominantly English-speaking city. Jussayin'.\nMight I just add, I am fully bilingual, and her accent did not at all come close to the real pronunciation (smh). \nAnd then this lady proceeded to say: \"Any self-respecting pastry chef knows how to say macaron the correct way\" \nIt was callous, and condescending, making me feel very uncomfortable, and belittled. NOT the way a business owner should treat their valuable customers.\nShe must've had God on her side that day. If there wasn't a glass counter filled with maca'R'ons between us, I would've fed her a few open palm wake-up calls. So, though their product may deserve an extra star than I gave credit for, she abates that rating with her temperament, disposition, and ego...WHICH I BELIEVE IS FAIR. You review a business based upon not only their products, but also their service. \nI got my macarons, the only one worth paying for is the mocha flavoured one, the rest are deplorable, the texture is not what a macaron should be. For someone who is so confident in their macaron expertise, she really falls short in her abilities to prove that. Their viennoiseries such as the croissants are super fluffy & buttery, overly so almost. It oozed transfats. They really do live up do their moniker, 'Butter Avenue'.\nJust because of her, I'd never return. I'm not trying to go places where I'm disrespected and treated like I've committed the worst crimes known to man.\n\nTip: Go early, they're ALWAYS sold out of their non-macaron items...or DON'T if you don't want to start your day off with a rude glare and a generally sour note.","useful":1,"funny":0,"cool":0},
{"review_id":"NFTO5-ABm83zjcsEx0QTAg","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"wdTnHPTKVLfBHUt6XZUjfQ","stars":4,"date":"2014-03-02","text":"If you're a Korean living in Toronto, or simply just a person living in Toronto with an affinity for Korean foods\/ products\/ produce\/ snacks\/ and whatever else possible, you obviously know Galleria Supermarket. If you don't, I don't know which rock you live under, but I can beyond a shadow of a doubt guarantee you, neither does anybody else. \nIt's possibly the ONLY\/ LARGEST grocery\/supermarket in Toronto (H marts and tiny hole in the wall stores don't count). Anyways, now that we've clarified what Galleria is, meet Bakery Gateau; the bakery INSIDE the grocery store. \nYou know how Western groceries have a deli section, an artisan section, a cake and pastry section, and then grocery isles? Well ethnic grocery stores tend to have the same thing, be it an Italian, Persian, Greek supermarket, they differ scarcely, I mean really how differently can you establish your grocery store from one to the next? \nExcept ASIAN supermarkets. MOST, if not all Asian supermarkets I've noticed have their grocery stores...and then, outside the checkout isles, they have EXTRA STORES; similar to that of a Walmart (Ah, nowww you get it. lol). Usually, these stores are specialty stores, esp. ones that carry products from the country native to that grocery store that you wouldn't otherwise be able to find. So, they'll have pharmacies, holistic medicine stores, mattress\/ bed sheet store (Asians are particular about what they sleep on and in, it's odd :S), beauty supply store, so on and so forth. This includes BAKERIES sometimes. The Galleria chain of supermarkets have this bakery called Bakery Gateau. \nThey produce pastries, desserts, and breads of great quality. (Asians don't really have bread loafs as do the Europeans, they have snacking bakes that are supposed to be able to play the efficient role of both a snack and a meal interchangeably, depending on the nature of your situation and appetite). So their breads are stuffed, filled, and\/or topped with a myriad of ingredients, an amalgamation of flavours and nutrients (not always healthy, just delicious). Always fresh baked and PREPACKAGED for you to pick and choose, grab and check out (once again on that Asian efficiency bandwagon). Unlike western bakeries where you look through a damn glass display case and have to ask a million questions about what something is and then struggle communicating with the clerk trying to tell him\/her what it is you want by pointing at it (\"no, not that one, the one next to it, no no the other side, yeah, that.\"). The only thing in glass display cases are CAKES, full sized cakes. \nAnyways, go to this bakery and indulge in a little bit of culture. It's well worth the experience. (ESP the self-serve glass case breads).\nEven the coffee is self-serve (I don't think they're of the greatest quality though, I mean....Asia doesn't particularly specialize in espresso beans, they're no experts of coffee brews, maybe just latte art)\np.s. they have more than just what you can grab, they have iced desserts you have to order at the counter.","useful":0,"funny":0,"cool":0},
{"review_id":"rJK7xyxC0gTrxj_Q5wv5Mw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"46Ld9Qc9nAx_A0jwclNZiw","stars":3,"date":"2014-02-17","text":"Ok. WOAH. PERSONAL BUBBLE NOT EVEN A THING HERE. Good luck finding the weest of arm space even to bend and snap your elbows to bring the food to and from your mouth. I'm not an individual incognizant of my ever so minor claustrophobia, but holy geez this was more than brushing shoulders, I came into contact with a dozen more than a few derrieres and other such body parts during my brunch hour here. \nMy 3 friends and I were, for lack of a better word, congested, into this pee-wee fit-for-one table. We were all sort of tucked in under the table, our legs awkwardly overlapping one another's. Next level of friendship achieved at lunch? Absomundo.\nMight as well have been a subway during rush hour. I could smell the perfume of the girl sitting 9 tables down, which translates accurately to: an arm's length away. \nThe food...I had an almond croissant, brioche, banana loaf, lunch panini, and cookie. all of which, sauf maybe the croissant, were pleasant. \nThough, the panini was ROCK SOLID...I'm talking crack-tooth hard., yummy nonetheless.","useful":0,"funny":0,"cool":0},
{"review_id":"UMAQHnkI7DIXkZ2oZzbVLQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"O-b5osM0NO4f31dp6_DatQ","stars":5,"date":"2013-09-25","text":"I heard about this \"oh so amazing\" patisserie; it was literally on my way home this particular June day, so I decided to take a gander and see what all the fuss was about. I do NOTTT get what the hype is about...I agree the macarons are moderately divine...that Rose macaron OMGoodness...their other pastries are not so spectacular, not in the least. Yes, they offer a large selection in a VERY easy to see display counter. I can appreciate that. But everything else can use a bit of sprucing up. The girls that work there waddle helter-skelter behind the counter. This is not a cafe I'd go completely out of my way to visit, but if like in the past it is in my path, I would patronize the cute little establishment.\n\nFAST FORWARD...I wrote my initial review based on my first and only visit, rating them a whopping 2 stars. I went on a bakery adventure Queen West and revisited this previous disappointment. BOY ARE SECOND CHANCES NECESSARY!! I live a MISSION & a HALF away from Nadege, but that doesn't stop me like it should a normal human being. In the past 10 days, I've been here 6 times to put my loyalty and addiction in perspective. Their macarons are the BEST in the city. I can confidently say I've tried 85% of all macarons in the city. Not only did they hit the head of the nail with the flavours, but the consistency and texture are impeccable. Absolutely unmatched. I cannot more adamantly recommend these macarons. ALSO, O M G. If there was someone I could distinctly blame and sue for my weight gain, and newly developed addiction...hands down, all fingers point to their IMPOSSIBLY DELICIOUS ALMOND CROISSANT. They speak volumes for themselves. I don't know what they're doing to these damn almond croissants, but I'm almost certain there's crack in 'em! Second to none in the city of Toronto. I stand firmly by my bold statement. Make no mistake about these burnt looking croissants, if you even dare think you have self control and believe croissants hold no sway over you, walk away. Walk away right now, and crawl back into the arrogant hole from whence you came. You will capitulate to the effulgence of these celestial crack-almond croissants.\n\nNadege; Heaven. It's one in the same.","useful":0,"funny":0,"cool":0},
{"review_id":"HosjJlCB0OVSR-_DzSACNw","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"VA95qAV2PRH9gtTi2Vfv4Q","stars":3,"date":"2013-04-08","text":"The ONLY thing I found phenomenal about this place was the service. Our server was so attentive, friendly, charming, patient, and knowledgeable. Service deserves 5stars. I'm extremelyyyy seat picky. I don't know why, but I'm very uncomfortable sitting just an arm's reach away from people of another party. Eating should happen in a comfortable setting...the seating here is terrible, everyone is sort of bunched up together to the point where I could see the fine wrinkles in detail of the couple that was sitting 4 tables away from us, and somewhat hear the conversation they were having. I'd come back here maybe for the cuisine. They have great food, I won't deny them of that. (It's nothing extraordinary, mind you...but it's still delicious!!)","useful":0,"funny":0,"cool":0},
{"review_id":"sWFCtzs-KMpoqJAoCPOkXg","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"53GguDU6v46zPJTL3CZl5g","stars":5,"date":"2014-03-02","text":"Okay, normally, I wouldn't be reviewing a grocery store, I mean c'monn it's a grocery store, how great can a grocery store be, and how different would it be from the one across the street from me. It is one of thousands of Loblaws...NOPE. You thought wrong. This is no ordinary Loblaws. This is T H E  Loblaws.\nFirstly, I'd like to point out the mammoth size of this place. Golly gee wilikers! There's a Joe Fresh and an LCBO upstairs, on the main floor is where the party's really at. So, at your local grocery stores, or even superstores, you've got your grocery isles, and deli, pastry, artisan, etc. sections, right? Cool.\nThis place has a CHEESE WALLL DOE. Tell me how many grocery stores you've seen with a CHEEESE WALL. They have not a deli section per say, more of a deli CIRCLE. Also, they have a Tea Emporium, a CHOCOLATIER (WHATTT!!), a bakery section with more variety, and selection than most bakeries that are devoted to just being a bakery has, there's a sushi corner, a cafe, talking holographic mannequin type signs, a salad WALL, opposed to the overplayed and boring salad bar, sitting areas smack in the middle of the entire store, artisan breads area, and the list goes O N N N N. They even give out samples of food, almost like a prettier, miniature version of costco.\nNow, you're leaving the interactive specialty section to get to the actual grocery store.\nIt has rows upon rows upon rows of everything, and anything your heart desires (within grocery store reason obviously). The lighting in here is brilliant, the isles are wide, the colours are vibrant! Albeit, an ugly orange, but vibrant nonetheless.\nThey also offer underground parking, and there's escalators to get up to the shopping level. What about my cart full of groceries? You ask. Fear not! They have grocery cart escalators!! Completely safe and separate from your escalator journey! \nThe first time I stepped foot into this place was when it first opened, I was blown away. It was wonderful then, it's still wonderful today. =)","useful":2,"funny":2,"cool":2},
{"review_id":"AcLykfglurA1Zoq2KifGTA","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"RXaxKQJtExnRZX1inf8Nyg","stars":5,"date":"2014-02-17","text":"Hundopee. Meritorious of their Best dessert award.\nThe cheesecakes here are mind blowing. Maybe not to that literal extent, but they are quite ambrosial. I inhaled my slice of heaven before blinking twice. Dulce de leche I believe I ordered. It's the perfect combination sweetness, and acridicness. \nNeed I tell you of the ever so velvety delicate texture. Truly breaks new grounds with the phrase: \"Melts in your mouth\"\nI don't know what I've done so right, or possibly wrong to have gotten caught in the crossfires of heaven, cheese, and sugar. But DAMN, I'm on the precipice of my quietus at the rate I'm consuming this dangerously fattening gift from the gods.\nHOWEVER, the service here is unnerving! You can't simply rely on your product if your marketing is deplorable. Get your shit together.","useful":0,"funny":1,"cool":0},
{"review_id":"o7xy0jr_1xPDl13XoNK8qQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"ovnqQaQ8BsPgDoJ4nlYBUw","stars":2,"date":"2014-02-17","text":"I'm giving 2 stars instead of 1 because A) They're open later than most bakeries, B) Cookies are being baked all day to ensure freshness.\nI'm unfortunately unimpressed with everything else. The cookies were mediocre at best (taste-wise, but they nailed the consistency...but what good is that? Might as well chew a rubber elastic), furthermore they only accept cash...what's worse is they do not even have an ATM for you to withdraw cash from. wth kind of set up is that? I'm sorry, was this a bakery, or a hotdog stand? I seem to be unable to see any kind of sense here.","useful":1,"funny":0,"cool":0},
{"review_id":"m2m17ZvgwmxJaeSv0xqYQg","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"atBul_9I4TtdozKU0mRBjg","stars":3,"date":"2014-09-27","text":"The phrase \"Never judge a book by its cover\" was most probably adapted from \"Never judge a restaurant by its appearance\" which I'm almost certain was born here. \nThis place could easily be mistaken for a motel, or maybe even a crusty casino. It's TACKY AS ALL HELL. It's got one of those retro lookin' neon yellow (the ugliest shade you could imagine) brightly lit signs. Ones you imagine would read \"SUNSHINE MOTEL\" or \"DAISY INN\" Idfk why that's what I see in my head lol. My first impression was [wtf, omg, I'm getting e. coli poisoning tonight. Google lied to me about this place]. You could easily place old men in Hawaiian shirts, socks & sandals, and beer bellies in this scenery, only to walk in and have the right hand of god smack you right quick for your foul judging. I know I was; felt that backhand right up my backside. Their WALLS ON WALLS, SHELVES ON SHELVES, CABINETS ON CABINETS, STACKS ON STACKS of alcohol was I M PR E S S I V E. Some bottles, I've never even heard of. Then they pull out some next religion on you. Grape religion. Y'heard? DAT WINE BIBLE DOEEE. THEY HAVE A WINE BIBLE. Shit was bigger than Justin Bieber's ego. Unheard of, right? Weighed about the same as I did. Looked like a book out the Hogwart's library. I unfortunately didn't bother with it, it was overwhelming at the time. Anyways, just in case you need recommendations and have the desire to discuss pairings and the selection of wines that they offer, they have a sommelier on staff, why wouldn't they.\nI don't know that the price is right though. The quality of the food vs. the value is debatable. Neither my date nor I were able to finish our meals (not due to an excess in quantity, the portions are fairly tiny). I initially thought the restaurant was empty and business was terrible. They shafted us to the front corner of the restaurant. Completely isolated from the rest of society. I later learned that the restaurant was much larger than it had initially appeared (this place just keeps playin' me), I went to use the bathroom at the back of the restaurant, where the concentration of patrons were. I smiled. I was happy to realize the considerateness of the hostess and careful thought put into strategically placing us apart from the boisterous larger crowds. They saw we were a pair, deduced we were on a date, and gave us privacy. Attention to detail is something I can appreciate. I don't think I've ever tipped so generously in my life. Either that, or it was a coincidental fluke and they're totally getting credit for something I surmised in my head all on my own lol. Either way, the service was memorable, and the food was appetizing. Though it fell short of my expectations, it was not disappointing.","useful":0,"funny":0,"cool":0},
{"review_id":"65jZn1LlBqt4WJ0QhznAbA","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"02Ycww2etUAxorZb5gIM8Q","stars":3,"date":"2014-02-17","text":"Pros? THE EVER SO LARGE PLETHORA OF CHOICES!\nCons? Good things come in large packages, said no one ever. \nLolll\nI once again pulled an infamous line out of my dangerously undisciplined ass: \"Yes, hi. Can I get one of everything?\" with such fortitude. But even then, the clerk who was assisting me locked a set of punch-drunk eyes to mine. I held her gaze as I have many in my past. I'm no stranger to these bewildered expressions, silent questionings of my request, with the combination of their failed attempts to withhold judgement. \nAll's well that ends well...so long as I get what I came for.\nNot the best Italian bakery, but I must admit, one of the most amicable!! That's a winner in my heart, just maybe not my stomach.","useful":0,"funny":0,"cool":0},
{"review_id":"NpoKNTkKQ38GumgbZCGQig","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"JQkSjiB1RkO4egIf0E4MOA","stars":5,"date":"2015-12-14","text":"I'm not a fan of chain restaurant, I find they never have consistency nor good food, but this is THE ONLY chain restaurant I frequent repeatedly. They got me H O O K E D on their \"Big What\" Burger. I'm a burger connoisseur. I've tried every burger under the sun.  This one takes the cake.  Not only do they have the greatest burger I've ever had, they are consistent and all their other options are fantastic. They have suprisingly good calamari, perfectly flash fried. The creamiest spinach dip. Flavorful bruschetta...the list goes on. And to finish, they have delightful desserts too. \nI've tried their pasta, I don't find it's the greatest. Opt for their happy appies, as they call them, and their pub grub food choices. \nI almost forgot to mention, they have deliciously thirst quenching concoctions flying out of the bar.\nAs for the atmosphere, it's cozy. It's almost always empty. I've never been there when it was full, despite going at peak hours.  You'll be able to enjoy a nice quiet cozy meal. Alone or with company.","useful":0,"funny":0,"cool":0},
{"review_id":"7qNfXoWZItxFfnRvOxvfzQ","user_id":"YCneW76-50jCwCV21Rm4sw","business_id":"nrOxXGd3Vx6iz5xuIJT8cw","stars":4,"date":"2013-12-02","text":"So, my friend and I were googling yummy sushi joints in Thornhill\/Richmondhill area to have dinner. We never found this place, we initially wanted to go someplace else, but couldn't find it! So, we just settled for this place after much dispute and hunting. and boy am I ever glad we did!! THEY ARE NOT STINGY LIKE THE OTHER PLACES! OMG. Korean owned and operated, this place DELIVERS QUALITY ROLLS! The AMOUNT OF AVOCADO the green rolls have...I must've consumed some 3 avocados in one sitting. Keeep itttt cominnn!! They have some AMAZING rolls. We ordered 7 rolls, a bento box, and some sashimi. All of which were excellent!","useful":0,"funny":0,"cool":0},
{"review_id":"7FhENO3ptHGUzp1_sQGdGQ","user_id":"HC6fDlSWMLbEmEd2m2bQlw","business_id":"Q7m8G4579-XYKV3LMW8V7g","stars":5,"date":"2017-07-11","text":"The food is great, service is professional and and fast! They also open late so it's great for Vegas! Would definitely recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"b5YbC2fEGlWwZdr843SRUQ","user_id":"qWva1B1xORHFO9ku-wZ4AA","business_id":"mfVrZNl4HHc8sxTl8rjztg","stars":5,"date":"2017-11-15","text":"My wife and I had an unexpected and very quick transition to Charlotte. After scouring the city, we had our sights on Alpha Mill and the experience couldn't have been better. We toured the site, chose our ideal apartment, and were approved (though our credit scores weren't ideal) the very next day. We moved in 2 days later and have been here for 6 weeks. \n\nThey just finished up a Resident Appreciation Week that included wine, pizza, dog event, brunch, and more wine!\n\nHighlights: STAFF!, Amenities (free coffee, 2 gyms, great business centers, and rec rooms, our dog loves other dogs and dog park, walk to downtown, same-day maintenance.. etc.) My wife, as a  'Yelp Reviews Stalker' insisted I wrote about our experience and share with fellow stalkers. \n\nIn a nutshell.. Alpha Mill has been all we hoped it would be PLUS UNLIMITED coffee! \n\nJeff transplant from Florida","useful":1,"funny":0,"cool":0},
{"review_id":"_zHEoOuIjr2mkx2psRCkAA","user_id":"l8XzorXOvOAIFqGHDcaKlQ","business_id":"L6uLN1hGa7cTWtZ3VfB-HA","stars":4,"date":"2016-04-10","text":"I get take out there 3 or 4 times a month every month  since the store opened a couple of years ago.  I've never had a bad sandwich and never met an unplesant employee.  Clean & polite & decent prices.","useful":0,"funny":0,"cool":0},
{"review_id":"2DLJkhmKArhNY4027FXMuQ","user_id":"ysHjWMmSRDFzd4R6G95MCA","business_id":"a9J-UY498XO04vy38PKFUA","stars":5,"date":"2012-03-17","text":"Very Clean, Professional, Upscale Salon, with personalized service which I had a difficult time finding in Las Vegas!! Walked in and found my stylist for life, Donita!! I highly recommend the salon and her","useful":0,"funny":1,"cool":0},
{"review_id":"eE6lMmiQkt2cb-0U3JnDsg","user_id":"ysHjWMmSRDFzd4R6G95MCA","business_id":"cfSuc4q7pQLF28mMbx1MRg","stars":5,"date":"2012-03-17","text":"This place is a hole in the wall, but the Food and Service are second to none!!","useful":0,"funny":0,"cool":0},
{"review_id":"skl05jjoT3M5k35J7sObaA","user_id":"ysHjWMmSRDFzd4R6G95MCA","business_id":"rt9ozlw0qG4OmFwzBFSarA","stars":1,"date":"2012-03-17","text":"Third World country quality, Vegas prices. Avoid this place","useful":3,"funny":1,"cool":0},
{"review_id":"Bg9O_8xW8LLldM9xuDOj5Q","user_id":"ysHjWMmSRDFzd4R6G95MCA","business_id":"DOPUavsTUzTcpn3PrK5tUw","stars":5,"date":"2012-03-17","text":"Huge Selection, the lowest prices in town, and the staff is incredibly helpful!!","useful":0,"funny":0,"cool":0},
{"review_id":"xAXG7B0PecEW-WzogdcpRQ","user_id":"T52A1VUAnsZaKV8RJ5r5hg","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":4,"date":"2009-07-30","text":"Buffets can always be overwhelming since its all you can eat and theres a variety of choices. I've only been to this one for dinner so I can't comment on their lunch options.  The dinner has kobe beef, prime rib, duck, paella as some of your options along with salad and sushi. Theres a lot to choose from so you should be able to find something you like. \nThere can be a long line for dinner so be prepared. My friends and I think its worth the $38.","useful":0,"funny":0,"cool":0},
{"review_id":"fb62a1q6W8fI31qfz2jGOQ","user_id":"mF0okUKEsNEf6bJ6P_EodA","business_id":"3b14ebd1k9y7VJbp5hC0gg","stars":5,"date":"2014-05-12","text":"Always the Best service and food. Yes You may pay 2 dollars more overall but no crowds, noise or feeling rushed. I love this little find","useful":0,"funny":0,"cool":0},
{"review_id":"fDK7KNfeeOe5MwWRhz5fWg","user_id":"0ADhwdgCpVnLGgag4v9RMw","business_id":"qK9Ap-_B_Nof_WwockrVCw","stars":2,"date":"2017-01-15","text":"Really high prices for average food.tried this place with my wife for brunch.Let's just say not worth the time.Service was great.Sadly that's the only great part.If I'm going 2 pay $33 for a couple's meal I expect 2 be paying 4 quality food not just quality service because that's what I feel I paid for.","useful":0,"funny":0,"cool":0},
{"review_id":"frN-smawEz2gWhOc5FBUxw","user_id":"0ADhwdgCpVnLGgag4v9RMw","business_id":"3JekfARgFuMeLTMcOpgqyQ","stars":4,"date":"2017-03-22","text":"Second time coming.First visit tried waffle cone and left..Today added burger fry meal with cone.burger was ok.not one that differentiates itself from other burgers in the area.fries were hot.fast and polite service gets this place 3.5 but different ice cream choices and amount given gets an extra bump up to a 4.worth checking out but mainly for ice cream.","useful":0,"funny":0,"cool":0},
{"review_id":"qH5WnLJjHV_MV5LMgeqP6A","user_id":"0ADhwdgCpVnLGgag4v9RMw","business_id":"M9Ff-3kgqCbVZEMJsPSqXQ","stars":4,"date":"2017-03-19","text":"Came in to a very relaxed atmosphere.clean and hospitable.Wife has been trying to watch her weight so calories marked on menu for different items a big plus for us.Wide range of items to choose from was grand.Even for a carnivore like me.Sandwich came 2 table looking and smelling grand..Tasted great..Sourdough bread a new fav of mine.great experience.will b back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"25hY_JNEiJG42kXg120ZQA","user_id":"xnZSyjsL1ldTEHKI5Y3o0g","business_id":"F-ZpQbPluGcVmcI3jM_TfQ","stars":1,"date":"2016-01-19","text":"I've had the same experience others have had.  The sales rep lied about install fees, who he worked for (claimed to be a corporate Directtv employee, what package I was going to receive,  promised a discount on my AT&T service which was never delivered, offered to bundle billing for my Internet when it's not possible to do with the provider I had.  This was after trying to sign me up with a different Internet provider that only offered 10mbps when I already had 50 and told him that wasn't enough.  He did not care about what service was right for our family,  only cared about the sale.  \n\nWhen I became aware of all the lies, they promised the moon to make up for it but only delivered on part of the promises and now claim that they never said any such thing.","useful":8,"funny":1,"cool":1},
{"review_id":"NzMncVXkKWu258koWU3eyg","user_id":"m8dTCmO0vUBZGexFObr6-w","business_id":"GSyKcUP1G4bFc74nYvejQA","stars":5,"date":"2017-01-23","text":"Amazing salon. I see Heather whenever I get my hair done and she completely understands what I want done and I've never been disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"-muhX-45FqMFB6cwp4Y0hg","user_id":"tKSnPBVDBM-92LTPtiqcpA","business_id":"zbrFk-4ejesAJD8EwcdHxg","stars":5,"date":"2014-06-14","text":"By far the best Mexican food ever!  I have been going to Valle Luna for over 20 years and they are always delicious!!  Service and food are definitely worth going back for.","useful":0,"funny":1,"cool":0},
{"review_id":"WUwXCYUhVUTFL6A-3ak6pw","user_id":"uL9JkMNmDd0fqcVIBWrbPA","business_id":"YauBkH-HEx148jC0pv4Hcg","stars":5,"date":"2016-02-14","text":"On our way for Valentine's Day breakfast. \nLove  the Eggs Benidict w Filet Mignon & Crab Omelet","useful":0,"funny":0,"cool":0},
{"review_id":"IxsKAnHkumGL-bTeHi0_Dw","user_id":"IweiEpPzjUlSnR8pCQZTfQ","business_id":"2CGXZdCDEyM4Ba0Q-K8WyA","stars":1,"date":"2016-05-29","text":"We have been waiting to try this new spot...first and foremost, nice atmosphere for a Saturday afternoon...our server was \"okay\", just not really attentive for a non busy place...which is why we  couldn't help notice the table across from us not clean through out our dinning experience.(which every server saw clearly because they looked at it, but refused to fix) Which remained the same until we left, unclean and disgusting, which we still took all in with a smile , but finally complained that our server sucked to another server, which was eager to tell our server. Lets just say our server handled it with \" true grace\"...needless to say, there is still \"one\" great server there, which was always getting our server or answering our questions, with a smile and energy....She constantly checked on her tables, with a smile and pure energy,\"wishing we sat in her area\", because it was seating yourself basis...We rubber necked for our server. And when she did finally come, it was us that was out of her way...","useful":1,"funny":1,"cool":1},
{"review_id":"B1PB-CGEHtGHDbsy76fHfw","user_id":"4Qn2a1t7YiHjWC9bz-Qi9g","business_id":"dp2G2AplQaejCIvV2WVLNw","stars":5,"date":"2017-06-29","text":"I have been to this location many times and I always have a great experience. Staff is friendly and service is fast, and I have never had an issue with my order. Whether walk up or drive thru they always get it right!","useful":0,"funny":0,"cool":0},
{"review_id":"rPi4SjI-O4juYnsV0VeiYQ","user_id":"4Qn2a1t7YiHjWC9bz-Qi9g","business_id":"pqJ_L-7WC2pDdUa2GLDwRQ","stars":5,"date":"2017-02-21","text":"LOVE LOVE LOVE this place! Super friendly staff, cozy and comfortable atmosphere and great Guinness! I don't live in the city so anytime I get to uptown this spot is always on my list of stops and my go-to place for St. Patrick's Day!","useful":0,"funny":0,"cool":0},
{"review_id":"-Ta6nT6I8zWGWkuxfYC8ug","user_id":"0MhomLDcElzBie_bNrODyg","business_id":"i9PUoStRuesSnIKWY6ZOrw","stars":5,"date":"2014-06-22","text":"I have been looking for a hair stylist for a long time and my friend recommended Janette.  Because I have the ombre coloring, I was a little nervous.  Janette not only colored my hair just liked I asked, the cut and styling was perfect.  I will definitely return to Janette to take care of my hair.  Thank you, Janette!","useful":0,"funny":0,"cool":0},
{"review_id":"aheOjFq-KS_kEfsmO4mlxg","user_id":"fpFEu0SL_bcXWGiHf-HKVg","business_id":"KLNY8ewfiaCuuDtqETW5SQ","stars":5,"date":"2016-12-29","text":"I love this location! Everyone is so friendly and welcoming. It is by far the best one hour workout you can have! Every trainer that trains here it's awesome and definitely knows what they are doing!  Go orange!","useful":0,"funny":0,"cool":0},
{"review_id":"uU81enTsXZ5XtTb0d94UIA","user_id":"4KN0RlauSA4plA5uK70Gng","business_id":"jScBTQtdAt-8RshaiBEHgw","stars":5,"date":"2017-05-15","text":"This place is amazing! Great food and service. Plates are unique. The country plate uses the world's best gravy. Will be back to bring the family.","useful":1,"funny":0,"cool":1},
{"review_id":"kmrcwcDOjL6hreLWDIlepQ","user_id":"4KN0RlauSA4plA5uK70Gng","business_id":"hLtXKwl14d2cNKj2OxJNdQ","stars":5,"date":"2017-05-20","text":"Great place. Took only 10-15 minutes. Lindsay was very helpful. She noticed the battery on the phone was defective as well. She was able to get it swapped out as well.","useful":0,"funny":0,"cool":0},
{"review_id":"UkGdMdqydjbFg589IwF9Xg","user_id":"f1sIYgrM9wWRE8f8SRIR7Q","business_id":"ICdoTODBaprN0UReete9VQ","stars":1,"date":"2017-07-11","text":"This place is a joke, first time coming here and the last. I placed my order, I go to pay and the guy at the counter over charged me, he was so confused how to use the cash register.  I end up waiting for my order which is a take out order while they serve other customers. I go to the counter, ask if my order is ready, I'm told a few more minutes, because they forgot to prepare my order. Wow never will I go there again","useful":0,"funny":0,"cool":0},
{"review_id":"25-HiSFDZcU9qk-c_0Z73Q","user_id":"BCIDrApewGiUP19HbevexQ","business_id":"yWxL9xODQvI1EnPMPGp1pw","stars":5,"date":"2016-06-24","text":"Great store! You can find everything that you need in this store. The staff is very knowledgeable especially Azam, and she helped us a lot. As first time parents we knew nothing about baby's gear. She spent lots of time with us to explain and answer all our questions, and believe me, my husband had lots of questions. We bought everything we need and had the registry with her as well. It was great experience.","useful":0,"funny":0,"cool":0},
{"review_id":"B7z0ohNLuY2llBq7u-N04g","user_id":"Ydiu6aMbpH9q0isOSKkggg","business_id":"rFb9J1njudA6j7zym5hL1Q","stars":4,"date":"2014-07-25","text":"Great burgers and great staff. The type of diner where entire families come to enjoy their favourite burgers and everyone leaves with a smile on their face.","useful":0,"funny":0,"cool":0},
{"review_id":"mwiEe2uKC68IQn5Y-XhGDQ","user_id":"DloDCZzTTQMyieOSRoMrBA","business_id":"RVNxhRf8ERTAb38vBWvCig","stars":3,"date":"2010-12-31","text":"Sure its way overpriced.  Sure the pickings are slim.  But if you want a quick decent sized breakfast its the only way to go in terminal D.","useful":0,"funny":0,"cool":0},
{"review_id":"H3IqezbsU56ZOWXFho05sg","user_id":"bJWp3NVztF37n6tKq65EEw","business_id":"e6W3BJwtPE7VzwkCNrjcKw","stars":5,"date":"2015-01-20","text":"My new favorite nail salon!!\n\nThe owner was very friendly and attentive.  Water and hot tea was offered many times. The salon was super clean and decorated very classy.\n\nMy nail technician Christine was the best!!  I got a gel mani and pedi and couldn't be happier.  The deluxe pedicure was amazing - awesome exfoliating scrub, massage, and moisturizing lotion.  Oh and the  fresh oranges used for the massage were unbelievable.\n\nOverall I couldn't be happier with my experience and look forward to my next visit.  Highly recommended:)","useful":0,"funny":0,"cool":0},
{"review_id":"z4HzO4kFCGX89lFi0DA3rQ","user_id":"hbYynWaKeoDB3hVVlrzCGA","business_id":"D1czdOwjbkIWbXHqphwvXA","stars":5,"date":"2015-07-12","text":"We always make our way here when we visit Vegas. Never disappoints, always delicious and plenty of food for everyone. Server was nice and attentive.","useful":1,"funny":0,"cool":0},
{"review_id":"JhlBnMkIKxWDD3jT9gpmnQ","user_id":"UWGrPd3c91UJ59D_XJ3ztA","business_id":"gLOc1Fzl8yuKGq7B1TWj_A","stars":5,"date":"2017-06-30","text":"Sam is amazing! He is meticulous, and for someone who is OCD about her nails, he is an awesome pick! He cleans around the nail after every coat of polish; even the clear coats! I will be going to him from now on even if I have to drive 30 minutes to get there. If you like perfectly shaped, colored, and smooth nails, I would choose him.","useful":0,"funny":0,"cool":0},
{"review_id":"AZguPg7yc5wThWV9td9MhQ","user_id":"UWGrPd3c91UJ59D_XJ3ztA","business_id":"IXUwuNjy707wJNW2U4sRVg","stars":5,"date":"2014-01-30","text":"The food is AMAZING! I'm so glad we found this restaurant. I always have the Gamberi and add the house salad! My husband changes it up so I always get a taste of whatever he's having! Every time we come here the food is delicious!  Yummmmmmy!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"wW98c5LLf_ItQIbSNPelWQ","user_id":"UWGrPd3c91UJ59D_XJ3ztA","business_id":"8CSp_Zt1xbwFOkDOzu1jWA","stars":5,"date":"2015-04-04","text":"Sandra is AMAZING!!! Call her now if you are searching for a quick and painless wax! Literally, on a scale of 1 to 10, the pain was a 1! Sometimes, I didn't even know when she had pulled it. She is super friendly and professional. Will definitely be going to her from now on!","useful":0,"funny":0,"cool":0},
{"review_id":"uJT0FCr831d2bPAekqrHAQ","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"RJNAeNA-209sctUO0dmwuA","stars":5,"date":"2015-01-28","text":"YES! Just all around YES! I lived in Madison for a few years before moving up north and the Old Fashioned was one of my absolutely favorite places. So when Bob and I returned to Madison after years of being away, it was the one place that I absolutely had to return to. This is the place, after all, that gave me my favorite drink - the Old Fashioned. We arrived on a Saturday and the place was PACKED! Not unusual, we were prepared. We put our names down and they have a neat new system where they text you when your table is almost ready. So you are able to leave and grab a drink somewhere else (I would strongly recommend Merchant) while you are waiting. We waited for about 45 minutes and were quickly seated near the window in the main front room. Our server was fast and friendly and brought us our drinks lickety split. I (of course) had the Old Fashioned and it was just as good as I remembered - but different than I drink them now. They use Korbel Brandy and Sprite, I am used to having Bookers and water. They are sweeter than what I am used to - but still really good. We had the cheese curds, which are far and away the best cheese curds in the Midwest... maybe tied with the ones at the MN State Fair. There is less breading and more cheese than other places and they are SO good. Bob got the slow roasted pork shoulder and I got the house burger. They were both SO SO SOOOOO good! The burger was a sloppy, messy, drippy concoction of deliciousness and the sandwich was the perfect balance of spicy, sour and sweet. The food has an \"upscale down home\" quality to it. It's not super traditional fare, there are some surprises with the food but it's still familiar enough that it's really approachable. Everything about the place felt familiar and awesome! My only (TINY) complaint is that the tables near the host stand are subject to the door opening and closing, so during the winter it can get a little chilly there. If you are in Madison and really want to experience some exceptional Wisconsin food, then you NEED to come here. As Nick Offerman said, \"It's the only place where you can get a Bratwurst in the form of a burger, and to me -- there is no finer comestible than a deep-fried cheese curd.\" And who can argue with Ron Swanson?","useful":1,"funny":1,"cool":1},
{"review_id":"FY8CZ5AtaT-S4H_WIOOCcQ","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"c_iQzwsTDYraPvHSKz88QA","stars":2,"date":"2013-03-12","text":"Horrible. HORRIBLE! I understand that there is a market for kitsch restaurants in touristy cities. I get it! I am a tourist in Las Vegas and I came here. But for the love of God, even if it is touristy and kitsch - it can still be GOOD! We came here before we had a night out on the town and I ordered a very simple Cobb salad and Bob ordered a french dip. Okay, I know that there are different interpretations of Cobb salads, but I do believe that they all contain more than lettuce. My salad was a bowl of warm romaine with 1 piece of chicken that cost $24. What the heck people!? Bob's french dip was oily with tough meat and no taste. Don't worry though, it only cost $28. This was one of the worst meals that I can remember eating in quite some time. Probably to rival Moe's clam chowder in Portland. Maybe they think that you'll be so drunk that you don't notice? Well, I did. Do yourself a favor, go somewhere else, literally ANYWHERE else and you will get better food than here. The only reason I am not giving this 1 star (or 0 stars) is that the drinks were good. Definitely not worth the price - but boozy and tasty. Good grief! I know that there are better places than this, why can't the tourists get some good food too?!","useful":0,"funny":0,"cool":0},
{"review_id":"rqhw1WGW6d--7YkEuYZSbQ","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"Twcjx4ofM9GWwXN6LVGSzw","stars":5,"date":"2015-01-28","text":"Hipsters and cocktail aficionados rejoice! Madison has a cocktail lounge that puts the Marvel Bar to shame... or at least seriously green with envy. We arrived on a Saturday night around 6:00pm and the place was packed! We did not realize that it was restaurant week in Madison so a lot of the tables were reserved for people that were going to be taking advantage of that wonderful event. We were just there for the booze, plain and simple. The ambiance is very cool. Industrial chic - lots of concrete, glass, reclaimed wood and Edison bulbs. Lighting is dim, giving it a an intimate feel. If it was not SO crazy busy, it would be a really cool place to go on a date. I would say that they could benefit from some sound dampening. Maybe a rug or textile somewhere, because it can get awfully loud in there! I asked our mixologist for a whiskey sour (note - they're not bartenders. These people work magic with cocktail shakers and unique ingredients, they almost look like mad scientists or apothecaries with the amount of tiny glass bottles they work with) and it was absolutely the BEST whiskey sour I have ever had. It was done traditionally with the egg white foam - but I loved that there was a bit of orange essence and (I swear I could taste it) nutmeg or cinnamon? The prices are what you would expect at a higher end cocktail lounge - but given the quality, I would say you are getting away with a deal. The drinks are smooth and delicious with really nice top shelf alcohol. If you are looking for a place to broaden your boozy horizons, then you have found it here!","useful":2,"funny":0,"cool":1},
{"review_id":"JHKnoLXwzoQE4iy6sHylkg","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":3,"date":"2013-03-12","text":"Vegas is known for amazing shows, food and just general excess. I (loving all of these things) ventured out west for Valentine's Day. What better way to spend time with the one you love than wandering the strip with a colossal drink in your hand? We woke up early Saturday and ventured over to the Bellagio to enjoy their legendary breakfast. I have never been to a restaurant where the entrance looks like the entrance to the Incredible Hulk ride in Orlando. Winding around several velvet ropes till you reach the pay counter and receive your buffet ticket. There were 6 of us total, and the process was actually very smooth. We were seated quickly with a smile. We then wandered the absolutely endless amount of food options in the buffet line. I mean it was 10:00am, but they had everything from scrambled eggs to sushi. The only thing that was missing was any sweet breakfast item (who doesn't have pancakes or waffles?) All in all, the food was above \"meh\". I can't say that I was blown away, but I wasn't horrified either. I was not expecting it to be that good given that it was a buffet situation, but overall - it was pretty... average. \n\nWould I go back to this restaurant? Probably not. I have heard that the Wicked Spoon is much better. But then again - is one buffet really that much better than another? Isn't that the eternal question?","useful":0,"funny":1,"cool":0},
{"review_id":"sio6TDPzIPTlsCfrf72I-g","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"_FLNxsJ6T9WLkAdjwCLEqw","stars":5,"date":"2015-01-28","text":"Now, I cannot really speak to anything at this place except for the chai. I LOVE it. I don't even like chai usually. I especially hate the kind that comes out of a box and tastes like spicy condensed milk - blech! This chai is deliciously different. It is nice and light, spicy, hot and just super yummy! I have visited this place many MANY times over the years and I always have loved the atmosphere and the location. It's a lovely place to stop in and grab a yummy coffee and read for a bit while watching the hustle and bustle of State St. The staff is friendly and fast and it's just a really nice local coffee shop. If that is what you're looking for in Madison - then you have found it here!","useful":0,"funny":0,"cool":0},
{"review_id":"PJoRkxLx1I6R-QwT_gtrNw","user_id":"DBkfQhR64fqkCYeHJx9Pkg","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":4,"date":"2013-03-12","text":"You have to ask yourself sometimes, how crappy do I want to feel after I eat this? If the answer is - not at all, do NOT eat here. While in Vegas I wanted to sample some non-strip fair and drunkenly asked a bouncer where he liked to go eat - he said Hash House A Go Go. Given that he was about 6'5\" and weighed 250 pounds, it all makes sense now. My girlfriends and I arrived around 11:00am on Sunday morning and were told it was about to be about a 40 minute wait. That wasn't too bad - the line seemed to be moving quickly and there were some benches outside where you can sit and take a look at the menu. We were called inside to eat and the overall ambiance is pretty neat. Like a tin shed that is crossed with a barn? I decided to really go for full sickness feeling and order the fried chicken benedict (with their famous sage fried chicken). I have to say that I don't eat fried chicken often - in fact it has probably been about 10 years since I last had some, but sometimes you have to make your stomach beg for mercy. The portion that I received could have easily fed me for 2 weeks and I am not a light eater. It probably weighed 20 pounds. It has fried chicken, mashed potatoes, eggs, bacon, hollandaise and who knows what else since you could not see the bottom of the plate. Despite the gargantuan portion, the taste was excellent. Truly just tasty, greasy, cheesy diner food that does not apologize for using 3 pounds of butter in each dish. The service was fast and the coffee was great! Really, what else can you really ask for from a diner? The only reason that I am not giving 5 stars is that the portions are really (embarrassingly if not annoyingly) large. There is no reason anyone should need to eat that much food (now if you want to eat it, that's another story). But if you're looking to lay around for the remainder of the day in a food coma while wearing stretchy pants - then make sure you eat at Hash House!","useful":0,"funny":0,"cool":0},
{"review_id":"BbNG9LuVWxKm-x4tKu5w-w","user_id":"W34rT7u8VHQYbbv2qb5DpQ","business_id":"t6ZIBNrQjvtwor8W-u3sUg","stars":5,"date":"2014-05-10","text":"This was my 4th time coming here and it was good every time with a great price portions are well over satisfactory. I ordered beef and broccoli my girlfriend got orange chicken both were fresh the broccoli was not soggy or over cooked like most places the orange chicken had great flavor and moist less batter and more chicken how it should be.","useful":0,"funny":0,"cool":0}]