[{"review_id":"toNoaMHidZ776tpJ9u1AUA","user_id":"S3rMzYuiMAwoqJKWiYTiGw","business_id":"Q9vcbIn-DGht360D3F78Kg","stars":5,"date":"2015-12-16","text":"Staff was super friendly and knowledgable! Assisted, directed, and explained when questions were asked. Clean and well organized with a plethora of items!","useful":1,"funny":0,"cool":2},
{"review_id":"CziLHrXCONtwjh-M0nmqFQ","user_id":"F7FFeGW5TwZc5dWlXI6YoQ","business_id":"1jPLv-vyjPSvtl2ntSfdgA","stars":5,"date":"2016-10-26","text":"I  am neither a family friend or a relative of any of the employees. I have used this company several times and have always had excellent service. Jesse was our tech today and he could not of been any more helpful. All the times I have used this company I have never felt as if they were pushing something on me to buy or repair that didn't need it. Also, my parents who are elderly had an issue with their furnace last winter. As always you  got to worry about people taking advantage of seniors on stuff like this. . I did not have this concern when I suggested they used this company. They treated them very well and did not take advantage of them one bit. They were extremely happy as was I.","useful":1,"funny":0,"cool":0},
{"review_id":"0yxOyJAPjZHR6n41sduOAw","user_id":"Fm4aiobGHSlEoTj6JP9RJw","business_id":"0zTLMQOZhiCp9GFtegiFsw","stars":5,"date":"2014-05-13","text":"This family-owned gem is fantastic! Everything was delicious, especially the lamb korma. Everything I ate was a different experience. It has the feeling of eating at a friend's house, but only the kind of friend who is a great host. The owners are extremely welcoming. For newcomers to Indian cuisine, the owners were very helpful in explaining how best to compliment what dish with which sauce and explain the overall Indian cuisine experience. You can really taste the love in every bite.","useful":0,"funny":0,"cool":0},
{"review_id":"YVPxTcfEf21g-tl3O34X-A","user_id":"Fm4aiobGHSlEoTj6JP9RJw","business_id":"rswuhMY5vCbvZvF2wBIhqg","stars":5,"date":"2014-08-02","text":"Best Chinese food in Phoenix! I love Chinese food, and I've tried numerous Chinese food restaurants across the valley comparing various dishes. Sun Asian Kitchen is clearly the best. My favorite is the beef egg foo young. The place looks great too. Very friendly staff. I come here as often as I can.","useful":1,"funny":0,"cool":0},
{"review_id":"MxxKEX71fOb3YxKy6a6p4A","user_id":"Fm4aiobGHSlEoTj6JP9RJw","business_id":"1JjRQgxV3UFJlpFF6npjUw","stars":5,"date":"2017-06-22","text":"I had ear problems for years that went ignored. After an ear wax extraction, I could swim without my ears clogging.","useful":0,"funny":0,"cool":0},
{"review_id":"iPgTSnft75DzDAdupoWGzw","user_id":"Fm4aiobGHSlEoTj6JP9RJw","business_id":"6kRi4YScqY1iK37Xmy2FpQ","stars":5,"date":"2014-08-02","text":"This place is one of my favorites. Very low cost for such quality and quantity. I don't often get full for so little money, but I was completely stuffed after I finished my meal. The Philly cheese steak was delicious; every bite satisfied my taste buds. This is one of those places where you are gonna wanna try everything on the menu.","useful":1,"funny":0,"cool":0},
{"review_id":"UU5efxkYQXsWOGbXfdYnow","user_id":"zRNYyziHkSC4F6IkvZzaXA","business_id":"5zHi8eQhO7sO3N15zHgkUg","stars":5,"date":"2017-05-20","text":"The sandwiches are great and the vibe is good. I highly recommend the French dip it was probably the best one I've ever had","useful":0,"funny":0,"cool":0},
{"review_id":"RwFojHI9XYRv544Vqi68zQ","user_id":"WtJWmGXcZrREDkCvuv19jw","business_id":"SfvxPlsZrvyPXbuAW8KCMw","stars":5,"date":"2017-12-19","text":"The place has amazing noodle bowls! I had the house special and it was delicious. The staff was extremely friendly and let me know what was in every dish. They even have Boba tea! I had the high Thai tea and it was top notch.  My friend had the California poke bowl and it was really fresh. You can even pick your own ingredients for your bowl!","useful":2,"funny":0,"cool":0},
{"review_id":"mzF9v330TwEMJtmS0KBWkA","user_id":"F_n_LBn9_CJixx-_jevy-w","business_id":"xkVMIk_Vqh17f48ZQ_6b0w","stars":5,"date":"2014-08-01","text":"Food was amazing!!! I had the scallop starter which where the best scallops I've ever had they were a great size , for the main T-bone steak which just broke off the bone was absolute quality! We had a side of mixed cauliflower which was cooked beautiful! Would defo recommend this restaurant but must book in advance!","useful":0,"funny":0,"cool":0},
{"review_id":"UUNbQBLwQXbIlNkdACWm_A","user_id":"Rlu4KlvQEbsQcQjMbnvMlg","business_id":"u09bcA8mmWEAusKBudAidg","stars":5,"date":"2013-08-02","text":"Dr. Smith removed a cyst from my son's nose and cheek and left no scar whatsoever.  Great job on my boy.  It was miraculous.","useful":0,"funny":0,"cool":0},
{"review_id":"Gu4FHBMnKBbbLXpIcRookA","user_id":"Rlu4KlvQEbsQcQjMbnvMlg","business_id":"jqdGIx5gFB6zKe-17DeM8A","stars":5,"date":"2013-09-28","text":"Dr. Simpson is the most caring and capable Chiropractor out there.  The front office people are so kind and helpful I could not wait to come back for more treatments.  After an hour in Dr. Simpson's hands, I felt like a new man.  There is also a massage therapist on site and they will take care of all your neck and back needs. All I needed was a simple alignment, and I felt 25 years younger and had lots more energy the next day....after a good nights sleep.  Highly recommend these guys!","useful":0,"funny":0,"cool":0},
{"review_id":"zAzJHg1Va5XYCX6GYyfFHw","user_id":"UpdjmCtmK3SIXsGp1FTKgQ","business_id":"gBfPyzPRmeOaj3SdcIj0Rw","stars":3,"date":"2014-07-03","text":"Good quality sushi a little heavy on the wasabi. But for me very overpriced but I guess that's Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"jjcar1f70kGKgn2nS6xcEg","user_id":"BUJnIjw3X9ZjkGeMJ3CbbQ","business_id":"0AQnRQw34IQW9-1gJkYnMA","stars":1,"date":"2015-02-10","text":"If I could give it 0 stars I would.   Absolute worst service we have ever experienced.  Didn't receive all of our food ordered, asked 5 times and still didn't receive it and then she brought us our check still without receiving all our food.  No apologies just a nasty look on the girls faces.  We paid exact change and left.  Apparently made enough in tips from other people to get their boobs done but we definitely won't be back.  Sad because it was always our favorite every time we come here. Monte carlo needs to take charge","useful":0,"funny":0,"cool":0},
{"review_id":"UvFJIkIkSI1S9v7W3Btr1A","user_id":"NydKKs7KVpP-PiVroKKrlA","business_id":"UAOm069sCFAHQoikZYQ-EA","stars":5,"date":"2012-12-08","text":"I agree with the last reviewer, Coco is the BEST i have seen yet! \nMan o man, she can dance, act, is freakin' hilarious and has one of the hottest bodies I have seen on stage ever.\nAnd in contrary to Holly, this version with Coco is extremely topless in the beginning and pretty much throughout the whole finale.\nSo glad they finally got a star that is a real Vegas headliner. We did the VIP option and Coco actually talked to us for a while after the show. Unlike  Holly who just gave us an autograph and pushed us on our way after 30 secs.\nBig fan of all the supportings. Everyone was funny, fantastic singers, and the dance sets and numbers were on fire! Very sexy and entertaining show.\nYou can tell Coco is a dancer cause man she has the moves! I wanna see her on Dancing with the Stars next!","useful":9,"funny":0,"cool":0},
{"review_id":"87vhU-_D1Hcpo4yQjDh1oQ","user_id":"9sKsmniw9_oxCINDpVG2ew","business_id":"C_uTqA8IctcKHBL9JLEbLg","stars":5,"date":"2015-09-15","text":"Destination wedding made easy! When my husband and I decided on a destination wedding we knew we needed help with travel. After getting about 500 quotes (more like 10-15) we decided to go with the travel network as they not only came back with the best quote but were fast to reply and easy to communicate with. Ashley O'Connor was our travel agent and she really is amazing! She took care of everything for us, dealt with all of our 34 guests and sorted out every issue that we encountered. She is great at responding to emails and calls, worked for us (when it seemed like Air Canada was against us) and coordinated travel for our guests in 3 provinces, BC, Alberta and Ontario (everyone arrived the same day and the cost was pretty close for everyone which we found amazing) I recommend going with the Travel Network and working with Ashley if you want a stress free getaway made easy.","useful":0,"funny":0,"cool":0},
{"review_id":"1blDBP736tiIO3bSOoTlcQ","user_id":"9sKsmniw9_oxCINDpVG2ew","business_id":"GRTKpAPV523YqJpD3g4VOg","stars":2,"date":"2016-09-06","text":"Went to Alleycatz on a Friday for dinner after we purchased a groupon for a 3 course meal. Service was good and by the time we left at 9:45pm it was packed. The food however was just ok, all 3 courses we nothing special and by the time we paid for drinks, plus the added in tip, and tax it was a $130 meal. For that price we've definitely gotten way better food around Toronto.","useful":0,"funny":0,"cool":0},
{"review_id":"9Kly5BVzoZ8eED4zmLYwbQ","user_id":"cDpyr2jh-qj6b3IlOCh1qQ","business_id":"LkR6sWwheuf9Gf5aq0QPjw","stars":5,"date":"2017-08-03","text":"Reesa was FANTASTIC. Very welcoming, talked me through the process, and did exactly what I wanted. I got something in my mother's handwriting and she did it exactly as it was on the sheet I gave her. Love my tattoo! The receptionist and apprentice working that day were also great and very efficient with paperwork and aftercare. Love this place!","useful":0,"funny":0,"cool":0},
{"review_id":"RcZEvWgMFZMvWrkgMhHg5w","user_id":"oZ1AkksU7GAm6CG-g3rD1g","business_id":"vJ4vKiFKm1Fl3oPJ5ebtWA","stars":1,"date":"2014-01-03","text":"DO NOT Rent Here Unless you want to be oversold and undervalued \n\nMy tenancy at Sycamore at Scottsdale has not been long but has been quite disappointing. In 6 years of renting apartments in the Phoenix Metropolitan area, my tenancy at this complex has by far been the most dissatisfying. \n \nI moved into a 1 BR apartment late Oct of 2013 and experienced issues with the unit from day one. The unit I moved into was promoted as an upgraded unit with brand new appliances, countertops and cabinetry. Unfortunately those promotable items ended up being the only pieces of the unit functional or satisfying. The rest of apartment seemed to have significant issues that were either overlooked or quickly patched during re-construction to sell the unit. Within the first couple of weeks I noticed a number of issues with the apartment and relayed those concerns to management. \n \nSome of the issues included a washer\/dryer stackable unit that only released hot water and that did not dryer most likely as a result of being overused and outdated, a toilet that run water for nearly one minute after flushing and dispels a foul odor akin to mold regardless of how often it is clean, a ceiling fan in the living room that shakes dangerously when turned on, and a floor that vibrates uncontrollably for extended periods of time throughout the day. These concerns are matters that should have been taken care of prior to moving a tenant into the unit but nonetheless they were brought to management's attention. Initially the matters seemed to priority of the management but  soon I learned that my expressed concerns were of little importance to management and my satisfaction as a tenant was irrelevant. \n\nI spoke to management a total of three (3) times and still have yet to see a resolution to any of the matters. Each time maintenance comes to the unit they claim to address issue yet nothing has been fixed or even modified and management has not shown much concern to the matter. The toilet still had the same issue due to an inaccurate analysis by maintenance, the washer\/dryer still had not been serviced properly and the floor still vibrates noticeably throughout the day. The head of maintenance even came to the unit and promised to resolve all the issues but that was over a month ago and nothing has been fixed. \n\n As a result of this lack of care, concern and professionalism regarding the issues in the unit I have requested to vacate the unit early. Instead of addressing the issues and adjusting their approach to keep me as a satisfied tenant management chooses to contest me on what fees I should pay as a result of my lease termination. The property management wants me to pay a fee to break the lease even though it comes as a response and a result of their lack of care and professionalism. A lack of care for quality by overlooking or patching maintenance concerns in order to sell quickly. And lack of professionalism by not promptly resolving those concerns yet lying about doing so. I have attempted to collaborate with management to vacate amicably since the maintenance concerns are of little importance to them but instead they choose to lobby for me to pay for their lack of attentiveness and professionalism. \n\nI am even being asked to pay an extra nine (9) days worth of rent after my letter to vacate indicated and management agreed upon. Management further attempted to overcharge me for December's rent for an overdue charge that they still cannot explain or validate its origin. If matters had been addressed prior to me moving in the unit or even promptly once brought to their attention I would have been much happier with my experience in the complex and would not been forced to move on. However the management seems to be only concerned with selling units not providing potential tenants with homes up to standard quality of living. \n \nOverall I would say my tenancy at Sycamore at Scottsdale has been abysmal. The management of the complex seemed to be satisfied with over selling and under delivering; my business only seemed to be valued to sell a unit. This has been the worst experience in my rental history and would not recommend this complex to anyone any time in the future.","useful":8,"funny":0,"cool":0},
{"review_id":"oCh4tP7LPSErW2BnwLmafQ","user_id":"oZ1AkksU7GAm6CG-g3rD1g","business_id":"r95Nmh323i4_C3GwhwSdYg","stars":1,"date":"2014-01-03","text":"DO NOT Rent Here Unless you want to be oversold and undervalued \n\nMy tenancy at Sycamore at Scottsdale has not been long but has been quite disappointing. In 6 years of renting apartments in the Phoenix Metropolitan area, my tenancy at this complex has by far been the most dissatisfying. \n \nI moved into a 1 BR apartment late Oct of 2013 and experienced issues with the unit from day one. The unit I moved into was promoted as an upgraded unit with brand new appliances, countertops and cabinetry. Unfortunately those promotable items ended up being the only pieces of the unit functional or satisfying. The rest of apartment seemed to have significant issues that were either overlooked or quickly patched during re-construction to sell the unit. Within the first couple of weeks I noticed a number of issues with the apartment and relayed those concerns to management. \n \nSome of the issues included a washer\/dryer stackable unit that only released hot water and that did not dryer most likely as a result of being overused and outdated, a toilet that run water for nearly one minute after flushing and dispels a foul odor akin to mold regardless of how often it is clean, a ceiling fan in the living room that shakes dangerously when turned on, and a floor that vibrates uncontrollably for extended periods of time throughout the day. These concerns are matters that should have been taken care of prior to moving a tenant into the unit but nonetheless they were brought to management's attention. Initially the matters seemed to priority of the management but  soon I learned that my expressed concerns were of little importance to management and my satisfaction as a tenant was irrelevant. \n\nI spoke to management a total of three (3) times and still have yet to see a resolution to any of the matters. Each time maintenance comes to the unit they claim to address issue yet nothing has been fixed or even modified and management has not shown much concern to the matter. The toilet still had the same issue due to an inaccurate analysis by maintenance, the washer\/dryer still had not been serviced properly and the floor still vibrates noticeably throughout the day. The head of maintenance even came to the unit and promised to resolve all the issues but that was over a month ago and nothing has been fixed. \n\n As a result of this lack of care, concern and professionalism regarding the issues in the unit I have requested to vacate the unit early. Instead of addressing the issues and adjusting their approach to keep me as a satisfied tenant management chooses to contest me on what fees I should pay as a result of my lease termination. The property management wants me to pay a fee to break the lease even though it comes as a response and a result of their lack of care and professionalism. A lack of care for quality by overlooking or patching maintenance concerns in order to sell quickly. And lack of professionalism by not promptly resolving those concerns yet lying about doing so. I have attempted to collaborate with management to vacate amicably since the maintenance concerns are of little importance to them but instead they choose to lobby for me to pay for their lack of attentiveness and professionalism. \n\nI am even being asked to pay an extra nine (9) days worth of rent after my letter to vacate indicated and management agreed upon. Management further attempted to overcharge me for December's rent for an overdue charge that they still cannot explain or validate its origin. If matters had been addressed prior to me moving in the unit or even promptly once brought to their attention I would have been much happier with my experience in the complex and would not been forced to move on. However the management seems to be only concerned with selling units not providing potential tenants with homes up to standard quality of living. \n \nOverall I would say my tenancy at Sycamore at Scottsdale has been abysmal. The management of the complex seemed to be satisfied with over selling and under delivering; my business only seemed to be valued to sell a unit. This has been the worst experience in my rental history and would not recommend this complex to anyone any time in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"taj6xGX7pDMKRq45IRSg0w","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"_XN-GwzZwAyIqLKJsl2htg","stars":3,"date":"2014-07-19","text":"The hamachi roll was good but the tacos were small for $7. They should have been a tiny appetizer. Wait staff were ok but they were busy and said there was an hour to two hour wait. We waited 45 min. Would have had a seat at the bar because this nice guy moved over for us but then post menopause lady and her eager friend took our spots. All of paradise valley was here though so if you wanna be out, good place with a good vibe.","useful":1,"funny":0,"cool":0},
{"review_id":"SlV-4phXIdU9HfBVfpda4g","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"ZQ0CBGI50UsOq2BZe1WIHQ","stars":2,"date":"2014-09-13","text":"Horrible uncomfortable chairs, no music, bad service. I only came to meet up for drinks and we all decided on a scale of one to ten, this place is a 4. Not impressed nor will keep this on my radar","useful":1,"funny":3,"cool":0},
{"review_id":"JMlFg1LVwK9Viq0wVb8xFw","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"ufostEB8B3PC8treZ6FjlQ","stars":3,"date":"2015-09-03","text":"I've driven by this place a few times but never knew what it was. Myself and two girls came for HH. The server seemed hesitant to give up the HH menu. We wanted to try a new place and heard that the chef was from Pizzaria Bianco (not confirmed). We split the charcuterie board that had two cheeses and two meats with grapes and nuts. My friends enjoyed the olive oil. We each had personal pizzas on the HH menu that were only $8 for one topping. The pizza was pretty good but not memorable. Came on a HUGE plate bough so it just seemed odd. Split the farmers market said which was the same grapes and nuts on the charturterie board. Ambiance wasn't what we expected. A large room that did fill up for HH but didn't seem like a wine\/pizza spot. They seemed to care more about the beers. Just seemed a little mismatched. Our sever didn't really seem to care about three girls ordering HH. Our plate was dirty and no menus. I think the back patio might be a  good date night when it gets cooler. \n\nOverall we weren't impressed. If you want good pizza and a welcoming atmosphere go two businesses down and go to Grazie!!!!!","useful":2,"funny":1,"cool":0},
{"review_id":"d7AJwDpfn618h7xd4v-F2Q","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"1SLJKRYPRifERga33AjK7Q","stars":5,"date":"2015-09-24","text":"Amazing spa! I wish I could remember the girls name that gave me the best massage I've ever had!! It was like mikala? Or something. I usually go to the phonecian but this massage was only $63. I would have happily paid $150. I will be going back.","useful":2,"funny":0,"cool":1},
{"review_id":"JaE8X9st8OBOCM5ndcwXkg","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"C8D_GU9cDDjbOJfCaGXxDQ","stars":5,"date":"2015-09-29","text":"We watched football there this past Sunday and say at the bar with Alex. She is fabulous! Great bartender and entertaining and sweet for a Scottsdale bartender. They have a pretty good happy hour and was a decent spot to watch football if you don't like big sweaty dudes yelling at the TV.","useful":0,"funny":1,"cool":1},
{"review_id":"lNzjV7HIZIbDAZltyKUCEw","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"Ap17p-tA4Ipzy1s35DfCfg","stars":3,"date":"2015-10-23","text":"Hmmm. Indifferent on this place. Wasn't overly joyed by the menu. Nothing really stood out that I HAD to have. The ladies at the bar that gave us their spot said they weren't impressed my the menu either and left to go to Chelsea's Kitchen. We did order the crab dip that did taste very fresh. But it was kinda dry and the crackers they serve them with were so gross and crumbly. My friend said the oysters were lovely. The kettle dirty martini was only $12, so I was happy with the price but not happy it was SO watered down. We were wondering why it looked so full, then tasted it and it was definitely half water. The bartender was busy but friendly and the ambiance was cheery but the whole room seemed very dark. I guess no happy hour yet. We left and had dinner at LGO so we still all in the fam. I will go back to try the oysters and will ask for a better martini","useful":2,"funny":2,"cool":2},
{"review_id":"Z5ulh8Cpmz8VTMOEnEJGIQ","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"e-JcWplcnIx6lRmQoRF-Dw","stars":5,"date":"2015-08-22","text":"My first time using an airbrush studio and I loved it!! Book with Harley. She is so cute and nice. Easy experience. The tan looks great and for first timers it was only $20! I will be booking with her again :)","useful":1,"funny":0,"cool":0},
{"review_id":"JoNbGEO2NNyjbAHymNvArA","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"d10IxZPirVJlOSpdRZJczA","stars":2,"date":"2014-08-16","text":"Ugh the mussels verde were disgusting. Small portion with three mussels and even delivered with one closed! Good service though. It was comped but very fishy","useful":0,"funny":1,"cool":0},
{"review_id":"m90dtPcOmc7g9o-zLd6Mug","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"9qr0ZrfhCEW2Qx9PpUtKEw","stars":5,"date":"2016-03-29","text":"I've been going to Dr K for over ten years now and have referred friends, who then have referred friends because he is SO good at what he does! He's very thorough and professional but best of all he's become a friend! So going to the dentist doesn't seem like such a pain-staking experience!!! His staff is also very caring and great, they make it a priority to work around my difficult schedule too! \n\nYou da best DR. K!","useful":3,"funny":2,"cool":3},
{"review_id":"6P24PB2TEU4lZd6GZekOMA","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"3C5Z9homtzkWHouH2BHXYQ","stars":2,"date":"2013-11-26","text":"Wanna be Pink Taco. Bad service at the bar, the manager explained my friends meal at \"beef\" even though she is a vegetarian and it wasn't that taco. Juke box is a horrible idea. Had to listen to eminem and heavy metal. They send out meals according to when it's ready and prepared so it doesn't get cold in the back, yet it gets cold because you don't want to be rude and start eating without your company having their food. The place itself is very cute and could be really cool, unfortunately I was let down. Save your money and go to chipotle","useful":1,"funny":0,"cool":1},
{"review_id":"VEDdAl_IiwJmqc5hKOSxKg","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"NAPuzJcanOp91dE4GXPOow","stars":2,"date":"2015-06-16","text":"Tuna tartar and burrata was good. TERRIBLE service!!! And it wasn't even busy for hh on a Monday yet nobody wanted to help. The girls next to us were complaining too that they weren't getting service. Tried to charge me $16 for a kettle dirty martini.... Um excuse me??? It's a wanna be Yacht club with terrible club music. The owner did take off the up charge for the martini which was nice. Won't be returning though! Better places to visit","useful":0,"funny":5,"cool":1},
{"review_id":"4l19PImekeYZ8fX4oRQBfQ","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"qxVcSWGKyH3HkkHV8NinDA","stars":4,"date":"2016-01-29","text":"I used to visit saltys back in the day when it first opened. Not the best quality food but it was the place to be. The past few years I always suggest going there for a good patio spot but not a place to get good service or food, until today. We had a great bartender named Ben. He made our drinks exactly how we asked and didn't shrug at our sorta demanding needs. He even took our picture to help celebrate our day off! Even more surprising they have a lunch special where you can choose a starter, an entree, 2 sides (sorta like a bento box) It was actually really really good. And it was only $8!!! I would def recommend that to somebody who wants a healthier easy and delicious meal in old town. With a great view and patio! Thanks for changing my option salty seniorita!!!","useful":0,"funny":0,"cool":0},
{"review_id":"F2fUrSJuCR9apd-c8Jb1uw","user_id":"NuhHERr6nbnbnj03liGukQ","business_id":"a11zyJN_ue0CQ_bjoeke-w","stars":5,"date":"2015-06-22","text":"This is a must for authentic Italian food and atmosphere. Happy hour all day on Sunday's. I had the spaghetti and meatballs and my boyfriend had the chicken rigatoni. Both were excellent. The bartender Alex was great. Great service, great food, good prices and a lot of choices!!!","useful":0,"funny":0,"cool":0},
{"review_id":"M4FezL_IwcR22CV4jgYUpQ","user_id":"w-yxdljUYJEBLDoteE2njw","business_id":"Q2pyp7Nb3cD4Br2BOnxUDA","stars":5,"date":"2017-10-30","text":"Caught this food truck the other night at a century link event and had a falafel pita sandwich. It was very tasty and freshly made, nice job guys!","useful":0,"funny":0,"cool":0},
{"review_id":"4B03TdiZkb7TJkuxM9SzTQ","user_id":"QcGoaqltklc7U7tYNfubQQ","business_id":"xmtiyWnYQDNXDKstggYfvg","stars":5,"date":"2016-06-14","text":"She was awesome. She took care of my patches and was great to be around while she did it. Absolutely loved her. Inexpensive and fast. I already have more work for her.","useful":3,"funny":0,"cool":1},
{"review_id":"ogL6tatBnMgtfhkxJMTxlg","user_id":"ahMQXHFDp91KGoyL0wLQ8Q","business_id":"8dZzNMLH52ojGW3WT3Ok4A","stars":1,"date":"2014-07-11","text":"The place looks so nice but it's really the worst thing that's happen to my family. We got bed bugs and we had to throw out our couches and matress. You could smell the sewer from the bathroom sink. And the first month we lived there the carpet stains started rising. We had a little field infront of our apartment and my daughter couldn't play out there without stepping in dog crap. They charged is almost 2,000 literally for damage and most of the stuff was already damaged. Moving there was the worst thing we ever done !! Please ave you're self the stress and DO NOT MOVE HERE !!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"MGXRpPnUvKwIUcUFb34CUQ","user_id":"ahMQXHFDp91KGoyL0wLQ8Q","business_id":"gpm8n9qfNMT13OotUNlUZQ","stars":1,"date":"2015-05-02","text":"thank you to the guys  in peoria great job!!!!!but on the other hand the store on northern the manager cansuela was very rude  and did not fix the problem we had we picked up my sons tux and shoes day before prom the shoes were horrible they had grass inside the the shoe strings were shredded and on top the shoe had big cracks on them. when brought to her attention she did not help solve our problem she made it worse by arguing we did not get replacement shoes had to go buy some and we are not going to get our money back right away...spent almost 200 dollars for crappy serve.... cansuela you need to be fired!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"GLrem3MjCrmAC2XU8DB28Q","user_id":"A6qwEqssfGFUk8ERF0KKGw","business_id":"WTRbYHdzAZzKCGLqiYlImw","stars":5,"date":"2017-07-05","text":"If Shannan is working, you lucked out. She helped me this morning with a ton of bizarre stuff that had to be shipped all over the place. I could barely keep track of it, but she was amazing.","useful":0,"funny":0,"cool":1},
{"review_id":"7cJYfUZ7wUWZOqNZDZtD4w","user_id":"A6qwEqssfGFUk8ERF0KKGw","business_id":"COnqdubhr87gCDJjPGwT6A","stars":5,"date":"2016-04-21","text":"If you want unbelievably good Mediterranean food on the West side of town, this is the place. We haven't been thrilled with the other west side Mediterranean offerings, even though one of them receives a high rating here (maybe it's what we ordered). When we bring Freska home for dinner, there is complete silence at the table while everyone (even kids) gorge themselves. Wow.","useful":0,"funny":0,"cool":1},
{"review_id":"Tsvhn_pDmhxJsK9aVhLn6Q","user_id":"A6qwEqssfGFUk8ERF0KKGw","business_id":"50iUNYwDoHSiy0-b_Sc2rQ","stars":1,"date":"2015-01-04","text":"Beware their yarn and their return policy. I bought yarn at their store today, went home, balled it and started casting on. The yarn broke four times in 25 stitches. I took it back, and asked if I could exchange it. Unfortunately, the store doesn't allow returns\/exchanges on yarn that has been balled (there is probably a better word for that). First of all, I've been knitting for ten years and I never knew you could buy yarn that doesn't work. Second, you will never know it's defective until you start knitting, and you will have balled it by then. \nI'm giving up on the 'little guy' independent stores and heading to Michael's.","useful":0,"funny":0,"cool":0},
{"review_id":"s7e4_1iOzXo4KJv5aAd6QQ","user_id":"A6qwEqssfGFUk8ERF0KKGw","business_id":"m0xW6p2t2QefDkhp0PtoBw","stars":5,"date":"2013-12-22","text":"This is a great shop. The prices were very reasonable, and I found some adorable clothes for my son on the first visit. The staff person was friendly, but didn't stalk me. I'm looking forward to visiting again.","useful":2,"funny":0,"cool":0},
{"review_id":"lrWRSmtZNtinOSabJVmsSQ","user_id":"ezpy4ouJhTv3vweM3SWyyA","business_id":"brpJ1jYGH_Pgrx7dKIqesA","stars":4,"date":"2016-08-04","text":"Awesome place. Lots of exhibits, awesome robot exhibit, Amazing sub exhibit, cheap food, but expensive tickets","useful":1,"funny":0,"cool":0},
{"review_id":"-hCFtuvzClv6lzmMvpokOQ","user_id":"8Ct4DiSxv_J520FH7mev_w","business_id":"Naa6E0YU0Wr7jCuCE3pYtQ","stars":1,"date":"2015-06-16","text":"Be careful and do not to order furniture from this store!  They placed a special order on a table for which I paid for in full ($1198.03) and they NEVER delivered it.  After several attempts to contact the owner Stephanie, I had no choice but to file a small claims case against them.  They never responded and I was awarded a judgement in my favor.  BOHO FURNITURE AND STEPHANIE ARE THIEVES!  Also, they have another YELP page where you can see other customers with the exact same experience.  They recently moved locations from Charleston to Dean Martin.","useful":10,"funny":2,"cool":0},
{"review_id":"UyXFc-8E8Yx-yKawuLSbNg","user_id":"8Ct4DiSxv_J520FH7mev_w","business_id":"TN0jh0P9GLXyon_NdyHlEA","stars":5,"date":"2016-10-25","text":"Chris is an excellent photographer.  He was very easy going and patient.  He made me feel at ease even though taking photographs can sometimes be awkward and uncomfortable.  My headshot turned out great and overall I had a wonderful experience.  I highly recommend Chris.","useful":0,"funny":0,"cool":0},
{"review_id":"vp5JUA3D6DFbJXWw847q1w","user_id":"wJvUdWZR_4uvYSRE-thmpQ","business_id":"OqTGcS8a5w9iurkelB4Y_A","stars":5,"date":"2016-09-09","text":"Lived in the area 20 years and tried every pizza place. Pizza Nostra is my go to place now. Authentic New Jersey style with a great selection of quality toppings. At the higher end of the price scale but honestly not much more than Pizza Nova, Pizzaville or Pizzaiolo. Especially if you consider how generously sized the small pie is. I've bought my last 12 pizzas from Nostra with no disappointments.","useful":6,"funny":2,"cool":5},
{"review_id":"zDTwwhBlBcPxoZnJ35pz0g","user_id":"-P5v3u5Otyd5fUPzZ8SyMQ","business_id":"Vu8Z-zbNT_InsKm4IrdeCg","stars":5,"date":"2016-08-03","text":"My daughter and I love their burgers.Very friendly staff\nTheir fries are  really great.Had a banana milkshake last night..my only complaint is..it needed more bananas in it..I don't think they use real bananas,only something in a container that looks like a moll container.It was good but for the price,it should have real fruit in it.","useful":0,"funny":0,"cool":0},
{"review_id":"K0vKy_3nNd8k5YuhE5yQ7Q","user_id":"2-uiw3DIpK7NT7YEHcWKYw","business_id":"w-q9UTLqk6njQWOJEWelwA","stars":5,"date":"2016-07-13","text":"I arrived at Phoenix Sky Harbor looking for a good cup of coffee and discovered Miss Jessica knew how to create a signature drink with half the sugar.  She was pleasant and fun to talk to.   Knowledgeable employees are always a credit to your business. I will make sure to revisit this location again.  I recommend your shop when traveling to, from, or through Phoenix.\n\nThank you and know you have a good employee in Miss Jessica.\nJohn Kitto","useful":0,"funny":0,"cool":0},
{"review_id":"mtqVQ0HVBGa7kSTM6oij8Q","user_id":"JtnH6lWmtUb0BaxNJZKXTg","business_id":"A-uZAD4zP3rRxb44WUGV5w","stars":5,"date":"2015-05-16","text":"Bomb dinner last night before rock in rio:) and the hospital :(. Yellow tail sashimi!!!!!\nspicy tuna rolls! you wont be dissapoint.","useful":1,"funny":0,"cool":0},
{"review_id":"bQQhlHtpC0aUEd2H48EoAA","user_id":"JtnH6lWmtUb0BaxNJZKXTg","business_id":"bHF_7tP6cyOqnyU4Xm0gEQ","stars":1,"date":"2015-05-16","text":"Worst medical center ive seen in 28 years of life. Was in the E.r waiting room last night and witnessed two cops\/security looking folk tell a kid who was on the ground,face to the carpet,puking in a bag, and also crying that if he didnt get up they would throw him out or have him arrested. I shit you not, in an E.R waiting room  a kid who looked to be alone and  was in dyer need of help was approached and told get up or get out(couldnt hear well)? I thought they were walking over to help the poor guy.I saw this happen twice . I wanted to get the kid  some water but he looked dead . I went up to the little mexican man in nurses attire who was  signing people in and told him i was stepping outside and never came back. Sorry buddy if you ever see this, whoever you were  i saw you in the waiting room last night and had to come here and say this hospital is fucked up, on your behalf. I did not get any medical attention because i left after seeing this. I would not suggest anyone go here unless they want to be treated like they are in a casino bar while they are looking for medical attention.\n\nAlso the janitor (old white man) sweeping in the waiting room was cracking jokes and  talking about how there was HIV blood and Meningitus blood or the floor of the E.R.  waiting area. Funny right? Im suprised more people didnt get up and leave.This was last night friday the 15th 2015 ...Nasty people work here..cleaning staff yelling about HIV blood....as a joke in the ER wait area. Happened just how i told it.gross place.Happened MAY 15 2015  friday night.","useful":1,"funny":0,"cool":0},
{"review_id":"GELmhJQ_a8b5MnkXFOW8RA","user_id":"xLRg8t_tOQnaGnFQVl38zw","business_id":"5fquJHY2hMX9tPRD5s0t5g","stars":4,"date":"2013-10-16","text":"Rooster is a classic example of farm-to-table cooking. Locally sourced ingredients prepared with with care in an open kitchen. The setting is elegant without being pretentious. Our waiter was informed and made some excellent recommendations. \n\nStarted with the charcuterie sampler which included house smoked salmon, 2 cheeses, 2 house made salami and olives. Dinner included pork loin with grits and kale. Also, a nice pan seared sole with vegetables. A side of the pan roasted corn went well with all.\n\nOverall a great experience.","useful":0,"funny":0,"cool":0},
{"review_id":"hHDIwsxejckZSEekJjoyxA","user_id":"00DfZ839YJYaDlvaZihawQ","business_id":"iK1Srj0VMvjVfYoVA_2lLA","stars":1,"date":"2014-08-22","text":"I would not use this company. Used them while we went on vacation. When we returned our pool was green. I don't even know if they came at all. I would say that if you do use them I would make sure they come when you are home, so you can watch them clean your pool!","useful":2,"funny":0,"cool":0},
{"review_id":"iG-2Y_fgJaPXBcCmpXOchA","user_id":"00DfZ839YJYaDlvaZihawQ","business_id":"1nf3nY7xV10rlpc91qdq9A","stars":2,"date":"2016-09-03","text":"I bought our snake from them, and they were really helpful.  They were always nice and helpful until I needed to return the 40 gallon aquarium I bought from them.  When I cleaned it out I noticed the bottom was cracked.  I went in to buy food and ask about the crack since it was less than a year old.  The owner told me that she would need to talk to her supplier and that she would call me.  Well 3 weeks later I had to go in to get food, so I had to ask.  She told me that her supplier wouldn't do anything since it has been so long.  Well, it is a faulty product and they don't want to do anything about it.  She tried to tell me that her supplier even makes her buy new screens when they are ripped.  I would think you wouldn't want to do business with a supplier like that or that was just an excuse.  I could tell that she really didn't care to lose a customer and didn't really want to do anything about that.  I thought they ran a good business, but obviously they don't care to keep customers.","useful":2,"funny":0,"cool":0},
{"review_id":"Wu4eiybCuPRusLzCqkgI_Q","user_id":"00DfZ839YJYaDlvaZihawQ","business_id":"3Qi7NwTpAc3Oh1-wMb546w","stars":1,"date":"2011-06-29","text":"We didn't use them, but instead had them come out to give us an estimate on replacing one of our units!  We thought since they were being used by Home Depot that they would be good.\n\nWell the comfort advisor for yes recommended that we needed to get vents put in our attic, since we didn't have any and that we would need six with the square footage that we had in there.  We also had crack in the ducts.  They would fix for free if we had the unit and vents put in otherwise it would be a couple of hundred but he couldn't be exact.\n\nWe then had another company out that Costco uses.  Found out that we have four vents in our attic and the cracks in the vents were minor and that they would be fixed from the replacement.\n\nI would say if you want to use them just make sure you do your homework and check around before!!!","useful":22,"funny":2,"cool":0},
{"review_id":"BvAop9JIRgc3iaGEFPVqfw","user_id":"00DfZ839YJYaDlvaZihawQ","business_id":"kELI9g936jKsxad9hwPg0Q","stars":1,"date":"2012-06-12","text":"We thought we would try them through a groupon promotion.  The guy that came out to clean was lucky if he was working on our pool for no more than 5 minutes.  I didn't see him brush the pool and anything on the bottom of the pool stayed on the bottom.  The promotion was for 1 month of cleanings otherwise 4 cleanings.  They called before the 4th cleaning to see if we were going to continue, and when I told them no, they have not been back to do the 4th cleaning.  I called I have been told that they argued with me that my time expired a week earlier, but then after 5 minutes of telling them it hasn't they realized they had the wrong account.  Was told they would be out Monday and now two weeks later have not been out.  I would not recommend this company unless you like giving money away for services not rendered and that you end up doing yourself.  They talk a great game but follow through is horrible.","useful":7,"funny":1,"cool":0},
{"review_id":"4Yr4ktRKEYGXIwEdEwbQMw","user_id":"qLuKiVyGM4FVVJINJ-1jTg","business_id":"h5VZ0MqRt4vEUUG8oH6eEA","stars":5,"date":"2016-11-04","text":"Help me kick my Friday night off right. Walked through the door to a comfortable atmosphere. Greater by a wonderful waitress and not rushed to place our order as we enjoyed a meticulously made Old Fashion and a house refused peach martini. As our drinks soothed our pallet we were served an appetizer of burnt ends with Korean BBQ sauce and BBQ slaw. These delicious bite size morsels melted in my mouth and served as a nice prelude to the enjoyment to come.  The brisket was recommended and served with BBQ corn with an infused BBQ butter along side on some creamy and lite macaroni and cheese. The meat was full of flavor and so tender that it dissolved in our mouths. I enjoyed the Friday night prime rib with loaded baked potato. The a 12 ounce piece of meat the portion seemed huge. The flavor was filled with the effort you would expect in a slow smoked prime rib. Once we finished our meal we slow rolled next store to enjoy a movie. That is how you end a stressful week. Thank you.","useful":0,"funny":0,"cool":0},
{"review_id":"cQt_uaJ4gDb8yV0anLo4eg","user_id":"HK3ei3OLqHJwNezItU2KVw","business_id":"j8OUTcN1RG-UCzFUW8oogg","stars":5,"date":"2013-07-04","text":"I love jimmy j's.  I eat at the desert ridge location every week, and have always been satisfied with the service.  I not sure what everyone else is complaining about. \n\nMy favorite is the vegetarian #6.  Lastly, I highly recommend the delivery option.  The drivers are usually fast and very personable.","useful":0,"funny":0,"cool":0},
{"review_id":"99LyzGkvLi13XBOqrz2ZEA","user_id":"veEPuTqFlBxq_aM9piG5Zw","business_id":"YjAo1DBb0YuPE_RWmhNyrA","stars":5,"date":"2013-02-26","text":"EverythIng was great - service,food, price, ambiance.  My wife had ahi tuna and I had rainbow trout.  Both were excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"km3md6xWyTSVg6j2iMF7Pw","user_id":"2yzmt-LylmAE5L7ktX8IEA","business_id":"REXvfvEMPKbcLBD33y6fjA","stars":5,"date":"2014-11-30","text":"This place is amazing great service and \"BEST\" quality of foods. I do not usually give five stars but this place is amazing.  DEFINITELY come here if you are looking for entertainment + quality.","useful":0,"funny":1,"cool":1},
{"review_id":"_f01_DgB4nFVKnvoMgT-4A","user_id":"lZbsvmQFSCohrJQO3WMgcw","business_id":"hEu9xC836j8D1PwUjRDyXA","stars":5,"date":"2013-03-25","text":"Luis and his team at LG Collision are friendly and helpful.  I had a minor door repair completed on a delivery van that I use for a business.  LG Collision completed the work satisfactorily and within two business days, as promised.  LG save me 30 % vs. the closest competitive bid.  In the future, I'll return to LG for any auto body repairs when needed.","useful":0,"funny":1,"cool":0},
{"review_id":"mo6m0uoAoHE6ZB3jIzEDog","user_id":"IqBstWRrMdROvBYvDF-38A","business_id":"JUT_U4Tx6I87rrU-tdMZCQ","stars":5,"date":"2015-02-28","text":"I had driven past the salon MANY times and never been in.  Today I decided to check them out and I am so glad that I did !\n\nAbsolutely fantastic service, I had a consultation 1st to determine exactly what I wanted :) then a full color and highlights, cut and eyebrow wax (the works).\n\nMy stylist was wonderful, superb cut.\n\nMy hair looks wonderful (I have a very short angled cut with side swept bangs).  I couldn't be happier.\n\nThe salon is very clean and full service - hair, color, nails, waxing, massage - everything you could need.\n\nPrices are very affordable too.  Will definitely return :)\n\nJust remember you can't tip on your card, and they don't have an ATM, but so long as you know you are good :)","useful":0,"funny":0,"cool":0},
{"review_id":"9GErI_cXCW0u2Vdo0YM9Yw","user_id":"t_I9V7-nxgzqV4zS44Rrww","business_id":"n_rEQNgsCOLNfMzGqFhn1g","stars":1,"date":"2016-12-02","text":"Had a horrible experience! It all made sense why it has a bad reputation. I will never step into this restaurant again as long as I am breathing!","useful":0,"funny":0,"cool":0},
{"review_id":"V9tzwSFAzf9_Vi_uQ7c2mA","user_id":"7ZR2LXSughhdlvp0aE15aA","business_id":"goi1r30_CjH9TymbMs9OwQ","stars":5,"date":"2015-03-20","text":"Awesome. As always been.  Need anything special ask for Jaime  the Chef.  If you are a vegetarian its a plus. He can make some amazing exceptions.","useful":1,"funny":0,"cool":1},
{"review_id":"xBPXUmE884IH9n9uH93vLQ","user_id":"7ZR2LXSughhdlvp0aE15aA","business_id":"E-LZ0Xl1ETDeMrtM9H3-PQ","stars":5,"date":"2015-09-08","text":"FnB is by far the best restaurant for a great dining experience.  The food is delicious and eclectic and its a treat to have tomatoes taste really like tomatoes.  FnB  is a party for your taste buds.  The menu changes often and has the best of what seasons have to offer. Getting a bite for lunch there on the weekend is one of the things that i do enjoy.","useful":0,"funny":0,"cool":0},
{"review_id":"jCOu5AdSjhlpZuiFsDbbEQ","user_id":"7ZR2LXSughhdlvp0aE15aA","business_id":"xSplhd6mlpQzbjUAq3rP6w","stars":5,"date":"2015-08-23","text":"Great food and very fresh and they make it anyway you want it. New favorite lunch spot. Great place for the vegetarians as they accommodate them very nicely.","useful":0,"funny":0,"cool":0},
{"review_id":"GLBn2-I2cyGFccg4cvim2g","user_id":"7ZR2LXSughhdlvp0aE15aA","business_id":"n5fp_q7OvqVCnV_IhAyaAQ","stars":1,"date":"2016-01-02","text":"Well after paying for a $18 dollars for a glass of wine you don't expect a PLASTIC glass. Come on !!!","useful":5,"funny":5,"cool":1},
{"review_id":"J-8P5NXLxqNjSKv7KsjKbw","user_id":"6UM44iyD0u9ea1nAL6SSgg","business_id":"n-m-t6aJVa2COhjJnaDuaQ","stars":5,"date":"2012-07-27","text":"Summer Rivlin, Alex's wife and partner, in the agency, is as wonderful as it gets. I found their agency on Yelp, after receiving several different quotes from other Farmer's agents and other companies. Not only did Summer meet with us and took the time to get to know us, she went through every option on our insurance plan so that we knew exactly what we were paying for. AND, then she saved us over $400 a year! She is personable, a Las Vegas native, and she really does want to help you. She has a genuine interest in her customers and that's why I am writing this review. Farmer's is already a trusted name in insurance and Summer just puts it over the top for my husband and I. Please choose this agency when looking for insurance in Vegas. You will be very pleased!","useful":0,"funny":1,"cool":0},
{"review_id":"pdUQnmCQMCbs6JyA4bV7aQ","user_id":"7DLqC7N0i5xQE630ik0gxA","business_id":"PuqL2qQHLFLhY2SBlTtc_w","stars":1,"date":"2016-12-08","text":"If you're considering buying a home in Gilbert and this company manages the home owners association, look in a different neighborhood. There's rules in neighborhoods that make good sense, and there's rules that seem to have no purpose other than to frustrate the residents. I purchased a Shea home because I thought it would be a quality build and neighborhood. If this is the company they always use, I will not purchase another. If I can't park my car on the street in front of my house for a few hours out of necessity in the name of \"safety,\" than construction vehicles should not be able to park on the street all day in excess of 10 hours (including Sundays and holidays). When I call and I'm frustrated with a warning I received for \"parking on the rocks or landscape\" of my home (not sure how this is possible in my yard, unless the tire of my vehicle was off the concrete by about 2 inches) and how the CC&R Declarations are written, I'm told that \"I'm talking around in circles\" because I'm questioning several different parking scenarios that I've encountered or been \"warned\" about.","useful":2,"funny":0,"cool":0},
{"review_id":"Lsmpo3I-1NU8NuW81T2xyQ","user_id":"qvo_NDLZOerWnND-imEQ7A","business_id":"_U7btRgwidF6mYsexgVClQ","stars":2,"date":"2015-10-01","text":"The hotel is located in a great area of Cleveland with easy access to great restaurants, bars and all of the stadiums. Recently renovated rooms which are small but comfortable. \n\nSounds great right? One major issue, to be a good hotel you need to be able to sleep. The rooms are basically situated around the interior of an old mall, with a few shops located around the bottom floor. Because of this the noise echos through the hotel at all hours. Constant opening and closing of doors along with people's voices can be heard at all hours of the night. \n\nI stay in a hotel 3-4 nights a week in a different city each week. This was by far the loudest hotel I have stayed in and I've stayed in them all.","useful":0,"funny":0,"cool":0},
{"review_id":"VWWzAYDhT3s20xZR-cYHgw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"D5oYTE-sbkV2wurOWOGzjQ","stars":4,"date":"2015-12-24","text":"some good doughnuts some not so good.  I like the doughnut holes they are delicious! My only issue is price and selection good be better sometimes.","useful":1,"funny":0,"cool":1},
{"review_id":"-LFT6Jf5qvLuxhIlOlOwqA","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"B70iTJjcPkuYn8ouUewWgw","stars":4,"date":"2016-01-11","text":"I really enjoy coming here food is fresh and tasty staff are nice.  Nice selection of pizzas and pastas and grilled selection.  The hamburger gusto and tuscan fries are really good so are the salads if you want light fair.  Good place for lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"g9LyEd0rPYWKBnLS881C4g","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"N93EYZy9R0sdlEvubu94ig","stars":4,"date":"2015-12-24","text":"good sandwiches! try the lemongrass one its good spicy but don't plan on kissing anyone after.  Service is fast even though they're really busy most of the time.","useful":0,"funny":0,"cool":0},
{"review_id":"jgCztmKHj9uyjDMMxO0omg","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"4POPYEONJpkfhWOMx_PyGg","stars":3,"date":"2015-12-24","text":"Typical pricey steakhouse but didn't wow me.  Steak and food were mediocre there are better places in the city when your spending that kind of $.","useful":0,"funny":0,"cool":0},
{"review_id":"rpmDifspsF32PuVl5q8KFQ","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"SnsZFsVf1tQvBCPmhe8gGw","stars":4,"date":"2016-03-23","text":"food is good i eat the bi bam bop which is tasty and fresh.","useful":0,"funny":0,"cool":0},
{"review_id":"AL5bNf_XwfHnNKZIwHp0ow","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"9ot8oInkYZTt6wkkGe__vQ","stars":4,"date":"2015-12-22","text":"beautiful decor and location! Food is creative and tasty great place for a date if you want to make an impression.","useful":0,"funny":0,"cool":0},
{"review_id":"X4U0XG8suIICy4107Owytw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"TFftsYkRIUtdo6ZhRwJ2lQ","stars":4,"date":"2016-01-02","text":"Good food, somewhat traditional Italian but very tasty.  Gets a little camped in this place so reservations are definitely best.","useful":0,"funny":0,"cool":0},
{"review_id":"m_YGlhquv2F2izgxHh9eOA","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"JJ8ypBu3b--fy4HA5RB1gg","stars":5,"date":"2016-01-11","text":"Funny enough went here recently and I'm not giving 5 star for steak I am giving it for the sea bass! absolutely delicious! very buttery and rich but great quality and with some Parmesan fries i was very happy.","useful":0,"funny":0,"cool":0},
{"review_id":"lvEj6oQHymUKOVvJm-Rx-w","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"bxut5RczUkEQjm8q5A-X1g","stars":2,"date":"2015-12-22","text":"these wings suck and location is dirty.  Skip this place unless you want a real dirty wing experience.","useful":0,"funny":0,"cool":0},
{"review_id":"hjAubT2ahGGLq17du1bfhw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"wSwRG4rrcZmA5zF5ZO_GEw","stars":3,"date":"2016-01-02","text":"Good tepanyaki experience but not great.  I would rate 3.5\/5.  Food is good but dinner, drinks, tax and tip is $200 lots of options when your at that price point.  I would happily go again if I'm not picking up bill.","useful":0,"funny":0,"cool":1},
{"review_id":"M2HjNywL2LmahI27Wb5Uvw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"_cjPEH9wXhKS-HQe_U3M4Q","stars":4,"date":"2015-12-02","text":"Great brunch, great atmosphere. I enjoy the steak and frites with peppercorn sauce really delicious and price is good. The back patio in the summer is great.","useful":0,"funny":0,"cool":0},
{"review_id":"o1DkHxqo-0X9V-Y-kcB2QA","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"kNlna23mYfRqGv7VJByKkA","stars":4,"date":"2015-12-22","text":"Very nice traditional steakhouse\/seafood place I have been going here for years.  Was here recently for a birthday and honestly its really good! I had steak and lobster they were both cooked perfectly. Great bread only one small problem was the caesar salad made at the table didn't blow me away was missing some body and flavour, otherwise great experience and quality food!","useful":0,"funny":0,"cool":0},
{"review_id":"rYqj9EVyH_77GLhUO7Zzcw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"QE1tzFyyyRKV1p7C4LRukQ","stars":4,"date":"2016-01-11","text":"I loved nandos for years then it went down hill for me.  This location has gotten me excited about Nandos again.  Fresh, good seating, nice location and good set up.  The peri peri fries are very good but I just love the chicken with hot sauce.","useful":0,"funny":0,"cool":0},
{"review_id":"eezHdv79L0SCy6zVR02qdw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"EhGPj8iJDIdaHnWg9d5BgA","stars":3,"date":"2016-01-11","text":"This is average dim sum nothing spectacular. I Originally came here because of Pearl at Bayview Village which I really like and should review......but this place isn't run the same.  First the restaurant needs some reno's carpet floors, dingy furniture its a little tired.  I could live with that if the dim sum was good but it just wasn't.","useful":0,"funny":0,"cool":0},
{"review_id":"K7tMAdmJgm0Ow4Gd9QIPTQ","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"Py97oycFokZ296KJ2Pe-hQ","stars":3,"date":"2016-01-02","text":"Convenient place for a drink and decent food but nothing special.  Service is good nice location","useful":0,"funny":0,"cool":0},
{"review_id":"ViUWNZDcMBbb3VjI5tSVfw","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"Q2ZNaN3p8s_-XXjBWyY2qA","stars":4,"date":"2015-12-02","text":"If I was rich I would go here more! Cowboy ribeye with extra butter sizzling and some side onion rings or steak fries.  I love the sizzling steak! And if you have room for dessert you wont be disappointed! If your a Costco member you can buy two $50.00 gift certificates for $80.00 at Costco.","useful":0,"funny":0,"cool":0},
{"review_id":"WvzdqQ3m3msvNDq9Mmnakg","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"GZ12skjXwuMuH3LidRN-mA","stars":5,"date":"2016-03-23","text":"im pretty picky this is best chipotle location.  fast, clean and fresh the employees do a great job.  yeah sometimes its not perfect but you cant win the race everytime.","useful":0,"funny":0,"cool":0},
{"review_id":"sjQWXJ6cQ0bbIaPoO1G3kg","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"O-b5osM0NO4f31dp6_DatQ","stars":4,"date":"2016-01-02","text":"I give 4 star overall but for their croissants they get 10 star! There some of the best in the city! I'm not a fan of macaroons but they have huge selection.  Sandwiches are ok but lack flavour and service could be a little friendlier but I just come here for the croissants.","useful":1,"funny":0,"cool":0},
{"review_id":"TRwypa5WhRVFsnjQ6-TNIQ","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"mG71gQ5HWl7ut9OCN6NJKA","stars":4,"date":"2016-01-11","text":"Been here a few times with friends and fam from out of town honestly I have always been very happy with the experience.  Yes its expensive but food is good maybe not 5 star good but the views and overall experience is the best.  Sucks obviously on a foggy day but when skies are clear you will see whole city and amazing views, good drink and food.","useful":0,"funny":0,"cool":0},
{"review_id":"YUNQonS394QLb61g3g9KZA","user_id":"FkRtFHEN7GVDqNCOsdBDyA","business_id":"dUePqUU5pROUEPiWBau72A","stars":3,"date":"2015-12-22","text":"decent bar with decent food service is good but nothing that will blow you away","useful":0,"funny":0,"cool":0},
{"review_id":"v_BcS8TYKTI1PD9FBedgLg","user_id":"u8ZelfnoclGHVdCZFLvh_A","business_id":"zPMa8i0F0Ua_9sqVk73GfQ","stars":5,"date":"2014-10-05","text":"Stopped here for lunch on our holiday to Scarborough. Just wanted to find somewhere to stop for food and couldn't have picked a better place. Nice relaxed cafe and friendly staff. Good choice of food on the menu and the specials sounded great. We were not disappointed as the food we ordered was fantastic. Got a kids pack for our son and comes with loads of cool stuff for the kids. Glad we stopped here and will make a point of going back. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"VHpbMiM1_hIol5PFNlfa5g","user_id":"HoI_ih4OGYXALJTBH0gGbQ","business_id":"b6yQUcrVCDDzSdV4DyCVPg","stars":5,"date":"2016-09-21","text":"Erica R has mixed up with the Howard Johnson Inn location. It's seems like she stayed at Addison Illinois locations not at Elk Grove Village Illinois locations. She is reviewing Howard Johnson Inn location at Elk Grove Village Illinois \nErica R please check your stayed records to verify the correct location. Thanks","useful":0,"funny":0,"cool":0},
{"review_id":"EZTXBYRmb41uAGnIUk6hVA","user_id":"bY2ARkv8lKIC0NuAsvqk5Q","business_id":"ViwjR6a_0Ytbk7MUnK19ag","stars":5,"date":"2012-05-17","text":"We got it done more promptly than we even anticipated.Excellent and personable service.","useful":0,"funny":0,"cool":0},
{"review_id":"8uW97kHzohiMjuQj64o46Q","user_id":"iTmG7WQbDpb-JbaAg-38Ow","business_id":"IwLVW7Af1M0Fv1QpXt4Pzw","stars":2,"date":"2013-12-17","text":"Ill give two stars but ONLY, because our server was awesome. Other than that save yourself at least $20 and go across the street to the Texas Roadhouse.\nIt was a Saturday night, so we did have to wait, but I would say it wasnt any longer than 10 minutes.  the staff was nice, and friendly, and as I stated before our server was great!\nThe food however was not we ordered the Parmesan Crusted Asparagus for an appetizer which was ok but lacked any real flavor. My boyfriend got a a 6 oz sirloin with mashed potatoes a chopped salad and a side of sauteed mushrooms and grilled shrimp. I opted for the Napa Chicken with the corkscrew mac n cheese w\/bacon. \nThe highlight of our meal had to be the shrimp. It was cooked perfectly, and who can go wrong with lemon and melted butter.  The rest was just not very good, the steak was overcooked, and the sauteed mushrooms were not fresh, they were undoubtly from a can\nThe chicken was cooked well but definitely needed salt, and pepper. The chicken came topped with artichoke hearts roasted tomatos and Portobello mushrooms. The tomato and mushroom were fresh, but the artichokes were pickled and it threw the taste of the dish off. The mashed potaotes and mac and cheese were the same as the asparagus and were mediocre at best, and the salad, well it was definitely from a bag and I wouldn't be surprised if the dressing was as well. \nAfter tip the bill was close to $70. Not worth it by a long shot. We will not be going back.","useful":5,"funny":0,"cool":1},
{"review_id":"bSS9p2G6Ennd0_gAPCThJA","user_id":"rGCIIrDna1UkRSIo7ejvig","business_id":"HZVAGRIT_8bC1tAlA5DHZQ","stars":1,"date":"2015-10-24","text":"Ox tail was dry and microwaved, beef was too chewy and tasted old. The patties barely had meet in them. Will not return unless they start making their meals fresh.","useful":0,"funny":0,"cool":0},
{"review_id":"LJVy7iWIsPBt-O030uVacg","user_id":"7vc0D0ymHb-FPhOpcoG0YQ","business_id":"Y1FmaM4sR6mII_06op7jnw","stars":2,"date":"2008-10-16","text":"It's passable. Just don't try calling the front desk. Service here is good when you can find the people or they're not on the phone. On the cell phone, with their friend, that is. -1.\n\nThe rooms were pretty small, but they got the job done. They were in the middle of remodeling, and I think we still had an unremodeled room. I say this because the beds were noticeably softer in another room that we had than the one I stayed in. -1\n\nThere was a sick stain on one of the box springs, it looked like blood. -1.\n\nPlenty of parking, close enough to campus, easy access from I-74.","useful":2,"funny":0,"cool":0},
{"review_id":"SFGu0w8vtja9b_EKvVUjtw","user_id":"9KQ-d8GttfWACPgLHZKWQQ","business_id":"Z-graJvcYCSOGWRs3bDzLQ","stars":1,"date":"2017-11-25","text":"This was one of the worst meals I have had in years. The margarita used a sickly sweet sour mix that was undrinkable by anyone who enjoys margaritas. The wings were pathetic -- small and undercooked. The burger was over cooked and had no flavor. The service was consistent with the food. Never again!","useful":0,"funny":0,"cool":0},
{"review_id":"dnoxQzTAQLlSHDRbL0rHhA","user_id":"CSU-gsMYWwPgBfTiLze7Cg","business_id":"5SZe-u0hyquuipQL5lbg_g","stars":5,"date":"2015-01-30","text":"Purchased the coupon on yelp.  We went for dinner about 8pm. The place was pretty empty.  The waitress very friendly, service was excellent.  The food came out very quick and tasted good.  Very surprised it was so empty well it was a Tuesday night.","useful":0,"funny":0,"cool":0},
{"review_id":"iEB8bqGy05YsuQQrLQaO2w","user_id":"cvbwX_TkxxnIU9cYPbFOnA","business_id":"hwe7f0QthkND-H4Ekg37qw","stars":2,"date":"2015-06-28","text":"I was very disappointed with their customer service skills. I ordered by phone the man  I talked was very rude. He made feel like canceling my order, than the man that delivered was worse. The food was good the price is OK. People skills were horrible, so never ordering from them again.","useful":0,"funny":0,"cool":0},
{"review_id":"OGWUK3TwGH7a7DqBdmV3AQ","user_id":"cvbwX_TkxxnIU9cYPbFOnA","business_id":"_aCI9ykQ-PDBcHmBa_QxIw","stars":5,"date":"2016-06-30","text":"I don't why people had bad experience I guess they might have new people working here. Cassie is awesome she took what I wanted n made it more awesome. I was greeted right away the wait wasn't long n the price was good.","useful":0,"funny":0,"cool":0},
{"review_id":"2XNkm7j5VTBhyRqwh-9bcw","user_id":"Fr1bpWeRWyMmqx4XdS4nmQ","business_id":"QyK4roe68JzIxsSwVWKcdA","stars":5,"date":"2014-01-17","text":"Always great service unlike places like Big O Tires . Todd and everyone here is great would definitely recommend for anything!!!!!! I've had smog done oil changed radio installed etc !! Anyways go here!!!","useful":0,"funny":0,"cool":0},
{"review_id":"gekDdxZ2tF2yYBGdGT8zOw","user_id":"Fr1bpWeRWyMmqx4XdS4nmQ","business_id":"OY--Bo-QFgxL4KFZYn0iSg","stars":5,"date":"2014-08-02","text":"First I want to thank Danny for a great fade ! Also my overall experience was that everyone at the shop is very welcoming and nice! I Had a good convo while getting my cut, he used a hot towel and a straight razor to finish the lineup.... \n\nAlso I've all but stopped going to barbershops because of bad experiences in the past... But I will definitely return here! Thanks again !","useful":0,"funny":0,"cool":0},
{"review_id":"pRlV3UZbqjp7tebMEXy2vQ","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"1HnYxHZw2icWQ7-T4AmQ0Q","stars":4,"date":"2017-06-09","text":"My cousin from New York loved the pizza, we agree. It is a bit pricey (family of 5) for some of the options but very reasonable and worth it. Everyone there is very friendly and kind. We have been there 5 times and had a good experience each time.","useful":0,"funny":0,"cool":0},
{"review_id":"ylkw52LxI_CeXU5dkan7Sw","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"moZpwq1hNxC-uJRpfupOTA","stars":5,"date":"2016-10-06","text":"We eat at Carlsbad about once a month. As a family we enjoy just about everything on the menu. The food is always fresh, perfect spice and flavorful. The service is always kind and prompt from our experiences. It's great to have a restaurant of this quality within walking distance!","useful":0,"funny":0,"cool":0},
{"review_id":"ueJZNb0ad8Aux92h8JP5iA","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"D-2t7fHQu6hNLjjfRHSZaA","stars":5,"date":"2017-02-19","text":"Great food! Came for happy hour and split the meatballs, aracinis, evo salad and evo burger. They were all great! The server, also bartender was amazing. She made great recommendations and was very personable. We will be back to try more of the dinner menu.","useful":0,"funny":0,"cool":0},
{"review_id":"xDncJ7XW1-td39z6UjUcMA","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"R1WaNU6vQ6L0YGwr30t0TQ","stars":1,"date":"2016-01-30","text":"Wow.\nAfter being gone over a year I get a call for my appointment next week. Huh? I call the office, wait for 5 minutes on hold, hang up and push the billing button, someone picks up immediately (I guessed billing would answer at this office). The lady in billing was VERY nice I must say and apologized, she said the office schedules a physical every year in advanced for you, how kind. What a great way to make money - my wife got the same call and hasn't been a patient for longer than I. So had we not called to cancel, an appointment we never made we would have been charged a no show fee as indicated in the email I also received today. This is a deceptive practice - I sure hope people stop going there and whoever is running this place reconsiders their money making schemes.","useful":17,"funny":0,"cool":1},
{"review_id":"yEfY2ZYXAyRZE63dbR_xJA","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"gOOc6MDdhw7fV0Tf30mfAQ","stars":5,"date":"2017-06-30","text":"Gritz is the best for classic soul food and great service. I went with the BLT the last time and loved it. Thank you to the owners and workers for making such fine food and building a great culture!","useful":0,"funny":0,"cool":0},
{"review_id":"3A5qOhQOj2zHWMYgWtkkGQ","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":5,"date":"2015-02-08","text":"Excellent food! The burgers are fresh and inventive. The beer offerings are substantial. The bartenders and wait staff and patient informative and generally up beat.","useful":0,"funny":0,"cool":0},
{"review_id":"Kw8FIhiicLEArpWbGiW5Dg","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"1Gg8nehKawegUHIfNihgAw","stars":5,"date":"2014-08-16","text":"We have been to 4 different swim schools and this is by far the best. From the front desk to the swim instructors everyone is professional and courteous. The program actually teaches them to swim not just float! Highly recommended. We have a 6 year old and 2 year old here.","useful":1,"funny":0,"cool":0},
{"review_id":"39SJd8P3NcfHEgxsjZT7ug","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"_HboH55t0MnGVaDxzuogdQ","stars":2,"date":"2017-06-09","text":"I feel like this location has gone down hill in terms of quality of food and staff. We used to use them for catering regularly but have not as much recently. They have a good menu but it's become so diverse that it is hit or miss.","useful":1,"funny":0,"cool":0},
{"review_id":"WB1tsVkB90ayVo2Zvh_YAA","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"288lAybD6oJD4Nwow1R7wA","stars":5,"date":"2015-12-08","text":"Paul, Max, Tony and others the quintessential barber shop. Great haircuts, hilarious and enjoyable conversations. I have been going to Paul for about 12 years now, I travel 45 minutes for the haircut and experience. All these guys are great! Friendly, professional and if you ask the right questions you get the barbers philosophy of life!","useful":0,"funny":0,"cool":0},
{"review_id":"N4iO3aRrpnKL1-7_W_RM-Q","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"DkZuVzYuylBanEsWK7mNGw","stars":5,"date":"2015-02-08","text":"I was shocked. An unassuming, small sushi place with some of the better, fresh, inventive sushi I have tried.","useful":0,"funny":0,"cool":0},
{"review_id":"oIJ-DOAhItaKrIGUztIkQA","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"ewmTwsZqCHH2gvCeDKz0dw","stars":5,"date":"2016-06-30","text":"I stopped in early Tuesday about 11. The two people helping out were more than generous with their time and encouraging me to try the selections. After trying 8 or so selections I went with the most popular, however each one brought a burst of flavor and would have been great. I ate my lunch in the car too excited to wait along with the salad. The customer service was so kind and the food was so great there is nothing to offer but five stars!","useful":0,"funny":0,"cool":0},
{"review_id":"HJNJjkyzG4x7LG3cmkYy9A","user_id":"OIntvwVVS4IT1Pm4eO0ERA","business_id":"BMq-yAsayMszw_5UWdhDzQ","stars":5,"date":"2014-08-27","text":"Lynn was the third person I called, after quotes of 1500 and one nut job who said 5000 Lynn calmly explained the problem and had to replace one part for a nominal fee. He also showed me how to repair the evap cooler and make adjustments. I am see why others rated him so highly. He is great with his customer service and knows his stuff. He will be my first call from now on.","useful":0,"funny":0,"cool":0},
{"review_id":"xJlFewaJhHhDYTxNhV_PLA","user_id":"GJLb5S8-0AraJv_zeMWniw","business_id":"Q2NB19e8PMKA0fCLlRBlEg","stars":1,"date":"2014-12-16","text":"Welcome to Toronto airport.   There are big signs that say \"Rental\nCars.\"  We follow the arrows and walk and walk and walk some more to a\nfaraway hall.  But the rental company  (address: Toronto airport) that\nwe booked with, Economy, is not represented there.\n\nWe are told to return to the terminal and find a train to \"off-site\nrental car companies\".  It's hard to find the train but eventually we\nboard and travel to an outdoor area where we are told to wait for a\nshuttle.\n\nEventually 15 to 20 other people join us as we wait in the hot summer\nsun for more than fifteen minutes.\n\nOur shuttle van arrives, but it is so small (or has taken so long to\narrive) that there isn't enough room for the people waiting.  We wait\nanother fifteen or twenty minutes for the next shuttle.  Then there is\na ten-minute drive to the so-called \"airport\" car rental company.\n\nThe line is long and the service frustratingly incompetent.  When we\nask how to get to our destination, they say they have no maps\navailable for customers.  It takes one or two more enquiries before\nsomeone grudgingly goes off to find a page that gives directions to\nvarious areas.\n\nThere is no page giving directions back to the rental place. It's near\nthe airport, he says.  When we finally get our rental car and drive\noff, it is nearly 2 hours since our flight arrived.\n\nReturning the rental car a few days later, we are greeted with the\nsame surly service, but this time they tell us there's a scratch on\nthe car.  We say we know there's a scratch because it was there when\ntheir own employee checked the car before we drove off.  They say but\nthere's nothing on your form.  They find the man who checked the car\noriginally but he looks at the form and says it doesn't say anything\nabout scratches so they will have to get an estimate for repairs. This\nhas all taken a very long time so we say we will have to continue the\ndispute long distance.  They give us the form to sign but there is\nalready a drivers signature at the end.\n\nWho signed here?  You did. But it's not my signature. Oh well, just\nsign next to it.  Now hold on a moment, something is wrong.  Why does\nit have the wrong signature?\n\nFive mins later he admits they were working on the wrong form, for a\ncar that looks like the one we rented.  No wonder there is no record\nof scratches.\n\nThe correct form is missing so they draw up a completely new one and\nsay we won't have to pay for the scratches. We sign.\n\nBy now we've lost all confidence, so we check the total more closely.\nWhy is there a daily amount for insurance? Because you didn't email us\nproof from your insurance company that you have insurance.\n\nI know I did because I remember thinking I had never been asked to go\nto that trouble before. Well, we never received it.\n\nEventually he checks on his computer and finds our email and removes\nthe charge.\n\nWe are dismissed and by now there's no more space on the departing\nshuttle so we'd have to wait for the next one.\n\nExcuse me, something is still missing.  Yes?   An apology. Oh. I apologize.\n\nWell I think the least you owe me is a car ride to the airport.   He\ncalls his driver and tells him to take us - not to the airport but to\nthe train station.\n\nThat's the story of our experience with Economy car rentals, \"at\"\nToronto airport.","useful":5,"funny":2,"cool":0},
{"review_id":"OHyMbLYPp_Ikdnhdw7iUPg","user_id":"iSKPRblbu5RNtV5-WU1j0g","business_id":"7ABOYoF6DeUnX-jTYH14wA","stars":1,"date":"2014-11-14","text":"Hello I came in a few weeks ago and id have to say the food here is fantastic, although the service is not. My servers were great but the hostess was so rude I did not want to come back. I got her name . Kayla or something like that. She was very disrespectful by not allowing me to sit where I felt was a good spot for my family. Then she decided to yell when I asked for a table instead of a booth. My experience with her makes me not want to come back at all.","useful":0,"funny":0,"cool":0},
{"review_id":"9o3YA1fzo7vhP7O8sEFf2Q","user_id":"MtCJD3i5X5SFRDQ70ktSjg","business_id":"0XoTT540HMB_5q4Exj8yGA","stars":1,"date":"2014-08-03","text":"I've stayed here many times over the years and the Four Seasons has always been my first choice, but the number of dogs on the property has seriously gotten out of control. On my recent stay I could almost literally not get on the elevator without someone's little yapper trying to bite my ankles, and I almost never walked down the main hall to the lobby without one or more dogs being walked in the hallway. It takes the ambience from elegant to trailer park in a hurry. Fortunately there are no shortage of 5-star hotels in Las Vegas to choose from.","useful":1,"funny":3,"cool":0},
{"review_id":"UZzaYM_jFfbxZqRD8lcZnQ","user_id":"_cC6OKF6CrNYulVDYiRWcQ","business_id":"7a9Z2AFYvN_yeSBvtIzeQQ","stars":1,"date":"2015-02-15","text":"Do not stay here\nI am in town for the marathon and apparently there are some youth sports events where the kids have no adult leadership \nThey were running up and the halls up to 2 am \nI asked the management could I move rooms so that I could sleep.and was.told that they would offer ear plugs \nI was beyond shocked! !!!!!!!\nI asked for quiet area.when I checked in and the clerk must have though I wanted the party zone\nI am a rewards member and refuse to ever stay at another Courtyard\nWhen I check out in a couple hours I will tell the person at the desk but expect to get a robotic answer\nThere are so many other options pick somewhere else","useful":3,"funny":0,"cool":0},
{"review_id":"vO_leW3GodmQrQ0kumo45w","user_id":"3pc5iu-WWL_Irm5fP3S8vA","business_id":"umYIc-FJg-3tsqoVaM-Mnw","stars":5,"date":"2017-11-24","text":"I had the Vegan Thanksgiving dinner... I couldn't have been happier! Tofurkey with stuffing and cranberry sauce, delicious mashed potatoes and mushroom gravy, garlic Brussel sprouts, sweet potato soup and pumpkin pie. I got to go, but the place is cute, the owner\/chef is clearly producing quality food at really good prices, vegan and veggie friendly, I LOVE THIS PLACE! I'll be coming here regularly from now on!","useful":1,"funny":0,"cool":0},
{"review_id":"mKS6piVL6vloa8_70hEHkg","user_id":"_ck1w83-yHVN-XBXdFvWAQ","business_id":"cy3Or8iSsDOmHBBu2MwnOg","stars":4,"date":"2014-07-27","text":"Good ambience, food and service. Vegetarian menu was good but limited though. I will return...","useful":0,"funny":0,"cool":0},
{"review_id":"9fGamIkE46oYdP26TMDnmA","user_id":"GIBdER9AKYlIBaq254tVWg","business_id":"b5bkY8fj3Q8LL2jdMFDUBg","stars":5,"date":"2015-04-09","text":"Have been here 10+ times & have no complaints. The frappes are awesome. Also enjoy the iced caramel machiatto & hot peppermint mocha. The girls are fantastic & always make u try your drink in front of them to make sure it's perfect. I love just sitting under the umbrella listening to the music while enjoying my beverage & the view.","useful":0,"funny":0,"cool":0},
{"review_id":"ZUO6_N5ZVYi-fnQhbFAsbQ","user_id":"GIBdER9AKYlIBaq254tVWg","business_id":"P4Boq_0dNnQHYGLYQ5o-og","stars":5,"date":"2015-03-08","text":"This place rocks! Nice intimate setting with a great menu, but most important is that you will laugh till it hurts. Great groups of comedians every night. The owner is great & his support staff are fantastic. If you like to have a good time & laugh like crazy, get yourself down here.","useful":0,"funny":0,"cool":0},
{"review_id":"Lk_X6RRonq7E--9BjylCUQ","user_id":"6bV-WPOA2w_Q1_78KZ05aA","business_id":"gDj8LnU4BX-CUSBeMIE3hw","stars":1,"date":"2016-09-15","text":"I come here to get my cars service from time to time with oil changes, this time everything was good until I got my truck back. My apple charger was missing out my car, I was just charging my phone because it was low battery before I gave them my truck, & that's the first thing I was headed to when I got my truck back.  I asked to speak to management the guy in a red shirt came to me and I told him I situation that my charger was missing and his response was \"nobody carries an iPhone here \"and I just told him I didn't even have time to deal with the stuff because I'm in a rush but I will never come back to this location ever ever again or will get my money to a Firestone again because of this","useful":0,"funny":0,"cool":0},
{"review_id":"W3tV8skx7xfyZFGmicmbSQ","user_id":"lyY_7JQ42vnL1orEHcPvtw","business_id":"QwK-S59WOc1n_BVjHiBu3Q","stars":4,"date":"2014-08-02","text":"Excellent Resto...Pad Tha poulet super Apport votre vin Personnel sympa.Rservation pour le samedi \n2 services 17.30 hres et 19.30 hres","useful":0,"funny":0,"cool":0},
{"review_id":"f1QJqK36VBHpKL6z-RdoEw","user_id":"jrFenaBc9XdQoV-iBOdyeA","business_id":"bFkMPiGMkYnIdbI8KrRoHA","stars":5,"date":"2014-07-04","text":"This place has everything you need for a Middle Eastern meal. They also have a small restaurant if you don't feel like cooking tonight you could always do takeout. The selection is great and the people are very knowledgeable about Middle Eastern products and if you don't see something u need they will order it for you.","useful":0,"funny":0,"cool":0},
{"review_id":"hSoo7kD8-Bf9wgdI6VbTFA","user_id":"jrFenaBc9XdQoV-iBOdyeA","business_id":"gO_z_5FQVHLCiJjOsfE1fg","stars":5,"date":"2015-07-02","text":"We decided to come to this restaurant to celebrate a friends birthday. You could really tell it was a great establishment as soon as you walked in.\nFirst of all the customer service was impeccable amazing great can't ask for anything better they were always on point. Then the food came out and it was to die for and your plate was full can you just wanted more because it was so good. Wait there's more don't forget about the sides wow they are amazing and you got everything you wanted and if you wanted more you got more.\nAll I can say is the food was terrific the service was impeccable the restaurant was nice and clean. the restroom was kept very spotless and the dessert was amazing we had a fabulous time and we will be back.","useful":1,"funny":0,"cool":1},
{"review_id":"LLOgf0zkJp-bqeUyq3qodw","user_id":"jrFenaBc9XdQoV-iBOdyeA","business_id":"nHQtk-oJVNvVpvfFslv9Ug","stars":4,"date":"2014-07-04","text":"A fun place to just hang out with friends.  Great cheesy fries. They also have a great selection of chicken wing sauces.","useful":0,"funny":0,"cool":3},
{"review_id":"R8kaMmuIXoxxKoaGtIiYtA","user_id":"jrFenaBc9XdQoV-iBOdyeA","business_id":"s19MqjZcquoj4h5-8m5C5w","stars":5,"date":"2014-07-10","text":"Seriously the best Starbucks in town the people here are great you're drink always comes out perfectly the other great thing is that they remember you and so you don't have to repeat your drink every single day which is such a plus. Thanks for always making me smile through the drive thru you guys are the best","useful":0,"funny":0,"cool":0},
{"review_id":"3ofEPdlU82moSmwTw-1U8w","user_id":"jrFenaBc9XdQoV-iBOdyeA","business_id":"kRgAf6j2y1eR0wOFdzFAuw","stars":4,"date":"2014-07-09","text":"What a great fun place to come with anyone. The food is excellent I definitely have tried almost all the things on the menu. The vegetarian selection is pretty good and don't forget about those drinks the white sangria is definitely my favorite. Fun place love the atmosphere great location.","useful":0,"funny":0,"cool":0},
{"review_id":"4sZ0B7wf0dJc1wa-GTSiIA","user_id":"KOCvyILJBKXIqaEgHm3WVw","business_id":"glTBzDHv9wNhEsZa4bQrOA","stars":5,"date":"2008-08-07","text":"It's like I died and went to heaven.  I went with 2 of my friends this past Monday, which just so happened to be industry night, and we got bottle service.  Our table was right on the dance floor and random people kept sitting down next to us.  Now I'm not trying to sound like an ass, but we did drop quite a bit of cash so yeah I'm not a real big fan of some random sweaty guy basically sitting on my lap. \n\nThe staff was cool, from the VIP host to the bouncers that kicked the mentioned sweaty douchebags out of our seats.  The waitresses are something else.  Definitely a place for the guys to go if you want to see gorgeous girls in lingerie pouring you drinks.  \n\nWe got there around 10:45 and at about 11:30 we got a surprise you can't even pay for.  25 strippers from Spearmint Rhino were seated next to us.  Now I know some of you girls just aren't understanding how lucky we were.  That's like hitting the jackpot of VIP for us guys.  What's even better is that they had their own booze so they didn't even bug us for ours.\n\nI kind of blacked out after we drank two thirds of our bottle of Grey Goose so the rest of the night is kind of sketchy,  There were a decent amount of good looking girls and some guys too, for you ladies.  \n\nWe closed the place down at around 4, but to be totally honest with you I have no clue how many people were still there because that part of the night is a blur.  I think our bill was around $600, but it's Vegas right?  I wouldn't hesitate a second to do it again.","useful":0,"funny":0,"cool":0},
{"review_id":"-kQJSy-rVaLUTZlU_y6Kng","user_id":"KOCvyILJBKXIqaEgHm3WVw","business_id":"ppmYIHMCIL5bocUsJSsDWA","stars":5,"date":"2008-08-07","text":"I went there for dinner on a Tuesday night and it was about half full.  Had no problem getting a table and was ok with us being just casually dressed.  From looking at the place I figured it was just a middle of the road Italian place where we could get a halfway decent pizza and a pasta dish that didn't make me want to vomit.\n\nTo my surprise the food was exceptional.  Our waiter was very accomodating and suggested some specials,which I took advantage of and ordered a dish which I think was called Chicken Arigosta.  It was chicken breast wrapped in lobster with a lobster sauce and vegtables.  I tried a piece of their pizza which was excellent as well.\n\nEverything was reasonably priced, the service was great, and the food was fantastic.","useful":2,"funny":0,"cool":0},
{"review_id":"MSuYiNCTfFG7a3HN-KkS_g","user_id":"KOCvyILJBKXIqaEgHm3WVw","business_id":"V9klA6JGT6Fz2UpVP_7sBw","stars":3,"date":"2008-08-13","text":"I went there for breakfast even though I knew I wasn't going to be able to chow down like I would at a normal buffet, because I was still redicuously stuffed from the night before.  The omlet station was great as is with most breakfast buffets.  They had a wide assortment of breakfast items, nothing really out of the norm.  All the food I had tasted fresh and not like some places where you can tell it has been sitting under the lamps forever.","useful":1,"funny":0,"cool":1},
{"review_id":"lJa0oeFDwx1KwPnJgSCu5A","user_id":"KOCvyILJBKXIqaEgHm3WVw","business_id":"x_yLsQMQtlE0rdxnaf6J5w","stars":5,"date":"2008-07-27","text":"By far the best way to get shitty drunk without having your throat and insides burn.  A must on any trip to Vegas.  I have the 100 oz. cup that I'm sure to only make it halfway through before passing out on the sidewalk, but you better bet your ass I'm willing to pay to get it filled because its just too damn good.","useful":1,"funny":0,"cool":1},
{"review_id":"EChsW9Ltr88MqDhtfg1Erg","user_id":"KOCvyILJBKXIqaEgHm3WVw","business_id":"fWEfX14W2_7GDOJBSQQU9Q","stars":2,"date":"2008-08-07","text":"I had lunch there and was really impressed.  I had the Tempura Udon which was alright, but nothing to get excited about.  The caterpillar roll was very good, but not enough to save the entire experience","useful":0,"funny":0,"cool":0},
{"review_id":"RFJBSVYDL6IIPdZ2NqSGpA","user_id":"aS9HSmMcHfjx_bHWfdhJvg","business_id":"fDCFe_I0l0c-11ERiwUoAA","stars":5,"date":"2016-04-15","text":"Une belle dcouverte! \nDes saveurs vietnamiennes authentique servi avec le sourire.\nDe plus ici ils ne servent aucun animaux morts. Les vgtariens et vgtariens seront bien servi... les carnivores seront confondues. La nourriture est si succulente que l'on n'oublie qu'ils ne servent aucune chair animale dans leur restaurants.\nBravo enfin saveurs et service sont au rendez vous pour des mets vietnamiens sant!","useful":0,"funny":0,"cool":0},
{"review_id":"p0LRosOXuLcWUs1ncjbytA","user_id":"aS9HSmMcHfjx_bHWfdhJvg","business_id":"-GOpxpQbDcfioE-vQ55h6A","stars":5,"date":"2016-04-20","text":"Authenticit, ambiance parfaite (on se croirai en Italie) et service impeccable.\n\nLe prix reflte la qualit de l'exprience.","useful":0,"funny":0,"cool":0},
{"review_id":"dwb_6sfw5GqvfTyBTIv0Ug","user_id":"aS9HSmMcHfjx_bHWfdhJvg","business_id":"vMfmOWnrt-VUNsspiBEtdQ","stars":5,"date":"2017-06-06","text":"Ordering on Foodora regularly. Vietnamese Sandwich are delicious. They use French bread instead of the cheap foamy bread. The bubble tea is much healthier than what you drink normally. They don't use cheap cofeemate. The cheese cake is amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"VW6wtWyUL8kNzHuvUovNVw","user_id":"ZcgB_GQoMVuQaSVRY3yKMA","business_id":"Ulg7UlGE-BmZ0IHxqQb0ew","stars":5,"date":"2017-03-10","text":"Andrew was very friendly and professional. I  have been using Ecoshield for over 2 years with no problems. I  would definitely recommend them.","useful":1,"funny":0,"cool":0},
{"review_id":"sTwRZV-xIkUWRvfXAEY4RQ","user_id":"6-xnd1NGC8I2jxDqeyVBmg","business_id":"2IBupUvfmmPBrUupMuBETA","stars":5,"date":"2013-02-21","text":"My wife and I go there regularity with and without friends for a fast and reasonably priced good quality dinner.\n\nThe broasted chicken ( yes, broasted) is a must try if you have never had it before. \nTaco Tuesday - Fish Tacos are amazing \nThe dinner salad is great. Lots of stuff in it.  \n\n\nEverything is fairly priced, good size portions. Friendly staff.\nI gave it 5 stars because it is just what it is.\n\nA nice, casual place to have dinner when you don't want to cook at home.\nTry it - it'll surprise you","useful":1,"funny":0,"cool":2},
{"review_id":"0OcCaO4R2GkIZFGy7whqHQ","user_id":"6-xnd1NGC8I2jxDqeyVBmg","business_id":"WqL96qA0l3ewibg8j1U-0A","stars":5,"date":"2014-08-09","text":"This is the place for the best hot dogs ever - once you try them you will be hooked and be an instant repeat customer - friendly staff - hometown feel and great food mmmm!\n\nTry the Salsa its so amazing and truly an award winner - so glad my wife found this place I will be there often.","useful":2,"funny":0,"cool":0},
{"review_id":"OPPrxXGQzFaSnHPyKZ5tPw","user_id":"6-xnd1NGC8I2jxDqeyVBmg","business_id":"hoiMOXY9hF3KKxVpF5dRsA","stars":5,"date":"2013-02-21","text":"Good burgers.  Good beer selection.  A great happy hour that goes to 7.  What more do you need?\n\nI love the burgers.  They're pretty cheap, cooked right, and served with a choice of wonderfully greasy onion rings, fries, sweet potato chips, half and half of any two, or a salad.","useful":1,"funny":0,"cool":0},
{"review_id":"GQUx6WbR7G564-VIwb3gfQ","user_id":"FZK_4SgdJRSgaO-dS4fjYg","business_id":"CD6BcyB4MfdROfa5dYQzug","stars":5,"date":"2014-07-10","text":"A honest mechanic. Enough said? Not quite, they explain every single thing and how they arrived to that point. I brought my truck in at 830pm, Scott was still at the shop busting his ass. He had a lot full of cars and projects but still took me. Had my truck figured out and back to be in no time. He pointed out mistakes from other mechanics that took advantage of me and offered simple solutions that I could explore. Im moving but will leave my truck with them and ship it when hes done. THAT is how much I recommend them.","useful":1,"funny":0,"cool":0},
{"review_id":"4t_2C3DA25jn7-sRugYRkQ","user_id":"MQO_G0mmxMM9lpe904AW_w","business_id":"dNHDXn2ot4mFc2YfIFBNhQ","stars":1,"date":"2017-04-07","text":"Pizza was soggy and the salad had so much dressing it was too difficult to eat. Service was great though. Don't think I will try again.","useful":0,"funny":0,"cool":0},
{"review_id":"kaYKLC2phtOQ0xw1pxjXHQ","user_id":"khfnTx39pWf7cEJBuAEWJg","business_id":"6lTFHgPIaBCgsUsdJmWfKA","stars":5,"date":"2017-09-23","text":"I highly recommend Justin! He helped me take care of the traffic tickets. He is very thorough and attentive. You will not regret choosing him to represent you","useful":0,"funny":0,"cool":0},
{"review_id":"51Y3Om5tycZEN5xksjNvtg","user_id":"khfnTx39pWf7cEJBuAEWJg","business_id":"poYsvuOmVDqF4dTnjJ780A","stars":5,"date":"2017-09-30","text":"First time here and can't wait til I get my order!!!! Soo excited so far iced pistachio latte is bomb","useful":0,"funny":0,"cool":0},
{"review_id":"wWZolaFumDQ1lj0ab5h2LA","user_id":"khfnTx39pWf7cEJBuAEWJg","business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","stars":1,"date":"2016-08-11","text":"I went there for dinner tonight and had a most annoying experience ever. They greeted us so I told the worker 2 adults and 3 kids. I need 2 high chairs and room for a stroller. Then a girl took us to a big table which was perfect. She brought us 2 high chairs and kids were all seated and we got everything situated then they told us we needed to move because they thought there was more people. That place wasn't even that busy. I was annoyed but just swallowed and got all the kids and went to a different table. It was a same size table that they sat us! So we were trying to get situated again and someone came and told us to move to a smaller table. I was annoyed AF and the girl saying I thought more people.. WTF do they not understand English or just plain stupid? I was so pissed we decided to leave. They didn't apologize or anything. If you're stupid then that's fine with me but don't be wasting my time and energy. Definitely not going back there.","useful":0,"funny":0,"cool":0},
{"review_id":"48JM_fvaTePxxE94cDCtAQ","user_id":"khfnTx39pWf7cEJBuAEWJg","business_id":"mlOFd0pHDcav5hcnbKJiXQ","stars":5,"date":"2017-08-13","text":"Food was fresh & so delightful! I walked in on them when they were closing and they fed this hungry prego woman! Lol I had a salmon bowl and it was sooo delish! I wanna try everything they have on their menu!!","useful":0,"funny":0,"cool":0},
{"review_id":"fEulVAk0alk1s27wDoe1Hw","user_id":"khfnTx39pWf7cEJBuAEWJg","business_id":"VxgcsDtepWkjBd7aayreRQ","stars":5,"date":"2017-06-05","text":"Keith is amazing! We were in a complicated situation and he made our loan process so easy and helped us to get what we needed to purchase a beautiful home for our growing family! I am ever so thankful that my realtor recommended Keith to us! You will not regret choosing Keith as your loan officer!! He is very kind & diligent. Thanks Keith!!!","useful":0,"funny":0,"cool":0},
{"review_id":"FkJQPKN6U6EEbz-QFIglng","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"6s4CsZHJDFiCHwTfumsvwA","stars":5,"date":"2015-10-09","text":"Roberts Catering is amazing! I was married last weekend and hired Roberts. \n\nI was referred to Roberts from Davids Bridal for the cake but ended up hiring them to cater the entire reception. It was a small reception in our backyard for 25 people but it felt like fine dining! The staff of two phenomenal ladies set up the buffet beautifully!! They spoiled us from the start and made sure we were taken care of. They conversed with guests and made everyone feel welcome. \n\nThe food was so good from the stuffed mushrooms and meatballs to the carved beef and hunters chicken. \n\nI can see why some of the comments were made about Wendy because they don't realize how much she knows! Once you understand that she speaks from experience and wants to make your day special you know you are in good hands! She told us from the beginning that we wouldn't have to worry about a thing and we didn't. Trust Wendy she knows what she is doing.\n\nNow for the best part... the cake was amazing! We went to a tasting and were sold from first bite. Our wedding cake was even better. It looked just like I wanted and tasted amazing. \n\nYou will not disappointed with Roberts. I will definitely use them again. My wedding was amazing and beautiful and Roberts had a huge part of that!","useful":1,"funny":2,"cool":0},
{"review_id":"omeQimRm-Q4g9KXwwnW8eg","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"0pLsjHsWD93PGa7wr0XhCw","stars":5,"date":"2015-12-29","text":"Wow! So impressed that Alex came at 8:00pm to replace our water valves. We recently moved in a house and have been a week without a washer and dryer. They get delivered and installed only to find the valves are leaking and need to be replaced. Alexanders plumbing was able to squeeze us in at the end of the night to fix them. \n\nOn top of all that, the work was impeccable and did not required any patching. Most plumbers leave a mess but he made it look even better. \n\nDo not hesitate to give Alex a call! Awesome! Thank you!\n\nFYI -  prices were on par with other quotes.","useful":1,"funny":0,"cool":0},
{"review_id":"gkPqwsTu-NM_awJslbZVhw","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"ZIGLsDPyC-46eBhNxToVYA","stars":1,"date":"2016-02-20","text":"I literally just walked out of that store and will never go back. I am new to shooting and want to get a gun for my personal protection. I walked in with my husband and no one said a word. We were looking to purchase a Sig and received no attention. I understand that they may be busy but it takes a second to say \"I'll be right with you\" or even \"hello\". Very rude and undeserving of my business.","useful":3,"funny":0,"cool":0},
{"review_id":"QajeU86xGWVT_5qpg9oodQ","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"JlNeaOymdVbE6_bubqjohg","stars":5,"date":"2015-01-20","text":"Love the breakfast burritos! Gone twice now and they are consistent. Very affordable too! Great customer service and very clean. Definitely recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"SEbDSImvbyGiUMMeab5KCg","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"0TBNrNffoblAj7qG72387A","stars":5,"date":"2014-03-16","text":"Krystina is amazing! Thank you for doing such a great job.","useful":1,"funny":1,"cool":1},
{"review_id":"zJ293Mp0TsfGhwcK58PtTQ","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"p-9tfaYQrfz0FlvsOVDVUA","stars":5,"date":"2016-05-14","text":"Just left the range and have to give kudos to Andrew. He was the range master while my husband and I were shooting and he is awesome! He gave us tips on our grip and aim that helped immensely! Thanks Andrew!","useful":0,"funny":0,"cool":0},
{"review_id":"ZGXy4tjK45NO5rinjiutUw","user_id":"7Lx10Xd2HvMLBqH-5HVyXQ","business_id":"g-I48SaHtdIGR5ZEoVeNFw","stars":4,"date":"2014-10-16","text":"I have been here multiple times although mostly for takeout. The rolls are awesome.\n\nNever have to wait long for my order.\n\nI like that they have gluten free soy sauce but the price per packet seems a little high. \n\nGood quality food and portions.","useful":0,"funny":0,"cool":0},
{"review_id":"QgaFwnF9lh2GvclXf2JK-A","user_id":"riwwnsnaKEtejGxamX-Clg","business_id":"lRg7jfcYXAciGmDSNKFJBA","stars":1,"date":"2017-02-08","text":"Just called this morning to find out about a TB test needed for employment. They aked if I had insurance for which I explained that my primary care doctor does not have any openings until April. From that point I was told it would be about $360 dollars for the visit and $50 dollars for the shot, for a one step TB. The cost for a two step TB  would be $100 dollars. I was told that I could fill out a hardship form, and that would take the office visit down to $100. No thank you.\n\nI was floored at how inflated their price grew. Just a little less than Than a year and a half ago, I went there for a TB shot and only paid about $50 for the shot.\n\nAdvanced Urgent please don't take advantage of people because they need assistance.","useful":5,"funny":0,"cool":0},
{"review_id":"lBMKWCAIy3nie7Ur-4v4Ig","user_id":"U1QFmh70IdlJYrNpISEGXA","business_id":"WuhUKJAoby57lLjVLpQVPw","stars":5,"date":"2016-06-04","text":"This is the best barbecue I have had in Las Vegas. The meat falls off the bone. The sauces are all homemade. It's located inside Cactus Jack's on Maryland Parkway. Highly recommend Yugo","useful":0,"funny":0,"cool":0},
{"review_id":"TVaW1fRUU3ofMqr2q_mXtQ","user_id":"HyxBXd4_JKeMFRmkPs17zg","business_id":"JcTIqoWO83FfEI9PJJHMfw","stars":4,"date":"2015-01-14","text":"American Shooters is a great place to purchase firearms, ammo, and buy miscellaneous merchandise like belts, shirts and what not. I love shopping here, and they always help me with my purchases the best they can. The employees at the Gun counter and merchandising are awesome! The employees at the range part of the store are terrible with customers and customer service. Whether on the phone or in the range, the shooting range employees in American Shooters should learn to be strict but not insulting to the guests who want to experience the Las Vegas machine gun gimmick.","useful":0,"funny":0,"cool":0},
{"review_id":"OCsmQrm0ThqWf1e24aUgug","user_id":"HyxBXd4_JKeMFRmkPs17zg","business_id":"4CCqCNJir8DN8C2vNwJ_kA","stars":1,"date":"2016-05-31","text":"I gave Gun Mountain another try after getting a response from the owner. I gave it some thought and said to myself that I would delete my past review if things get better. NOPE!!! Walked in and was ignored. I had a question, but the person behind the counter seemed irritated at me. Even when asked to see a rifle, he inhaled strongly while rolling his eyes upward while getting the rifle. He took his sweet time checking the gun to make sure it was safe but gave me a that look as if I was not worthy of handling an AK-47. I politely said \"thank you sir\" and his response was a \"pffft..\" while looking at his coworker.\n\nI am very disgusted at this store's customer service reputation. It seems like I'm not the only one disappointed with the people who work here. There are many more gun stores in Las Vegas and Henderson that deserve my money and will welcome my business. DO NOT SHOP AT GUN MOUNTAIN!!!!!!","useful":6,"funny":0,"cool":0},
{"review_id":"WXF0wLUS-ACfrsAnqunOLg","user_id":"HyxBXd4_JKeMFRmkPs17zg","business_id":"wKA2y-F_fPcBDOkpzDB9eQ","stars":5,"date":"2015-01-14","text":"I frequent here all the time! I love the atmosphere, the music, the service, the cerveza, and most of all... the Food! Have you heard their \"Happy Birthdays\"? That's the best Happy Birthday celebration you'll ever hear in a restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"OcxDtzRHqLFlq5cAoJ76qQ","user_id":"HyxBXd4_JKeMFRmkPs17zg","business_id":"W0vJniiB1m_mOos2EcMj0A","stars":4,"date":"2016-05-31","text":"Great work on all my windows. They came in at 7am and finished at 1pm with all the windows protected by 12mil thick security film. Although, there was some damage when they removed my blinds and put it back. A couple blinds had broken pieces laying around that I did not notice until they were gone. Also, some of the windows have bubbles in them due to debris. But overall great service. Thanks Las Vegas Window Tinting!","useful":1,"funny":0,"cool":0},
{"review_id":"lOtnO-MgJkwPp5eEHjAT1Q","user_id":"moKrBTGa7BQfIkOf6wqCnw","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":1,"date":"2015-08-09","text":"Got the 'HH Meatloaf Pasta' and the meatloaf was so dry it was inedible. The sun dried tomatoes completely overwhelmed the pasta and felt like there were more tomatoes than pasta. Although the portion sizes were huge compared to most restaurants.","useful":1,"funny":1,"cool":0},
{"review_id":"VB-1LyRr2E-uGgcA5w3bvw","user_id":"NgpQ4ETFY2tJPop7qOBoWQ","business_id":"gdWy-x5KbCbMrwIwI87mMg","stars":5,"date":"2015-01-20","text":"I have dined at many upscale restaurants in Las Vegas but this place is by far the best steakhouse yet!  My brother in law and I shared the Lollipop Ribeye, melted in my mouth.  Everything from the Seafood Tower to the Big Fat Chocolate Cake dessert was so delicious.  I seriously cannot wait to eat there again.","useful":0,"funny":0,"cool":0},
{"review_id":"iJyk6DDtAkOS9RWseOVwEA","user_id":"1TuAUOw-FWn7sy95hZDejA","business_id":"VZQPYoK6l_vo5jwYgabJdQ","stars":2,"date":"2015-04-08","text":"Do not order the hot dog. Not sure what it is made from but you won't like it. Chicken Florentine soup was good","useful":3,"funny":0,"cool":0},
{"review_id":"a2prXlF7b-nlkgZ0ONgGGg","user_id":"nEFG1Z8Lj4hcKwfIsp8vrQ","business_id":"2weQS-RnoOBhb1KsHKyoSQ","stars":4,"date":"2012-11-04","text":"I've been to buffets at other casinos, but this is the best by far! Lots of fresh seafood, great carving stations, however I was not a fan of the way the prime rib was seasoned, and great desserts!","useful":0,"funny":0,"cool":0},
{"review_id":"5IR5rjDk7FOCCXym_JXByQ","user_id":"nEFG1Z8Lj4hcKwfIsp8vrQ","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":4,"date":"2012-11-04","text":"I don't understand why people have rated this hotel so poorly, it's great! Yes it's 15 years old and some of the furniture is a little worn, but the rooms are large, clean, and very comfortable. The staff was very friendly, housekeeping always asked if we needed anything, and we had a nice time. We had a standard king room in the pyramid, and I liked the fact that it had a large shower instead of a tub\/ shower combo. Who takes baths at hotels anyways, blech! The pools were nice but get crowded quickly, so either go early or later! If you want a cheap place to stay on the strip that's clean stay here!","useful":0,"funny":0,"cool":0},
{"review_id":"lGr8rN5rLOhIApXfYmbx4A","user_id":"nEFG1Z8Lj4hcKwfIsp8vrQ","business_id":"nnDLapJk1z2NJE0-XzwMlQ","stars":4,"date":"2015-06-23","text":"If this place was not in the middle of a casino I would give it 5 stars. Service was wonderful. I recommend one of their dry aged steaks, they are so tender and delicious! Order a side of Brussel Sprouts, my husband say they were the best he has ever had.","useful":1,"funny":0,"cool":1},
{"review_id":"x_1yONPkmLTY0dQpT-I15A","user_id":"nEFG1Z8Lj4hcKwfIsp8vrQ","business_id":"KkmPDIWzvwbBpyqOHT6pcQ","stars":4,"date":"2012-11-04","text":"Rao's is a wonderful place to eat! We started with meatballs for an appetizer, and they did not dissapoint. They were moist an flavorful but not soggy. I got the special which was spinach and ricotta ravioli in a brown sage butter, it was to die for! My husband ordered clam linguini which was also delicious!  The service was great and so was th atmosphere. If you want Italian eat here.","useful":0,"funny":0,"cool":0},
{"review_id":"k1RX4jhxlayIfw2n4xo3eA","user_id":"x7PHKSr2zwWfePmbNrrh6Q","business_id":"V7nossAF0dFj_mSPYj6SSQ","stars":2,"date":"2017-11-12","text":"It is so loud with music blaring and everyone talking. No prices in the drinks menu.  You have to wait for your bill? The wings had been pre cooked then heat up with sauce.  They were just warm.  The salad was wilted. This is our last time here. Food not very good and way to loud.","useful":0,"funny":0,"cool":0},
{"review_id":"dBVQAgsWaegeqTZK6EAn6w","user_id":"x7PHKSr2zwWfePmbNrrh6Q","business_id":"9gBNswG-l0X9DBlYsHPWPQ","stars":1,"date":"2011-06-07","text":"Not worth 250.00. He wore a baseball hat and sang parts if other people's song. Don't waste your money on Garth Brooks.","useful":0,"funny":0,"cool":0},
{"review_id":"xvODfXFjkv7aV8m2HBruOQ","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"XMMLRvV4IMxIGyc4H37LxA","stars":4,"date":"2011-09-02","text":"Excellent humus, good service, enjoyed the fish tacos.","useful":1,"funny":0,"cool":0},
{"review_id":"SJQG1QQs1ReMfcsK4w7cmw","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"HshPHJ-OJ0rpVR-okV55Rg","stars":2,"date":"2011-08-28","text":"I had one sub-par meal there, the meat was not very flavorful, the tortilla nothing near authentic.  Tried it again just to be sure, and the second time it was again sup-par.  \n\nThere is definitely better Mexican food to be had in the Scottsdale\/Phoenix area.","useful":0,"funny":0,"cool":0},
{"review_id":"HsQB76482JcN0YnDFSytTw","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"Qv0OEziLJwyAqcgtrTsA4w","stars":5,"date":"2011-08-28","text":"Authentic Chicago style hot dogs and beef sandwiches.\n\nIf you're a fan of Chicago-style food, you'll like Luke's.","useful":1,"funny":0,"cool":0},
{"review_id":"u_uJ_8MKgqgtlTKZsdxyxw","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"_4Gpn_NIM94D9OFucgfaJQ","stars":2,"date":"2013-06-09","text":"First of all,  this place is much too loud and the seating too proximate for an upscale establishment.   Literally the tables barely have enough room to squeeze between, and since you almost have to yell to converse, you easily hear your neighbors conversations.  \n\nThe seafood tower was excellent with the dry ice presentation and quality\/taste of shrimp, lobster, crab that we had.\n\nSo why two stars?   We ordered an 8oz Kobe medallion filet, and instead were served something resembling a  thin flat iron cut.   The waiter specifically said they had the same steaks as Mastro's Steakhouse, so I figured even though this was Ocean Club, they would be competent in red meat.    They were not.\n\nFor a much better experience at this price point, I would suggest Dominick's across the street.","useful":1,"funny":1,"cool":0},
{"review_id":"D9pnjWHjZNZWe9MsnqZcSA","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"8OeHn9KCbICuRBs_XiDDUA","stars":2,"date":"2011-09-21","text":"Food was OK, tried the BBQ chicken and the brisket.  Both were dry, and the BBQ sauce was average at best.   Only got one biscuit, inspite of  asking for two.  \n\nProbably will not be back.","useful":2,"funny":0,"cool":0},
{"review_id":"KGUjV-xxvIOQPlQ-C6qBEg","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"8-_jXGGDFPFAPB4r1x-81w","stars":1,"date":"2014-08-08","text":"The food was meh....\n\nThe parking is unacceptable, zero self parking....\n\nThe service in the patio was terrible....\n\nWould not go back...","useful":5,"funny":1,"cool":1},
{"review_id":"XX6AVSsj4IaCoKb_YM3XLw","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"ypSAad4wGe3Uh0N6dgVxaw","stars":1,"date":"2015-02-10","text":"Not a fan of this dealership, have heard nothing but bad things.  \n\nHowever, it is the only show in town, if you want a Porsche.\n\nOn our 911, brought it in for annual service.    Then oil light came on.   Brought it in again, \"fixed it\", then again oil light came on.   Brought it in yet again, turns out they had overfilled the engine with oil.    I can maybe understand missing this once, although really should never happen at a dealership.... But twice?","useful":9,"funny":1,"cool":0},
{"review_id":"0VsSgr-3CtEH_GYoaF5dXQ","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"KF8s-rLe4K-RT5DynWpRkQ","stars":5,"date":"2013-05-19","text":"They are under new ownership.\n\nMy experience with new management has been outstanding.  \n\nExcellent service and cleaning.","useful":0,"funny":0,"cool":0},
{"review_id":"2_uJuzyc7bruwT5glZhtxw","user_id":"sqXeHjj3eeEkOq-37pD2qg","business_id":"HxWDCU-kKido3ErM31msGQ","stars":4,"date":"2011-08-13","text":"I had the Tri-fecta, which came with a single waffle, two eggs, and a single sausage link.   \n\nGood breakfast food, served pretty fast.\n\nOnce the food arrived, no one checked back on me.   It was busy, but I still think a server should come by to ask you how everything is and to refill your soda.  I also had to wait a bit after I was done for someone to come by with the check.\n\nBetter service and I would have given it 5 stars, I will try it again.","useful":0,"funny":0,"cool":0},
{"review_id":"Epn6WPIlwXibSSMg7-JkVg","user_id":"2sCexD0h-TWbAnHZFEU-uw","business_id":"xsM4tE7cQxpAcXIWn0AtXA","stars":2,"date":"2013-12-27","text":"My family of four ate dinner at Bink's Scottsdale on 12\/21\/13. We arrived around 5:30 p.m., and although the restaurant was only 1\/3 full, it took awhile for our server to come to our table after we were seated. We ordered a carafe of wine, which at $25, was a little pricey. It shouldn't take long for wine to be poured, but again, for some reason it seemed to take awhile for drinks to be served.  I ordered the grilled octopus appetizer and the sweet onion tart, my husband ordered the arugula salad, on son ordered the baby back ribs appetizer, and our other son ordered the butternut soup. When the appetizers were delivered to the table, the sweet onion tart was missing. I pointed it out and it turns out our server failed to enter it into the system.\n\nThe baby back ribs (4 total for $8), which we all split, were disappointing. The sauce was tasty, but the ribs were tough and had very little meat. In fact, I gave up trying to saw anything off mine. The octopus was the biggest disappointment. It was extremely charred and overcooked to the point that it was nearly as tough as the ribs. The arugula salad and soup were good, according to my sons. When the onion tart ($7) arrived, it was small...probably only three inches in diameter.\n\nThe entrees were extremely small servings for the price paid. I understand that local sourcing of highest quality ingredients can be expensive, but I just don't get how a restaurant can charge $21 for a pork belly entree that is literally a little bigger than perhaps a king size candy bar. Even worse, the pork belly was braised with capers, mushrooms and beans...a very strange combination that didn't work together. \n\nMy 13-year-old son had the duck breast ($22), which was good, but consisted of approximately six to seven bites.\n\nOur total bill without the carafe of wine was $150. Even after ordering appetizers and entrees, we left hungry. This restaurant doesn't live up to the hype and billing that the Binkley name has received.","useful":4,"funny":0,"cool":0},
{"review_id":"bJ9CSEmLP0nUyKcbmJvL5g","user_id":"lAf-BuPap9KgZZQYoP-XDA","business_id":"h3pMMRwqBjMeMtk0_qQzRQ","stars":5,"date":"2017-08-14","text":"My husband and I were looking for some place new to try and we are so happy to have found this little gem. It's a little off the beaten path (Rancho & Craig area), but what a great find! We were there this past Friday night, and although they were busy, we only had to wait about 5 minutes for a table. \n\nWe had the Salmon appetizer with a balsamic demi glaze and it was incredibly flavorful. Then I had the Blackened Salmon (super delicious) and my husband had the Pork Tenderloin for dinner. My husband's pork was a little over done and the owner Sean came over immediately to make him a new one. He was definitely very concerned to do whatever it took to make sure we had a great experience! That level of service from the owner himself and our terrific server is something that is sorely lacking in so many places out there nowadays.\n\nWe enjoyed the ambiance of the restaurant with the decor and white lights, the 3 piece band playing was a nice touch on a Friday night, and great food & wine. We will definitely make this a regular spot from now on and recommend it to all our friends!","useful":0,"funny":0,"cool":0},
{"review_id":"1Z141RqkiFPyIgnwlHL_Wg","user_id":"rJXNioCorOqJnaAsRhTjoQ","business_id":"ZWY2C_B6RSN1xxpCgLeQuA","stars":5,"date":"2013-12-26","text":"Jason recently helped us sell a house in Vegas. He's very responsive and helpful. We live out of town which prevented us from actively getting involved in the repair, remodel, and selling process. Jason helped us find the contractors, collect the bid, follow through the work, updating us every step of the way. He's knowledgeable and trustworthy. Definitely highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"SAEtVVnGN-4HqOPkSHvNcg","user_id":"N60zRkW3IHwqI2E3-odISA","business_id":"NepC5a0mrRAAMkcplX7y4Q","stars":5,"date":"2017-12-01","text":"Bob Casey was GREAT.  My project was a big one where they blew insulation in all interior walls and in the attic space as well.  It was a two day job and the crew was extremely clean, professional, and efficient.  Do not hesitate to go with Casey insulation","useful":1,"funny":0,"cool":0},
{"review_id":"RpHynx_3elfWvhpoAYlhcg","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"Vg4N2DsGrzzoam9jS1L3Wg","stars":5,"date":"2012-03-15","text":"Nothing special by comparison to other gourmet style burgers, but definitely one of the best burgers ever. \n\n+consistency (food tastes the same every time)\n+fast and occasionally entertaining service\n+onion rings (get the effing onion rings)\n+open late\n+very reasonably priced\n----------------------------------------------------------------------------------------------------\nAn institution (this place makes eating in a parking lot on the hood of your car fun).","useful":0,"funny":3,"cool":0},
{"review_id":"vbs4sQWopQTpDsnSuq1iqg","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"HGRPUfppQmMXsfHYdD-AGg","stars":5,"date":"2017-01-12","text":"Me: That was really good chicken.  Like really good. I should give them a favourable Yelp review.\n\nMe to me: You will give them 2 stars. If they get too popular, there will be lineups.","useful":0,"funny":2,"cool":0},
{"review_id":"6frai8PC8WF4LMmpZ_nO0w","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"_DuPG5sSEwZcgfjdndQc4A","stars":4,"date":"2012-03-07","text":"Originally tried at a food stand at Pride and have been meaning to visit the restaurant for a while.\n\n+ delicious, organic meat\n+ well rounded menu (employ different uses, flavours of meatballs)\n+ fast service (aprox 10 mins from ordering to meatballs in hand)\n+ most interesting, colourful side salad I've ever had\n\n- not a bargain\n_____________________________________________________\nOriginal idea and well executed.  A little bit on the pricey side, but the quality is there so I would definitely go back.","useful":0,"funny":0,"cool":0},
{"review_id":"TIRf7YShfFZ44zxlQiCxEA","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"NQBhCRbFKQOfyAY8kRYP8g","stars":5,"date":"2016-03-09","text":"I'm fairly picky when it comes to coffee.... and this coffee was outstanding! Wish I lived in the neighborhood, so that I could make this my go-to coffee place.","useful":0,"funny":0,"cool":0},
{"review_id":"v-huYwRfsN2ygUuAODEvvA","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"2aIgbnGUg8VC0u9iXO-wnQ","stars":5,"date":"2015-04-30","text":"Leaps and bounds better than the average sushi takeout place. Sushi was very fresh and well executed. Portions are not huge, but I would rather quality over quantity anyways. Would definitely eat here again.","useful":0,"funny":0,"cool":0},
{"review_id":"g-gq4mfL5YENXp8j89oLzg","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"-7BCZH437U5FjmNJ26llkg","stars":5,"date":"2012-03-15","text":"Tried this place after a recommendation by a friend and after I noticed the quality and consistency of Pizza Pide on Gerrard went south.\n\n+homemade, from scratch dough and ingredients\n+very friendly and attentive staff \n+mesmerizing video in front of pide maiking process \n--------------------------------------------------------------------------------------------------------\namazing alternative to traditional pizza.","useful":0,"funny":0,"cool":1},
{"review_id":"U_joiTMPa9BjgQjmxKkd4g","user_id":"7fl5XaXZ7br7YGiNT7L9Dw","business_id":"nu-DHeDtxnOW5vYj93dGPQ","stars":2,"date":"2012-03-07","text":"I tried this place because it was one of the only things open at 3am and I had been there several times before during its previous incarnation.\n\n+ milkshakes\n+ interesting menu ideas \n\n- food on the bland side\n- very poor service\n----------------------------------\nPretty good at 3am, but not at any other time of day.","useful":0,"funny":0,"cool":0},
{"review_id":"4mzahE5mJZTVA4stuDIVfg","user_id":"mkdq4bTfxadzsvXEVIj_4w","business_id":"4abebltNgtm_-nN4NksJTA","stars":5,"date":"2017-09-13","text":"Thank you, thank you!  I had a small job to move 2 furniture pieces over a 50 mile distance and never once did Travis hesitate about stepping up to help me out.  He and his fellow co-workers were professional, friendly and worked quickly. Travis was sure to respond to any of my questions quickly and kept me up to date on all details. I will keep them in mind for any future moves not only because they did a terrific job, but also because they were very reasonable and priced within my budget. Thanks again!","useful":0,"funny":0,"cool":0},
{"review_id":"qGB4q_iusZTw9p6Hhl2FlA","user_id":"SMBrMD6yepQviEcufkthlA","business_id":"Bqp7egV-_JiRD_b-qAqtlQ","stars":5,"date":"2017-08-02","text":"Kelly Nails is an AMAZING nail salon... They speak really fluent English They have been doing my nails waxing etc. for years. I would highly recommend them for all of your beauty, manicure, pedicure, and facial needs.","useful":0,"funny":0,"cool":0},
{"review_id":"dsrLcTPnp13Q7LrsHYj0mg","user_id":"97G_CkXk4Dx5EB2XU85Q_Q","business_id":"CocRZ_hZDdcebadLhasXvw","stars":1,"date":"2010-02-03","text":"Experienced them when visiting friend in AZ. They are bad at pest control. Service is not effective and they have to visit again.","useful":2,"funny":0,"cool":0},
{"review_id":"nOqvg70pIBtJmr8P-EaOjw","user_id":"RlR34w-RneLw0TiihHii_g","business_id":"oU42-XP4zvouwUw6TJNjnw","stars":1,"date":"2017-02-26","text":"Rude service. Generally un-organized and messy management. You can clearly see that their utensils are not sterile as the water containing the utensils is brown and floating with leftover food particles.","useful":4,"funny":0,"cool":0},
{"review_id":"sKqAYSaV051_cMedAz28HA","user_id":"RlR34w-RneLw0TiihHii_g","business_id":"bejxx0XrZ6Ogv-o-3InELA","stars":4,"date":"2017-06-19","text":"The food and dessert is good in both variety and quality. I got the mango black pearl and it was very good. My friend got the black sticky rice in coconut milk and it was also top notch. The server was also kind and served us well. It is a small place but very cozy and clean.","useful":0,"funny":0,"cool":0},
{"review_id":"kl5BSuu0ybCe3HDNSQnyEA","user_id":"RlR34w-RneLw0TiihHii_g","business_id":"GGfavkYjctCjBpz3Zun4RA","stars":1,"date":"2017-06-18","text":"Was here for lunch in the afternoon. Food here is fine and good in terms of pub food standard but service is terrible. You can tell that management of the servers is not well done. The blonde curly, puffy-haired server asked for our drink and we wanted water. My dad has diabetes and has a diet that he has to follow which meant restriction on sugar and alcohol. However when I tried to find the server when I was lost in finding the washroom I heard her say that her new table was \"cheap and just wanted water\". I was very offended at that point; if she has no knowledge of what medical conditions her customers are going through and saying something like that is extremely unprofessional and rude. It was very fortunate that only I had heard it, I can't imagine how much it would upset my dad if he had heard it. However we stayed and ate and even tipped since I just can't bring myself to upset my dad and that she didn't say it to our face. However I know that I will never come back to this place again. A server needs to be a proper human being with basic etiquette before she can serve people. And I did not feel like I received the most basic respect here.","useful":1,"funny":0,"cool":0},
{"review_id":"Mj_MVT3dPJ_cbwksvzyQaQ","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"WH6VOyte1UKoq8sp5uD4Wg","stars":1,"date":"2011-06-22","text":"rude rude rude. there was minimal acknowledgment of you, the customer, as a person. they escort you back, do the job, take your money. no smiles, no nothing. i guess if that doesn't matter, then that's fine.\n\nthe actual threading was decent. i didn't have much done, but they did an ok job.\n\npersonally, i didn't like the way that felt. i won't be returning.\n\nthere are two more (?) different(?) locations nearby which i would go to first - one in the galleria mall and the other on stephanie by the Target.","useful":2,"funny":0,"cool":0},
{"review_id":"b_Ufkuca8X8aiSXjcG-jmA","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"lxPWvoHDxgxBXIwfRjtLwg","stars":4,"date":"2011-04-17","text":"HH here is awesome! if its not already playing, ask and they'll play K-pop. \n\nI'm korean, the sushi is blah. the ddukbokki is good, decent - expensive tho! $13 for what should cost no more than $8\/9. love the skewers.\n\nthere are rice bowls with meat - the portions are not super-sized, so if you're looking for quantity, this isn't the place.\n\nnice chill (not crowded) place to come relax after rough day at work.\nit's a bar though, so if someone comes in & wants to smoke, they can :(\nHH prices really can't be beat & their soju is very tasty!","useful":0,"funny":0,"cool":0},
{"review_id":"IeSOqVQa7JjisQ2sVZGUYQ","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"vLWBeaYYtUKumqjdZD5LNA","stars":4,"date":"2011-11-28","text":"it's a chain store. that said, this location's workers are always nice when i stop in. it's clean, but loud. a few tables on the side of the store as well as some stools they'e got lined up in front of the windows for people to sit in while they wait for their orders.\n\nparking is not so much fun when this place is busy (there's a starbucks, gym, and yoga place in the same complex, among many other food places).","useful":0,"funny":0,"cool":0},
{"review_id":"XWWWkJyyMaQfMcwsAsgC4w","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"ho08r5RNItiD2iKgEeocIA","stars":4,"date":"2011-12-13","text":"very small sitting area, lots of students who study here.  free wi-fi, they've got a drive-through. parking can be surprisingly full depending on the time of day.\n\nbathrooms are pretty clean, staff is nearly always friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"DebLoKIysL6AVaRiqNZTvA","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"87j14nON0RPB9DSkcWsF7g","stars":3,"date":"2011-04-17","text":"good for what it is - soup, salad, sandwhich.\n\ni like the breakfast power sandwhich - it's basically an expensive egg mcmuffin with ham. i think i'm gonna just go to mcdonald's next time.\n\ntheir pastries are nearly always really dry","useful":0,"funny":0,"cool":0},
{"review_id":"xTAYz3MUO21ahTIO-Ki25w","user_id":"DqYK0QA0U0yPPZiIbBMYdw","business_id":"WYw3Uf56DT5IwpaLNnCH5Q","stars":2,"date":"2011-04-17","text":"quiet place in terms of vegas standards. there is 1 bar by the registration desk. the place is quieter, since there's no casino.\n\nrecommend if you want to stay at a nice, low-key, quiet place on the strip.","useful":0,"funny":0,"cool":0},
{"review_id":"ooP72yy9UgKqYJluPOYSPQ","user_id":"-idUvmrl8h_60FHVAY1rSw","business_id":"Sg_qo-g8nWyADZSYUxh_rA","stars":5,"date":"2017-08-21","text":"Wildflower Bread Co. is one of my favorite places to eat. The food, service and environment is always excellent.","useful":0,"funny":0,"cool":0}]