[{"review_id":"MQjR2LKsf1kbT_YhnmowrQ","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"cTijnQZ7Tkg_GqXStcozsw","stars":3,"date":"2012-04-11","text":"Pros: Philly cheesesteak,fries\nCons: No private seats, no Wi-Fi\n\nOn Monday around 1:00PM, the food court was crowded, but the line to the restaurant was not big. We did not take so much time to ask for our lunch. The restaurant seems clean and not messy.\nOne big point for this restaurant was that we did not need to wait so much for our food to be ready. Something that happens a lot of times with the so called \"fast-food\" restaurants. Because the court was crowded, it was hard to find a seat for us. We needed to spend some time to find a seat. This time I ordered the Philly cheesesteak and fries.\nOverall, the experience was nothing special. Not bad neither fantastic. Just the good feeling when you leave a \"fast-food\" restaurant that knows what they are doing. The fries were not greasy and the sub was tasteful. The next time that I go back to Canada if I want to have a quick and good food for sure I'll eat here again!","useful":0,"funny":0,"cool":0},
{"review_id":"7kvjsW91-uSEHxwILh8XgA","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"nWO956JzoKr1uKD3VIkp5A","stars":3,"date":"2011-11-26","text":"The food was good but the service was not. It seemed that the manager was doing more effort to serve us food than the attendant. My experience with the au bon pain on Boston was so far much better than this time.","useful":0,"funny":0,"cool":0},
{"review_id":"i5ddtpBbURXKKQBmmAetbg","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"GheMvm_dgcBTULpwzNuyBg","stars":1,"date":"2012-04-06","text":"Pros: Rolls, live music\nNot so con: Frango no Churrasco\nCons: Bacalhau, parking lot, waitress service, no free Wi-Fi\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? Yes\nIs the parking lot enough to accommodate the customers? No\n\nOn Thursday around 7:00pm, me and my wife went to the restaurant to have our dinner and we faced the first negative point, the parking lot. The parking lot was not enough to accommodate all the people to the restaurant because it is shared with other stores around. So, it was not hard, but it was easy to notice there was not enough space for everyone. At least, we did not need to wait so much time to sit.\n\nThe table was clean, but there was an old newspaper below my table and I noticed that the floor was not totally clean. On a first moment, I thought that the waitress service was nice, but after we placed the order, we got forgotten. My soda glass was empty for a long time and the waitress never comes back asking if I wanted more. But the rolls were delicious, unfortunately, what I cannot say about the Frango no Churrasco and the Bacalhau that me and my wife asked.\n\nOverall, it was frustrating for asking the two items that were house specialties and eat a food with poor quality. The Bacalhau was under seasoned and burned plus the potatoes were blend too. My Frango no Churrasco, the chicken was almost very good, the rice and potatoes were almost cold. It seems that the food was released for a time and they forgot there. But the worst for me was having a bad Bacalhau on a Portuguese restaurant. It is a very bad sign. I don't plan to come back again to it and if you are looking for a Portuguese restaurant, I recommend looking for other. There are a plenty around the Greater Toronto Area.","useful":0,"funny":0,"cool":0},
{"review_id":"jne5VA9GXxXXOKqzaFKK7g","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"84ezTxVxTCmI65_UeYRJcA","stars":5,"date":"2012-04-02","text":"Pros: Environment, Staff, Gelatos, Salads, Soups...\nCons: Not having a location in Buffalo, NY :)\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? No\nIs the parking lot enough to accommodate the customers? No parking lot\n\nAfter a long drive to Toronto, ON. We saw this small place and beautiful very near of our hotel. It was around 7:10pm when we arrived and the place was empty. Maybe because it is Sunday night. But is an injustice, places like this deserves to be always crowded.\n\nThe service was very friendly and nice and the salads and soups did not take so much time to arrive.  Almost all the sits you can admire the park, because the restaurant windows are very huge.  My wife asked for a lentils soup and Cesar salad, I just asked for the Cesar salad.\n\nOverall, the salad was fantastic and my wife loved the lentils soup too. After, I went for my main event of the night: the gelatos. Oh the gelatos! They are the best in North America that I had until now. The Ferrero Roche is the top one.  This is the kind of place that worth to leave a diet. Nice people and food. Congratulations to G for Gelato and Espresso Bar. You made my night happy today!","useful":2,"funny":0,"cool":1},
{"review_id":"DJll1jr0iatkScCG45QlMA","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"D_bSeZF8ZcHIl4gRsIwCBg","stars":1,"date":"2011-07-03","text":"As a brazilian i did not like tis restaurant. This not near a good churrascaria like brasa or fogo de chao and the maitree was very mean with me and my friends. The sides are poor, not even a black beans was served. The waitress forgot our table many times. The music volume was too high, we asked to move our table because we were on the direction of the aound box and the meat was good. But not anything special and i did not try all of them because the people keep forgettin where we were sitted. The only thing good on this restaurant was the guys that cut the meat for me. If you expect to have a real churrascaria experience, do not go to this restaurant. Try the other brasilian restaurants on montreal.","useful":1,"funny":0,"cool":0},
{"review_id":"ZlfPmZcej4iDGR_eZD9usw","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"Gvj_nneJoAvB7MkVWvAxmQ","stars":3,"date":"2012-04-05","text":"Pros: Chocolate Chip Cookie, food delivery station\nCons: Asian Sesame Chicken Salad\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? Yes\nIs the parking lot enough to accommodate the customers? Maybe\n\nOn Wednesday around 12pm, I went to the restaurant to get my food to go and have my lunch on another place. The place was crowded, but I noticed some free seats there. The cashier line was not so big and I did not take so much time to place my order.\n\nAfter paid, I direct myself to the food delivery station and noticed something that I never noticed on the other restaurants on the USA side. They have a monitor that counts how much time each food is taking to be ready to go and the order changes color when it takes so much time. Nice thing. It incentives the staff to have always a better performance.\n\nOverall, the chocolate chip cookie was delicious like always, but I did not like so much the salad. Different than on USA, I found big chunks of lettuces instead of in small pieces like the other restaurants. This is a negative point to me, because I expect always a good preparation for this food due to the complexity of it. But I am willing to give a new chance to the place.","useful":0,"funny":0,"cool":0},
{"review_id":"OVIxMIxdrsthlrWlqZLSnw","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"l0pf71mxpV1f_po1W5w1Lw","stars":2,"date":"2011-11-26","text":"Good service but not so good food. I already ate on many tgi Fridays and this is the first one where the food was not good. Will not come back again.","useful":0,"funny":0,"cool":0},
{"review_id":"kI8VA1v6cUCwNJ_NHpr7Bg","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"D-Y4sRmHcpukcgKiiYOicA","stars":4,"date":"2012-04-05","text":"Pros: Buger, side of fries, take out staff, free wi-fi\nCons: None this time\n\nIs it a good restaurant for kids? Yes\nIs the parking lot enough to accommodate the customers? Maybe\n\nOn Wednesday around 7:30pm, I went to the restaurant to get my food to go and have my dinner on another place. The cashier was very quick and nice to take my order and at this time there were no line to place my order there.\n\nAfter paid, there is a place that you can sit to wait for your food to be ready. I waited more or less 15\/20 minutes for everything to be done. While I was waiting, I was using the free Wi-Fi to check my e-mails and read the news.\n\nOverall, the fries were dry but tasteful. They were not greased or unseasoned and the burger at a first sight seemed dry what is a bad sign most of the times. But I was wrong, even not juicy inside the burger was delicious. They found the right balance between juicy and dry. I liked this restaurant a lot and I'm looking forward to go back there again.","useful":0,"funny":1,"cool":0},
{"review_id":"s9s1GaFlXu7EFO45ergLAg","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"Wj1yPG74S_vkCMspcSmH9g","stars":5,"date":"2012-04-08","text":"Pros: The Original Burger, Roast  1\/2 Chicken, Waiter service, Wi-Fi\nCons: Host service\n\nParking space: Enough for all customers\nGood for big groups: Maybe\n\nOn a Good Friday, around 9:00 PM, the restaurant was almost full. But when we arrived there the hostess did not offer a place to us to sit at a first moment, we need to look for her and ask to sit on a table. But even with this, I liked the restaurant.\nThe waiter service was a little slower than most of the other restaurants but he was a very nice and friendly person. He was always aware when my soda needed refill. The place seems a night point for the young people on the city and the music was played for a DJ and after for a band. What I can say, it was cool! I almost stand and went there to dance. This time, my wife and I asked for a The Original Burger and the Roast  1\/2 Chicken. Both food presentations were very good and in a \"young\" way.\nOverall, it was a very nice experience. There was no dried part of the chicken and the chicken gravy was to dying for. And oh my God, the food was very exciting. Something to change? Nothing. Congratulations West50, me and my wife had a very nice time on your place and left the restaurant with the feeling that I want to go back again many many many more times.","useful":2,"funny":1,"cool":2},
{"review_id":"W1Ojh3TPt_KnpFxHQNI6yA","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"SrDrMJYBwuIVzW7gvv64mw","stars":4,"date":"2012-04-08","text":"Pros: Cesar Salad, Malaysian Chicken Curry, Service, Free Wi-Fi\nCons: I did not found\n\nParking space: Enough for all customers\nGood for big groups: Yes\n\nOn a Good Friday around 2:00 PM, the restaurant was almost empty probably because the city was empty too. Said that, we could select any place to sit and wait for our food. The place is very clean and the menu was not fancy enough and offers any kind of food for different levels of taste.\nThe waitress was a very nice and friendly person. She was always aware when my soda needs refill. The place is very clean and calm. It is a very nice place to have a business dinner or just a quiet place to eat. This time, my wife and I decided to eat a Cesar Salad with Chicken and a Malaysian Chicken Curry. Where both food presentations makes me wanting to eat them with the eyes.\nOverall, it was a very nice experience. I never thought that a coconut flavored food could be so good. Just as a personal touch, the only thing that I could change is cutting the chicken in pieces instead of having the whole chicken breast there. But, is how I said, it is only a personal touch. It is not something that made my experience worst. I left the restaurant with the feeling that I want to back again many more times.","useful":0,"funny":1,"cool":0},
{"review_id":"gQvo7IBp3z5otqll9XBwew","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"tCjlXROlbcaGiBRfU2jaiw","stars":5,"date":"2012-04-08","text":"Pros: Chicken Oscar, Rib Steak (Bone-in), fresh rolls, service\nCons: Not having a restaurant in Buffalo, not enough parking lot for everyone, No Wi-Fi\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? Yes\nIs the parking lot enough to accommodate the customers? Yes\n\nOn Saturday around 4:00PM, the restaurant was not so full and we did not need to wait to sit. The mansion is impressive and they make a very good use of it. But this is not a place for people that has problem with stairs, because the restrooms are located on the 2nd floor.\nThe waitress was very nice and friendly. She was always aware when she needs to refill my soda glass. The rolls were fresh and hot, something rare to find on a restaurant. The place is good for big groups and quiet enough for a calm lunch or dinner. This time we decided to try the Chicken Oscar and the Rib Steak.\nOverall, the experience was fantastic as always. I did never have a moment where I came to this location or other locations on Canada and did not like. The rib-eye was very juice and delicious. This is why every time I came here to Canada, I want to eat there every time.","useful":1,"funny":1,"cool":1},
{"review_id":"yJLHIAC_gg3b6C6-uM8YZQ","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"RNvVqnX-BLyT4Oe6FIyeJQ","stars":1,"date":"2012-04-08","text":"Pros: Roasted Almond gelato\nCons: Service\n\nParking space: No private parking\nGood for big groups: No\n\nOn Saturday around 2:00PM, the store was not so full. One of the negative points was not offering more places to sit there and enjoy the gelatos or sorbets. But my wife and I found two seats for us to sit together.\nI can't deny. The ice cream was very good. I had he roasted almond gelato and I'm still thinking on it, even many hours after eating it. But the service was something frustrating because when I asked if they had another flavors, the woman told me that they had more at the other store, something that I found on the same day that was wrong, because the other store was only going to start serving gelatos or sorbets until next week.\nOverall, the gelato was very good but the service was very bad. The worst part beyond going to the other store and not finding what I want, was asking for where it was the subway on the Spadina Avenue and the guy told me that was very near to go walking what was wrong and I made my pregnant wife walking a lot without a need for that. Next time, I would ask if you do not know, do not give wrong information to the people. Because of this, I have no desire to go back to this location anymore and I don't recommend it!","useful":1,"funny":0,"cool":0},
{"review_id":"cOIPv0_ZiziE5HtE2p0ONw","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"DpMQCYYIa0iqb6aZLr855g","stars":4,"date":"2012-04-03","text":"Pros: Cost, breakfast, front desk staff, internet, dog friendly, fast internet\nCons: Housekeep, garage passage to the hotel, not so many good options to eat near around\n\nIs the private parking lot enough to accommodate all the guests? No\n\nOn April 2012, I reserved a room for 2 nights because I had some appointments to attend on Toronto. The room that I got was small but not bad. Even not having some good options to eat near around, the localization of it stills good. Because I the only time that I needed to use my car again, was only to leave the hotel. It was very accessible to get the public transportation from there to anywhere that I wanted to go.\n\nThe front desk service was friendly and nice and the breakfast offered much more options to eat that I am used to have from other hotels that I stayed on Toronto. Unfortunately, when we said to the housekeeper that we don't want our room cleaned she started to question us when we were planning to leave and that we need to notify the front desk for that. (Note: we were on the middle of our 2 nights stay) This point upset me a little.\n\nOverall, with the exclusion of the housekeeper moment, I liked so much the hotel and I am planning to stay there again next time I visit Toronto. And if you are planning to go there too, my recommendation to you is: leave all the luggage on the hotel lobby. Because if you try to use the corridor that connects the garage to the hotel it is not an easy thing to do because the doors are heavy and maybe you need to go back to the garage sometimes to get everything.","useful":1,"funny":0,"cool":0},
{"review_id":"0WsDaPGf8k2PAp1zQKKTsA","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"1yBhet37qpki8W0EvOi70g","stars":3,"date":"2012-04-08","text":"Pros: Service\nCons: Cafe affogato, whole slow-roasted hazelnuts tumbled in Peruvian dark chocolate, not having ice cream or sorbets\n\nParking space: No private parking\nGood for big groups: No\n\nOn Saturday around 6:00PM, the store was full and there were no place available. But my wife and I had luck and a group left the table and we found a place for us to sit.\nThe service was very nice and friendly. And even after having the knowledge that the ice cream or sorbets of this store were seasonal. I wanted to try the affogato and the slow-roasted hazelnuts tumbled in Peruvian dark chocolate. This is not a place for big groups, but it is a lovely place for spending a time enjoying a coffee.\nOverall, it was an okay experience. After eating and drinking what I bought, I left with the feeling of consuming overpriced products. The coffee and the hazelnuts were not bad, but they were not special too. But I still want to go back to this store yet, because I want to try the Nocciola gelato so much.","useful":0,"funny":0,"cool":0},
{"review_id":"151DWpyHHqBvslIdCTrxJw","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"z2RiCl_iU-8bM4Lj1zNL8g","stars":5,"date":"2011-12-03","text":"Pros: Private parking lot, barbeque, buffet, hostess, service\nCons: Be in Pittsburgh and not in Buffalo\n\nIs it a good restaurant for kids? Yes\nIs it good choice for big groups? Yes\n\nThis is a past experience review. Around 7:30PM, the restaurant was not crowded and there were still available many sits there. The hostess was very friendly and nice and directed us to the table without any waiting time. The parking lot is shared with the other stores of the mall, but because it was night and most of the commerce around was closed, so we can say that was a \"private\" parking lot.\nThe dining room was an excite place, really remembering a churrascaria on Rio de Janeiro. It made me feel home sick (what is good). The waitress was very nice and friendly and was always checking our table to see if we needed something more. Because this is a Brazilian barbeque place, my wife and I went there looking to eat a rodizio.\nOverall, the experience was fantastic! Because they know how to cut the meat on a Brazilian style and they offer Brazilian goodies to consume there too like Guarana or Brazilian coffee. After the dinner, I talked with the owners and found that they are Brazilians. So, if you are really looking for a place to have a real Brazilian barbeque experience around Pittsburgh, PA, this is the place. I'm still trying to find a good excuse to travel again to the city and eat there again!","useful":1,"funny":0,"cool":0},
{"review_id":"ZaGPW6Rg2NKFvUSLHsGiHQ","user_id":"8EtDC-WjdnjlBIbDugaC7w","business_id":"Au-eSvWd3NTk89J1o_0B5g","stars":5,"date":"2017-11-26","text":"Tasty beers for cheap. No foods are served. You could have foods brought to you via grub hub.","useful":1,"funny":0,"cool":0},
{"review_id":"-NY7WMEniKhVdT_7rnOsow","user_id":"8EtDC-WjdnjlBIbDugaC7w","business_id":"S_bG5WWbtNXhhY9Y0GTcSg","stars":5,"date":"2015-09-26","text":"Very good foods. Owners are superb nice. Parisian omelet is to die for... Cozy atmosphere. Reminds me of the cafe I frequented in Paris.","useful":0,"funny":0,"cool":0},
{"review_id":"Y3M-gIW_H5yxdrilFUluxQ","user_id":"8EtDC-WjdnjlBIbDugaC7w","business_id":"gfeCCBFK1b3SMsb_7dTrOA","stars":5,"date":"2015-09-26","text":"Amazing place! People there are awesome. Excellent selections. Cotton candy is my favourite.","useful":0,"funny":0,"cool":0},
{"review_id":"nLulVINnLijDokh8MzoceQ","user_id":"8EtDC-WjdnjlBIbDugaC7w","business_id":"T-KniGykrZ46ZC9plOTspw","stars":5,"date":"2015-03-29","text":"I tried this place after seeing reviews about PHX Burrito House. The foods are so good. Pork in green chile burrito is heavenly. Homemade guacamole. Yummy! I come here often.","useful":0,"funny":1,"cool":0},
{"review_id":"4e-414HUqJ7DtiuAi6FmOA","user_id":"8EtDC-WjdnjlBIbDugaC7w","business_id":"VyVIneSU7XAWgMBllI6LnQ","stars":1,"date":"2015-09-12","text":"Clothes code for a BBQ place?! Puh-leeze! BBQ isn't considered as gourmet cuisine. It's a fucking barbecue place! Owners are pathetic.","useful":0,"funny":0,"cool":0},
{"review_id":"WBuockudgqM9gVO6aPn4RQ","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"orMyWvonOj55yswWf-k72Q","stars":1,"date":"2017-03-13","text":"We went to Farm and Craft last night for my birthday dinner, and it was the worst service we have ever had, from start to finish. The hostess ignored us, and we waited 8 minutes to be greeted by our server when we were sat. I ordered a beer, it took 10 minutes to get. We waited another 5 minutes to order, and the appetizer took 25 minutes to get, and the entrees came out a minute later. To be fair, the restaurant was very busy. But the service was terrible. We will not be back, which is a shame, because this used to be one of our favorite spots. I'm not sure what's going on with this place, it's gotten worse and worse. Do yourself a favor, and don't go here, unless you sit at the bar, and only come during the day. The dinner service is a train wreck.","useful":0,"funny":0,"cool":0},
{"review_id":"SR2CTTcFMF0zEqr2LWRjJw","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"WXR0ND0KqbArMZDvFMA-bw","stars":4,"date":"2017-06-08","text":"Incredible food at a great price point. The only thing I found strange was the ordering and service aspect, it doesn't make a lot of sense to have it set up the way that it is. You order at the counter, get your own drinks unless you order alcoholic drinks, and get your own condiments and napkins. Why do I need a server, and why would I tip that person? Anyway, the food, drinks and ambiance are great. If they were to change the service format, I would give them 5 stars. Check this place out.","useful":0,"funny":0,"cool":0},
{"review_id":"zoWehvg21KqLUymRhqKnkw","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"lnJlOuHGNRoN2zW_a6Vb7g","stars":1,"date":"2017-05-31","text":"Very limited menu, which was disappointing. The appetizer was lack luster, as it was only melted cheese and oil, which came out burnt and very greasy. The tacos were decent, but lacked imagination. The sangria was very run of the mill, and the service was atrocious. I have to say, we were very disappointed. It's over priced, and the hostess spilled sauce all over us, and did not even have the decently to apologize. We will be taking our business to other options, and will never come back. Go to Blanco or any other Fox concept, the food, ambiance and service will blow you away.","useful":1,"funny":1,"cool":0},
{"review_id":"Rxwd6iK_un10XyklpQmNXg","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"VMr8sgoQOW0fo0qVJENajA","stars":3,"date":"2016-12-12","text":"Incredibly slow service, with cold food being brought to the table. I will give them another chance, only because the food showed promise. Don't eat here if you're in a hurry!","useful":0,"funny":0,"cool":0},
{"review_id":"d0unsdUm0cHwaHfTynYG-w","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"5A_sjC9ULLt4UkDNtr9dkw","stars":5,"date":"2017-06-19","text":"This is definitely my favorite spot to grab a beer in town. They always have a great selection of rotating beers, and the food is amazing as well. If you're looking for coffee, they have a nice selection, and live music most nights. It's never had anything but a nice atmosphere, with a friendly staff and friendly regulars frequenting this place. Check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"D_AFHl4Se8PmU7BihBYL8Q","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"-rhH9sL3XGFpoJXcxUpEWA","stars":5,"date":"2016-11-17","text":"Adam, our server was absolutely fantastic. He was attentive to our dietary needs, and had an outstanding attitude. Thank you, Adam! You're amazing!","useful":0,"funny":0,"cool":0},
{"review_id":"B9CUYZDx0esDocpPa3lObA","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"wUKzaS1MHg94RGM6z8u9mw","stars":5,"date":"2017-06-08","text":"Everytime we come here the service is great, the food is great, and we realize each time why we come here: there is nothing like it in town. If you haven't been here, you have to check it out, you will not have a better meal for this price point anywhere in town. I recommend it to everyone I know, and they all agree, this place is something special. Nice job, guys.","useful":0,"funny":0,"cool":0},
{"review_id":"EGHrVNDS3Cx6YKQDQ_mYJg","user_id":"aSciuTJ6gBXDbPvPDbPaHg","business_id":"wTjvgkUJMVWrYed9mXdQjg","stars":5,"date":"2016-10-21","text":"Absolutely incredible service. Holland, my server was absolutely accommodating to my needs, and was very knowledgeable. She definitely went above and beyond what was expected, and exceeded what my idea of what a great guest experience is. I will absolutely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"GfVR6AIFn0EJVGhpplQF6w","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"XE8LOObCmAqu78fhEt7SHQ","stars":5,"date":"2016-08-29","text":"Only complaint I have about the zoo is the fact that it closes at 5. We rushed and only got to spend 30 minutes here and still made memories! The conductor on the mini train at the koala junction was so kind to give us a late ride. He went above and beyond to make this day special. Hats off to the amazing zoo crew and all of the improvements they continue to make! We have been members for years and are committed for life!","useful":0,"funny":0,"cool":0},
{"review_id":"VkU7FzJ0u31TskxVGfBbtg","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"3sEOltqZs1cjRA4Pqkm_AQ","stars":5,"date":"2016-08-07","text":"This is our favorite burger place on the Westside. Great vegetarian burger and you build your own-- including sauces and fixins! Large beverage selection to accompany the great food and appetizers!","useful":1,"funny":1,"cool":1},
{"review_id":"Fpug43THmWZ_rWG_CJxiPw","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"gqKY69C4xVZsIrUxcuw3lw","stars":3,"date":"2016-08-20","text":"For a bar, they have great food! Drinks are cheap and good happy hour deals. When pregnant, I could not get enough of their fried pickles! I only gave three stars due to service. After a few visits we are still disappointed about the lack of intentionality in the employees. We will go back, but under the assumption there will not be spectacular service.","useful":0,"funny":0,"cool":0},
{"review_id":"NVpkbDFlncTsQ19DBG1o0A","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"7H8Q6aTMDZIYEmhxsZMYfQ","stars":5,"date":"2016-08-21","text":"I can't say enough good things about this place. They catered to our staff luncheons (100+people), my wedding\/ baby showers, also they deliver locally. Fresh salad, sandwiches, wraps and soup. Also they sell wonderful fruit smoothies and locally baked goods. We go to Salad Kraze every week since my two year old loves their salad and so do we!","useful":0,"funny":0,"cool":0},
{"review_id":"slPye7bTaRYNeoey2PT8yQ","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"x1o-xthDH_r0pBxAs0GjSA","stars":5,"date":"2017-02-20","text":"Wonderful local and family owned ice cream. A great welcoming environment with fun activities for kids and lots of seating. Great outdoor space in the warmer months.","useful":0,"funny":0,"cool":0},
{"review_id":"tbDWboGQlhuiFz07voG64g","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"du9EiKx28BVs-2hUAQ3UVg","stars":5,"date":"2016-08-07","text":"Great fresh food and wonderful vegetarian options. Service is great and they are very accommodating with children. Perfect local family restaurant with unique food and kind people.","useful":1,"funny":1,"cool":1},
{"review_id":"OI6vKetdKzREcI3EFIG8NQ","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"jZwqcK3UF3Aa8nxrh9BHig","stars":5,"date":"2016-08-19","text":"Best local authentic Mexican food! Family owned and full of wonderful employees. Their combination platters have enough food for two people. Highly recommended for family events or large groups!","useful":0,"funny":0,"cool":0},
{"review_id":"Otkl_FgwH0LolTKdOca8lQ","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"_vu7qhaHRo0k8gnkojZD_g","stars":3,"date":"2016-08-07","text":"Sushi is tasty but overpriced compared to other local places. \"Half price\" is now cash only, 40% off and only from 10-12 on Friday and Saturday nights. Very disappointing and we would visit more often if the discounted sushi option was available like it used to be.","useful":0,"funny":0,"cool":0},
{"review_id":"xCzPC_uC6UucX1tAgt4-4Q","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"qO7dpBAVxbrR4GbtR2uCOw","stars":5,"date":"2016-08-07","text":"We had a wonderful first experience. We were unsure of a final selection so management actually brought out a portion of the amazing eggplant dish for us to try in addition to our main courses. The service was fantastic, management was generous and kind. We will be going back frequently!","useful":1,"funny":1,"cool":1},
{"review_id":"oVEo-xU0_dHa3A9mF6pcaA","user_id":"s2jkR1osopETwWV3-syQ0Q","business_id":"FvXZcRB8bocNMDvFUnoWhg","stars":4,"date":"2016-08-07","text":"Best wood fire pizza around but plan for one pizza per person. Price point is high but the fresh ingredients and unique wood fire baking makes it worth it! Margarita pizza is our family favorite with whole basil leaves on it!","useful":0,"funny":0,"cool":0},
{"review_id":"1Mw3z7LX8UPUqihjgaMLmw","user_id":"eN_Gilf2w-kqTUaiQCS7Dw","business_id":"kPza0ofaz547YrmNSyRjLg","stars":5,"date":"2017-02-12","text":"We love TLC.  Nolan gets great care, the staff are loving and kind and my son gets excited to go everyday.  Large indoor gym is great for summer, smaller class sizes and flexible options.","useful":0,"funny":0,"cool":0},
{"review_id":"VEAD55vCXVvDoftY3k9PbA","user_id":"DvRTklPW_CG6uMEGPkTQSg","business_id":"5qAnki509wBtMeabE3jUHA","stars":5,"date":"2015-05-19","text":"I love this restaurant. It's wonderful on so many levels. The location is a beautiful drive that takes you through some lush green fields if you're driving from mason. It's a family owned restaurant where the recipes are mom and pop perfected over years of being in the business. So needless to say, crazy high nom factor. And the gentleman running the place is super friendly so you get to hear some nice stories and experiences from his life in the south and the Midwest...the lunch buffet and dinner both are a win. Fresh and authentic from scratch. Unbeatable taste!","useful":2,"funny":0,"cool":0},
{"review_id":"p1PBD2T_fE92QPmNcsKK2Q","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"EFSrUiPzbKgQd73xru73MQ","stars":5,"date":"2015-08-30","text":"I've worked in the Yonge and Bloor area for a long time.  Everything here is bland, expensive and\/or too time consuming.\n\nThe Vine Leaf is an excellent alternative option.  For under 10 bucks including tax I always get an extremely delicious and filling meal. The chicken shawarma plate is my meal of choice, but it's all good really. It's fairly busy but the wait to get my food is always under a couple minutes and as you can see in the pictures there's a comfortable area to eat your food. Also it's worth noting they have great customer service.\n\nAt Vine Leaf I'm able to have a decent meal, for a decent price, all within my designated break time.  I come here once a week. 5 stars.","useful":1,"funny":0,"cool":0},
{"review_id":"PJbbGWjT95vLuFyovEg0aw","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"C0IedQWlNKf4tCYWWZJ36A","stars":5,"date":"2016-10-30","text":"Great burgers. Interesting and delicious beer flights.  Great place for a date. Five stars.","useful":0,"funny":0,"cool":0},
{"review_id":"cfF5MrwDLQazlidHADbk7w","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"QNdNPr3f-WdESYo9WabWpw","stars":5,"date":"2015-08-30","text":"The Istanbul cafe serves absolutely delicious lattes and cappuccinos.  It always has a friendly environment, I've come here to meet a friend many times.  It's also a great spot to read a book, and enjoy the nice weather over an excellent cup a joe.","useful":1,"funny":0,"cool":0},
{"review_id":"r6fMUbuw0yExh7k2yRGVsQ","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"xGXzIliuZ6FgMS870UjPRw","stars":4,"date":"2015-08-30","text":"Very tasty.  I get the home burger every time.  A little expensive if you want a combo, but just the burger is perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"2yp9qVbrQfR4LvAodBXprA","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"sHobmDWiTSsRvcE7H4KkgA","stars":2,"date":"2015-08-30","text":"I live in the area, so I was excited when this place opened up last year.  Since then I've been here twice.  Once I ordered a burger with duck fat fries,  and once I had a the rabbit burger.  I had high hopes for the burger with duck fat fries.. but they were just okay. I didn't care so much for the rabbit burger, but I don't hold that against wild burger I was just trying something new. Both times I felt a little gouged on the price. On their website they have the details of their daily deals, most centering on having a pint with dinner. But i find it irritating that there are no prices for their regular menu.\n\nGive it a try if you want to try eating an exotic animal in burger form. I won't be coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"PF7rhplrfDZ0gU3fK9Sb5g","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"MzEH3h8meWt7fW146U7y0g","stars":5,"date":"2016-10-30","text":"Rooster Coffee House offers great coffee for a reasonable price. They have a cozy atmosphere that would be great a date or for reading the paper.  Largely hipster customer base, which leads to fantastic people watching! But most importantly the customer service is fantastic. it's a hipster coffee shop without the \"hipster-service\". The staff are eclectic, knowledgeable and extremely friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"i37pu4ExaESmEh-H4wI4cg","user_id":"ahJpy_fTI6qMAXISGTjU2g","business_id":"G3Z9UREDLB96h3ysQ7P0nQ","stars":5,"date":"2015-08-30","text":"I live nearby, so this is my dry cleaner of choice. Decent price, thorough job, no bullshit. 5 stars!","useful":0,"funny":0,"cool":0},
{"review_id":"Z2SP0EzTSxjy8V8qNOxVOQ","user_id":"NZfuWWxFSCgmVqQCZCz3AA","business_id":"5eV8oUGdBXylwB7HeaDFOA","stars":5,"date":"2011-06-06","text":"I agree- Finally a good Greek Restaurant on this side of town!! The Gyros were huge, and delicious! The service was was impeccable; very friendly and definitely pride in ownership. The \"Family Packs\" are a great deal- I can see gyros for dinner once a week...!","useful":2,"funny":1,"cool":1},
{"review_id":"g1e_kZdn6PtEmNn6oMLDFg","user_id":"NZfuWWxFSCgmVqQCZCz3AA","business_id":"JmWtlxpKveqfUBTsBSsJnQ","stars":5,"date":"2016-01-19","text":"I've been taking our pup to Park for years. Dr. C is a very caring, competent vet. Rosie hates going to the vet or groomers but all the staff has made it a very pleasant experience.Big shout out!","useful":1,"funny":0,"cool":0},
{"review_id":"sf3aJfBuOmV55675WLa4Cw","user_id":"m3AqU6kLMDai5M2HBCcX4Q","business_id":"NTtLuuBKpywlyIz6oyd9kg","stars":3,"date":"2017-01-08","text":"I ordered the 7 piece sushi combo, two of the pieces are not what I would expect, one was tofu and one was the fake crab fish you see used in place of crab. At 18.00, this was a disappointment.","useful":0,"funny":0,"cool":0},
{"review_id":"oeEL4szfHeSX3mzpOXkL0Q","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"RB5-T39Ar2RqfG8DlTWLSQ","stars":5,"date":"2016-04-17","text":"I heard a lot of good things about this restaurant from a few friends and decided to try it out to see what the hype was all about. \nThe hype is justified ... this is one of the best new restaurants I tried in a long time. The staff was friendly and helpful and the food was prompt and very tasty. \nWe had a variety of dishes and my absolute favorite was the black cod. It was tender, juicy and absolutely delicious. \nThe jumbo beef rib was very good too. It wouldn't be a great first date dish as it's messy to eat but I'd still highly recommend it.\nWe are already talking about when to go back.","useful":2,"funny":0,"cool":3},
{"review_id":"ePp-Hzvccetd70MC06JQHA","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"5Jp7R4_0oMDUfX-_4tBo1Q","stars":4,"date":"2016-05-24","text":"I decided to try this new restaurant out last week as it had a lot of good reviews. The food and service were excellent. The ramen was very good. My only regret was that I came too lunch and the yakitori was not available yet (after 3:00 pm, I think). I would recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"7whG2hTCDp2nIa5l7iS8YQ","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"v-ZHYK044MXryMThoCeGCw","stars":5,"date":"2016-03-13","text":"Zipang is one of my favourite sushi restaurants. The food is always fresh and delicious. I would highly recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"XuI9rUC0F98-vijdH7s4nw","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"vYFsk6qWh8kke7JEmcKDYA","stars":5,"date":"2016-05-26","text":"I was close by the Beltliner yesterday and decided to pop in for a late lunch ... and in glad I did! I had the Big Salad and it lived up to its name ... it was humongous! The chicken that came in the salad was very moist and tender. The service was excellent and the food was delicious. What more could I ask for?","useful":1,"funny":1,"cool":1},
{"review_id":"fvgBoAK-717C7ttEXWCV6Q","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"fSFbPfq35Kn5SOIc87OXSA","stars":3,"date":"2016-06-25","text":"I've been wanting to try this place since I tasted their goods at the Taste of Calgary last summer. Maybe it was an off day or my expectations were too high but I thought my experience could've been better. I ordered the beef brisket and the dry rib tips. The beef brisket was tasty but I've had more tender and flavourful brisket before. I didn't care for the dry rib tips at all ... too much bone and fat and not enough meat, I thought. If I go back, I'll try something different. Warning: the spicy Chili is really spicy (I can eat hot stuff but even I found it to be very hot).","useful":0,"funny":0,"cool":0},
{"review_id":"0mLYx1O556B9S6VSIMz-sg","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"kVNlMOvRZb432c0mirBNLA","stars":4,"date":"2017-03-05","text":"The food was good but I think they are a little short staffed. Our order, food, and bill took longer than I would've liked. I don't blame our waitress though as she was slammed. I had the yogurt parfait and it was delicious. The Greek yogurt was very smooth and creamy.","useful":0,"funny":0,"cool":0},
{"review_id":"yiHani3Bhq2ks1ZpcoMMzA","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"iXmFhJtk2Qg2xkh7mz15oQ","stars":4,"date":"2016-07-06","text":"I stopped by Rodney's for lunch last week and I'm glad I did.  I ate at the counter in front of employees shucking oysters.  They were very friendly and recommended some oysters to me.  They were delicious!  I also ordered the shrimp cocktail and I don't know where they find shrimp this big but they were humongous! The service was excellent - the people were very friendly and helpful in making recommendations.  I would eat here again.","useful":0,"funny":0,"cool":0},
{"review_id":"pbNq9T_bF4xtZKKP7WJytg","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"XSZgcEMWM4XcuE-sWXny9w","stars":3,"date":"2016-06-26","text":"I came here for lunch as it is close to my work and I found the food to be quite good although it took a while for it to arrive. The location is nice and you get a good view of the river depending on where you are seated. I'm told their dinner menu is quite a bit better so I can't wait to try it.","useful":1,"funny":0,"cool":1},
{"review_id":"F59IsZrDfUqDK3MJuqLP5w","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"iBFgCuiQoK8DCXgTw6vi2Q","stars":5,"date":"2016-07-06","text":"This is one of my new (new to me, anyway) favorite restaurants!  I went there for the first time for lunch and had the Croque Madame and it was delicious.  There was something about the bread, cheese, ham, and fried egg on top that just melted in my mouth.  The location is fantastic, just off of 17th Avenue in Mount Royal Village.  It wasn't too busy when I went so I sat on the patio and people-watched.  The decor is very European; I felt like I was in a small bistro in Paris.  I highly recommend Parc.","useful":0,"funny":0,"cool":0},
{"review_id":"xkefMPPAgOabRJiqSOpR8A","user_id":"JdC7Y4SN606CPTIAhM_FxQ","business_id":"-Miw03v5yXJWjH9MN1aglw","stars":4,"date":"2016-06-25","text":"I popped in here for lunch and the food was tasty and the service was very good. I ordered the Pacific Halibut \"Hot Dog\" and it was a different take on the concept. If you are expecting a traditional type of hot dog then this isn't for you but if you want to try something different, I don't think you'll be disappointed.","useful":1,"funny":0,"cool":1},
{"review_id":"ie0l0TMzQLcea16w6M5rxQ","user_id":"_1OAvzjN6MIMK8CAlfeA9A","business_id":"MP0TwGllsrfFMsV-pZBW0g","stars":1,"date":"2013-07-07","text":"I love Chik fil a's, but I was overwhelmed by a terrible smell when I walked in here today. Gross. And the bathrooms were full and garbage overflowing. We walked out without ordering.\nThis was from November 2012.","useful":0,"funny":0,"cool":0},
{"review_id":"8zvaZIHXKr_Ssx9BA45HUQ","user_id":"SrqrPTgfIGrj8pnX6z3zvw","business_id":"ltQ-ilKwrlBtub7b_7gKww","stars":2,"date":"2015-01-23","text":"Food is OK but way overpriced. \"Hot\" brisket sandwich was COLD. Chicken Parmesan sandwich was wrapped in tin foil. I had to pick foil out of the cheese.  I won't be returning.","useful":0,"funny":0,"cool":0},
{"review_id":"2tiD6KOuQQ-cJz7_iHtU6g","user_id":"l4ZD-0ZMEn79zP3ITvn-Eg","business_id":"16Fplxu-OwVmTEFxQAUP4g","stars":1,"date":"2014-11-08","text":"Waited over an hour for the food. Cold and dry angus beef (asked for medium well, got well done. Mashed potatoes tasted precooked. Small portion. $50.","useful":1,"funny":0,"cool":0},
{"review_id":"O17w1hO9DdqYfkDmJvX1YA","user_id":"Cu6TQL8YzGgISoWS3fjwnA","business_id":"Z6N5jmZddU4DGUfrjiIxDw","stars":1,"date":"2013-10-01","text":"I really hope that the owner or management cares enough about their business to check up on these reviews... I can't give any opinion on the food because I had taken all I could before I was able to try it. I walked in and was told I could sit where I liked, I chose a booth. There was plenty of seating because the place was dead. My waitress asked for my drink order and I asked about specials...she said there were none....I asked for a drink menu and she said they didn't have one, they just had \"the regular stuff\". I ordered a Miller Lite draft...a couple minutes later she came back and said they didn't have Miller on draft so I asked for a bottle. When she asked for my food order I asked for the Ultimate Bacon Platter on the appetizer menu. A few minutes later she returned and said they were out of 2 of the items that were on the platter. When she told me that(with no remorse or empathy) I had experienced all of this establishment that I wanted so I paid for my one beer and left. I will not be returning. My wife and I just moved to Gastonia a few weeks ago and I have been trying to convince her to try it with me because it looked interesting and I obviously love bacon, but she was very resistant....luckily I tried it alone on this occasion so I don't have to hear the \"I told you so\"s.","useful":2,"funny":0,"cool":0},
{"review_id":"yue7Y03nX5Kd_x2E1s1XFQ","user_id":"52_JuusMlwlAdYLlf0q_DQ","business_id":"mYTem99eRslMJhWpfQOKGg","stars":1,"date":"2012-12-20","text":"If I could give this place zero stars I would. I walked in hoping to get a manicure and they looked at me like I was going to rob them. These people need to learn about customer service.  Come here if you would like that get an attitude with your mani pedi.","useful":4,"funny":0,"cool":0},
{"review_id":"BP21c93Q5X9_j6igYow3Lw","user_id":"52_JuusMlwlAdYLlf0q_DQ","business_id":"yCfIn32VBPusg51DP5dEaQ","stars":1,"date":"2013-01-08","text":"Awful place to get a mani pedi. I had no idea that it was some sort of race to finish the job. The guy nicked me several times.  Finally at one point just pulled my hand and told him that he could skip it! The bleeding would have gotten worse!  \n\nThey NEVER CLEAN THE INSTRUMENTS properly between clients.  Just rinsed them out in the sink.  Skip this place unless you want an infection!!!","useful":24,"funny":15,"cool":14},
{"review_id":"GrxZ9bxVwJzevLakWpU-wA","user_id":"6XnHd_HLPB8rXXfNwcYINQ","business_id":"bMrYaaAy62ppdS09na0RgQ","stars":5,"date":"2015-11-20","text":"New York House of Pizza is the best in the west! The employees are especially kind and helpful. We've been eating here for a year and a half and won't go anywhere else!!","useful":0,"funny":0,"cool":0},
{"review_id":"kUncNc7adnT25DcZhXkUxA","user_id":"6XnHd_HLPB8rXXfNwcYINQ","business_id":"tCYAxj5_pV4RnDpe3_5VpA","stars":5,"date":"2017-01-02","text":"Always a pleasure to dine here. Food is fresh and service is fast and courteous. We love the all you can eat sushi. This is definitely one of our favorite restaurants in town.","useful":0,"funny":0,"cool":0},
{"review_id":"_v5uvlhMDnLDlh5K4vfAIg","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"Mksyt1TZQ-7vzCZjeuzfAg","stars":3,"date":"2014-10-09","text":"The food is generally pretty good. The service can be a hit or miss. A little bit on the pricey side.","useful":0,"funny":0,"cool":0},
{"review_id":"wumZ1CqPcKVCHvOKsi2ISA","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"KwVGN-H7QpXA307QlOBfZA","stars":5,"date":"2014-09-12","text":"I have boarded my three dogs multiple times with rosewood, the Resort Vacation for my younger dogs and Home Vacation package for my older dog. I cannot be happier with the professional service they provide. I have spoken to a few staffs there and they all genuinely cared about my pets. The staffs are very friendly, and they spend the time to chat with me about my dogs' stay. They remember each of my pets by name and my dogs love going back, they must have lots of fun there! I was told that the owners of rosewood are all professional dog trainers, that explains why my dogs behave better when they come home from boarding. I feel very comfortable boarding my dogs knowing they are in good hands, I have boarded my dogs with other boarding facilities and none of them give me the same confidence rosewood gives me. Highly recommended!","useful":8,"funny":0,"cool":2},
{"review_id":"Z1L_6_RM2FfJxXfIC4R5rw","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"769NudnrUxWFtJCGU66A_A","stars":1,"date":"2014-12-26","text":"Terrible service and bad food. We asked about our drinks and water 15 mins after ordering and was told \"We are busy, you will have to wait\". The poutine has been sitting on the counter the cheese was solid and cold when it got to us. The grilled cheese hamburger was just a bad grilled cheese with a bad hamburger patty. We asked for onions rings and the server substituted it with fries without first informing us, claiming they are out of onion rings.","useful":0,"funny":0,"cool":0},
{"review_id":"e7CAsLShEk7R2wY19FbI1A","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"P2ho2ZOr0P49X8-HAMdulw","stars":2,"date":"2014-10-09","text":"Nice decor. The service is okay. The food is not the greatest. The kabob is dry and simply not very good for Persian food on the pricey side.","useful":1,"funny":0,"cool":0},
{"review_id":"e5OpmQ03e9aiFQz2hk-yYg","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"YIez_A3WOt9J2SXN7OMa2Q","stars":4,"date":"2014-10-09","text":"Love the jerk chicken sandwich and jerk chicken dinner. The roti is not always fresh so I would stay away from it, but the jerk chicken and beef patty are amazing.","useful":1,"funny":0,"cool":0},
{"review_id":"dwdTpZ2MvgycH5Xom6RP8w","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"GoOkCxPFM5i5lxHgFQMj1w","stars":3,"date":"2014-12-30","text":"There are some dishes that are just terrible, like the \"water-boiled beef\" that looks and tastes nothing like the real thing. However, the good dishes are consistently good. Stick with the popular dishes and you will always have a decent meal here.","useful":0,"funny":0,"cool":0},
{"review_id":"4j5JJUVjy8tAreYVu5zv0g","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"OyutYVBEA505HnCnMEaXMw","stars":1,"date":"2014-12-09","text":"What a complete disappointment. It has gone all the way downhill. I used to enjoy this place a lot when it was good and it was expensive. Now the sushi is cheap and it shows. There must have been a change of ownership. The rice tastes wrong, the fish is cut wrong. The shrimp in the dynamic roll looks and tastes more like a frozen spring roll. The food is seriously just barely edible.","useful":1,"funny":0,"cool":0},
{"review_id":"HsYIuFIG7VOmanbHzHqVPg","user_id":"xNSvX-tVu4D_V3zTR8051Q","business_id":"qsCoUN2TRL47ucTzo9D6xA","stars":3,"date":"2015-07-13","text":"It went downhill quite a bit over the last year, it's just a generic Korean owned Japanese restaurant now. Some sushi items are pretty good, but nothing amazing. Some, like the spider roll, are just plain terrible.","useful":0,"funny":0,"cool":0},
{"review_id":"DHcQkYVLJRwv8hudufRq8Q","user_id":"q2yXlGLnI3YiCCp0Aehj8Q","business_id":"DKusRJUxgsye1cdrlGgQOg","stars":1,"date":"2016-11-28","text":"Not at all a good place to eat for Vegetable Manchurian and Pani Puri both were not at all good and expensive. Pani Puri they just gave potato pieces boiled and put in the puri with no salt, no pepper,no chick peas...I would suggest not to go to this place for eating chat.","useful":0,"funny":0,"cool":0},
{"review_id":"7PHDoAp5-14FDD89jrNqdQ","user_id":"qizdCk8dEzNVDEozwfm57Q","business_id":"UioQI1PcRmEgO9EKk9VZEA","stars":5,"date":"2016-10-27","text":"I have to say that Shaun is the best in the business. He is very responsive and has a great selection of clubs to choose from. This past weekend, he was able to get us into Hakkasan's guest list and our group had a great time. This is not the first experience with Shaun. I'm very thankful that he was able to get my wife and her bachelorette party into a club in Vegas, after giving him a call on a very short notice, the day prior to them getting to Vegas. Shaun is very easy to work with and is a genuine person, as he follows up to make sure everything at the club is going alright. I really appreciate Shaun, and is the only person I would hit up when going out to Vegas. As always, Shaun, we appreciate you!","useful":0,"funny":0,"cool":0},
{"review_id":"SboOLOOgbXI5ZilzNqWpgw","user_id":"qWIr94fMfdV7z09GhCxaRw","business_id":"7PTQ-a8Fu4kxXccFvWWT-Q","stars":1,"date":"2015-03-16","text":"DO NOT ORDER PIZZA FROM THIS PLACE !!!  The franchise owner \"John\" promised a simple replacement pizza for the soggy, undercooked and room temprature pizza I paid for. After 3 subsequent calls to complain and being promised I'd get a \"correct\" pizza, nothing has been done. John promised today (my third call) that he'd follow through with a letter to me after he blamed his staff. Come on ... take responsibility and maybe attempt recovery.This place is Horrible and I'm 100% convinced that the Franchise Owner, \"John\" is to blame. Not the staff. I've contacted the Corporate Office about the lack of follow through and disengaged attitude of \"John\". What a joke   over a $20 pizza.","useful":3,"funny":0,"cool":0},
{"review_id":"L6ChK4l0DZhjQxdbTgdjPw","user_id":"qWIr94fMfdV7z09GhCxaRw","business_id":"FNe5PPA9pyj8FjcDefCBpg","stars":5,"date":"2014-08-19","text":"FANTASTIC!!!!\nThese guys know the basics about customer service infused with super-flavorful thai food. We've been coming here for a year (about 8 times). Friendly, fast, clean and fresh tasting thai food. I'd give it 10 stars if I could. Not in a fancy big box stand alone building but clean and worth the visit. You won't go wrong I promise. Try the Pad Thai, Deep Fried Tofu and 'F5\" Spicy Thai Basil. Fresh and mouthwatering. Oh and the price ... very affordable. ENJOY this GEM!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"dqqdUvTU3r99b12wFUk-bw","user_id":"qWIr94fMfdV7z09GhCxaRw","business_id":"SEjyjYlMfFFzkHaru6JadA","stars":1,"date":"2014-08-19","text":"Don't waste your money or time. Food was absolutely HORRIBLE! We ordered the fish taco's with rice and beans & two house margarita's. Fish Taco's $14.95 and had absolutely no taste at all. Clearly the kitchen doesn't taste what they send out. It was very fast though ... probably microwaved. No lime\/spanish seasoning\/flavor what so ever. And the deciding factor? This is our second time because we thought we might have caught them on a bad day two months ago when we tried them. I used come here in the 1980's and it was always awesome and you had to wait to get in. No so anymore. Very few customers. The frozen cod called fish is flavorless as is the rice. Try Jalisco's up on Durango and near the 215. Worth the drive and has authentic flavor. They also are friendly with excellent prices far below this worn out old, canned sauce, microwave tasteless fare. Too bad. It used to be the \"gold standard\" now it's worse than Del Taco. I warned you!!!","useful":0,"funny":0,"cool":0},
{"review_id":"66xMjdA5ktiHVBTHAxlYPA","user_id":"DIx9M1iW_7XW0EZVMkraSw","business_id":"pqtBHj-aywRHfY8g9eCzqQ","stars":5,"date":"2017-06-22","text":"What an amazing experience coming here today! First off it's 118 degrees YES I'm not lying 118!! I walked in an was greeted with a friendly smile the person in the lobby realized I was so hot and they offered me an ice cold water WOW! That's what you call amazing service. The tellers were quick, efficient and friendly! I'll definitely be back. Thank you Wells Fargo","useful":0,"funny":0,"cool":1},
{"review_id":"NZ14I4nCPfsP_0kDX7zgoQ","user_id":"DIx9M1iW_7XW0EZVMkraSw","business_id":"J6WnhToRaJ2TtLbRpKF3Lg","stars":5,"date":"2015-10-05","text":"Just moved to AZ and was looking for a place to get brows done. Happened to find this awesome spot on Yelp. Janelle did an awesome job on my eyebrows. She really took her time to get it done right. Their proprietary wax is AWESOME it was extremely mild and sensitive not causing any irritation. Will definitely be back. So glad I found this spot.","useful":1,"funny":1,"cool":1},
{"review_id":"u9ZoG_vhhBUkJy-W27kjUg","user_id":"DIx9M1iW_7XW0EZVMkraSw","business_id":"K_20WI2uDh_1UvnyKTazfg","stars":5,"date":"2017-05-10","text":"Came here for first time a few days ago. They always have beds available! Great service and CLEAN beds! Thank you so much","useful":0,"funny":0,"cool":0},
{"review_id":"DEZVvI_tYk_lfE-ZUazXfQ","user_id":"ee2TBx44LC4zILdjq6ulvg","business_id":"qx_ZlGhgCrJ4-8FUj9LWKg","stars":5,"date":"2011-07-09","text":"Went there because of the yelp reviews and was not disappointed. Computer wouldn't turn on at all. They looked at it right away without even writing a ticket. Plugged in a different power supply as troubleshooting and it came on. Then they blew me away with it will be ready in a half hour. I came back in an hour and it was ready, cleaned inside and out and a totally reasonable price for a bigger power supply than the original and great service.","useful":4,"funny":1,"cool":3},
{"review_id":"tW55uCrbvJMN61tZgUJ0Pw","user_id":"ee2TBx44LC4zILdjq6ulvg","business_id":"dOGLTIMqqQZn8xxBRsU6CQ","stars":2,"date":"2014-03-29","text":"Service was horrible. No one took our drink orders, the waitress took our food order, but didn't ask about drinks until we had to ask someone about it. \n\n5 people at our table and they brought out each dish one at a time with several minutes in between. Who does that? \n\nWaitress disappeared when it was time for the check, the manager finally brought it over and finished for her. While we were eating we saw another party waiting at the door for their check. \n\nFood was great if you don't mind bad service.","useful":1,"funny":0,"cool":0},
{"review_id":"a-uRLTjIb_xkuBTl7xwIBg","user_id":"ee2TBx44LC4zILdjq6ulvg","business_id":"RRpHuoXpxcuLk4LdB_YrOg","stars":2,"date":"2015-01-19","text":"I work on the strip and thought this would be a good lunch time activity. Range price is only $10, but it's small and if there are tourists (or anyone) shooting machine gun or rifle, it's really really loud. \n\nStore is pretty good if you can find what you want without help. Almost have to beg someone to help at the counter. Told one salesman the gun I wanted to look at and he immediately goes into how I should get quality since my life may depend on it.\n\nTold the salesman I just want a gun to shoot paper and something my wife can shoot. Not carrying, concealed or going to a war zone. Just want to buy a first gun to see if me and my wife like it and want to do more. \n\nHave to get quality and something dependable, ME: So your store sells undependable crap? They don't, but I should get the expensive one. (paraphrasing).\n\nTransferred from an online store something they don't even have in stock, never carry and never will. Went there during lunch and a different salesman acted like he didn't really didn't want to do a transfer, it showed and he made it clear. \n\nSmall old run down range, 2 or 3 good salespeople if you're lucky to get one of them. If I go there again it's for something quick and painless like something that's on a rack or if their ammo is on sale. \n\nDefinitely for the tourist and not locals.","useful":5,"funny":0,"cool":1},
{"review_id":"BdmDckjhQT0BO5F6DqXB9A","user_id":"ee2TBx44LC4zILdjq6ulvg","business_id":"9fBwxdHyJRS1nLkMJ8cavw","stars":5,"date":"2011-02-10","text":"Thanks to yelp! Otherwise I would have not found this place. The service here is great and fair prices. I watched two other customers pay for their service and they both seemed happy when they finished. As soon as I walked in, another customer asked if I had been there before (no) and immediately started saying how fair the prices were and how great the service was. This is NOT a franchise. The owner is there everyday at the front desk and most of the time you deal with him direct. Incredible place and they deserve all the support and great reviews they have.","useful":1,"funny":0,"cool":0},
{"review_id":"KROBjMn63cogXmvoUTyhGA","user_id":"TSfeZ_2RTfWQVoW6jTcbcA","business_id":"BGGQOJQTQerEQu0kHbT_UQ","stars":1,"date":"2014-02-20","text":"Service was TERRIBLE!  Told us we had to wait 35 minutes even though we had a reservation!!!  3 of 4 of us were there (ontime) and the 4th person was running late.  The hostess said they wouldn't sit us without the entire party so they cancelled the entire reservation and put us on a waiting list for 35 minutes.  The hostess was rude and didn't even tell the party that was there on time that this would happen.  Unacceptable and unbelievable!  Never has this happened to me at any restaurant ever...","useful":0,"funny":3,"cool":0},
{"review_id":"Y8Pt3uac5y0XqBtybtl1yw","user_id":"u-iEwnRvS3LU4yT7gZ2cYg","business_id":"k3usuzYs_UVBkSgUbmthdQ","stars":5,"date":"2014-06-30","text":"I spent half my life eating food in New York and needless to say I am extremely picky ... I have never had a better Greek meal in my life ... Oh did I also mention that my mom's maiden name is Staros ... OPA ... They also have live music at noon for lunch can you imagine! Tomas may you have a great success in your restaurant fabulous! :-)","useful":1,"funny":0,"cool":0},
{"review_id":"CMTpWyXQATDmxq1UpBWz6Q","user_id":"C_uuAr96DOVBbRlyrs1A3A","business_id":"aO1gAp41n8w8zpxTiHdLNA","stars":1,"date":"2017-10-07","text":"The food was terrible!! Do yourself a favor by going somewhere else. There was literally nothing that my husband and I liked that we ordered! Collard greens and Mac n cheese were by far the worse I've ever had!! Smh! 1 word... disappointing!","useful":0,"funny":0,"cool":0},
{"review_id":"gy5Ow9UsqA47z25xUGVRBA","user_id":"0OzEB4pkvWZqLThmKcJhJw","business_id":"4yGrrjIS0gu5gYAUIFU3fA","stars":3,"date":"2012-09-24","text":"So, interestingly enough, I was reading the reviews that the food was good (or great) but the service was terrible... honestly, I had just the opposite experience. The food could have been a lot better (I mean, the soup was almost cold), and the pasta flavor was very bland, but our waitress, she was a delight! If I remember correctly, I think her name is Jane (though memory could betray me). She was on top of her game- she is the only reason why I gave this place a 3 stars and not one.\nShe made appropriate suggestions, was fast in processing our orders, and had a very pleasant personality. I sincerely hope Mimi's Cafe improves their food, otherwise, because in the restaurant industry, it's not just about the service or the food, it's about having the best of both worlds!","useful":0,"funny":0,"cool":0},
{"review_id":"0Y5UkDNquGnmYEYSwObb_g","user_id":"0OzEB4pkvWZqLThmKcJhJw","business_id":"cHdJXLlKNWixBXpDwEGb_A","stars":5,"date":"2011-05-25","text":"The food in this place is indescribably awesome! Granted, the place could be nicer, but if you're in the mood for great food without the frills of a great looking place: this is it. The service is fast, friendly, and the prices are great- especially knowing that their portions are typically huge. I can't finish my plate most of the time, so I always end up taking leftovers home. \nI love their Jade Red Chicken, as well as their emerald chicken. Their black beans are to die! Order a combo plate, if this is your first time here. You'll get a good mix of everything and you'll leave without regrets!","useful":1,"funny":0,"cool":0},
{"review_id":"A0J-5WCdQRySuhvsI0yBcw","user_id":"SRRwRR-nmaNMaLAxgWJ2vw","business_id":"GEHnzX7BQwIsn8nt6wt7pw","stars":4,"date":"2015-10-23","text":"Mellisa is such a pro at what she does!!! I have been here for my deep conditioning treatments and I can't believe the wonders it's done for my hair!!! Would highly recommend this place!!","useful":0,"funny":0,"cool":1},
{"review_id":"fGHAiTCz5UnlwNtIS2BZWw","user_id":"BxdgakJg40DnngWpnV6JxQ","business_id":"V1cWGBZLQLyIiyo0iUOnyg","stars":5,"date":"2015-01-23","text":"~~~~~Brilliant! ~~~~~~  \nLove this place.  That was the best Mocha Latte I have ever experienced.  There truly is a science to making a good cup of coffee.","useful":0,"funny":0,"cool":0},
{"review_id":"aEbllGuk_qRmgFoOOLJC1g","user_id":"BxdgakJg40DnngWpnV6JxQ","business_id":"ms8tG7Co_ELSSGhbOL6HBg","stars":5,"date":"2015-06-10","text":"Very good food.  I ordered the hibachi chicken with broccoli and steamed rice.  Actually ate there since I live on the other side of town.  Service was very friendly and accommodating.","useful":0,"funny":0,"cool":0},
{"review_id":"7J-sjp8lucv3_UyHrYTgOA","user_id":"BxdgakJg40DnngWpnV6JxQ","business_id":"krlBwPboTImWFS1xwPr70Q","stars":1,"date":"2015-06-10","text":"Met a friend during lunch hour and it took forever to get a hibachi dish and some sushi.  The server came across as if we were bothering her.  All her attention was on the 6 top next to us.  The food itself was alright once we got it.  We basically had to trip the server to get her to give us enough attention to ask for the check.  It surprisingly took no time to get our money but she got no tip from me.","useful":0,"funny":0,"cool":0},
{"review_id":"HgN9ILW0OlO2slSlw_sEDQ","user_id":"t7nyweM_ab0200l6tSfvrw","business_id":"iT_z6pzoK1AbqaBrDbXhlQ","stars":1,"date":"2017-02-05","text":"We love this store but the hours! Closed at 7 pm on a Saturday? It's a grocery store!! Even their Yelp page says they close at 8 pm - I checked before coming. Came there 3-4 minutes after and they \"slammed the door in my face\". :( While I write the review I see lots of people stopping by and leaving!","useful":1,"funny":0,"cool":0},
{"review_id":"ECjvgMRNKYukmhYArutcNw","user_id":"D3ndEv4orRZHTPs_oclEuQ","business_id":"mseBBgYcqyv6T1sfrXI-XQ","stars":5,"date":"2017-03-29","text":"Amazing food all around. The steak sandwich is scary good; burgers as fresh as you can get. Steaks and salmon? OMG what a meal. You gotta check this place out.","useful":2,"funny":0,"cool":0},
{"review_id":"owvRxzELI9QUR-6B0JtSIQ","user_id":"D3ndEv4orRZHTPs_oclEuQ","business_id":"xI7GN5nujGjlYF9lAMtC1A","stars":1,"date":"2015-08-05","text":"The food is horrible and the service worse. Not bad people, just not very capable.  Slow and 'Houdini-like'. The food itself is very average.....typically the TK chains have cute girls behind the bar...  This place is all dudes in skirts. Don't waste your money here","useful":0,"funny":0,"cool":0},
{"review_id":"EliPa_-m2OGWbqLW2AZB4w","user_id":"D3ndEv4orRZHTPs_oclEuQ","business_id":"ESzO3Av0b1_TzKOiqzbQYQ","stars":2,"date":"2016-12-12","text":"Two stars b\/c Sara our server was uber-professional and spot-on. It started off with the dual hostesses pointing our 6 top group to a booth in front of the door on a freezing night but the table across the aisle had 6-8 coats hanging on the hooks for our booth and we couldn't get in. We asked for another table and were treated like idiots for even asking such a stupid question. After openly scoffing and scowling at us we got another table. Right next to a group of a dozen 7-8 year olds who had no adult supervision and ran around screaming and throwing shit around the room. We actually pulled our tables back from them to give them more running room. After all this crap the food came out and was  - meh.....\nOur server was great to us and embarrassed for the restaurant itself...\nStay away from this place...there a ton of better places in the Waterfront","useful":0,"funny":0,"cool":0},
{"review_id":"gbqLHi5HXiHzVKoZzxKy6A","user_id":"D3ndEv4orRZHTPs_oclEuQ","business_id":"T-OuUSSzWgrMCv9TUX3epg","stars":3,"date":"2015-03-18","text":"Good food, cold drinks at reasonable prices. BUT.... there's only 1 cook and 1 bartender. The bartender has to sling drinks and food to the entire place so service is extremely slooooowww.........","useful":0,"funny":0,"cool":0},
{"review_id":"7YNmSq7Lb1zi4SUKXaSjfg","user_id":"e3s1x4LLqfSkRTWDy_-Urg","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2014-06-04","text":"Best steak in Vegas. Best mashed potatoes in Vegas. Best French restaurant in Vegas.\n\nMAKE MAKE MAKE RESERVATIONS!\n\nDecided to leave this place as our last meal in Vegas and I wouldn't want to have it any other way. Our server made our experience 10x times better. He was extremely attentive and friendly. He knew when to stop by and when not to. He knew what to recommend and to describe how everything was prepared. I will never forget asking him what the special of the night was and how well he described it that I had to ordered it. Beef Wellington. Unfortunately, they had run out of it. So he recommended I got the filet mignon, as this is what the restaurant is well known for. I do not regret listening to him. The steak was cooked perfectly. Medium never tasted so good. My brother had the filet mignon as well but his was with mashed potatoes and mine with fries. I ended up leaving him without mashed potatoes because they were too good for me not to eat them off his plate. They were creamy, fluffy and soft at the same time. \n\nNo wonder this place is always packed. \n\nThey will definitely be seeing me again.","useful":3,"funny":0,"cool":0},
{"review_id":"PVUBB9M9bM-vH9NSWKI1_A","user_id":"e3s1x4LLqfSkRTWDy_-Urg","business_id":"l_GV0hgEoTUf70uJVT0_hg","stars":5,"date":"2014-06-04","text":"Can you please open on of these in NYC?!\n\nI fell in love with this place. The food. The service. The ambiance. Even the location was perfect. \nIt's away from the Vegas strip which can be a bit too loud for one to enjoy a nice meal but at the same time its so close to Fremont St that has a lot to offer. The restaurant is located exactly across from the back of the Container Park, which by the way everyone should go to. \n\nThe wait time here is tricky, it depends at what time you show up. But don't be taken back by the amount of people waiting, every second you wait will be worth it once you go in and eat. \n\nThe menu is very basic, but everything sounds great and if you are like me you will find yourself looking at other table sot see what people ordered. So everywhere I turned everything looked amazingly good. For appetizer, we had some biscuits with strawberry sauce drizzled with confectionery sugar....TO DIE FOR. As soon as we took a bite of the biscuit we knew that we were in for a good eat. \nFor main course i went for the pancakes with an apple sausage and my brother and mom went for the breaded steak, yes STEAK. When they ordered they missed the part that said steak so when they went in for the cut they say that it was not a fried chicken breast, it was steak. And holy moly was that a big piece of steak. Both of them could of ate from one plate. The steak came with two eggs and potatoes. As to my pancakes, it was a simple dish, but boy were those pancakes huge.  They gave me three I only ate one and a half. I couldn't do it. And let's just say that for the price I did not mind not being able to finish it all.","useful":1,"funny":0,"cool":0},
{"review_id":"3cYhVDEA4TZOiCEqzoJaEg","user_id":"e3s1x4LLqfSkRTWDy_-Urg","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":4,"date":"2014-05-13","text":"I think two people or even three could eat off one entree. The portions are humongous and the price is very reasonable. Something that caught  my attention was the decor, as it matches the theme of the restaurant. The staff is friendly, but should try accommodating guest better. They have these fans on at all times plus the AC, so even in Vegas weather, it is really cold in the dining area. We asked if we could change tables and it was like if we asked if we could leave without paying. So we just decided to stay were we were, and even though our food got cold due to this we enjoy our meal and took the leftovers.  Overall, make sure to come hungry and ready to take a bag with you.","useful":1,"funny":1,"cool":1},
{"review_id":"QdADjvqCmPhtlYjt-ByB4g","user_id":"YZzihhhMh7m60yfhqDTHDQ","business_id":"EILgTvvIAquMcIFzjAtWbQ","stars":5,"date":"2016-02-11","text":"They are a family of friends,this place will treat you as one of there own.They are fast,convient,and a team of professionals. I would recommend any one who wants polite and prompt service.","useful":2,"funny":0,"cool":0},
{"review_id":"SlYJDs7eVns2tA9fVG71SQ","user_id":"A-pgy4ki7ieILzzJUQKjlw","business_id":"tkoCC_N3EOTV3yc_QIcnxw","stars":5,"date":"2013-12-18","text":"John was fantastic! I called from California to have a balloon bouquet delivered to a casino for my granddaughter's 21st birthday. He was so helpful and friendly that I knew I had the perfect person to fulfill this birthday request. Yay!","useful":2,"funny":0,"cool":1},
{"review_id":"mYbPnr8zp4Ot5Z9SeThd-g","user_id":"Dpyal9p7-E1HJgcRixQLdg","business_id":"GXDRFAunLh0aRao6ERnM4A","stars":5,"date":"2006-05-17","text":"Ever since dining at Francesco's while on vacation in Vegas, I salivate just thinking of the Veal Parmigiana.  My boyfriend and I shared the Veal that was served just like a Pizza (almost bigger then a small pizza and flattened out encrusted in Parmesan).  It melted in your mouth and had the perfect flavor.  For our entree, we also split a nightly pasta special (seafood cavitelle) which was also incredibly good.  For startes we had the grilled calamari, goat cheese salad, and bruschetta to start with.  The calamari was our fave of the 3 apps.  The ambiance was very warm and charming yet upscale.  It's like you are in an Italian Villa.  Highly recommend!","useful":2,"funny":0,"cool":0},
{"review_id":"3xcHzDR02_BgzAD7iouczg","user_id":"Dpyal9p7-E1HJgcRixQLdg","business_id":"t-o_Sraneime4DDhWrQRBA","stars":5,"date":"2006-05-17","text":"After staying at the Wynn in Las Vegas last week, it'll be tough to want to stay elsewhere during my next visit to Sin City.  The hotel is elegance at its finest.  It evokes a warm feel though due to the colorful tiled floors and flowers everywhere.  I especially loved the fresh floral arrangements at registration and in the lobby of the resort elevators (changed daily) and was an enormous array of the brightest, freshest, flowers.  Walking the esplanade at the Wynn only offered me dreams of being able to walk in Chanel, Louis Vuitton, and their fine shoe store 'Shoe In' and not being alarmed at the sight of a $700 pair of heals.  It was however fun to dream.  We never had the chance to have dinner at the hotel but we had brunch at the Terrace Point Cafe which was delicious and I was also satisfied with my ahi tuna salad by the pool.  Our room was incredible.  We stayed in the resort room which offered an incredible view of the strip with floor to ceiling windows.  I loved the flat screen television in the bathroom (which by the way was bigger than most apartments in NYC).  The service was good and I loved all the extra little touches (foot mats placed on either side of the bed during turn down service and the carpet floral patterns on the luggage carts!)  Highly recommend but prepare to pay!","useful":0,"funny":0,"cool":0},
{"review_id":"IoB1SgZK_V7FqNTKoGbFvA","user_id":"henMrYRPN5slVJLnDqH9mg","business_id":"FhZ7QinEr-VRGyVgktWKXA","stars":5,"date":"2017-08-31","text":"Jay Rizzo gave me an awesome tattoo that covered an ugly birthmark on my upper thigh. I walked in on Tuesday and he made an appointment with me for the next day. Great guy to talk to, super down to earth. And most importantly, kickass artist. Shop is clean and nicely decorated. Played classic rock while I was there. I discussed the tattoo with Jay and gave him a reference and he did the rest. very happy!","useful":0,"funny":0,"cool":0},
{"review_id":"_IY5U8fm0u32KffmVMpnWg","user_id":"aGAszsIYy9IutQe2bIYu9g","business_id":"ubpfIf6qT2vIDQaPC_2GGA","stars":1,"date":"2017-12-02","text":"Pizza arrived DRY and meat was burned! It was so bad it made me finally make a yelp profile just to vent out my dissapointment!","useful":0,"funny":1,"cool":0},
{"review_id":"x7QcEPvjdmOU3ANCMufqPw","user_id":"BJ2l-d2Y3icaefL6IhT4UA","business_id":"Qx36_lVL-nPThPRzk9VGag","stars":3,"date":"2016-07-12","text":"The girls show no love for couples. The girls look good and are very young. I'm assuming new strippers as they are almost all pre-tit jobs. (don't expect big tattas) I'm not sure what their deal is with couples; maybe they are too new to realize there is great money to be made and are scared the female will have jealousy issues. For Pete's sake, she's in an all nude strip club! The girls actually try to work the pole and it's a great place for men by themselves, but the customer service from the staff (I helped another unknown female patron from throwing up all over the place. I was annoyingly waved off by their staff Wtf??!) and the girls themselves is non existent. Hundreds would have been dropped, but they never bothered to approach us on two different - months apart visits. Their loss.","useful":3,"funny":1,"cool":0},
{"review_id":"_B8JwnP-4_sbfem3yTzmPw","user_id":"Ykj39u44FN3IQTA4mV0Z_w","business_id":"V9klA6JGT6Fz2UpVP_7sBw","stars":3,"date":"2010-12-01","text":"Recpetionists and  waiter assigned to our table deserve 5 stars. Very accomodating, warm, and service-oriented. \n\nWe came for a Thursday lunch, slow day for the restaurant. Price was reasonable. Food selection  limited. Food presentation appeals to your senses. However, the taste was more of on the salty side.\n\nI thought that the \"so-so\" menu selection and food quality was going to be compensated by the excellent service of the staff. However, our dining experience felt disappointing towards the end.\n\nI was making my way back to my table after using from the restroom.  After walking by one of the servers (her name is pronounced A-chi), who was at that time bussing dishes, I heard her say \"Hi!\" with a high tone of voice, somewhat arrogant, not friendly at all. She asked if I was looking for something. She kinda mellowed down with the tone of voice after she found out that I was a customer at the restaurant. That was really so disappointing!!! I just felt discriminated. Not a good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"6Lm03qjEJkEcNU6KefMTyw","user_id":"iq1eijunn_UMj-CxVtp88g","business_id":"U9gft0DrH35TzGELhFhPuQ","stars":1,"date":"2014-08-17","text":"Stopped in for a quick lunch while running errands in the plaza and notice this new place and so decided to check out if they have an a la carte menu. They did. The server gave me their folded printed menu (same as their take out menu).   And while I looked thru one of the servers pointed out to me that the daily and lunch specials on the back of the menu.  And on that same page I notice they also put \"15% off. For any purchase with us! Cash only. Expiry date will be informed in advance\".   The food was okay, not great. And so when they gave me the bill I asked for the 15% off as I will pay cash.  The server then told me that the discount special does not apply to the daily and lunch specials. I asked if it is expired they did not say so before \"in advance\". She said \"no\" it does not apply to the specials. WHAT!!! The same specials that is printed on the same page just above the 15% off notice does not apply.  I pointed out to them that it does not say that on the menu. So I just paid my bill and walked out. Not worth arguing over the stupidness of how they plan their printing as I do not plan to return to this place.   How do I add a picture to this review so you can see their menu.","useful":0,"funny":3,"cool":0},
{"review_id":"3hFaB-opZFtouTx0xf61vA","user_id":"mpevsuFzO_vhsCUGCuFl8Q","business_id":"-2ToCaDFpTNmmg3QFzxcWg","stars":1,"date":"2014-11-08","text":"Wish I had read the reviews before paying my money. Booked a shuttle (have to prepay), shuttle never showed, then when after waiting 15 minutes I called they told me it would be \"another 5 or 10 minutes) and acted like they couldn't understand why I wanted a refund. Of course the person on the phone told me I had to talk to \"customer service\", which is a voicemail machine. Go out of business, showtime.","useful":0,"funny":0,"cool":0},
{"review_id":"4v1G8grJox3wKiiK_pSxhA","user_id":"07zMjxhOL38_-qDxdi-Yww","business_id":"q3XMIMigTpYS0m_myxavfQ","stars":1,"date":"2010-05-27","text":"May 27, 2010\nWhat a TERRIBLE experience.  One of the boys that worked there sold me the wrong part - after a while, a pool guy sent me back to get the right part. I went back and was told the boy doesn't work there anymore and \"what's in the past is in the past\". \nUnbelievable. \nSo, they slapped some old parts on my Hayward pool vac that the guy got out of his garage.  (I kid you not) And to rub salt in the wound, I had to pay $60 for more replacement parts.  As I was paying I asked \"so no apology? - no discount?\".  The guy said nope.\nSo, those of you living in Morrison Ranch - you have been warned!\n\n(Looks like someone jumped back into Yelp with a GLOWING review to offset my real review.  Pretty obvious when it shows up the same morning.)","useful":5,"funny":1,"cool":0},
{"review_id":"FzJ6PuqJz_ofQdKiq-vwDQ","user_id":"0Trr4R0YddNTt_6bkznjdQ","business_id":"PS6MUV_adG5JH3SZ4e_sCQ","stars":1,"date":"2011-05-02","text":"I bought a sausage dish here and a chicken parmesan, and the food was barely edible. Actually, it was downright horrible and ruined my night. And the guy behind the counter wasn't all that nice to boot. Sorry guys, just being honest.","useful":1,"funny":0,"cool":0},
{"review_id":"xO8L93zYOQRlCorxxTpx8A","user_id":"b3hTeO5wUI0cBMxjVy8EkA","business_id":"GUL13B_eJMX2b2JnN1kckw","stars":5,"date":"2017-10-23","text":"Very happy I brought my iPhone here for repair!! Cesar did a great job!! Very professional and fast!!!","useful":10,"funny":10,"cool":6},
{"review_id":"jabVrwGZ8IaBAeaNLCVK9w","user_id":"Q-bs3IUYlLz2_tBwjp-TMg","business_id":"uzslagEIM-bByNAGg8_3FQ","stars":3,"date":"2015-10-24","text":"I really loved living here, but when it was time for me to move and put in my 30 day notice, the manager refused to take my written 30 day notice.  The manager asked me when I wanted to move,  I told him the 3rd of the next month.  I had the letter in hand 30 days before moving and the manager said you dont need to give me the letter, I'll remember.  Unfortunately, he didnt recall saying that, now I didn't get my full deposit back, only $145 of the $614.  MY FAULT FOR NOT GETTING ANYTHING IN WRITING OF WHAT HE SAID AND SIGNED.  BE CAREFUL AND LEARN FROM ME, GET IT IN WRITING, DONT EVER ACCEPT A VERBAL AGREEMENT WHEN MONEY IS INVOLVEF.  From this experience, I will DO BUSINESS BETTER and always make sure to get any agreement in writing and signed.","useful":3,"funny":1,"cool":0},
{"review_id":"xiUY5h2Km6bfI5hjWuh9kQ","user_id":"H7r8fC_b18U8uxq-676lKQ","business_id":"zBD6zc8YU-TA0_KJmN1tpA","stars":5,"date":"2012-08-10","text":"YUM! Ordered the XL pan crust 1\/2 Hawaiian & half pepperoni w jalapeos & I have to say it was easily the best pizza I've had! I also had a coupon for a free 12\" cheese with purchase of the XL and even though in not generally a fan of thin crust, it was just as delicious! \n\nPhone service was friendly, helpful and the pizza arrived on time! \n\nLooking forward to ordering from here again!","useful":1,"funny":0,"cool":1},
{"review_id":"8TzlAmvZT8Cv-PQvUagq7A","user_id":"H7r8fC_b18U8uxq-676lKQ","business_id":"8qAtou9A4ksXGkjyLibWDg","stars":1,"date":"2012-10-23","text":"Bartenders are awful here. How are you working as a bartender downtown and NOT be able to make a mojito?? Also, the attitude behind the bar was very unpleasant and unprofessional. Spend your money else where!","useful":1,"funny":0,"cool":0},
{"review_id":"-He3TOvBZi6Kp-p-7DyrXg","user_id":"3V-iHN_dQXTnwJjYB41Jcg","business_id":"qiMilr-2OUsoyXdF-KQAsA","stars":1,"date":"2014-11-21","text":"Two years ago, October of 2012, I sought out treatment from Dr. Collin Udall.  He saw me immediately which was nice.  He diagnosed my condition, then said to do a follow up.  The follow up he changed his mind and said he misdiagnosed me and to take more pills.  I was in excruciating pain.  He ignored my calls and wouldn't return my voicemails. Long story short it took a total of 10 doctors and two years to finally figure out what was wrong, and Dr. Udall could've figured it out if he just would have tried. He'll kick you to the curb.  He doesn't care.  Go somewhere else.","useful":4,"funny":0,"cool":0},
{"review_id":"iYzTYzwTIv55_dOBbx1XOw","user_id":"3V-iHN_dQXTnwJjYB41Jcg","business_id":"YMhCCB57L3uLFDv8ut76fA","stars":4,"date":"2013-08-22","text":"I came across this gym when I bought a groupon that included boot camp classes from this gym.  At first when you walk in, you do notice the equipment is outdated.  But the main trainer is one of the best I've experienced.  I felt it was ideal for beginners and those who have experience training.  \n\nEvery boot camp class was different and I attended 3 a week. Different music was played each class, so it was never the same.  Each boot camp class had different exercises so I was never bored.  We worked on every aspect of exercise, core, cardio, weight training, stretching, etc.  The teacher did go back and forth from English and Spanish which I thought was considerate since both Spanish and English speaking people were attending the class.  \n\nOne of the things I noticed was since I had bought a groupon, the trainers at the gyms I attended are notified you're a groupon buyer, almost like a label, and didn't show as much attention to me as they did to others.  As a groupon buyer you're not paying full price so it can show from the place you're at they won't give you full service.  At this gym this wasn't the case.  On two different occasions I was the only one who showed up for the boot camp class and instead of him cancelling he provided 1 on 1 personal training.  He was basically working for free but trained me like a full paying customer.  \n\nBottom line he's an excellent trainer who knows his stuff and cares about everyone that walks in the door.  The gym may not be the biggest or the newest but that's nothing in comparison to receiving quality training.  And that's what you'll get at GAP fitness.","useful":0,"funny":0,"cool":0},
{"review_id":"lZCp5NxJGq0rMKBLc3Rgfg","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"a6mYyhGgxWhnhrGDHzOTPA","stars":1,"date":"2011-04-27","text":"The Big Cheese?  I'm sorry, but this place should really be called \"Fries and Gravy\". \n\nThere were hardly any curds.  I'd give it 4 stars if the big cheese served big cheese, but they don't.  I heart poutine.  I hope they pick \nup the slack.  That is all.\n\nEDIT: You can order extra curds for $1.25.  You need to add curdsx 3 to make it reasonable.  Makes a small poutine about ~$11.  You decide.","useful":3,"funny":2,"cool":0},
{"review_id":"9mpeQDMUr4BdScm-0frZxA","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"JcR-zY-wT42QWsD3f5NzRA","stars":5,"date":"2011-02-28","text":"Great place!  I'm very picky about stylists, but the one I booked with was also the owner & he did a fantastic men's cut - very good skills.  As for female stylings, an acquaintance of mine had one of the best hair transformations I've ever seen.  It's actually what prompted me to check the place out in the first place.\n\n It's a fairly new place & feels like you've found a hidden gem when you walk in.  I won't be surprised if this place is overrun with business in a year's time. \nAs it stands there are no other reviewers, kind of strange.  So check it out ppl & post a review.","useful":7,"funny":0,"cool":0},
{"review_id":"ktBGtT_wq-IjS3WVBEM2Lw","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"W64ewTH4tk_d5feUseZqFQ","stars":5,"date":"2012-02-02","text":"Amazing cafe.  Some of the best espresso and food in the city. Period.","useful":0,"funny":0,"cool":0},
{"review_id":"RwuznDNVrTQ15SFMCKfvVg","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"uuSviSjm_dR2K30C_2_STQ","stars":5,"date":"2011-04-15","text":"Awesome smoke house. Check it out after some chinook shopping. \nNow open evenings.\n\nSuper cheap, super flavorful.  If you like Palamino or Bookers, you have to try this place because it just might edge those places out.","useful":0,"funny":0,"cool":0},
{"review_id":"xz0GqVZNjlGy3LgNljW2yA","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"QSxoFIwUQojKDlUsToyqOw","stars":5,"date":"2011-03-01","text":"Being a big fan of spicy fare I have tried all of the mexican restaurants in the city. This is the best one. But, but, but there is one caveat...you need to know the secret. \nThe secret is hiding in the impossibly big menu. Get the MEXICANA COMBINATION!  That's it. It's huge, it comes out in a reasonable time, & it is the best Mexican meal in the city.  You will be very satisfied after this one.  I opt for the mole (pron: molay) over the tomato sauce as well.  For spice, throw on their red AND green El Yucatan habanero sauces that are sitting at the tables. Careful with these though, they are quite flavorful, but unforgivingly hot. Unless you have an iron stomach, go easy the first few times cowboys & girls.  You'll see what I mean. \nThey also happen to have some very nice tequila kicking around ;)\nI have gone here 2 nights in a row on several occasions.  (Just make sure you walk in & they see you when you first get there so you're seated right away.)","useful":2,"funny":0,"cool":2},
{"review_id":"UjB3ujgLsZW79x2CPFpfvA","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"Gj7QZ0kV-32MAVhJQsWlmg","stars":5,"date":"2011-02-27","text":"This is a great, nay the best, place to grab pitas in downtown with more than fresh ingredients - including spinach :)\nThey recently moved 2 blocks away to 1508 4th Street SW.\nThis is just a block north of 17th ave sw on 4th St.\n\nFollow @pitapiton4th on twitter to get in on their deal list too  :D\n(Just like @Charcut's alley burgers.)\n\nJS","useful":0,"funny":0,"cool":0},
{"review_id":"x7pukugpsbEAXehN5OPOlg","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"ROLZFKRsPbXrSQ8C14eSXg","stars":5,"date":"2016-11-14","text":"Simply Fantastic!! Friendly atmosphere, unique workout style, and lots of fun!","useful":0,"funny":0,"cool":1},
{"review_id":"o8x5HzX4bI0JS68mvS1A0w","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"UPD8FCmyKk0hOeNCcNy_wQ","stars":4,"date":"2011-04-18","text":"Seeing as the only review here doesn't really cover anything but a bad experience with the entrance staff, let's get down to business & get a real review going *ahem* here are the basics: \n\n- It's a great gym with the best equipment I've come across.  That said I enjoy speed & power training.  So the track and plethora of strength equipment are fantastic.  I really enjoy the hammer strength brand machines, they are just the most solid machines out there with the best ranges of motions.  The free weights are amazing & rarely am I waiting on weights.  The one thing lacking: kickboxing bags.\n\n-Swimming pools, hottubs, and a yoga room - with free classes are also here.  I rarely use them, so somebody else should review these.  \n\n-It can be busy, but people are quite accommodating and will share equipment; make some friends ppl :) \n\n-The staff will teach you basically anything for free & there is some serious experience kicking around.  Some not so experienced too, so just be choosy, as always.\n\n-I'm only giving it 4 stars because it is a huge facility and lacks a certain social or community atmosphere.  It is what you make it, but the size of the facility can be a bit daunting at times.  That said, for coming in and getting your workout done, it can't be beat.\n\n-I've been going here as one of my gyms for 3 years.\n\nJS","useful":2,"funny":1,"cool":0},
{"review_id":"M-5XDfm0W2OmAActTMv93w","user_id":"LIV6TiZSTWnRJKBZGnZuRQ","business_id":"jKNdXLQtVM7FJIi_tmuszQ","stars":5,"date":"2011-05-01","text":"Carly's Angels!  This is the real reason we're here.  Every Saturday night the house is packed and a hilarious drag comedy show takes place.  I have been twice in the past 6 months and have been thoroughly entertained.  \n\nAll I can say is if you are even remotely interested, you need to go.  The energy & comedy that goes into the shows are fantastic.  You will not be disappointed.\n\nA great place to go as a couple, couple of friends, birthday party or stagette.  If you're a larger group, it may take a few months to book in so make sure to call.\n\nTickets are around $60 for the show & do not include dinner & drinks.  That said, the drinks must be kind of part of that because a 1 litre of Newcastle beer was only $6 :D  So they encourage you to go and get plastered...alllll right :)\n\nAs well, the restaurant will be changing to Salt & Peppers mexican very soon, so the food is about to get a whole lot better.  I have never had the food here because it is sooooo not about that.  It's about having drinks with friends and watching the Angels!   A lot of audience participation too.\n\nOne more note...this show, somehow is really funny for people of all ages (18+ due to the comedy content).  Very very funny.  GO!","useful":2,"funny":0,"cool":1},
{"review_id":"s42QavC7N7ZaJdSgiaLB3Q","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"ALn_0f-Usn3n0a9WBcjhhg","stars":4,"date":"2015-05-20","text":"Went to Hanny's at 9:00 p.m. and had drinks and a meal - with a party of seven.  We were seated immediately, but the place filled up and was busy by 9:30 p.m.  Service was slow, but in defense of our waiter, he appeared to be handling about half of the tables.  Food was excellent.  We ordered three pizzas: carne, prosciutto, and blanco.  I love meat, and assumed that the carne pizza would be my favorite.  It was great, but the prosciutto was better.  This pizza is every bit as good as Bianco's, if not better, and you can get in without being made to feel like the object of condescension.  Finally, they have a five dollar martini that was excellent.  (Don't forget to have the donuts for dessert.  They are good - but I think in the past they were better.)  My wife had the beet salad which was a little light on beets and heavy on arugula.  Otherwise, outstanding food, even the \"onion strings\" that we had as an appetizer.  (Oh, and the atmosphere is very cool, from the elevator shaft, to the lighting to the old signs.)","useful":2,"funny":1,"cool":1},
{"review_id":"efXwJ_Gnpges9Yt-NtLCRg","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"QaRXXPfmcLmrPmLB2DKO3A","stars":2,"date":"2014-10-27","text":"I have been twice, each time for a chili dog to go.  It's an easy order, but the first time it took almost ten minutes, despite few customers, and the second time about half as long.  Both times an employee asked what I was waiting for, and only then did they find my order.  I was not the only person that waited, on each occasion, for an inordinate amount of time for an order.\n\nThe first time a manager felt bad about how long I had been standing there and \"comped\" me some fries, which I threw away because they were soggy and just gross.  The second time, despite ordering it to go, the chili dog came in a basket to eat \"in\".    \n\nThe chili dog had onions on it (nobody asked if I wanted onions) and the cashier was effectively hidden behind a stack of styrofoam cups. The chili dog was slightly better than a 7\/11 product, but at almost triple the price and with a long wait.  Another customer had a gyro, which looked appetizing, but I am not sure I will be back to try it.    \n\nI was hoping for someplace where I could grab something to bring back to the office but it doesn't appear that this is the place.  Huge space, with a small crowd (five or six employees or more, and approximately ten or fifteen guests).  Until they improve how fast the food gets out, the crowd will dwindle even more.","useful":1,"funny":1,"cool":1},
{"review_id":"2FZ9xE3lsdBo_MW9UGaa8w","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"ElWzx5_fU8S2G45OnM-HpA","stars":4,"date":"2015-10-11","text":"Need to come back to give it five stars!  Great service with attentive staff.  Sat outside with a few flies but not bad.  Inside looked great and outside was perfect for having grandkids with us.  All of our dishes were well received: hash, breakfast chimi, hamburger and baked cauliflower.  I don't like cauliflower much but this was delicious.  Baked with lemon and still crisp it's a must try.  Burger was good, fries better.  Pancakes weren't bad.  Toasted brioche was good but could use a second egg. Prices were acceptable with a bottomless mimosa for 18 bucks. We'll be back.","useful":2,"funny":0,"cool":0},
{"review_id":"FxZEO_mPXse1gthC073jSQ","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"mZCUht2OMoTpa8XnppWYpw","stars":4,"date":"2013-08-11","text":"Outstanding knowledge of cruisers, mountain and road bikes.  I have been to all of the other bike shops in town and Joe and his crew are the most knowledgable.  If they don't have what you need they will order it.  And they will even send you to their competitors if you are desperate for parts. Great selection of cruisers and an improving selection of road bikes.  They now carry a great selection of Cannondale  road bikes.  Looking for baskets and cruiser saddles, look no further.  The only drawback is a lack of more items for road bikes.","useful":3,"funny":1,"cool":1},
{"review_id":"eglv75DQe8P2ws5n8B0-5g","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"NPiLy71qqXzb45k9eQOgCQ","stars":4,"date":"2014-11-05","text":"Mondays are best at Maizie's when they have their signature burger on sale.  The burger is a good size (half pound) for sharing and comes with lettuce, tomato and onion and your choice of cheese. Any other time get the inside out burger - a burger stuffed with blue cheese.  My favorite.  \n\nAnd whenever you go, have the wingless buffalo dip. Good cheese with chunks of chicken and lots of spice served with chips and pita bread. It is required eating. \n\nFinally, Maizie's has beer and wine specials that go well with their menu.  There are a couple of tv's that always have games on and the service is usually pretty good.","useful":1,"funny":1,"cool":1},
{"review_id":"3-23k2A3R5ZpL4QIBnt07g","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"GAKFx4jFUtTOTpp_jDJnuA","stars":4,"date":"2014-11-08","text":"Great place to try out all the brews made by Phoenix and Sonora.  I recommend the flight  and just ask your bartender or waitress for suggestions. They are very knowledgeable about beer. Pick George's brain for beer information - he's a walking encyclopedia of beer. (For younger patrons, an encyclopedia is like Google, but on paper).  The tasting room is just that - clean and welcoming.  \n\nWe had the Phoestivus last night, which is a slightly sweet ale with cinnamon.  Very Christmasy.","useful":1,"funny":5,"cool":1},
{"review_id":"lwInYPtM4M2jfAftXk-xlA","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"zJGtD3y-pAIGNId4codEEg","stars":4,"date":"2013-08-11","text":"We've been to Otro many times. Stick with the tacos or the chorizo and egg dishes.  They are consistently delicious. The margaritas are good.  The guacamole is good and sometimes excellent and the chips are crisp.  We have had one bad experience there but the situation was immediately addressed by a manager and the bill was graciously adjusted.  Service is usually excellent and the atmosphere is cool. Sit at the bar and watch the bartender make drinks - it will give you an appreciation for how hard thy work and what goes into some of their drinks.  Didn't care much for the paella but on the whole we like just about everything else.   (Sit away from the west facing windows in the late afternoon as it is hot!). This is a perfect place for a casual dinner. The background noise is low so you can enjoy conversation and the food.","useful":1,"funny":1,"cool":1},
{"review_id":"UdR0mkx4oeb-bP6voR00og","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"vM92DKxz5XJGm6Q5brHuGA","stars":4,"date":"2015-05-23","text":"Went at 4:00 on a Friday afternoon. We had two little girls with us and the bartender was great, got them lemonade and cookies and popcorn.  I had a great ale, while my compadres had a flight of red wine and a flight of white wine. Prices are ok, with a special of buy a flight get a flight for half off. $22 for a flight with some pretty tasty wine from Macedonia (although not all were great). Excellent atmosphere and a good crowd. Even thought the prices are a bit high compared to other happy hours we will go back.  This would be a great place for later in the evening.  Just beer and wine and a very limited food menu.","useful":2,"funny":1,"cool":1},
{"review_id":"w_IQR7fGO8ESiFy69oNyEg","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"H7_yu7MgzSXB0vb959yXdA","stars":5,"date":"2015-09-07","text":"Objectively: $93 for an 8 oz filet (with a potato cake), salmon, Brussel sprouts, and a carafe of wine. Plenty of food for two people.  Subjectively: great.  The steak had a fantastic sear on it with a peppery taste and the meat was done perfectly, still juicy and tender. The salmon was moist and flaky.  I even liked the Brussel sprouts that were shaved and toasted.  (And I don't like Brussel sprouts!).  The potato cake had but one problem - too small.  Otherwise a near perfect tasting dinner.  Del Frisco's is an anomaly - hardly ever packed but turning out some of the best food. This steak certainly was on par with Durants and Donovan's.  (The ambience is in keeping with a \"grill\" and could be changed to make it a more intimate setting.). The carafe was a good deal at $19 and gave us almost four glasses of wine.  Enjoy!","useful":0,"funny":0,"cool":0},
{"review_id":"nc4fSi7Bf8OpI2F0NnNtKQ","user_id":"BjmYO90f7e7oiwyoffC82w","business_id":"5BKP0DY4K79h9sd7THpeBw","stars":5,"date":"2011-11-14","text":"Warm atmosphere, smiling faces and cold beer!  Oh and a great menu with excellent food. Try the meatballs and the mignulata. Very delicious. Pizza choices include tasty standards like sausage (from local favorite DeFalco's) and more trendy tastes like fig and goat cheese. I wish it was closer to home. We would have our own permanent table!","useful":4,"funny":0,"cool":2},
{"review_id":"zTmBL-Tmt-mvkJZHGCM8Eg","user_id":"keRVVnBpykXOD-uC7rDj-Q","business_id":"a2ZBDIXmwBm7IWnXR6LK-g","stars":5,"date":"2015-04-11","text":"One of our favorites restaurants. Slightly higher priced than some restaurants but definitely worth it.  Portions are very generous and food is fantastically flavorful.  Nice ambiance too, think casual elegance.  The rice is the best anywhere around.  They also have some additional unusual varieties of rices for those who want to be adventurous. The multiple protein plate options on the menu give a nice variety.  The koobideh (spiced minced meat kabob) is so delicious here.  Something really nice is that you can get koobideh as a side order to an entree which is a great deal and allows you to try multiple things. If you have not been to the Persian room definitely make it a priority to experience this wonderful place!","useful":0,"funny":0,"cool":0},
{"review_id":"iReJ7BMwhHdWoGpMathpNA","user_id":"keRVVnBpykXOD-uC7rDj-Q","business_id":"PlTdQdCWu2_hjbSuenB3pg","stars":4,"date":"2015-01-14","text":"Great customer service.  We had to wait a while for our dessert so when we asked how much longer they apologized for the wait & said it was on the house which was really nice. Then when we went to pay they had taken the drinks off as well for any inconvenience which shows they really care. Food is good. Macaroon ice cream sandwhich was great. First time trying Pandan flavor ice cream and highly recommend it.","useful":0,"funny":0,"cool":0},
{"review_id":"Nf9rOb7RLwIVnm_Wg6nsfA","user_id":"keRVVnBpykXOD-uC7rDj-Q","business_id":"hPfszfTC6xu9Ysd3sIHm8Q","stars":4,"date":"2015-04-11","text":"Really like Kawaii for multiple reasons. We first tried this place with a discount offer and it happened to be during happy hour. They were happy to honor the discount on the happy hour specials too which is something we appreciate as it shows they are not petty and that they care about customer service.  We ordered some extra stuff because of this just so they did not lose money on us. Their kindness payed off with good karma. \n    We have been back several times and had sushi rolls.  However, my husband does not like seaweed so ask the rolls to be made with soy paper instead.  They were happy to do it and did not charge anything extra for it unlike many other sushi places that will add an extra charge. Once again we really appreciate the customer service. \n     Another thing they have is a Sunday brunch all you can eat sushi offering. This is unusual in Arizona and love that they do it. Going out for sushi can often add up quick no matter were you go and for what a few rolls might cost you could do all you can eat at Kawaii during Sunday brunch.  Now they do limit the sashimi to 4 slices of each type of fish but no limit on rolls or nigiri and furthermore it includes for no additional charge some appetizers and drink options as well which makes it a nice experience.","useful":2,"funny":0,"cool":1},
{"review_id":"AWbLQdVZI0K93sjG2gO21g","user_id":"keRVVnBpykXOD-uC7rDj-Q","business_id":"n2tiSHECXkFv47aIkxvSDA","stars":4,"date":"2015-04-11","text":"Enjoyed Greektown.  Much better than other Greek places around that we have tried.  Did feel it was just slightly overpriced compared to portion but food was quite good. \n     I love cheesecake and was a little surprised they had a cheesecake as an option for dessert and it is clearly home made because they were baking it and had to see if it was done before we could order it. It was an exceptional cheesecake but also a little different than the usual cheesecake.  Guessing there is Greek yogurt in there but not sure.  Anyways, delicious!  \n     This is a family run place so in my book that is a plus.  We left payment and tip on the table and left.  Next thing we know the owner George comes out into the parking lot to catch us to say thank you and goodbye.  Most places would not do that. Clearly shows they care.","useful":0,"funny":0,"cool":0},
{"review_id":"qUgjAHcu575T8AvVun0ibA","user_id":"U_SbWcSZRLfkvZt3jshKJA","business_id":"N5mcKKdcmwirw1bFhE80Sw","stars":5,"date":"2017-03-22","text":"Ambience on point. Location is prime. Friendly yet knowledgeable service. Some may think the food is pricey but the quality is definitely fair for the price, not to mention killer happy  hour specials.","useful":0,"funny":0,"cool":0},
{"review_id":"j-JdkqFsHkBPJp5NzRo_iQ","user_id":"U_SbWcSZRLfkvZt3jshKJA","business_id":"aow8T0EAFdYDXmVAUO5aFg","stars":5,"date":"2016-05-26","text":"Drive through health conscious food? Count me in. Delicious salads and wraps. Even tried a juice and was impressed. Will continue to drive through!","useful":0,"funny":0,"cool":0},
{"review_id":"aNIPAlsp_cO1VhyP8ReJ7g","user_id":"U_SbWcSZRLfkvZt3jshKJA","business_id":"y9hgPwF68tpWEp6onX-3TQ","stars":3,"date":"2017-10-26","text":"I wanted to give this place 5 stars the beer is great and the ambience is on point. However service is just too slow. On a Thursday night it took 12 minutes to order a beer and 12 minures to close my tab. I can't recommend unless you visit during slow hours.","useful":0,"funny":0,"cool":0},
{"review_id":"i_TbaED2p81PpPxhOx9TQw","user_id":"EzUsZ5Jg9788uXGBDGc4_Q","business_id":"GIfZNMP0oIJCje_Xp0Bgrw","stars":5,"date":"2017-04-06","text":"If I ever willingly come back to Cleveland, it will be for the Brussel Sprouts at The Greenhouse Tavern. Service was fantastic (Thanks Kevin!), and the aesthetic? Lovely. I thoroughly enjoyed everything I tasted--duck confit wings, Brussel Sprouts (pan fried in a maple reduction--amazing), and venison bolognese (a little spicy but alotta tasty). For dessert, the pot de creme is a must. If I could give 6 stars, I definitely would!","useful":0,"funny":0,"cool":0},
{"review_id":"PYt1RqKV76DAQwf5JU2aNg","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"-AD5PiuJHgdUcAK-Vxao2A","stars":4,"date":"2012-03-13","text":"Have been to several other \"Best of LV .....\" burger joints and always disappointed. Not here! Fresh, tasty, hot food :) Restaurant is always clean. Personnel is always friendly & professional. I will return and return and return.","useful":0,"funny":0,"cool":0},
{"review_id":"nj8eOlWY8WgYGiSkna1Hnw","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"-m3NzRyob88MzE5jZPnsUg","stars":5,"date":"2012-12-18","text":"Per my previous reviews of Sew Little Time anyone can tell I am a fan. This time I asked Amelia & David (owners) to professionally embroider my grandson's initials on a stiff\/thick nylon duffle bag. I asked that the font and thread color match what was already on the bag -- it is perfect! And it was done lickity-split in time for mailing for Christmas. I have a home-style embroidery machine and was afraid my machine and I just weren't experienced for the nylon fabric. I am very glad I asked them to do it, and I will be back for professional embroidery -- and all the other goodies offered at their store.","useful":6,"funny":0,"cool":0},
{"review_id":"7da75TgJe0p33EWvj727Vg","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"czyhvf93Txsfxdxqcm16mA","stars":4,"date":"2012-03-13","text":"Recommended by my husband's co-worker, and I am very happy with the suggestion!  My husband gets something different every time, but I always get the shrimp w\/snow peas.  Love it!\n\nFriendly service, clean restaurant, large portions -- and it's fun to watch the chefs prepare the food.  We will go back again and again.","useful":0,"funny":0,"cool":0},
{"review_id":"2703Xc4dK6fKoiqFDg6PBA","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"o112Vh27kc6jryoWXwxmpg","stars":5,"date":"2012-03-16","text":"I've been going to Straight Up Tanning since last summer.  They offer different levels of tanning beds, plus spray tanning, and a red light therapy that is suppose to help skin look younger (haven't tried that yet).  The personnel is friendly & professional; the shop is always clean; the hours are most accommodating.  I can't imagine dropping my membership.","useful":0,"funny":0,"cool":0},
{"review_id":"AL78ODUS8EKH4SPTaUFSWQ","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"zGmYWmI8_srQh7Pk06cVsA","stars":5,"date":"2015-05-13","text":"This was the second time I had called Stanley Steemer here in Las Vegas, and the 4th or 5th time ever. The crew did an excellent job. They were on time, polite, and professional. They worked very hard on our new puppy's stains on the carpet, plus cleaned the tile and grout. I am very happy with the results, and will call again.","useful":0,"funny":0,"cool":0},
{"review_id":"BmZw5F1I0zgS5X8y_hxZfg","user_id":"ku7E8KD7Us0-MGqOoTVX4A","business_id":"K5XjxDyq3ZIjUhbtLaW4ZQ","stars":5,"date":"2012-04-28","text":"I've been back to see Li'l Kim several times -- happy happy happy! While she was on vacation, I saw Lisa. She is very, very good, too. I am definitely a \"regular\" at Polished. Darn good salon!","useful":0,"funny":0,"cool":0},
{"review_id":"NqSEfaDFCGNJ8vDCBDwkGw","user_id":"yYPVkp1qJBK6zrqB1HKBeg","business_id":"9WOyQM8u3lMfmQiACpW5pQ","stars":1,"date":"2015-06-25","text":"This clinic is slow.    The doctor wanders about like she is confused.   Poor customer service.    \n\nDon't use walk in clinic.    If you want to see this slow doctor you need to be a patient.   Very disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"8wqInnJn7ZGtEr0TurQMQQ","user_id":"RI1rMKoC851c8z2VnD5j6A","business_id":"qUfaMjN_45EuIlMrPhB_bw","stars":1,"date":"2014-11-14","text":"This company is horrible. I ordered some plastic business cards and it took them almost 2 weeks to even put them into production. Then when I finally received the order the colors on the card were so much darker than the actually proof they sent me to approve. Is this company is very cheap in price and very, very cheap in quality. There customer service is on the bottom of the barrel. They did not try at all to rectify the problem. They wanted more money to fix the problem that exist with there poor quality printing. PLEASE BE AWARE STAY AWAY ITS NOT WORTH IT!!!!!!!!!!!!!!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"dWRAOPblzJj1Vlmyu0t-aQ","user_id":"AuZ2j0xvc6AOVApQsV-CKQ","business_id":"SzI7eYjq0hMEqQlWh3UYpQ","stars":5,"date":"2013-06-13","text":"Incredibly fun event (although make sure to put on sunscreen, I got totally burned)","useful":1,"funny":1,"cool":1},
{"review_id":"8huwxPsv3JvwwtEqmETOOA","user_id":"KpV8_I9vLBCbrG-d5ED2FQ","business_id":"jqAdZf9PJo8lsRskc6T1Sw","stars":4,"date":"2016-05-30","text":"Large restaurant close to Old Town and Arts District of Scottsdale. Very good traditional Mexican food.  Two kinds of salsa and chips.  Large portions.","useful":0,"funny":0,"cool":0},
{"review_id":"MrYBbWD-cT08FBpNohEnoA","user_id":"KpV8_I9vLBCbrG-d5ED2FQ","business_id":"VyVIneSU7XAWgMBllI6LnQ","stars":5,"date":"2016-05-30","text":"Just finished a terrific dinner at this great barbeque restaurant.  From the sangria, frozen lemonade and cornbread to the baby back ribs, mac & cheese and coleslaw, it was all excellent.  Service was friendly, portions were generous and food was out very quickly.  The free take away bag of sugar donuts was a wonderful end for a delicious dinner.  Even at 5:30 on a Sunday night the restaurant was full and a reservation helped us to be seated promptly.","useful":0,"funny":0,"cool":0},
{"review_id":"VcdZKQnY9CTViBXfcHCyqQ","user_id":"XrF7b8Ru-J-rl9z62ABezw","business_id":"a2leVC69VaflWRREkr7RNg","stars":5,"date":"2017-10-23","text":"Shane came out to fix our garage door problem.  He was was very courteous and a hard worker.  However, a week later we had the same garage door problem.  This time another technician came out named Andrew.  Equally courteous, worked hard and was very knowledgeable.  He was very thorough in explaining to us what he had done.  He fixed the problem and there was no additional charge.  I would definitely  use A1 garage door repair again in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"9FoXFauR5H_i8nXIdLBZtg","user_id":"1oCH03guW5bqwvLrCEuVwQ","business_id":"OARQDsxyoGnnX2FfSl9HjA","stars":5,"date":"2012-10-17","text":"I really love this show! It delivers the WOW!-factor with all the Cirque-type amazing aqua-acrobatics, and keeps you entertained the whole way through. Seriously, the performers were doing twists & turns & jumps & moves I didn't even know  was humanly possible. The diving segment was my favorite. Hats off to all the amazing performers!! \n\nA little tip about the seating..... The venue is an intimate circular theater, with the circular pool in the center as it's stage. There are only 12 rows of seating, so yes, basically every seat has a great view & you really can't go wrong. The first 2 rows are considered \"splash zone\" ($105\/seat), the next 9 rows (Rows 3-11) are Premium seats ($129\/seat) and the last row (Row 12) is the VIP\/Dream seats (ranging from $155 to $195\/seat.).  I have sat in the 1st row (splash) and 5th row (premium) and can honestly say I much preferred the premium row. I'm not discouraging the splash zone seats because of the threat of getting wet.... In fact, I only got a sprinkle of water while in the first row (if even that)! The reason I suggest the premium section is because this show has SO much to see and by sitting a bit further back, you'll be able to take in more visually.  There is also a lot of the acts happening high up (way high up, from the ceiling).... and I found myself straining my neck to see all that was going on up high, whereas you could view it all at ease sans the neck strain if you were in premium:)  Also, I don't think it's worth it to get the VIP\/Dream seats.... other than it offering a super plushy comfy chair (and champagne & choco covered strawberries) , one of the perks to those seats is that it includes a video monitor in front the seat, which I heard is streaming you live feed of all the backstage and underwater action during the show, but believe me, you'll have so much to watch on stage, I don't think you want to waste your time watching the monitor ;)","useful":12,"funny":2,"cool":2},
{"review_id":"NL962rUtScGC0rJxFQ-vWQ","user_id":"1oCH03guW5bqwvLrCEuVwQ","business_id":"vUJdxpjbcI-1esW2QFHSCA","stars":5,"date":"2013-02-26","text":"BEST SHOW EVER! \n\nThis show has such an amazing energy! I didn't know much about Frankie Valli & the Four Seasons before watching this.... but you don't need to. You will be amazed at how many of these songs you will recognize (& love!), and the story is told so well, with AMAZING performers delivering impeccable vocals, dancing\/choreography & acting.... that truly bring you back to the era, like you are right there livin it with Frankie! It's moving. It's captivating. You will leave the show with a huge smile on your face, a hop & skip in your step, and you will NOT be able to stop humming all the fabulous songs in your head for days! \n\nJust a few of the HITS that will get stuck in your head: \n- Sherry\n- Can't Take My Eyes Off of You\n- Big Girls Don't Cry\n- Who Loves You\n- Oh What a Night! December 1963\n- Walk Like a Man\n- Bye Bye Baby\n- I've Got You Under My Skin\n\nQuick tidbit on seating:\nJB has been at \"Paris Theater\" since March 2012. It's a bigger stage & venue than when it was at Palazzo (where it reigned from 2008 thru 2011). Other than size, another difference is that this new theater does not have a balcony. You are either in the front half (Orchestra section), or back half (Mezzanine). When I got my tix, I was told that the last row (Row M) was only 75 feet away from the stage, implying that even the last row has a good view of the stage. I ended up getting seats in Row K (third row from the back), and they were right! You still have a great view of everything. :)\n\nI've seen JB twice, and can't wait to see it again!!!!!","useful":7,"funny":0,"cool":1},
{"review_id":"sBcq7cMTRWzivpuVaGgIOA","user_id":"1oCH03guW5bqwvLrCEuVwQ","business_id":"pyqnGlIfP9Zw8LLxBjyAiA","stars":5,"date":"2013-02-16","text":"Lucky Las Vegas!! Now you have 2 NOBU's gracing your city! Congrats to Chef Nobu Matsuhisa and his business partner, Robert DeNiro (!!) on their beautiful newest creation..... NOBU at Caesar's Palace, LV!  \n\nFirst, a few fun facts:\n- The official ribbon-cutting was on February 2, 2013 \n- Of the 29 NOBU restaurants, this is the largest location worldwide! \n- The NOBU Hotel, a \"boutique hotel\" which is next to the restaurant (both in Caeser's) is the first \"NOBU Hotel\" ever! It has 181 rooms, and even features a number of suites with up to 5 rooms. One of these days, I WILL stay here.... the pics of the rooms are gorgeous...and get this, 24-hour availability to Nobu in-room dining room service. Eeeep! ;)  \n\nNow, back to the restaurant. You are greeted with an elegant entryway filled with origami birds overhead. Just past the check-in desk, you get a full glance of the beautiful modern & trendy main dining room filled with artistic lamps that look like floating jellyfish. There is a bar and lounge in the front area, sushi bar on the left side, and then the sea of seats filling the rest of the open & spacious layout. There are a variety of different style of seats to accommodate all different sizes of parties..... small tables for the romantic couples, larger booth tables (both circular and square), and secluded tables (in nest-like booth areas) for more private larger parties. There are also secluded areas for the teppanyaki grill tables. Overall, the atmosphere is warm and inviting, which sets the tone for the amazing food you are about to indulge in.\n\nNow, onto the FOOD! Below are the dishes (mostly signature favorites) that me and the hubby had.... Each one was fabulous, and extremely satisfying....!!\n\n1) Yellowtail Sashimi with Jalapeno - $28   (a MUST HAVE!)\nsix (heavenly!) thinly sliced pieces of yellowtail, with an even more thinly sliced piece of jalapeno on each. In a light ponzu sauce, and coupled with a piece of cilantro, this combo melts in your mouth and leaves you wanting more. This is my FAVORITE dish. I bet 99% of the people who get this are thinking \"should I order another round now or later?\" as they are finishing off this one ;) \n\n2) Black Cod w\/ Miso - $34 (a MUST HAVE!)\nSo succulent & tender....every bite of it literally melts in your mouth! Don't \"pass\" on this one, thinking once you've had a good black cod, you've had em all. NOPE! This one is amazing & you should believe all the hype about it!! The sauce is light & sweet, and I just have a STRONG feeling you will not be disappointed :) \n\n3) Kumamoto Oysters with Nobu Sauce - $18 (a MUST HAVE!)\nThis comes with 3 oysters, each topped with a different garnishing (maui onion, \"las vegas\", and jalapeno). If you have a party of 2, I strongly suggest you get 2 orders so that each person can have their \"own\" trio :) It was super fresh n delicious! \n\n4) Rock Shrimp Tempura - $24 (a MUST HAVE!)\nOK, so per our server, this signature dish usually comes with either the Creamy Spicy or Butter Ponzu sauce.....but Exec Chef Thomas Buckley (who was brought over from the Miami Beach location) decided to throw in a 3rd sauce choice... Jalapeno! We couldn't decide between the butter ponzu & Jalapeno, so our server offered to bring it out not tossed, but with the 2 sauces 'on the side'. I suggest you do this, as both sauces were amazing and I think you can savor the flavors more with dipping rather than having it mixed in. Served on a bed of micro greens which also tasted good with the sauces. \n\n5) Spicy Miso Chips with Big Eye Tuna - $16\nThis was tasty but I felt that the plum sauce was a bit too sweet and overpowering. Would have loved this if the sauce was more subtle... \n\n6) Pork Belly Miso Skewer - $14\nIf you love pork fat, this is your dish! Comes with 2 skewers of incredibly butter-like pork cubes. Tasty, but again I thought there was a lil too much sauce.  My hubby thought it was delicious though!\n\nDessert\nWe went with one of the most popular picks -- The Bento Box - $15\nFlourless chocolate cake, with white chocolate sauce, shiso syrup, and house-made green tea ice cream. Delicious and the perfect way to wrap up a wonderful dinner experience. \n\nI'm already thinking about when I can go back again. Maybe Nobu will consider his next venue in the Bay Area? SF and San Jose would love one!!!!! :oD !!","useful":20,"funny":1,"cool":11},
{"review_id":"K5HiCXGJK0KiHhDRiS2u-Q","user_id":"1oCH03guW5bqwvLrCEuVwQ","business_id":"_w5hBpkjHs5_Hv3pLeHtIw","stars":5,"date":"2012-11-25","text":"Julian Serrano is amazing! I would give this 10 stars if that was an option! \n\nInitially, I didn't even want to go here..... because my first impression was that it was going to be tiny servings with a fancy bow & big $$$ tag, that would leave me still hungry for more. Boy, was I wrong! Every dish ordered was prepared and cooked to perfection. Bursts of flavor, fabulous presentation, reasonable portions, and just overall a wonderful experience for the tastebuds. Love the decor & ambiance too. \n\nBelow are a few comments on the dishes I will be crawling back for :) And please note: I did not try all of the below in one sitting. The list includes dishes tried on 3 different sittings :) \n\nMUST HAVES! \n- Tuna Cones - this was my favorite dish! I wanted another order! But btw, i think it's only available at dinner. I didn't see it available on their lunch menu :( \n- Stuffed Piquillo Peppers - so delish! especially if you like goat cheese & mushrooms. Was my second favorite dish! \n- Ahi Tuna Tempura - maybe because I love both Ahi Tuna & Tempura, but I thought this was just scrumptious\n- Tuna Raspberry Skewers - a nice twist of flavors. \n- White Ceviche - this ceviche was divine! My only complaint was it was a bit heavy on the lime, but then again I'm just not a lime fan ;) \n- Spanish Chicken Croquetas - kinda like fried mozzarella stick, but with chicken & creamy bechamel sauce! I really liked this. Note: I luv creamy\/cheesy stuff.  \n- Grilled Lamp Chops - very tasty & tender\n\nGOOD!, but nothing to scream about: \n- Wild Mushroom Soup - again, it was really GOOD! but I would prefer getting a second order of something above if given a choice :) \n- Lobster Salad \n- Lobster Saffron\n- Beef & Cheese\n- Padron Peppers - i felt like it was a bit too salty (this coming from someone who LOVES salt!) Also, it's probably more ideal as a sampler dish for a large party. For my table of 2, I felt like I had enough after a few bites, and felt padron pepper'd out by the time we finished the plate :op\n- Brava Potatoes - don't get me wrong, it was delicious. but as it's a pretty filling dish, i just felt that these were not out of this world, and I'd rather fill up on one of the many other tapas choices they have to offer\n\nOverall, it was so delicious. Can't wait to head back here soon!! :oD","useful":5,"funny":0,"cool":3},
{"review_id":"uv96_JOYOomOpYp3SlHvxQ","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"kffcRahETLKXjY6j3DkHpA","stars":5,"date":"2014-01-29","text":"These two know what they are doing.  Superduper friendly and helpful, committed to transitioning habitual and chronic smokers to e-cigs.  They sell vapes and juices (70\/30 pv) that are produced in Canada at reasonable prices, and their 'tasting bar' is a great idea (don't worry you get yer own disposable mouthpiece so its all hygienic) which allows you to sample out of the fifty some flavours they have.  The mint is boss - tastes just like a menthol.  \n\nPrices are alright - there's tons of juice variety and more economical 'deals' to be had online for those willing to look, but meet and greet these guys and you'll want to give them your business - the customer service angle and genuine enthusiasm these guys give off is infectious and makes me want to support their growth.","useful":6,"funny":0,"cool":2},
{"review_id":"f1nIrbOQds7tm8F2AfmaBg","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"N93EYZy9R0sdlEvubu94ig","stars":4,"date":"2014-10-13","text":"Go and try it - the food is delicious, you won't be disappointed.  \n\nThat said - it's Banh Mi.  Go to any mom and pop Banh Mi shop in the city and the sandwich is $2-3 tax included.  Here it will set you back $8-10.  My 4 stars is for the pricing of what in Vietnam is a humbling and cost friendly experience of cross cultural fusion.  At BMB it's just a little too pretentious for my taste.  Everything is delicious, but you're paying for an environ designed to cater to the Western consumer.  I suppose you cannot blame them for their business sense, but it just rings off inauthentic. \n\nAmazing kimchi fries, even if it's a day's worth of calories in a bowl- you gotta get those.  Don't get it as a side on your own unless you are morbidly obese or like to throw away food.","useful":1,"funny":0,"cool":1},
{"review_id":"dweyW4AaTypY490qTzefDQ","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"uF86ZhygpBEGr3CudNemYA","stars":2,"date":"2014-09-23","text":"Went to O.Noir using a Groupon recently.  Restaurant Groupons are something of a scam.  I get that I am supposed to tip on the full amount - I can do the math - the 'non-negotiable' automatic 15% tip on the total INCLUDING tax is ludicrous.  Given this was not disclosed in advance or on the Groupon, it's also not legal.  A gratuity is a gratuity, and I would have given my host Nasir a larger tip given the option to set my own bar.  Smart businesses know that customers are marketing vectors and correspondingly treat them well, even if they are there on a deal.  Unfortunately, O.Noir is pleased to rely on its position as a novelty experience rather than stand behind its food and service standards to drive more customers through the door.  Their prerogative I suppose, but it can't be good for repeat business.\n\nI was also charged a random $15 dollar charge 'for using a Groupon' which was not stipulated anywhere on the deal.  This is truly what made me feel cheated and left a sour taste in my mouth.  My bill was identical to what it would have been without the deal = lame.  The wait to pay for said bill post-meal was crazy - they could use a more streamlined payment system (two operational tills would be nice).\n\nThe food itself was hit or miss - drink prices weren't outlandish, though considering you're apt to knock one over, this is a good thing.  I had the steak, which was great - my girlfriend had the shrimp\/risotto, which was way oversalted and overdone to the point you could patch drywall with it.  The atmosphere is what you are here for, but even blind you can feel banquet style chairs and inordinately tight spacing with other couples\/groups.  Your other senses heighten and you end up hearing a lot of other peoples' conversations very audibly, and I happened to be seated next to the most vapid and inanely redundant human beings in existence, rendering the experience even more unpleasant.  Guests in our room almost got in a blind fistfight over somebody using an indiglo watch for a second, which was entertaining in a Jerry Springerish sense.  \n\nThat second star is for the host Nasir - he's a righteous dude.  Too bad given my experience it's unlikely myself or anyone I recommend restaurants to won't get to experience his charm.","useful":1,"funny":1,"cool":0},
{"review_id":"PW7dQda3gK4eKG21ONn_vw","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"JvBgXc-64WXGy1Ud5otrww","stars":5,"date":"2014-09-23","text":"Had a new stereo installed in my Mazda Protege - $100 with all parts, brackets, connectors etc.  Not too shabby.  To my chagrin, Robby accidentally disconnected my heater when installing, so I called, brought it back in - he immediately got to fixing it and 5 minutes later my car was warm and toasty again, free of charge.  That's what service is all about.","useful":1,"funny":1,"cool":0},
{"review_id":"dFfsPVpjMuFX1kIGaRYFZA","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"kBQkdV4l1u7m9XPozHFWQw","stars":5,"date":"2015-12-14","text":"Jan is cultivating a culture here.   Every vape shop has a tasting counter, but they are all about processing customers - try, buy, next.  Jan's definitely selling mods, coils, and juice, but EBV has perfected the chill lounge model.  It's like Cheers for Vapers, building a community of practice and appreciation for tobacco counterculture to such an extent that the 'store' concept feels decidedly anticapitalist. \n\nWhich is why, perhaps, the Eastern Bloc brand is so apt.  At EBV you're not working with a disillusioned teenaged vaper getting paid minimum wage - you're working with a guru.  A vapor sommelier.  Somebody who is genuinely invested in your interest in vaping.  If you are looking for mod build tips, ideas, an incredible tasting bar with some of the best juices on the market (not just proprietary homebrew BS), or, most importantly, a place to just hang and vape with some great company you've never met before, Eastern Bloc is a must.  Go now.  Sit, vape, and be merry.","useful":4,"funny":0,"cool":0},
{"review_id":"3-ro-oSZ9naImz8LwlTPDA","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"Jo3Cpvf8fpfcAIFG3TagbQ","stars":4,"date":"2016-10-13","text":"I love this place.  The birthday singing thing is kitsch, and pretty annoying because it happens so frequently (6 times my last visit), but the food at Pantheon is really good.  I have been twice and have not been disappointed.  The dips combo plate is amazing, though I would ask to switch out the Taramosalata if you don't like caviar, which is too fishy for my taste.  Their pita is fantastic, and their seafood is out of this world.  Saganaki amazing, horiatiki is not the best on the strip, but passable.  3 people ate and had an alcoholic bev for $90, and had leftovers for another meal.  If you're hunting for the most authentic Greek food on the Danforth, you could do a whole lot worse.","useful":0,"funny":0,"cool":0},
{"review_id":"FfyjFECyLWl5pXmDcd3MgQ","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"sRirP65Q7BSg3Lj9FdkKWQ","stars":4,"date":"2014-09-23","text":"Great roti, albeit not the Caribbean kind; if that's what you're looking for go to Pat's.  Their day-old rotis are awesome value at 6.99 and weigh as much as a baby.\n\nService is always great and friendly.  Beware the spiciness of this place - people who cannot take spice should specify milder than mild and not get the day-olds as they are chaos spicy.\n\nThankfully, I like chaos.","useful":0,"funny":1,"cool":1},
{"review_id":"84ebY_KorNt8jBjvXYebWg","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"jIMuSdcZspFK6bXsf7XwsQ","stars":3,"date":"2014-09-23","text":"This used to be the best gyro in town, and that includes the Danforth.  The portions were awesome, and the value to quality ratio was off the charts.  Clean stylish restaurant, and some really righteous patrons.  I'm talking almost once a week visits, sinking almost $500 into this place over three years.\n\n...unfortunately there are new owners or something is going on as my last few visits I've observed a discernible downtrend in the portion sizes, and the prices have all been upped.  No longer can I get my 3 pc biftekia and chicken gyro with zucchini fries for $14 - it now comes out to over $20.  That's insane inflation for a standard pricehike and coupled with smaller portions does not make me a happy customer.  I had recruited a small army of people to repeatedly go here for Greek but will now need to find a new place that values the customer experience in true Greek fashion.\n\nIf you do go, by the love of all that is holy - get the zucchini fries.  They don't travel or keep well, but out of the fryer they are insane.  They, thankfully, haven't changed.","useful":0,"funny":0,"cool":0},
{"review_id":"kQr_oWhl1RogpE1W2_b6Wg","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"VU48dM-IpntaohboEvmfXg","stars":5,"date":"2014-09-23","text":"4.5 stars for a mechanic is unheard of.  People know nothing about cars and always feel hosed when they get the bill.\n\nWell that's totally different than my experience at Cam's.  My story of why this place is the best is too long to post- suffice to say, they went above and beyond to save me money with my repairs.\n\nThese guys know their stuff, are crazy honest, and will always, always get my business.  I happily give out referrals to Cam's to any and all that need auto servicing.","useful":0,"funny":0,"cool":1},
{"review_id":"4Z9GOnIZSCuCLnArBRoPAA","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"SW6ZQk22G1_CV81_gfnvNQ","stars":1,"date":"2016-10-13","text":"I've been to this place twice, more than once was a mistake.  When they were a street operation, albeit a semi-legal one, it was really cool, novel - people would line up for days.  The tacos were $3 apiece, and it was a unique and fun experience. \n\nEver since they got fixed locations though, I am very unimpressed.  I have slight hearing loss and the environment in this place is not conducive to any form of conversation - the music is all rap and hip hop and seriously and intensely loud.  I don't mind the style of music at all and am happy to eat tacos to A Tribe Called Quest, but at airplane-taking-off decibel levels? I was with a group and couldn't hear a word of what was being said, made me feel stupid and isolated.  Asking for music to be turned down was disregarded - 'this is our brand' was what I got in return.  Gross.  Service was slow and weirdly pretentious given the aesthetic they are trying to cultivate.\n\nAs per the tacos - overpriced and way small.  No lies, the cod fish is a decent two bites, but the carnita, cotija and beef cheek taste very boring - like more boring than ground beef with a 99 cent taco mix packet boring.  You could eat ten of them easily and still be hungry, which sets you back over $60 - the price\/food ratio is rough and both times I left hungry, poorer, and disappointed.\n\nThe cherry on top is that this place is run by misogynists who think it is funny to make taco puns at the expense of women.  They have done this multiple times, and I am certain will continue to do so despite overtures to the public.  But hey, it's just locker room talk, right? \n\nOn food quality, ambiance, and price, there are many, many better options for tacos in Toronto - I would skip this one.","useful":7,"funny":0,"cool":0},
{"review_id":"MGC4Hw_IHD-AfbqaIO0Iqw","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"ish_RZy4QsvA0JXiRaf_og","stars":5,"date":"2014-09-23","text":"I dig this place.  I had an issue with my handlebars sliding out all the time and brought it in for repair - the guys changed it out, but the problem persisted, so they replaced it again with a better quality part free of charge.  My bike felt unsafe and they made it a priority to keep me in one piece, for which I am thankful.  Great service, will use again.","useful":3,"funny":0,"cool":0},
{"review_id":"aPmCqgwFfv65fCUumzgemg","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"OIdOJaNS8M624F58XGV3PQ","stars":5,"date":"2014-09-23","text":"The pizza here makes me want to sing my favorite parody 'shawty fire burnin' on the Danforth'.  Libretto is great, both locations.  Value, service, and consistency.\n\nBetter eats than 95% of the other restaurants in the area.","useful":0,"funny":0,"cool":0},
{"review_id":"59fECYYtxiuNLv6mlL_nLA","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"q5xrVJ4kivx_yEfJeOKNYQ","stars":5,"date":"2014-09-23","text":"I don't know who is eating here for $31-60, but the food is well and truly phenomenal and worth every penny.  The service is great, the cocktails are delicious, and the food - whoa.  The bream ceviche was mindblasting, and the octopus was out of this world awesome.  Really, really, really good.  I only went the one time so I'm not telling you you need to get those things, but you certainly won't be disappointed if you do.\n\nAmbiance was okay - a predilection to play music a tad too loud like many restos catering to the young professional sensibility, which I don't get, but it seems the trendy thing to do.  Attracts annoying overpaid hipster patrons as well - the table next to us was a clamorous sea of forgettable vapid single women in their 30s that would repeatedly rupture into a crescendo of squeals: \"this song is about me!\" or \"I know the chef, ladies I know the chef - WHY ISN'T ANYBODY LISTENING TO ME?\" or \"Tamara is a super betch\" or new girl sits down at table, prompting sounds that could etch glass, despite it being said Tamara.  Etcetera.  If it wasn't for our neighbours, the entire experience would have been ethereally sublime.\n\nWe had the table closest to the door, it was winter, and it was crazy cold sitting there.  Don't sit there.  Still, despite being a complainer and loving all things complainy: 5 stars, hands down one of the more memorable culinary experiences I've had in the city.  Don't miss it, and book way in advance.","useful":0,"funny":1,"cool":0},
{"review_id":"hzTAxWZdSKBkgw4EHmeUpw","user_id":"fsUMORfhG2rwE7rX8uYmmQ","business_id":"QH8B92lZXtLwQV9Fdrpukg","stars":5,"date":"2014-10-13","text":"How has nobody else given Rose props for her amazing sandwiches?  My first time there she rather hilariously proclaimed her sandwiches would boost my libido and make me a virile sex machine.  The Banh Mi are delectable, massive, and cost $2 tax included.  TWO DOLLARS!  Where on earth do you find a deal like that in this day and age? $10 flat gets you 5 sandwiches, which will feed you for 3 days.\n\nThere are a gazillion reviews for Banh Mi Boys, with their inflated pricing and rather pretentious take on the venerable sandwich.  Their food is great, don't get me wrong - but there's no tradition, and you're feeding a hipster machine with good branding, location, and social media presence. It will also set you back $20 for one meal.  I urge you to save your money for Rose.\n\nRose does it right.","useful":5,"funny":5,"cool":1},
{"review_id":"w97Hn3Y8b_TRGd0DMEjqmA","user_id":"wVtjh7tAkiiLEcuCVe7oMg","business_id":"nNavjod8pAkEW7ZHeCyAbA","stars":5,"date":"2016-12-10","text":"Kyle and Mike did an fantastic job! No complaints at all! Super efficient and would definitely recommend this moving company to anyone in the Phoenix area! Thanks guys!","useful":1,"funny":0,"cool":0},
{"review_id":"QMsJ_8qjQhiuTszoLmRlxg","user_id":"wzDZOnFjL4FRUOfM_LSrkg","business_id":"Fpm3WvqtrAg2ueh_4pz7iA","stars":5,"date":"2016-05-19","text":"Delicious Pad Thai!  May not look like much from the outside, but it's worth going inside!","useful":0,"funny":0,"cool":0},
{"review_id":"1_QYClpX449AOmaeQMbLgA","user_id":"wzDZOnFjL4FRUOfM_LSrkg","business_id":"oJsfjG1uh6jopK6Kc-3pdQ","stars":5,"date":"2016-05-19","text":"I just moved back here and went to Cavo as part of a bachelorette party and had an AMAZING time!  We did have the luxury of a VIP section which was worth the money! It was so much fun to get dressed up and go out!  Classy place!","useful":0,"funny":0,"cool":0},
{"review_id":"_foTueQUN2FXKnbbU3TyWQ","user_id":"wzDZOnFjL4FRUOfM_LSrkg","business_id":"wY3dlpLa0BHfDENYAPYuZA","stars":5,"date":"2016-05-19","text":"Best food I've ever eaten!  Would recommend this place to everyone!  Can't wait to go back!","useful":0,"funny":0,"cool":0},
{"review_id":"hTzUghlJ2KV-mgzXGEeunw","user_id":"zQBIIm09mut6lHZYdBLC1w","business_id":"jniApOOS8ppUHhESL7OzTg","stars":5,"date":"2017-10-05","text":"This is one of my favorite restaurant in toronto !! I absolutely recommend this place for meal!!","useful":0,"funny":0,"cool":0},
{"review_id":"jRoQpsYu3i70PBBiPU9y5A","user_id":"QPq2-DCIWL2fRiBUm2MB8Q","business_id":"MZlpKHbWH5hBXhjaGFcezw","stars":2,"date":"2016-03-21","text":"The buying experience was pleasant however I needed to return an item I was mildly pressured into buying.  I presented the item with my receipt however they sold me the item without a tag. The gentleman who was helping me was pleasant however he asked another salesperson for help. She would not look at or speak to me and was quite rude.  I was only able to get store credit and once I use that I will never set foot in a Lucky Brand again.","useful":0,"funny":0,"cool":0},
{"review_id":"ioDAv--SGhSVzEX2Kdsa7g","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"gO_z_5FQVHLCiJjOsfE1fg","stars":3,"date":"2017-04-03","text":"I'm giving this place 3 stars only because the wait staff was good. The food and value were very disappointing. I have frequented Texas de Brazil and gone to Fogo de Chau and this place comes in at the very bottom of the bunch. The salad bar has no labels on 80% of the items- so anyone with food alergies beware. Everything was overcooked (mushy or dry). The extra items you order for the table were no better. Greasy spinach. The fried bananas tasted like deep fried mystery items. And the meats. 2 standouts- beef ribs and Tritip. Everything else was bland or overcooked. And the meats didn't all come out unless requested- and seriously- who is requesting Chicken Hearts??? And at $100+ for two people, no value for the expense.","useful":1,"funny":0,"cool":0},
{"review_id":"E2Ro5dLakhXx98-T7eoI4w","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"qmymSqVwHYRqdwfcBatzpQ","stars":4,"date":"2017-06-20","text":"Nice ambiance. Attentive staff. Knowledgeable about wine pairings. Flavorful food. Has the hummus and salmon. They were great. Friends split 2 meals- 1\/2 of the brick? chicken which was really good. The steak was just ok. Nice date night place- after you locate it that is.","useful":0,"funny":0,"cool":0},
{"review_id":"hRCzf0MMqQdT9FAHzrJ4nw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"jaSowNITPRRCYpPb3_pjdA","stars":2,"date":"2017-06-20","text":"I wanted to like this place. It's Restaurant week in Vegas and I look for new places or hidden gems. What I found were streaky windows, no ambiance and no taste.  Ceasar salad was overdressed and warm. The calamari was overcooked and chewy. Steak and frites were cool not warm and just bland. The salmon was good flavor and temp but the sides a throw away. I poked fun at the dated plating style but that wasn't really bad. The chocolate souffl was good texture but tasteless. The service asked how the entree was before either of us took a bite then only returned to clear. I debated a 3 rating but when you pay over $50 each for a dinner, I think it should be good- and this wasn't. Go follow DW to their new location at the Grammercy for flavor.","useful":0,"funny":0,"cool":0},
{"review_id":"Yhj3icEvGF0rf3TGZ1L6Eg","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"prHnRsgY-PuM7vxe8-RwEA","stars":1,"date":"2015-12-15","text":"Read the reviews!! This place is terrible!!! \nI ordered the safest items- fried rice and dumplings. Fried rice was old, slimy meat, over soyed, gross... The dumplings were not sealed won ton wrappers around a small amount of ... I don't know what. Did not resemble pork. I ate 2 bites of each and threw it out.","useful":2,"funny":0,"cool":0},
{"review_id":"8CgeYdSa85stuFEODdJx2g","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"sgOgvtcccFUlw2ggAOoXlQ","stars":5,"date":"2017-11-04","text":"Love how the doctor is always on top of all the technological advances! I've been coming here for years and always have the same experience- efficient front of house and knowledgeable, caring doctor.","useful":0,"funny":0,"cool":0},
{"review_id":"z2dq9-gPjCxgYy6vBYiAag","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"TT658qQinO6MBHP9q7rJ8w","stars":4,"date":"2016-09-27","text":"Food was good. But what was better was the service. I told the waiter about my shell fish allergy and he changed from their standard bread because it's heated on the same grill as their shellfish is cooked. Kudos. Good lookin out! Again, food was tasty as you would expect.","useful":0,"funny":0,"cool":0},
{"review_id":"QzBgW94i6N-kJRlij5FrCw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"SwAZBCyFtVo_8vkRbJhdkA","stars":5,"date":"2014-08-31","text":"A friend and I started with the Burrata... Really great char on soft crusty bread with chimicurri, creamy Burrata cheese and tomatoes. Yummy. Next we split the kale and corn salad before splitting the fried chicken. The food was all yummy. Splitting the salad and entree was super smart. The portions are large. \nThe waitress grabbed a seat with us to chat, checked in on us enough to be cared for and the perfect amount of leaving us to our  ourselves so we could talk. Loved it and will be back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"8qKc4g8OFA3E2MMypW2iSw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"szWfpLdcJVrpqVJQA3fhJw","stars":4,"date":"2017-05-04","text":"Stand up company. Totally helping me fix things with Groupon. Called me back after only 10 minutes of leaving a message. Knew the exact situation. I have faith it will be ok.","useful":0,"funny":0,"cool":0},
{"review_id":"kjkueCgjqtcOAkySqx6j0g","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"61qDFkNrHKzyA9n3dlgcEw","stars":2,"date":"2016-09-27","text":"The service was ok. Just ok. The food was subpar. The 24oz bone in rib-eye has about 8-10 oz of actual meat. So fatty. Cook temp was ok. Barely seasoned. The vegetables were oily. The mashed potatoes were fluffy and buttery- so ok except too few of them. The chocolate cake tasted like it was defrosted from frozen. The ice team tasted like the 99 cents store brand. Very disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"m0eO3358SKkzY7isf6kEpg","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"4VHp2gei1bpY68ZzEZE9Bg","stars":1,"date":"2013-05-22","text":"Not impressed at all. I paid 200 to go up and see the top of my house.  We traveled from Post and Ft Apache to Windmill and Durango.  I wish someone had warned me of where the flight would go. The pilot\/owner spent 1\/2 the time telling jokes, which was good. Unfortunately, the other 1\/2 was spent bad mouthing the competitor.  That's not enjoyable.  And talk about HOT.  You need a hat... NEED!  They should set better expectations, an email covering what to bring doesn't cost anything and is just good customer service.  We almost landed on private property, the landing team had to help the basket get over gate.  There were 13 total on the trip including the pilot. It might be legal, but for a comfortable experience, it should be limited to 9. You get handed a disclosure on a lanyard which says tipping the pilot is customary.  umm its not customary to tip the owner.  Speaking of which, four of us on the ride were told that if they wanted an extra 30 minutes, they could pay an extra 50 in cash.  umm yet again. On the good side, you don't feel anything when up in the air. Also good, the pilot has a lot of flight experience and the crew is polite.","useful":4,"funny":9,"cool":2},
{"review_id":"dO9libKIZB9A7BhHGJ5fVw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"-C8sSrFqaCxp51pyo-fQLQ","stars":5,"date":"2016-12-08","text":"Just had the Kentucky Fried Fish. Wow. I've never ever had better. I am well traveled- 44 states and 14 countries. Again- never ever better. \n\nThe fry was light but full coating. The fish was obviously fresh as it was glistening on the inside. The sauce flavorful and not spicy. The slaw was sweet and perfect balance. Portion is large. Price good. \n\nI'll be back. I'll bring friends.","useful":0,"funny":0,"cool":1},
{"review_id":"ci4jW9zBluYTN_0U8EY1Jw","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"yp2nRId4v-bDtrYl5A3F-g","stars":5,"date":"2016-09-27","text":"My go-to place to take friends. The spinach salad is fabulous. The curries are super tasty. The Thai basil chicken is defaulted to hot, so make sure to give a rating on the spice level. The lava shrimp are a must have. They renovated and expanded a few months ago. Love this place!","useful":1,"funny":1,"cool":1},
{"review_id":"1hNUlDhhPYmE2cpTlWL7Jg","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"F65UAC9crwFePN69UqKRJw","stars":2,"date":"2014-02-02","text":"The plumber and his work were fine.\n\nThe price, not so much. \n\nCost of O Ring is 71 CENTS each. Cost to install on 3 toilets.. $345. \n\nLet's review. Materials cost is a total of $2.13. Time spent doing repairs -1hr. \n\nSo I paid the plumber $342.87 for 1 hr of labor. \n\nI believe that will help you when you call and they \"can't give you an estimate over the phone\".","useful":21,"funny":11,"cool":1},
{"review_id":"VTP59z_qGQ870eB3kM5i7g","user_id":"7lxEzQEcVTsuRebyA7hfhg","business_id":"UX1mbYnDnod1XHf_UBvH8A","stars":5,"date":"2016-11-28","text":"My stylist, Danielle, not only gave me a modern pixie- she taught me how to eliminate cow licks (sp?). She gave advice on the best products and hair dye solutions. I'll be back. I've been in Vegas 12 years and have finally found a stylist worth returning to. And the money? About $55 for a cut. Reasonable and excellence are a great combination.","useful":1,"funny":0,"cool":2}]