[{"review_id":"QpTzjycMLKTLgGGp3RlGOg","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"41JRHo_PTchaurwjakXKGQ","stars":5,"date":"2014-12-02","text":"Local Motors is true Americana wrapped up in the shape of the coolest car on the road.  Bring the kids on a weekend to see the future of American manufacturing, and the entrepreneurial spirit of the place will put a smile on your face.","useful":0,"funny":0,"cool":0},
{"review_id":"9pI7hbEIw11aAop_q513NA","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"hjgr1NJPgPjEUiUn7Ejn2A","stars":3,"date":"2014-12-05","text":"Staying here is like being in a time capsule and re-visiting a luxury resort from the 1980s. The place hasn't had much in the way of capex for a few decades and it shows. The owners - Starwood - are milking this for all its worth. If they could just hold off, it will probably be fabulous again in about a decade as that 80s-retro-resort-glitz comes back in style. But knowing Corporate America's lack of prescient timing, they will probably renovate at just the wrong time. Go to the steakhouse for dinner while there.","useful":0,"funny":0,"cool":0},
{"review_id":"Mp8670JNWl4Wncin92Nrfw","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"YuGlPpQ98K2GQl4fUTC_AQ","stars":5,"date":"2015-04-07","text":"A Westmount classic. \nGrilled cheese, milkshakes, Greek salads. \nStill a great place for a comfortable meal in Westmount.","useful":0,"funny":0,"cool":1},
{"review_id":"Y-ldHEha3KZzUbByfQkZ_g","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"M9gwHW1oIiIqjdT76yOBDA","stars":4,"date":"2014-12-05","text":"A touch of 90s Vegas in an otherwise 80s-style resort. The room, steaks, and service all remind you of a fun night out in Vegas. A great option if you are at the Phoenician or nearby.","useful":0,"funny":0,"cool":0},
{"review_id":"yq3mYjMezD_Fc-tJdAnkEw","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"80klSQFFKguEL76Zo8m5YQ","stars":3,"date":"2015-04-07","text":"The rooms are quite nice (for the price) but the service is slipping. The food at the restaurant is overpriced and just ok (except for the croissants, which are delicious).\n\nThe gym smells horrible and is quite small. \n\nAnd our visit was made much more complicated by the fact that the garage is out of service for a month or two- so instead of just parking the car at the hotel, one has to park around the corner. This is normally not a big deal, but with Montreal weather, luggage, and kids in tow, it makes everything more difficult.","useful":1,"funny":0,"cool":0},
{"review_id":"gjyrcVusoJTDD2QOSQSEtg","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"2gUbgbdJ7IFSbicBXlSchw","stars":5,"date":"2015-04-07","text":"The quintessential French bistro in Montreal. Still buzzing and still serving up classic french bistro fare.   As all the new restaurants in Montreal delight in serving ever more exotic dishes, L'Express stands out as a bastion of what a classic dinner in Montreal can be.","useful":0,"funny":0,"cool":0},
{"review_id":"R55WSV91UcZJE_rlaJsobg","user_id":"xX3ux7aG1lQCYY8IJPSw2A","business_id":"uEzeBOLF_ia0kzCL8Rhaew","stars":5,"date":"2016-10-14","text":"I called Tribal Waters through my subscription to Angie's List.  They were rated as an A+ pool and spa contractor.\nI contacted Michael Darrow (Sales) who came and provided new build Water Feature design and Pool deck refurbishment ideas for me.\nMichael was very personable, professional and visionary in helping me.\nHis company office staff were very professional in handling call backs re: scheduling of materials and service.\nThe two pro craftsmen Michael picked to do my pool work were OUTSTANDING (pride in their work individuals).","useful":17,"funny":3,"cool":6},
{"review_id":"muxoDBEPIPA_3wJxmCsUHQ","user_id":"zJzz2jhj-KLAANKLdRunkQ","business_id":"OFnDWBP8iXxgeBrfHA5fRA","stars":2,"date":"2017-02-24","text":"Quite possibly THE most uncomfortable bed I've ever slept on. Coil bed with not even a pillow top. Did not sleep well. That being said price is low,  Fremont Street location great,  not a big gambler, but when I have its paid better than the strip for sure.","useful":0,"funny":1,"cool":0},
{"review_id":"DDK--6ESfxEmsxjWCyGqWA","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"VLDFjeqpUgWhnVuB_8GuEg","stars":2,"date":"2016-07-13","text":"I want to like this place and I've tried it several times, but the food really lacks flavor. I've had the tacos a couple of times, which were served with stale, dry tortillas. I'm not vegan or vegetarian, so maybe this restaurant is not targeted at someone like me.","useful":0,"funny":0,"cool":0},
{"review_id":"bbPRpgmMBnxDnTWzFi9iPg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"frCxZS7lPhEnQRJ3UY6m7A","stars":5,"date":"2017-05-07","text":"This is one of the best (if not the best) places for tacos in the Phoenix area. We've tried several different tacos and quesadillas and everything has been delicious. It's also the closest I've seen to authentic Mexican in Phoenix. The variety of salsas makes it fun to eat these dishes.","useful":1,"funny":0,"cool":1},
{"review_id":"yCXsBjelNHTC_u9-PIePbQ","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"-tcJmqzfaeEnpFMAelB7bA","stars":5,"date":"2015-06-07","text":"I'm happy to have found great Mediterranean food! Had the mixed plate so I was able to try the beef and chicken, both delicious. Service was fast and friendly.","useful":1,"funny":0,"cool":0},
{"review_id":"eewRXq3waGRHAc9graVphQ","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"GhM6y2RX1zU-Gc0ustXsqw","stars":5,"date":"2014-08-03","text":"What I like most about this dental office is that Dr. Parsanko and his staff put me at ease during my visit. I usually get very anxious, but this visit was efficient and pleasant.","useful":0,"funny":0,"cool":1},
{"review_id":"JcPd-EyRDLb1ZN39roCtJg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"knyRhFaM4Bwa8AldEbOiqw","stars":2,"date":"2015-09-28","text":"I think the pizza is below average, but my husband thinks it's \"ok.\" The cheese is rubbery and the pepperoni is way too salty. The service was awful the last time we ordered so we'll be looking for a new pizza place.","useful":1,"funny":0,"cool":0},
{"review_id":"xmywh9qnC0EZM4QJKnzXiA","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"svFq2-4Yv5bIXtB2EK24Ow","stars":1,"date":"2017-05-07","text":"We went for brunch and it was pretty bad. All four of us ordered something different and none of us liked our meal. Not sure if they're trying to be too trendy with the brunch crowd, but perhaps this place should stick to bruschetta and wine.","useful":0,"funny":0,"cool":0},
{"review_id":"ddgXTdlgBGJ-5Oyma8nwdg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"GrwvBAEALujIOPQeOfN1vA","stars":3,"date":"2015-04-04","text":"The street tacos were excellent. I enjoyed the chicken, carne asada, and mahi mahi tacos. I ordered them a la carte so I didn't get the rice and beans on the side. My husband ordered some tacos with rice and beans and I noticed that the rice and beans looked very dry and a bit stale. I tried them and they definitely were not fresh. I looked over to the plates of others and the rice and beans looked the same. \n\nIt is a shame that they serve the sides this way because the tacos were delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"oFxuJXVP9uQ0keUIGGEiLA","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"QX0KGZZYYLVPPCpNjwN9MA","stars":1,"date":"2015-05-10","text":"Although this place is conveniently located, there are a few reasons I would not recommend:\n\n1. I would describe the customer service as awkward. They're not blatantly rude, but they're not friendly either. They seem to just not care.\n\n2. They tore a blouse of mine and didn't say anything to me when I picked up. I only noticed a few months later when I wanted to wear the blouse again.\n\n3. A few items have come back looking like they were not cleaned. They smell odd, like stale chemicals. Don't know how else to describe it.\n\nWill not be going back to this place. Looking for a new one...","useful":3,"funny":1,"cool":1},
{"review_id":"kKJkkmvL-7lgksznAm7WAQ","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"ZYr2feXiGYTbWyho_1oUiw","stars":2,"date":"2017-07-23","text":"Today was a very different experience than in the past. First, the restaurant did not seem as busy: it was 9:30 a.m. and there are usually people waiting for a table. That felt a little odd because a busy restaurant is a sign of good food and service. The service was fast, but one of our orders was wrong so they had to go back and fix it. Then when my order was finally ready, the hash browns and bacon were overcooked (almost burned in some spots) and looked old, like they had been sitting out a long time. We could also hear the people in the kitchen yelling at each other, which was not pleasant. This was not a good experience because the ambiance was low-energy and sad and the food was pretty bad.","useful":1,"funny":0,"cool":0},
{"review_id":"-7xElVtsi_oR6iWSoJepcg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"ydqbNz2sHENV9XOElwyAYA","stars":3,"date":"2015-05-30","text":"The atmosphere is fine and the service was good. The food was average. I had the stacked christmas enchiladas with chicken. It was a mess of flavors: the chicken was bland and the salsas drowned each other out. Add to that too much pico and the enchiladas turned into a sloppy mess.","useful":1,"funny":0,"cool":0},
{"review_id":"cvWIhGBN72_4MMwCppf-zw","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"PNTyiqS7R-0c1ofxOfDijQ","stars":5,"date":"2015-06-21","text":"Best restaurant in Scottsdale! The food was perfect and the wine pairing was even better. The wines Stephen chose were amazing! We had dinner in the patio, which was lovely. The only thing that wasn't perfect was the noise level in the patio. There were a few groups and they were too loud, it took away from the ambiance.","useful":0,"funny":0,"cool":0},
{"review_id":"xit-EUAGFSZHCfkSXXdVTg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"Er2XAYN8l1BadlYFwiPb9g","stars":5,"date":"2015-09-26","text":"The food is great, the place is convenient and clean, and the service is friendly. We love coming here for a quick casual dinner. I recommend the chicken.","useful":0,"funny":0,"cool":0},
{"review_id":"XX0Lgi1MxdeCRObOfxJbzg","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"dSnQTUJC0tCHadU1AGzvrw","stars":2,"date":"2016-07-09","text":"I'm not sure what they're trying to go for here, but it's not Italian. It's more like bland bar food. The service was ok (the hostesses seemed a bit immature). The view is very nice, so I'd probably go back for a cocktail and the view.","useful":0,"funny":0,"cool":0},
{"review_id":"nyCPAkgV_cosyFDXGWU4nA","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"XF4w6wG1JOvfKZlQcxiWgQ","stars":5,"date":"2017-08-15","text":"We have been in here numerous times and the pizza is always great.  They have a nice selection of quality ingredients that you can choose to build your own pizza and the food always comes out quick.  The real reason for writing this review is not to rave about the quality of the food, but the exceptional service that we experienced tonight while dining in.  The staff are always really friendly but tonight when I asked for a gluten free pizza, they stated they were out of the dough.  Chris (perhaps the manager?) decided that he would go out to pick up more of the gluten free dough, and he dropped what he was doing to run out and get more.  Throughout the experience the staff was friendly and checking up on us, but the fact that they went out of the way like this to accommodate a customer was something that I have not seen before.  We will continue to go back as the food and service are both top notch.","useful":0,"funny":0,"cool":0},
{"review_id":"UAucbAp5kxM-8HmRDawB_w","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"wUKzaS1MHg94RGM6z8u9mw","stars":5,"date":"2016-07-13","text":"This place has a good, not overly complicated menu. I've tried the steak, salmon, chicken, and pork for dinner. All delicious, so I keep returning. The service is good and I love sitting out in the patio for dinner. One of my favorites in Scottsdale.","useful":0,"funny":0,"cool":0},
{"review_id":"7qo_HYOkm82V0-GbFUutuQ","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"-o082vExIs0VVNSuZmiTQA","stars":2,"date":"2014-11-02","text":"The food at this place was quite greasy and lacking flavor. I wouldn't call this place authentic as it's just a lot of fried food with greasy yellow cheese. I do NOT recommend this for visitors looking for authentic Mexican food.","useful":0,"funny":0,"cool":0},
{"review_id":"gBFKZGmbFny3TjXTwgSK6w","user_id":"HepI3TWMosZgOXM9pQwB0A","business_id":"coAdjIJ7Xomwq7sfHFzxKQ","stars":2,"date":"2015-05-23","text":"The atmosphere is nice and comfortable, but the food is not good. The eggs are not cooked properly and lack salt. The bacon is very chewy and greasy. Will be going to the many other breakfast choices around here.","useful":0,"funny":0,"cool":1},
{"review_id":"HFEGi1pKJKKgjxjdAdPv0Q","user_id":"PESrh6xgjCIqx81nSb0mpA","business_id":"rBj1vByP-GjXuNUR0Nj0qA","stars":1,"date":"2016-06-10","text":"Visited Kirby's Firestone for an oil change and the tire rotation for the first time. I am not sure about the oil change, but the tire rotation wasn't done. I visited there again and requested for the tire rotation and waited for ~15min. At first, I was impressed about their fast work, but when I checked my car, the tires were all in the same place. No tire rotation was performed period. I also noticed that the mechanic touched my items in the passenger compartment and all my documents and items were flipped around. What was he looking for?? I am not sure if any items were missing. It was an extremely disappointing experience.","useful":1,"funny":0,"cool":0},
{"review_id":"_Y63q8v8yba6tJ0Wv1TghA","user_id":"sDofYImMQQmu4Le5G9zmpQ","business_id":"F70couxLlxWDRZNIVHoIRA","stars":1,"date":"2015-06-04","text":"!!!!!!!!Should be called RIP-OFF-MASTERS!!!!!!!!!!!\n\nDo you want to pay $382.00 for JUST the REAR BRAKES?!?!?!?  If so this is your place!!!\n\nI am a mechanic and while on a long distance road trip I needed my rear brakes done.  Since I did not have my tools with me I had no choice.  When dropping off the car I asked for them to retain any parts that were replaced so I could look at them because I know mechanics make their money by replacing parts that don't need to be replaced.  \n\nGuess what???  These \"buggers\" did exactly that!!!  They replaced both the rear rotors (discs) that did not need replacing.\n\nThey said over the phone \"the rotors mic'ed (micrometer measurement) out less and show .010 less than minimum tolerance\"  Since I was not there to verify I believed them.\n\nWhen I picked up the car I visually looked at the old rotors and they looked to be \"turn-able\" (can be machined to return to serviceable condition).  I pointed out that cast into the rotor is the words  \"Minimum thickness .072 inches\"  I asked for their micrometer and mic'ed out the discs and verified that the lowest thickness of the wear on the \"worst of the two\" disc was only .78 inches.  The other one was even thicker... so this means that BOTH DISCS were still within tolerance and could be machined.\n\nSo why did they lie to me when they said \"the discs were .10 less than minimum tolerance\" when they were still serviceable?\n\nBecause they are a RIP OFF and are LI ARS and they take YOUR MONEY by replacing your parts that do not need to be replaced!!!\n\nSTAY AWAY FROM THIS PLACE!!!!!!","useful":5,"funny":3,"cool":1},
{"review_id":"OUZWMw7EgO7D596pUelSlA","user_id":"6vJY67yve43Ijvn8RKVUow","business_id":"GAKFx4jFUtTOTpp_jDJnuA","stars":5,"date":"2017-09-01","text":"Nice relaxing atmosphere. Friendly service and great selection of craft beer. King George and the Biltmore Blonde were both great beers. If you like darker beers the Ironwood was a delicious Imperial Porter.","useful":1,"funny":0,"cool":0},
{"review_id":"7lbykaWFD8YBwT0mU1Rexw","user_id":"6vJY67yve43Ijvn8RKVUow","business_id":"0QzCeORfF8EY34UODWRV9A","stars":4,"date":"2017-09-03","text":"Very pleased with our experience. Great off the strip option for the Las Vegas area. Excellent prices for the stay. The Feast buffet is a great priced food option. Bottomless mimosas for breakfast was a fun experience.","useful":0,"funny":0,"cool":0},
{"review_id":"Nd_soHwCYi8adcNIT2w9LQ","user_id":"S0dnPb1OzaqdBSOxyLr7BQ","business_id":"tlt8zNrZ6_A3DmXiM-cnBA","stars":1,"date":"2016-06-12","text":"Wife went to this location and was horrible. Not only are they slow and rude but the property looks terrible. Weeds all over and just very unprofessional in appearance. For gods sake hire a landscaper....","useful":0,"funny":0,"cool":0},
{"review_id":"sTV4N-6Ik1aoATPDY_ajZA","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"LGZPjmhEg2QYeGZ2PKnpQw","stars":2,"date":"2015-07-15","text":"Despite being a somewhat regular that tips 15-20% and frequently order special dishes\/seafood, the customer service sucks!\n\nThe only reason I visit is because:\n- easy to get a table (because it's more expensive than others)\n- truffle\/foie gras dumplings\n- modern interior\n\nCasa Imperial is a better alternative (if you don't care for truffle\/foie gras) but it's hard to get a last minute table!","useful":1,"funny":0,"cool":0},
{"review_id":"FUUTAr5CECrkfRa9Y2-MSg","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"XD0LjNuPPwJPsTAHecUh7A","stars":1,"date":"2015-08-23","text":"Not baby friendly anymore. \n\nRefused service for having an urban sized stroller due to \"fire hazards\" when the restaurant at 2:30 pm was almost empty.","useful":0,"funny":0,"cool":0},
{"review_id":"WyXXGm0ryKoAlLi68pq-kg","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"J64Yg3hQJXSI-ipnfJUkiw","stars":2,"date":"2016-08-24","text":"Paid for an Escalade but got picked up by an old Yukon. Driver also talked on the phone while driving.","useful":4,"funny":0,"cool":0},
{"review_id":"c3FgJtmZeezRofU2kHLtdg","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"kqBvmhAupwNTZcGhxqL2CA","stars":1,"date":"2015-11-28","text":"Bad sushi... no wonder it was empty. Not only bad, it was also expensive at $100 pre tax for 2 for lunch without drinks. Didn't eat 1\/2 of what was served. Some dishes were okay but most were weird and the uni dishes were really bad and foul tasting.","useful":0,"funny":0,"cool":0},
{"review_id":"7II1S7Z1dQ6qJliJOvdt1Q","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"EZrkg2mrQLGaXdsiuRnBgQ","stars":2,"date":"2015-08-17","text":"First thing they served was a glass of flat, warm coke; fortunately the waiter was able to get a can of coke. \n\nBread, although hot, was tasteless and served with unsalted packaged butter. \n\nThe caprese salad was okay, but given the price, you'd think they would not serve you stale, yellow arugula.\n\nThe seafood pasta was decent but the bucatini was no good. \n\nDespite being one of the few Italian restaurants in Markham and we love Italian food... We will not be returning. Overall a meh experience even when not considering the prices. No wonder it was empty on a Saturday evening.","useful":0,"funny":0,"cool":0},
{"review_id":"jSVDzcNUKrd3HpF8xGxScA","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"JJDxLSeHkEFPUrPCxEFp0w","stars":2,"date":"2015-11-12","text":"If you don't mind the mechanic's attitude problem then I guess it's okay for a little shop that uses Hunter equipment.","useful":1,"funny":0,"cool":0},
{"review_id":"OT7KEec2NRlCc8mGMZOf6A","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"3k9treY8PmsZ42bKmuICgA","stars":2,"date":"2015-10-11","text":"Not sure why this place gets 4*... Food is meh like typical AYCE. iPad ordering is nice except the expensive dishes are ignored like salmon sashimi.","useful":1,"funny":0,"cool":0},
{"review_id":"KrSnh9RqCCjRu85YLkOfMA","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"XNVUXM8xY-slNbcPAr-w8Q","stars":2,"date":"2016-09-17","text":"So salty and so much MSG, mouth feels terrible after eating the Sliced Lamb Potato Noodle Soup","useful":0,"funny":0,"cool":0},
{"review_id":"3ARL8Y4ZPZ1qE9vEk2PH6w","user_id":"RsgRH4ixaiJ1zWnmXam6pQ","business_id":"JJys4pp5xmf3bB4E3lmxRA","stars":1,"date":"2015-11-07","text":"It was decent before now it's terrible. Wings are so dark it looks like it was fried in old oil. Flavours didn't taste normal. Won't ever go back again.","useful":1,"funny":0,"cool":0},
{"review_id":"56C8HUhW1924RWa0fBduog","user_id":"jnYtV92dfYJ06KnvEDxIAA","business_id":"fI9ErCUGY8rXRPBbatcxMA","stars":1,"date":"2016-02-15","text":"Not a good experience. Made the reservation several weeks in advance. Poorly greeted, asked to move to another table but told nothing available even though only three tables were taken at the time. Somewhat of a rude response by hostess. Waiter was kind but lacked enthusiasm for a menu that is quite confusing. There was a very bad smell that was offensive and lingered. I think it was that nights dinner. We left without ordering. It was just bad all around.","useful":0,"funny":0,"cool":0},
{"review_id":"aWgs-C_S5VWkJSIWetzE0Q","user_id":"jnYtV92dfYJ06KnvEDxIAA","business_id":"ZMgBp4XmiEHYAuXKbe1hUw","stars":3,"date":"2013-10-10","text":"I'm not a big reviewer but, felt the need on this one. My first visit to have wings and a beer. Guinness was delicious and grilled wings with medium sauce were better than expected. All claims on the friendliest staff are false. Barmaid I had was a disappointment. She was impatient, fake, not at all friendly or welcoming. It wasn't like she was busy at 2:00 PM. If you are not a regular, you don't get the time of day. Many other sports bars to choose from with warmer service. Not worth a return visit.","useful":0,"funny":0,"cool":0},
{"review_id":"5LBPi5wb8egRUklJDb4D9A","user_id":"jnYtV92dfYJ06KnvEDxIAA","business_id":"V8wXGxlzngQRASEw1M-LJg","stars":4,"date":"2015-09-11","text":"I don't always think of going to a golf club to eat. I usually think it is just for golfers. Dynamite Grill changed my view. The restaurant and bar are well decorated and comfortable. The views are stunning. The service is great, make sure you check in with Stewart behind the bar. We had a light lunch of salad and fabulous tacos.  They also have an outdoor area to watch the sunset. Check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"u9Auwr02fCx_QvYWFb49bw","user_id":"jnYtV92dfYJ06KnvEDxIAA","business_id":"AJ0CK8JMVpxAshtZuC911Q","stars":3,"date":"2017-06-10","text":"This is an update to my previous review. I'm changing my rating from a 1 to a 3. I'm doing this because after I wrote the first review, they reached out to me and tried to rectify the situation and the relationship. I appreciate that they made the effort. I can't comment on their work as I decided to go with another company. \n\nFirst review:\nI called this company once each day for two days to get an estimate on a small job. They did not feel it was necessary to call me back either time, as promised. If you don't want my job, that's fine, just tell me and stop wasting my time. If you don't care, I don't want you working on MY home.","useful":0,"funny":0,"cool":0},
{"review_id":"_DCKA_FBCGxaPav24UrgAA","user_id":"c6tWQuLKz1qnFJQj1hYUpw","business_id":"QUPP3oVVmdrWof2rGx4HIA","stars":5,"date":"2016-12-12","text":"Visiting from the Pacific Northwest when I came upon this place.  The burgers were great. I first had the Philly burger and decided to come back another day to try the gyro burger. Both were great and I highly recommend getting jalapenos in both to get a zing to the burgers. They make their sauces fresh everyday (i.e. ranch).  The owner was very kind as she even gave me a few cucumbers at no charge for my teething daughter. Yes it just a cucumbers but the shear thoughtfulness that the owner had was top notch customer service in my book.  When I come back to Arizona, will definitely be stopping by here again","useful":1,"funny":0,"cool":1},
{"review_id":"gA9P_PLGyqE5FsgKbK-yEQ","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"gaVbK3SlRnOAWWVyyu3SVA","stars":5,"date":"2011-10-05","text":"This place is the best....Great lunch specials and home made egg salad and sides.\nThe highlight of the visit is Maria and Nancy, they could not be more friendly, their smile will surely brighten your day.","useful":1,"funny":0,"cool":0},
{"review_id":"Bi6sJcqCyi3sJj2hyYMCIQ","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"wrcfLni9nmJK46Wb4XMkaQ","stars":5,"date":"2016-06-09","text":"This location is awesome. Juan & Lily work hard to provide an enjoyable visit and go the extra mile. The Chicken Salad wrap is the very best  :-)  :-) but then again it is all so good.","useful":0,"funny":0,"cool":0},
{"review_id":"4bcFoOt3InohJ_smyz2qHw","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"RzXSaz2BjPBHeJzEIUKoQw","stars":5,"date":"2016-06-24","text":"Just a fun place to eat, drink & visit and knowing that your helping children and not lining the pockets of corporations, well just awesome :-)  :-)","useful":1,"funny":1,"cool":1},
{"review_id":"wepZ2Yl42HLxj4YK7Or3ZA","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"URa75T-A1QvjMUFNIPyukQ","stars":5,"date":"2015-04-30","text":"Lisa & Eric are the nicest people you will ever meet, their personal service and great food makes this place a must.","useful":0,"funny":0,"cool":0},
{"review_id":"urV-xROu41Z7Uv7B0j-_cw","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"ki_b3zJZjrboVliIiT7Vww","stars":5,"date":"2008-10-30","text":"My association with Windy Wang a licensed acupuncturist and owner of Willow Pond has been a very positive one. I found her to be very  caring, dedicated, friendly and honest. She takes the time to listen and ask questions. I have found her to be highly educated and knowledgeable in her field. She takes the time to answer any questions and it is important to her that you be at ease and comfortable with your visit. She has no hidden fees, she is on time and is very professional. I have recommended Windy to all my friends and I could not have done that if I did not have complete trust and confidence in her.","useful":1,"funny":0,"cool":2},
{"review_id":"DhVjIpuxLbr5fAUGultJ2Q","user_id":"peAIvDTWt8K5Ie06LKwI-Q","business_id":"ARWLV46iIa3Dvt1y8-SPpA","stars":5,"date":"2016-06-24","text":"Most fantastic place, like being in Italy.  Pasquale is the most awesome.....","useful":2,"funny":0,"cool":0},
{"review_id":"eYaDrVWjgRLuW_gGtYIPvA","user_id":"E7PoXTT0MVc8xcayikQnsA","business_id":"4iB4J5fxd8tbYklDAnaD5g","stars":4,"date":"2017-08-08","text":"I love the lazy river and the condo style rooms. The staff are very respectful and helpful. We really enjoyed Booze and Bites restaurant\/bar as well. Good beer and the island sale is the bomb!\n\nThe reason for 4 stars and not 5 is the enforcing of the rules by the teenage lifeguards at the lazy river. They are afraid to tell the guests not to horseplay or run around the lazy river.\n\nAnother drawback is that 3 days in a row either the pool or lazy river was completely shutdown due to biohazards which means someone defecated or vomited in the water! Totally gross.","useful":1,"funny":0,"cool":0},
{"review_id":"tVcGeNVOX9OZBeIaCwJ7Ng","user_id":"E7PoXTT0MVc8xcayikQnsA","business_id":"bjllusUsLq9zE4yZnLpOzg","stars":5,"date":"2017-04-01","text":"Awesome fresh spiced just right Lebanese food. The kabobs are amazing. Fluffy saffron rice. And the garlic sauce brings it all together oh and the iced tea made with rose water is truly unique and incredible!","useful":1,"funny":0,"cool":1},
{"review_id":"zG5_jFsr-F_UYClvTzeOvA","user_id":"ZsXELydhzvfeQ2iDsN9riw","business_id":"WzVc5o_bXS2C-ND7eEzwSg","stars":4,"date":"2010-07-24","text":"This is probably my favourite neighbourhood pub. \n\nSure it's a quiet spot, not the kind of place to see and be seen, but an honest place. Lots of east coasters amongst their regulars - they always make sure you feel welcome. Service is friendly and efficient.\n\nThat's where I go whenever I'm in the mood for good and reasonably well priced food. Drinks are cheap too, and beer is always cold. I usually order the 'extreme nachos', and they sure are pretty extreme - I would never be able to eat all that food by myself. Make sure you have company to share it.","useful":4,"funny":1,"cool":1},
{"review_id":"P5OblTJMpwYXRSQ8SNK4kA","user_id":"ZsXELydhzvfeQ2iDsN9riw","business_id":"l3d7x5kJ0vv7Dte8tUJP4A","stars":4,"date":"2010-07-24","text":"This is my favourite falafel place in Calgary. Staff is super friendly, prices are fair, service is usually pretty fast and they're open late on weekends. \n\nTheir tabouleh (salad made with tomatoes, onion, lots of parsley and olive oil) and deserts (especially the baklava) are also worth checking out.","useful":4,"funny":6,"cool":5},
{"review_id":"_snchopeLF4uxTvEfbQKrQ","user_id":"ZsXELydhzvfeQ2iDsN9riw","business_id":"3lwc9WSybcsTXDE319SrFw","stars":5,"date":"2010-07-25","text":"Ok, being a Brazilian and a rodizio fan, I must say: this place is the real deal! I only get to go back home once a year, and Gaucho's is exactly like the Churrascarias back home: all you can eat meat, salad buffet and typical side dishes. \n\nAs for the BBQ meat, my favourites are the Picanha (a must try, in my opinion), costela (ribs) and chicken heart. \n\nMake sure to let the waiters know if you like your meat well done. In Brazil is common to have it done a little on the raw side. \n\n\nPS.: All my canadian friends are grossed out by the thought of it, but I strongly encourage everybody to try the grilled chicken hearts. Tasty stuff, I guarantee!","useful":5,"funny":0,"cool":1},
{"review_id":"372Vgz7VWIG_JFfSu_X0Jg","user_id":"ZsXELydhzvfeQ2iDsN9riw","business_id":"HO9ABJoXBv29UTNQrRJoRw","stars":1,"date":"2010-07-24","text":"I can't understand what's the hype about this place.\n\nAfter reading many good reviews, decided to go there for breakfast. \n\nFirst of all, service was mediocre - had to wait about 15 minutes to order. Waited another good 20 minutes for our food, that wasn't all that great: hash brows were soggy (like they were dipped on water and then served), pancakes weren't cooked long enough (tasted like raw batter)  and Maple BLT sandwich was nothing special. \n\nSTAY AWAY.","useful":2,"funny":0,"cool":0},
{"review_id":"2ed2W9lkX8SYSaKs4wx-AA","user_id":"ZsXELydhzvfeQ2iDsN9riw","business_id":"1hAebzcRgN5khGO3_uXz5Q","stars":4,"date":"2010-07-24","text":"Decided to give Thai Express a try after walking by many times during my lunch breaks @ Suncor Centre. \n\nJason is right about the lineups - be prepare to wait for about 10 minutes or so during the 'lunch rush', but it is totally worth it. Been there two times, had the yellow curry shrimp and the cashew nut beef stirfry - in both times they were delicious and tasted really fresh. Prices are fair: portions are HUGE - reason why I always get the take away box, I'm never able to finish the whole thing. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"rcczwv8dwm2q9PYOOoVSVQ","user_id":"Wn0H7qlBp7qxkTKO1yb7ng","business_id":"Vd5n_Jv9vtvD6dzl3ReNWg","stars":5,"date":"2017-07-01","text":"Seth Harrison commands an excellent crew. Seth estimated a very fair price to remove 2trees and trim others on our property. The equipment he used is in great condition and is a reflection of his commitment to great service. He used three professional cutters on our project and four plus ground men. A thoroughly professional crew. Thanks Seth for your fine work! I highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"bQiCjNZ8_KhXHBqqAGzjwQ","user_id":"Wn0H7qlBp7qxkTKO1yb7ng","business_id":"K6unI5ACMado5VoKID6Eng","stars":5,"date":"2017-09-30","text":"I travel for work throughout the US and for pleasure to Europe. Finding good food experiences is a primary goal. H&H is outstanding. From the bone in ribeye, smashed fingerlings and creamed black kale to the grouper, the shrimp cocktail to the bittersweet chocolate almond brownie and espresso ice cream dessert every bite from beginning to end was a great experience. Our waitstaff was great and Michael made it all a delight. And I must mention the cocktails.  Black Flag is a bourbon lovers delight, Gin & Juice a delight. Go H&H. We will return! ( smoking is an art and H&H hits that sweet spot perfectly )\nPS: sat at the last table past the kitchen and liked it fine.","useful":0,"funny":0,"cool":0},
{"review_id":"UcRaCYAPxYs5S6i3Y6FD7Q","user_id":"f-7fj7zYD4Bt16X_fylhwg","business_id":"Qx2BnG2jpVV6XVFOYPfGcQ","stars":5,"date":"2017-01-24","text":"Had an excellent experience with Greg Saxe...I ran out of diesel on the way back to Phoenix and BD' AZ Towing came to help out in the rain and bad weather!  Fast and professional....highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"dtL7CbqsBm-OPJM8t4jJ3g","user_id":"f-7fj7zYD4Bt16X_fylhwg","business_id":"UdMrPZIXPTZfKhHBw_toKg","stars":5,"date":"2017-01-24","text":"Absolutely the best massage of my life.  This is the real deal and when I am back in town I will be stopping by again!  Marissa was extremely professional and the best!  I highly recommend going to \"The Spa 2 U\"!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"5CmcEZqn4IXmeT9l5qFF5A","user_id":"f-7fj7zYD4Bt16X_fylhwg","business_id":"VJTfQ1XksfYg8qgrHk3PlQ","stars":5,"date":"2015-11-05","text":"I highly recommend U Save Electric!  Jeff (owner) was very professional and got our job done quickly.  I will be calling Jeff for our next project!  \nThanks again,\nKyle","useful":0,"funny":0,"cool":0},
{"review_id":"sLdm1BWA48WTGOuH-UZW8A","user_id":"HV0ERLL5UTCrZlTFjN385Q","business_id":"S2_Ihx4lZ2otkkpXfBjXAw","stars":1,"date":"2017-07-03","text":"Absolutely the worst. After paying for an $50 estimate, Joe, the owner, refused to send me a copy of the estimate, refused to answer his phone, refused to return my messages. I paid immediately, yet this joker flat out refused to give me what I paid for. If this is how he handles an estimate, imagine how he would handle an actual job. I cannot say how much I distrust this guy and I would never recommend him to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"0oBiepvILtRkfsq-LlrWng","user_id":"HV0ERLL5UTCrZlTFjN385Q","business_id":"y6eUneu8lbQLsls12KmqqA","stars":1,"date":"2016-04-19","text":"THE PLACE IS TRASH.\n\nToo bad I actually have to give this garbage dump a star. Living at Daybreak Gardens is akin to living in a dumpster surrounded by gangsters and roaches. I have come to realize that they have trashy people living here, trashy people running the place, so it's perfect for trashy living. \n\nDon't be foolish enough to call and complain about anything like drugs or your neighbors threatening you by yelling at you through your windows. Nothing is their responsibility. I mean nothing. Drugs are acceptable. Violence is acceptable. Really, any kind of ghetto behavior is acceptable. \n\nBe prepared to call the police for any kind of help because the management wants the place to be run down and full of thugs. And believe me, it is. The place is trash.","useful":2,"funny":0,"cool":0},
{"review_id":"B4p52W61oDdej8p2d5PcZQ","user_id":"HV0ERLL5UTCrZlTFjN385Q","business_id":"htNNxttBjRmRnP4d0XFl-w","stars":1,"date":"2016-09-23","text":"I just had the pleasure of watching a Hungry Howie's driver throw his trash out of his car window into my yard. When I asked him to pick it up, I got a F you and he drove off. Thanks Hungry Howie's. You suck.","useful":0,"funny":0,"cool":0},
{"review_id":"-zz1a_ufI_dTIDtABEUAHw","user_id":"KnjosDsCo7EFneJCXyJGSQ","business_id":"UYx74_29WV8dbBQgWPozDA","stars":5,"date":"2015-11-21","text":"We had our Labradoodle puppy spayed and microchipped a few days ago at PAWS. The cost of having her spayed alone at our Vet office in Fountain Hills was going to START at $370.00!!!!! We decided to look around, and thank GOODNESS we found PAWS!!! The office was immaculate, and the staff was VERY friendly and knowledgeable! Dr. Fisher was kind and treated Frankie exactly how you would want your pet to be treated. Our experience was great, and we were able to have Frankie Spayed AND microchipped for a LOT less money!! We saved OVER $200 by going to PAWS!!!! We have, and will continue to recommend PAWS to anyone we talk to!","useful":2,"funny":0,"cool":1},
{"review_id":"oszG8xtigBZ43mrkQk3ncA","user_id":"89zwN7GKFe-_m4JHHnk6wQ","business_id":"Ip5IQLwjFzmr_X03pNH7pg","stars":5,"date":"2016-10-10","text":"Amazing, delicious, interesting food with recipes that they create themselves, and the owner was attentive to us and super friendly.. Going back often.","useful":0,"funny":0,"cool":0},
{"review_id":"6RqFtlFoENh6bocr1-gMeg","user_id":"89zwN7GKFe-_m4JHHnk6wQ","business_id":"hWK2yx9mFbr7Ix-78Ki8rg","stars":1,"date":"2016-06-15","text":"Todd redirected our car with transmission problems to a disreputable place because he couldn't find out what was wrong with it. We spent thousands and months trying to get it to run only to find out in the end it was a sensor. Still went back to him. The last time that we went there he had our car for over week. We couldn't get a hold of him and when we did he said that they couldn't figure out what was wrong with the car. A few days later he said that they were still trying to figure it out. We called again and he said that they couldn't find our car keys. We were very upset and went to talk with them about it but no one was there. We looked under the rock where we had left them because we had left it there when they were closed, and the keys were still there and had not ever been moved. He had not ever looked at our car and lied about the whole thing, keeping our car from us that whole time. We took the car without ever talking to him about it and he never called to tell us that it was missing. We took it next door to A and B motors and it was a simple problem and had it back in one day.","useful":3,"funny":0,"cool":2},
{"review_id":"J6RsNf-zkuG6P7gOwxGEiQ","user_id":"ME3NJGk2-T2zf8uuOpAG4Q","business_id":"ktf_QNZaJ1IvnXrncZCQqw","stars":1,"date":"2016-06-24","text":"Horrible food...specially chicken biryani and butter chicken!\nAvoid this place, not worth it","useful":0,"funny":0,"cool":0},
{"review_id":"Hwr1YTio1EA0_QKCKEYfrA","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"eJKyhdP99iw5qmVrwJvp9w","stars":5,"date":"2017-05-18","text":"This is not our first time to Playdium and I were very hesitant to go. I do not enjoy very much busy and loud places and this is how I remembered Playdium from our previous visits.\nHowever Friday 4 pm there were hardly any customers and very little noise and we enjoyed watching kids go from arcade to arcade.\nI liked how you can pay flat 50 dollars you want to spend there and split it between as many people as you want. \nI am not an arcade fan by all means but I did enjoy racing my 18years old and watching  my 14 month old 'stomp the ball'.\nit got busier towards evening so we just left.\nGive it a try, it could be fun once in a while!","useful":1,"funny":0,"cool":0},
{"review_id":"_2OuntrsiCCHlkLHdK_haQ","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"C2zIZ9LRUsYvpbYyuESedA","stars":1,"date":"2013-09-11","text":"JUST TERRIBLE!\nCalled them and left a voice message after reading all these nice reviews and no one even called me back!","useful":0,"funny":0,"cool":0},
{"review_id":"HUCazvBVSzeBUqDaf8i5vw","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"tXiAJ44hoieL0XqqI93BDQ","stars":5,"date":"2016-02-06","text":"Very happy family experience!\nKids are happy and safe. Very courteous stuff and relaxing environment.\nOnly two oldest kids and a daddy went to fly but everyone else just got so excited that we will be having a birthday party for 9 years old!\nI would recommend it to anyone at any age.\nI had so much fun watching my husband and kids having this amazing experience! \nWe'll be back soon.\nKeep up your great job, guys!","useful":0,"funny":0,"cool":0},
{"review_id":"YoeUvEQH-1ltMOAVokCaYg","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"759faMgpYDW-00vxd-In3A","stars":5,"date":"2015-06-03","text":"This was our first time dining in and we loved everything. The service was great, very fast and servers are very nice and advised us what's most popular on a menu when asked.\nWe had fried dumplings, pork bone kimchee soup and teriyaki beef. Everything was very fresh and with lots of flavor.\nWe'll be back. thanks a lot, guys!","useful":0,"funny":0,"cool":0},
{"review_id":"zOMJDCp26nOm2CGfuz0NQg","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"KmabDzJpEDpI-lZi_XdzEA","stars":1,"date":"2016-02-06","text":"What an upsetting experience! Went with kids, paid over $40 and came out very disappointed, with the crying daughter because she were not allowed to re-enter to finish her round. Not even it's not worth the money but also I got  sick treatment from the stuff members.\nMember stuff Rosie made my youngest daughter upset by allowing he re-enter not finished course first and refusing it 2 minutes later when male stuff member suggested 'it's too packed'. Little one burst in tears and Rosie would mentor her on how 'many tries she did on each hole as it is only allowed 6 tries'. Ridiculous and rude. My youngest daughter is just 6 years old!\nWe left with upset children and ruined mood.\nI would not recommend to anyone with the kids go there.\nBy the end of the day it's about having fun together, not to ruin your night.","useful":0,"funny":3,"cool":0},
{"review_id":"9pew_kediqHeg51wqCDBpg","user_id":"7v7fsVrUCYMYQ1oSSvesPA","business_id":"7iy93pe0oKz0KLLh8zNKFA","stars":5,"date":"2017-05-18","text":"Wow! I loved the place! Very intelligent and romantic place. I liked both food and service. I had kale salad and chicken, my hubby had mushroom ravioli. My food was outstanding and my hubby liked his main. \nWe had very nice and quite dinner. Music was outstanding. It is very appreciated that most of the patrons here to appreciate music and atmosphere.\nHowever if I had one word to say it would be to very loud party of 3 who were seated next to musicians Friday night towards the end of the show. has nothing to do with restaurant performance thought. Some people just don't know their manners.","useful":0,"funny":0,"cool":0},
{"review_id":"DX43OH3DZwyy7Ob2_iRbHQ","user_id":"phnJUC7oDXSM5FZxQOXfLA","business_id":"wcZzBdHZGjXp2cloQcLT7Q","stars":1,"date":"2015-09-24","text":"We have used this cleaners for over a year and overall have been pleased with cleaning and service. There have been a few items not cleaned well but overall good. Today, I was leaving off a load of cleaning. I also returned a good dress of my wife that I picked up from our last visit.  The zipper came back broken.  I brought that to the attention of the woman staffing the cleaners. Her immediate response , which was hostile, was that they can't fix the zipper they broke. It would have to be sent out and was too expensive so she would not help. She even suggested that we broke the zipper. I picked up my clothes and left.  They have lost a customer and I will not return. In fact, this is the first time I have ever felt compelled to write a review on any business.  VERY disappointed.","useful":1,"funny":0,"cool":0},
{"review_id":"hOCsdqpudPEBXw0aZ-ECDw","user_id":"phnJUC7oDXSM5FZxQOXfLA","business_id":"waJ8_8FGJC-j5uIP2im1-A","stars":5,"date":"2014-05-15","text":"I will keep it simple.  Vincent and crew are the best company I have ever used. Quality of work is excellent. Service is outstanding.  Price is right.  I would highly recommend Twenty20.","useful":0,"funny":0,"cool":0},
{"review_id":"9P7FB4mrxmWIVzFQfkh-qA","user_id":"phnJUC7oDXSM5FZxQOXfLA","business_id":"WyjxWKA0VKs6qiUUU9FOlA","stars":4,"date":"2017-10-19","text":"I had a total roof replacement and had several bids.   Arcadia offered the best value for the price.  Tommy was ( and is) great in being responsive to questions or concerns.  The crew was excellent at keeping the site clean and minimizing any disruptions.  The end product looks great!","useful":0,"funny":0,"cool":0},
{"review_id":"sPREpBmBWIRjH5dZjwVbQA","user_id":"FQ7dPlxUgUL10dObWOXUGQ","business_id":"LR0_oa52WI3XaaiVKfrD8Q","stars":5,"date":"2015-02-21","text":"I cracked my iPhone 5 screen while visiting a friend in Vegas from LA. Since I was so far away from home, I was scared that I was going to get ripped off in Vegas. Luckily, I found Willy's shop on yelp and guess what? His prices were even lower than repair shops in LA. He charged $60 for my cracked iPhone 5 screen and it was fixed in 10 minutes! I am very impressed with his work and will definitely tell my friends and family about it. This is THE lowest price in town guaranteed!","useful":0,"funny":0,"cool":0},
{"review_id":"KKk8cyEGGUVZeGyr4A81ww","user_id":"lndbbUPdqDhrAbTo8KZ_Lw","business_id":"cX3N8kmxYoqiFzvQsTQ_wg","stars":1,"date":"2014-03-17","text":"I give this park one star and that's generous!!! I just can't believe that so many people don't pick up after their dogs. The dog poop is out of control and at this point is a hazard to my dog and myself!!! I tried out Southland and it is spotless compared to this park and will be going there from now on.","useful":0,"funny":0,"cool":0},
{"review_id":"QlNv12Te9vm3mXmsPVjZRw","user_id":"N_NpwsR2nVIhouScS87r5A","business_id":"BpqggO7klU9Ky6WnVin1rg","stars":1,"date":"2016-08-15","text":"I was a big fan of Wet N Wild the two times I have previously been here until now!! My family of 6 drove 3 hours to this park over the weekend for my son's 6th birthday. We spent most of our time at Boogie Board Beach and all I can think about is how disgusting the water smelled!!! I wish the manger could get in the water to come out and smell the scent of mildew all over your body!!! At first when I got in the water with my son I smelled my shirt thinking it was just that, and suddenly my brother comes out of the water smelling the same !! The entire day there I was focused on how I smelled the entire time. I smelled like a dirty wet towel!!! I quickly told my son to get out of the water for fear of a possible contamination of some sort! The next day I got diarrhea and was worried it was that water especially after reading this past week's reviews about a crypto outbreak!!! They really need to dump out that water and fill it with new water before someone becomes extremely sick !! Not only this but the teens that work there are extremely irresponsible !! One of them even scolded my child for going down the water slide before the next kid got off completely so they ended up crashing !! That was completely the girl's fault that had told him to go down in the first place !!! Never coming back here again !!","useful":0,"funny":0,"cool":0},
{"review_id":"GD0hHJCuCSkvPHCowIs5Tw","user_id":"eRqruHinDbcqiabrrwsJnw","business_id":"rPk01P-gHFZnBtRyfc7Wrg","stars":1,"date":"2014-08-21","text":"The food is not good. Enchilada sauce taste very bland and strange. Kids meal are bad and it's all over priced. It's an open kitchen too. I don't see how they pass health inspections . Won't go back.","useful":0,"funny":1,"cool":1},
{"review_id":"aVYEzil5IbO95WBfJHMDFg","user_id":"briM6b9_gnvVjft5jly42A","business_id":"B1imfnKRvcotaYacPGUrLQ","stars":5,"date":"2012-07-16","text":"Great food and service in good atmosphere.  Reasonably priced.  Will definately get back there.","useful":0,"funny":0,"cool":0},
{"review_id":"Arr_dwBk_f5WPBzuywnJJA","user_id":"nRGPt0d8SH9hdegkeVqlTA","business_id":"z8XIldYr65CKOz8yOI5R8A","stars":3,"date":"2016-04-17","text":"I'm not a frequent guest of the Marriott chain, but I thought the JW of the brand was supposed to be their top of the line. My stay in early April was pleasant enough, but not special enough that I would stay at the property in the future or recommend it to others. \n\nPublic facilities: The main lobby and Spa Tower seem to be in better shape than the Palm Tower where my room was located. Nothing that evoked \"ooohs and aaahs\" but nice enough. There were parts of the common areas that were dated and could use updating as was apparent in the Palm Tower. One thing that another poster mentioned that I also found to be odd was the lack of any hotel staff in the Palm Tower. During my 3 night stay I think I saw someone at the desk one evening but that was it. To have to walk through the smoky casino to the main lobby to talk to a hotel staff member was just weird to me. The grounds are nicely kept and while the weather during my stay was less than desirable, the pool area looked nice, too. The parking (valet and self) is free and plentiful so if you have a rental, that's a perk.  \n\nRooms: I will say the room\/bathroom are really large. Having a foyer like entrance, large spaces, a walk in closet, seating, and a door to open to the outside (though an obstructed view)  I liked having space to spread out and a nice walk in closet to store my things (along with a safe). The bed was a bit on the lumpy side though and I did find is difficult to get comfortable. The bathroom Jacuzzi tub was nice and I liked the layout, counter space, and robes too. The one thing that I found strange was the lack of a place to put things in the shower. Strange to have no shelf so I just put my bottles on the floor of the shower.\n\nOnsite restaurants\/room service: While staying on property I tried the Promenade Cafe for lunch (sub par), Irish Pub for drinks\/apps (decent), Starbucks for morning coffee (good), and room service for breakfast (good). Nothing stands out as being amazing but it was definitely nice to have a coffee option. The fees associated with room service seemed higher than most places I have stayed recently but it was a treat and provided me with a nice chunk of \"me\" time. \n\nSpa: See review on Spa Aquae's Yelp page. \n\nLocation: Yes it's 20 minutes to the Strip but for someone who has already stayed on the Strip in the past, I don't feel like I missed out at all. It's actually nice being on the outskirts and seeing the views around the hotel was a pleasant experience. I did have a rental car so I was able to come and go as I pleased and not have to rely on any taxis or shuttle services. \n\nBottom line: Would I stay again? Probably not. There are so many other places to stay in the area that I would want to try someplace new and more updated for the price you pay.","useful":4,"funny":1,"cool":1},
{"review_id":"Fjx0-B7l3zmMuJXy_KYjhg","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"YuQD6IiuIRCAXiNOmXM0rA","stars":4,"date":"2016-05-29","text":"Drive thru for hash browns and OJ. The lady was super efficient, which I loved.\n\nI noticed the drive thru line was quickly conquered by the morning team. Great job!","useful":0,"funny":0,"cool":0},
{"review_id":"OOcg4jBzGc6yRn5s3g1gEA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"yfMK1YGTDsiD-fE5JJtzWg","stars":3,"date":"2016-06-04","text":"Decent store, clean. Decent service, nothing exceptional. (Better everday prices at fancy Fry's on Shea). Usually come here when they have a sale for something specific, like $0.99 eggs. Their regular priced items are usually more expensive than the larger grocery chains. Sometimes, when beer is on sale, they have decent prices.","useful":0,"funny":0,"cool":0},
{"review_id":"QVlChgbvz8-GIttKagD_9w","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"H45fQ69_8DpWz-yB9oPhhw","stars":2,"date":"2016-04-24","text":"Perhaps I will edit this later, attending a party in the party room, arrived promptly at 2, no party hostess to be found - 11 kindergarteners are amusing themselves playing tag, at Peter Piper, this could have been done at the park or anywhere else.  It's 2:16 and still nothing, kids are literally banging the walls. Parents of the birthday child have been apologizing profusely for the tardiness and mom specifically said to mention the no show hostess in this review.","useful":1,"funny":0,"cool":0},
{"review_id":"_HbVg5T4W7P7-ACWQI72gA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"70umoFq_Wa24Nr78UOsilQ","stars":3,"date":"2016-05-24","text":"Ok service. Hit or miss, sometimes cashier is nice and patient, other times they obviously want you to move along.\n\nChicken katsu and bbq beef are our faves. Katsu is hit or miss as well. Some batches are soft and golden deep fried, other times crispy and too dark brown.\n\nThis is where we go when we don't have time to cook","useful":0,"funny":0,"cool":0},
{"review_id":"nhi26liEDxMSMuC3RFPTWA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"O8sBSjxL8hQbA41lKtcoJg","stars":1,"date":"2016-11-06","text":"Last 2 times here were the worst. Hubby and I bought coffee one morning (one small, one medium). Had to repeat order multiple times at the drive thru, again multiple times at the window. Took a sip a few minutes later and it was a combination of burned, bitter, and sour. He got sick and threw up.\n\nThought it was a one time off day, came back another afternoon for 2 ice blended drinks (one with whip no boba, another boba no whip). Again, had to repeat order several times at drive through and again at window. Long wait at window and woman immediately closed it leaving the clipboard with me, knocked, no answer, honked, no answer, I finally opened the window myself and THEY were irritated that I was returning THEIR clipboard. Ridiculous.","useful":2,"funny":0,"cool":0},
{"review_id":"2Of5JOhh8y4uy22MGtFe3Q","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"y8k_rQBYeHZHpbX141Jhwg","stars":5,"date":"2016-05-30","text":"Superb, honest, fairly priced service. Every. Time. We've been coming here since 2007. Prior to that our vehicle kept having one issue after another.  They tool a look, replaced a part and all of a sudden our car troubles ended.  We have been loyal customers since.\n\nThey are always so friendly and professional. They get to the point without the BS other car shops give you.\n\nCall ahead to reserve a spot, depending on where you live, they can have someone bring you back home. You van also schedule it so you can wait for your vehicle. They're happy to work with you.","useful":0,"funny":0,"cool":0},
{"review_id":"bjZaTbTBx7M0DD-GLo_gwA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"X1dOyxoGQnKavvl6lXxjMg","stars":5,"date":"2016-05-08","text":"THIS is customer service. Was greeted at the door and treated like a person, not a number, not a sale - throughout the transaction.  Vanessa is WONDERFUL, KIND, the ABSOLUTE BEST. She was super attentive and honest enough to admit it when she didn't know the answer off the top of her head, quick to find the answers to the questions I had. AND she addressed my son who wanted the phone upgrade. \n\nEven though they closed at 8 and I said it was ok to not finish file transfers, I never saw any frown\/change in expressions (from her or the rest of the staff), she remained sweet and pleasant. Thankfully, we walked out the door before 8:10. (I hate being the last customer anywhere, people should be able to go home on time). THANK YOU for the best service!","useful":0,"funny":0,"cool":0},
{"review_id":"t-_4Auszs153YK24GlX07A","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"M67Jq1BXsE5sQUoJd1q86w","stars":5,"date":"2016-06-11","text":"THE cure for teen AND tween angst. (At least for the duration of the show). My children are tough spectators and I saw all their smiling teeth from the end of the row. We enjoyed the show, appreciated the variety....music, magic, dancing, bit of comedy.\n\nClearly we were not the only ones because...looking around, I saw about 80% of guests (of literally all ages) at the edge of their seats. Definitely a lot of 'wows' from the crowd too.\n\nI love the intimate theater, made the whole show more personal. I won't tell you everything that happens, but it's pretty amazing!\n\nWhether you come feeling blah, upset, irritated. or happy, you're going to leave with a smile, because that's how entertaining is.","useful":5,"funny":0,"cool":2},
{"review_id":"PsCKhyOlzRaNxssse140CA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"4r5yWUyeo2EDc5DDsAMh9A","stars":1,"date":"2016-08-03","text":"Came here for one of the school 'book fairs' to get school books for kids. Last 2 years have been ok-good.  Books were arranged per grade and most of the books were on tables. This year, terrible. Literally half the books were on the floor, under tables, some book covers were wet with who knows what. \n\n3 people pretended not to hear me trying to ask a question and kept walking. Another elderly lady glared before I could even approach. One did stop to answer a question  because I blocked his parh(where are the books located?since they usually have the books in 1 area). Apparently by the windows and books are in no order, I'd have the find them myself because, again, books are in no particular order and he promptly walked away.\n\nBooks were a mess, from K-12 with no particular rhyme or reason and one parent who dared to ask 2 teenagers for help was told (we're just here to hang up posters). A third came and that parent asked her and she said she was only there for 'moral support.' More of the teen staff walked by looked at us 3 lost parents and proceeded to talk and walk away.\n\nOne lucky parent did get help from someone knowledgeable willing to help and he at least gave a general idea where certain grade level books were.\n\nIf it weren't for my lids' books, I'd never go here.","useful":1,"funny":0,"cool":0},
{"review_id":"7ZvAACF7mrMkmqaWsxk4Aw","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"qhf2REVUrJizrYBrOpYqMA","stars":3,"date":"2016-05-29","text":"Been here 2x kinda slow service. Once at half capacity\n and full capacity at the venue. Slow service the 1st time. Molasses speed the second time since it was packed. Suggest scheduling more servers for a more popular comedian on a long weekend - just sayin.'  Kudos to the nice ladies who greeted, seated, and served us tonight. More upbeat than the 1st time we were there.\n\nIf there's a good comedian scheduled, we'd come back again and hope for faster service.\n\n3 because it was pretty warm inside.","useful":2,"funny":0,"cool":0},
{"review_id":"AA2dmbmRc3Jxz5ZiJr90dA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"24Td_CQH1bonWKff1rt2vg","stars":5,"date":"2016-11-06","text":"Matt's lives up to its expectations. Simple menu, great tasting food. Definitely busy, with fast, super friendly service. I don't know what else you can ask for. Their thick cut bacon is so tasty and filling I could not finish it. That says a lot lol.\n\nStop by after your morning stroll, bike, or hike , you won't regret it. Btw, their lemonade is made with honey and it's soooooo good.","useful":0,"funny":0,"cool":0},
{"review_id":"Dd4LmVmcqaRx7_xBm6sZqA","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"MXI3o5dhAV5LA-N9WIABOA","stars":5,"date":"2016-05-28","text":"We've come here for years and decided to try restaurant week. Little longer wait than usual (2 minutes instead of right away to be seated) because of the dinner rush hour on a long weekend during restaurant week. Boo hoo right?! lol I say it's still great service.\n\nPlace was full but our server was awesome! Super friendly and patient. I love to observe if servers treat their customers the same way and he did, super nice to all the groups. Took the time to explain the dessert options. KUDOS! \n\nThe food? Always top notch. Cheese crisp, pizza nortea, and of course chips and AMAZING salsa. No room for all the sopapillas and to die for ice cream, but we took it home and kids devoured it.\n\nI'm not a fan of tequila in general but the skinny margarita was strong and frozen melon margarita went really well with our meal. 2 days left for restaurant week. Go have some fun and eat wonderful food.","useful":1,"funny":0,"cool":0},
{"review_id":"TnnH_ljb6Qi7IvtcfGG6_w","user_id":"0pf5VuzE4_1pwj5NJHG5TQ","business_id":"RTWR4yDwK9uHgYycUC6_SA","stars":3,"date":"2016-03-06","text":"Decent place, friendly people.  Decor could be a little better, more interesting and such.\n\nBUT, we always have fun when we come here and the Groupon for this is great!","useful":0,"funny":0,"cool":0},
{"review_id":"x-cCtp5I0QNWufqTb8gg1g","user_id":"-FZAhOfXQ3mYFae83hLIHA","business_id":"YHCseOJ93wJh0gBcii_2qA","stars":5,"date":"2013-06-22","text":"Best blues for a 100 miles in any direction on Thurs, Fri, Sat.","useful":2,"funny":0,"cool":1},
{"review_id":"vBGAlg5DeTsQT4MayIM8vw","user_id":"w6EGNGFCBqZtmJ5ytPw4jQ","business_id":"M_lLpjNIiGiuwxB-lNtgFA","stars":5,"date":"2015-04-01","text":"Yesterday I took my precious Nahla in for an appointment that I had made regarding allergy treatment.  She was having a moderate reaction ... and I was concerned about how I should handle the next step.  They give technician support with allergy shot treatment and Dani came out into the lobby to talk with me.  She spent a few minutes explaining that some of the allergy shots might cause a flare up etc.\n\nThey attempted to save me the Doctor exam fee by having Dani the technician \/ nurse talk with me about the follow up care. I was adamant about having Dr. Hillebrand examine my dog and told them that I wanted the doctor to look at Nahla's eyes and into her ears.  I was a bit emotional and somewhat curt due to a disability that I have and certainly not intentionally toward the staff but afterward I realized it. \n\nI've taken my precious Nahla here for the past couple of months and I can't say \"thank you\" and how much \"I appreciate\" the staff here enough.  Every time I've been here if I ask a question about anything I either get a direct answer or the staff member will tell me that they're not sure but they'll find out.  That's super impressive to me because my questions always get answered.  Some veterinarians might play politics and\/or place the blame on the client and\/or others, not here.  What I've found here is conscientious people on all levels of the staff who works here.  They know dogs ....    \n\nDr. Hillebrand did the examination .. made a couple of suggestions and I left with some medicine.  Yesterday Dr. Hillebrand could have suggested a steroid shot and\/or any other more expensive treatment.  BUT he didn't ... instead he dissuaded me from thinking about an instant solution.  With his suggestions and the $12.00 medication Nahla is so much better this morning.  She slept good last night and woke up perky this morning.  I'm pretty shocked at some of the negative reviews on here ..... this Animal Hospital lives up to it's motto .. they really do treat pets like family.  Thank you Dani, Dr. Hillebrand, Amanda, Jennifer and the rest of the staff.  I'm happy that Nahla and I found Dreaming Summit Animal Hospital  .........","useful":3,"funny":0,"cool":0},
{"review_id":"qR4CPabhuuZyMA7_pNr8GA","user_id":"w6EGNGFCBqZtmJ5ytPw4jQ","business_id":"OjpZ3piwJ-ARzHeUVlngTQ","stars":5,"date":"2015-02-11","text":"I shop here often.  The first time in this store more than a year ago I noticed the cleanliness of the store, the friendly and well educated staff.  If you ask one staff member a question about something that they are not 100% certain about .. they'll ask one of their other team members.  They've answered questions about wine, scotch, cigars etc. and every time ... the answer I was given was correct. Consistency ... :)\n\nIf you don't like a product ... bring the remaining back and you get either a refund or an in store credit.  With a gaurantee like that .. combined with intelligent answers, wine tastings, scotch classes .. in their modern top of the line classroom in back of the store ... WHY would you shop anyplace else?  I love this store ... thank you Total Wine and More!\n\nRetail businesses can't make every single customer happy.  All of us come from unique backgrounds in DNA, upbringing, individual wants and needs etc ....","useful":0,"funny":0,"cool":0},
{"review_id":"x_ydI-nsl1_CxHFNknfZAg","user_id":"dvh2Gnvr6OPNz0u7_FYtIg","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":3,"date":"2017-11-14","text":"If you want you want to get away from the strip this is the hotel for you. \n\nPros: Free parking garage and Hash house a-go-go Restaurant (better than the one on the strip and lines are way shorter). \n\nCons: Deposit fee and check-in. We stayed for 3 days and 2 nights which was ~$300. But once you check-in its additional $50 per night deposit fee they charge on the card you used to booked the hotel with. So actually at the end of the stay my total card was charged $400. But after 5-7 days I was reimbursed the $50 per night, so $100. I wouldn't recommend staying here if you plan on staying for more than 3 days. I also heard from one of the hotel guest instead of charging the $50 per night deposit at check-in you can give $200 cash for whatever nights you are staying  and when you check out you get the $200 cash right away. \n\n\nThere's also check-in\/out kiosk. In which people didn't use, so there was a long long line for the hotel registration.","useful":1,"funny":0,"cool":0},
{"review_id":"Rp3L3s76vWc2VH_Ts18tsQ","user_id":"xdm-O1HveAvpwfz7rF1Hbw","business_id":"TqL0ytKAucWdW2mR7EbayA","stars":5,"date":"2014-02-20","text":"Best Indian food I had in Pittsburgh.\nLove the Saag! Highly Recommend it!","useful":8,"funny":0,"cool":1},
{"review_id":"uAZjB6MOGsXJzeZqBHbAZA","user_id":"T8p2wQoIx5kRq3-rRMbb_A","business_id":"F80c5w4dUF1QoFcJG4JrmQ","stars":3,"date":"2015-08-09","text":"Foods great! Service poor. Not managed well m, can't turn tables. \nCarpet in front smells horrific. \nFurniture and floors need deep clean. \nWait staff looks unsanitary, dirty nails and hair. \nA shame for Rocky River.","useful":0,"funny":0,"cool":0},
{"review_id":"ikVYBCJ-m9UaFkY6vxHbnA","user_id":"T8p2wQoIx5kRq3-rRMbb_A","business_id":"intKyiipUlHDWi_chv0f3A","stars":5,"date":"2017-06-25","text":"Trying to figure out what to eat... read over the online menu for Merchant St., and decided to try it out. I couldn't be more pleased- the food was fabulous for my \"clean eating (Paleo) life style. \n\nMy husband and I both agreed- we will be back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"TBNhi1eTTSNOF25kPUsRKA","user_id":"T8p2wQoIx5kRq3-rRMbb_A","business_id":"OKYp_AwhXfqL_0Pgw1WB9Q","stars":3,"date":"2017-01-16","text":"Food is okay- problem is they need some adult supervision in there . I think they are understaffed or the staff they have need better guidance - had to ask for silverware (none in container on table) had to ask for more coffee , wait time after ordering extraordinarily long-food was cold.","useful":0,"funny":0,"cool":0},
{"review_id":"qwhmsoUcL-7Z31t0CYm5DA","user_id":"WR4Jw9VofuPZxU7EAG0TQw","business_id":"z6jJyAdqFhtH8TbfRibzQw","stars":5,"date":"2015-02-28","text":"I've been here a few times recently for oil changes and also repairs. The workers are very courteous and helpful. The prices are competitive and reasonable, which I very much appreciate. Thanks, Conrad's!","useful":0,"funny":0,"cool":0},
{"review_id":"5Ud8MCxfpQDDMId3cOMmKQ","user_id":"nLcQKpECIJzjE3VDM7HI_A","business_id":"ODJJdWPVThx0xQxbZlLE9w","stars":5,"date":"2013-09-17","text":"Madame Et Monsieur is an Excellent & clean facility. Friendly staff! Great service!!! \nI highly recommend it!","useful":0,"funny":0,"cool":0},
{"review_id":"UOF3d3KodUR8BkRpQKcdHg","user_id":"nLcQKpECIJzjE3VDM7HI_A","business_id":"iIwKW2cBAxjElE8eUzjwqA","stars":1,"date":"2014-06-12","text":"Burgers are good but that's what you expect with bobbys name on the door. The place was pretty empty with about 10 customers and about 12 employees just standing around. \nThe service was less than mediocre. Brianna who brought our food knocked my sons drink all over him and didn't have the courtesy to apologize. In fact she said she didn't do it when clearly she did if other customers said they saw her do it. It was obvious that there wasn't supervisor presence in the establishment. It's going to take customer service for this place to survive on the strip. You get what you pay for here. Good burgers and no customer service. This proves it is is hard to find good help! I expect more from bobby flay.","useful":2,"funny":2,"cool":1},
{"review_id":"UCB0PL9OJDJKsYR-uDrvVg","user_id":"3PKvkFpeV4iHXiWwKm1IVA","business_id":"FGRw7knltfK9q4Z6_hev6w","stars":5,"date":"2011-11-12","text":"Best \"Dam\" tour, so much you won't mind spending most of your day, with this tour group! Oh yeah, & the Grand Canyon\/Hoover Dam, wasn't bad either.","useful":0,"funny":0,"cool":0},
{"review_id":"StvaoB4RaTxKcXp6uu9uZA","user_id":"vX06zW6rsonnhXxXQq61IA","business_id":"yEmauTNLWgYhD_2otzlUMw","stars":5,"date":"2016-04-19","text":"I absolutely love kirks studio! They have the most wonderfuk staff and my children (3 boys ages 11, 10, 8) have taken guitar for over a year now and have just flourished! I would recommend to anyone and everyone. Their yearly showcase performance is amazing as well.","useful":0,"funny":0,"cool":0},
{"review_id":"gR-c-oVPm58ZJS2vJpsgLg","user_id":"vX06zW6rsonnhXxXQq61IA","business_id":"bEv7e3-xigK107P-7gFaKw","stars":5,"date":"2013-12-16","text":"I had a wonderful experience with Drive time on bell. This is the 2nd time I have purchased with them. Everyone was so helpful and really went above and beyond to get things taken care of for me. I was so happy with all their protection plans and they stay true to their word.","useful":0,"funny":0,"cool":0},
{"review_id":"RkQ6Kaz5zUB04XEDKVDsBQ","user_id":"vX06zW6rsonnhXxXQq61IA","business_id":"4iFYsHDzkuf3JjSzhaNd2g","stars":5,"date":"2013-03-31","text":"I am so happy with Shane co. They have exceeded all of my expectations. Since i purchased my first piece of jewelry 4 years ago from Shane co I now refuse to shop anywhere else. The quality of their work is phenomenal. They have gone above and beyond for me and saved me a lot of heart ache. Thank you Aaron (manager) for all of your help and for making every experience with Shane Co. a wonderful one!","useful":0,"funny":0,"cool":0},
{"review_id":"GCt3N2mFhq6aOH9flF5_3Q","user_id":"8Du42UNHof7va5isCFtOig","business_id":"KFC7mrcdUUeS0ueUCayyEA","stars":5,"date":"2015-04-13","text":"We reserved a Bollywood private dance class to celebrate a friend's birthday. The staff were very nice and friendly and gave us an acceptable rate. The instructor was half an hour late so to compensate they gave us more time and charged us almost half the rate. The next day they also sent an apology email which was very sweet and professional from their side! The instructor was fun and flexible. We all had a great time and would definitely refer them.","useful":0,"funny":0,"cool":0},
{"review_id":"RV51yOy28YOz9E_oA4dcnw","user_id":"8Du42UNHof7va5isCFtOig","business_id":"KWf3sEG-S4xY0RgiwGprvA","stars":1,"date":"2015-07-13","text":"This is the worst hairdresser I've ever met! He was rude, clearly arrogant and ended up messing up my daughter's hair! When I told him that she had a side longer than the other, he barely replied that that's her hair! Totally incompetent he shouldn't hold a scissor ever again!","useful":3,"funny":4,"cool":3},
{"review_id":"EqMdbMGYOxiqV2f_o1W-pA","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"1WpnMTyWtLmnGCkAfRPsLA","stars":4,"date":"2011-12-30","text":"I was gifted a visit to eye stop for myself and my daughter and was able to get eye exams as well as 2 pairs of glasses each.  I had read the previous YELP reviews and was a bit apprehensive when I was setting the appointments.  Suzanne answered the phone and was really personable.  She was just like the review had said, a positive in the experience.  She was able to set us appointments right away that worked for our schedule.\nThe following day we went to the location and were greeted by a gentleman and instructed how to fill out paperwork.  We had plenty of time to look over frames and although the selection wasn't my particular taste, there were plenty of current styles  to choose from.  The eye exam went off without a hitch, the dr was friendly and efficient and it was done quickly.  After the exam we were given more time to look at frames and Suzanne made suggestions.  We settled on our choices and were offered the option of extras but happily, I didnt feel pressured.\nAll in all, it was a very nice experience and I would definitely recommend this location.","useful":0,"funny":0,"cool":0},
{"review_id":"6E2y72J95IySgL3rKeu-JQ","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"nCNQLl4yDfLHTst9kwglOg","stars":5,"date":"2015-08-11","text":"My 20 year old daughter was referred to this office by a friend and what a great referral.  We visited this office on a Thursday to inquire about wisdom tooth extraction and found a very welcoming Staff.  Sandy at the front desk was very friendly and informative.  Not only did she make us feel comfortable, she told us quite a bit about the Dentist.  Being that my daughter has always suffered from dental anxiety, it immediately put her at ease.  The young ladies that did her x-rays and initial exam were also quite lovely and did not make her feel uncomfortable or self conscious and she was very relaxed during the cleaning.  The Dentist is soft spoken, kind and very articulate.  He explained the procedure and the risks as well as the benefits.  What a great Dentist!!  She scheduled the appointment for the following day and had ALL 4 removed at once.  Previously she had never had dental work without sedation and she was so at ease that she was able to move forward with none. This is huge considering how fearful she was walking in that door.  I was so impressed.\n\nI highly recommend this Dentist, this office and this Staff as a whole.  Thank you Central Valley Dentistry.  We look forward to future visits.","useful":2,"funny":0,"cool":2},
{"review_id":"dFO1rlBJX7ucYxIXfYNIEg","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"b38jAVBWRVstPsEQe7rzMQ","stars":5,"date":"2014-01-22","text":"I visited Banfield with a sick dog.  He belonged to my Dad and I am not real familiar with how vets work.  The people here were wonderful.  They were warm and gracious, it was a stressful situation made better by the kind women that work there.  The Vet was so positive and has a really funny grin!!!  All in all, I would definitely recommend this location to anyone looking!","useful":0,"funny":1,"cool":0},
{"review_id":"dvS9VrOJtIuIoyl4OydfHw","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"74oVCMIk5NK6nMHwCbfMYQ","stars":5,"date":"2012-04-24","text":"the guys @ this location could not be more amazing!!  my daughter had a flat and needed to get to a performance and the guys at Metro opened the door shortly after they were supposed to close and put tires on the car for us immediately.  they gave us information regarding the safety of the type of wheels on her vehicle and made an extremely stressful situation sooo much easier.  I would absolutely recommend to any of you in the Phoenix Metro area that you choose this discount tire when in need : )\n\nthese guys really went above and beyond for my daughter and I, personable, friendly and helpful even at closing time on a Saturday!","useful":1,"funny":1,"cool":0},
{"review_id":"TI2PUzjvLpzRMS5NqzQbGw","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"aQ5dTU00g8RPZnwHDMaDKw","stars":5,"date":"2011-12-28","text":"My daughter began taking classes at Encore 6 years ago.  At the time she had a bit of an attitude and didn't do too well with other girls.  She instantly fell in love with Regina and took numerous classes from hip hop (her first choice) to ballet, jazz, and lyrical.  I watched my daughter blossom into an amazing young woman as well as an amazing dancer.  Regina involves the girls and boys in the competition experience so that they have more opportunity to learn confidence and self esteem.  My daughter has had the opportunity to travel to California and Las Vegas with the studio to participate in Nationals and Master Classes.  Encore is not JUST family owned, it is a family environment.  I checked other studios but found a less than friendly welcome to new participants.  I couldn't recommend anything more than Encore and the skills that your child learns.  My daughter now works at the studio as well as dancing and my youngest daughter is taking her first classes now.  I am looking forward to another 6 years or more with the Encore family.","useful":7,"funny":0,"cool":0},
{"review_id":"KlBLzfE29ZdFapuD9Az2Ww","user_id":"CUAl6BGYGk28lA_W4PUH-A","business_id":"ArqA2I0DgZbmWmdS4wf4xA","stars":1,"date":"2014-01-22","text":"Today, my oldest daughter AGAIN visited the school to take her sister for a birthday hair color... AGAIN, rude... what were we thinking... I hope they are not teaching their students these POOR customer service skills.","useful":5,"funny":2,"cool":1},
{"review_id":"3YH6-r5Y1kM7QOW_PSyzug","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"K1xLoyHmmkaOKIXs2FUVeA","stars":1,"date":"2015-06-12","text":"Can you say BED BUGS?! My boyfriends uncle stayed there for two weeks and came back with bed bug bites all over him!! . I understand it's a weekly  but damn clean your shit!!!","useful":0,"funny":0,"cool":0},
{"review_id":"NcE4rD4Tt-MGJx4WHKrshw","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"MVgTNrbHjQnRNY4QaYIrbQ","stars":1,"date":"2015-09-02","text":"Every time I come here to buy pure balance dog food, they NEVER have the flavor\/kind I need. Also, the fish department is very poorly taken care of. Don't sell living things if you are not going to properly care for them as needed. The Fish are over fed which can kill them, and their tanks look super dirty. Sure they are just fish, but I don't see the need to sell them if you are not going to take care of them correctly. You're selling people sick fish which isn't fair to the fish nor the people. It's a disgrace","useful":0,"funny":1,"cool":1},
{"review_id":"Ttx4ARBmmilWdLX8xYqB6g","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"qJ18IGaDsQtzJ6v2UzkdcQ","stars":4,"date":"2015-09-12","text":"I tried this place for the first time tonight and was very impressed! I normally would go to Panda Express but their quality has gone down so much I decided to come here! What a difference! Orange chicken is very tender compared to pandas crunchy dry \"orange chicken\".. Plus you get so much more food for the same price of just a meal with 1 side at panda. Definitely coming here from now on!!","useful":0,"funny":0,"cool":0},
{"review_id":"aZwbI0fdvioBhulQvonj2Q","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"RlWKtC4DZaL240cJkaaRBA","stars":1,"date":"2015-09-07","text":"TAKE CARE OF YOUR FISH OR DONT SELL THEM. Those tanks were so dirty a plant that was once green was covered in black gunk, so much food it could feed 20 fish when there was only 2 fish in there( overfeeding kills the fish). I get they are just fish, but it takes a bit of work to keep them healthy.... Shame on this place. Now this is the second Walmart that I've been to with the fish area not taken care of whatsoever. Will be calling corporate today.","useful":1,"funny":0,"cool":0},
{"review_id":"K6ns6Us5pzXQL4L01vUz4A","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"w55IYhyLHUdsRlo_EvMmNQ","stars":3,"date":"2015-09-06","text":"The food is great.. But I feel like the service and quality has gone down since I came here a couple months ago. Food took a lot longer than the last time. They seem really short staffed for a Saturday night. Couldn't even get a Togo box for my pizza.. Got offered a piece of foil instead.. Love this place but I just feel if they tried a little harder to make the guests happy; they would get better business.","useful":1,"funny":0,"cool":0},
{"review_id":"Fdzu9MZzSxJ_32AIgs906Q","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"KIWUFC4iSjUH4v4t_N2V6w","stars":5,"date":"2016-07-01","text":"This place is worth a try! They are very clean, nice and give very good pedicures! Went in for a gel polish and noticed it was dull in some areas so I went back and she fixed it for free no questions asked! I love that they are willing to please their customers because I can be \"nit picky\" at times. The lady Nina who did my mothers nails did a FABULOUS job as well. she definitely takes her time. Give this place a chance! :)","useful":0,"funny":0,"cool":0},
{"review_id":"gebKlw27iZyMs2Hd-RAicg","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"bEIlfHvXs1hxTamwv3Wdzw","stars":1,"date":"2015-10-07","text":"I went in today to deposit some cash into the ATM. After I was done I needed a $100 dollar bill to be broken but the lady told me she was unable to do that... UHM, you're a bank that I pay to use and you can't break my money? What am I paying a monthly fee for then? to store my money? I can do that under my mattress for free. It really irritates me that I have to go completely out of my way to break my money( and spend unnecessary money to break it)when my bank should do that for me. You know, since you're a bank, A PLACE FOR MONEY. Absolutely ridiculous","useful":1,"funny":2,"cool":1},
{"review_id":"s1YJhuGNI1F_3yrQU0ESQA","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"VrKja5O6w0aJs-sFPMTtVw","stars":3,"date":"2015-07-23","text":"This place has gotten too picky. Brought items in the other day and they didn't accept anything. Brought in a couple pairs of almost brand new VS yoga pants, nice miss me jeans and stitched jeans. I can understand them not wanting my more basic items.. But the reasoning for the jeans? \"Bootcuts don't sell\". Pretty sure not everyone wears skinny jeans!! Now I'm selling my items on Facebook for more than they would've given me :) you guys will eventually lose all your business due to being beyond cheap with your buying and being extremely picky.","useful":1,"funny":0,"cool":0},
{"review_id":"ycZl9gEPyGWpSsw2i6hIxA","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"ElZ0upBJAtCed5TEGh3xoQ","stars":5,"date":"2017-04-26","text":"This place is a hidden gem! I made an appointment with Tiffany for a full set and she did an amazing job! I can not find one thing wrong with my nails. She was very friendly along with her husband who did my pedicure. He did an excellent job as well. They were both very professional when it comes to running their business. I am a highly satisfied customer right now, and I will definitely be coming here regularly!","useful":1,"funny":0,"cool":0},
{"review_id":"QoYiWOqoG7xlfqqGb2yIXQ","user_id":"gpqjvuBvOeyZPCPRAgLIjQ","business_id":"FczpP53EAcXsfIQMxp9p4A","stars":1,"date":"2015-03-17","text":"I'll give it a 4 star for their service.. But a 1 for their haircut. My boyfriend went in for a simple buzz cut and it is so uneven I wanna make him go somewhere else to fix it cause it looks so bad. Everytime he comes here they can never give him a nice even buzz cut.. lol how hard could it be?","useful":2,"funny":2,"cool":0},
{"review_id":"dQtfaUzKgzbTJQYkwycEww","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"IVnGPHdTyu_GbLo9mXj98w","stars":5,"date":"2014-07-14","text":"Love that it is hidden away from the other ramen houses on spring mountain. Food is tasty,  I like the shoyu broth but have also enjoyed miso. My son loves the curry,  has good flavor just no potatoes with it.  Doesn't stop him from ordering it everytime. Prices are great, doesn't hurt your pocket.  Atmosphere is nice and cozy,  small like other ramen spots but never crowded when we come so not stuffy.","useful":0,"funny":0,"cool":0},
{"review_id":"qJ7-xHGEjZXuqqqkDPvqkQ","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"W7DwXa_7LNmETFHSQJZ2Lg","stars":3,"date":"2014-05-27","text":"Went there for Mother's day,  party of 3 around 9pm. First time customers, we all did the AYCE. Sushi and side dishes came out pretty quick.  Side dishes were great,  sushi was good but I've had better. My son didn't care for the uni,  as it is one of his favorites. Just the quality and lack of taste wasn't up to par for him. He ordered one of the rolls with crunchies but it tasted stale. My husband who likes spicy sms hot couldn't handle the 911 roll. The spicy tuna was great but it was an even toss up of good and not so good rolls.\nNo sashimi (but most ayce don't have), No raw oysters (again usually you don't see that for ayce). That's okay I have my favorite spot where I get both in the ayce. \nI love sweets and the bonus is that you are not limited to one dessert only.  So I really enjoyed the lychee sorbet,  mochi ice cream and tempura ice cream.\nThe service was good, around enough to take orders and clear plates.  They just never offer refills,  even when our cup is empty we had to ask for the refills. \nI would go back,  but not a big deal if I don't make it.","useful":0,"funny":0,"cool":0},
{"review_id":"7hBUCf3HOAbWA7pvTZ0oqQ","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"MyTsAeShB9pcWP84GSTAdw","stars":5,"date":"2014-04-20","text":"You can never go wrong with the bulgogi nachos.  The chips are always crisp,  toppings are plentiful and portion size will fill you up. The fusion beef sliders with fries are great. Who knew a bulgogi cheesesteak would be so delicious, they did that's why it's on the menu. I love getting the pork belly skewers as an appetizer. I always leave full and satisfied with some leftovers to take home.","useful":0,"funny":0,"cool":0},
{"review_id":"kgNUXSrIbIm4U2BNib8Qug","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":5,"date":"2012-02-28","text":"The miyagi burger was awesome, the black and green burger had a sweet flavor of deliciousness. Enjoyed some sweet potato fries and truffle parmesan fries with the burgers.  Definitely returning soon to try more burgers.","useful":1,"funny":0,"cool":0},
{"review_id":"46MXnsnS9toQdUhV_vKfYg","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"xJOzuaKtgGYqmWXrF4P_RA","stars":5,"date":"2014-12-15","text":"Hubby had an awesome experience! No wait at check in, front staff was very pleasant,  20 minutes for a root canal. Painless experience, Dr. Was thorough throughout the process.  In and out, less painful than a deep cleaning. Recommend to anyone who needs work done.","useful":1,"funny":0,"cool":0},
{"review_id":"7DkfLgbFle-3QdDcYo3NmQ","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"-PGsEXB6DFTVKa1eDOlzWA","stars":1,"date":"2016-08-21","text":"Second time at this location and it was horrible. I work in the restaurant industry so it usually takes a lot of wrongs for me to think service sucks. Upon arrival not more than 10 tables in the entire restaurant and got sat promptly. After 4 minutes of server (Tara) not even stopping by to greet us, I asked the first person who walked by (happen to be the manager) if we could get a server to offer us drinks. He took our drink order and she finally rolled up right before he delivered the drinks. We were ready to order so she took our order and for as slow as it was it took 26 minutes for our food to come out. She asked if we needed anything and we said no, but after a few bites into our meal we noticed my son didn't have all the condiments that came with his fajita dish so we waited a bit, then looked around and saw one server tending to her tables and our server nowhere to be found. I asked the other server in passing if she could get our server but instead she offered to get the missing condiments. As always server came by just a little to late. After finishing our meal I was looking around at an even slower restaurant with fewer tables and our server nowhere to be found again. Went up to the cashier, paid the bill and of course as we were leaving here came the server always a minute behind. Not sure if she was doing side work, eating, taking a break or just hiding but it's sad that every time I looked around the restaurant she was almost nowhere to be seen. I guess my problem is if you're that slow there's no excuse for poor service which is exactly what I felt I received. \nTo be honest this location is 3 minutes from my house, but I'd rather drive further to the Tropicana location for better service and food.","useful":1,"funny":0,"cool":0},
{"review_id":"o1qNGM7k3eeu0MCTT2Ks6w","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"YkAcruXbhN6sHDXn0jcySw","stars":4,"date":"2012-03-15","text":"Found this spot right around the corner from my house. It was a quick stop for my son's breakfast before school. Didn't have time to review the menu but my son wanted some bacon, eggs and pancakes. We ordered the super breakfast combo which is 3 eggs, bacon, ham, sausage patty, pancakes and hash brown or fruit. We upgraded the pancakes to the banana nut and substituted rice instead of hash browns. Portion size was huge, my son and I shared and took home some of the leftover pancakes. The banana nut pancakes were great, you could taste the bananas and every few bites you got some nuts. For our first visit which was a quick stop we really enjoyed our breakfast and what we paid about $10. Plan to come back to check out more of the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"igf8qa4uqeApRYwnrmcnWg","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"WPCgtEG-bJt0cZtnM-x7yw","stars":5,"date":"2012-02-28","text":"Loud, fun and full of excitement! This high energy, audience participation show was awesome.  Great family fun but if you aren't up for non stop noise bring your ear plugs. Be there on time because the opener is a must see.  Seating is general admission first come, first choice.","useful":0,"funny":0,"cool":0},
{"review_id":"DlblRe4ctZYiVX3CkANEPA","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"13fTEZcL7ayGnkDdzaBSNQ","stars":5,"date":"2016-08-21","text":"My 15 year old son had to have surgery and this location was referred to us by his surgeon. From our arrival, until his discharge we were completely impressed with the friendliness and professionalism of the entire staff. They made him feel comfortable, walked him through the entire process of what to expect and was very thorough with his prep. It's amazing how with every patient they kind of have a check list of the same questions and although repetitive you never heard it in their tone. Instead they always sounded respectful and concerned while going through the process. They were helpful in answering all our questions and left us satisfied in sending off our son for his surgery. We even received a thank you card a few days later with all the staff's signed. \n\nDefinitely  recommend for a safe, clean and professional experience for your surgery.","useful":2,"funny":0,"cool":0},
{"review_id":"l2g2TFoLujJyZ7Ky6V497Q","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"ZjzfYSCfmGIj3O1dOBI26g","stars":1,"date":"2014-12-15","text":"I know most Doctor appointments you spend most of your time sitting in the room waiting but we got here 20 minutes early.  Got pre screened by the nurse at our appt time which took about 10 minutes and now have been sitting in the room for an hour.  I had to write this review before seeing the Doctor because this is incredibly ridiculous to sit here as a new patient and if I'm lucky by the end of it all get 5 minutes of his time. At this point,  I suggest finding another Doctor.  This is all based on everything prior to seeing the Doctor.  I waited so long,  why not write the review in the exam room.","useful":4,"funny":0,"cool":0},
{"review_id":"FjxGEOAbmzPFFn9D_KiwqQ","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"sNVGdeOPeitJ3OWUQBINzQ","stars":4,"date":"2014-04-21","text":"Food still taste great, service could be better. Came here at 8am. 4 tables and me. They seem to have a full staff, cashier, busser and servers at least 4 of them, so why is the guy next to me waving for attention because his coffee cup is empty and I noticed it was like that for a good while. At one point, not one employee was in the front of the house. Oh well, again the food was good but they specialize in red velvet so how can it not be.   Minus one star for service that could have been a little better.","useful":2,"funny":1,"cool":1},
{"review_id":"i6ROnMHNNNxCUpelGjFN_A","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"Z1E36owKeeZKDL-9ZuanJw","stars":5,"date":"2014-04-11","text":"We visit numerous times and I finally decided to write my review.  Atmosphere is like a small family restaurant,  low-key and relaxed.  As a family of 3 we usually do a 3 combo meal (2 orders of spare ribs and 1 order beef brisket and the 2 sides baked beans and potato salad). Never fails that the spare ribs are always soft and easily fall off the bone.  The meat is so tender and flavorful perfect for me.  My husband and son love sauce and will usually add more barbecue or hot sauce for themselves. The beef brisket is always tender and never chewy where you can't get it down. This usually fills us up,  if we have a bigger appetite we might order more beef brisket or the barbecue chicken.  Sometimes they have special sides like the dirty rice which my family love. We usually visit on Sundays for some barbecue and Ricky is always there to help take care of us.","useful":3,"funny":2,"cool":1},
{"review_id":"ocpWvLrQbksUubB9CRX-SA","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"6HdzmAatFoB8UDep4n9QIw","stars":4,"date":"2017-03-08","text":"Joined them for national pancake day. Walked in and was lucky enough to get a table right away. Our waitress came by to offer drinks and we ordered the free pancakes at the same time. Restaurant was full with a wait growing shortly after we got sat. We started to notice tables were walking in and getting their pancakes under 5 minutes while we sat there for 20 minutes looking around. Noticed I didn't see our waitress, stopped the waiter walking by  and asked him about our waitress, when still no one came asked another waiter Ansiem for the manager. He asked how he could help and when we asked about our waitress and our order, he went straight to the kitchen grabbed our order, delivered and apologized for her leaving without notice. He continued to check in on us and made sure we were okay. Thanks to Ansiem he made our experience the best we've  had at any ihop location.","useful":0,"funny":1,"cool":0},
{"review_id":"LQU3YGCeQbv4G6-gKQgTkA","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"j7HO1YeMQGYo3KibMXZ5vg","stars":3,"date":"2014-04-11","text":"The Hawaiian plate was okay.  Kalua pig was good,  lau lau was a little dry,  squid luau didn't have the sweet coconut taste and the luau leaf wasn't cooked long enough. The lomi lomi salmon tasted great, Mac salad had enough mayo,  poke was good but I've had better.  I wouldn't try the Hawaiian plate again but I did try the Mahimahi sandwich and it was crispy in the outside and moist in the inside.  Quality is average.  I would eat there again. I just wouldn't go out of my way to visit.  I still have other local Hawaiian food spots that I take family and friends when visiting.","useful":0,"funny":0,"cool":0},
{"review_id":"oYKiMzYjvjSfyZSuxgyLLw","user_id":"3Pv_rjPLE7p6mALjtKKyDg","business_id":"gBy6UXTpoSHhW6qd15XU0g","stars":4,"date":"2014-03-17","text":"Had lunch here for the first time and was pleasantly surprised.  Hidden in the lakes,  a gaming lounge with separate dining area.  Dark and cozy,  small dining area with one server and one busser. I had their corned beef and cabbage with Irish potatoes and carrots.  It was served with soup or salad.  Portion size was hefty as I took home a third of it for later.  The corned beef had a lot of flavor and the sides were soft not mushy.  My husband had the prime rib dip which included some green peppers and onions to add for a more flavorful sandwich.  It came with sweet potato tater tots which was delicious.  Service was fast and friendly and the gaming side looked rather busy too.  We will definitely be back.","useful":2,"funny":1,"cool":1},
{"review_id":"SQg8cJmVBRTmC-PzmvGZpQ","user_id":"Rq22e1aYxOY6aCkLKnTZDA","business_id":"5FIOXmUE3qMviX9GafGH-Q","stars":5,"date":"2014-07-08","text":"This place is awesome! I love the \"No Harm Chicken Parm\" and their soynamis are delicious. Best vegetarian\/vegan place I've been to in Arizona by far. It can get super crowded though, but that just goes to show you how good the food is.","useful":0,"funny":0,"cool":0},
{"review_id":"GrqFIssIGjDnMafWFfiCSw","user_id":"Rq22e1aYxOY6aCkLKnTZDA","business_id":"R3B_ibZvlrgzch_UkYQkrg","stars":1,"date":"2014-07-08","text":"Tried to eat here three times during a convention at the hotel, it was way too crowded and we couldn't find a seat. Staff didn't try to help or acknowledge us for a good 15 minutes that we wandered around looking for a table. They should at least change the whole \"seat yourself\" concept during a convention that thousands of people attend, doesn't work well.","useful":0,"funny":1,"cool":0},
{"review_id":"k7gUC3L4_-8ouOfSmYFAmg","user_id":"Rq22e1aYxOY6aCkLKnTZDA","business_id":"r8LEGeYnAE1ISg-_QTQgCw","stars":4,"date":"2014-07-08","text":"The apartments themselves are nice inside, very cute actually. We've had problems with the washer\/dryer\/AC but maintenance did fix the major things. We did have problems with the office staff, but I feel the issues have been resolved. I had previously written a review about how displeased I had been with the office, the manager reached out to me and explained the situation. I can tell the manager does care about tenants, I definitely respect that. Overall, it is a nice place to live.","useful":2,"funny":0,"cool":1},
{"review_id":"1cSJr1JUE3uVkhz76cWOnA","user_id":"Rq22e1aYxOY6aCkLKnTZDA","business_id":"wl0QZqAzr1DelslQ02JGCQ","stars":5,"date":"2014-07-08","text":"So good. Just try it, you'll understand. From what I've tried, the Cream Of Leek Soup is the best item on the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"HM7_PYpcBWZSmIhTc-RH7g","user_id":"ciL5golE8-RciDds1aLuvQ","business_id":"cT1eYUOjz5CgvZJuxu87sg","stars":5,"date":"2014-08-23","text":"Great service! Friendly atmosphere! Lisa and her staff were absolutely fabulous and I am so happy with my nails!","useful":1,"funny":0,"cool":0},
{"review_id":"k0S0_mag60XGMBJyv3Vn6w","user_id":"a8MX0cLVen-blp1Zk7-MpQ","business_id":"_eysP-l3yXpCqMHOQEptdQ","stars":5,"date":"2016-12-17","text":"All About Beautiful Smiles dental is my family's dental provider.  The appointment availability are great which is why my kids go here as well.  The staff are funny, nice and welcoming.  Dr. Phen is very nice and very detailed on what needs to be done.  From prior experience some dentist just recommend unnecessary things  to have you spend $ but Dr. Phen is honest and truly cares about his patients.  As long as I'm living in Nevada All About Beautiful Smiles will be mine and my family's dental provider.  I truly recommend them!","useful":0,"funny":0,"cool":0},
{"review_id":"WqBFKvWv_TidKuoNaBriAw","user_id":"a8MX0cLVen-blp1Zk7-MpQ","business_id":"nPBG-UbMHDMdcnW-HncZNA","stars":5,"date":"2017-10-08","text":"Great service!! Servers are so nice and food is excellent. My favorite so far is the lemon pepper and the waffle with the butter syrup.  We'll be going back to try the other flavors.","useful":0,"funny":0,"cool":0},
{"review_id":"3QXkXPPwlikz5ySNDamTyA","user_id":"QmPcGQkhCf1JjoCqrEWQeg","business_id":"S8zUfSQTHQG4hcxfsXmm3w","stars":5,"date":"2017-06-06","text":"I can't understand all the negative reviews. I have lived here since November, 2016. The first thing that got my attention was that it not only is it gated, but it's guard gated. Yep, a real live guard, 24\/7. Security is important to me and I have never seen any unusual activity here. The grounds are well maintained, the office staff Is great, and the office is open 7 days, 9 to 6. Maintenance is also available 7 days. They are quick to respond and usually resolve whatever the issue is the same day or next day. The units themselves are great. I have a 2 bedroom, 2 1\/2 bath, 2 story with a good size 2 car garage. The utilities are reasonable. My biggest gas bill was $42 in December and my electric bill for May was about $45. The rent is the best part for me. I don't know where else I could go and have a nice size apartment with a two car garage in a guard gated community. Plus, it's pet friendly. If you're seriously looking, it's worth your time to check it out. Might be the best place for you. It was for me.","useful":0,"funny":0,"cool":0},
{"review_id":"_svBEfdU5JtkgQeKMoipUg","user_id":"QmPcGQkhCf1JjoCqrEWQeg","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":5,"date":"2017-11-15","text":"I hadn't eaten at Egg and I for a few years. My friend and I needed a restaurant the other day and we were close to Egg and I. The place was very busy - a good sign. We were seated right away and the server, Tamara, was great. The food also turned out to be great. All in all, a great experience. I'm sure I will eat there a few times a month. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"vbJxbocToSXC-MaF20J5wg","user_id":"QmPcGQkhCf1JjoCqrEWQeg","business_id":"c-NXKTJ0jrrusTPxJAUwvA","stars":5,"date":"2017-06-20","text":"I don't usually give 5 star reviews but I based this on the food, the service, and whether or not I would go back. It's been years since I visited a Red Robin. I went there a few weeks ago and I had a great hamburger and the service was great.  I'm looking forward to my next visit.","useful":0,"funny":0,"cool":0},
{"review_id":"LSzyiXKHeVyuk32f6LGc0A","user_id":"QmPcGQkhCf1JjoCqrEWQeg","business_id":"soe63_s_1FqZMVmDm2X5uA","stars":1,"date":"2017-08-12","text":"I have used Cox for most of the last 30 years for two reasons: no contract, and they seemed to be the best of the worst. However, every year they seem to reach a new low. Currently I cannot access my account online because it won't let me login. I've talked to over 20 people over the last two months. They finally started to send me my bill in the mail so I could see it and pay it. Now, I can't access Contour online for the same reason; I can't login..... and there's more. The Contour voice command seldom works unless you unplug the box and let it reset. The whole system will shut down at anytime, reboot itself, and come back on. It will also freeze and do the same thing. Coming back on can take 5, 10, 15 minutes, whatever. They also require you to have a landline to get a lower price. I have a landline that I have no use for - I don't even know what the number is and there is no telephone attached to it - because I got a lower price if I took it. I have shown the tech guys - who show up every now and then -  features they were unaware of. I could relate lots of stories of bumbling, ineptness, and just plain old \"they don't have a clue about what what's going on.\" But, there is something that I do like. The illuminated remote control!  I'll be switching soon - probably to DirectTV for television service and LV.net for internet service. I know that both provide better service than Cox.","useful":1,"funny":0,"cool":0},
{"review_id":"JP9upxQXTbyqv1aVQ8GRkg","user_id":"ig5rUP22XRjzAkc1YvZQ1A","business_id":"hihud--QRriCYZw1zZvW4g","stars":4,"date":"2016-06-20","text":"We are from out of town and came due to the number of reviews and ratings. I'm not sure if I like this... despite this I was not disappointed. We just ordered the 5 different meat platters for 6 people. We came in on a Monday afternoon and had to wait for 30min...due to limited large table seating. We just asked to sit in a small booth and squeeze in, which they allowed. Service was okay.","useful":0,"funny":0,"cool":0},
{"review_id":"92abnypXlzKMuQ_oj_MgBw","user_id":"BF7dfuWmdb0TZyKpNlnr-Q","business_id":"3m2XZFVraCiqjgLxHi5MdA","stars":3,"date":"2011-05-31","text":"Long time lurker, newbie poster. Decided to start to post due to the disappointment with this restaurant. \n\nGot the $50 prefix menu, also used the Costco gift certs... so definitely a great great value. Value:5 Star \n\nLocation: Just plain weird, had to triple check the address on the navi to make sure we arrived at the right location. Location: 2 star \n\nDecor: No bad.. not great, although the open kitchen was both a plus and minus. Very interactive and fun with the... but the smell of the grill and some of the seafood was just overwhelming at certain times. Our clothing smelled semi-fishy from sitting at a table so close to the kitchen. \nDecor\/layout: 3 star. \n\nFood: Major bummer. Let me just say, I never had rosemary's, I got nothing against them. Perhaps my expectation was too high... the food just didn't do it for me. \n\n-Hugo's BBQ shrimp and blue cheese slaw: Too salty, over cooked stiff shrimp. \n-Duo tar tar: Nicely done \n-Scallops and the Halibut were the best dishes of the night. Very Good \n-Meats were a major disappointment. \nThe Veal Porter house was very tender but tasteless, very salty on the outside, but very bland on the inside. \nRack of lamb were not bad, but not great either, portions were very small too. \nFor dessert, we got the chocolate cream pie (very good), apple tart (very good), Bread pudding (super bad.... tasted like a doughy sponge... no we didn't finish it) and banana cheese cake (way too sweet). Over all food: 3 Star \n\nService: Wonderful. We didn't have the heart to complain about the less than stellar taste to such wonder servers. \n\nOver all Rosemary's is not a bad restaurant, but I don't think it deserves the 4.5 star rating on yelp. Maybe they just had a off night, maybe my expectations were to high. We're from Calif, having to convince my wife and in laws to drive off the strip to eat at a 4.5 yelped restaurant for some delicious fine dinning... we were disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"43qSYZ1Y-odC3n4vjy8O9A","user_id":"M6-4hwoPdMjaIEjlYsaZ8w","business_id":"oWTn2IzrprsRkPfULtjZtQ","stars":2,"date":"2015-12-06","text":"The burger was ok. Not what I thought after reading and hearing about this place. Very small a couple of stools. The cashier needs to learn manners. Really for what you get its over priced. The only good thing was the chilly chesse fries. I would go back for them again.","useful":0,"funny":0,"cool":0},
{"review_id":"tTb_HmUXAj5UwxX6kh8k1w","user_id":"tm0fDqTI2o1nxw0KC68wAg","business_id":"EDcZRvERC22Cvw1yi4-VKg","stars":2,"date":"2017-12-05","text":"Its was ok. I got the sausage meatballs and Arrabiata sauce. Needed more sauce. Spaghetti noodles appeared to be round, although the description said square. Friend got the Uncle Arthur meatballs with same sauce and noodles. She said hers were just \"ok\" as well.  Price point a little high. We bought this as a take out order. Might be better eating it in resturant. Walked in to pick up food and resturant was nice, clean, open. With the open space, the music was quite loud, and sounded like heavy metal. Didnt gel with atmosphere.","useful":3,"funny":0,"cool":1},
{"review_id":"a2ltglP8f7MMQgmjoKXs6Q","user_id":"tm0fDqTI2o1nxw0KC68wAg","business_id":"yFUvKpW66cNsYXD6inDsog","stars":5,"date":"2017-03-19","text":"It was fabulous! We sat at the bar and the bar tender took amazing care of us,helped us choose the perfect wine with the best dishes.  Gave us a complimentary coffee liquor at the end of the meal.  Dinner and salad was amazing. He also enhanced my pasta with some spicy jalapeo olive oil. A lively experience with excellent food. When you open the doors through this strip mall restaurant, you enter Italy!!","useful":0,"funny":0,"cool":0},
{"review_id":"bQSHL7zt_s78k66AAG1n8w","user_id":"tm0fDqTI2o1nxw0KC68wAg","business_id":"ejmQEtYs7lNGh3-w5RIUYQ","stars":5,"date":"2014-11-22","text":"Ros does a great job identifying what hair cut and style goes best with facial structure.  I highly recommend her!  She is also a fun-loving spirit.","useful":1,"funny":0,"cool":1},
{"review_id":"0-BjaNbd5E5Dk-EiDTQSrw","user_id":"tm0fDqTI2o1nxw0KC68wAg","business_id":"bjGp5sKsrE9_tWKCw1pBtg","stars":3,"date":"2017-02-23","text":"This was just o.k. no French fries? It's a bar!!! Seems like they are going for a organic food bar?","useful":0,"funny":0,"cool":0},
{"review_id":"3f7rzIkMZFbo1M6TGfM-VQ","user_id":"-dJpxWdVaAIn73k009rAjQ","business_id":"iLxG2Oo8HNSZFvJvba4W6g","stars":4,"date":"2013-07-16","text":"This is another pretty good Mexican restaurant in the champaign area. It is usually never too busy, so you don't have to wait to be seated. However the service is somewhat slow and not as attentive as I think it should be.\n\nThe chicken quesadilla is super yummy and definitely worth trying! I also participated in drinking a margorona while there with my friends. They're pretty darn big!! And are as tasty as the ones down in Mexico \n\nI will probably visit this restaurant again. Although I wouldn't say it's a place you have to try while in Champaign, it's not a bad place to get dinner with friends on a night out","useful":0,"funny":0,"cool":0},
{"review_id":"5-5SFbLx6pCpxz6m0tL9Yg","user_id":"-dJpxWdVaAIn73k009rAjQ","business_id":"zOiRz0CrelSvK3i-BkLvfQ","stars":4,"date":"2013-07-25","text":"Great store for arts and crafts supplies, very helpful staff. While looking for things around the store, the staff helped me find exactly where to go. I was purchasing some arts & crafts materials and the friendly staff helped me scan a bunch of coupons for my purchase I did not know existed! Saved me a bunch of money!","useful":1,"funny":0,"cool":0},
{"review_id":"xlRxjQN2UiWVWVy-W09ymQ","user_id":"-dJpxWdVaAIn73k009rAjQ","business_id":"abA0s0uxoeOn7zNm-1dDxw","stars":3,"date":"2013-07-29","text":"This place is a nice place to grab lunch and has a very clean and comfortable atmosphere. You can basically pick\/make anything to be a pasta, salad, panini. However, the quality control needs to be improved. Once I got frozen lettuce on my sandwich that had freezer burns. I can order the same exact custom thing twice, and it will taste quite different. Also, the cheesecake I got should have been better refrigerated. All in all, an okay restaurant to grab lunch at with friends with a good atmosphere. Control quality can be improved.","useful":0,"funny":0,"cool":0},
{"review_id":"BKKFOTIFbUkwOB9JzeLSDA","user_id":"-dJpxWdVaAIn73k009rAjQ","business_id":"X57f6FWZiwI1wOidPPhOrQ","stars":5,"date":"2013-07-16","text":"I really like this place because they have such generous portions for food at such a great price. As a poor college student, this is a great place to get dinner with friends without breaking the bank. Also, their margaritas are delicious!!","useful":0,"funny":0,"cool":0},
{"review_id":"ewYMH-q4YTKN-_GUEXlhQA","user_id":"glhkWX_bjYjsc9ypSqwT1g","business_id":"q3gQtSf1IcMHdRUw--zFMQ","stars":5,"date":"2017-01-06","text":"This place is WONDERFUL! They were able to not only fix the heels of my old boots but also clean off some stubborn water stains on the leather, which I hadn't even asked them to do. Thank you so much for your superior quality of work AND your customer service. I've been to you guys before and will absolutely be coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"u4UNl0nS518TPE_93xiL1g","user_id":"sguT4oliFbHHVJysgMG44w","business_id":"SY8ATrwxQJf699wyFRUqgA","stars":5,"date":"2016-12-30","text":"In life not everything goes perfectly, but if ever I have had an experience of people whole heartedly working to make things right, this was it.   Matt Melone was incredible and his manager Mike Jameson too.  \n\nI flew to Arizona from Colorado to purchase a used Toyota Tacoma truck from Matt Melone.  Matt picked me up from the airport in the new truck.  It was a warm day and when I went to put up the air conditioner, it didn't function properly, it just blew air.   Immediately upon getting back to the dealership everyone went into high gear to fix the problem.  Matt took me to go get something to eat, and took care of the bill.  They ended up replacing a whole part, which couldn't be done until the following day, but they paid for a hotel room for me and offered to pay any expenses I might have, and they made sure I had breakfast.  They also provided me with a loaner car.   They even went so far as to pay for my hotel room in Flagstaff and offered to pay for my dinner too, that next night on my way back to Colorado.  They also reduced the purchase price to help us even further!  The reduction helped pay for my plane ticket out there, which was a wonderful and exceptionally thoughtful consideration.\n\nThey truly bent over backwards for me, and what could have been a complete nightmare, they did everything in their power to make it not so.   I saw that this dealership has had negative reviews in the past.  I asked Matt about this and he said that they have let go of everyone from the top to the down that was responsible for the poor running of the dealership.  New people have been brought in and they are determined to make this a great dealership.  This was exceedingly evident.\n\nWe need to get another car in the next few months, and we will be calling Matt Melone to help us find one.  It would be a pleasure to work with them again.  Thank you Camelback Ford!  Happy New Year!  \n\nWarm regards, \nAnn Brumby","useful":0,"funny":0,"cool":0},
{"review_id":"yuWuPzYfXNpSAqeon7F0OQ","user_id":"4pVwuNpFwn8nWrSkT0urvA","business_id":"MYMoho8uONfkTvaVNL-pVQ","stars":5,"date":"2017-03-27","text":"Great food great service. My wife and I had breakfast here over the weekend - coffee arrived at the table in record time and breakfast followed soon after. \n\nThe portions for \"the bunker\" (corn beef hash) are large enough that we each had a midmorning snack later in the day.\n\nWe've been in a number of times over the years and I've always been glad that we've stopped.","useful":0,"funny":0,"cool":0},
{"review_id":"C8_qzZ8KYwO6c9YW1IJTsw","user_id":"4pVwuNpFwn8nWrSkT0urvA","business_id":"wiIVbG2ONHXBa5Vn-Y0fBQ","stars":1,"date":"2016-01-01","text":"food is okay. We have eaten here a few times, never really impressed with the service or the way the place was operated.\n\nOur Last time in, we sat ourselves at a bar table, without help - big mistake. Note: no one was at the door to greet us, no sign stating \"wait to be seated\"... and we sat down in a not very busy bar area.\n\nA waiter came over, greeted us and smacked the back of her hand into the palm of her other hand while shaking her head ~ letting us know we were wrong to have seated ourselves. A few minute later she dropped off menus and said \"welcome to your first time eating at a restaurant\" \n\nThe first expression would have been \"okay\". The second was way over the top. On past visits the service has also appeared understaffed and not afraid to express their frustration.\n\nWe explained the poor service to the manager as we left, without eating. He appeared as interested in the details as we are in ever returning - not very!\n\nOkay food. Consistently poor service.","useful":2,"funny":0,"cool":0},
{"review_id":"3Ce3rn02YNgrfWZ4BJlXUA","user_id":"4pVwuNpFwn8nWrSkT0urvA","business_id":"ifQtOsLs5ZOIM4VrLjVfCA","stars":5,"date":"2015-12-27","text":"Hollandaise sauce for eggs benedict made fresh daily; real potatoes, cubed and grilled; biscuits and gray from scratch... food is delicious, service is friendly, restaurant is clean. You can view the grill area as you pay to leave - it's clean and the owner is typically back there cooking. This place is worth going out of your way for.","useful":0,"funny":0,"cool":1},
{"review_id":"MsRjQa6sb6J7K_NmIpfAcw","user_id":"4pVwuNpFwn8nWrSkT0urvA","business_id":"wmstf9dw0-kN3YThIxx8eQ","stars":5,"date":"2016-03-20","text":"Food, service, and atmosphere - all worth going out of your way for!\n\nCheck out the bocce ball dessert - made on site. Delicious!!\n\nThe fireplace was gas. I prefer wood-burning, but otherwise it was everything I expected.","useful":0,"funny":0,"cool":0},
{"review_id":"f-FQGR3ZAL-op0ZqdWylNw","user_id":"0Rp6doDKbnLp82-jbbEpcA","business_id":"CgPQ3kTrbzm018e4KDm0aA","stars":2,"date":"2017-03-09","text":"We currently live here. \n\nPositives:\n-The Maintenance crew are nice men.\n-They keep the outside area tidy and do their job.\n-The gate is finally closed at night. \n-The apartments are huge for the price you pay.\n-The apartment is very close to Stephanie and if you like shopping, it's ideal. \n\nNegatives:\n-Our car has had gas stolen 3 times. We finally had to buy a locked gas cap. The cap was stolen twice. \n-The police & firetrucks have showed up 3 times since we have lived here. It's only been a couple of months.\n-Recently, they lost our rent money. Thankfully, we kept proof that we paid on the 1st. We received an eviction notice and were very confused. \n\n**Most of my negative feelings about this place are because of the tenants that live here. It's not really management's fault. You get what you pay for. It's a very low cost apartment in Henderson. If you stay in your apartment and keep to yourself, you will be fine. Keep your receipts though!! Good life lesson after reading this review.**","useful":7,"funny":0,"cool":0},
{"review_id":"QcNWy6eeSjuQ-tNgf7B0GA","user_id":"0Rp6doDKbnLp82-jbbEpcA","business_id":"cgSjU5nRfl6Su946Lmwfjg","stars":5,"date":"2017-03-09","text":"The father & daughter that run this place are very kind people. The daughter keeps everything extremely tidy. It can get crazy and crowded. Just know that at about noon, it always starts to slow down. I keep taking my kids back because it's a small area and I can watch them while sitting down and relaxing. There is a huge assortment of toys and it is worth the money if you stay for several hours.","useful":0,"funny":0,"cool":0},
{"review_id":"WZRZzTdfgV664Rw4bh6ndw","user_id":"0Rp6doDKbnLp82-jbbEpcA","business_id":"iBVKoqOqe46J3h8ny9m0YA","stars":5,"date":"2017-03-09","text":"The volunteers here are fantastic and very knowledgeable. The trails are clean and it never really seems to be busy.","useful":0,"funny":0,"cool":0},
{"review_id":"NhtVr1V2H38QxzVQRBouDA","user_id":"0Rp6doDKbnLp82-jbbEpcA","business_id":"VsRAIb4k5CjEF-3l_bac0g","stars":5,"date":"2017-06-10","text":"Fast delivery and nice staff. Food was delicious. Pizzas were on the large side. Will order again.","useful":0,"funny":0,"cool":0},
{"review_id":"ud8-Qm-7Ml2z63OnGr5vZQ","user_id":"jiLlF8zL7FcCop001k6trQ","business_id":"mezvOoz4VcQXl9F7E2qigg","stars":4,"date":"2012-12-28","text":"I don't live in the area but was in town visiting relatives for the holidays.  Left my razor at home, so decided to do something I have wanted to do for years and get a shave at a barber shop.  The shave from roosters was well worth the 22 dollars, my skin feels great and it was an extremely relaxing 30 minutes.  The barber also gave me a couple of tips on what to do with my hair, which my barber at home has never bothered to mention.  My only gripe is that it seemed understaffed and I was seated 30 minutes after my appointment time, but I am willing to chalk this up to the holiday season. Recommend for the shave and would try the haircut if I lived in the area.","useful":2,"funny":0,"cool":0},
{"review_id":"JAOEpEbfDq5OY0iYtn_D_Q","user_id":"CkhsKv_TG_BsfZvPOXeHzw","business_id":"R9Q2H4XVCiHUee3OvkB1kg","stars":5,"date":"2013-02-23","text":"Hands down the spot to grab a coffee in the city. I feel so spoiled to have a clover machine and these tasty beans so close to home!","useful":1,"funny":0,"cool":0},
{"review_id":"OLP0YrcAQIYsAwkj7BSUlQ","user_id":"CkhsKv_TG_BsfZvPOXeHzw","business_id":"fdtqM1j1DcwHt2Zy8kB6_g","stars":4,"date":"2013-02-23","text":"I went here with my family recently for a formal dinner to celebrate my dad receiving an award from the Lieutenant Governor's office. My family doesn't get all gussied up too often, so it was nice to have a reason to put on our best duds!\n\nThe food and service here were both very good. We all had appetizers and entrees, the former of which seemed more standout. The entrees were quite tasty but a little lacking in excitement; Half of our table had the crispy sea bass and the other half had the veal. We also ordered the souffl to share which was really delicious and somewhat entertaining. I had never eaten one before, and was a little horrified when the waiter threw a glob of whipped cream on top and smushed it all up... until I realized that was how it's supposed to be served!\n\nThe service staff were very courteous and helpful. They were very considerate of our needs and questions, and I was also surprised to find that they had a good sense of humour! I expected the place to be much more stuffy than it was. \n\nOverall a very great spot for a special treat!","useful":1,"funny":1,"cool":0},
{"review_id":"ZFGu-dcUkxRJRfX1ztJTIw","user_id":"r8WvwxtzK2QAMAciMANz6w","business_id":"LVnqISmynSQ8EhFjl-VjDA","stars":5,"date":"2013-02-27","text":"Very nice restaurant, upscale, a little pricy for the area and for a family of four, Very good food, fantastic people that are on the ball and very helpful. Been there four times and very consistent with their service. Thumbs-up for the chef.","useful":0,"funny":0,"cool":0},
{"review_id":"gMCEz_Rc5zK3N8qfIHWI5Q","user_id":"gUMujTWJz5ccdYSnPfdB7w","business_id":"L3dAvYkqMsLhyPLoeJgwsQ","stars":1,"date":"2014-12-31","text":"Late night breakfast.... Not so great. I was crazy excited and then received the food. Horrible. Coffee good food not so much! :-(","useful":0,"funny":0,"cool":0},
{"review_id":"xn1jFii8Gv9EWjOGS-SCFg","user_id":"MzGLuKeRON8OE6lLlTiAVQ","business_id":"3DLSWOjkNgJHkv3Ti-bgLQ","stars":1,"date":"2017-09-22","text":"Starbucks here was awful. Snooty crew and not friendly at all. I think they choose who to be friendly with because I see them treat other people a lot better.","useful":0,"funny":0,"cool":0},
{"review_id":"EDXqkuyrvt5vM6EDmZon4w","user_id":"MzGLuKeRON8OE6lLlTiAVQ","business_id":"6lgRm13PvA6iMGc7PmqK9Q","stars":5,"date":"2017-08-02","text":"The best 'snowflake' I've ever tasted! It's like heaven in a bowl. Oh and the owner was the nicest person you will ever meet! He made us a sample of their pong shake and it was really delicious! I would definitely come back and try other flavors and will get all my friends to try them.","useful":0,"funny":0,"cool":0},
{"review_id":"0UkckYwzwW6V-cFDH6yeWA","user_id":"SBIPEpTl50ulnakN6A1xTw","business_id":"1p0Iu66E3ooq_tZkcmCZkg","stars":3,"date":"2010-11-20","text":"The ladies are both talented dancers (a pleasant surprise) and lovely to look at.  Some of the numbers were just too silly to enjoy but there were a handful that were amazing.  The new 19-year old they are making such a big deal of because she was a playboy centerfold was one of the weakest points - she's not much of a dancer so her pieces are meant to showcase how hot she is rolling around on stuff.  She IS cute - but those pieces were a total yawner.    My biggest complaint is actually about the facility.  HORRID seating (the chairs are about a 1\/2 inch from each other - no leg room at all) and MGM clearly wants to gouge the heck out of you.   A plain old iced tea was $5 and beer started at something like $8 for a bottle of Bud.   Don't believe them when they tell you that you need to get there early - they just want you to get thirsty enough for an $8 Bud to make sense.  If you can get discount tickets, there are certainly worse ways to spend time in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"pH8QSaeUeVWHhQ54end1YA","user_id":"3mVIvvCJa4G4_DABnDF72w","business_id":"68O4uYCd0YToLOLqHTBSZQ","stars":5,"date":"2017-12-13","text":"Best show in Vegas hands down! Jeff provides entertainment for everyone in the family. He is not only funny and talented, but also an inspiration to work hard and have fun doing it. I will be back every time I am in Vegas. Thanks for a great show, Jeff.","useful":0,"funny":0,"cool":0},
{"review_id":"Sq6P-Zr-sIcESxBMPsnvKA","user_id":"SYx15p4PssSS3lXjvtF6rg","business_id":"xm-LPu0bPl5cZ2PYKS9zDQ","stars":5,"date":"2016-06-01","text":"Friendly staff, comforting area, respectable clients, and all around good place to be.","useful":0,"funny":1,"cool":0},
{"review_id":"mTUSBocJeX_tzVOoFG4ppQ","user_id":"SYx15p4PssSS3lXjvtF6rg","business_id":"LtO6vTBfYzlgWArn3kRe_A","stars":5,"date":"2016-02-22","text":"*Review #2* This place, location, price, people, and service should all get an award. The only way this place could get any better is if they served beer, other than that everything is amazing.","useful":1,"funny":0,"cool":0},
{"review_id":"lN_j2PEzgSVckY9gbMXZ8A","user_id":"SYx15p4PssSS3lXjvtF6rg","business_id":"X_EBs3ShGJmehqzfuciEAA","stars":5,"date":"2016-03-28","text":"Mike and the cook both deserve 5 stars. I could could on and on but Yelp would delete my post so yeah so it is what it is. Mike and the cook all 5 stars. Bless up","useful":0,"funny":0,"cool":0},
{"review_id":"ve0NHwYL-Qn1RtBydKzvNw","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"eBj_YyJU5jVu6tbZCkdtDA","stars":4,"date":"2013-02-24","text":"The food is very good and I really like the ambience.  Lots of choices for trying to eat vegetarian and they're willing to improvise the menu if there's something you want. I'm still not sure about it's location in Tivoli, which appears to be a shopping center with only restaurants (?).","useful":0,"funny":0,"cool":0},
{"review_id":"dSra4Z3XUIJ366fIY4nWzQ","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"-yApKLEFAvvNyifvpNKWCA","stars":5,"date":"2012-12-03","text":"A great Vegas tradition... it helps that I love frozen custard.  Definitely worth a trip for tourists.","useful":0,"funny":0,"cool":0},
{"review_id":"zX9DCpFNDLwbO75VFreAxA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"gqcJHVFCPeBRGnDf8bFzMw","stars":4,"date":"2012-12-03","text":"I'll admit it: I like Outback.  However, they are not all created equal.  This one has good food, great service.  They seem to always get the orders right and, like the others, it's still a good deal.","useful":0,"funny":0,"cool":0},
{"review_id":"CKrS88s2tK_y2uaQrHVdqA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"U9aA5H13y7t9xWnoQslV0Q","stars":1,"date":"2012-11-12","text":"Least favorite restaurant in Vegas.  If you wanna pay $50 bucks for ramen, feel free to come by my house.","useful":0,"funny":0,"cool":0},
{"review_id":"iwmUoM9o87tL96Wbdm-zsQ","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":4,"date":"2012-12-03","text":"Total breakfast fan here and this is one of the few in Las Vegas that truly does breakfast right.  Prices are pretty good and there are always coupons to be had.  Love the Pumpkin banana pancakes and Carrot Cake french toast in the fall!","useful":0,"funny":0,"cool":0},
{"review_id":"zpl6mfCDO6s8MkNzAppZCA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"RESDUcs7fIiihp38-d6_6g","stars":2,"date":"2012-10-31","text":"Good food.  Slow to get in even when there's plenty of seating available.  Very Spotty service. Now that they raised prices (most expensive buffet on strip that I've gone to), I won't return.  Back to Bellagio which is now cheaper.","useful":4,"funny":0,"cool":1},
{"review_id":"HjEclLdnXoQ26aM5AIrCkA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"kosTPb88O4Q0XGbVbEOGCA","stars":5,"date":"2014-03-24","text":"I've lived in DC and Chicago, two great food towns.  There is no Thai place in either town that compares to this one. Tofu pad Thai makes being vegetarian worth it and picking your spicy level (1-10, 6 for me) is awesome. Authentic food for suThe lunch special is cheaper than Panda and a million times better. The service is not perky but that's part of the charm. Very small seating area and not much to look at, but get past that because you will love it! This will always be on my Vegas to do list when I return.","useful":1,"funny":0,"cool":0},
{"review_id":"m8-ncyA0lrEkEjLL0C0Pdg","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"V9OIBO95GDFRvQMcKsNT2w","stars":1,"date":"2013-02-24","text":"Absolute let-down. Carrot cake was dry.  Salad choices are more limited than subway.  Service is just so-so.  Definitely skip this one.","useful":2,"funny":1,"cool":0},
{"review_id":"YeJ6VD9M9tt4IRUC2Qt7iA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"sNVGdeOPeitJ3OWUQBINzQ","stars":2,"date":"2016-01-01","text":"Very overrated.   Pancakes were dense and not hot.  Strange setup with seating right on top of each other. I actually think Denny's has better pancakes than these.  Sorry, I really wanted to like it.","useful":1,"funny":0,"cool":0},
{"review_id":"_Ovn7LoeOUEU7c28FPBdgg","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"TT658qQinO6MBHP9q7rJ8w","stars":5,"date":"2015-08-30","text":"This place is way better than I expected.  Red beans and rice is phenomenal. The fries are absolutely the best anywhere, super crispy and actual potatoes! This is definitely a great little piece of New Orleans in Las Vegas and a welcome independent experience in Summerlin.  Everyone should try this place!","useful":0,"funny":0,"cool":0},
{"review_id":"S_kC_mBGU2mRxiE5aAA_iQ","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"IOEGLxXwCNiq4P-U359D7Q","stars":5,"date":"2012-12-03","text":"Pizza is so subjective, but this is my favorite pizza delivery in Vegas by far.  The ingredients all are good quality and it's cooked east coast style, so the crust is not too thick or thin.  Couple of other New York style places on the far west side in Summerlin, but this one is definitely better.  They don't skimp on the toppings either.  Also, the girl who took my order was friendly and competent and the delivery guy was courteous and friendly.","useful":1,"funny":0,"cool":1}]