[{"review_id":"CPd5bJ3PS0Irry95EYW23Q","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"_mIl4QkLjsbuFN_CnSj4sA","stars":1,"date":"2017-12-18","text":"Very dishonest group all together. Watch out in finance as they will try to slip optional fees into the deal and lie about them when caught. The vehicles Infiniti makes are top notch and frankly above this low level form of selling. If you notice the additional fees after you have signed you are out of luck as they will do nothing for you after the fact. I will  never do business with them again and neither should you. My last Infiniti was purchased from Coulter in Mesa, no issues there. Notice this dealers Yelp rating  compared to Coulter and Scottsdale Infiniti dealerships and you will know where to shop.","useful":3,"funny":1,"cool":1},
{"review_id":"q-HfGqdwudYaHkviHOcd6A","user_id":"zd59azUShyLhIxtZv_NVgg","business_id":"rVu3i1E4ekttmE1tzN-1tg","stars":1,"date":"2017-05-09","text":"This is without a doubt the most incompetent, slow, and disengaged pharmacy I've ever dealt with. Go anywhere else but here to avoid hours of delay and immeasurable frustration.","useful":0,"funny":0,"cool":0},
{"review_id":"-rRa-WvyoaYXMi6ghD94kQ","user_id":"4HlDLLEx9GU4lZDD5udamg","business_id":"vSx7sWoVFKb21JxqYnXcYg","stars":1,"date":"2016-10-15","text":"Waiting 15 minutes in line because only one cashier for the whole floor yet tons of staff just walking around.  I didn't realize Macy's was becoming walmart","useful":1,"funny":0,"cool":0},
{"review_id":"fbh2yTnRdYOa52LsniiaIw","user_id":"4HlDLLEx9GU4lZDD5udamg","business_id":"PC6G40NLDaAyFFEXRibX0A","stars":1,"date":"2016-10-15","text":"Waiting 15 minutes in line because only one cashier for the whole floor yet tons of staff just walking around.  I didn't realize Macy's was becoming walmart","useful":3,"funny":1,"cool":0},
{"review_id":"DEgiiqN1MFmQiAbTHUCCuQ","user_id":"mHkw5LwpC3M75lnKkkCieA","business_id":"TWXpv_Ns7fRm3YShf5AtvA","stars":4,"date":"2015-08-21","text":"I prefer to have all of my maintenance done at the dealership, I always have. I have always had a great experience. I was however disappointed by something this time, while I was waiting in the \"waiting area.\" \nThe programming on the TV was not on a channel I wanted to see, it was boring, I wanted to see the news. To my chagrin,there is a note posted underneath asking that no one change the channel out of \"fear\" someone would be offended. Just who are you trying not to offend and what are you so deathly afraid of that they will be offended of? Well let me just tell you, \"I am offended!!\" What are you going to do about it?\nWhere do we draw the line, when does it stop, and when do we just do what is right? Why can't you just have local programming and let those of us who have spent thousands upon thousands of dollars at your dealership just watch the news? Is that so wrong?","useful":0,"funny":1,"cool":0},
{"review_id":"7KwGA3rCeNKSsKnsLQjsfQ","user_id":"649nvf2mSResG3Xk3Hlalw","business_id":"6KqLBLkHw78t33qObWJxpQ","stars":2,"date":"2014-04-06","text":"The BBQ main dish is descent, the side dishes are not fresh.  I order mac n cheese for my son and it was from a box.  I was expected homemade or something that did not cost .99 at the grocery store.","useful":1,"funny":0,"cool":0},
{"review_id":"6IU5rXDD1narwFFGZ-hoYg","user_id":"jWKvlFRL0JpA97-e2Ok9Vw","business_id":"3jKUbhGSjFTv5jZ0wnW0xA","stars":4,"date":"2012-05-13","text":"My boyfriend and I went  yesterday  to this french restaurant for a nice romantic diner. It was meant for a celebration of my boyfriend's birthday. I had learned about this place through yelp and was looking forward for it. \n\nThe service was amazing, very fast and efficient. The place very nice. The decoration and the tables make you feel as if you are having diner in a neighborhood in Paris.\n\nThe Prince Arthur street is to visit.\n\nThe food was good overall and well priced.\n\n We ordered saumon tartare and chorizo calamari as appetizers. The saumon tartare was so fresh and the chorizo calamari was full of flavors. Totally recommend both apperizers.\n\nAs a main meal. We ordered the risotto with prosciutto and the confit de canard. While the risotto was very tasty, unfortunately the confit de canard was a bit dry and the potatoes very oily.\n\n\nFor desserts, we ordered the mi-cuit chocolate and the raspberry meringue cakes.\nThe mi-cuit chocolate cake was out of this world. We weren't impressed with raspberry cake.\n   \nTotally recommend people to visit this place and enjoy the experience.","useful":1,"funny":0,"cool":2},
{"review_id":"QrqKylOek-G4nh7qnylU1w","user_id":"j0zavHiIKuuhL868R-ipng","business_id":"5T0h9YCsXiDZyBsVIN9gcg","stars":3,"date":"2017-02-12","text":"Went the first time and got the Chicken Pho. It was good, but the soup itself wasn't HOT, it was Luke warm. I'm used to it at other places being very Hot, like soup should be. So I decided to order it again a week later, take out this time, and when I got home, again the soup was  only a little Warm. Once I heated the soup myself ( stove top) it was good! \nSo yes good ONCE SOUP IS HOT!! \nRecommend telling them to serve it HOT!!!","useful":0,"funny":0,"cool":1},
{"review_id":"1j89SOkNpp99PzUHH_YyIg","user_id":"j0zavHiIKuuhL868R-ipng","business_id":"l4qomOr-2ZDOjWXSZXpzZg","stars":3,"date":"2017-10-29","text":"It was good. I've had better, but it was close  and convenient at the time. Worth a try","useful":0,"funny":0,"cool":0},
{"review_id":"cb5QPGJAJbx6MWFE_A6CKw","user_id":"j0zavHiIKuuhL868R-ipng","business_id":"zx_xDVaVQlE3eDoFFENkow","stars":5,"date":"2016-05-25","text":"Good company!! Friendly service, and great pricing :) only takes about half an hour to fix a battery and crack screen :)","useful":4,"funny":0,"cool":1},
{"review_id":"dks3adr5flRdoEQi1AEWwQ","user_id":"j0zavHiIKuuhL868R-ipng","business_id":"q3YnYPjLuBGRDi_59yTC5g","stars":5,"date":"2016-09-23","text":"Good Food!!! Everything is made fresh, the people are friendly, the PHO IS AMAZING!!!!! Best I ever had.  The fried rice is Delicious\nLike sports, well they have the games on!!","useful":0,"funny":0,"cool":0},
{"review_id":"MX9_QRb-gcWhGzuwPExnzg","user_id":"SktKvy-3qdw6F9Wi2-z4xg","business_id":"w6l6uq95_-36unVjTaFIXw","stars":5,"date":"2017-02-19","text":"Been devoted to Raul's hair care for 10 years now. He has taken me from dark to blonde, to dark again. He has become a great friend, and always makes sure my hair is healthy, and looking great. He is also brilliant at extension work, the best in town from what I have experienced growing up here. Thanks for all your dedication Raul, keep up the great work! xo","useful":0,"funny":0,"cool":0},
{"review_id":"VHvmkDgeuYdSaz4fAuyl3g","user_id":"4h_p7ZOKVCilGHLJntpYqg","business_id":"r78AHYzmDKDffJAwrB5aIg","stars":5,"date":"2016-08-20","text":"Wonderful atmosphere, great service and the food is amazing.  We enjoyed the bang bang shrimp, and the Day Boat Scallops.  The veggies were prepared perfectly.  The bread is always fresh and warm.  The manager stopped by to make sure we enjoyed our time with them and to present my friend with a box of chocolates for her birthday.  This place is top notch!","useful":1,"funny":0,"cool":1},
{"review_id":"S3GM_vF9E-Bheb3jSQG2GQ","user_id":"4h_p7ZOKVCilGHLJntpYqg","business_id":"_BVsHMWSF83bxakE9eTmhw","stars":2,"date":"2016-08-20","text":"I've always enjoyed Walnut Grill but the last few visits have been disappointing.  Tonight was the last straw.  My son came in from out of town to take me to dinner for my birthday.  I suggested Walnut Grill.  We were seated around 8:00 PM and with very little interaction from our server, our meal finally arrived around 9:15.  We both ordered the filet mignon and it was not worth the wait.  It was flavorless and not prepared as requested.  The server was apathetic at best.  Honestly, we both agreed that we have had better at Outback. It was a strange experience.  We were the only customers seated in the one section and it felt like we were forgotten about.  Our server was one of the least engaged I've ever had.  I wont be going back.  There are way too many other decent restaurants to visit.","useful":2,"funny":0,"cool":0},
{"review_id":"DbpMCANoLEl8KvClfTYKoQ","user_id":"pH0hsGwpve3FD3r2ExxkSQ","business_id":"LH9YFarEKe_ByAl6xeeegQ","stars":5,"date":"2014-01-06","text":"This is the place to get wings in Pittsburgh, hands down.\n\nFavorite wing flavor: The Game Changer\n\nGuys are personable, very helpful in helping pick out good wing flavors.\n\nCory Freeman is the man, if he's working you should definitely get some Black Opts.\n\nAnd get The Soldier. For the love of God and all of the saints in heaven, get the soldier.","useful":3,"funny":1,"cool":1},
{"review_id":"hvHNonkoTxhHi5x_kiAKWw","user_id":"pH0hsGwpve3FD3r2ExxkSQ","business_id":"RMiE7_RB0yreZqTrPEgBMQ","stars":5,"date":"2015-02-14","text":"Maybe not for everyone, but if you love an old school Greasy Spoon diner, Dairy Villa is a hidden little gem. Get the Bacon cheeseburger, you won't regret it.","useful":0,"funny":0,"cool":0},
{"review_id":"RdMaRhYdNShkIvTeBHYyGw","user_id":"uLmviGb2j55HgC8O-5dIpQ","business_id":"xiT9ZAnbEOwk_dn4SkW4fQ","stars":5,"date":"2014-06-30","text":"I cant say enough about my experience here. I was referred to Brent by his apprentice Amber and I am so incredibly happy with his work. He took the time to really evaluate the condition of my hair and determine what would be the best method to get it to where I want it to be. He takes his time and makes the experience very enjoyable. Amber is so great as well!!! She gives the absolute best head massages!!! The atmosphere of this salon is laid back with a great vibe. I highly recommend this salon :)","useful":1,"funny":1,"cool":0},
{"review_id":"SDXJF9_JAjwvGs0pjhBcnQ","user_id":"uLmviGb2j55HgC8O-5dIpQ","business_id":"F87ttJCwWdQccR4Wlr9j0A","stars":5,"date":"2016-06-29","text":"Morgan was amazing! She created the perfect mandala for my left leg. She is incredibly talented and so professional. She made the process of getting my first tattoo so easy and she made me feel so relaxed. We had some scheduling issues in the beginning, but she went above and beyond to compensate for them. I am so blown away by her! If you're looking for phenomenal work please go see Morgan at Golden Rule!","useful":1,"funny":0,"cool":0},
{"review_id":"24V6HvUnJYd-mbNhCx1hVQ","user_id":"ej4OBK8aHkO2bOwyZXjYzg","business_id":"-EkRlTm1xlzM8EyyYAs75Q","stars":4,"date":"2016-02-08","text":"I really like Dr. Musler and will keep going to him. He's got a great bedside manner and really seems to hone in on exactly what I need as far as contact lenses.","useful":0,"funny":0,"cool":0},
{"review_id":"ckTqlh2s49K7Gpk4EK1HDg","user_id":"ej4OBK8aHkO2bOwyZXjYzg","business_id":"H9a6IRS0edhW343Y2kXSSA","stars":1,"date":"2016-02-21","text":"I used to come here. Hadn't been in awhile, so I stopped in. That was a mistake. I can see now by other recent reviews that others also haven't been having favorable experiences and thats a shame. \nThe service was so bad, it was funny. \nMy party of 2 was told there was a 10 minute wait, although we could see at least 3 empty tables. The hostess disappeared and then was seen again walking past us a couple of times carrying plates. Great. They're short staffed. No actual patrons were seen leaving to \"free up\" tables. After more than 10 minutes, the hostess reappears at her area and seated us. \nIt then took more than 10 minutes for anyone to acknowledge us at our table. Finally a very somber looking waiter comes by, rattles off a list of things he has to do and why he can't get to us right now. Wow. I should have taken the hint and left, but my companion and I were patient, in great moods and just trying to enjoy our Saturday off from our own hectic jobs. After we ordered actual lunch and handed Mr. Busy Waiter our menus, he said \"this one has to stay on the table\" and then had to take a moment to arrange and rearrange the drink menu back on the table. Wow, ok. He cared more about the drink menu, that we didn't order off of, than us since he took so much time arranging and rearranging it.\nI'm sure by this review you can tell how the rest of the meal went. Nothing was offered or explained by Mr. Busy Waiter. We were imconveniencing him by just being there. \nPretzel appetizers were dry and barely warm. Cheese was cold. When said appetizer arrived we had to ask for napkins. We were told they were a \"hot commodity today\" and Mr. Busy Waiter disapperared. Well, gee, I sure hope you can round up napkins and silverware before lunch comes. My drink never saw a proper refill with ice, so I was left drinking a diluted, warm soda. The sandwiches were sloppily assembled and seemed to have been hanging around before they were served as the tomato was warm and mushy. At this point we cut our losses and got outta there.\nI will make sure to tell others about The Liberty. If you're short staffed, don't take it out on the patrons. This restaurant and staff attitude need a serious reboot. Shame on you The Liberty!","useful":0,"funny":0,"cool":1},
{"review_id":"3ESHi5eRMR4XlvtgfPXGrQ","user_id":"NtWoJ66Qv83k_7-_ciI6TQ","business_id":"r76Jr-MchYOobglY6TguzQ","stars":5,"date":"2015-04-11","text":"Hmmm... I wonder if our idiot neighbor is stalking us and knows we just ate at taco tijuana - s\/he is currently blasting marriachi music in a bizarre coincidence considering where we just ate... at least it isn't heavy metal....\n\nSo onto the resto review:\n\nFunky small and colourful. ... enjoyed the kitschy art adorning the walls. \n\nWe did have to wait about 20 minutes for round one (but we expected this wait based on other reviews and went when we had time) but our patience was rewarded with seriously loaded taco on soft tortilla. There are in fact 2 torrillas underneath the fresh pile of yummy.. and we found that splitting the contents between the 2 shells made them easier to eat with our hands (mmmmm).\n\nAll tacos come served on two (stacked) soft tortillas with fresh avocado, salsa verdi, (onions), and cilantro on top of the main filling. We tried the sausage with cheese, fish, pork and lamb tacos. Having read they can be a little heavy handed on cilantro and onion- I had mine without onion. They did use lots of cilantro - but I love cilantro so it didn't bother me. \n\n The fish was nicely deep fried and crispy and the texture was a nice counterpoint to the softness of the taco, avocado and salsa Verdi on top. The lamb was super yummy... flavorful without being over salted or too spicy. (Actually it is refreshing to note that none of the tacos were over salted.) I seriously liked the pork - small chunk instead of ground with nice caramelized brown bits and slightly sweet finish. The cheese and sausage one had gooey melted cheese and a nice ground sausage. \n\nYou can tell these are assembled fresh on order.... a little slow? Maybe. But worth it. This isn't Taco*barf*Bell.\n\nPrice  (about 3 bucks per taco) versus quality is what gives this place 5 out of 5 for us... despite the (some-might-find-it-a-tad-slowish) inital service of the first round. We did appreciated the fact that they served the tacos in 2 courses instead of all at once. They were perfectly hot this way and not soggy in the least... so Rosa, our waitress, gets bonus points for that. She tried hard to please despite being a little rushed at times. \n\n We WADDLED home quite full... having consumed 4 tacos and 2 cokes  (love the bottled soft drinks... no soda fountains here) between 2 of us. Next time we will skip the second coke since we didn't finish both (and which is actually almost the price of a taco) and will consider having 3 tacos between us. Add the tip in it will be less than 20 bucks for 2 people. Not a bad price for something fresh tasty and filling.\n\nYep we will be back.","useful":1,"funny":2,"cool":1},
{"review_id":"uQN0qIH1DOFoiw8r0FqjpA","user_id":"NtWoJ66Qv83k_7-_ciI6TQ","business_id":"oxS9yB0o6dsNyHviLmjZFg","stars":4,"date":"2015-02-27","text":"Pleasant surprise in terms of taste profile for most of what we ate- spices were beautifully balanced and meats were perfectly cooked... almost everything is good here. The only two downsides for this resto was 1. When it is very cold outside sitting near the windows is not pleasant... we were very cold until we had tea to warm up with and 2. The \"fried rice\" was way over priced and a disappointment. While everything else on our table seemed to be prepared with fresh veggies ... the fried rice obviously had been made with frozen peas and carrots added to it and cost way too much. That being said... the portions of most dishes are large and the presentation of everything else was beautifully done. Would come back for sure... we would just sit away from the window and avoid the fried rice. \n\nWish they would offer delivery","useful":0,"funny":0,"cool":0},
{"review_id":"2F8dBYOZMxeKAbh92AOReg","user_id":"NtWoJ66Qv83k_7-_ciI6TQ","business_id":"3_SYsOndct45zith-1D-ZA","stars":5,"date":"2015-05-21","text":"TRY THIS PLACE!!!!\n\nSERIOUSLY. \nJust try it. \n\nIf I didn't live nearby I would make the trip.\n\nPlease do not come here if you are in a rush. Please do not come here if you want to order a la carte. It is the chef's menu and totally worth it. (Although they do ask if you have allergies when you reserve and adjust accordingly).\n\nDO come here if you enjoy Japanese food made with care and authenticity.\nDO come here if you want something other than just sushi, teriyaki or trendy Japanese styled expensive bistros.\nDO come here if you want excellent food\nand DO come with an appetite. \nYou that you will not be disappointed.\n\nIt is a nice change from tempura, sushi and sashimi that seems to be the main focus of many Japanese places... here you will find gorgeous presentation and complex and satisfying tastes... ingredients such as soba noodles, dried fish (Bonito? ), seaweed, rice , tuna and other seafood, etc etc.... in traditional style Japanese food made with flare. It is not trying to be trendy... and yet by not being \"trendy\" Jardin Iwaki manages to be modern and clean in taste while respecting tradition. There is the occasional surprise as well. For example I don't think of bacon when i think japanese... but the small bite sized pancakes with bacon and dried fish.... oh my. I am in danger of drooling at the memory. \n\nDid I mention how pretty the servings are? \n\nVery decent sake menu... wine and Japanese beer are also available.... (not sapporo- for those wanting something different and very tasty). Their house sake is extremely decent for the price... and I recommend it hot... sooooo tasty.\n\nSeriously. .. why are you still reading this and not calling for a reservation?\n\nAs a side note... assuming you can handle the extra course you will need to reserve a day in  advance if you intend to have the EDO menu which does include a sushi course. Part of me regrets that we did not do this... but we intend to make up for it  ... by calling ahead to order and by skipping lunch so we have room.\n\n Also... it is a wonderfully tiny place... with extra space on a terrace... i would assume reservations would be a necessity on busy nights.\n\nAs for the service. .. expect polite, kind and gracious service. Also expect a relaxed pace while still efficient... it takes time to savour 6 or 7 courses. And your hosts are delightful. \n\nDomo arigato for the best Japanese meal I have had since Japan.","useful":2,"funny":0,"cool":1},
{"review_id":"MJo__C66Y4epW3F4gPqKVA","user_id":"q_HTmTgXyTmwLsYpc9V-_w","business_id":"4s_cPDS_AkLP1fXMJPqB2w","stars":5,"date":"2017-11-22","text":"This is the place if u like to pic out!!!!  I'm Korean my self it's very hard to find good Korean Restrunt in Arizona!  I will recommend this place to anyone like to enjoy food. I will recommend all my friend. \"GOGI\" means in Korean is Good Meat.","useful":0,"funny":0,"cool":0},
{"review_id":"qhUrK9ujSNvNj1gW2e6xtg","user_id":"xvCnj3AUXW3C6_0QNc55Sg","business_id":"DNIsLmKpiw-RBfBmXlGJRQ","stars":5,"date":"2016-06-02","text":"Great, honest service. The guys were friendly and very informative. My Honda needed exhaust valve replacement and they finished the job within a day.","useful":0,"funny":0,"cool":0},
{"review_id":"0b3is3Erl_w-ef7cWPDJsA","user_id":"xvCnj3AUXW3C6_0QNc55Sg","business_id":"JjUcMxJRf5Mvet7uTF4ouw","stars":5,"date":"2017-04-14","text":"We have been taking our pomeranian here to trim him down during the hot Phoenix months. Always great service and very friendly staff. They take good care of the pets. I really appreciate their service!","useful":0,"funny":0,"cool":0},
{"review_id":"2kVbyYMD1g8D7m4eMRRcrQ","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"W5d8iNog90R-qw43m5dGwg","stars":4,"date":"2017-06-14","text":"If you are going for Polish food you are going to Polonez. An experience. Reasonably priced and I guarantee you will be well fed with tasty comfort food. Don't leave without trying the fruit compote.","useful":0,"funny":0,"cool":0},
{"review_id":"BmX1mu3CTBndlU9oB_y4sA","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"d_Go5TsiFMIRtCE6XS8Sjw","stars":4,"date":"2017-05-28","text":"I live in the area but had not been yet.  I went with a party of 6 for brunch and it was delicious. Our kids had delicious lemon poppy seed waffles, I had a mixed grill hash skillet with chorizo, salsa, beautifully poached eggs and home fries. It was great. While the portions were not overly large, they were enough. The braised beef eggs benedict were served atop home baked cheese biscuits. Also good. The atmosphere and service is laid back and hipsterish, but not over the top. \n\nWe will be going back.","useful":0,"funny":0,"cool":0},
{"review_id":"MW840IfeKEMkAJqO6mY0vg","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"j2EyewjhVO4mT2fDMzUM7w","stars":3,"date":"2017-06-14","text":"Good curry goat and jerk chicken. Not special, but the only Caribbean joint on Roncy, so it is a welcome establishment.","useful":0,"funny":0,"cool":0},
{"review_id":"s0lKBVxPjUhR2DA7wY9pow","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"gB4JpmmLKClE1ZFAwFWBJQ","stars":1,"date":"2017-05-27","text":"One of the worst customer service experiences I have had. Living on Roncy, I have been several times before (apparently I'm not a regular though--lol see below). The food has been good.  Not amazing, but good with good portions. Last Victoria Day Monday, I went with my family of 5 plus my mother for brunch. We did not have a reservation, and we were prepared to be shut out. But to our surprise, the host advised a wait of 15-20 minutes for a table for 6.  My wife and kids did some window shopping and I waited and chatted with my mom.  15 minutes turned to 25, but I assume that is par for the course and understand this is an estimate. We were asked a couple times by other servers about what we were waiting for. We were the only ones waiting and there were plenty of open tables of 2 and 4, but they did not offer to push 2 together, but again, I understand they want to keep their set up. After 30 minutes a woman, who appeared to be a manager or owner, came out and advised us that it would be another 30-40 minutes for a table of 6.  \n\nI was flabbergasted. I explained what we had been advised and that we had already been waiting 30 minutes. She apologized and said the person who had originally spoken to us made a mistake. She offered to put us in 2 back-to-back booths, but that wasn't going to work for us because we were there for a family brunch not just to eat. I suggested mildly that they could just push tables together (which would not have created any blockages). And her response to me (when no one else in 30 minutes had been waiting for a table), was that her \"regulars\" expect to be able to have those tables. What!!!!  I live in the area and had been there several times. What am I?  Chopped liver?  I was speechless at her unwillingness to address the \"mistake\" they had made and to try to seat us as soon as possible. It seemed like she just wanted us to leave. So we did. Wow.  \n\nI haven't really written a review like this before but I feel compelled. I was embarrassed in front of my family and I could not even relate to them the exchange in a way that seemed real.  Should I have made a scene?  It's just not my style. But I will certainly be relaying this tale to everyone in the 'hood.   \n\nWe ended up going to The Westerly, which I had not yet been to, two doors down. And I'm glad. We had great food (better than Sunrise) and infinitely better service. I highly recommend it.","useful":0,"funny":0,"cool":0},
{"review_id":"m5_-eUC05Ji3PN-bSZ0E1w","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"WtFiIRFyyemKtS1x6TfuKA","stars":5,"date":"2017-05-28","text":"I have been going for years.  Simply one of the best rotis you will ever have. My mouth waters just thinking about them. Not cheap, and not fast, but the rotis are huge. If you like it hot the scotch bonnet sauce is hot and delicious. I love me some roti and it does not get better than this.","useful":0,"funny":0,"cool":0},
{"review_id":"a2Wc1WSLlxT3in9zIQwP-A","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"5iawpo9MaMaMcqtQxxbfqQ","stars":5,"date":"2017-06-14","text":"A defining spot on Roncy. Casual, personable atmosphere. Busy and there's often a line almost out the door, but that's part of its charm. It's low key yet maintains high standards. The offerings are simple and basic (no non-fat lattes nor anything too froofy) but expertly made. Their Kamikaze americano stands up in my view as one of the absolute best espresso drinks in the city. The baked goods too (when not overdone which they are occasionally) are fresh, tasty and delicate. I don't know where to get a better almond croissant. I'm a little reluctant to share this as the lines at my local coffee shop may only get longer. Oh well, just don't forget your cash when you come; they don't take plastic.","useful":1,"funny":0,"cool":0},
{"review_id":"O8jWq7UZp5LH4fqzOnlzlw","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"wK1SMAzIpHh-KYbrs7m0nA","stars":5,"date":"2017-05-31","text":"The original. I'm confident these sandwiches can go up against any traditional Italian veal, chicken and meatball sandwiches in the world. Growing up a mangiacake in Little Italy over 30 years ago (when there weren't that many of us) I had no idea how special it was. It was just the place in the 'hood to get your veals. Me and my younger brother used to spend our allowance money on veal sandwiches, walking a couple blocks past Sicilian Ice cream, or other sweets vendors, as we valued the sandwiches more highly. Now, having seen more of the world and sampled its fare, I have a deep appreciation for the simplicity and quality of the sandwiches there. I don't know exactly why they taste better than any other Italian sandwiches but there is apparently some serious alchemy going on in the back with the fat ladies banging pots and hollering in Italian.  Those sandwiches are certainly for my money tastier and more satisfying than any gourmet panini with soft cheese and unpronounceable mushroom. \n\nThis locale retains a fair amount of its authenticity despite a half-hearted superfluous reno years ago. Nobody goes here for decor, service or ambiance, although the unapologetic lack of these is part of its charm. They come for sandwiches, and my mouth is filling up with saliva just thinking about it. No use describing it, just get one. \n\nAs a family man now living further west I don't get here often, and while the franchised facsimiles don't compare with the authenticity, I have to admit they seem to have a bit of it and the sandwiches are good. But the original is the original.","useful":0,"funny":0,"cool":0},
{"review_id":"vwoUpDBoFtjD-B7UgHtJUw","user_id":"2Ie_l5I2R2xYvfYXMxRMsw","business_id":"xhCiQt_-pMp1nKDXZ7n7BQ","stars":4,"date":"2017-06-14","text":"Good pizza comparable with all the thin crusted nuovo Italiano pizzerias popping up. The pasta is also good. It is kid friendly before 8 and more adult-y after. Great if you have kids but still want to eat well.","useful":0,"funny":0,"cool":0},
{"review_id":"VRnxLdIQA7WoQdq13XocFQ","user_id":"w_aP-w-1VSwnwvz8CcMMng","business_id":"qdtfcYMROGZVvYcE9F23yg","stars":5,"date":"2015-10-12","text":"Best Mexican food period. I've been eating here multiple times a week for 15 years. Never bad food never a problem. Never even had them mess up an order. They always have it right. Carne Asada tacos with guacamole and tamales or chicken chimi enchilada style with green sauce are my favorites. -Kevin","useful":0,"funny":1,"cool":0},
{"review_id":"OOsaTc8ZlgkYRP6IR-RoRg","user_id":"95Nixb6vCcg4Yn3Q4ChA9w","business_id":"mz1zD5_eqyCQNuzAqB_iKg","stars":5,"date":"2017-08-14","text":"This is my first time here and I'll start by saying that I saw the reviews so I already expected it to be great. I am vegan. I came here for my birthday with my cousin who isn't vegan. We both really enjoyed ourself. I got the loaded nachos. He got a chicken quesadilla. We ordered guacamole as a starter. It was really good, I just wish there was more avocado. The flavor was delicious though. My nachos were really good. I liked the veggie mix. We also ordered dessert. I got the dessert nachos and my cousin got the churros. We both got ice cream with them. The chocolate ice cream is a must! All of this for only $48! Great buy, good atmosphere. We would definitely come back again.","useful":0,"funny":0,"cool":0},
{"review_id":"J0pHE8z4D_pDClxX1dnnvQ","user_id":"95Nixb6vCcg4Yn3Q4ChA9w","business_id":"dzbWN4oZT5vL7-OFZdMe8A","stars":5,"date":"2017-11-11","text":"I have been to quite a few dispensaries but never in Las Vegas. They blew my expectations. From the minute I walked in the door which you do need to be buzzed in by the way. I was greeted. There was never an opportunity to not be sure of where to go or what to do. I was told to go to the glass window to check in. The woman who helped me was so friendly, she signed me up for a rewards program. They then ushered me to the secured area where the actual cannabis is. We were then greeted by another gentleman who asked us what we were looking for. We originally came in just to get a few prerolled. We walked out with much more. I recommend the cannabis lotion. It works really well on joints and your back. All in all we will be returning.","useful":1,"funny":1,"cool":0},
{"review_id":"pPQgywPnohc5tfKjT3-gqQ","user_id":"9TgjL2XG0Zu3H9-ncRqXDg","business_id":"FfJD4vO-iYUL2Kr0WWzNYg","stars":5,"date":"2014-08-19","text":"Terrific. As a whiskey fan and from strong Scottish stock, this is a gem in the Big Smoke. If you are only in Toronto for a visit or live here get your butt into The Caledonian.","useful":1,"funny":0,"cool":1},
{"review_id":"mgAyL1P7P6fxnNfXXnugww","user_id":"1xdYJrYZO1aKnMKsG0SPuA","business_id":"FcYAwxuOys7NtnUPhRkA_Q","stars":5,"date":"2011-02-15","text":"Lotus is my FAVORITE Chinese food in the Henderson area...It is the only place I will eat Chinese food! I recommend it to everyone. It is clean and friendly and quite. Very child friendly as I have 2 kids. And the price is reasonable. The food is DELICIOUS!","useful":1,"funny":0,"cool":0},
{"review_id":"njaS8ESi46GqR6HGsQNozg","user_id":"1xdYJrYZO1aKnMKsG0SPuA","business_id":"if59L5DHM4pPMrCx9HuD8A","stars":5,"date":"2011-01-13","text":"We had our honeymoon here and it was great! The Buffet was not so good but the bar restaurant was great, CHEAP, and open at midnight! We had a great time in our suite, which was cheap as well. I would do it all over again the same exact way!","useful":1,"funny":0,"cool":0},
{"review_id":"KcEKWAw8tziGuzy-M4akWw","user_id":"1xdYJrYZO1aKnMKsG0SPuA","business_id":"Y25c4K4W6c87u6DHHrmE5A","stars":3,"date":"2011-01-13","text":"Everything went wonderfully! Except that we have been waiting for days to get our wedding video! We have been calling and waiting in there office...no one wants to give us our video...My suggestion to anyone is the Chapel was great for the price BUT get your pics and videos that day of your wedding cause once you are married they don't care about you anymore! You will not be there priority! Oh and the LIMO was late picking us up and dropping us off, we froze outside! But everything else was wonderful! I would go there again if we had to! \nJessica Moe (01-11-11)","useful":3,"funny":0,"cool":0},
{"review_id":"VMPX6y9tdzM5Gxra9iWLhg","user_id":"1xdYJrYZO1aKnMKsG0SPuA","business_id":"72nExGCaN2zbznwqmgykXw","stars":1,"date":"2015-10-06","text":"HORRIBLE!!! I went into this store tmobile @galleria at sunset, and never finalized anything. So we left after we decided the deal wasn't sweet enough for us and low and behold I start getting a tmobile bill via my email address....so I call the associate responsible for this whole mess and he tells me that's how tmobile does business!!! Apparently all sales are final even before the sale happens...lol!! Well corp. cleared the whole mess up but BUYER BEWARE even if you dont buy anything! Be careful who you discuss a purchase with because they are so quick to sell you something you aren't buying!CONFUSED? I was too so please be careful. Tmobile does not need a signature to activate phones in your name all they need is your name and since i let them run my credit, they had my ssn...and there you have it a bill for $148.00 for a service I never agreed to have!!! This should be illegal. Just really bad business.","useful":2,"funny":0,"cool":0},
{"review_id":"WkD6zvngpJ8Nujdpex_szA","user_id":"vx0PnHHL9P7JQ2OsHk7WFw","business_id":"BLIJ-p5wYuAhw6Pp6mh6mw","stars":4,"date":"2009-01-04","text":"Loved the decor and 'vibe' of this hotel.  Our room must have been upgraded because it was very spacious.  The bedroom was big and the bathroom was incredibly large.  I liked how the room was decorated modern and hip.  The only quirky thing about it was the movie memorabilia from the film 'Made in America' starring Whoopi Goldberg.   Aside from a couple of photos from the film hanging in the room, there was also a glass case displaying one of Whoopi's outfits from the movie.  Aside from that, I loved the room.   \n\nThe restaurants in the hotel were convenient and very good.  We had a late dinner one night at Planet Dailies (the Tex-Mex Egg Rolls were excellent.)  We also ate at the Spice Market Buffet twice, once for breakfast and lunch.  The wait staff were friendly and the food was great. \n\nI would definitely stay at ph again.","useful":0,"funny":0,"cool":0},
{"review_id":"8lAeo85agouK_lmy-aLtsA","user_id":"sO7-ECQFBT89Acj6NiJw5Q","business_id":"0q_g4jpc9iod5swiru7n1g","stars":1,"date":"2016-08-26","text":"If I could leave 0 stars I would. Unfortunately I do not remember the lady's name that was checking us in at the counter. She was very rude and at one point asked me a question and then didn't give me a chance to answer before holding her finger up at me (telling me to hold on) and picking up the phone to call up to the floor with the cars. When talking about filling the car up before bringing it back I was informed that the gas rate for them to fill the car back up was $2.17 and I said no we will fill it up. She informed me that I have to fill it up within 10 miles of the airport and have to bring a receipt and the receipt will show whether or not it was within 10 miles. I said that's fine we'll take care of it, $2.17 is expensive and she looked at me like I was an idiot so I asked her how much gas was in Charlotte and she stated that it was only a couple cents different which is a lie. Gas was $1.89 at 99% of the stations we saw except for the one right across the street from the airport. At this point I was so fed up with her that I just told her to add it on there. \n\nI was also asked if I wanted high, medium or low insurance? I was so pissed at this point that it didn't even register for me to say no insurance...although she probably would have somehow made me add it anyways. I also have a hold on my account for $50 more than the cost of the rental and my credit was run because I used a debit bank card instead of a credit card. She stated \"because you're using a debit card I will have to run your credit and your score will go down\". I did not have a credit card on me, which is why I used my bank card. Running my credit is absolutely UNACCEPTABLE, there is no reason for it. I should have taken my card and ID back and walked away right then. \n\nThis was by far the worst experience I have EVER had with a rental company.","useful":3,"funny":0,"cool":1},
{"review_id":"Dxng9nWIDl6ZONlKAJ-diA","user_id":"uQtqqZ9mE89aBeqBFzsj8g","business_id":"ckWt7of709bsCZ0y302Y1g","stars":4,"date":"2016-01-05","text":"Started off rough but Mark stepped up and met the problems head on. He has been very helpful in finding the right house.  I will give an update after we stay at the house and can confirm how well things went","useful":7,"funny":0,"cool":0},
{"review_id":"Fvau1XJkqFoLDMEaI9JiXg","user_id":"Zq-Qsf_T6BxQvOybnblzmA","business_id":"c_iQzwsTDYraPvHSKz88QA","stars":2,"date":"2014-09-12","text":"The drinks in the goblets are fun and the one I ordered was good (with orange slices and fruity flavors, cant remember the name) but the gummy worm one was soooooo sweet we could hardly drink it! I didn't order any food but the people I was with did and they said it was okay.\nFried mac and cheese- good, but needed warmer marinara\nChicken tenders - way too much breading and no fries?!\nFrench dip - was pretty good\nwe did order a sundae with all sorts of cookie goodness and that was probably the highlight of the meal.\nAnd luckily this was vegas so we got the gummy worm drink it to go cups (it still filled two cups) and drank them on the way back to the hotel!","useful":0,"funny":0,"cool":0},
{"review_id":"-ewPZhzRNQhtM3Yi34FRBg","user_id":"Zq-Qsf_T6BxQvOybnblzmA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2014-09-12","text":"Delicious! ordered two steak frites, one with filet and both with Bearnaise sauce. The star should be the steak which was good but man I loved all the frites! I ordered my filet medium rare and I may just be being picky but it was more on the rare side. I still loved it either way!","useful":0,"funny":0,"cool":0},
{"review_id":"mZj70bqFDiZQptGTqD05Uw","user_id":"Zq-Qsf_T6BxQvOybnblzmA","business_id":"5OqrwhtZ3mcmUSwLINZTWQ","stars":4,"date":"2014-09-12","text":"made a reservation shortly after they opened so the place was empty. They staff was very attentive and friendly. We ordered egg rolls which were filled with crisp bell peppers not soggy cabbage! They were perfectly fried and not that greasy. For entrees I got the Mongolian beef and my boyfriend for the kung pow chicken. Both were delicious and served with fresh veggies mixed in. They also give you hot towels after each course which I thought was a nice touch (especially after egg rolls)","useful":0,"funny":0,"cool":0},
{"review_id":"_Yh3w6ygVG8fqWxmKiDkXQ","user_id":"RIf-hFIJNS4GeNa_WVKZGQ","business_id":"pik4ebdFa0UcUhnNkivFcg","stars":1,"date":"2016-07-23","text":"If I could give this place ZERO stars I would.  Some of the worst service, with the rudest management that I have ever encountered.  My wife planned my 40th birthday dinner there with some very close friends.  We were supposed to get a private room, a 4 course meal, a specialized birthday menu, all for a group price.  Instead we got NO private room, a 4 course meal with the WRONG food that we had pre-ordered, TYPOS on the specialized birthday menu, and we were then overcharged.\n\nWhen I tried to dispute all of this with the manager - BRETT BODE -- he said there was nothing he could do about it except offer to take a few drinks off of our bill.  He was rude, aggressive, and could care less about customer service.  When I tried to dispute the fact that they overcharged us per the contract we signed he blatantly ignored it.  When I said I will contest the charges with my credit card company he threatened to call security in to escort me out.  After spending A LOT of money there for a milestone birthday with some of my closest friends, I can honestly say that this is by far the WORST service and the WORST manager of a restaurant I have EVER encountered.  While the food is okay, the service is poor and the management runs the place like a factory shuffling people in and out.  I caution you HIGHLY before bringing a large group into this restaurant, especially when Brett Bode, the manage is overseeing the place.  The ABSOLUTE WORST. If i could give it 0 stars I would.  They ruined my 40th birthday, and I am sure I'm not the first person they have done that to.  BEWARE.","useful":0,"funny":0,"cool":0},
{"review_id":"Ye2PbfRZjItOI_m_4ZMhlA","user_id":"v-ww7rqLp0IaZVXFwtqUKA","business_id":"TFpiquSDJjJET6EZtpcv9g","stars":5,"date":"2014-03-05","text":"So here's my story and why I'd recommend Gloss It to anyone without a doubt - \n\nI recently purchased a brand new car, and I do my best to maintain paint jobs on my car and keep them looking as nice as possible. I drove the car down here from the Portland, OR area, which meant that it got disgustingly dirty on the road trip down to Las Vegas. I am not a fan of automatic car washes, and I stumbled across Gloss It during my search of car detailers in the area. I gave Rich a call and he was incredibly friendly over the phone and said they could get me in within an hour and told me to come over. He was incredibly professional and friendly once I arrived, and took me through the shop and showed me around before his guys went to work on the car. He took the time to answer my questions regarding my own detailing techniques and was really informative regarding his products. Not only that, but he brought me the WiFi password to use while I waited for the car to get cleaned.\n\nThe car came out looking awesome, and both the employees who did the detail work did a great job and were very friendly. Rich, the owner, comes across as a passionate and friendly businessperson, and it really seems like he knows his trade. If you care about your car and are looking for a good detail or want to look into detailing products to use at home, I'd highly suggest giving him your business.","useful":2,"funny":0,"cool":0},
{"review_id":"HCKzLiqRy_a0iZyn__ZkZw","user_id":"2ZEaKmqcUFjuWCowhcf0Kw","business_id":"rjUuCbH7q-bSw5iWMwMHhQ","stars":5,"date":"2017-03-12","text":"Great place for tacos, tostilla and Mexican soup. Very reasonable price and great taste. The owner is super nice and hospitable. They have breakfast and Mexican breakfast all day long.","useful":1,"funny":1,"cool":0},
{"review_id":"TD_dFOK7u_XH5js_Mt6jQg","user_id":"bQa53uSL5T-kSm2E4EwnlA","business_id":"ZQ-7uFQk21NHoOzJfhEjBw","stars":1,"date":"2016-02-23","text":"Wish I had positive things to say. I ordered a mocha latè and I got coffee mix and full cubed ice. Lol took it home and used my blender. Pathetic attempt at service. I mean it's 40 mins till close, not quite 5 or 30 minutes. Oh well. Can only hope other shifts are better. I'm done at this location. And yes, I have been to this location several, even multiple times and this is the only time. Shame","useful":0,"funny":0,"cool":0},
{"review_id":"n8kn9_w93zO_k1cJ7ZYlzw","user_id":"bQa53uSL5T-kSm2E4EwnlA","business_id":"01cFftHZc98jNJfJrLEJ5g","stars":4,"date":"2015-10-01","text":"At first glance of this place I had high hopes.  Nice enough decor, nothing fancy. The menu alone is quite extensive, comparable only to another mile high menu Ikes out of Tempe. After deliberating over 100+ sandwiches, ordered the 'Hat Trick'. To my surprise, was perfect. Was almost like a Alfredo pasta squaw with chicken toasted bread. Where to go wrong? \nThe only reason I can't give it a 5 stars, it appeared understaffed & just a few minor details that matter. Plus $14 & some change is a little much for a young man like myself. I do appreciate a good meal so,I came through for a new place.  So with that, I can only hope to come back and be impressed once again.  Who can say? I'm hoping for another well done sandwich.","useful":1,"funny":0,"cool":0},
{"review_id":"lyL1Y_Z8LPlS7Wu_VIRc4g","user_id":"bQa53uSL5T-kSm2E4EwnlA","business_id":"2zo1Gg_ERRjn5LzX9hzR5w","stars":4,"date":"2015-09-12","text":"Got nothing but good things to say. I've tried just about everything from the pizza to the calzones and the wings. Friendly staff, casual and professional. Haven't had a bad experience yet. I mainly eat there during pm hours.","useful":0,"funny":0,"cool":0},
{"review_id":"8DGHHjwxl52rZ0CZd2NLvw","user_id":"_zbT1gfYcb4tIPsa--ytNQ","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":4,"date":"2015-08-04","text":"Stayed here 1 night driving across the southwestern US with my five year old. This was the best of 3 hotels we stayed at during our road trip. First and foremost our room was clean. The bed comfy. The ac was loud but I liked it because it covered any noise from outside.  We booked through hotels website and ended up in \"the manor\" which was fine with me. The only negative was the dripping bathtub faucet not the noise just water wasting.","useful":0,"funny":0,"cool":0},
{"review_id":"fHf6Z7Z2yC3KrzgFNL1FXA","user_id":"Up9kYquvpXWe-S_w4xdpOQ","business_id":"6ZvyA9xE0bKGanHOTjLioA","stars":4,"date":"2013-06-14","text":"Average chain restaurant with the average variety, but still good teriyaki salmon and mac and cheese. There is not much to say.","useful":0,"funny":1,"cool":0},
{"review_id":"5AcAteaZNwL5zv3O7oRHSw","user_id":"Up9kYquvpXWe-S_w4xdpOQ","business_id":"9UU2DPhwmTmkuANzYiZSMQ","stars":5,"date":"2013-06-14","text":"I like this place. If only there were Cheddars in West Chester, PA, that would make me happy!\nPros:\n1. The waitress recommendation of tilapia with mango salsa was delicious! I ordered it with broccoli casserole and carrots.\n2. The mango sweet tea was delicious!\n3. I loved the setting of the place, including the aquarium!\nCons: None, there was nothing bad to say.","useful":0,"funny":0,"cool":0},
{"review_id":"1JtVA7T7uRZXahEXpHcJBg","user_id":"0qGvPB3HWNKaFF-59I_nKw","business_id":"P6paPwtYXcwn4vbSXViIaQ","stars":2,"date":"2014-02-27","text":"Pretentious to say the least. I asked for water with my drink and she brings out bottled water, I said i didn't want bottled water just a glass (like any restaurant including any 5 star restaurant would bring). She told me they don't have tap water. Really? You don't have tap water? Makes me think what's wrong with you plumbing and what the hell do make your rice with. And if you're going to act all pretentious at least serve high end water, not cheap nestle bottled water. I lost all interest in this place after that. Their food is nothing extraordinary.","useful":6,"funny":4,"cool":1},
{"review_id":"ON4I1gdqSLqffLH_KLaA1w","user_id":"0qGvPB3HWNKaFF-59I_nKw","business_id":"RwZsmeNeH1nt2WhDO9dakg","stars":1,"date":"2014-02-28","text":"Unprofessional. Rude dispatchers. I would not entrust with any documents based on how dispatchers spoke to me over the phone. Was quoted two different rates within 10 minutes, then the dispatcher raised his voice. Prices are NOT fixed, they vary dispatcher to dispatcher, I suppose on how much money they think you'd be willing to pay or how urgently you need something.","useful":1,"funny":2,"cool":1},
{"review_id":"O-w5n8XIjc_QGkjV20VIJw","user_id":"iqWdJIhpyecYoOvb416FsA","business_id":"P4bah6KYSOv18PTwKgz-9w","stars":5,"date":"2015-01-26","text":"The group at Hospitality Dental could not have done a better job. My recent experience was as good as it can get at a dentists office, as I am not a dentist fan. In fact I have extreme anxiety when it comes to going to the dentist. They ALL put me at ease. I received an exam, cleaning, and two fillings done all at the same visit. As far as I know that is going above and beyond! I was saved another trip by them doing everything in one visit and as a busy mother and student that was very valuable.","useful":1,"funny":0,"cool":0},
{"review_id":"nNQkma3bIy1Da1JMy7KVgA","user_id":"iqWdJIhpyecYoOvb416FsA","business_id":"zRqi6L1u-YmmVAHjeUbGMQ","stars":1,"date":"2015-01-26","text":"The food is ok but not worth the terrible service .i waited 45 minutes for a juice and lady comes out and says sorry I was on phone .","useful":1,"funny":0,"cool":0},
{"review_id":"L8K93W_o0yPkUSC8xiHXtQ","user_id":"SPQkNTGjnnKUOcMA6h26pg","business_id":"hrhtWc8UcoZqYr2d7YPgEA","stars":3,"date":"2015-09-02","text":"Stayed at Tropicana for 4 days and three nights. First, the good things:\n The paradise tower is good and the room was nice. \nThe pool was nice and food was reasonably priced.\nSadly, I won't be returning to the hotel. With so many options, I wonder how Tropicana can afford to have an indifferent and bordering on rude registration desk and an inefficient concierge!\nWe reached early and were told by a borderline rude lady that we will have to wait till 1. Which is ok, rules are rules! But whatever happened to speaking nicely and adding that they are sorry for the long wait! Nothing! I asked after a while and was told that there is no room as the maids haven't come yet at the hotel to clean it! Really, it was 10.30....\nShe told us, we would have to wait till 3!!  What happened to the rules?? Anyways, on third attempt our resilience paid off, but it left a very bitter experience.\nAgain, only if these people spoke nicely, it would have been ok. They were just plain indifferent and rude. It was like they were bored and DMV has some nicer people than the registration desk.\nThere were some entitlements with the resort fee and when I went to the concierge to get a retail outlet VIP book, I was told to go out of the hotel and look for a booth! Found it, after going around in circles... Only to find it unattended...\nCame back later and a young woman was manning it who told me to go inside, I told her that they send me outside. She then said that she doesn't have anything to give me as she is just covering for somebody who will come the next day!!! Hello.... I am leaving the next day...\nIn the room, The bath tub was a bit chipped. \nMany parts of the pool are closed on weekdays as there were no lifeguards!","useful":0,"funny":2,"cool":0},
{"review_id":"QoczfYjdpUsx0htGuwR8aA","user_id":"P1DgpIpm0uDBG9tIFwc7UA","business_id":"Ck52f0L860GKPcMXkKAtuw","stars":5,"date":"2011-04-17","text":"I made an appointment for 715 for a group and they welcomed us! I did feel bad that we kept them past close but they were really nice, and they did an aweeessomme job. They did nail art for us and it was done perfectly! Overall great place. I made a Yelp account just to give them this review. :)","useful":3,"funny":0,"cool":0},
{"review_id":"O_gnlqDKG5HUKSbX26uU4Q","user_id":"_tj7pqi3kSvXt1HwGE4y6w","business_id":"LnEaDZms5NfvZHLnvamgyA","stars":1,"date":"2016-05-22","text":"I'm a long time customer at the piano bar and an avid karaoke participant at the piano bar.  For the past 5 years the karaoke host rusty has been rude and unfair.  He's  constantly skipping myself and several other long time customers.  Changes and try to change the songs we pick to sing. And he puts people who tip him 20 dollars or more ahead of customers who've been waiting for hours to sing. Myself and the other long time loyal singers have had it with his ways and things need to change. He tries to say it's because we don't purchase or consume beverages from the piano bar but he is constantly putting several of his friends who come in up to sing and they never purchase beverages from Harrah's.  I admit I don't always purchase beverages there but I don't purchase. This needs to be addressed IMMEDIATELY","useful":0,"funny":0,"cool":0},
{"review_id":"UfOtLcG69CtGwpxR0PQrkw","user_id":"7Zso-h_G7xBX9UzCdj71Nw","business_id":"hTxTFpCT4PnC553nUbM4kw","stars":1,"date":"2014-02-04","text":"Went to the Mississauga store - worst customer service I've ever seen.  Not worth any of the savings.  4 sales people in the store, not one got up to even say hello.  They all just gossiped amongst themselves.  I would not ever buy from these people - I walked over to the Brick and although pushy they are at least helpful.  With customer service like this they will never survive.  Good luck keeping your warranties.","useful":3,"funny":0,"cool":0},
{"review_id":"5rYkhBRFWdLGa2K-yGCECw","user_id":"Xwkptt2QcNAtlSVk4mW7cQ","business_id":"GNScqNuJ2mmVrq7TYbwxVw","stars":5,"date":"2010-07-19","text":"I highly recommend this studio for it's sereneness, cleanliness and tranquility. The air is fresh- very unlike other bikram or hot yoga studios. Care has been taken into the design and ambiance of the studio environment. Shosh and the other instructors are very enthusiastic and peaceful, and they encourage that deeper and healthy stretch. \n\nI'm particularly pleased that they are open all days of week! and best of all they are affordable.","useful":0,"funny":0,"cool":0},
{"review_id":"sCNcwQESvJFWpXlYOoMAFg","user_id":"TrA53MFDA71GbmJy147dhw","business_id":"uUq0bMEjt202bMbRHkIcNA","stars":1,"date":"2016-08-25","text":"Be warned not to come here, the food is not worth your money. Today me and my friends decided to go to Mabu Station because they have a wide selection of food and they were still open (compared to other cafes). I decided to order the mixed fruits with mango sauce topped on a scoop of ice cream, one of my friends ordered a waffle dessert. As me and my friends were casually talking, each of our dishes were being served, EXCEPT for one dish that literally took more than 20 minutes to be served. My friend and his girlfriend realized that their waffle was \"UNCOOKED\". In the picture, you can indicate the waffle does not display a golden brown colour which shows that it was not properly cooked and the texture of the bitten parts of the waffle looks like the waffle batter is sagging out. My friends decided to call out the waitress, her response through the problematic issue was \"sorry I can't fix this because you ate almost all of it\". In all case, a waitress should not be saying that if a waffle was uncooked especially if the toppings was hiding the uncooked waffle for customer not realising it was \"ACTUALLY UNCOOKED\". For my dessert, it was not appetising. Some fruits were fresh, but some of it killed my tastebuds. Seriously, why would they used canned preserved fruits to topped on my dish? I rather just go home and make the dessert by myself. \n\n\nWARNING FOR FIRST COMERS: Just because the restaurant\/interior or the pictures of the menu looks visual appealing, doesn't mean the food will satisfy your taste buds. \n\n\nI will not be coming to this restaurant again and I will definitely not recommend this restaurants to any dessert lovers.","useful":1,"funny":0,"cool":0},
{"review_id":"gXBtwd4voanuwVMl9ZP5BQ","user_id":"MkfsQefGBOSbF2drZNVABw","business_id":"T1A2zbyPfwGrJgG_8hAirQ","stars":2,"date":"2011-06-28","text":"Stayed here for a long weekend. \n\nReserved a standard room with a king size bed. Check in was quick and painless. However, was given keys to a room with two double beds. Was told that all reservations made through third parties are automatically given a room w\/ two doubles.....was ultimately given a room with a king bed. No big deal. Hotel was a virtually empty. \n\nHotel is old, old, old. The safety on the electrical outlet kept getting tripped by the ultra-high voltage device I always carry with me...my cell phone charger. Television set was ancient and terrible. Lock on the room door was broken. This might not make sense, but the room was very creaky. Bed was worn out. \n\nNow back to my comment regarding the hotel being virtually empty. The last night of our stay, a bus load of 10-13 year olds on a field trip were put in rooms on all sides of us. It was as if they literally put us in their block of rooms. There must have been forty of them with no more than one or two chaperons. They commenced to bang around and scream till the wee hours of the morning. Why is God's name did they have to put them all around us in an empty hotel? \n\nWith so many other great options in Scottsdale, certainly no reason to give this place another shot.","useful":2,"funny":0,"cool":1},
{"review_id":"iKspBgMKXTp-EZ5KWEDeeQ","user_id":"MkfsQefGBOSbF2drZNVABw","business_id":"-FLnsWAa4AGEW4NgE8Fqew","stars":4,"date":"2011-06-28","text":"Ordered the turkey egg benedict. Holendaise sauce was different and very good. Had a little spice to it. Breakfast potatoes were very good. Good service.","useful":0,"funny":0,"cool":0},
{"review_id":"LzWZyTUuF-ZbUSDoXadoAg","user_id":"MkfsQefGBOSbF2drZNVABw","business_id":"eDlgbI0Qg_mmI-Osvci0gw","stars":3,"date":"2011-06-28","text":"I'm starting to think that the best teppan grill restaurant is just marginally better than the worst teppan grill restaurant. I would rank Sapporo around the middle so I would say its almost the same as the best and the worst. The food was good but not great. Service was excellent as with pretty much every teppan restaurant. Cook was cool. Did the same old tricks that every other cook does. Its like they have a newsletter that goes out to each and every one of them. Japanese egg roll, volcano, yada yada yada. Had a pineapple martini which was very good.","useful":0,"funny":0,"cool":0},
{"review_id":"VyptBEeI-xwcAz97b197gg","user_id":"HXYMLrxUVa-uMX2xkloVug","business_id":"XmsBtCykUtObXg4Q1mYpvg","stars":5,"date":"2014-01-28","text":"Thank you Yelp for consistently helping us find amazing restaurants anywhere we travel. My first cheese curd ever and I was floored we ordered a second serving. The beignets were delectable. The beet salad was exceptional. The service was fantastic. The view of the most impressive building in Madison was also a treat. Can't wait to visit Wisconsin again and stop at Graze.","useful":0,"funny":0,"cool":0},
{"review_id":"uk3zODYN0zWKhYALCz4W3g","user_id":"TkUWUA9F_3-_C-tsejAn0Q","business_id":"9wmLQsmEZ5GgIIocrmitZw","stars":4,"date":"2016-02-13","text":"Had a great experience renting a Santa Cruz mountain bike from Dave.  He delivered the bike right to my hotel and picked it up the next day.  The bike was in excellent working condition (which is not always the case with rental bikes).  Dave also gave me some good tips on where to ride.  I will definitely use them again for bike rentals around Scottsdale.","useful":0,"funny":0,"cool":0},
{"review_id":"_2zr7JmQ7MymniwNxi3h2w","user_id":"oeegkKHhAkVcODMMjU4TIg","business_id":"as-VRXsqpDMWYtWWdSyu2w","stars":5,"date":"2015-05-25","text":"I would recommend Right Way Auto Repair Shop to anyone who needs an honest garage to go to with their car. My repair was done fairly and affordable and I could not be happier.","useful":37,"funny":0,"cool":3},
{"review_id":"Qf_zWJ59VktE37DltT9KDA","user_id":"4ayrHCiSeyglsl6fkuOFHg","business_id":"3i0LSSyKRSYLC9hbS-mYTg","stars":5,"date":"2016-09-30","text":"Dave converted & updated my RV's air conditioning to R-134. Job was completed quickly and cheaper than other shops quoted. I will definitely bring my other cars for any service work","useful":0,"funny":0,"cool":0},
{"review_id":"PDA7S7innimp2NU_rFhKPQ","user_id":"DWWIETD4gnvm4EO3Rma-Gw","business_id":"7I_xWHdCaH-CtZLQGkhsjg","stars":1,"date":"2016-11-13","text":"We had some major problems with service when we went, but our food was good. We may come back to try again and hopefully give a better rating.","useful":0,"funny":0,"cool":0},
{"review_id":"mrVjs-lNrg-cCneR5KGPXw","user_id":"DWWIETD4gnvm4EO3Rma-Gw","business_id":"W7gGZgcgzv-LFvk-s5csXg","stars":4,"date":"2016-09-12","text":"We stopped through here while visiting shopping in the Strip District.. The smell was amazing, and over the doughnuts were good. We tried a maple bacon doughnut and a cinnamon sugar,  both were good and just the right size after eating a larger meal for lunch. The place was a little odd, it was very hot and overall did not look very clean.. The staff was friendly and we were quickly in the door and out. Great spot if you have a sweet tooth and want a little less of the guilt!","useful":0,"funny":0,"cool":0},
{"review_id":"TMRP-BiAf726odFtCEz63g","user_id":"DWWIETD4gnvm4EO3Rma-Gw","business_id":"d2ZQRjuizstCTnicysmpMQ","stars":2,"date":"2016-09-12","text":"Based on the reviews on Yelp, we decided to try Eleven this morning for brunch. We weren't greeted with a very warm welcome to start, and we were almost seated on the restaurant side but our table seemed a little close to the kitchen (open kitchen concept), so we opted to sit in the bar. The dated couches and decor in the bar seemed like it was due for a remodel, but we wanted to give the place a shot anyway. Our service was overall pretty lack luster, we had a few questions about the menu that either couldn't be answered or were answered quickly with a somewhat short response.. We opted to get the price fixe that included a cocktail, appetizer and dessert. The pastries they brought out were great, although the biscuits were a touch dry\/overcooked. Both my husband and I thought our food was mediocre for what we paying, and my steak with the crispy farm egg (egg was delicious and great!) was very overcooked.. Our bartender (didn't mention name) was busy chatting at the other end of the bar, so we sadly didn't order another bloody mary (which was also very good).\n\nOverall we just didn't feel as comfortable as we would've hoped for dining in a nicer establishment like Eleven.. The food was okay, and the place has potential, it just fell short in a few key areas.","useful":1,"funny":1,"cool":1},
{"review_id":"doQPy1OItYDIicizhgNc1w","user_id":"DWWIETD4gnvm4EO3Rma-Gw","business_id":"Voeq7aGDmCGMjE_SQiHwRA","stars":5,"date":"2016-09-11","text":"Wow!! I'm not sure I can say enough good things about this place! The Starbucks in our hotel recommended us to try Bakersfield for some tacos and cheap drinks since it was right across the street from where we were staying. We came in for a late dinner on Saturday night and went downstairs to sit at the bar because upstairs was a bit crowded. Our bartender was fantastic, and not only had great knowledge of the menu, also gave us a good lesson on the difference between the types of tequila, because we didn't know about aged tequilas. Our margaritas were delicious, I had the spicy and it was just right on the spice. We ordered the guacamole after he said it's made fresh, and it was delicious! This might have been the best guacamole I've ever had. We ordered 2 tacos each, all were great. My hubby got a pork belly and the only thing he mentioned was a little bit of extra liquid on the taco which made the tortilla just a bit soggy.. Will be moving to Pittsburgh soon and we will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"Bkdr7B4G2fKxwFfATWUcZQ","user_id":"nKbKRAyiGxpVHT1MhIYY5g","business_id":"HkEBpQgM18GvXAD62CmF-w","stars":1,"date":"2016-04-06","text":"My daughter encouraged me to go to Orange Theory (she goes to the Scottsdale location on Indian Bend). But, I live closer to the Paradise Valley OT- I took my 1 free class- I liked it-so I signed up for 1 month unlimited classes $159.00 and bought a heart rate monitor $85.55-I went for my first class after the purchase and in the 2nd portion of the class- where you do the different exercises my back started hurting. I told the instructor and she said I should modify or not do some of the exercises and not to use the rowing machine  because some people say it hurts their back. Because I have had lower back pain flare-ups over the years, I knew to rest for a good week and take Advil. I realized OT wasn't for me. I went back to OT to get a refund-and returned the HR monitor-the girl at the desk-who actually sold me the membership- went in the back to talk to someone and came back and said they would refund my credit card-a week went by and I didn't see the credit-I called and they told me they changed their mind and unless I brought a Dr. note,I wouldn't get a refund (even for the heart rate monitor that I had returned). I asked them if anyone was going to contact me about that???? I am disgusted by their unprofessionalism and lack of integrity. That is my hard earned money that they kept.","useful":6,"funny":0,"cool":1},
{"review_id":"1obcgwnukYXiTobusir5nA","user_id":"nKbKRAyiGxpVHT1MhIYY5g","business_id":"E5AMBRf_2ZdawMMp1nG2eQ","stars":5,"date":"2013-03-20","text":"I bought 5 trees from Moon Valley and just had them delivered and installed.  CJ and his crew were great.  CJ made sure the plants were going in the appropriate location.  I would definitely use them again.","useful":0,"funny":0,"cool":0},
{"review_id":"dXA1-FDyWZOGSoUumPW-Ow","user_id":"g0zUN18lSO_eWJ-cZezqUw","business_id":"gUR2pWQKLPgMEm_R_aI_aw","stars":5,"date":"2014-12-05","text":"Awesome atmosphere, staff, food and kid friendly. A++ in my book!!","useful":0,"funny":0,"cool":0},
{"review_id":"eaVw8arQU3hroDJF9oa6hg","user_id":"g0zUN18lSO_eWJ-cZezqUw","business_id":"DSlSSiVcLPz31qZemVEd-A","stars":2,"date":"2014-12-05","text":"I stayed at many Hampton's and this place was, alright. The good thing about this place is you're right downtown close to everything within short driving or walking distance and we had a beautiful view of the church across the street. Bad thing no pool.","useful":1,"funny":0,"cool":0},
{"review_id":"0WCL6ibPEXWTPHvcPyqliQ","user_id":"CsHptdqGKYn0prm1Ww6NGw","business_id":"iBihgoxc6Ot7m2D4D3z0QA","stars":5,"date":"2012-12-01","text":"Great food and great beer! Had the pepper bacon cheesebuger the last time I was there and it was absolutely delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"h4511if7aTKITye6DRYdYg","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"MvZWfAzJSmMczSITvvv5MQ","stars":1,"date":"2015-06-30","text":"Long story short got my nails done here 2 days later one broke i went to the salon to have it fixed and the day after another two broke and they charged me $18 to fix two nails not to mention she did a really horrible job. Theyre prices always change from what is written to what they say on the phone (if u know what i mean) its just not nice paying more then u should","useful":3,"funny":0,"cool":0},
{"review_id":"vAwPhepgPbDjW_zpcRh_Uw","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"tk2qTUVb3moJWWLwzCNUZw","stars":5,"date":"2015-09-03","text":"The only place that does a flawless job and my nails don't break until i go back for a refill! They dont do pedicures, its pricey and they take longer than average but well worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"Zz3sHpzCUIFFnwf9tABjvA","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"OdwAOBK8xb5JVbsPuVxNQg","stars":1,"date":"2015-05-21","text":"I just walked out of my appointment with Fadi, i called yesterday and explained to him on the phone that i wanted to pay cash up front for the whole year and he said that i would have to go in for him to explain to me how it works, upon arriving he seemed pretty arrogant not welcoming at all, and he told me that if i want to pay up front for the year its $900 for the year and if i sign up for the monthly payments its $600, it absolutely doesn't make sense to me that if u wanna pay upfront for the year its $30 more a month when they should actually give u a deal for paying up front.\nI told him i didn't feel comfortable doing that because i have been with goodlife previously and they would take double payments out some months. I then asked if i could try out the gym he said that i couldn't because i was previously a member, i know how gyms work if you haven't been with a gym for more then one year( which i haven't been with goodlife for 3 years) you can try it out for 3 days specially if its a different gym. \nI then asked to speak to the manager he told me he is the manager with a smirk on his face, needless to say i will never step foot at a goodlife. They lost 2 customers(me and my husband) for good.","useful":0,"funny":0,"cool":0},
{"review_id":"MTEkjyKoR9oXhxm838gefw","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"s-AAk9cl3r7lthX-xxs4UQ","stars":5,"date":"2017-11-14","text":"This is a great store with a great selection, this store is very selective about everything they carry prices are very reasonable(they price match everywhere else) and they have some of the best quality clothes for babies.\n\nSome of the younger staff arent as helpful because they dont know too much about baby products but never rude.","useful":0,"funny":0,"cool":0},
{"review_id":"JZBSZJo2vr4nnzC4vqXu6g","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"c6f8wBjPLDzyubEBqgcMnw","stars":5,"date":"2016-01-13","text":"This is by far my favourite coffee place in Toronto located near st lawrence market, the baristas are always very friendly aaand they gave me couple free treats to take home near closing time\nNote: they dont do espressos and quartos to go because they know their shit.","useful":0,"funny":0,"cool":0},
{"review_id":"C6guEoX1zVmfV4cQgKOHSA","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"Cyy95sS5r6MGzgEA4UZX5g","stars":1,"date":"2015-05-21","text":"Just to update the manager responded to my review asking if i wanted to see a stylist to fix my hair but i declined the offer as my review wasn't intended to get a freebie, i stand strong behind my review and will not go back to that salon.","useful":24,"funny":0,"cool":2},
{"review_id":"RSFOTpYObr4KiyrfM9WO5g","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"zrYpLdnGKA_EmOhgRCy_vg","stars":5,"date":"2015-05-28","text":"This place is amazing! It makes me so happy to see people from all cultures enjoying Iranian food, amazing food, cozy atmosphere, nice classic Iranian music in the background and great service too","useful":1,"funny":0,"cool":0},
{"review_id":"4V6ivc1HI9ttfHQvJ0ct3A","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"QF4tRJ-ot7dYwebAsn0seg","stars":4,"date":"2016-02-28","text":"This is hands down the best thai food in town, everyone raves about the chicken lychee curry and its worth all the hype, i also tried the chicken basil recommended by the owner who is super sweet and accommodating.\n\nHowever the service here is slow and its always a long wait for food and thats the only reason they're not getting a five star. Please speed up the service! even tho ill keep coming back for the food regardless.","useful":0,"funny":0,"cool":0},
{"review_id":"w5v4OMPV166o_bcVmWmRjw","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"JN8s_dgw9nrSzkHnXxNOtg","stars":5,"date":"2015-09-13","text":"This is the one place i cant wait to come back to every time im in Montreal. Its comfort food at its finest kind of like your grandma giving u a big warm hug but even better.\n\nFavourites:\nFried chicken\nMac and cheese\nHush puppies\nBrisket(with their home made bbq sauce)\nBiscuit and gravy\nArnold palmer(drink)","useful":1,"funny":0,"cool":0},
{"review_id":"Mmx7XoGNhMjp-rdHgfx-QQ","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"F8qQlXP38A4ATAkcTofLeg","stars":5,"date":"2016-05-14","text":"First time here today and i loved it, Arty is very sweet and friendly which made the time go by really fast, she did a great job on my shellac for a reasonable price","useful":0,"funny":0,"cool":0},
{"review_id":"FyX0JbH3pCMfMCVQTba2iQ","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"Jdipkg6DMO_XbKokAKTNfw","stars":5,"date":"2017-09-09","text":"I went into this store looking for maternity leggings and i ended up leaving with a few adorable maternity outfits, i was trying to get through pregnancy without buying any maternity clothes but nothing dresses up the bump and is as flattering and comfy as maternity clothes that are specially designed.\n\nThe prices here aren't too bad at all average price for an item was $79 compared to other pregnancy stores at an average of $150. They have really noce stuff that are also stylish.\n\nBoth the owner and the lady that was helping whos name i forgot were very sweet and help u out without pressuring you to buy everything.","useful":0,"funny":0,"cool":0},
{"review_id":"HQyM2yH1H3969yKNYGS7zA","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"-mUXTkHOxfLxFDnaMcvqAA","stars":5,"date":"2013-09-27","text":"Really good service, my new go to favorite Korean food in montreal, I'll be coming back here next time I'm in town","useful":3,"funny":0,"cool":0},
{"review_id":"wzgScU9hm--MuBBB7VgnsQ","user_id":"SR6ByB6X6tAITF4HG79_SA","business_id":"I3LJiXJTvTEnI61O-gr2KA","stars":3,"date":"2014-08-29","text":"The only reason theyre getting a 3 star is because the food was good, however the service is unprofessional and they take a VERY long time for everything else.","useful":1,"funny":0,"cool":0},
{"review_id":"-6Zp7r2S_SiNCFg5PePH7w","user_id":"WKJ400D328p1lTx7JsWVtQ","business_id":"BZm3QkpLhO2TBNHKd0DbBQ","stars":4,"date":"2017-06-07","text":"Food is alright for a quick bite to eat. Drinks are ok, ceasers are pretty tasty.  I had the nicest waitress, she had an unusual name, but was very knowledgeable of the food\/drinks. Would go back again when in the city.","useful":0,"funny":0,"cool":0},
{"review_id":"96_op-RLKdQUBd9SuZxJ4w","user_id":"idUvIFRDMgMwsppJOSgenA","business_id":"mUVAMNN7BCQ9HGA9w_7C1g","stars":5,"date":"2015-04-20","text":"Amazing good food... I had the Ingos Burger Adam and Eve style(no bread or condiments) AMAZEBALLS!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"2S9Z-ogc1P_eLaxHr6v63w","user_id":"7o4auNykkJi_2DjnkXWluw","business_id":"8Yz1eFsaUy-ny3B6YZDOrg","stars":1,"date":"2015-09-02","text":"NOT the best experience.  Food was not bad and came out quick but felt very tooken advantage on their new steak and unlimited shrimp deal.  The server Mike F gave me options on everything else we ordered that had an option, down to the lemonade but when I told him and I pointed to the steak and shrimp unlimited deal, he did not ask did I want a filet or sirloin, which I guess the sirloin was the deal, which is what I wanted for $15.99 but he in fact took it upon himself to order me the filet and then bring a bill where it showed they were $28.99 a piece.  Bad thing is that even on this add online, it is very misleading and that is probably why their servers try to get over on their guests as well as the establishment.  Awful advertisement, use better ways to get people in the door and be direct on your promos. I wish I would have asked to speak to a manager but I was trying not to make a seen and in all I  was upset at the server and took it out off his tip.  He definitely should have opted me which steak, I work with servers that do this sort of thing, so I'm very aware. I'm in the industry and this should not have happened.","useful":0,"funny":0,"cool":0},
{"review_id":"X98qbLBKuV8CCMpUlYdlEQ","user_id":"7bXF1zCo6FERQpbHic0oOQ","business_id":"R-Me-p4Rbb0q-2pjSzyDbw","stars":4,"date":"2017-06-02","text":"Jim's was just what we were looking for on our way to the airport from a few days in Sedona and Scottsdale - quick, easy, very friendly.  Food was great diner food (coney island close to the spectacular ones in Detroit) - and our waiter was attentive without being around all the time.  Very pleasant experience!","useful":0,"funny":0,"cool":0},
{"review_id":"qtoEQEy5RBDYXayaXyBdcQ","user_id":"oYhhys5asp2mjSSV8AqeUA","business_id":"LR0qF0FEVsCOhYWUOiH26A","stars":1,"date":"2015-12-29","text":"Worst buffet ever\n$105 wasted\nAsian food : very few and bad\nMeats: pure fat and hard to chew\nSalads: regular -\nAvoid this place","useful":1,"funny":1,"cool":0},
{"review_id":"WeBuO8mou839PBH_KAu-zQ","user_id":"8J0OAx2W00SgbiDtttHNAA","business_id":"9xSwne4GjwZ6Hlzdx2Zszg","stars":4,"date":"2016-02-02","text":"If you can't find something to eat at this restaurant then you can't eat anywhere...\nMenu items can seem a tad pricey for what is offered, but the food has never disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"uueX0Eejl7Gatx4zOowwOg","user_id":"8J0OAx2W00SgbiDtttHNAA","business_id":"wzugmCevnXuCMCF4upAf0w","stars":4,"date":"2016-02-02","text":"Nifty little gem. Almost always a line out the door, but totally worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"XRrQlCVdUCemY7qvtqJWoQ","user_id":"8J0OAx2W00SgbiDtttHNAA","business_id":"DM0-HbO568_Ykzxwse6lwA","stars":5,"date":"2016-01-06","text":"I went there for dinner the other night, everyone in the restaurant was super friendly and the food was delicious. They have all sorts of menu items for sushi lovers and non sushi lovers alike.","useful":0,"funny":0,"cool":0},
{"review_id":"4qg8USzNDUSz03yGB9455w","user_id":"8J0OAx2W00SgbiDtttHNAA","business_id":"XL-yBb8JT-UMgw_xMdKk9w","stars":1,"date":"2016-01-07","text":"I have been to Rose Bowl numerous times over my life. It was fun when we had birthday parties there as children. The lanes, however, have become run down and seemingly haven't changed since I was a child. The menu items, such as French fries, show old photographs and do no represent the food you actually receive.\n\nOn a recent visit with friends we paid to have a lane for an hour. After 20 minutes our lane stopped working. After informing the staff it took 15 minutes for the lane to be operational. After a couple more minutes the lane was on the fritz again. We waited patiently for over ten minutes for the lane to function however to our dismay it malfunctioned again after our next shot. \n\nThere were no other lanes to switch us to and other lanes were experiencing similar issues. We asked if we could just get a refund for the time we had yet to use as we didn't want to wait around for the lane to get fixed just for it to stop working again. We were told that we could not get a refund and that it was a gamble we take that a lane will or will not work when we pay for an hour. \n\nDespite us having waited to for a functioning lane for over 30 minutes we were given only 5 extra minutes of time. We returned our shoes and left and have not been back since.","useful":1,"funny":1,"cool":0},
{"review_id":"cE8jMhjjoAUDVf9iSP1ZJA","user_id":"5NlPU-OYdmGJDUU6yp-9Ng","business_id":"QdvROupQvDDQIaHrTGNgKA","stars":4,"date":"2012-10-20","text":"Surprisingly authentic Sichuan cuisine in Phoenix. The staff were very friendly and accommodated our infant without any problem. The mapo doufu had great spice to it. The garlic eggplant (yuxiang qiezi) had excellent flavor and we also highly recommend the twice cooked pork (hui guo rou) and fried green beans (ganbian sijidou). The prices are certainly reasonable for the size and quality of the food. The open kitchen is also a nice touch as it gives kids something fun to stare at (flames shoot up from the dishes being cooked every few minutes). Admittedly, we only went because out POS airline put us up at the residence inn across the street after we missed a connecting flight, however, if we go back to Phoenix or if we lived in Phoenix, we'd definitely go to Szechwan Palace again.","useful":0,"funny":0,"cool":0},
{"review_id":"LHj9TzecSzb-H-xxXbRe5Q","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"kqM_bA4eEAnIMekmyWB5WA","stars":3,"date":"2016-01-28","text":"You have to LIKE this kind of Chinese food - shopping mall food court style - the price is right and it's not bad, not great.","useful":0,"funny":0,"cool":1},
{"review_id":"YnDgwG5q7RTJIRO6KvSA2g","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"3gdjVkNeUa9piW9H708Aig","stars":5,"date":"2016-01-29","text":"The best fish and chips in Toronto.  Nice service and the nice owner lady is always walking around.  My parents - in their 80s -  loves the place and food as does my 3 year old granddaughter.  Food is always consistent excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"QEQBv3wyAcFhvv-BSc-itQ","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"CY3N_T_35gqOXkwQbSeSTA","stars":2,"date":"2016-01-28","text":"I knew the original owner as \"A-Fau sook\" (Uncle Fau) when I was a toddler in the late 50s and early 60s.  Friend of my grandfathers.  The original place was located a few feet west of the southwest corner of Dundas and Chestnut on the south side.  The building is long gone.  Nice man, he used to pinch my cheeks and give me a free soy chicken wing.  Hong Fatt relocated here in the early 80s.  He and his wife and son all worked here and he managed to acquire a Mercedes Benz.\n\nThe couple that run the place now:  The old lady really resents having to work here.  No hello or thanks.   The man is nice enough.  Be aware that unsold BBQ meats are refridgerated overnight and sold again the next day.  I've had two occasions when the meat had the beginnings of rancidness. When it's fresh, boy it's terrific.   I go about once a month for crispy skin pork.","useful":0,"funny":0,"cool":0},
{"review_id":"M94p9gtqRNcw2bfx9Wv-Fg","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"SxjNgkzAlUG-wt2rSbc2HQ","stars":1,"date":"2015-11-27","text":"Rude, silent sullen wait staff.  No hellos, eye contact, thank yous or goodbyes.  I've been there a few times over the last couple years.  Good food of the old \"Chinese Canadian style\".  Good prices and portions. The day staff, a couple of middle aged ladies aren't much better than the all male late night staff.  I won't be returning.  And for this I tipped properly.","useful":0,"funny":0,"cool":0},
{"review_id":"fbgSeELuiVKsW32mjJHvZg","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"0ORDYMDX027EhfsoFOkNcQ","stars":4,"date":"2016-01-28","text":"Fish and chips here are the best.  As good and look the same as Yorke Fish and Chips on Laird Drive.  If you want to dine in you have to go in the middle of the afternoon.  There are only 3 tables.  If you make the mistake of going at 6:30pm and think you can dine in like I did, another problem pops up.  The owner, a very nice man, prioritizes the orders that have been phoned in.  He actually gets panic stricken about it.  He will let you sit there until it gets quiet.  I waited 45 minutes for my one order.  No problem, I'm retired and the food is really good.  During the summer time you can get a takeout and eat in the park just to the east.","useful":0,"funny":0,"cool":0},
{"review_id":"aX7gac5EccO6I-arRsJJ5Q","user_id":"SctG_IJWW-lAxL0csBKijw","business_id":"WbQOuI7mVST8XrJotWq9fA","stars":1,"date":"2016-01-28","text":"New owners here as many have already mentioned.  This place was one of two restaurants that opened here on Spadina in the mid 70s.  At that time, Chinatown was on Dundas congregated around Elizabeth.  I went often back in the day.  I returned a few times over the last 3 years.  I won't be going again after I finish this review.\n\nThe cooked food - the quality is VERY uneven.  \n\nThe BBQ food - the stuff hanging in the front windows - BEWARE - if it didn't sell today, it'll be hanging back up there tomorrow.  I'm surprised no one has died from this yet.  They are not the only ones that do this.  New Hong Fatt also does it.  Other BBQ restaurants such as Kings Noodles and House of Gourmet do not.\n\nThe unventilated basement bathroom has headroom of about 5 feet.\n\nThe place is dirtier than any place I've seen and that includes the worst sidewalk eateries in Kowloon.","useful":1,"funny":0,"cool":0},
{"review_id":"ksG9dY0demKAQS3h9Cxfcg","user_id":"IfUmyvo_RHKqXd-TqfKAvQ","business_id":"mgkzOlvtT_PUHIt1ftjcPQ","stars":1,"date":"2017-03-11","text":"The food here reminds me of the book Fairenhieght 911. The food is hot hot and greasy and leaves coat of grease in your mouth. And the place smells of being burnt. I can only say been their once and that was enough.","useful":0,"funny":1,"cool":0},
{"review_id":"NgAmyW9a9XplDmk6J8mYrg","user_id":"tIrtGL1Uf-vV4Rs1vHWsAw","business_id":"kwnwIBpzsSzAX3UxGHLjAQ","stars":1,"date":"2011-11-16","text":"Terrible! 6 laser bikini sessions, tons of wasted time and $150 later, got 0 results! Also, charged 14% tip @ first appointment?! Makes me not want to buy living social deals anymore, cause like the saying goes ... I have started laser again somewhere else and they were very shocked that no hair was gone after 6 sessions! I am very saddened by this experience and kind of feel like I was robbed. I suggest you try somewhere else if you want any results.","useful":0,"funny":0,"cool":0},
{"review_id":"QiJZ-DRCDytrbXSAHHqgAw","user_id":"nb2PrdR6VsIURylyGDOv6g","business_id":"WBar3m0wIREUcZFy-RPS3Q","stars":5,"date":"2014-09-05","text":"Love Allyson!! My hair cut is stylish, sleek, and exactly what we talked about. Thank you!","useful":0,"funny":0,"cool":1},
{"review_id":"8x0XzQlT2lo8jOFwdMvWOg","user_id":"nb2PrdR6VsIURylyGDOv6g","business_id":"vNNblU2mVeyp4UvgGwHxcg","stars":5,"date":"2014-07-03","text":"We absolutely love Grand Slam Grooming in Bridgeville, PA. After having terrible experiences with other groomers (they came home with cuts on their bodies) our Westies are cut like Westies! Deanne is kind, professional, and reasonably priced.","useful":0,"funny":0,"cool":0},
{"review_id":"EvO8b-4C9d9g_ERZooLdjg","user_id":"dPvIq4_-KmrxTqKxFWi_vg","business_id":"DLJCwHGtbAV31UQ1lnIjlw","stars":3,"date":"2012-10-23","text":"went for wifes birthday, food was slow and over cooked, waitter was more interested in talking to friends than wait on us , they had 3 tables all night, no management or they dont care. very over priced for medium quality get a chef who knows how to make pasta not mush......very disappointed","useful":0,"funny":0,"cool":0},
{"review_id":"xG3qA0G9kPyQJNoXg6H6DQ","user_id":"dPvIq4_-KmrxTqKxFWi_vg","business_id":"UcgCSTCtPv1GeW5bKsEdag","stars":1,"date":"2012-10-02","text":"over priced poor service employees more interested in tv than customers, ordered medium got past well done, bun  seemed flat or old, youve got to be kidding ...if this best or one of best close  not many customers gives me idea they have problems....way overrated","useful":1,"funny":0,"cool":0},
{"review_id":"aK2epGKOwyKmXs2N1IT31A","user_id":"dPvIq4_-KmrxTqKxFWi_vg","business_id":"qAz6G72Xnrgxnep6mKUnWg","stars":1,"date":"2012-10-16","text":"this place deserves minus stars, burger is awful place is filth went twice horrible is kind , contacted corporate they do not give a damn....this franchise should fail","useful":0,"funny":0,"cool":0},
{"review_id":"NkDOM9QWvyS5JdqolwBFiQ","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"_QvGAqMmrUIlxpby2Ul5Dg","stars":3,"date":"2014-11-22","text":"Nice food. Terrific murals. It's worth coming here justice to see the paintings. Service was extremely slow. Get the the tamales to go.","useful":0,"funny":0,"cool":0},
{"review_id":"b4Dk8aD2FDbWrH1GL8YqGA","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"OyJDaAAMr220qkZsovCARQ","stars":4,"date":"2014-08-28","text":"My favorite Starbucks. Extremely friendly staff and service. I love service with a smile and positive attitudes. As much as I go here, I'm amazed at how everyone is always so welcoming and courteous.  They would earn 5 stars if they weren't so incredibly slow with drive thru. I've spent over  20 minutes on several occasions! Of course I keep coming back,  I just prepare for a slow slog. Oh, they also are the few starbucks that get the Fizzio ales consistently correct. Proper fizz and flavor!","useful":0,"funny":0,"cool":0},
{"review_id":"VwGcBsZPY6bcps2k52UVsA","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":4,"date":"2014-01-18","text":"Had a fun time at Peppermill. Servers were friendly,  decor was wonderfully cheesy,  the food was as better than expected. Well, dinner was better than expected. Dessert was disappointing. We shared a strawberry shortcake and it was underwhelming. They used  strawberry syrup like from McDonald's and a flavor less cake. I think it's because there are do many great places to get dessert in this town,  I'm surprised when something on the Strip disappoints. I would go back, the lounge and entrées are throwback classics. And we really enjoyed the server.  Just know there are better sweets all over this town.","useful":1,"funny":1,"cool":2},
{"review_id":"IJTlxepOzSALEvctfM4eow","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"jGajKCm6-urgLQeNyeL-FA","stars":5,"date":"2016-06-20","text":"Great service. My wife and I got a dining table and chairs. The lady who helped us was extremely patient and helpful. This place is in the middle of a bunch of other store, but is worth a visit. We are definitely coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"sI0Yxr-BTuRdVXSvmriQkQ","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"kYvZZ_aKaKLQKeyms74T2Q","stars":5,"date":"2014-07-19","text":"Our favorite Mexican restaurant,  by far. We've been coming here for years.  Always fresh food and terrific service. Well,  unless you get the one \"grumpy\" waitress. We usually see her in during breakfast. Never smiles and seems to be upset she has to help us. This is not a one time \"Maybe she was having a bad day\" thing. She's always grumpy to us. This should not stop anyone from going here. Every other employee here is super nice and friendly. That's the only reason Grumpy is so noticeable. Who knows?  Maybe she just doesn't like the look of my face! Plus, you have to try the food here. The soups are amazing. Not just the small cup of fideo soup they bring before the entrée,  the dinner soups are the best. In fact, our family has never had a bad meal. Every time we go,  whatever we order is fantastic. The dining area and Restrooms are always clean. They even have live music. For an even better experience, try the table side guacamole or the flaming ice cream dessert. That's right, \"flaming!\"  To sum up: One grumpy apple does not spoil the bunch. This outstanding restaurant gets Five well deserved stars!","useful":0,"funny":0,"cool":0},
{"review_id":"u8rEqUDAsIoS8AjBOxxlYg","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"1jpYP-JNOEYCMIzP4OlGuQ","stars":4,"date":"2014-01-19","text":"The pork they use is fantastic. Tastes just like when I was in Hawaii.  Really enjoyed the burrito. I've only had one bad experience here. Went late at night,  the rice was old and hard and the guacamole was completely brown,  like it had been out for awhile.  Good greasy food otherwise. I definitely recommend this place.  Be sure to try the coconut bark. I'm hooked. The service is always friendly and appreciative of the patronage. Tacos had a lot of grease, but flavor was perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"v6N8colWbUWP48mOa6DYxA","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"iAuOpYDfOTuzQ6OPpEiGwA","stars":2,"date":"2014-01-26","text":"You know it's bad we when the food gives you a headache. We used to go to this restaurant all the time. Something has changed. The food, whatever wasn't fat, all tasted old. Even the normally reliable warm buns had hard corners. The only redeeming quality remains the Apple Blossom iced tea. Service was fine, it's just the quality of food has gone down. And oh my god the bathrooms were disgusting! There were no towels to dry your hands and the  floor and stalls look like they hadn't been cleaned in quite some time. While it's possible this was a unique occurrence, we've never experienced anything from them like this before.","useful":0,"funny":0,"cool":0},
{"review_id":"BKLvJ7MiJtzBO7EZy8czlA","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"oEkOj9NXJFrjFn3NBB_jpA","stars":2,"date":"2014-05-09","text":"Disappointing overall. Especially for the prices. We went for dinner and ordered a pre fix special. I asked for a minor change,  and even offered to pay for it, and was told no. I don't remember if it was a request to switch dessert or change a side to veggies,  but I was surprised by the response.  The place looks nice. Decent food, nothing memorable.  The worst part was the iced tea. It was watered down with little fresh tea flavor.  We've only been the one time so maybe this was an anomaly.  For these prices,  though it's going to be difficult to try again.","useful":0,"funny":0,"cool":0},
{"review_id":"M6MqSSBbizEfvgqbMbm3Ow","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":2,"date":"2014-07-31","text":"This review is mostly for the poor customer service at this location. The front of the house almost seems proud that they don't give a crap. While we've gone here before and experienced broken drink glasses and extremely slow responses, tonight was the last straw. The hostess greeted us and we requested a booth. The restaurant was maybe 30% full, plenty of open booths, but she did not offer to seat us there. I assumed they didn't want to use certain sections. Keep in mind, the place was 70% empty. She didn't offer a drink of water or to look at a menu while we waited. No one working there did.  Other employees, another server and a bartender,  walked by where we were waiting. They actually seemed annoyed by our request.  It just seems like with all the competition for restaurants in Vegas,  somebody there would want to take our money. Or at least be happy someone walked in on a slow midweek evening.  \n\nThis was the last thing we needed after the broken glass incident. We thought \"Let's give them one more chance. \" So while tonight wasn't the worst ever,  it pissed us off more because the attitudes were so bad.","useful":0,"funny":0,"cool":0},
{"review_id":"YdtxWPO0M6Th2U8jowHn4w","user_id":"SmuqmcoBmy2sYJmQF5yCZw","business_id":"8olG8J91NG_QU92WHG5QfA","stars":5,"date":"2014-08-25","text":"This is a take out for Chicago style pizza. This is as close to neighborhood Chicago pizza I've found in Vegas. Service is friendly and consistently reminds me of Chitown. As proud pizza snob, I highly recommend Amore!","useful":0,"funny":0,"cool":0},
{"review_id":"WVsxs8X-2p8p8L9to15mNA","user_id":"5Rw3pJU55LObQS2pu6kp7A","business_id":"cYwJA2A6I12KNkm2rtXd5g","stars":4,"date":"2014-02-15","text":"This place is located conveniently in Planet Hollywood.  Everytime I attempted to go there was a line out the door.  Finally decided to bite the bullet and wait in line.  The wait was not as long as anticipated and once seated the restaurants design is awesome and entertaining.  \n\nI had the earth burger and my bf had the farm burger.  Both were very good.  The menu is pretty small.  I was looking forward to maybe a fish burger but there was nothing to be found.  In any case the food was fantastic and I will be back.","useful":1,"funny":0,"cool":0},
{"review_id":"129ipk0llpYQ0ir1xwvvEQ","user_id":"S8BGU1OMuf3ZRSD-8qneDg","business_id":"35mJm3bifyrZkZX0_rMa5A","stars":4,"date":"2012-06-15","text":"I purchased a groupon and came to The International Skin Care Institute for the first time for a microdermabrasion. My esthetician was Annette and she was wonderful, explained the process, and educated me on my skin. I enjoyed the treatment and purchased the VIP package which is a worthwhile deal if you get facials regularly. I have since tried their LED skin rejuvenation. Everyone has been very friendly, I've been pleased with the services, and will be coming back for further treatments to finally give my skin the TLC it deserves. Though I have had some trouble getting in touch with ISCI by phone, don't let it deter you...I recommend their skin treatments and being able to book appointments online is very convenient!","useful":20,"funny":0,"cool":20},
{"review_id":"8yATqkMhsNjSDjAP5i1lUQ","user_id":"S8BGU1OMuf3ZRSD-8qneDg","business_id":"bI9_dtXS9qN0Gmi7YbRm5g","stars":5,"date":"2016-05-25","text":"Incredibly fresh Mediterranean eats - delicious too! We got the meat sampler with extra sides and nothing disappointed. Including the baklava. \n\nGreat setting....awesome staff! Michelle took our order, was super helpful and informative and made my sister feel comfortable ordering from the menu for the first time.\n\nI wish I lived closer... I'd be here every week!","useful":0,"funny":0,"cool":0},
{"review_id":"T19cy62F54ioEimE40Jwuw","user_id":"JxVrPORqIXm-LmS1l935Jg","business_id":"ZqiiLwzPLXSbZJDXFQEceQ","stars":5,"date":"2017-04-13","text":"After searching high and low for a good nail salon, I think I found the spot. Made an appointment for 1pm to see Emily, and was taken care of immediately. I got bio gel manicure (the gel builder & colour), and only paid $35. The price is so reasonable compared to the nail salon I used to go to and other salons. My overall experience was lovely and I'm so happy with my nails, all thanks to Emily. This is my new spot. My mom and sisters will be coming with me next time. :)","useful":0,"funny":0,"cool":0},
{"review_id":"6KCrfixsOixTTXbHmbTXFw","user_id":"T7gYY8I8AUOnOv1M0dvCnQ","business_id":"utIA0LyQmwP-9DRyxUe6qQ","stars":2,"date":"2015-07-30","text":"This place came highly recommended, so i was excited to try it. There was a slight wait, but nothing too long. Once seated our waiter took our order and then disappeared. It took forever to get our food. It turns out the waiter forgot to turn in our order! Ugh! When the food arrived, it was merely marginal, and certainly not worth the wait!","useful":0,"funny":0,"cool":0},
{"review_id":"yWsuEuLjpToQh6rwEPt1dA","user_id":"pC6wiztODgwwuG0ANNnJpQ","business_id":"Yd-vN5xkvG0q17rahE-YzQ","stars":5,"date":"2016-06-22","text":"Warm, professionals working at Whole Life Dentistry! Always excited to go back!!\n\nAlways getting a warm welcome. Dr Loud explains every procedure, she has a soft touch to heal and make my teeth beautiful! Ann makes sure I understand everything on my bill, love to go back and be welcome by such wonderful ppl.","useful":0,"funny":0,"cool":0},
{"review_id":"BQSOA9lgCHm2VDsodMT-BQ","user_id":"eLUMRitI0I6OEmEDSLF1kw","business_id":"GZONBn0K1yp2aaD-l8debQ","stars":2,"date":"2017-01-16","text":"Food is mediocre, nothing special. Service is pretty bad, just don't seem to care. Over $30 for a burger and beer, In and Out would be a better choice. 8 guys on expense accounts and they would only split the check between 2 of us.","useful":0,"funny":0,"cool":0},
{"review_id":"JtyfNN9caCRgm31eCNrvyA","user_id":"l5JRArczJkE85rfbt79sdw","business_id":"NbbO83a69vdXpACNw3jKCA","stars":2,"date":"2012-01-27","text":"......... Alright. First off, this walmart can be really covenient and all, I'm not going to lie\n\nBUT they never have anything stocked, which can also be very inconvenient. There were so many things missing from the shelves today that I needed to get. Walmart has fantastic cheap prices, but if something isnt there how am i going to get the good deal? Lame.","useful":4,"funny":3,"cool":3},
{"review_id":"g4dBUB06pLNJPeUot3HeNw","user_id":"5FfK51ojFGLPhNFmIyR3-A","business_id":"sWnRM4Jep7x2el04geitOg","stars":5,"date":"2016-06-15","text":"I can't even put into words for a Yelp review how obsessed with this salon I am. I went it to get my hair done by Ashton and initially had a few pictures in mind of what I wanted. I was going for a balayage look, and wanting to turn my super blonde hair into more of a darker look. I didn't even need to show her the pictures I liked for her to make my hair look even BETTER than the ones I found online. Yes - the outcome had way exceeded any expectation I may have had, but the experience was amazing as well. The salon is gorgeous, all the girls are very friendly and I felt totally pampered the whole time. \n\nAnyone looking for a good hair makeover or even just a great day spoiling yourself, Rolf's is your place and Ashton is your girl!","useful":0,"funny":0,"cool":0},
{"review_id":"weQW4T8dNMDQUYFupmEntg","user_id":"5FfK51ojFGLPhNFmIyR3-A","business_id":"IsoLzudHC50oJLiEWpwV-w","stars":1,"date":"2017-10-20","text":"Don't have a bar pickup section outside if your 3 bartenders can't handle over 10 guests total. Had to ask for a share plate for our SHARE starter, had to ask for silverware and napkins. \nWe were told we were done a favor for making the sandwich we ordered because it wasn't \"on the dinner menu\" .... okay then don't hand out lunch menus at 8:30 pm. Regardless it came out cold and gross anyway. \n\nTo finish you'd think out of the 3 bartenders you have at least one of them would be able to make an old fashioned properly. \n\nBetter luck next time... actually not a next time.","useful":0,"funny":0,"cool":0},
{"review_id":"zxVkus4QwTq5KcgFbaaYfw","user_id":"NeGgvJr1l4-xMg486GLw8g","business_id":"RqG0p8kCZFZp2v8AgKRZug","stars":5,"date":"2015-03-05","text":"Very good garage. I had problem with exhaust on my Subaru. Dealer estimation was 900$. They fixed for me for 200$. Very fast,no appointment needed and one year waranty. Very satisfied.","useful":0,"funny":1,"cool":0},
{"review_id":"kICOGz5Nx_Kq_7by_ftMVQ","user_id":"CgtVlevIEgY38aQ4tIwqtQ","business_id":"tIiiq23utFKTs1At2bVD6w","stars":5,"date":"2015-07-27","text":"Delicious. Family and I had Calamari, the soup, lasagna, chicken parm and clam linguine... \n\nAll was awesome, best italian in charlotte","useful":0,"funny":0,"cool":0},
{"review_id":"7P0ggBT4n9h0DQ93RYaOFQ","user_id":"HD2FUPkPVoe6-3RYx12ejw","business_id":"anzCdD5eIEHwydTpXhLlUA","stars":4,"date":"2013-03-26","text":"If you like hot dogs you MUST go to Happy Dog.  I suggest you go hungry. The dogs are the best and the toppings are over the top (pun intended).  Seriously, you must try it.  They only do hot dogs and they do them extremely well.  Great service, yummy food, casual atmosphere and later in the evening all types of live music.  This is a go to spot for me, once you try it, it will be for you too.","useful":0,"funny":0,"cool":0},
{"review_id":"VHtB7C-9XY9BlcyhL5H_9A","user_id":"HD2FUPkPVoe6-3RYx12ejw","business_id":"F0PPK3ULohLWMUnrs_WWhA","stars":1,"date":"2013-08-28","text":"I experienced this restaurant as a miss.  The best thing I had, and it was VERY good, was the made to order at your table guacamole, fresh and tasty.  Sadly that was the only thing that I thought was tasty.  The margarita special tasted like the powdered mix and not much else.  The enchiladas I had also had awful powdered tastes like everything was from a package.  I won't be going back there, too many other better Mexican restaurants around.","useful":0,"funny":0,"cool":0},
{"review_id":"-neXofSQz77O4HdbNALxPQ","user_id":"HD2FUPkPVoe6-3RYx12ejw","business_id":"rkzU4UiTTXF54-FOELy9eA","stars":5,"date":"2013-08-28","text":"This is solid Texmex food, I've been there many times and have never been disappointed.  I totally recommend this restaurant, glad it's close to my home!","useful":0,"funny":0,"cool":0},
{"review_id":"zXIlI2ihV4cYXj7SZGskIg","user_id":"uXDVSxH6SWKWHC0layJwCg","business_id":"aAYl1-tsvP9Kzs7YESi8Rg","stars":1,"date":"2017-08-08","text":"Pretty disappointed in quality of the food and the portion size for the price. Ordered the rib ends and brisket plate for delivery using Uber Eats. Order took one hour 20 min to arrive. \n\nRib ends were essentially bone and fat deep fried in batter. The brisket plate included two small, fatty slices of meat  (I guess this is meant to be a half pound) for $18. Order came to $43 with all the charges. Totally not worth it. \n\nCalled the restaurant but they largely unhelpful, suggesting I contact Uber eats. Doesn't make sense really as the problem is the food rather than the delivery.","useful":0,"funny":0,"cool":0},
{"review_id":"l-6ouHb66F-t0-x6BvAzug","user_id":"cOrd6Po9C7HLxXfb9Rxm1Q","business_id":"ZjSzUWHtnpCfjsa7CksSOg","stars":5,"date":"2011-10-31","text":"Amazing value!! The Standard is a hidden oasis right next to all the wild fun of the strip, but it's removed enough that you can escape and recharge. PERFECT. Bonus - great staff and wonderful hospitality. Manager Levi is the best!! Thank you for a wonderful vacation.","useful":0,"funny":0,"cool":0},
{"review_id":"Gh3rIM28KY3bO3WiVCY7TA","user_id":"8gva-kVjetwrxs8zTzSmMQ","business_id":"etid3CozFvEOFcvDwHXsDw","stars":4,"date":"2017-05-01","text":"Great cocktails!  I had the Alaskan Halibut which was excellent.  Portions are perfect size, filling but not overdone.  Went with a large group and had a great time.  Cool atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"R_qtIiKpuYkAgwfZfdmBlA","user_id":"8gva-kVjetwrxs8zTzSmMQ","business_id":"0XoTT540HMB_5q4Exj8yGA","stars":4,"date":"2017-05-01","text":"Excellent experience.  Stayed here for four nights.  Rooms are very clean with everything you need.  The staff here is above average, friendly and helpful.  Front desk staff are great - you definitely get service with a smile here.  Pool is great,  relaxing and comfy lounge chairs.  If you want a more lively scene just hop over to the Mandalay Bay pool.  This is a great option for anyone who wants to balance the  typical Vegas experience with some R&R.  The spa was also excellent.  Had a massage   with Katrina who is top notch.","useful":0,"funny":0,"cool":0},
{"review_id":"y7SuORRjWLII1qpNk7XVew","user_id":"S0_7UeL9QjZ3h4wm6mFMeQ","business_id":"MMTt7Y7NxWN6FHugITLBZA","stars":5,"date":"2017-12-08","text":"best dealing school in vegas. dont look elsewhere. ive been in the  business 20 years and it doesnt get better. trainers are very professional and the owner alex kim places graduates and sincerely cares about his students.  my sister is a student and is ready to start work.  thanks ceg","useful":0,"funny":0,"cool":0},
{"review_id":"XHuFItwZRXvIDQVsvQJLMQ","user_id":"S0_7UeL9QjZ3h4wm6mFMeQ","business_id":"JKptMZ4XO-MVoQ0FaDxHNA","stars":5,"date":"2017-12-19","text":"5 stars all the way. \nyou call make an appointment \nyou show up\nbill cuts your hair \nyou pay. you leave. \nno waiting no bs.","useful":0,"funny":0,"cool":0},
{"review_id":"kOoHf3A75jhOjW-yxZhPxg","user_id":"S0_7UeL9QjZ3h4wm6mFMeQ","business_id":"-AxKgZHxyV-oBBHNyOESAg","stars":5,"date":"2017-12-19","text":"best auto shop in vegas \nbest work. best price \nquick service.  \nwent in on a monday with no notice\npicked up car on wednesday \nwhoa","useful":1,"funny":0,"cool":0},
{"review_id":"iolaMNfFPH_nnT8Wy4a38Q","user_id":"S0_7UeL9QjZ3h4wm6mFMeQ","business_id":"HnlnxofCExcZyPvubu0-vQ","stars":5,"date":"2017-07-26","text":"Had my carpets done today. Was on budget but they worked with me.  Tech was on time and very \nCourteous. Total professional job. Thanks CHRIS\nI will use this company again in future. \nThey deserve 5 STARS","useful":1,"funny":0,"cool":0},
{"review_id":"Mmp2udbQ13NmZOtZHuWjeQ","user_id":"S0_7UeL9QjZ3h4wm6mFMeQ","business_id":"ZA-j7r_BHY1XTavufpchXQ","stars":1,"date":"2017-12-19","text":"After setting up my account awhile back I encountered some problems with billing and my contract. I went in on 3 separate occasions and was lied to 3 different times by 3 different people INCLUDING the manager Margie Jimenez !!Total lack of professionalism and horrible management with no leadership whatsoever. Nobody ever called my back and nothing was ever done. Still being billed erroneously by Sprint. I'd give them 0 stars if I could. This company just wants to sell phones and contracts.  Once they do that you are own your own\nSTAY AWAY.  I'll be going back to VERIZON.","useful":0,"funny":0,"cool":0},
{"review_id":"Vq9uqmNq2eJyqQV9SWMfiQ","user_id":"VuRAJtEn4BgGppq_pYDNxg","business_id":"OwOMoh48nxjIgPkGU9RxGQ","stars":2,"date":"2013-11-10","text":"A great menu that isn't the standard cookie-cutter fajitas and burritos mexican menu.  A lot of very good choices.  The staff has the feel of a family run business with everyone very friendly.\n\nWe went to the North Scottsdale location and we must have caught them on an off night however.  The kitchen was backed up even though the restaurant was less than half full and it took 45minutes to get tacos and pollo con espinacas although people seated after us were getting their meals quickly.  When it came, the vegetables in the espinacas were still icy although the chicken was warm so i'm not sure the order everything was put together.  My water glass was cracked and even though I pointed it out early, it wasn't replaced.  \n\nOur waitress was very apologetic for the delay and the cracked glass, but no consideration was made on the bill and for a restaurant charging a premium, I expected more.  We probably won't go back.","useful":5,"funny":1,"cool":1},
{"review_id":"HY3iW_vDQBtr_xe2FKkzOw","user_id":"UYti_mT78p6co0U1Futyjg","business_id":"bujMV3UPks8INgBnjV9gcw","stars":1,"date":"2015-12-06","text":"God awful service and quality of work. They fact that Home Depot refers then is a shame on Home Depot.  They don't keep appointments our communicate. Congrats Home Depot on finding the absolute cheapest, careless, company to make your customers angry and dtive then straight to Lowes for their future home improvement needs.","useful":6,"funny":1,"cool":0},
{"review_id":"-cCxI4cyJaiyyiunmK50ag","user_id":"H58lO82eil3ICcYOmUvDzA","business_id":"QJatAcxYgK1Zp9BRZMAx7g","stars":4,"date":"2016-01-23","text":"Everyone loves to compare it to In-N-Out because of it's freshness and simplicity, but it tastes nothing like an In-N-Out burger!\nIt has a delicious sauce on it, the meat is seasoned differently...\nIt's less comfort food and more delicious. \n\nGreat if you're looking for a quick bite. About a 10 minute wait around noon. Quality Food. Nice Employees. Chill interior.\n\nI would come back every-time I visit Las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"3RhI0oBjBpEF_eD67rWeJA","user_id":"b7Pk4rSgnjv_4BKbTLBPOQ","business_id":"YWm5z2mu-C-pUuL86fcFxQ","stars":5,"date":"2017-11-07","text":"LOVE this place!! The beef and veggies is amazing and so is their lo mein! Very clean, and the service is fast!","useful":1,"funny":0,"cool":0},
{"review_id":"pnXwTl6_tr3Li5-8BDZQvw","user_id":"bsv2CJx74UuEfc1FDW21Rg","business_id":"aNickGLG7x7AR8EwiUXVtw","stars":1,"date":"2015-04-15","text":"I have never in my life left the doctors office crying until I entered legacy urgent care. I went there for severe back pain. My first visit I was given medication, X-ray was done and had to get a MRI done. Three days after my first visit I went back in because the medication wasn't working.. When I was asked what was wrong I would begin to explain and would be interrupted every time. I was not given the chance to finish. The doctor gave me stronger meds and sent me on my way. After I went for my MRI I went back into get my results. The doctor explained to me that in the MRI there was nothing really serious and that I should be alright. When I was asked if I was ready to go back to work I informed the doctor that I was still feeling pain. This is when I felt the Jekyll and Hyde situation happened. He went from happy to pissed and 1.5 seconds. He began to yell at me telling me I didn't want to go back to work and he refused to fill out any FMLA papers that I needed to hand into work. He filled out a form for me to get blood work done and told me that my job was in jeopardy and walked out of the room. Oh I should add he also got in my face while talking with a loud voice. I really didn't want to go back there but I was unsure if another doctor would release me for work if they didn't treat me. I went back to get my blood results and to see if he was willing to release me for work. My blood work came back and it showed that I had inflammation I don't know about you but I pretty much think that indicates I'm in pain. The doctor did a 360 and was once again kind. This time he did fill out my FMLA papers and I left there with the intentions of never going back. I did end up going to another doctor that a friend had recommended and brought my MRI results with me. The new doctor also did x-rays and discovered there was a problem. I am now on my way to getting therapy and proper medication. I rarely write reviews good or bad however this time I felt the need to inform anyone who has intentions on going to this location. I know the others have really good reviews and I'm sure their encounter with the doctor went well. Mine did in the beginning too. If you want to go to a doctor who never gives you A chance to explain what is going on with you then by all means this is a doctor for you I wish you luck.","useful":3,"funny":1,"cool":1},
{"review_id":"MIxut9ZLPoTe1_VAqjYJ-w","user_id":"bsv2CJx74UuEfc1FDW21Rg","business_id":"7Zg7fmBxSkwwSP9kekGVmw","stars":1,"date":"2016-07-15","text":"Brought my mother into the ER and was highly unsatisfied. They gave her a dirty sheet. When I asked The nurse for another one she was rude about it. When the nurse  came in to get my mother antibiotics she start off the conversation by saying penicillin which I might add my mother's allergic to. I mentioned to her that my mother can't have that. She then proceeded to tell me that's why I said she's allergic to penicillin. My aunt and I both did not hear her say it. Not sure if I am making much sense when writing this review because I am angry at the moment. My point is not only was I disgusted by the dirty sheet but also by the nasty attitude of the nurse who had a mean look on her face the whole time. Oh and on a side note they can never find the remotes to the TV it's a real not a big deal but if you're gonna spend hours in the hospital it would be nice to be able to have option to watch it I assume that's what it's there for.","useful":2,"funny":1,"cool":0},
{"review_id":"AupE7c02vgYGG82-5qvFsg","user_id":"YfNhbU-X7zgt3fXNM4N4mQ","business_id":"0awPLJOjscpgf0HJxbYOLg","stars":5,"date":"2015-07-14","text":"I had a wonderful experience yesterday for my first experience at the Aliante location. Dr. Pressley and her staff that helped me (Paige and Kimber) are professional, courteous, and helpful. I was very happy with my purchase and can't wait for my new glasses to come in.","useful":0,"funny":0,"cool":0},
{"review_id":"pyKVdUv9w6tzsN5lig6C0A","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"s0YfHJ9gEuDgbSKcL97aGg","stars":1,"date":"2014-03-28","text":"Where to start. So basically and old old friend went here for a late night Stampede dinner. So we walked in and the waitress was really rude and slammed the plates down like she didn't give a hoot. Then I was like whoa and I had the porgies witch where dried and had a sliver of hair on it so I said nicely please take this back and have some one look at the hair so the waitress was like do I look like a bar or a fancy restaurant waitress and I was like ok whoa so We got our bills and I gave no tip. My old friend did she had an ok experience but thats just that! I wont be coming back here again. again mixed reviews on other peoples parts thats fair. The interior was dirty looking and old looking ew. The outside of the building looks tired and has had its days!! Thats all","useful":0,"funny":2,"cool":0},
{"review_id":"l2Ns2ZBJewdu7kjjnVzLyA","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"t6d7VwDlBh6q8a9Fhad2tQ","stars":5,"date":"2014-04-03","text":"Great Market the food is delicious and its very clean inside and out The staff are very Friendly I must say!! Although it is a little bit pricey!! But hey its a upscale market.","useful":0,"funny":0,"cool":0},
{"review_id":"OGO6h18OIb9n9oZg3vlK9Q","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"xAO1MUoly2QakIas07KK8w","stars":4,"date":"2014-03-27","text":"Great movie theater. Great staff and a happening environment! nothing bad I can say about this!!","useful":0,"funny":3,"cool":0},
{"review_id":"iKWD5TDjMNr6CEdos7x2hw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"LKzDrKa0FRrRATi1gqPEiw","stars":5,"date":"2014-03-28","text":"Superb staff and great dining experience. Super clean to and accurate when you take Reservations!!   Saturday nights awesome bands come play that are classy but get up and groove!!! come on down on a weekend!!!!!!!!!!!!  I'm defiantly taking my special BF to this in may!! for a nice romantic dinner!! yummy","useful":1,"funny":0,"cool":0},
{"review_id":"sWyxL5a8SgkxpUYUKLsCFQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"KMnFlu3SifyKWKVeMX1UFg","stars":5,"date":"2014-03-28","text":"Very good the food amazing facility very clean!! Serves awesome! Id come back again!!\nJust wish there was one in the downtown I think it would do very well!!","useful":0,"funny":0,"cool":1},
{"review_id":"l3vkDD98QgEyButsIQsRiQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"gvx8rtsk9VMjCv8sTCm04A","stars":3,"date":"2014-03-28","text":"Dodgy at night especially for us woman. A great station but needs more security personals around.","useful":0,"funny":0,"cool":0},
{"review_id":"GCgPwswBetekjs4b8lbkhA","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"6bT-K1xSfsSjzxIhA4PnAQ","stars":5,"date":"2014-03-28","text":"Cool little shops great little market and have had some amazing memories!! clean but tired looking cant wait for the cool new design and how it will come to life!! the people are super friendly!! I will be coming back here again at some point!!!! Just wish the Imax was still there aww miss it!! lots of good old field trips back in my School days!!","useful":0,"funny":0,"cool":1},
{"review_id":"NfS-u46vxQOwZ1cn4WOT2w","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"js-UeVMXqnNYEY3ZTydfng","stars":5,"date":"2014-03-27","text":"Super fun to go with Friends Great attitude with the people fun and enthusiastic!!\n\n its a fun sport to do!! plus you get to shoot your friends with Lasers for revenge lol\n\n hehe!!  Great layout of the ramps and love the rules that they have in place!! Perfect for\n\n Birthday parties to!!","useful":1,"funny":0,"cool":0},
{"review_id":"NhKJOwm0rF-qL_qHLRgUcQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"Nwtytdgj099-QwCNhrkZfA","stars":5,"date":"2014-03-28","text":"Awesome for family fun or with a Group or a loved one!!!!!!!  I remember going here when I was like 8 super fascinating to learn about what it was like back in the old days!! yee haw.  Id come back again for sure!! Very clean and friendly staff!","useful":0,"funny":0,"cool":0},
{"review_id":"0gm6Fs7yD0oVGISy7pXa1A","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"qhBPeZEJnqrwbRA2P4UCog","stars":5,"date":"2014-04-04","text":"What can I say its clean its funky and great prices!!! its a great little record shop on 17th Ave.  The staff are very nice and look through Vinyls for a good hour!!  They also have a great Collection.","useful":2,"funny":0,"cool":1},
{"review_id":"OKmTXUZFCxHrbVON597P3w","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"PjlodjmfABi5dW-iek2P-w","stars":3,"date":"2014-03-27","text":"As we all know Calgary is an expanding City!! so is Calgary Transit.  I've had my share of good and bad!! its a all and all balance of reviews.   Some days are Great others are Horrible.   A few I could rant on but all in all not bad. I think some of the drivers could be more accurate and more pleasant.  The being on time thing is a big big one!! so if anyone reads this please know Im supportive but just a few critiques here and there!! I'm loving the new plans for the near future its going to be a greener and better system!! keep up the well done work!!","useful":1,"funny":0,"cool":1},
{"review_id":"vpSv-hxNSbKLONLd39v2LQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"vNmHnpJ7Vq1I1KTMPnTBPQ","stars":5,"date":"2014-03-28","text":"Great Customer Serves! awesome collection of skate wear!! great sales to. Store is very spaces and clean!! No downside at all. and the location best of all","useful":0,"funny":0,"cool":1},
{"review_id":"QULGBNC094cHIw9-Y6Hz7Q","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"zSOXSpWaR0iuZdCEl5csmA","stars":1,"date":"2014-04-04","text":"Brutal how loud it is gee's and the servers dress skankey high skirts and just look trashy. Its alright inside after the renovations at least.  The food its a 1 star to.  The bands that play are alright.   I wont come back that is for sure!","useful":3,"funny":2,"cool":1},
{"review_id":"AdSktJtRj1wWtMFuXCxhZg","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"OJiZTepPudoM4apBiyaFZw","stars":5,"date":"2014-06-03","text":"Went here Last week with My BF!!  It was amazing Gee's so much selections of cool gear and cloths and gadgets!!!  10 Out of 10 for sure!! It was Clean well organized and the Staff where neat!! The prices where reasonable to not to expensive.  Just right!!\n For fact Il come back here again in the future!!! Great Job Crown Surplus keep up the great work!!","useful":0,"funny":0,"cool":0},
{"review_id":"6R5edaweu4Ih-vl1lIhm5Q","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"kpdcHCLSM-FSi_w2Md5UlQ","stars":4,"date":"2014-04-04","text":"Very good but its hit and miss some times they have awesome sweaters and great rings!!  Although the staff is very friendly and very clean inside it is a cozy little Vintage shop located on 17th avenue!","useful":3,"funny":0,"cool":0},
{"review_id":"EVh_Jp8clW9yElqhsqowgg","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"5XXFsXKdPxCwHUuw2FeYpg","stars":5,"date":"2014-03-27","text":"To awesome for words Id come back any day!! The staff are amazingly nice and polite Great view from up top looping on the the city like an ant hill!! Love the glass floor feature!!  Nothing to complain about!!  I love making reviews super fun!!! I recommend making a visit to the Calgary Tower!!","useful":1,"funny":0,"cool":0},
{"review_id":"Mapds6ELJIVPtDwaKWncvw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"6wr8nHxkj9dDzp0jzd38Kw","stars":5,"date":"2014-04-03","text":"Superb very clean and the staff are great!! cool atmosphere Love the dishes yumm nothing that I cant complain about!! In the Summer I love their roof top Patio. I'l come back again for sure!!!!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"NrztCugiPXRbXGe2D9K6ZQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"8tKhimgRiNx74LbYDu9LIw","stars":5,"date":"2014-11-16","text":"Best Greek food in town!!   Great people awesome clean atmosphere. Food is exquisite \nI'll be coming back here for sure!!!","useful":1,"funny":0,"cool":0},
{"review_id":"ik1rr-aljDfhCO8U8w-08A","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"Mk0neiVFjMXPdFN81bKMOw","stars":5,"date":"2014-03-28","text":"Great for punkish Boutique . Very nice store clerks and cool selection Love how this store is Unisex. Very cozy layout to!! nothing to complain about.","useful":0,"funny":0,"cool":0},
{"review_id":"uFHd6KS_j52M90q2XSd7pQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"uJ6Sj086i_obwsUT2NEs7A","stars":5,"date":"2014-03-30","text":"Great layout and cool Clothing. Staff are very Friendly Id come back again. Just one thing its overpriced :-( other then that a great place!!","useful":0,"funny":0,"cool":0},
{"review_id":"Vz_IbKi_iR_u8eIYHormPw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"5D20vqEPLfdgixw6DDwtBQ","stars":5,"date":"2014-03-27","text":"Very cool little strip of Calgary with dining and cool shops!! Love it in the Spring Summer its the best time to go for little Festivals and events!!","useful":0,"funny":0,"cool":1},
{"review_id":"8YNcr4zA2yrWRKyMU7eqjA","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"Wnj7NBol_bS6OJAsv7AYtw","stars":3,"date":"2014-04-04","text":"Meh it was cool and all but not my geeky type of Expo. Some of the exhibits where very neat.  I went in 2009 and I did not have a good time on Saturday its crowded to the Max and it was claustrophobia at times.  Also it was a but Disorganized and very $$$ id have to say.  Its good for people that are Comic nerds and love to dress up as their favorite super hero.","useful":2,"funny":0,"cool":0},
{"review_id":"5tEK0HWZd2Ds3LaC8F1Zxg","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"YRdqKN9G3F_xvqA-ANSC_Q","stars":5,"date":"2014-06-03","text":"What can I saw amazing and leaves you in deep thoughts Lots of History that tells a Story !!!  Super cool Exhibits and the Museum is super organized and clean the staff are super friendly!!!! What can I say superb defiantly 10 out of 10!!!","useful":1,"funny":0,"cool":1},
{"review_id":"HozhcGMBGq8e53uUTWpyYA","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"F8faeZhtFmBskuW4f-FF2w","stars":5,"date":"2014-04-04","text":"The best I love how they change up the Exhibits very neat and they have amazing artists that sometimes come to.  Very organized and super clean gee's also the Staff are superb very friendly I'd say!! I would recommend coming here you learn a lot different cultures to through out the art!!! there is nothing to complain about what so ever.  5 stars it deserves!!!!! I'l be back for sure","useful":2,"funny":2,"cool":2},
{"review_id":"8Q_dfSqSm-sBownHv8urqw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"SzufM2lzA6adxGN_dPdPdA","stars":5,"date":"2014-03-28","text":"Great new Facility awesome staff and cool exhibits! I'l be back again that is for sure!! great for Friends and all kinds of ages that range to families to!! Very clean and modern looking inside and out!","useful":3,"funny":0,"cool":0},
{"review_id":"Lz474ku0-sXVN3CeLAZpTA","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"WVBunygqFNO6UeI6CUMwYw","stars":5,"date":"2014-03-28","text":"Yummy Ugh to good!! for a small pastry.  Yumm all I can say and very clean inside the La Boulangerie. Il be back for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"Skb-IYO3Wqyi_GzM_WJXfw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"Fh7TLkinplzutYoY8CMabQ","stars":2,"date":"2014-04-03","text":"I've been here as a guest 4 times and It's very nice inside and out but the staff are ok but stuck up also to become a member its super Pricey gee's The pools are good for the summer!! its A - Ok I must say.  The Glencoe Golf and Country club its alright as well the golf there is up to Par.  I just feel its to judgmental at both places of how people stare at you some times. Maybe its just me but Ive had that a couple of times when I went.   The facility is cool if your that kind of person that has that kind of money and some that are stuck  up.  There is better cheaper places to go for Recreational uses around town!","useful":1,"funny":0,"cool":0},
{"review_id":"f_MW0H9luQOwxVnsbQpp5w","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"vQZjJ4ph52osx0XwL-EExA","stars":5,"date":"2014-04-04","text":"Awesome digs I love this shop very cool atmosphere!!! great sales some times!! the Staff are very Friendly and very clean!!! Huge store to love how big it is. Nothing that I can complain about this review!! I'l be coming back again!!","useful":0,"funny":0,"cool":0},
{"review_id":"2Ir5jRfBom24KDxXuTCf7g","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"A4FwNRNm6Hqe6salELKMxw","stars":5,"date":"2014-04-03","text":"A good experience the staff are not pushy from what I thought! the store is very nice and I love the entrance super clean and modern looking.  In there stock is not half bad some cool stuff. and good things if you need in a pinch chargers and ear phones!! reasonably priced I think some are very expensive but its what you expect. The only thing I wish they had in stock at the store is Solar Powered devices that would make it way better. Other then that a cool store","useful":0,"funny":0,"cool":0},
{"review_id":"-zIe7wCsrNjgtfHNtlqqlg","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"uzsKlS-i2WLN7O9y_dHgZw","stars":5,"date":"2014-11-18","text":"Great mall just missing a Theater inside of it!!! The mall is big clean and way less people then at Chinook Center.  Love this mall very organized and less overwhelming.","useful":0,"funny":0,"cool":0},
{"review_id":"brrmNwvj5AKJUqg2cWHypQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"aUiiuRehsSJGMFxfbOPtqA","stars":2,"date":"2014-04-04","text":"It's alright its clean enough the staff are friendly but some of the food isent good. The bands they have are good time to time. The general noise is loud at least to me but I've experienced louder in my day.   It's ok in a pinch !","useful":0,"funny":0,"cool":0},
{"review_id":"gnGqLHURDg9rDS4HMbRw7Q","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"0rRLSX5rotp1_wiShc0jNw","stars":5,"date":"2014-03-27","text":"Great Mall Im happy to see their expanding it. Cool shops indeed. Nothing really here to complain about!  Love the touches to the sculptures of the polar bears for the winter! and the sales in some of the stores!!! Keep the good work up.","useful":0,"funny":1,"cool":0},
{"review_id":"qr5jwednQyi3OUXXHdy2og","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"guaCGCYDA9Q9WfnI721Mbw","stars":5,"date":"2014-03-28","text":"Perfect Location!! I love the atmosphere and the staff they will become your neighbor hood friends.  Great Coffee and serves all together. The place is spick and span.!! I love their top patio over looking 4th Street!! very neat!!!","useful":0,"funny":0,"cool":0},
{"review_id":"D26r-GXq_DA0qj1ArWvZjg","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"NS7WJ8pxLdIpL6qCW2iOnw","stars":5,"date":"2014-04-09","text":"The best place Ive been in a long long time the service was Excellent Super clean and fun atmosphere.  The food was amazing to everyones liking!!! I will be coming back again yes!!! Not a thing to complain about at all.   Keep it up!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"WPmG6CxT0RcNgQtD43od0A","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"DloSSIe5sulfUwJvduktCw","stars":1,"date":"2014-03-30","text":"Its hit and miss with the service went to the Chinook center location again tonight with some Friends. Brutal service. and barley any sauce in the pasta I had. Cleanliness Id have to say alright I suppose.","useful":1,"funny":0,"cool":0},
{"review_id":"AZXIE4zMam9oqGFkTsYuCQ","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"m80qnirBpZ1BYvs7L8ZEKw","stars":5,"date":"2014-03-28","text":"Have had the best Experiences here.  Sweet James glow my heart!! also the staff are wicked to!! Could be a bit more space's for dancing but all and all fairly clean!! Saturday is the Best nights to go for deep house or funk!! its actual music!!  I'll come back for sure someday!!","useful":0,"funny":0,"cool":0},
{"review_id":"wA89m4Y8Kfp7W7aa8hTTQw","user_id":"mTyBkIXOBX0lfma34oypmg","business_id":"QfdqV6-9Nbo6oZoFyCaszw","stars":5,"date":"2014-03-27","text":"Yee Haw the best ever Love it!!!!!!!!!!!! come on out in July Peeps!!!!!!!!  Nothing to Complain about at all!!!!!!!!! gets better every year!!","useful":0,"funny":0,"cool":0},
{"review_id":"VrjYirgk0xTtt_4a_PQc-A","user_id":"cgQY3DSeSVum2lb4aiVnjQ","business_id":"SEEy7DKuVbgw4Rai2BqEEQ","stars":2,"date":"2017-11-07","text":"I with wife and another couple went to dine here, albeit somewhat late. Wait staff seemed in a hurry to close. Couple shared a nice dish, and wife ordered salad. I ordered a large plate of traditional food to share. Couples food was good, salad nothing special, but mine was of poor quality. Heaping amount of food that had been cooked to long back and was not edible. Rather than send back and cause a scene I left with others. Examples was beef pieces cooked almost to charcoal, fried plantains hard as shoe leather, etc. I SHOULD have been told to order something else but it seems like the restaurant was willing to dump food on me that was probably recooked when I ordered. Likely won't go there again","useful":1,"funny":0,"cool":0},
{"review_id":"mCkGNyY9CgDvcSPv735TiA","user_id":"cgQY3DSeSVum2lb4aiVnjQ","business_id":"PSK42ktIllSGv0cC1Ma9dw","stars":5,"date":"2016-05-02","text":"Service at Walker's is superior to any big box store or chain, Fast service is provided by the adequate and well trained staff, and in price comparisons Walker's beats the big chains quite a bit. This is a professional pharmacy as opposed to the chains who have Pharmacy as a sideline. I am a retired Pharmacist and will tell you that this is where you should get your prescriptions filled. Leave the grass seed and Easter candy to the chains, but depend on professional Pharmacist for your health needs.","useful":0,"funny":0,"cool":1},
{"review_id":"SEgk3-6TpT7y8avuZ4KYXw","user_id":"cgQY3DSeSVum2lb4aiVnjQ","business_id":"DegZrwS3r5mE2oLXbg08Hw","stars":5,"date":"2015-12-01","text":"I was welcomed and able to get service promptly. Stylist understood my needs and took care of my hair cut in short order. She was most friendly and wanted to be sure everything was right.","useful":0,"funny":0,"cool":0}]