[{"review_id":"90YXPNEa9fMhQsntGGhShQ","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"TyKGLi1V1PFRHYmHDjFUMQ","stars":5,"date":"2011-10-05","text":"I love bringing clients to this wonderful place. Great food and great service. The sushi bar is one of the best in Montreal. Highly recommended","useful":1,"funny":0,"cool":1},
{"review_id":"03dNKEDriDeZ8poYbiNyxQ","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"1lLJDy73uBp_I2LJ0B0Fkw","stars":5,"date":"2011-09-09","text":"Was here for a party last weekend and had a blast. They play great Jazz music on Sundays and the tapas are really amazing. Would highly recommend.","useful":0,"funny":0,"cool":1},
{"review_id":"fTxqjT6vMJAWODwYVtOXiw","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"3ZvJhWfPxxFvdL8BYz5mKg","stars":5,"date":"2011-09-09","text":"Really cool concept! The food is great and the concept is even better. You have to check it out...Try the Sushi Burger","useful":0,"funny":0,"cool":1},
{"review_id":"nxb6uLCZHH5yiDwq37HR4A","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"YbfLTLKM7EGKBGNKhL8azQ","stars":5,"date":"2011-11-02","text":"I ate here last week and it was fantastic. I was attending a show at the Bell Center and I had heard of this place. The Octopus is amazing as are the scampi's. If you're a fan you have to go try them. Also the wine list has to be one of the best in the city.  They have free parking when you eat here, so great tip when going to a game\/show at the Bell Center.","useful":1,"funny":0,"cool":2},
{"review_id":"oNFx-ELD1lbNI2nx33WJcw","user_id":"ppH1Q7tSKkrhLqNYMn3lQw","business_id":"KJ6DuC0Jve9hAtzM2SGNOQ","stars":2,"date":"2017-04-16","text":"Our steak burrito was soupy and couldn't finish it because it tasted so bad. The chicken tacos were very small and the shells were very hard. The chicken was dry and no flavor. We were charged an extra 50 cents for using a card which is fine, if we were told about the extra charge. We gave two stars because the man behind the register was nice otherwise we would have given one star. We will not return.","useful":0,"funny":0,"cool":0},
{"review_id":"J-rpbttkX6uSGqYrvHMMtg","user_id":"fWSxNUEiPllioimKuv-xRg","business_id":"S3-JpB5dBhMXmauMqeoN-g","stars":5,"date":"2011-11-01","text":"One of the most perfect, small, family run Mexican food places that I ever encountered. Atmosphere was authentic, the place is clean and the food is great. Not upscale by no means.\nI had a Huaracha for the first time, and I loved it; it is loaded with good ingredients (including a cactus, which I had for the first time and it was great).\nI stumbled upon the place following a Yelp recommendation, and was shocked at first how tiny the place is, but you discover there is more to it later. Although, try to sit at the bar if you can (if you like it), for a feeling different from other usual Mexican joints.","useful":0,"funny":0,"cool":0},
{"review_id":"4BNa0Z9AcU8nnSUpu6jUQg","user_id":"WZJdahsX6wqO7rhP_Se2fQ","business_id":"gfmRNRj2eMwExc6YVxSI9Q","stars":5,"date":"2014-08-14","text":"I Had a really good experience at this urgent care.  Service was prompt and the staff was professional and courteous.  My family and I will definitely be coming back when we are in need of great medical care.","useful":0,"funny":0,"cool":0},
{"review_id":"w6xE2SwqJhBJOLbRUebazg","user_id":"WZJdahsX6wqO7rhP_Se2fQ","business_id":"I9_cp9hYiHAKgMavbZxz5w","stars":5,"date":"2014-08-14","text":"Tammy and Debbie are AMAZING! I had a bad experience with laser hair removal a few years ago at a med spa.  It was very painful to the point where I had given up.... that is until I heard such great things about luminescence!   Debbie was very comforting and the laser they use is awesome.   Compared to my previous experience it was a breeze.  The pricing is affordable,  great ambiance and professional staff.  I can't wait to start utilizing some of the other services they offer.","useful":2,"funny":0,"cool":0},
{"review_id":"0XBKEmt9tWF1lTKhFn5gpg","user_id":"87yxDLq2ke9HRlD7BcY74A","business_id":"fxZ8B05ROM1BSAdlh7p1MQ","stars":5,"date":"2016-12-04","text":"The very best service this time due to Rachel who provided superior customer service and attention like I have never seen before from Panda Express.\n\nShe made the experience at Panda excellent","useful":0,"funny":0,"cool":0},
{"review_id":"ZKmAx8Jr-pcNzaheDcIl3w","user_id":"87yxDLq2ke9HRlD7BcY74A","business_id":"nDfN1RkA40anfzjFGRO8qQ","stars":5,"date":"2015-11-01","text":"The best Italian Restaurant in the valley by far! The best food, the best service, the best prices. I ordered the VEAL Parmigiana and it was very tasty, tender and prepared the way it should be - Authentic Italian to the bone! I also ordered the soup of the day - Clam chowder and it was absolutely superb. You cannot do better for Italian food anywhere. Sorry, does not get any better than here. I intend to go back and bring as many people as I can with me. Great dining experience. A \"must try\" restaurant, by all means.","useful":1,"funny":0,"cool":1},
{"review_id":"5GCjJ27TDNalmtq_xhoMsQ","user_id":"uwZYNx1GcaKk8oWHRnOTqA","business_id":"UWxMp95YqySQtWqNjmirbQ","stars":5,"date":"2015-04-25","text":"The Hi Life is a great glass shop.  In town from California I broke my quartz nail.  No problem though Ace and the rest of the staff were quick to help.  Not only did I get what I needed, I got some stuff I wanted.  There collection of name brand, one off, not mass produced glass is very impressive.  Also as a General in the G Pen army it was great to see fully stocked Grenco accessories, batteries, and full starter kits.  If you're in the area and you are in need of a vital piece that just broke or you just want to check out some truly impressive glass I'd get your ass in here.  Also walk around ask questions and talk shop, they'll hook it up if you're not a dick.","useful":0,"funny":0,"cool":0},
{"review_id":"5dHvl2V1fNwwQ5IzwfWjtQ","user_id":"FAz62oRjQq0IJGPXiVXAPw","business_id":"smnXd7cSduSxe8CoYyLCyw","stars":5,"date":"2014-09-25","text":"I recently purchased a property in Las Vegas and I am exceedingly glad I chose to work with TR Realty. Joe Abughazaleh was the right man for the job as he kept me updated and well informed throughout the process. I permanently reside in San Diego and only had to stop in town once. Great service.","useful":5,"funny":2,"cool":0},
{"review_id":"0W9KU3m0HhebkzhTCNObHg","user_id":"mFZFkcgtF7KaOAzLwpdKfw","business_id":"7YpipG1N4nsvQZ_WGiV9PA","stars":5,"date":"2014-12-29","text":"The Godfather sandwich made me see God. Every piece of meat and cheese is overflowing with flavor. Even the lettuce is delicious, as it is covered in an Italian dressing that adds to the overall greatness of the sub. You won't be disapointed by any of the menu items here.","useful":0,"funny":0,"cool":1},
{"review_id":"MS7p4_i0TeaRvmPVRyhygw","user_id":"3aEd4R_A2gMFoaxOL5je2g","business_id":"SK3EYfvBgBJV6594FMDsDg","stars":5,"date":"2015-08-27","text":"My hair has transformed since seeing Kat. It's healthier, longer and fuller. She takes her time and gives clients undivided attention to ensure she is meeting your needs. Very happy!","useful":0,"funny":0,"cool":0},
{"review_id":"nuxDaWwDfmZmkxxBttCClg","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"769NudnrUxWFtJCGU66A_A","stars":3,"date":"2011-11-16","text":"I had read a couple negative reviews before going for dinner last Tuesday night, so I was pleasantly surprised with my experience.\n\nThe menu is great - quite a bit of variety, and some interesting items. I had the \"All Canadian Burger\" with fries. The portion was huge. I actually had to cut the burger in half, as to not have it make a big mess - this is a good thing. Admittedly, it was a tad greasy, and was lacking a bit of flavour, I thought, but it was overall a decent burger. \n\nThe service was fine. We had a very friendly server, who checked up on us periodically, and continued to refill our water long after the meal - no pressure to leave. It wasn't very busy, so perhaps we had better service as a result, but either way my experience was good.\n\nBeer wasn't as over-priced as I expected - $6 for a pint of Heineken. \n\nI might check this place out again, to try some of the odder stuff on the menu. The only annoyance from the evening was that they didn't take Interac\/Debit, but there was an ATM (with $2.50 fee) in the connected Thompson Hotel.","useful":1,"funny":1,"cool":1},
{"review_id":"c8IfKBJV4qfouKyg42qwTA","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"YrqQWT5wzBUumklE4B_XfA","stars":5,"date":"2010-06-09","text":"BEST After-Bar Food. Period. Open 'til 4am on weekends, always packed with people. I've only ever had the large steak burritos, but I can't imagine any other kind could be better!","useful":1,"funny":0,"cool":0},
{"review_id":"Mr9WaPbtxN5AT5TxK6acow","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"846lAt9k0-jjM8TbBIRAmg","stars":4,"date":"2010-08-26","text":"After reading the reviews on Yelp about this location, I was a bit skeptical, but checked it out anyway... I'm glad the lower rating didn't scare me off, 'cause this was one of the best thin-crusted pizzas I've ever had! \n\nOne thing - the beer list could have been better, but I suppose you're supposed to drink wine at these places anyway.","useful":2,"funny":0,"cool":1},
{"review_id":"3lsiuW_5EA35oC4JcdtcQA","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"Py97oycFokZ296KJ2Pe-hQ","stars":1,"date":"2013-07-17","text":"Burger was burnt to a crisp.\nPizza was salty as a shaker full of salt.\nService was nowhere to be found.\n\nNeedless to say, we will not be returning.","useful":4,"funny":3,"cool":2},
{"review_id":"mRkzBt-nhAL7keH5oFMumA","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"KVpvE6pOPM9KMvak4HFsNg","stars":3,"date":"2010-07-15","text":"I'm fairly new to the thin-crust pizza scene, and this place really didn't do it for me.\n\nA friend told me about this place, so I checked it out with a couple buddies last Friday evening. After an hour waiting for a table (expected, considering we just walked in at 7pm on a Friday), our server ran down the specials, and pretty much the whole menu. Very friendly, though a bit tough to hear in the smaller, crowded environment. \n\nI went for the Salami pizza, which arrived at the table quicker than expected. Unfortunately, I was not pleased with how quickly the thin crust can get soggy upon saucing and piling on toppings. This point alone dropped my rating to 3 stars. I've heard mixed reviews about the crust, but my buddies and I all agreed that it was just way to soggy for us. \n\nI did, however, find a fix for the soggy pizza - take some home in a doggybag, reheat in the oven, and it's the delicious taste of the pizza, with a better crust.\n\nI doubt I'll return to this Pizzeria - next to try is Terroni's.","useful":0,"funny":0,"cool":0},
{"review_id":"mbpoLdOyDg_EJ2kwKlLKcQ","user_id":"NArI8E3qQQvcW1SnzyqDYA","business_id":"iAxsnFs3qq0Qx1EJ1S9SoQ","stars":4,"date":"2010-06-09","text":"I went here last week with a group of 7-8 people, and I was pretty impressed. To be honest, this was my first true Japanese cuisine experience, aside from the occasional sushi place. We ended up ordering a bunch of stuff, and passing it around the table to share. The beer was cold and the food was hot. The chicken and the pork were both delicious.","useful":3,"funny":0,"cool":0},
{"review_id":"kbh-PFHAwxDRejuVv7kRwA","user_id":"RZ0Ny03o_5h3AtxCLcS_qw","business_id":"ABJjxuO6oh5D9R48-eAUdQ","stars":2,"date":"2012-04-09","text":"Food was not bad for the price but the atmosphere leaves a lot to be desired.  You feel like you are in a dungeon.  The lady at the front desk was very nice and only charged me for one of my kids when both were of the age to pay.","useful":0,"funny":0,"cool":0},
{"review_id":"f5V1kPw-rEkW-9N2vP0pUA","user_id":"RZ0Ny03o_5h3AtxCLcS_qw","business_id":"bsrj9_hFAql3dlSf244zpg","stars":4,"date":"2012-04-09","text":"We got a one bedroom suite for myself and our 2 boys and the room was great and the price was right (best rate was found on BookIt.com).  The first rate we found Trump matched when I called them directly, but they would not match this one so I had to cancel my direct reservation and make it through the third party.  Full Kitchen (which you get with the one bedrooms) was GREAT.  Saved lots of money on meals.  Master Bathroom was huge!  Would have been five stars except that the pull-out couch was so soft and springy that even my 40 lbs kids complained about it.  They did have housekeeping bring an extra thick blanket to put below the cover sheet when I called about this, to lesson the feel of the springs.  However, I do not think an adult could have slept on this.","useful":0,"funny":0,"cool":0},
{"review_id":"SgB8fybHoa-yFZZkt62c0A","user_id":"8HMN1jABE5y7my-B8m62Cw","business_id":"XTtNTWH_Nqv27RC7OtS7dQ","stars":1,"date":"2017-06-20","text":"So far it is a dud! The hostess was MIA for five minutes but we were finally seated. Jennifer, our server did finally show up as well.  \nWaiting for the food. Hopefully will be a little quicker. Stay tuned\nThe coffee was good once it showed up. My wife's burger was nuked and went back. It was ok the second time. My chicken was very oily and the breast was dry.\n\nThe best part of the meal was the pretzels. Outstanding!\n\nI would not return.","useful":2,"funny":0,"cool":0},
{"review_id":"H0IjrmTpYHwfhtStQ2fZwg","user_id":"8HMN1jABE5y7my-B8m62Cw","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":5,"date":"2017-06-21","text":"Come hungry! Huge portion. Outstanding service. If you want great Nachos, come here.\nAll we needed was two more people to eat it all.","useful":0,"funny":0,"cool":0},
{"review_id":"mb5ylui05e-VHXaLSOAGvA","user_id":"BJ3VQ_8ysOmZS23JoppB4g","business_id":"aA8gdI4JfCgqyIJ81O72lg","stars":5,"date":"2012-01-10","text":"My uncle took me to this wonderful restaurant last week, promising me that it would be the best Thai food I'd ever had in Montreal.\n\nC Thai Cuisine did not disappoint.\n\nMy first impressions of the restaurant were how clean it was inside and how kind and welcoming the owners were. They're in the first year of business and do all the work in there. But they take the time to talk to you and help you make your selections by suggesting menu items. There is a lot to choose from!\n\nI started by ordering delicious summer rolls. This item is hard to mess up, and I admit that I've enjoy equally good rolls in other restaurants. My uncle had a won ton soup, his favourite. He's tasted enough won ton soup in his life to be able to confirm that it's delicious here.\n\nI also had fried vegetarian dumplings, served with a delicious ginger-soy dipping sauce.\n\nFor my main course, I had roast duck with red curry, coconut milk, and basil leaves. I've never had duck at a restaurant before, and I was very please with my selection. My uncle had a pad Thai with shrimp and squid and he loved it.\n\nThe restaurant recently got its alcohol license, having a bring your own wine\/beer policy. Icing on the cake.\n\nIf you like extraordinary Thai food and like to support hard-working entrepreneurs who actually serve a GREAT product, please go try C Thai Cuisine. You won't be disappointed.","useful":3,"funny":0,"cool":2},
{"review_id":"HTGlZFBKZs0aW_7hT2z-Xg","user_id":"BJ3VQ_8ysOmZS23JoppB4g","business_id":"1mef9jhlwhL1f2jIX-AVQg","stars":5,"date":"2012-01-10","text":"Tehran is a wonderful establishment.\n\nI've been an infrequent visitor for the past 10 years. I always wish I'd go more often.\n\nThe menu doesn't have too many options. But the choices you have are so flavourful that you won't feel lacking.\n\nThe plate sizes are quite large, though I have noticed that portions decreased a bit recently, and prices went up. Worry not, you'll still be stuffed and not spend too much.\n\nEveryone should give Tehran a try. The food is delicious and the service is quick. And shame on someone rating a restaurant they've never been to and making a judgment based on hearsay.","useful":2,"funny":0,"cool":2},
{"review_id":"UxRVUpdOhwmoQrlVyB3Mfw","user_id":"Q86IijZ5DDGrZlhMzPBe5A","business_id":"I5TnTKHzJuLA0YLZPGCNwQ","stars":5,"date":"2017-02-17","text":"the best healthy chicken and rice combo I've experienced. Its the perfect combo, workout and then after get your grub on. No need to cook.","useful":0,"funny":0,"cool":0},
{"review_id":"GHN8GGlzFqT8fK9oRiTE4A","user_id":"Hcha3ye0y0SZ0No68hDu2g","business_id":"GM7eH4niVTz64O3cNjlaMA","stars":3,"date":"2012-08-12","text":"Was there for the Browns pre-season game.  Cheap beer, good wings, and good crowd.  Props to the dude working the bar and covering half the tables.  Other 2 bartenders looked like they wanted to kill someone all night and avoided serving customers at bar.  Yes, it was busy, but you would have had great tips and customers staying longer if you had smiled once the entire night.","useful":0,"funny":0,"cool":0},
{"review_id":"59aWmWTs1KJeRzprwLn31Q","user_id":"ZU0a-U7bOye01mCiWN7RsA","business_id":"pJrM4yAZo0Gs63D9UCyCSQ","stars":1,"date":"2017-02-13","text":"Not sure what all the hype is about. We had a friend in town and were excited to try a new restaurant. Everything was extremely bland - I thought this was an Indian restaurant? Drinks were underwhelming and 85% ice. The decor is tacky (although the ceiling is cool). There is this weird partition with holes in it, great for customers waiting for their tables to stare at you while you enjoy an intimate dinner! And then the bill came! Not only was it extremely overpriced, we had to wait forever to pay the server - by that time we really wanted out of there! Montreal is a city full of amazing restaurants - don't waste your time on this one!","useful":1,"funny":1,"cool":0},
{"review_id":"dk6t7oXRooKoaamqXrzzug","user_id":"_ku-IIAx1MvfBzaP6QS-zQ","business_id":"ReyjVKUEVKZHmlrBxu_h2A","stars":5,"date":"2015-06-01","text":"This is my second time here, and once again they did it! I have tried a few different Filipino restaurants in the area and Full house is by far the best!  Yet to be disappointed, and very friendly staff and great service! Can't wait to continue trying different dishes from here. Today I am enjoying the Lechon dish","useful":0,"funny":0,"cool":0},
{"review_id":"kK8pneuKN-grZ33GobC7iw","user_id":"_ku-IIAx1MvfBzaP6QS-zQ","business_id":"Sovgwq-E-n6wLqNh3X_rXg","stars":5,"date":"2015-08-18","text":"As close as I have ever gotten to \"authentic\" Mexican food. I was expecting the same ol canned beans and flavored food, but it was almost as goods as my mother home cooking! Of course no one can ever beat moms haha. Hard to empress a Mexican with restaurant style food, but this place did it indeed! Will be back","useful":0,"funny":0,"cool":0},
{"review_id":"r5yf-8Y9t5TRgKE_QClWqw","user_id":"lMTCu4_6Fa03pSXPGQ3lCw","business_id":"JLbgvGM4FXh9zNP4O5ZWjQ","stars":5,"date":"2017-02-26","text":"We were in Pittsburgh for a special occasion and decided to try Meat and Potatoes. We had a reservation and we were seated right away. I loved the atmosphere. It was pleasantly full but not crowded. No tvs at the bar which made for a lovely ambience. Our reservation was for later in the evening so the restaurant seemed to clear out with the theatre crowd. Our waiter was great, attentive without being overbearing, knew the wine list backwards and forwards and was lovely. We got the fried chicken livers and Cobb salad and then the steak for two with a chocolate dessert. All of it tasted delicious - well seasoned and generous portions on the sides. The only very minor drawback is the two top tables are very close to each other and it feels a bit like you are dining with the couple next to you. I would definitely recommend to friends who visit Pittsburgh.","useful":0,"funny":0,"cool":0},
{"review_id":"Xmie5WI-Yevi2M9IMvWR_g","user_id":"15D-kfWAZ4m-UEqHInbpGQ","business_id":"9UU2DPhwmTmkuANzYiZSMQ","stars":1,"date":"2017-08-11","text":"I wish there was a 1\/2 star option but you know there isn't so I have to give it one. Where to begin... Our meals took almost an hour to come out on an average Thursday night. \nWhen the food finally comes out the server brings out my meal and says who got the cheeseburger with mustard...but the burger has no cheese and no mustard!!\nOne of the worst meal experiences I've ever had. I do not recommend it if it's important for you to get your food in a timely fashion, hot or prepared as you've specified. Lower your expectations or dine elsewhere.","useful":0,"funny":0,"cool":0},
{"review_id":"V2c9qHmb2uXAJMw8LNSUQw","user_id":"hqgrK6RLQYuah2ZyRbrlww","business_id":"BslEhCyzaQPfpHtDogb4hQ","stars":5,"date":"2014-04-01","text":"Best new venue in the west!!!! Huge room.  Great sound.  Satisfying food.  Pleasant staff.   Can't wait to go back!  Well worthwhile the 4+ hour drive from LA.","useful":0,"funny":0,"cool":0},
{"review_id":"reQxO2tEUG2lHtgDum6Blw","user_id":"hqgrK6RLQYuah2ZyRbrlww","business_id":"sjpYOSE-cK0h-XI7XooLTQ","stars":5,"date":"2014-04-01","text":"Friendly staff.  Nice room. Yummy hot breakfast.  Free wifi in room.  Perfect location for enjoying the strip without living on it.","useful":0,"funny":0,"cool":0},
{"review_id":"478r8J5OynbLKdqbzJ8AOg","user_id":"va8q8M4ezg7Iwst6JjRNXA","business_id":"rsp55UnLNS1PYmC6jq7Q_A","stars":1,"date":"2011-09-07","text":"In two words? Completely unethical. BUYER BEWARE if you are considering using Air-Force 1 Air Conditioning, LLC.  \n\nThey came recommended to us through our realtor when we were in escrow on our house.  The inspector recommended we have an air conditioning specialist evaluate the AC unit in our prospective house b\/c it was not functioning within acceptable range when tested. \nAir-Force 1 claimed they inspected the unit, but very clearly, that was not the case. Post-inspection we REPEATEDLY tried to ascertain the inspection report they claim they completed, but they said 'it was lost due to moving [their] locations'. \nNo more than 2 weeks after we closed escrow, the AC stopped working (In Arizona, in July!!) and we called our home warranty people to come and replace the unit.  They said it was very old and very damaged - so they denied our claim.\n\nRemember that inspection report I said we were trying to obtain? Well, this is where it gets good.  They were never able to produce the original inspection document or the email they allegedly sent to my realtor stating that the unit had no issues. When we approached Air-Force 1 regarding the broken AC, they fabricated a duplicate report that 'back-peddled ' all the initial information they said about the AC unit being fine and stated that there were issues (mind you, only after speaking to us to find out what had gone wrong with the unit).\n\nIn the end, we got screwed for almost $4K on a new AC unit because apparently it was beneath Air-Force 1 do perform their job correctly or with integrity.\n\nI will be sure to post my thoughts on this matter on 'pissed consumer' as well as to all 1,087 of my Facebook friends, not to mention the 12,000 people who follow me on Twitter.\n\nThanks for listening!!","useful":6,"funny":4,"cool":0},
{"review_id":"mF2wRJKMK26kx4YLY4kIBw","user_id":"AB7yV5mSiYdp1OZ_ZdMJDA","business_id":"aNYunG3j5zNJ4F0dQcZMyQ","stars":1,"date":"2011-12-04","text":"My husband & I made reservations for two for an anniversary. When we got to the restaurant they told us the restaurant was sold out to a Xmas party and proceeded to walk us out to their pizza place. They put us at a table in the middle of the doorway. I could not get into my seat it was so tight. I tried to pull the table out . That put my husband way in the middle of the doorway. They did have an open table for 4 but would not make it available to us. We just left the place. Ruined our evening!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"5OALiPA6Fv64_HZQOhvSOw","user_id":"AB7yV5mSiYdp1OZ_ZdMJDA","business_id":"cs1qJvnWUg_f8g020z_3PQ","stars":5,"date":"2016-08-09","text":"This is the best Caprese salad and pizza that I have ever had. We go to this place once per week. I am addicted to it. The service is superb!  You cannot get better than Pizzeria Bianco at Town & Country!","useful":0,"funny":0,"cool":0},
{"review_id":"UaGX7MgQtMRaG-JZIX4BKg","user_id":"AB7yV5mSiYdp1OZ_ZdMJDA","business_id":"CjBPqREcHu9cPC3WWd4TaA","stars":5,"date":"2016-03-05","text":"I was so impressed when Kandy, the Service Manager, read my review she quickly turned the situation around. I feel the quality of service recovery that Kandy demonstrated is similar to that of a Ritz Carlton. I had a massage today with Lori Ann at the Camelback location. It was superb !!! I'll be back.","useful":1,"funny":0,"cool":3},
{"review_id":"FvlpBsvh3gGFi-07CTqmRg","user_id":"AB7yV5mSiYdp1OZ_ZdMJDA","business_id":"_LFL-zsgOZRc7rSfjzZbVQ","stars":5,"date":"2011-12-17","text":"I have been going here for over 4 years. I love it! Every one is friendly and they know what they are doing. Kim is a real professional. I would not change for the world.","useful":0,"funny":0,"cool":0},
{"review_id":"qYB5lha_56sclRx4N-C3mg","user_id":"AB7yV5mSiYdp1OZ_ZdMJDA","business_id":"prGGdpeqi6DU4t_RfdO0Dw","stars":1,"date":"2016-01-30","text":"I was treated like trash by Kristine ???? a sales woman when I went to return a Nespresso Milk Frother that I bought at the Biltmore store. It stopped working. I had the receipt, the original box and even the original William Sonoma bag. When she found out I needed to return something she said \"you'll have to wait.\" She went to a computer and did stuff and even made a phone call.  She kept saying \"I have one and my daughters have one and they work perfect for years.\" I finally got store credit. Don't go there. You will get better service at Wallmart !!!!!","useful":1,"funny":1,"cool":0},
{"review_id":"hqfgRuSKoFb_Lkayv3h8Qw","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"PwHdOGAwzmMm1jr_Nh9SnA","stars":5,"date":"2017-08-13","text":"I'd heard about the store before but had never really been in. I was NOT disappointed! I received excellent service from Cherie (I'm sure I spelled it wrong)! I walked in. She greeted me and asked if I was shopping for a specific event. I told her I was and she immediately asked my size and put some options in a fitting room for me. It was great to have her suggestions and I walked out with two dresses she picked. Best service I've had in a clothing store probably ever. I will definitely be back!","useful":1,"funny":0,"cool":0},
{"review_id":"0umaNjqntIyOzYtyhudVbQ","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"rp5RXEpoAj-k3c4_QP6LMQ","stars":1,"date":"2015-10-20","text":"Went tonight on a recommendation and was horribly disappointed. We often go to Genghis Grill and love it so we wanted to try this. This doesn't even come close. The meats looked like frozen, rolled up lunch meat. Veggies looked ok. Wasn't really any taste to the bowl unless you drenched it in teriyaki and soy sauce. My man didn't even finish his food and that never happens. Even the frozen yogurt didn't taste very good. They have toppings for 25 cents each from a gumball dispenser. We definitely won't be coming back. We'll stick to Genghis Grill.","useful":0,"funny":1,"cool":0},
{"review_id":"fuEwQYouiqig2yOPOl3HjA","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"OgqZepyL6UesV6oHtdvI1A","stars":1,"date":"2017-08-27","text":"ABSOLUTELY NOT WORTH THE TIME! I wasn't \"Allowed\" to see all of their dresses. The \"show room\" was shitty AF! Renovation is a MUST! Add natural lighting or white lights! I felt dirty after trying on the dusty sample dresses. Customer service is lackluster and passive aggressive AF! Waited 25 minutes to be seen! I would never give them my hard earned coin!","useful":7,"funny":1,"cool":0},
{"review_id":"DxGEX3xwRBZLQfBZOqxzTg","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"NHq7Ya_LBLMJg8WphCTo6w","stars":5,"date":"2016-12-07","text":"Visited this location yesterday to kill some time while my fiancé and I were at Anthem and waiting for a dinner reservation. We had a great experience with the manager James. We will definitely be coming back to see James when it's time to buy our wedding bands. Great, friendly customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"sdy5pTtxb-GR_qY0GgY1kg","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"knU0b5FaqtUSr1UrflaVbg","stars":5,"date":"2017-08-27","text":"Had an AMAZING experience at Luv Bridal! I had just had a horrible experience at a different shop but my mood instantly changed when I walked in this place. They were so attentive and sweet. Beth, my consultant, was absolutely amazing. This shop is absolutely gorgeous and knows how to make a bride feel amazing. They have a great selection of beautiful dresses and the prices are so incredibly reasonable. I'm so glad I came to Luv Bridal. I found my absolute dream dress and Beth was just as excited for me as my family and I were. Couldn't have had a better experience and I would recommend this shop to anyone!","useful":0,"funny":0,"cool":0},
{"review_id":"bosdTGf9WLUO5hMXGXMT7w","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"rGhZ9iEWyVcb0D_ia4EpgQ","stars":5,"date":"2012-02-05","text":"I've never been much of a reviewer but after going to Salon Surreal I didn't have a choice! I absolutely loved my time at this salon. I've never been the type to do a whole lot with my hair since its kind of a strange curl that's pretty thin. I made an appt with Nicole for a full color, hi-lites, and cut & style. I got there a little before my appt which was set for 11 and the salon was clean and absolutely adorable. Nicole came and introduced her self right at 11 and took her me to her station. She asked me what I wanted and I showed her a picture. My hair was previously dyed black and the picture was of a pretty honey brown with some hi-lites. She thoroughly explained why it really wouldn't be possible to do that color without damaging my hair and it possibly not even turning out well. She explained what might be a good alternative and I told her to go for it. She was conversational and made great conversation for the whole 3.5 hr appt. She ended up doing a full hi-lite with a toner and a cut. I absolutely LOVE how it turned out and have already received so many compliments on it. I also love the cut she did and she straightened it for me which is always a luxury since I don't do it myself. I walked out of the salon looking and feeling like a million bucks! I will definitely be going back frequently to see Nicole!","useful":0,"funny":0,"cool":0},
{"review_id":"Zqja-1e7XPDkyyGT3XtrEA","user_id":"MY9qSN1O8EjhMRIcWWvpPg","business_id":"h-eYvP7DboaYAhNwrppp9Q","stars":5,"date":"2016-07-15","text":"My service advisor was Justin. I purchased my Hyundai from Chapman Ford but when it started acting up I knew I wanted a Hyundai dealership to fix it. I'm so happy I went with Chapman Hyundai. I called to check my warranty status and they were able to fit me in with an appointment quickly. They needed to order a part for my car so they set me up with a rental while my car was fixed. The next day my car was fixed but I was at work til after the service shop closed. Justin set it up so I could pick up the car after hours. Pickup was seamless and I was greeted in my car by a cute ribbon tied box full of candy. Great, efficient service by this service shop","useful":1,"funny":0,"cool":0},
{"review_id":"eCJaIRwBL2ZOSENdLeKJgQ","user_id":"owP2rXN9jhASNbM9dio2KA","business_id":"gcfDH5QxVC2xqdXYz94W8Q","stars":1,"date":"2017-07-24","text":"I wasn't even 1 min late and they shut the door on me. I explained that I have a baby and just managed to leave the house for the first time today and really wanted to join the class. No exceptions. I understand that there are company policies but shutting out potential loyal customers left a sour taste in my mouth. I will not be back.","useful":0,"funny":1,"cool":0},
{"review_id":"kVdptNKuP7982o3QhDhGIw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"pSngeMoYShqw5icznsUyRg","stars":2,"date":"2013-05-15","text":"I give this place a 2 stars because the filet mignon sandwich was tender,but lacked flavor  that's it and I'm being generous, we sat at the bar stools with a friend for lunch and the bartender was quite rude and it was our 1 st time so we had some questions, it was Mother's Day so they were not serving the whole menu as they had a buffet, we asked the price of it and she ignored us, then there was a photocopy page with some food they served from the menu, again no price, I hate to get ripped off because happened to me every time I order from menus without prices, finally we got a regular menu to see what came with the food and stuff, I probably won't go back service is super high on my expectations and it sucked here.","useful":1,"funny":0,"cool":0},
{"review_id":"PPufhzhPMK79zHzHOBm-0g","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"SThmy10YhS13oFgT990Xhw","stars":5,"date":"2015-04-17","text":"Omg tried the waffles today and they are amazing!!!! Don't need any syrup they are sweet, delicious ! New favorite breakfast place!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"EjidlTz6gNYAAWV1qngFsA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"V-z697Ko2niiEAD60SJv7A","stars":1,"date":"2015-07-31","text":"Well all I can say is that was one of the worst pedis I ever had. Paid xtra to get the antiage pedicure and was done in 20 min.  Didnt do any scrubbing and the massage was like 1 minute. Owner didn't even care when I showed him that my feet wasn't even soft. Stuff is unfriendly.  Never coming back !","useful":2,"funny":0,"cool":0},
{"review_id":"3YDKI2FdSx92HGe7D6xKgw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"n-n2l3VyENfM6nr8IXAObw","stars":5,"date":"2015-09-06","text":"This place is a hole in the wall worthy of our 30 min drive there! Best Mexican food I tasted so far! Fresh ingredients super flavorful.  The shripadilla is an explosion of flavors in your mouth its pretty amazingly tasty!!! Tacos are excellent! Great music , service and the lady that cooks is the bomb!!! She is super friendly and will do whatever you want ! I can't say enough about this place! We will be regulars!! My kids love the homemade horchata and ending our meal with tres leches, flan or sopapillas!! YUM!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"UEg-wPbqru5s_mXttXmvfg","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"iAKEqmYnttz54EmcQ1xhAg","stars":5,"date":"2013-08-01","text":"Took my almost 6 year old today to try out the summer camp session , what a great surprised when I walked in the door 15 min before it was over and see all the kids including mine soo happy , dancing playing and the staff was super cool playing and dancing and helping each one of them do all the activities !! I will definitely bring her back , she asked me to please sign her for the camp!!! Well done my gym glad I found this place!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"CLiQ1n7hxrb5bnVF2YVkuQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"lPZ6RQ_jj9xlhvLEB3c4Wg","stars":5,"date":"2016-09-17","text":"Did u know tou can do kids bday parties here? OmG awesomeeeee !!! Just had my daughters 9th bday party at the rea rd location and was amazing!!! The Manager Dawn was so helpful and great to work with !! We arrived and it was all set up, 10 girls made their own pizzas and took them to the oven to bake! Service was great Joe was our waiter and he was so funny and patience with the girls!! We loved it!","useful":1,"funny":0,"cool":0},
{"review_id":"cFgWbOc7LOeCz8JWhGlyqw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"ExtP8z3SVyut_RICc9i_DA","stars":5,"date":"2013-05-15","text":"We tried this place fOr the 1 st time last Saturday,we did take out so I don't have comments about ambiance but man the food was fresh and delicious!! We had lamb , chicken and beef kebabs, it was tender and very well seasoned, the Fatush salad was yummy and the best babaganush I have had in ages!!! Hummus was good too and the falafels were super tasty, overall we loved it and definitely coming back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"t_TckBjtU5MsvSqB-HvUyA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"ofTjkad-MksyUyQ4IDNazQ","stars":5,"date":"2013-08-26","text":"Wow we just discovered this ice cream place and its amazing!!! We had great service and the ice cream is the best I had I a while so creamy and delicious , I would recommend not to add toppings ice cream itself its the star ;) and they make ice cream sandwiches with any flavor u want!!!! Mommy can't wait to be back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"7B6Y5kFrJ8aaxdxYr5wk2w","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"DjteMpT6cxZ7TGRm0Y8nQg","stars":5,"date":"2012-03-08","text":"We had a great experIence , the waiter was super nice and helpfull, the kids chicken fIngeRs were delicious and so was the chicken pot pie! Salads and soup were fresh and tasty, also the poppy seed little munchkins were yummy!!!","useful":0,"funny":0,"cool":1},
{"review_id":"-AOfBOWkwJad0g-XYVvGaw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"iYT30UPGmLdmTRaAKz0Vvw","stars":5,"date":"2017-08-06","text":"Best banh mi and pho !! Love this place it's soooo good and it's the real deal! Affordable super tasty Vietnamese food!! Yum!!!","useful":0,"funny":0,"cool":0},
{"review_id":"ejSJMuglg2gnWTZcA-XwCA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"ccOWcUok20CEui7AM8B7Yg","stars":3,"date":"2017-10-29","text":"I'll give it a 3 of a 5 because they are always out of sizes and store is a mess , hard to find stuff, we love old navy but have to do most my shopping online to find stuff","useful":0,"funny":0,"cool":0},
{"review_id":"9qTfAaOyoaCX5nH_ETHKKg","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"01fuY2NNscttoTxOYbuZXw","stars":5,"date":"2012-03-18","text":"Wow what a surprise!!! Great ambiance the music rocks the service was outstanding !!! We got there at noon and there was a line with more then 30 people waiting !!! We had the crab puppies yum highly recommended , the rest on the food was also good but crab puppies were the highlight of the meal!! The servers were super friendly and helpful , we will be back!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"G-LUMDgl5GZiFj6ytjF1PA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"qC9ivAdl47BcZdlbW7ffLg","stars":4,"date":"2012-05-30","text":"We were pleasantly surprised with the sushi rolls , fresh salmon and dragon roll were great so was the tempura appetizer was a great deal, my daughter had a side of fried noodles with chicken she loved it! I have one complain about the green tea, it was so weak and came from a tea bag, expected more at a Japanese place. The sesame chicken is not your average it's tonkatsu chicken with the sauce on the side, I happened to like it, not so great the tonkatsu sandwich my hubby was dissapointed with it. The ginger salad dressing was way to strong like pure ginger blended but the sesame dressing was delicious!! They really need to get bigger tablecloths or none at all, they were wrinkled and didn't cover the whole table, uncomfortable too. The service was ok , will love to see the host smile at least once :) overall we liked the sushi and will probably do to go next time instead on eating in !","useful":1,"funny":0,"cool":1},
{"review_id":"puZutfUxdB_yRYWgx-uYjg","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"DS-sQwogthl-JQIME2CcCQ","stars":1,"date":"2012-10-06","text":"So unprofesional !!! Stylist are always late, yes its cheap but you dont know what they gonna do to you! The students look like They dont want to be there most of the time!!! Will never go back!!!!!","useful":4,"funny":0,"cool":1},
{"review_id":"rI4P_zCimwxnZP-pTmBT-g","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"a0Jm-rlHOKk_1fm4hzxskg","stars":5,"date":"2013-04-26","text":"Best Chinese restaurant in Charlotte !!! To start we were welcome very nicely p, the server and host were super nice, to start you must order some dumplings!!! They were amazing!!! All the dishes we ordered were great honey chicken , sweet and sour chicken, pineapple shrimp , and shrimp chow main!! We also had a fried banana and ice cream for dessert that was great!!! Will definitely be back!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"GQLcTLTRATBODcWPclUOIQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"gv8hshEMasuoJoFGdmk3jg","stars":5,"date":"2013-08-26","text":"This place it's amazing , great prices, super fresh food and delicious , real Mexican sopes , carne asada, tacos , tostadas tortas all great !!!!","useful":0,"funny":0,"cool":0},
{"review_id":"t7nkkxb1bvx0BAAtoPCVFA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"aw0Jgk3mTWbjj0rX5Q_Psg","stars":1,"date":"2013-01-05","text":"We were there Xmas eve for lunch, I'm pregnant and had a prosciutto sandwich craving, there was only one customer and us and they old us no sandwiches on Xmas eve!!! What??? Easy way to loose a customer :\/","useful":0,"funny":1,"cool":0},
{"review_id":"HU8t5LWhYKBukfAD0zJNRA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"LKuzbx5Yt3yqiokUFdjVhg","stars":1,"date":"2012-03-08","text":"we were so exited when we saw the menu , we did order one Chinese one Korean dish but when we got home we got the wrong order and it wasn't even yummy , not sure if we will give a second chance :(","useful":0,"funny":2,"cool":0},
{"review_id":"6M5k51KZD71ZExcDxf1QRA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"f_IQ80PAHE9qpjsWMABO2A","stars":2,"date":"2012-03-18","text":"We were on the mood for Greek and decided to try this place even the outside and the ambiance is soo outdated, always looks closed from outside. The food was ok, not great the Greek salad was not impressive it didn't even have onions the chicken was tasty, the meat kebab was dry and unseasoned but the worst part was the service, we where there at 7 and they close at 9:30 pm but as soon as we got our meals, we where not even half way into the meal they asked us its everything ok? Do you need anything? We said we are great thanks so they gave us the check???? What ??? There was definitely not a line waiting at the door , we were 2 tables on Saturday nite and didn't offer dessert or coffee we love baklava but not, we just got the check. Paid left and won't be back!!!","useful":1,"funny":0,"cool":1},
{"review_id":"9S4beHOONypFP1Lyj4vRoQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"w5gvpOg8X-v4uqvb3tB0HA","stars":5,"date":"2017-01-31","text":"Hidden gem in indian land sc!! We went to check it out and bow we are hooked! Best variety of infused olive oils and balsamics out of this world! ! All glutten free yummy baked goods and a ton of drinks to choose from!! The service was superb! !!","useful":0,"funny":0,"cool":0},
{"review_id":"qmjaxD_oUMvAubqiXLO4cg","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"zL_qwA1JgRPgI-LNewP1Ew","stars":2,"date":"2013-04-26","text":"We wanted to try this place for a while and finally made it, mm not so amazing as the reviews I have read , may be I'm a Japanese food snob because its in my blood ha, but I though it was just ok, not impressed by sushi, Korean food was good we had the triple grill and it was the best deal in the menu I also think the size of the Mix tempura was soo tiny, one little broccoli , one slice of zucchini , 2 small sweet potato and 3 shrimp, why not just give al least 2 of each so 2 can share??? Service was just ok, one server was alone and no one helping her , it was a week day and there where at least 5 tables, I was thirsty half of the time I was there , asked 3 times and finally got a drink :\/ I feel bad for her but I needed a drink!!! Haha hope you all have a better experience!!","useful":0,"funny":0,"cool":0},
{"review_id":"iZbYsn4BmSRnSLHraxFcHQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"BpEEAmWJSl-XHBeVQt2ybg","stars":4,"date":"2012-05-07","text":"The food was very good, definitely will come back!!! We just move in the neighborhood and decided to try this place ,the bento box was huge and delicious , the salad was fresh and dressing was yummy. The tempura was great, the honey chicken was crispy and flavorfull my daughter loved it!!!","useful":1,"funny":0,"cool":0},
{"review_id":"C9WMhAvqR_GIyhLK8jZhkw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"YOy1tOiMMOkrCQ4mO2i3eQ","stars":5,"date":"2017-08-06","text":"What an awesome experience, food was delicious and service excellent !! Pastrami , chicken and waffles fries all the food was homemade and so yummy! All the servers and host were friendly! We will definitely be back!!","useful":0,"funny":0,"cool":0},
{"review_id":"J_mvVKdl7Ep46F0_7r9PiQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"H-PmFfqAzQtWTS0XeWC_lw","stars":2,"date":"2016-08-22","text":"I was so disappointed after reading reviews.  We ordered a gyro wich was good but the french fries were super soggy and oily.  The salad was so slappy cut huge and had 3 little squares of feta cheese then the grilled chicken I added to it was gummy like they microwaved after was grilled and sitting there. It was pretty gross dry and chewy.","useful":0,"funny":0,"cool":0},
{"review_id":"ZqfZlVTn4NqYkwcd-8m3tw","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"zDPVRMN6PJhD34RYhiySgw","stars":4,"date":"2017-10-29","text":"Pleasantly surprised with the food , tacos were delicious, beer was cold . Service was ok, our waitress disappear at one point but she made it up giving us fresh hot chips to go with our left over guacamole haha\nWe will be back! Taco Tuesday for sure!!","useful":0,"funny":0,"cool":0},
{"review_id":"AVufcRZ5BbknHNylvCNKhA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"BX4HheOcR7sdGLvFrBXy2A","stars":5,"date":"2012-06-05","text":"The pizza is awesome!!! The garlic knots off the hook!!! Service so so but who cares after that 1 st bite!!! Never had anything else on the menu, but pizza is great!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"B8OigiOWqtJYT3PvJmnBkg","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"h6f3QbR0n0fpS2Tu9MJJTw","stars":5,"date":"2013-04-28","text":"We went with a big group so we go to try lots of plates, the service was great and food was super tasty, pad tai highly recommended !!!! Pineapple fried rice delish, the shrimp appetizer was crazy good, so where the spring rolls and summer rolls!! Will definitely be back!!!","useful":0,"funny":0,"cool":0},
{"review_id":"DkBQiE54_jaBryOxNiJk3A","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"FB2iUwS4-LMLBQVyLZmZfQ","stars":2,"date":"2012-08-23","text":"We ate there yesterday and all I can say is the food was ok, average no the best Mexican I ever had but good, the real downfall for me was the waitress , bus boy was good and quick with chips and salsa but other than that service sucked!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"HBxj3aKfQo3gEtO3SQS-LA","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"CiYamRWo4h61K81MojTeFA","stars":2,"date":"2012-11-04","text":"This place needs some cleaning!!!!!! We tried it because of the great reviews , the buffet was gross, the hibachi chicken was not bad, but just eating it in that dirty place wasn't pleasant.","useful":1,"funny":0,"cool":0},
{"review_id":"oSNrxFvyDRTjNWmGy0TPoQ","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"XcSQqYKoOma5rfrZISSMBA","stars":1,"date":"2017-07-30","text":"horrible customer service, the legal department does nothing, they change the person in charge of a property weekly. Nothing good to say, stay away from this company\n\nUpdate ,, someone from the company reached to me thru here asking for my contact info which I sent and NEVER heard back lol this company is a joke!!!","useful":6,"funny":0,"cool":0},
{"review_id":"zr5L2OEa6FUtLpHkyMxy-g","user_id":"KKgHnDVFe8y5F7BI7njrFg","business_id":"V-GKJwamXPIxSwecZdcPYw","stars":2,"date":"2012-11-09","text":"This place has the potential for 5 stars but not as is today!!! We live 5 min away and after reading the reviews we were soo exited to try a place where we could became regulars, we walked in and the place looks super cozy and nice , here is one star!! The music was amazing , there was live music and was really great!!! That is my other star!!! The service was the worst I had n a long time, the waitress was careless , never checked on us, plates were Piling on our table, my husband got a bacon cheese burger, she forgot the bacon and didn't even said sorry, the burger was aww , nothing great , we had fried calamari , was blend and we didn't even get a wedge of lemon they advertised is served with on the menu!! But it was so hard to get attention from the waitress we were done before she came back. I had the chicken Parmesan , and for what I read on the other reviews I was expecting it to be good, pasta was overcooked , chicken was soggy and took me 10 min to get the waitress to bring me Parmesan cheese, and when she did she slammed it on the table like she was angry she had to go grate it or something!!! And last of all, the garlic knots sucked!!!! They brought 4 out for a table of 3 and they where ok, a little heavy but fresh, we asked for some more and I think they were from the day before reheated, it was steal . Well all I have to said is I won't be a regular here, and they need some management checking on the staff because service was terrible!!!","useful":3,"funny":0,"cool":0},
{"review_id":"cPZgybaQoMvYfgfObMYcpA","user_id":"mYQPUzQXGmAxnCBsXI6btg","business_id":"R0iz7n80-mDo2_uL_Q5ANg","stars":5,"date":"2016-12-01","text":"Amazing service! The bartender knew his stuff about any bourbon, beer,or wine we asked about!!","useful":0,"funny":0,"cool":0},
{"review_id":"fAYIXdFWHQYCO3ao8dq1LQ","user_id":"YSeDV_7L41tu2VFGlCpNYg","business_id":"gTaD9vJp04nFJBWyX7eK7Q","stars":5,"date":"2017-03-27","text":"I just chaired a fundraising event for a wonderful Scottsdale charity, Foothills Animal Rescue and it was our first \"gala\" at our new headquarters.  I found Classic Catering on the web and looked up their reviews on YELP, which were all excellent.  After talking with Joe on the phone, I felt confident that I had found the perfect caterer ! He immediately offered to come out to our center with his daughter Denise to discuss the layout and finalize the menu.  He was the only caterer I spoke with , to offer that!\nThis past Saturday was the event , and it was fantastic! Denise, Joe Jr, and their team did an amazing job! The set ups were gorgeous, with flowers and color coordinated linens and beautifully presented food. Our guests raved to me about the quality and selection of foods and the beautiful dessert table.  Their staff were hard working , friendly professionals, that engaged with the guests in a lovely manner.  I can't recommend them enough and am delighted to know that we have found our \"go to\" caterer for our events. Thanks Joe, Miley, Denise, Joe Jr and your awesome team!!","useful":2,"funny":0,"cool":0},
{"review_id":"VrwUlhy7uQ4GzvnByzAWOQ","user_id":"xKaefWOp4iCq-LvXAIxnDg","business_id":"eB7fjnO87_qNPFU5JJUx-g","stars":5,"date":"2017-04-18","text":"they were able to squeeze me in between there busy schedule. it was a pleasant experience. john. helped us out a lot. this location doesn't have a drive threw but i don't always need one. great bank coming back for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"Smvtc0Br4QitXzlF3R1QiQ","user_id":"xALw9dDwevd06mpSWhLhmg","business_id":"MuC-DZku5o45QefA0tJquw","stars":5,"date":"2012-04-24","text":"I have gotten my vechicles serviced here on many ocassions.  Excellent staff and great service!!!","useful":1,"funny":3,"cool":0},
{"review_id":"IalzTCwmDIIRu7RydMaUcg","user_id":"sreDEUoT6peIM1QdZEbg7A","business_id":"hqjBvbNvrAp82Av1RXvkyA","stars":5,"date":"2015-06-18","text":"Rachel recently assisted my husband and I with our home purchase in the cleveland area. She was great at the knowing the area as we had just moved to ohio. \n\nRachel was great throughout the offer process which for us was a little lengthy and had some hiccups. She offered us solutions and options during stressful times and was spot on with communication. She was always on time and was very easy to get ahold of. I would certainly recommend her for your home buying\/selling needs!","useful":0,"funny":0,"cool":0},
{"review_id":"zi53arQN8x3ORPgRiiGTzQ","user_id":"sreDEUoT6peIM1QdZEbg7A","business_id":"IMWyxjhlrlitZvt-4GLo3g","stars":5,"date":"2016-09-23","text":"Lisa recently helped my husband and I with our newborn son. She is amazing with babies and in general. She was a great help in easing us into parenthood and helping us with proper baby care. She also an amazing person just to have adult interaction with when you are a stay at home mom and craving social interaction!! My son loves Lisa, he would fall asleep upon her arrival almost every time. I would highly recommend post partum doula services from Lisa and her team for first time parents or any mothers that are worried about post partum life.","useful":1,"funny":1,"cool":1},
{"review_id":"j49Y0a7ze4ZcZ_Tz_VRoCQ","user_id":"sreDEUoT6peIM1QdZEbg7A","business_id":"1py-uoSzigNPyo5HaTkdTw","stars":5,"date":"2016-09-08","text":"I recently worked with Briana for my 6 week old who was having latch issues and causing severe pain. She was helpful is providing some pain relief and next steps on how to improve the situation. She referred me to chiropractors and other professionals that could also help with our latch issues. Briana certainly knows her stuff and I would recommend her assistance if you are struggling with breastfeeding.","useful":1,"funny":1,"cool":1},
{"review_id":"Q-kcYWI5iQUOVNY7eBykpQ","user_id":"sreDEUoT6peIM1QdZEbg7A","business_id":"2oEXQryBIq6uFpbMWt7mAA","stars":5,"date":"2017-01-02","text":"I used womb wellness to find a birth and postpartum doula. They were both wonderful- Margaret and Lisa. Additionally I see jolynn for massages and she is wonderful. All the ladies here are extremely knowledgeable about women's bodies and the pregnancy\/postpartum experience. Would highly recommend for any of their services.","useful":0,"funny":0,"cool":0},
{"review_id":"8IQnZ54nenXjlK-FGZ82Bg","user_id":"bJmE1ms0MyZ6KHjmfZDWGw","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":5,"date":"2015-12-04","text":"I really enjoyed their food. Went there for the 1st time today for lunch and ordered the Onion parmesan soup, chicken pesto sandwich, and a Belgian Marguerita. I like the fact that his lunch menu isn't too busy with a lot of different selections. The service was awesome. My only gripe would be it took, for me a little to long to bring out my husband and I starter. But I say it still deserves 5stars.","useful":1,"funny":0,"cool":0},
{"review_id":"e3jvT-uUf0UtDrjfnAbwkw","user_id":"OqWWcrmQm3ZGhVXi55ve6Q","business_id":"AgumeejSSVoJ0Bdr5Iguww","stars":5,"date":"2015-06-25","text":"The place is new and clean. My favor is the house special noodle dish. The wudalang pancake is a must-try dish. Looking forward to try the braised brisket hand pull noodle next time. Will be back for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"AQ0herMG1CtDUBs5xJrwwg","user_id":"jq7u_noGXz8juZ5Rz0y_RQ","business_id":"NF0H-HFJOK6R8fkhYkFuzw","stars":5,"date":"2015-03-10","text":"Firebirds. It was in a word fantastic. The service and the food were above board. I will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"Zte3Abt0yoIC47JArWwp9g","user_id":"ns8_iRMmjQZXvFz1t6XQAA","business_id":"QDtK6vrE0DTDrkFb_3D7tA","stars":1,"date":"2017-11-08","text":"I ordered 20 wheel studs. They ordered 19 which did me no good at all. I had to make a second trip. When I complained the young manager appeared upset and ask me if I wanted the lugs or not. I took the studs. They were the wrong size. This is the worst service I have ever received. Not because they made a mistake. But because they do not care if they did. The manager should be fired. But of course their main office will not respond. So go somewhere else   They do not hold themselves accountable for their actions. Just in case advance auto sees this my name is David McNair. I am in your system. No excuses.","useful":0,"funny":0,"cool":0},
{"review_id":"4RCPN9I83os3CVpKTtYfjA","user_id":"rC7r9GvfBm_hk3QA0_vJDQ","business_id":"EPb3FWs3mxQLUjGeMNP0SQ","stars":2,"date":"2014-12-25","text":"Meh\n\nYou know, this resto club used to have great food, which came from the AIX kitchen, downstairs. Now AIX is gone, and the food, when it eventually comes, looks better than it tastes, UNLESS you like really rich food. Like really rich. As in a thick white truffle cappuccino and a butter-like fois gras. The combination of tastes on the plate is...odd. I can understand, for example, the theory behind mixing the fatty salmon tartar with acidic apple, but, well, it doesn't work. The fois gras plate was equally challenged. The worst was their Christmas yuletide log chocolate dessert, which was essentially a stale Twinkie...\n\nOn the bright side, the decor and service was very good (apart from the slow, slow kitchen). In fact, this is one of the only restaurants I've been to where the waitress waited for everyone to finish before clearing the plates - very unusual.","useful":0,"funny":0,"cool":0},
{"review_id":"KBOeSOkkcY50DF9faLXQ5Q","user_id":"rC7r9GvfBm_hk3QA0_vJDQ","business_id":"dJzRwJytL1ECqYA98aHQaQ","stars":3,"date":"2011-10-14","text":"I have eaten pizza here twice. It's good restaurant with fun decor. \n\nThe food last night was decent, but I do think I could have made it at home with Jamie Oliver's Italian cook book. It's not too expensive, however, so long as you moderate your alcohol, which justifies going there. It can also be fun, with the nod to the retro decor and interesting hipster patrons an staff. Our hostess was great and the waitress not so good (didn't ask how things were until the meal was almost done, didn't ask me if I wanted another drink, etc.). \n\nThe rustic style pizzas do remind me more of true Italian pizza than one would normally expect of a North American pizza joint. The name Magpie, after the bird, is a very commonwealth reference, which may seem odd at first. It is, however, one of a number of restaurants with British references that have opened in the past year or so in Montreal: e.g. Sparrow, Lawrence, Brit & Chips, the Burgundy Lion, etc. \n\nAll in all, I will go back, but with moderate expectations.","useful":5,"funny":0,"cool":2},
{"review_id":"Vo7aQXrGAE2A85pK_WTBZw","user_id":"rC7r9GvfBm_hk3QA0_vJDQ","business_id":"FML0YqZ7dLBBC3Suap4_4Q","stars":5,"date":"2012-04-06","text":"I'm giving this sucker a 5 star because of the value. I followed much of the advice of the other yelpers and there were some great dishes at a very reasonable price. I'm coming from Montreal and you'd pay 30-50% more here for the same thing. \n\nGreat job!","useful":1,"funny":0,"cool":1},
{"review_id":"pWsaXkccL4f9DEx0Jcxl5g","user_id":"iA1ZUERD9YWDlZCiuTeNnQ","business_id":"IQLnLQYcTwCjwt_ri9dqhA","stars":1,"date":"2014-05-21","text":"Was not a fan. The service was horrible, pork was chewy and they were out of mac n cheese. The only good thing was they had Big Red on the fountain. I will not return.","useful":0,"funny":0,"cool":0},
{"review_id":"f6KaNGypMUoUe09nvCP0MQ","user_id":"yAA1wjJZSFUN-R38Zzg4Ug","business_id":"qSP6RqBJUyJRsQKTarlo6g","stars":1,"date":"2017-04-19","text":"This place looks wonderful.  The staff were great but the hotel is not focused on sleeping.   They seem to focus their effort around film crews and the after hours party.   The sound of the road could not be silenced by white noise from my iPhone even at the loudest.   And from the fifth floor we could hear and feel the music until 7am.","useful":2,"funny":0,"cool":0},
{"review_id":"b6se2aN--5xne4mrqWR-xw","user_id":"jEnL1iHNyI5tBNE_DuRvgQ","business_id":"DyYS-JKXlW2PCr_Gt5JOvQ","stars":4,"date":"2012-11-20","text":"Since I've moved to this side of town, Lucky's has become a local hangout. I would definitely recommend this place, and give kudos to bartenders like Levi (who works graveyard) that make it so enjoyable.","useful":0,"funny":0,"cool":1},
{"review_id":"DE8R659ZOLTAzjTe8zxvOA","user_id":"WsmGKwLJ_p7oJ2kah7U2SQ","business_id":"7mGZrCzGGjS95SdRtEaGcQ","stars":5,"date":"2012-06-10","text":"On a visit to Scottsdale, AZ I trusted yelp to search for a savory ice cream parlor. Yelp has not let me down! \n\nUpon reading all the reviews on yelp and how great sweet republic was, my family and I decided to try it. The Toffee Bonafi was a party in my mouth, literally! The combination of vanilla, toffee brittle, and salted caramel was a great way to end my night. My daughter got the strawberry sherbet and the taste was bursting with strawberry flavor. You can tell that it was made from scratch and no where near compares to any store bought strawberry ice cream.\n\nI wish they had this ice cream stop in California! If you are in the Scottsdale area, I would highly recommend stopping by for a cool sweet dessert!","useful":2,"funny":0,"cool":2},
{"review_id":"cjcgk28A3K0cBFfa_DvpaQ","user_id":"mmkBUUJ2gWdynQSSmJRz0A","business_id":"Yf8PiUFYTgeN-NVSgrntPQ","stars":5,"date":"2017-04-13","text":"This place is great! I love Taylor, she does an amazing job on my nails every time! I'd highly recommend going here. I get acrylics w\/ decals, rhinestones, & designs every time and they always get compliments for the next 2 weeks!","useful":1,"funny":0,"cool":0},
{"review_id":"_c46022qeGRiExovXqqJwA","user_id":"ky_t499G75f-PlCTR-zOAw","business_id":"Hccfs7jKPf8dKbwzW7grbA","stars":5,"date":"2014-05-27","text":"I tend to keep my cars a long time, well past the 100,000 mile mark. Usually car repair facilities hand me page upon pages of \"essential repairs and maintenance repairs.\" I was pleasantly shocked when I was told not once but several times, \"No, you don't need that. No, that's fine too.\" I have found a new friend in the car repair business!","useful":1,"funny":0,"cool":1},
{"review_id":"iN83pl9IPEo6Ay8g_G5g5g","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"vwQvDIb_F7AqwCPaQhHrwg","stars":1,"date":"2012-10-29","text":"If you are looking for an over-priced dorm like atmosphere then this is definitely the place for you.  Loud parties, underage drinking, and plenty of side-stepping the puke left in the elevators and resident floors from above mentioned guests.  This place is treated like a toilet and management has done nothing about it except raise the rates.","useful":17,"funny":8,"cool":0},
{"review_id":"rmNRYXZgYNbx2kK_YrNXpg","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"8e1drk0-pBwSYsy8te5oMQ","stars":1,"date":"2013-07-24","text":"Had a TAG repaired. About 6-8 months later it broke again. I took it somewhere else and learned the replacement parts that Naughton used weren't factory TAG parts. They also told me there were fingerprints all inside the watch. Terrible quality for a $300 repair.","useful":1,"funny":0,"cool":0},
{"review_id":"dppUk8zOt4Nu5L8kyeCN3w","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"834GwOgJpBTg8j5dWe-hrg","stars":5,"date":"2013-07-24","text":"I went in to get a TAG repaired. A screw had come loose that was stopping the movement. It had been previously worked on at another store at the Biltmore. Dave took a quick look at it and fixed it in 5 minutes. No charge. Very friendly and will definitely be back.","useful":1,"funny":0,"cool":0},
{"review_id":"VPGiZ9_vhmDotTc_lC3vbA","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"82XiVba4oiPXvLKelbW6FQ","stars":1,"date":"2017-04-10","text":"Went and sat at two open seats at the bar. One of the managers came over after we ordered a drink and said \"can't you obviously see these seats are taken\". Very rude. We moved to a different seat at the bar. The bartenders apologized profusely and bought us a round of drinks. No one ended up sitting at these \"reserved seats at the bar\" so the bartenders moved us back. The bar staff was phenomenal. Manager was a complete tool. Let me know when you let him go and we'll be back for drinks.","useful":0,"funny":0,"cool":0},
{"review_id":"JfmCyrTA6vlR6AZwhb2Gkw","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"kwEBCIp18Xi9ETDn_WIQaA","stars":1,"date":"2017-06-17","text":"Almost a 40 minute wait for one pad Thai and nothing else. The staff didn't seem to care and just said \"we have new kitchen staff\". Will not be back.","useful":0,"funny":0,"cool":0},
{"review_id":"JkIuN6vh8Ruli_6uVgWpjw","user_id":"jGHwrEKNp1_mUatUbV8Hsw","business_id":"oIzIo6okfNdNiTJ50UnKiQ","stars":1,"date":"2009-01-27","text":"Terrible service.  I brought in a suit jacket and pair of pants.  The pants came back more wrinkled than when I brought them in and they ruined my suit jacket.  It looks like they put the suit jacket in the washer and dryer and now it has permanent little wrinkles all over.  Employees didn't try to fix it and said it would have to wait for the owner and they didn't know when he would show up.  After a day of waiting I took everything to a new cleaner to salvage.\n\nI would rather pay a little more to make sure my clothes come back in one piece.  Not worth it.","useful":2,"funny":1,"cool":0},
{"review_id":"SeVs65kbNgXKdJseIOLqDQ","user_id":"TzMaWE5wJLYsES2kT32HqA","business_id":"p6YA-77VayfRsm-QdBlUJQ","stars":5,"date":"2016-10-12","text":"WOW! I get a lot of readings but this is the first time that a psychic has told me specifically NOT to ask any questions or even to give any back story, NOTHING. You just sit there and Lilly just rolls right into your reading giving you LITERALLY every answer you need without asking a single question. The price is every fair and she gets pretty specific. At the end she will answer any questions you have left, but she hit every single topic I wanted to cover so I didnt even have anything left to ask at the end lol. Did I mention how FUN it is to talk to her??? I feel like I want to be her best friend lol, very easy going and funny! THANK YOU LILLY for your patience and guidance...talk soon xoxooxox","useful":1,"funny":0,"cool":0},
{"review_id":"E9Lo--DbLiYUCsC3ugiCyg","user_id":"O0CQYDI5_Pz6rqfvjs3IdA","business_id":"Todrg1F247iuDIm784XHfA","stars":4,"date":"2011-06-04","text":"One of the better Chinese restaurants out west here.  Spoiled by East Coast Chinese food (where you can actually get duck sauce)  Restaurant is clean and owner & staff are very friendly & accommodating.  Love the Sesame Chicken & Orange chicken.\nActually used them for my daughter's graduation party last year and they were great; lots of food at a great price.\nCheck it out.","useful":2,"funny":1,"cool":1},
{"review_id":"7v2xyXXa-zu5328nWZH54Q","user_id":"O0CQYDI5_Pz6rqfvjs3IdA","business_id":"9iujAdopmNdLzjejKROD5Q","stars":5,"date":"2011-07-07","text":"I've been searching for a \"bar pizza\" that I grew up on back East and Luna comes the closest.  I've been here 5 years and have tried just about every pizza around and was very disappointed.  Luna helps me make it through to my Boston visits.  The chicken wings are also very good.  It's a 15 min. ride but worth it.","useful":1,"funny":0,"cool":1},
{"review_id":"OzpS2tX0pU8FmnlRazNMzw","user_id":"O0CQYDI5_Pz6rqfvjs3IdA","business_id":"nFVqjh-JCOuV2Uci1ZfJ_Q","stars":5,"date":"2011-06-18","text":"1st time visit. Read several positive reviews and thought it would be a good place to take my daughter visiting from Boston. I had the pulled pork and it was excellent. My wife had the fish (MahiMahi) & shrimp and loved it. Both daughters had chicken, orange & lemon pepper, and were very happy with it. Very generous servings. Sides of crab rangoons, cabbage & sticky rice were all very good. Ordered the seafood soup w\/crab, shrimp &scallops. That will have to wait for home...too full   \nWill definitely be back & spread the word","useful":4,"funny":0,"cool":2},
{"review_id":"4Yt4Qcyy4q2mPrOqhsx2wQ","user_id":"fEQLJFU-2gD6V5NZLpYjqQ","business_id":"Wrjz_LLqFy692cyXhIO0jw","stars":2,"date":"2014-12-27","text":"Food is very good and atmosphere is great.  Waitresses are very friendly but the service is terrible.  I have been here several times and the service has never been adequate let alone good. Not sure why but maybe management needs an overhaul. It's a shame about the service.","useful":0,"funny":0,"cool":0},
{"review_id":"9-W9rQ1oeL1N_50_lfLWPw","user_id":"fEQLJFU-2gD6V5NZLpYjqQ","business_id":"qTBT6UDQP5-GSrB-UTn5CQ","stars":4,"date":"2014-10-31","text":"Cod and potato fritters are excellent...plantain is delicious. Had the squash and corn soup...great for a cold and miserable night.","useful":1,"funny":0,"cool":0},
{"review_id":"FWxxSStizjiM_DYOYnAABg","user_id":"te_uAux7-xHfFlvkCI7JXg","business_id":"ZCgl2bvwgDHyCcfQxb7JYg","stars":4,"date":"2016-05-09","text":"My daughter purchased a Deep cleaning for my house since I have been very busy and tired lately. My husband just had open heart surgery 2 weeks ago and between the hospital, having him newly home and working I have not had the energy to clean much.  We have 3 Akita's so just keeping the hair up is enough for now, Sara came and was very up beat and we discussed what needed to be done.  She asked if I wanted anything else that she might have missed and I asked for the arcadia door to be washed down from the dog nose prints and dust.etc.  She did it right away and I definitely will be contacting them again for future work. I also will be asking for Sara!  She even organized my piles and put away our shoes etc. Fine work!!!","useful":0,"funny":0,"cool":0},
{"review_id":"kk5XUA2IBSc4pvk91Ul6Ug","user_id":"te_uAux7-xHfFlvkCI7JXg","business_id":"YJ_nOxPvADRDVRpNi3WSCw","stars":5,"date":"2014-08-18","text":"We had to relocate my young granddaughter's family birthday party at the last minute late this afternoon.  We had a total of 19 people that Red Robin at The Happy Valley location had to accommodate at the last minute.  Every one was so nice and Jared and Ray our servers could not have been more pleasant or helpful.  They even sorted out separate bills for each group in our family. We will definitely be returning there for more family functions!!!!!!!\nThanks again\nVicki S.","useful":0,"funny":0,"cool":0},
{"review_id":"wENY1TNXUDfPV2GuczmT3Q","user_id":"F4e0vvKnPh9Btbf_1_CagQ","business_id":"YmOWkved7K8q3eXgf4NNnA","stars":5,"date":"2016-02-14","text":"I love this place. Always fresh food and a great place to just have a nice breakfast or brunch either alone on the patio..or at the bar with as few friends. My absolute favorite is the french toast with strawberries...yummy","useful":0,"funny":0,"cool":0},
{"review_id":"tYRZAyPHuDZRAKMOzgLt7A","user_id":"F4e0vvKnPh9Btbf_1_CagQ","business_id":"E3kx4NIp3Y9QQBeINgS1lw","stars":5,"date":"2016-02-14","text":"Excellent service! Came here after a horrible expierence with another car dealership earlier in the day. Brady was the only guy there with alot of customers in the office. He met us all in a timely manner and assisted with questions with ease and confidence. I never once felt as if he was too busy for me eventhough he had a pavked lot of people. I test drove two of his suv's he had on the lot and decided right then and there. He ran credit on me and bam we were rolling. Gave me different payment options and scenarios all while staying honest and even standing his ground a little when negotiations came:). I like that about him. It was fair. I got what i wanted at the payment i wanted. Period. No hassel no hidden anything very professional. He even stayed lateer than usual to make sure i was satisfied with my purchase being the night nefore valentines day needless to say his wife im sure wasnt happy about this..lol but he took the wifely lashing so to speak to make sure i was taken care of and happy. Being scared of car dealerships and salesmen..Brady is a glimpse into how my grand daddy use to say car deals went. U go in tell em what u want and they made it happen and u were happy. Salute to u guys!","useful":1,"funny":0,"cool":0},
{"review_id":"q9tEX0a80o1FClz1vyt-yQ","user_id":"F4e0vvKnPh9Btbf_1_CagQ","business_id":"pxpLVCInGwLClbnwJwxInw","stars":5,"date":"2016-02-14","text":"Love it.  One of my favorite things is the hummus. Yummy. The staff are all very nice just a cool place to relax and unwinfld after a long week.","useful":0,"funny":0,"cool":0},
{"review_id":"VdAoDPVy7xBYokbc3gFPEA","user_id":"F4e0vvKnPh9Btbf_1_CagQ","business_id":"4VPWMuEVNptSGDiLvM39WA","stars":1,"date":"2016-02-14","text":"Rude and very unprofessional... Where should i start? I went with a friend to see about a car they had listed on craigslist. I had spoken with \"mike\" over the phone the day before so upon arrival i felt comfortable. This soon changed. Mike comes out while looking at the car..no greeting nothing just a stare.. I inform him that i was the person he spoke with. He rudely asked me if i needed financing or would i be able to pay cash. That shouldve been the warning..he made us feel very uncomfortable and i told him this...he softened a bit so we continued..My intention was to pay cash for the vehicle at first but having little credit i decided to make a larger down payment and just do financing...this upset him. When we asked to take the car for a test drive we were told that we had to be approved for financing first...and that a test drive was out of the question... (Keep in mind the car was a 05 with 190,000 miles on it. Cash price 5900). Another buyer came in and asked about the same car. Mikes partner told him no problem let me get u plates for a test drive. Right in front of us... When we asked why they could test drive and we couldnt mike and his partner screamed at us and said verbatim: I DONT WANT TO DEAL WITH COMPLAINTS IM CALLING THE POLICE GET OUT OF MY OFFICE..shocked we asked for our paperwork back of which he gave us another buyer's app and dl copy...we left. Went to a car place right around the corner and were treated much better. Better deal same truck 60,000 less miles..lower down payment and monthly payments. Be ware of the false reviews.. These guys will treat u like dirt if u question anything they say. Shop around many car places over there. With nicer salesmen and lower miles","useful":6,"funny":6,"cool":0},
{"review_id":"9zZrExT3qlnykYThKBq72A","user_id":"z8UqofS9mgnyP1x8wvtE8g","business_id":"d48RG4PGGtz4qy_wmNVKIg","stars":5,"date":"2014-10-14","text":"My first experience with eyebrow threading was at Rhamba and it was amazing! My eyebrows turned out good and perfectly framed my face with virtually no pain. The actual spa was super cute and clean. Iv gone back a couple times now and every time I leave happy with my results. Everyone I encounter there is extremely nice and helpful. I encourage anyone to try them out!","useful":9,"funny":0,"cool":0},
{"review_id":"TG2oDfzLyMvZNGa30q5e0g","user_id":"2wql6vxuZUIeI214i2Kf7Q","business_id":"6qJPWV34kpdC8TUWEZvWOQ","stars":4,"date":"2015-04-04","text":"We were hungry for steak. Stopped in and ordered the 14 oz. ribeye- medium rare. It was cooked to perfection and came with Parmesan mashed potatoes and grilled asparagus.  Our server Tracy was attentive and friendly. We will definitely go back. We sat in a comfortable booth in the bar area.","useful":0,"funny":0,"cool":0},
{"review_id":"GtTpInv9BbBj7fy8fvU61A","user_id":"2wql6vxuZUIeI214i2Kf7Q","business_id":"LSXqMO2B0nD3gt-GX_5a4Q","stars":3,"date":"2015-05-01","text":"Food was good (my wife had the bleu cheese burger and I had the  Margherita pizza), service was prompt and friendly. Noise level too high to have any conversation. Might try it again but not on a Friday night.","useful":0,"funny":0,"cool":0},
{"review_id":"U49l92q_m2_JfFM59bD33w","user_id":"2wql6vxuZUIeI214i2Kf7Q","business_id":"Z4y3LZlCjv4xnZ8xOpYf_Q","stars":5,"date":"2016-02-17","text":"Coming from the NYC area originally I am always looking for great pizza. A bit strange to order and pay for your pizza before you sit down but the pizza is the best we have found so far in the Charlotte area.","useful":0,"funny":0,"cool":0},
{"review_id":"v_ZaAcAJmWQw9xWgRitslQ","user_id":"2wql6vxuZUIeI214i2Kf7Q","business_id":"c-l4nDPZcEwapEiV-Xf08w","stars":4,"date":"2016-02-17","text":"Came here with a large group expecting the restaurant to be a Mexican restaurant.  Pleasantly surprised at the wide variety of menu items. Tried the fig and goat cheese pizza and found it to be outstanding.  The entire party enjoyed their meals and I heard no complaints.","useful":0,"funny":1,"cool":0},
{"review_id":"TL3O0Ci-o2qGF2mGzaH2hA","user_id":"2wql6vxuZUIeI214i2Kf7Q","business_id":"ZF0OSC01jVimSjAo9PdoEg","stars":4,"date":"2015-10-13","text":"Prompted by the great reviews my wife and I went for lunch. Service was prompt and friendly. We tried the corned beef and pastrami sandwiches on rye.  They were okay but nothing to rave about - especially the pastrami which was not as tasty as we expected. We are both from NYC and believe we know what good pastrami should taste like. Won't be back.\nAbove review was erroneously posted and not meant for this deli. Went there today for the first time. Food was very good. Service prompt, friendly and attentive. Definitely will go back.","useful":1,"funny":1,"cool":1},
{"review_id":"CQWbctPSnuzwYuSYljM-MA","user_id":"PbccpC-I-8rxzF2bCDh8YA","business_id":"DXlDzOcpdUE_F21tok0fgw","stars":3,"date":"2016-07-10","text":"With great expectations I found Ka to be a bit of a disappointment as the show did not live up to my expectations. I give the show three stars:\n\nFirst star is for the opening sequence. Just prior to the show the audience is treated to some acrobatic antics, and even a comedic reminder to stow the electronics. Paired with helpful staff in costume and character helping you to your seats, and a breathtaking stage to take in sets your heart pumping for a great show. The opening scenes don't disappoint. The martial arts in the first couple scenes are amazing to watch, and soon you are treated to a boat scene that is also fun to watch. \n\nSecond star is for great acrobatics with the \"death wheel\" (you'll know it when you see it), and some more cool action sequences to close out the show. \n\nThird star is for the stage, which is a character all to itself. A massive monolithic stage that is on some sort of hydraulic mechanism that allows it to move, rotate, and lean in amazing angles further shows off the athleticism and skill of the actors as they use the stage to show a variety of talents. The stage can also be lowered completely out of site allowing for cool aerial acrobatics as well. \n\nNow for the last two stars that this show lacks. First off, you better listen carefully to the few lines of narration at the beginning of the show because that's all you'll get. While it does give the outline of the plot I still found it extremely difficult to follow the story line, and in fact there were several scenes that seemed ponderously slow and even repetitive without advancing the story in meaningful ways.  You never really understand why the enemy attacks, but they attack again and again, and normally in the same repetitive fashion. There are also two scenes, the beach and the shadow puppets, that are awkward and feel completely out of place. \n\nSecond, with the exception of the first 10-15 mins and 5-10 mins towards the end, the show's acrobatics seemed to be just \"OK\". There were \"wows\" and \"oohs\" and \"ahhs\" in each section there, but often there were only a few and sometimes featured too early in a scene and repeated then without the same wow factor. With such an impressive stage and hints in the pre show antics of ways to use the stage and even the space above the audience in amazing fashion, the show itself left me with the sense that there was so much more that could've been. \n\nAll in all I was entertained but I can't say I enjoyed it, especially in comparison to other Cirque du Soleil shows and expectations. It's worth seeing for the stage if you can get a good price, but be prepared to feel like you over invested 90 mins of time. In another city and without the CDS mystique it would probably be amazing and awe inspiring, but in a Las Vegas world where \"Too Much\" is often \"Just enough\", I felt like Ka was just a little lacking.","useful":3,"funny":0,"cool":1},
{"review_id":"XY42LMhKoXzwtLoku4mvLA","user_id":"PbccpC-I-8rxzF2bCDh8YA","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":5,"date":"2016-07-06","text":"A complete Vegas experience. We arrived right at opening and we were seated immediately. The decor was very cool with comfortable chairs and variety from table to table. Our server, Christopher was fantastic, and he and his assistant, Mehdi, were both prompt, full of humor, and very attentive. \n\nChristopher had several recommendation but when my wife and I were both interested in the Fish and Chips, he suggested that we order one with their dessert add on special and share. We agreed and added a mixed green salad. \n\nThe salad was big enough for three and was very tasty. The fish and chips were delicious, the beer batter very flavorful and the fish itself was cooked to perfection. More than enough again for two of us and we still had dessert to go. \n\nThe sticky toffee pudding to close things out was amazing. Probably the best dessert we have ever tasted and again more than enough for two people to share. \n\nThis is Las Vegas and everything was pricey but for the value of the food and the experience and the absolutely amazing service from Christopher and Mehdi, this was probably the best money we have spent so far on our trip. \n\nA fantastic experience and I highly recommend it.","useful":3,"funny":1,"cool":2},
{"review_id":"8kFPfhRA1JH7wb1vCF_SZQ","user_id":"ZmFQ4WnfHrwVWtoN_gVLkw","business_id":"INUsvJhd-im_nS0VEIKH7Q","stars":5,"date":"2017-07-02","text":"I recommend this store to everyone, staff is super nice and very prompt, they attend customers very quickly and explain everything in details, I always deal with Matthew, all I can say he is excellent.\nThank you \nRita D.","useful":0,"funny":0,"cool":0},
{"review_id":"u4vCuJth7ZvJduK7R3kpJg","user_id":"ZmFQ4WnfHrwVWtoN_gVLkw","business_id":"Yo8ODT7aFMM2xKUd1yaBVw","stars":5,"date":"2016-12-11","text":"We had an amazing dinner at the Bella Vita ristorante at the District . We are from Italy and were delighted when we found an authentic Italian restaurant which is also ran by Italians . The GM Nicola is fantastic he does a great job at giving the place great atmosphere with live music on the patio . So happy we finally found a bit of Italy right here in Henderson . The staff is mostly Italian and the dishes are delicious . We will be going back very soon . Thank you for the great evening . Grazie Rita","useful":0,"funny":0,"cool":0},
{"review_id":"r0MCQw7M-3K9nCAy1O1JrQ","user_id":"ZmFQ4WnfHrwVWtoN_gVLkw","business_id":"c1KKUUgRbsQCKR-ZqSaegQ","stars":5,"date":"2016-01-20","text":"Thank you Roxanne for taking care of my annulment in such a professional way,\nI would recommend Mr. Louis Schneider without hesitating at all. He is very honest and professional. His staff is outstanding.\nThank you again\nRita D.","useful":0,"funny":1,"cool":0},
{"review_id":"2mEi0ZOX2jgbS4CARXvz-A","user_id":"DaEhGg6WbCc9nFTchzjYeg","business_id":"i3o52-kSqR3s_HmJn02WHw","stars":5,"date":"2014-03-27","text":"I found iFixAZ through YELP! What a great place to take my computer for a total clean up job of all this MalWare that invaded it. The service was timely, cost totally fair, staff and CJ amazing. I will take all my fixes for my electronics to CJ. Lifesaver, especially because I didn't have to go through some outfit like BestBuy for the repair. CJ offered my some great tips as well to keep the system clean and what to watch out for. Thank you so much!!!","useful":0,"funny":0,"cool":0},
{"review_id":"MYbOqciD1XL1IEpuoHeNlQ","user_id":"DaEhGg6WbCc9nFTchzjYeg","business_id":"CTwEWgU93Es5Gycjym3GiA","stars":1,"date":"2014-07-03","text":"I have been waiting for 2 weeks for the owner to call me back with a quote for the job I have. Never a phone call back. Do not use this company if they simply can not call you back!!!","useful":1,"funny":0,"cool":0},
{"review_id":"PUQVp105LwNHwJjGLGneEw","user_id":"QhS3_vBlKhGpb6RVa2IAGA","business_id":"cHcYk5bJn3Nh9ARJjQVq8Q","stars":5,"date":"2017-09-12","text":"I went in not expecting much, but Turkish Grille blew me away. I got the Chicken Kabab plate and it was delicious. The Chicken was perfectly cooked with a nice char on the outside, but still juicy on the inside.","useful":0,"funny":0,"cool":0},
{"review_id":"DpcySJYFU7_YE9Yrvnz-NQ","user_id":"QhS3_vBlKhGpb6RVa2IAGA","business_id":"jDZJsIyc3jXjcTtJk_p8ZA","stars":3,"date":"2017-09-17","text":"Good food, just a little over priced considering it's proximity to CMU. It will scratch that itch for Chinese food if you have it, but the food isn't anything special. Their Crispy Orange Chicken and Broccoli Beef are my go-to entrees.","useful":0,"funny":0,"cool":0},
{"review_id":"i_tgdRRknztWSLECyGZ_wA","user_id":"cm7Fu3kzHO-rOr0T8C2jRg","business_id":"NW2flon_30tSRIDGxdjnnA","stars":5,"date":"2017-08-16","text":"Thirteen of us ranging from 2 to 67 saw David Goldrake, and all of us loved the show.  Half price tickets told us it was the most family friendly show on the stip and they were right.  Kids got in free.  The magic was one of the best I have seen. Posed for a picture after the show with all 13 of us.","useful":0,"funny":0,"cool":0},
{"review_id":"TUI1AiHrhgAiy8FTKvwnig","user_id":"xGv-HkcPQpJaoFyccVQUYQ","business_id":"bc0JkwwJT_9qMx4AHcgYhQ","stars":4,"date":"2015-10-26","text":"There are very few Caribbean restaurants that carry \"Stew Peas\" daily and are consistent with their portions. The staff are courteous and conscientious rather than rude and discouraging.  It may not be the fanciest but it's staff, meal choices and availability put it in a very select group.  Surrounding establishments carry similar menus, albeit you can only get certain items on special days.","useful":0,"funny":0,"cool":0},
{"review_id":"WnxHiYhboSi4bQ9E2geOag","user_id":"4mios8h6p7lFqgVD5_P47w","business_id":"cZxjPy4OrqJKscmCypDFoQ","stars":3,"date":"2014-04-18","text":"A local establish that has a loyal following. No real bar for cocktails but ample beer selection. \n\nI was impressed with the servers knowledge and courtesy. It's hard to find great service and this is a four star service parlor. \n\nTwo styles of crust. Thin or original. I would order original for take out because it holds up better. Thin crust is NYC style thin crust. \n\nThis is not Papa Johns quality and the prices reflect the difference. Large cheese, large pep, sausage, onion and mushroom combined with a family size salad was 61.00. Not cheap but the quality is clearly different. \n\nPizza was above Papa John's and below lombardi's. \n\nSalad dressing (house) was excellent. \n\nOverall, I would go again but wouldn't drive out of my way for the pie.","useful":1,"funny":0,"cool":0},
{"review_id":"3n0GUjHDzTuoG8bXZjey2Q","user_id":"4mios8h6p7lFqgVD5_P47w","business_id":"vz8HFGsITt6aj-nyXkAEFg","stars":3,"date":"2014-04-21","text":"Here's the deal. This is a four star Mexican restaurant if the kitchen isn't jammed. I rated this three stars based on the food quality when busy. I love the polo fundido dish and the guac is above average. Pork stew and melted cheese apps are four to five stars. Go when it is slower and you will be happier.","useful":0,"funny":0,"cool":0},
{"review_id":"rWtzdXrpdKXZxQ-Iy991OQ","user_id":"r87OEtfubjYl1bAccMbJEA","business_id":"Ghn4p2M-TsuSXORZxO73Yg","stars":5,"date":"2015-01-19","text":"Best burgers in town. Great place to watch a game. Tvs are well positioned. Don't forget about breakfast. Best deal around.","useful":1,"funny":0,"cool":0},
{"review_id":"jg6v-_3DOkQ6Fl0B35LbiQ","user_id":"iSshwQY8Oz2IUxx7KLH74Q","business_id":"oDxvrLYe5SiQKdJlGhheoA","stars":5,"date":"2014-07-27","text":"After being bitter and insulted over being hit up for a cover charge on one Saturday evening I am adjusting my review. This is our local bar and I have had many great times as the service is always good and the food even better. I took my frustration out in a business that didn't deserve it. Great food and people . Not a fan of the new Saturday night Dj\/cover but to each their own there is a place for everyone. My apologies for my anonymous poor review this is a way better place then I gave them credit for. Perhaps a breathalyzer on my yelp account would be helpful","useful":0,"funny":2,"cool":0},
{"review_id":"OIGb8dVpZ2gufauWetP_WA","user_id":"Cpn-ith-K5pZdWWfF4fTbA","business_id":"D9Y1JQtSbattMvqfGnneow","stars":5,"date":"2014-07-16","text":"Great place to get your phone fixed!!  Got my phone fixed here and it's working fantastically!  Great price and they even price matched it! Thank you!! Got it fixed in less than an hour :)","useful":0,"funny":0,"cool":0},
{"review_id":"-OoPaBKLo69DrvlUtUEb4w","user_id":"GSwB8h-tmytkkp-Lufvqdg","business_id":"k9b96JXlNewj36ddrce9Jw","stars":5,"date":"2015-09-20","text":"The Thrillist is the greatest vegan thing EVER! So many great and tasty vegan options! Drove all the way from LA for their food! Really cool people!","useful":0,"funny":0,"cool":0},
{"review_id":"rXlWdwOzdYlMLgTEskkfxQ","user_id":"TRPPe82MlSMGH8oeNeyk8w","business_id":"8jHLEXfoy3Q9TdvJYvtWvg","stars":1,"date":"2015-10-25","text":"Very pricey and not much food for your money.  We were fed piece meal and everyone finished what food they were given before the entree was finished.  Won't go here again.","useful":0,"funny":0,"cool":0},
{"review_id":"XIifhGYqLw6zA7FnIYdLJw","user_id":"TRPPe82MlSMGH8oeNeyk8w","business_id":"jS3U9iEGnJY7j5oT9iDN7A","stars":1,"date":"2016-09-24","text":"Very expensive for the amount of alcohol in the margaritas.  Very small portions for the money.  Terrible service.  Waitress never checked on us.  Go to Arribas!","useful":0,"funny":0,"cool":0},
{"review_id":"Jf-NYLaQvjHGodZVLPOsow","user_id":"qHraRAhQgiM539HexB1LYQ","business_id":"rBDGlL3eC4v-2HBZ4cWRVQ","stars":1,"date":"2011-09-30","text":"Our food had pieces of a broken plate in it. The owner came by and was unconcerned as \"these things happen\", The food was OK, but this type of service was inexcusable. Stay away and find somewhere that cares","useful":0,"funny":0,"cool":0},
{"review_id":"hvPVDRbzeIiuDiO-jLGBwQ","user_id":"BcQ_EVMNjnj6h2XCt5-CZA","business_id":"_iGvLfEsqDwPUxRUAe6tUw","stars":5,"date":"2016-08-01","text":"On a scale from 1-10 I'd give Heather a 20! My 2016 Z06 Corvette's check engine light came on while I was on vacation in Las Vegas and Heather and her team obtained the special ordered parts that were needed to fix my car and got me back on the road within a couple of days. I thought my hometown dealer was good, but Heather and her team did a great job keeping me informed every step of the way! Thanks for an awesome job and providing me with excellent service!","useful":0,"funny":0,"cool":0},
{"review_id":"94JABibjTLz1e3CA3lez4Q","user_id":"U91u0uV4-KUtRkBHNty9Aw","business_id":"UhEhLSJrPRoiYWdHfJQxfw","stars":5,"date":"2014-10-27","text":"What an amazing experience! The facility is very clean, the staff friendly and the prices so reasonable. \n\nI was in town and came in to see my old hairstylist from New York City, Laura. She's AMAZING! I travel a lot in the area for work and try to stop in town whenever I can. She immediately puts you at ease with her warm demeanor and is just so passionate and skilled at her job. She knows what I want without my really having to say it and goes above and beyond to make sure I am happy with my hair. She's very patient, kind and understanding - will keep following her wherever she goes! Great experience!!\n\nAlso, there is a really cute coffee shop next door called Lola's - their iced coffee is great!!","useful":0,"funny":1,"cool":0},
{"review_id":"OVmKEm4LkT0Ofonw0k5Fmw","user_id":"L_nj_ImhaBvWAVMGFolJlA","business_id":"X-jY75pXPS-qFp8gRBPaqw","stars":5,"date":"2012-05-01","text":"This place is amazing! I went here for the first time because I read great reviews and it was fairly close to my house. There are so many different types of burgers that you won't be able to find anywhere else because of their unique combinations. I had the Highway Man and it was stacked so high I could barely finish it. I also had their root beer float because I was craving it :)\n\nService was also very helpful. I didin't see the special burgers on the menu or what each one had, and the server took the time to explain each one to me. Very friendly.\n\nOverall, it was an amazing experience and I'll definitely be back again.","useful":0,"funny":0,"cool":1},
{"review_id":"jGTVDu7_bGZZgFsLf2WLGQ","user_id":"L_nj_ImhaBvWAVMGFolJlA","business_id":"eDtxNY64sFYGjeFPJYlZ6w","stars":4,"date":"2012-05-01","text":"My first time trying chiu chow food was at this restaurant. It's close to home and convenient for me.\n\nI found the food to be delicious and had this recommended to me by family friends. I got take out last time, but I'll probably try dine in next time.\n\nBTW, I've been to Dynasty Cuisine in the Markham region and their set meals were amazing. I found this deal on HungryBuy.com:\nhttp:\/\/hungrybuy.com\/york-region\/deals\/view\/dynasty-cuisine","useful":1,"funny":0,"cool":1},
{"review_id":"mo5lOJeYzOKPejDq2ys9kw","user_id":"L_nj_ImhaBvWAVMGFolJlA","business_id":"Cs8BaiKkyNU6mzxq9nTsmg","stars":4,"date":"2012-05-01","text":"I go here all the time for dinner with my family. They recently renovated to expand the location and it looks amazing. One of the best chinese restaurants I've been to in terms of decor and food.\n\nI usually get the Eel Fried Rice and the Crab Salad...can't remember if those are the exact dish names.\n\nDynasty Cuisine at Commerce Gate is pretty good too. I found a deal on HungryBuy.com for a full meal. Check it out.","useful":1,"funny":1,"cool":1},
{"review_id":"7CS_H1y-aswophkO4mjBcQ","user_id":"MHOA4hbTrUn6-YdB2EMEPA","business_id":"XPtDU14nu36LWt7_UagI9Q","stars":4,"date":"2015-01-11","text":"WOW!  Food is awesome! Service is a little awkward but if you could look past that or just get take out. ... you'll get some great dim sum for a cheap price!","useful":0,"funny":0,"cool":0},
{"review_id":"leucG2CmtkrcDoAkVBquhA","user_id":"MHOA4hbTrUn6-YdB2EMEPA","business_id":"pxn8oiRtZnnEP-ejmExQmg","stars":4,"date":"2015-01-21","text":"Haven't been here for a year.  But always order a steak.  The steak always is cooked perfectly and reasonably priced!","useful":3,"funny":0,"cool":0},
{"review_id":"0XgPIRs9vJlJfA7lQsa1-g","user_id":"MHOA4hbTrUn6-YdB2EMEPA","business_id":"f8c3JLJWp6xmGUa3DEV1_w","stars":5,"date":"2017-11-14","text":"Just came by to check the menu!  But as soon as I walked in; it presented a great atmosphere!  All were kind! They gave me a all day breakfast menu, along with the Lunch Menu.  I had the steak and eggs, it was made just the way I like it!\nI'll be back to try some more!","useful":0,"funny":0,"cool":1},
{"review_id":"SLPY1tzhidvBCEvatkLpzA","user_id":"VRIa3BDaTeIjezcNApM3DA","business_id":"NCu9a32XQzzWqj10JwKQ-g","stars":5,"date":"2014-12-04","text":"Wow! This place was great! They fixed a puncture in my tire in less than a half hour for only $10! I'll never go anywhere else! Thanks!","useful":0,"funny":0,"cool":0},
{"review_id":"s9M93Zdvofq_KUmlpto6WA","user_id":"5LNJ3afnKGfcgmUvBtpnNg","business_id":"_SnjiEQQ-3rJo1yLZYE_NQ","stars":4,"date":"2013-08-05","text":"Had a great bday celebration, waitress was great, and the music was awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"qeaSuGYJMZ881N1RdbMeiw","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"sH9aI3xg-POBMp8R-kSQZg","stars":4,"date":"2014-06-12","text":"Very good lunch here. Really enjoyed the lasagna and Veal Parmesan. Their marinara is very good.","useful":0,"funny":0,"cool":0},
{"review_id":"N3qTZKHSMO5bCHMyMmQvyA","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"w7BHkgxJS7ncuXep905GLQ","stars":4,"date":"2012-09-12","text":"It's good chinese take out - plain and simple. I have tried a variety of things and I'm never disappointed. For takeout places it's 5 stars, but I'll leave it at 4 stars because it is a take out place :)","useful":0,"funny":0,"cool":0},
{"review_id":"6-5TLJb8HZmiZFq_hb3Vrg","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"csOR4N615Qc94jSP0tLftA","stars":5,"date":"2013-10-14","text":"Love this place! From the hot and sour soup to the sushi this place is awesome. The prices are great and so is the service!","useful":0,"funny":0,"cool":0},
{"review_id":"wtxIoTb8jwV7YpBjzwtVtg","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"z5y2HCST-6ME_mrlpXG0UA","stars":4,"date":"2013-08-23","text":"The coffee was pretty good. Was nice to see a local micro roastery.","useful":0,"funny":0,"cool":0},
{"review_id":"1WYTDR53niK359QAUuE-WQ","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"O7_rXHN_-cFp0TgiMaNulw","stars":5,"date":"2017-04-13","text":"This is an absolutely amazing restaurant. I come here all the time for lunch and get the various noodle bowls which are large bowls of soup. You can customize the soup however you want and as you try more things you get more ideas on how what you like. First timers should try something like Tom Yum, Hong Kong or Kung Foo bowls.","useful":2,"funny":1,"cool":1},
{"review_id":"IboPpX3hqHLZCHh0qVBCOA","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"DkS8Fwy5nsbOUlbU9sITLQ","stars":4,"date":"2012-07-25","text":"The food and atmosphere are very good.\nThe lunch prices are very reasonable and the dinner scene is worth the additional price.\n\nThe carryout is an excellent option as well.","useful":0,"funny":0,"cool":0},
{"review_id":"SC80pLZ64r7UygrTfzm83Q","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"KBGoTNvOoV3ixc8zaaMHnw","stars":5,"date":"2016-04-18","text":"Fantastic place! So far we've had fish and chips, curry chicken and the Guinness stew pot pie. Always accompanied by a Guinness with black current syrup. Truly a great find and makes one miss Ireland. Great for large or small parties, patio seating and great service!","useful":2,"funny":0,"cool":1},
{"review_id":"pBTFFoduZohd3cGS7C5ZNw","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"42TGx8KatGNPCi7rwOzazg","stars":5,"date":"2014-09-03","text":"Verde is simply amazing. The Latin fusion with the Mexican cuisine is a brilliant idea. I love the nachos Verde and the pobellon criollo. The black beans, shredded beef and plantain remind me of Cuban flavors I had growing up. I highly recommend this place.","useful":2,"funny":0,"cool":1},
{"review_id":"X6aow2LlhkR8TYR0CJIi_w","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"FEDJzSlA34EJ8ypqMWgVew","stars":4,"date":"2012-09-12","text":"When you come here, stick to what matters and don't deviate.\n\nThe brisket and ribs are fantastic.\nThe pork is very good.\n\nThe chicken is not my favorite\nThe sides are pretty good overall - Mac n' Cheese is very good.\n\nHush puppies are excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"GaWHyhCGTufHXv-xLp9YwQ","user_id":"Z6SH2-Jv17L63_6QM5Ut7w","business_id":"la0ScEQYua2O01Mdau8Xkw","stars":5,"date":"2017-04-09","text":"I'm not sure why this location has such a low rating but this location is great. Yes you will wait and yes you'll pay more than your other local choices like Waffle House but it's certainly worth both expenses.","useful":1,"funny":0,"cool":0},
{"review_id":"k6Flaz5A-QtoIfOB-DvSYQ","user_id":"baOxT2vQlnjOtBwLjJWybA","business_id":"ydqbNz2sHENV9XOElwyAYA","stars":5,"date":"2017-07-31","text":"Amazing food, amazing service!! I would recommend Blue Adobe to everyone!! The portions are large and the menu has so much to choose from!! The live music Saturday night was great! We usually go to the one in Mesa, but I will go to this location from now on!!","useful":0,"funny":0,"cool":0},
{"review_id":"7BrvnT_reaWIBOO7rjQKcg","user_id":"baOxT2vQlnjOtBwLjJWybA","business_id":"ISgEtF4G4UtyEsc5ed6Rhg","stars":5,"date":"2016-11-29","text":"I would recommend Jacqueline Hanna Photography 100 %. She was amazing! She made sure to go around to everyone at our function and ask if anyone wanted photos taken! She was so easy to work with! I would definitely use her again! Thank you so much for capturing our parents 50th Anniversary party!! CANNOT wait to see the pictures!!","useful":0,"funny":0,"cool":0},
{"review_id":"laYzW9lqoATEJB3ImDeCew","user_id":"baOxT2vQlnjOtBwLjJWybA","business_id":"59KZei-ara5-h85b9r0HDQ","stars":1,"date":"2014-12-06","text":"Made an appointment for my 16 year old daughter to get a manicure. While there she asked to get her toenails painted black for a dance. The lady asked her if she wanted a pedicure she said I just want my nails painted black! They took her to the chair and put her feet in water. The lady asked her if she wanted her heels scrubbed she said no, just my nails painted black. So all said and done, they put her feet in water and put lotion on her legs and charged her $22 for a pedicure instead of $7 for a paint! I complained and he said she got a pedicure, I repeated that she only asked for her nails to be painted and he said that could mean many things not that she didn't want a pedicure and that Im just mad my daughter spent more money. I said he took advantage of a teenage girl and he said I should know better then to send my teenager there alone!!! Refused to give my money back! I will never go there again and will make sure everyone I know never goes there!! TERRIBLE WAY TO TREAT A CUSTOMER!!! And they fully took advantage of a young girl!! Would not recommend this place to anyone!\n\nWOW just got done reading more reviews and I'm not the only one they took advantage of!! Seems to be a pattern! Wonder how many more people have been effected and just not taken to yelp! I have NEVER made a yelp review before, but did as soon as I got home from talking to Thang, THE OWNER no less!!","useful":0,"funny":0,"cool":0},
{"review_id":"pm2ciUHa5LQtRloIA4gYRw","user_id":"baOxT2vQlnjOtBwLjJWybA","business_id":"Kz4WS00PcqOJgxfZawk4dQ","stars":1,"date":"2016-03-26","text":"HORRIBLE dining experience tonigt!! Service was terrible, slow and unfriendly. Customers who came in after us by at least 30 min were served food before we were ( both of us ordered pizza ).  Dirty tables not bussed until customers came in and needed to be seated. Heard a customer be told there were no more clean plates... Finally after an hour and a half our bruschetta came out, but the crust was burnt terribly and they tried to cover it up with extra tomatoes. When asked if our pizza was coming soon, was told it had not been started yet!!! Told the server to cancel it and she brought us a check for our drinks!!! Paid cash for our drinks, which should have been comped in my opinion, the server told me they had no change!!  She then had to get me change from her purse. Watched 2 other tables walk out after us! Will NEVER go back!!","useful":1,"funny":1,"cool":1},
{"review_id":"HQ7U6bSOND5jBHR0alCf0g","user_id":"Xql3CgO6PmxpOv7g0OcZlQ","business_id":"BslEhCyzaQPfpHtDogb4hQ","stars":5,"date":"2014-08-25","text":"A bowling alley with great food?!?! Unheard of until I discovered Brooklyn Bowl!! The fried chicken was crispy and delicious.  The sides were amazing, I loved the mashed potatoes and greens.  I would go back in a heartbeat.","useful":0,"funny":0,"cool":0},
{"review_id":"rUStF3cw9ewnvmTfR4FCQQ","user_id":"Xql3CgO6PmxpOv7g0OcZlQ","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":4,"date":"2014-08-25","text":"Sage Fried Chicken Benedict!!! Please just order it and indulge.  It is sooooo fattening, but it is a once in a life time experience.  I loved it, but could only eat a 1\/4th of it.  It could feed three adults, but is worth it.  A must try!","useful":0,"funny":0,"cool":0},
{"review_id":"JjgFOyG77TyI95nv6B7lIg","user_id":"NPBB2LdNnFfMBFYre-1jPQ","business_id":"pFvIB18E0hsCaof3gXO22w","stars":5,"date":"2015-05-20","text":"I love this place . All the stylists are amazing and talented and the manager Trish is so sweet.","useful":0,"funny":0,"cool":0},
{"review_id":"tiyzdyUZ3foitWGwQ4XnUA","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"OMRYQihVjqqzjoNoQgyhgQ","stars":5,"date":"2013-11-03","text":"Excellent little Asian market!  They had everything I needed including fresh kaffir lime leaves, Chinese broccoli, fresh wide rice (Pad Si Ew) noodles SO hard to find, galanga, lemongrass, yes!!  The lady at the front was super sweet & helpful giving me tips for storage of leftover ingredients and finding me a vegetarian fish sauce (which was incredible!).  Even though it's on the other side of the city, I'll be back.","useful":1,"funny":0,"cool":1},
{"review_id":"pym055fq7rZY03lmwNfugQ","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"ZZegUx6pEhjglihlOgyGiA","stars":5,"date":"2015-05-18","text":"AMAZING ETHIOPIAN FOOD!!  Literally the best we've ever had and we've eaten at so many different African restaurants across the country!  It came out very hot and fresh, the owner and sweet cook in the back couldn't be nicer!  Not really situated for larger parties, there were four of us and we ate outside as it seemed easiest with the small tables.  They specialize in take out and delivery.  \n\nI wish we lived here and could visit all the time!  \n\nFantastic vegan foods and the best part is you get to choose your own combo!","useful":7,"funny":0,"cool":2},
{"review_id":"s5YbnhdUSRw0bgcKv3tZcA","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"YbKjkJCD3lcQcLSMNKglKg","stars":5,"date":"2015-03-03","text":"This is a review for Jen, the massage therapist located at Bio-Mechanics Las Vegas.  She has a great touch and a wonderful technique.  She is knowledgeable about body function and mobility and worked extra on the areas of my body that have been restricted and causing problems.  She also used a few awesome and interesting tools like silicone cups for a different type of skin rolling experience.  The pressure was perfect and I woke up this morning a little sore but can feel that the session was greatly beneficial!  Thank you Jen!","useful":0,"funny":0,"cool":0},
{"review_id":"OxsnfE6QhI8LE5vr-_imMA","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"UvRW3JBsfu71LK3MA4xgkQ","stars":2,"date":"2014-05-14","text":"I'm only giving this place 2 stars because the vegan ice cream taste deserves 5 stars.  I was incredibly upset that the lady behind the counter spoke zero, yes, zero English.  I even pointed to the item I wanted on the large chalkboard on the wall (a vegan milkshake) and she said milk tea?  I was like, \"No, a vegan chocolate milkshake\" about 6 times I tried, to no avail.  Walked out with a scoop of vegan chocolate, which I somehow felt grateful to get.  Ice cream is incredible but will never return to this location.  Will only go to Jones & Warm Springs location or S. Ft. Apache.  Shame.","useful":1,"funny":0,"cool":0},
{"review_id":"Dx_8I7RxQFQuxi1Cw3d2Mg","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"3Ag1VmOTjJGaDHme5fKzXg","stars":5,"date":"2014-05-14","text":"My carpets hadn't been cleaned in the 5 years we've lived in our house (we always take our shoes off before going upstairs) but they were just so pale and icky that I finally gave in.  Was referred by a friend and SO GLAD I was!  Our carpets look incredible and feel fluffy and amazing.  I literally just wanted to walk around upstairs all day the next day because it was so nice on my feet.  The price was reasonable too and though he was very thorough, it took only about an hour for my entire upstairs and stairs.  \n\nI wish phone communication was just a little more clear with maybe a confirmation for our appointment as well would have made me feel better.  There was a scheduling issue but he made it later in the day.  We are very happy with the service!  :)","useful":3,"funny":0,"cool":0},
{"review_id":"EQ4nBW7jaI7d40IMi01Rxw","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"r6eEOxE5ruN0oxe-z22I4g","stars":5,"date":"2010-07-26","text":"On time, friendly & professional tech.  Finau Ngata visited my home on Friday and today (Sunday) I have dead bugs everywhere outside!  This is a good thing.  :)  I had 2 referrals and heard how amazing Bulwark is, glad I went with them.\n\nTech Name:  Finau Ngata\nCity:  Las Vegas, NV\n\n\nID:  9598Y","useful":0,"funny":0,"cool":0},
{"review_id":"gnnyTPFuQXHpBc1aBunGgw","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"r-O9C7wNGUCPyNAFNdiHLQ","stars":5,"date":"2012-08-21","text":"Dr. Julie Quan rocks my world!  I've had a recurring foot problem for well over a year now.  Foot problem being improved by chiropractic care?  YUP!  She specializes in extremity care and focuses on improving your nervous system (which affects EVERY area of your body!).  She uses the Gonstead method & only adjusts the areas that need to be realigned and she actually gives you more information on how to keep your adjustment working for you longer!  All of our bodies are different & she treats you as a unique & special individual.  Dr. Quan is a wonderful, community-oriented woman who cares about your health & the Las Vegas community...who could ask for more in a doctor?","useful":1,"funny":0,"cool":0},
{"review_id":"gmlMhMeDSeXqMx3HN2en-Q","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"UV2Jt8slktGu14gLZeNCjA","stars":5,"date":"2009-11-08","text":"Great quality food.  Much better than when it was HImilayan Cuisine.  Love that we got a free good quality mimosa w\/ our weekend buffet.  Price not unreasonable, food was amazing!  Delicious chicken Pakora (like Indian chicken fingers), chicken tikka masala, tamarind rice and spinach w\/ chickpeas.  My husband is vegan and there were some nice options for him too.  \n\nWill go back again soon!  :)","useful":0,"funny":0,"cool":0},
{"review_id":"dYO6YUGdxJub4MnjOuYLsw","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"lG759ODx7tj6wbS7rYip1g","stars":5,"date":"2010-07-23","text":"Delicious food!  I normally get take out as I live right down the street and it is always done within 10-15 mins, like they say.  I've dined in about 4 times and each time it was pretty slow inside but unlike the other reviewers, we had very quick service.  Actually, my entree came out while I was still eating appetizer & soup so I was kind of sad.  lol.  \n\nI LOVE the decor.  It's not over the top, pretending like we're actually IN Thailand, but it's dark & sensual & usually very quiet, a great place to take a date.  The staff is super friendly and actually speak English too!  \n\nI am vegan (no meat, no egg, no dairy) and I order all kinds of special dishes and they never mess it up.  My favorite dishes there are Pan Fried Glass Noodles, Galanga noodle curry & Pad Si Ew.  The sticky rice is AMAZING too!!!  LOVE GALANGA THAI!!!  :)","useful":1,"funny":0,"cool":1},
{"review_id":"7CMOGAb86miCy1U8I1knPQ","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"T70pMoTP008qYLsIvFCXdQ","stars":1,"date":"2015-05-05","text":"Closing 2 hours early with no post on the door for any explanation is completely unprofessional.  Even if you just said, \"Slow night, sorry for any inconvenience\" since we drove all the way across town to go here.  Very inconsistent when it comes to the desserts and the food is definitely not worth it.  When the desserts are good, they're really good (even if they have questionable ingredients), but SO often the $7 cakes are dry.  Very frustrated with this place.","useful":1,"funny":1,"cool":0},
{"review_id":"uHh1S97xjMjIBWi8kdOwNQ","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"zoYIwHGvnglmrZD0RqhRIA","stars":1,"date":"2009-11-07","text":"The service here was the worst I've EVER experienced in Las Vegas (lived here 5 yrs now).  Not only did we end up waiting a total of about an hour before we got our food, but people that sat down after we ordered got their salads first.  I had all you can eat pasta (Tues night) $7 but they make you buy a $3 drink and I got a salad w\/ it but my husband bought the gnocchi dish for $11 and didn't get a salad?  Dumb.  They also charged my husband $1 for adding a couple of shreds of basil to his dish.  My all you can eat plate came out and it was twice the size of his $12 dish and he couldn't get more.  It was terrible!  I had the carbonara sauce and it was okay but super buttery.  \n\nFYI for the vegetarians, all sides are $3, yes, to add spinach to your dish is the same price as adding chicken.\n\nWe live right down the street and will not go again.","useful":0,"funny":0,"cool":0},
{"review_id":"M4eAOPDHqlAkgd-D9BXfTw","user_id":"1sVC_xVc9aTzyYPLL39AZg","business_id":"FtI-LMW5d2bvZGF34nDDpQ","stars":4,"date":"2010-07-23","text":"OK, first, my husband & I are vegan and are SO GRATEFUL to have this place to just \"go out\" and get ice cream.  Yes, it's expensive, but sometimes it's better to pay for health (and smaller portions) rather than go to Whole Foods & pay $5 for a pint of Almond Dream ice cream.  I agree, the flavors & sweetness can be mild, especially compared to all the processed crap w\/ crap loads of preservatives that everyone is used to eating, but fact is, they will make it however you want...if you like strong flavors ASK for more\/stronger flavor when you order it, I always ask for extra sugar in mine and it comes out just perfect.  I get Brownie Bits (brownies are vegan & gluten free & amazing!!!) w\/ peanut butter ice cream & their waffle cones are out of this world!  Rochelle & Ginger are super nice & run a great shop.  Thank you for the opportunity to pick up a treat while I'm out shopping!  Oh, and they do have reusable sheets now that you just dry erase marker your selections.  They are environmentally friendly too w\/ compostable spoons & bowls made of potatoes & corn.  :)  LOVE IT!","useful":3,"funny":0,"cool":2},
{"review_id":"NV2Ma8ngoVNoivCwcFpx7Q","user_id":"lVT_7-AR7MTWg9SHDLpEZg","business_id":"3jy3CXO6gVEat4uB-E2msA","stars":2,"date":"2015-05-10","text":"I used to frequent this place when it was in Scottsdale.  I loved this place! So on mothers day I decided to try out the new location via carryout. I called twice and got hung up on twice. I called back a third time to raise a complaint with the manager about the host Danielle ( who clearly doesn't want to do her job). The manager stuck up for Danielle saying that she was a sweet girl and that she would never do that. In the process pretty much telling me he doesn't care about our business. He could not have cared less and took no ownership. It'll be a while if ever I go back here.","useful":0,"funny":0,"cool":0},
{"review_id":"-oTd53D7nEdjWH5ycIzE8Q","user_id":"lVT_7-AR7MTWg9SHDLpEZg","business_id":"Nmfvhyxi7gruNGs_hfWc3w","stars":1,"date":"2015-10-09","text":"I waited in line for 10 minutes (I was the only one in line) and no one greeted me and\/or told me they would be with me. This place was a little busy but not overly and I could very clearly see employees just meandering throughout the garage. After I waited for a while with no acknowledgement I went next door to big o tires and got greeted straight away.","useful":0,"funny":0,"cool":0},
{"review_id":"tkVIpbr6QNoXNOE5cQ5vWw","user_id":"jYDa14HsvZnY0C3pulotYA","business_id":"GtrrBtrfZgvqGF930JwYOg","stars":2,"date":"2016-07-03","text":"We ordered 4 takeout chicken items, which were just ok to barely edible. The biggest problem was how greasy everything was... We don't plan on coming back.","useful":1,"funny":0,"cool":0},
{"review_id":"ZYa3gI8dEldJB7xcTbtNgw","user_id":"jYDa14HsvZnY0C3pulotYA","business_id":"-CfFjcCcGGDM9MVH_d42RQ","stars":5,"date":"2015-08-11","text":"Excellent Mediterranean style food, nice ambience, cool artwork on the walls, friendly staff -- I hope they can keep up the high standards.\n\nWe were a party of 5 and went rather late on Sat. night.  We got great service and enjoyed the reverse happy hour specials (try both shrimp items...) along with a range of pita sandwiches, a salad and the shrimp skewers.\n\nThe one item that could have been better was the mushroom pita, which was rather soggy.","useful":0,"funny":0,"cool":0},
{"review_id":"Fmch8SnTtbb-xxMMwd8skQ","user_id":"jYDa14HsvZnY0C3pulotYA","business_id":"ugLqbAvBdRDc-gS4hpslXw","stars":5,"date":"2016-07-03","text":"This is our go to restaurant for all you can eat sushi when we are in Vegas, and even if we're just passing through town. The variety of sushi available will satisfy just about anyone's taste buds and appetite. Our absolute favorite is the seafood salad, though. The medley of seafood and spicy seaweed will keep you coming back for more.","useful":0,"funny":0,"cool":0},
{"review_id":"j5Ixk6-4DHXBtrCCXghcPA","user_id":"jYDa14HsvZnY0C3pulotYA","business_id":"x3-d_7Bgj4sYVks1xiq8kQ","stars":2,"date":"2016-02-15","text":"Having had Chinese food in India while growing up, we went with a lot of anticipation. Amongst the ten of us, we ordered some twelve dishes, including hakka chicken and shrimp, chicken 65, chili garlic noodles with chicken, garlic pepper chicken and shrimp chop suey.\n\nThe Chicken 65 was very good, with slightly tangy pieces of boneless chicken that had a crunch on first bite, garnished with red and green bell peppers. The chili garlic noodles were tasty, but we initially thought there was a mistake with our order since we could not see any chicken in it.  On close inspection, we noticed a few miniscule pieces of chicken... The shrimp chop suey was about average, although the few shrimp were rather small. The garlic pepper chicken was neither garlicky nor peppery, instead swimming in a pool of watery gravy. But the biggest disappointment was the hakka dishes, which are a signature Indo-Chinese noodle dish.  These were completely bland, and we had to resort to adding more than a few dollops of the 6 sauces at the table to pretend we were having Indo-Chinese cuisine.\n\nWe wished the portions were more generous, like we get at most Chinese restaurants. We had to order a couple of extra entrees since some of us were still hungry, whereas we almost never can finish our food at other restaurants.\n\nThe service was competent bordering on perfunctory. One of us was curious about Nasi Goreng on the menu, but our server could not describe how it was prepared, instead steering us to a couple of other choices on the menu.\n\nOur receipt invited us to share our experience at a \"Talk2us\" link, which only produced a \"survey error.\"\n\nHaving had great Indo-Chinese food in Calcutta, Vancouver and Houston, we are still waiting for a comparable experience in the Phoenix area.","useful":0,"funny":0,"cool":0},
{"review_id":"HVwXWhT1cGOyKBcYOyJdzQ","user_id":"Fka2SzLBhGfqpFyvvVrHPA","business_id":"3sOS8wKatd_Uoa9VEJHhrw","stars":5,"date":"2017-09-04","text":"Still rest as ever.  Same great food st the new ( any only) location at Campbell and 16th Str.  In a sea of change this place never disappoints me since the 70's st Christown Mall.  Can't go wrong with the Pastrami with Swiss on Onion roll.","useful":0,"funny":0,"cool":0},
{"review_id":"iZWrN2fSZx5j6isJefJKDg","user_id":"Fka2SzLBhGfqpFyvvVrHPA","business_id":"YZc10f4jCXM0-TdkxXl7Wg","stars":5,"date":"2009-02-16","text":"Gave this 5 stars, but it's NOT fancy or upscale at all, just so you know that. What it is: Excellent food (see the other reviews), service (very pleasant & attentive, desire to please), & an excellent Value! \n\nI had chicken taco's and my gal's beef (marinated) taco's were even better. (Soft tortilla's were hand made (they said) as ist all the food. Rice and beans were good (which for me means not fancied up or spicy). The Salsa was amazing!!! I always said you could make millions if you could get the roasted tomatoes and chili flavors w\/o the burn\/pain (I'm sure you can ask for the hot stuff if desired). Well they did it.   Margaritas were excellent (unfrozen w\/ salt) Owners were most gracious named ,\"Beth and Bill\" (not the radio personalities). \n\nVery relaxed atmosphere (jeans are great as goes for all of cave creek) w\/ a few small TVs around over on the bar side at least (no sound heard, which I preferred). \n\nMariachis (probably just because it was Valentines) were a nice touch for the occasion, ... bit louder then I prefer, but they were very good and had the tact to not come over to our table since we didn't make eye contact. Nice voices and instrumentation to be sure. \n\nHandi-capped friendly from what I remember. Private parking on the side was pleanty for a fairly busy Sat. night (w\/ more out back). Light gravel made for no dust, and wasn't too thick so I'd guess wheel chairs wouldn't be a problem. \n\nNot sure about reservations as we stopped on a whim, but with immediate seating on Valentines, I'd estimate no problems getting in,..least till the mobs at El Encanto find out about this place. :-) \n\nAm looking forward to one of their breakfasts.!\n(would have probably gone with 4.5 stars if able.)","useful":1,"funny":0,"cool":0},
{"review_id":"ygaFzFNNrdpU99Fgqt-N_w","user_id":"t7eIZE0eTj0BcJ1BkbsfDw","business_id":"y3YRUsh8FVih0AhYLx-DWA","stars":5,"date":"2016-04-19","text":"Excellent experience with these guys.  Chris, Mike and Russ were all very professional!   We hired the game bus for my son's 9th birthday. They came early early to set up and were ready to go before scheduled time.  The bus was a huge hit and really kept the kiddos entertained!  Would definately recommend Epic!","useful":0,"funny":0,"cool":0},
{"review_id":"THOwvrgiLR1qS7Qp0Z_MXg","user_id":"t7eIZE0eTj0BcJ1BkbsfDw","business_id":"cJwRHjq28zuXxol1eYIMnQ","stars":1,"date":"2016-06-05","text":"You won't find worse customer service only followed by full retail prices!  No greeting or acknowledgement.  We had to hunt down the teenage salesboy who was completely put out by our request for different size shoes.   Go anywhere but here. Sports Authority,  Sports Chalet. ..anywhere.  My experience is that the competitors actually want your business... unlike Dicks (fitting name)!!!","useful":2,"funny":0,"cool":0},
{"review_id":"vC3IhlIsaaW8gqEvugOAdw","user_id":"t7eIZE0eTj0BcJ1BkbsfDw","business_id":"wqdMZhUYIM--xodxXUkOYg","stars":5,"date":"2017-12-19","text":"Best new car shopping experience!   No creepy high pressure sales. Employees are friendly and helpful!   On top of it, I feel like I got a great deal on a CX5, which I am loving!   I worked with Sergio on sales and Bridgette on finance. They were both awesome. Highly recommend this dealership.   \nOn a side note,  we stopped by Berge Mazda first.  I apparently parked my car in the wrong spot and got some under the breath comment from the sales rep, who said he would send someone out to help me. We waited outside for 10 minutes....no one showed so we left and drove straight to Horne.   We were greeted by Sergio right away who couldn't have been more sweet or helpful. Definately made the right decision! \nThanks again guys for the great experience!","useful":1,"funny":0,"cool":0},
{"review_id":"ptPBo75iNZhvglwXItmSzw","user_id":"t7eIZE0eTj0BcJ1BkbsfDw","business_id":"GpVk87Zw6IGXq5pPcuF7Sg","stars":5,"date":"2016-06-05","text":"Recieved my first Brazilian wax from Michelle today.   She made me feel very comfortable and did a great job!  Happy costumer!","useful":0,"funny":0,"cool":0},
{"review_id":"yiHtJKRvWz_zI9YcJMKlpg","user_id":"VEHccrkpl1O_dGAn_d_TTA","business_id":"PfSW2cTJyx2-q6T39sevow","stars":5,"date":"2016-09-02","text":"Great whisky selection, wonderful tasty food and a kick ass staff!!!!!!!!!!! Always bring out of towners here for a great time","useful":0,"funny":0,"cool":0},
{"review_id":"G-7mZq8TYKeUsEma9vy4jQ","user_id":"VEHccrkpl1O_dGAn_d_TTA","business_id":"oyCRc4Zs2RkKOHy9IAa3wg","stars":5,"date":"2016-07-04","text":"Excellent breakfast food and staff!!!! Great for a Sunday of chilling and drinking! The wait staff was great and friendly and really on top of drinks.  The food was served fairly quickly with local fresh ingredients. We will be going back in the future to taste more of the menu","useful":0,"funny":0,"cool":0},
{"review_id":"RoId58G97D6faz8ymwGPsg","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"G-cbWSrIddcCFUZqRdKvCA","stars":3,"date":"2012-04-03","text":"Pros: Environment, waitress service\nNot so con: Asian Chicken Sesame Salad\nCons: Not know their Wi-Fi password \n\nIs it a good restaurant for kids? No\nIs it good choice for big groups? No\nIs the parking lot enough to accommodate the customers? No parking lot\n\nAround 12:00pm after I found that the St Lawrence market does not open on Mondays, I started to find a good place to have lunch on Old Toronto and I discover the The Corner Place. When we arrived, we could sit on any place because the place was not crowded.\n\nThe service was friendly and nice and the salad did not take so much time to arrive. But, at least, for me, when I arrive at place where the Wi-Fi is available I like to have access. I tried all the variations provided by the waitress and none worked. On the end, she asked me to look for one of the customers and ask him how they connect. Very bad negative point for me.\nOverall, the salad was okay. To be true, I prefer the Asian Chicken Sesame salad from Panera Bread. The dried noodle was very hard to eat and most of the salad components were cut in chunks instead of niece pieces to eat with a fork. What makes a mess while you are eating. Well... I did not get excited with the food this time. But I intend to come back here again next time that I visit Toronto, I notice other dishes on the menu that called my attention.","useful":0,"funny":0,"cool":0},
{"review_id":"LvH7v2Ip-tDwU50r4zan4Q","user_id":"95KCaXFJEGla4AK7ETBmWw","business_id":"rJHMVTCjCHXfZ7AboUL5Qg","stars":5,"date":"2011-11-26","text":"Pros: Private parking lot, burger, service\nCons: \n\nIs it a good restaurant for kids? Yes\nIs it a good choice for big groups? Maybe\n\nThis is a past experience review. On Thanksgiving Day around 8:30PM, we did not have so much effort to find a place to leave our car there. The hostess was very friendly and nice and directed us to our table without any need for waiting. Obviously the restaurant was almost empty due to the holiday.\nThe dining room was huge and there is a sundae bar that we got very tempted to eat there after the dinner. The waitress was very nice and friendly and was always checking our table to see if we needed something more. Because we were craving for a burger, my wife and I decided to build our own burger.\nOverall, the experience was fantastic! The burger was big and juice and not greasy and the fries were delicious too. This is the type of restaurant that I will have as a first option when I go back to the Pittsburgh, PA again.","useful":1,"funny":0,"cool":0}]