[{"review_id":"ReS-gOUbRMfWw12BolXPBA","user_id":"qS1mact4Iv5m-jWM2H1sdg","business_id":"9WMBTUjzDFZf2KcBqNc2xw","stars":1,"date":"2015-04-16","text":"Had dinner here last Saturday night and do not plan to ever return.  Our meal started out with the Shrimp Rolls which came quick and very hot.  They were really good and we all enjoyed them a great deal.  After eating them we were very excited about the rest of our meal.  We ordered and then waited just under an hour for our entrees!  Our server, who was very unattentive, never came to the table to explain the delay.  I finally had to flag her down and ask what was going on in the kitchen  Her response was \"the kitchen is very backed up with take out orders\".  Well, what about the diners sitting in house waiting for their meals?  She never asked if we wanted another drink or water.  Again we had to get her attention and ask for water.  Finally, when our meals did come, they were a big disappointment.  We ordered medium spice and got no heat at all.  I really think they never added any spice to the meals.  The Raad Na was very, very salty.  The saltiness just overpowered the dish.  The Pad Thai was too sweet and the noodles were too chopped for my taste.  We left feeling very disappointed and vowed never to return.","useful":1,"funny":0,"cool":0},
{"review_id":"O2-JJ5R6ld82rqDFQmYm6g","user_id":"qS1mact4Iv5m-jWM2H1sdg","business_id":"lBPes5kPthKicPVhhE-bfg","stars":5,"date":"2014-07-24","text":"We ate dinner here on Tuesday evening and had an absolutely wonderful meal!  Ordered the shroom french fries which were very, very good but oh so filling.  One could eat these as a meal and be totally satisified.  We tried three different burgers and they all were very, very good.  I had the burger special of the evening and it was cooked to perfection.  After all the fries I could only eat half but it was just as good warmed up the next day.  There is no children's menu but our server was very helpful in making suggestions as to what would be good choices for the kids to share.  The portions are quite hearty, so there certainly was enough food to share.  They ordered the wings and what a good choice that was.  I never order wings as they are usually to fatty or greasy for my taste.  Not the wings here---they are the best I have ever tasted.  It was like eating very good fried chicken.  They were huge and once again, cooked to perfection.  Service was very good and very friendly.  We left full and looking forward to a return visit.  It is always a treat to discover such a good place to eat!!   Can't wait to go back.","useful":0,"funny":0,"cool":0},
{"review_id":"-uC27d3Cd_xXZNtUqpLhSw","user_id":"dzUvPqRnUDnvcMX2FQJmGA","business_id":"AsLqWQH86sie035iDtQPOA","stars":3,"date":"2017-09-29","text":"I had the #17 combination with shrimp. The shrimp was cold and the sauce had too many onions and peppers. Be sure you pay with cash as they charge an additional fee for using debit card.","useful":0,"funny":0,"cool":0},
{"review_id":"CaB7M8gLBWjVNYj38mjIIA","user_id":"-zhTh4mkrSI8reoluiEa2Q","business_id":"FLMxWQO-ckCQmGZhU9OQgw","stars":4,"date":"2015-10-22","text":"Rio Carnival World Buffet has been a favorite of mine in Vegas. Food selection is superb.  The most memorable experience I have is meeting Sal the maitre d. He is happy  always no matter what a mad house the buffet area becomes. He has great memory for the regular repeat customers and he has an amazing staff. I would go to the buffet just to see Sal. You will agree once yoy have experienced his style of customer service. The food is great, service is superb and there is great customer service.","useful":1,"funny":0,"cool":1},
{"review_id":"PIzTtajTsgNV1y-QzD2P0g","user_id":"Sulhm3VnA_kcu6Y6WI-5_A","business_id":"ovtlrcsVRlgZZQUlHs_ovw","stars":1,"date":"2015-01-14","text":"The quiche Lorraine was the worst I've ever eaten. It was runny, greasy and looked like it was barely cooked. I won't ever go back.","useful":0,"funny":0,"cool":0},
{"review_id":"WeRGg7n4DMiwXSqapkKH_w","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"awI4hHMfa7H0Xf0-ChU5hg","stars":2,"date":"2015-01-14","text":"Famous long waiting line in this place.  I've been dine twice in this small bar counter restaurant.  \nThis time I had a half dozen Oyster and pan roasted seafood (level 4 spicy).   I have to say this time, the pan roast was very salty and I needed to have a sour bread to dilute the taste in my mouth on top of a cup of rice.  A gentleman next to me ordered gumbo but same issue I had despite different dish.  He had to stop eating because too salty.   \nThe chef was funny but with a twist.  Sarcastic jokes to customers, sometimes offensive.  It was midnight and he must be tired but that I don't count as an excuse.   As long as he talk to customer can't I expect some pleasant comments?\nOyster was good but very pricy.  \nIf you wanna try, ask less salt because you can always add it to your taste.   I'm sure they can make it again but only if you would wait for another 15min for sure.","useful":3,"funny":1,"cool":1},
{"review_id":"u58LG4uWejPwr8gHaijmvw","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"WO1sgbYB6u6VVcvChanp5g","stars":4,"date":"2015-01-06","text":"A keeper Korean BBQ place.  I think it is bit pricy above average but food was very good.   We had marinated Galbi but they also have seong? Galbi which is not marinated.   That Galbi is available at a good Korean BBQ place to taste real meat flavor.   Well one of us really wanted that marinated this time and it was an excellent choice.   \nAfter 11pm they deduct 20% and it is average price with really good dining I think.   \n\nThe receptionist was very attentive and we liked her service.  Table waitress is ok. \n\nWe had paejyong? Pancake also.  It didn't took my fancy but all small dishes especially Kimchi was very good.  \n\nI certainly would come back this place for tofu stew menu and other choices.  \n\nThey have a semi private dining area for a group dining.   I can use this for business dinner","useful":0,"funny":0,"cool":1},
{"review_id":"20LissUeP84XzaBBYTmbZA","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"fB4cb6uvz-QngtYP0fbfAw","stars":1,"date":"2012-07-17","text":"I didn't eat here because I was sitting at the sushi bar for 5 to 7 min without any serving. Appx. only 20% of seats were occupied. Some waitress were even cleaning tables while I was waiting to be served. \nThe Korean BBQ restaurant is next door and kitchen is same for both.\nService was very poor","useful":2,"funny":0,"cool":0},
{"review_id":"Je65WUtxO8EgM9vgufvcHA","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"gBfPyzPRmeOaj3SdcIj0Rw","stars":5,"date":"2012-07-17","text":"Excellent sushi here. All chef at the bar are Japanese too.  They have traditional Sushi and also creative menus upon request.  I recommend you to sit at counter. Very nice chefs can explain you about where the fish comes from, etc.  \nThe atmosphere at other tables are more like upscale bar lounge and totally different feeling from the counter.  It is pricy but it worth to try in this town.","useful":0,"funny":0,"cool":0},
{"review_id":"uClFXn1AAaiq5XDR53kHBw","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"UPIYuRaZvknINOd1w8kqRQ","stars":5,"date":"2011-01-04","text":"Really good stuff. An authentic Japanese ramen place.  I'd come back here and try other menu items next time.","useful":0,"funny":0,"cool":0},
{"review_id":"20GYTtYwgwbcXBNZBJ76Hg","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"DkYS3arLOhA8si5uUEmHOw","stars":4,"date":"2011-01-04","text":"Quick, great price and tasty. The breakfast BLT was just made, hot, crispy, and fresh lettuce and tomato. $3.99 it cannot beat.","useful":0,"funny":0,"cool":0},
{"review_id":"KOuOTXQxP2Xc8Aq29wPIdg","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"FrnVtJzAmr6pgzO0wRxJdA","stars":4,"date":"2011-01-14","text":"The display of this store was excellent. Many selections for grands(Kawai, Petroff, others), uprights and digitals(great Rolland selection). They offer music lessons and rentals. Besides the Pianos, they sell guitars and other band instruments. I highly recommend this store.  Store staffs are friendly.  They have 3 locations but visited only EAST location, and they told me they have 7' grands in WEST too. I'll inform it next time.","useful":1,"funny":0,"cool":0},
{"review_id":"2nm9qRmxia3EzARKI4UZyw","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"SN6mvy2vbXL0F_CYFkx8zg","stars":5,"date":"2013-08-18","text":"I ordered spaghetti carbonara, my favorite dish.  It wasn't on the menu but they served me without any trouble by substituting lunch menu. Taste great.  Waiters and waitresses are very professional and comfy. I totally recommend here!","useful":0,"funny":0,"cool":0},
{"review_id":"cAgWNBmRhx4OYwzJ2YzJJQ","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"zkhBU5qW_zCy0q4OEtIrsA","stars":2,"date":"2011-01-04","text":"I had lunch at here. So no lobsters or oyster seafoods highlight. If you select specific foods, it is ok. I have to narrow down to following: \nIn sushi: salmon, eel, shrimp roll\nIn grill: yaki soba, shrimp tempura \nIn desert: green tea soft ice-cream, mocha cake, and of course fresh fruits\n\nI didn't try all but may be 80%.  Many others i cannot recommend unfortunately.","useful":0,"funny":0,"cool":0},
{"review_id":"3jAV0SdkSG7r0yey4Qns1g","user_id":"ggUIxd2V8ryLPYUYJUBEaA","business_id":"7sb2FYLS2sejZKxRYF9mtg","stars":4,"date":"2017-01-14","text":"This is an outstanding sushi place in Vegas.  I cannot compare the quality to $$$$ sushi place but at reasonable price($26) with the great neta to rice ratio, this is a 4 star for me.  \nWell, simply all you can eat sushi is not recommended generally speaking, and its poor selection and robot made like sushi is just out of discussion.   \nThis place, however, four sushi chefs are working so hard like humming bird and you can eat premium such as uni, amaebi, fatty salmon too on top of regular one and appetizers (those premiums are one order only though).  After you try all others, one time premium sushi is just fine for me.  \nFifth star could be by adding some basic selection I usually can find such as Aji or Kohada, and due to the speedy preparation, the rice isn't treated well sometimes.  Fall apart before you put it in mouth... \nBut you don't get all at the price, right?   The price is without drink.  All menu food items are included!\nI'm happy to go there again.","useful":0,"funny":0,"cool":1},
{"review_id":"H688I6NWhdaE-WxSRyJi6w","user_id":"4oGrEng7yDfQUtcgEmg3cA","business_id":"rrh4nkmotLVqA6XnSb3q8Q","stars":5,"date":"2017-10-10","text":"I had an ignition issue on a Mercedes C300 that basically bricked my car on a tight garage. After trying, unsuccessfully, with couple other towing companies, I was referred to Urban Towing. He showed up on time, with a mint truck to pick it up and was able to, within minutes, tow it from its spot while taking care of not scratching any of the underbody. He is knowledgeable and professional. I would recommend Urban Towing!","useful":0,"funny":0,"cool":0},
{"review_id":"AC65P8w6Iv3g7-pQ21vmNw","user_id":"YOjJitDexKQoptYBqACVTQ","business_id":"E74g5nmRJj9LQS1uyKmq8A","stars":1,"date":"2016-04-07","text":"BEWARE!  BARTENDER AND BARBACKS ARE SHADY!!\n\nI'm a local and come to Oshea's often to see my DJ friends perform. I've been here multiple times, this place is great and I always have a good time. I go there especially for their $3 frozen Baileys.\n\nI walked in around 11 pm on a monday night. 3\/28\/2016. I was excited to take a friend of mine (who is from out of town) to Oshea's for some drinks and a good time as always. I ordered 2 frozen baileys and handed the bartender a $20 bill. HE DID NOT COME BACK TO GIVE ME MY CHANGE AND SCAMMED ME. When I asked the barback how much my drinks were, he kind of played dumb and said \"I'm not sure, probably $6-$10\" SO I BELIEVE THEY WERE BOTH IN ON IT. I asked the bartender how much the drinks were, and told me $10 each.\n\nAt the time , I wasn't sure what the correct price was and believed what he told me . BUT HE STILL DIDNT PRINT ME OUT A RECEIPT TO SHOW ME THE CHARGE! I just finished our drinks and left. When I asked my friends (who is a regular DJ at OSHEAS) he told me there ALWAYS $3!\n\nI hope this review is helpful to whoever is reading this. I hope this finds its way to management and that they look into their staff. Don't let the bartenders and staff rip you off. Especially if you're a tourist. BEWARE! \n\nI  SUPPORT MY MUSICIAN AND DJ FRIENDS BUT WILL NEVER GO BACK TO OSHEAS  AND SPEND MY MONEY HERE THERE AGAIN.","useful":3,"funny":1,"cool":0},
{"review_id":"UN451jAJBYnnv3J3mMw8zw","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"tuikCn2ljRGN5QHZBnjoqA","stars":3,"date":"2015-07-07","text":"This place has recently opened with huge lines. Everyone, ORDER ONLINE! You can order from their website and pick up at a side window, skipping the entire line. When we did this, we were a little earlier than our specified order time so we did have to wait a little. If we had arrived on time, we wouldn't have had to wait. \n\nIn regards to the food, I ordered a small pesto pasta and had low expectations. It actually was better than I thought it was going to be. The pasta and tomatoes with it were very fresh. There were supposed to be mushrooms but I think I had one in my entire dish. \n\nThe portion size was so generous I actually thought they had given me a large instead of a small. I was eating with a friend and she ordered the peanut saute which looked very small. \n\nI would recommend not eating at this location. There aren't many tables and since the dine-in area is encased in glass, it's very loud. \n\nI would probably return.","useful":1,"funny":1,"cool":0},
{"review_id":"JFsjinVIFb5RbdR__Y2KRQ","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"hRkZHnKHVuIZWmF258sbCw","stars":3,"date":"2015-07-27","text":"I'd say this review trends a bit higher towards the 4 than the 3, but I just couldn't give it the 4. \n\nWe made reservations for a party of 4 on a Saturday night. Good thing too because the place was packed! I've actually tried to get in to this restaurant without reservations and been turned away because it's so busy. \n\nThe restaurant itself is nicely appointed. We were seated in the back at a cute little booth, allowing us to look out at the whole of the restaurant. \n\nThe service was friendly but a bit slow at times. It seemed that any time we wanted to order (drinks, entrees, and dessert), we had to wait for a fairly long time for our server to notice us. However cleaning up plates was very efficient. \n\nWe also had problems with the restaurant running out of items we wanted. One person in the party ordered their ravioli and was told upon ordering that they were out of it. It really bothers me when restaurants don't tell you up front what they don't have in stock anymore. Otherwise you are happy with your choice and then need to make a split decision because the restaurant doesn't have it.  Two of us were also drinking Coke Zero and they ran out of that half way through the meal too. \n\nIn terms of the food, I've been to this restaurant a few years ago and remember the food being better than this visit. I had the wild cheese tortellini and found it to be a bit bland. My husband had the bolognese which I also found to be a bit bland. The bruschetta was delicious and the tartufo was good as well so it was just the pasta sauces that could have used a bit more salt, or extra oomph. \n\nComparing this restaurant to Michael's Back Door on Lakeshore, I'd prefer Michael's Back Door.","useful":2,"funny":0,"cool":0},
{"review_id":"WcNKy4Lyx8eKE51ZEyNxAA","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"xeFVRUjxorxjO_qjX8FNdw","stars":4,"date":"2015-07-13","text":"We've been regulars at the Apricot Tree for ages, for both dinner and dessert. The schnitzel is my favourite dish there, though sometimes I'll get one of the specials (usually when they have duck or veal). All of the desserts I've had there have been delicious, my favourite being the dobos torte. However since this is apparently a difficult dessert to make, it's unusual that they have it. \n\nOver the past year, this restaurant has lost most of their regular staff and has seemed to suffer from that. Now that those staff have been around for 6-8 months, they finally seem to be getting in to a groove and service isn't as slow as it was months ago. We've never had unfriendly service here, just slow at times. \n\nThe portion sizes also seem to have decreased a bit. With the schnitzel, I have to ask for extra mushroom sauce because the small cup they serve isn't enough. That said, the price point at this restaurant is very fair. \n\nThere is a patio to sit on, but it's right beside Dundas and can be a bit noisy at times, though it is nice to sit outside. \n\nI'm sure we'll continue to return to The Apricot Tree, though it would be nice to see different specials or menu items as it seems to always be the same. There is a schnitzel fest coming soon so I look forward to that.","useful":5,"funny":1,"cool":2},
{"review_id":"nTTE2nwyLCLjks1L-QXTqQ","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"CtgMikdX5pWr6o6_Ujydrg","stars":5,"date":"2015-08-16","text":"This is the best fish and chips place in Mississauga I've been to. I've only had their halibut and chips, and stick to it, though I'd eventually like to try some of their other fish (if I can get past the halibut!)\n\nI've only ever gotten take out here but it is served pretty quickly and properly for fish and chips, in a cardboard box. I can't stand places that use styrofoam as it makes the fish soggy. Thankfully, these guys do it old fashioned!\n\nTheir fish is lightly battered and crisp. The fries as delicious and obviously fresh. I also believe they are double fried. \n\nThe home made tartar sauce is good, though they usually give you the packets with your to-go bag, I would like their homemade stuff! It's much better!","useful":1,"funny":1,"cool":1},
{"review_id":"P42ZxTIhxu1c0AxN0pfR5w","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"yy9woaGln_rHhpJ7aadrGw","stars":4,"date":"2015-08-11","text":"Had a great meal here on the weekend for their schnitzel fest. I made reservations but they weren't required as there were a few empty seats when we arrived at 7:30.\n\nBistro Narra seems to do specialty menus every so often, which is great for additional variety. This time it was schnitzel fest. I tried the cordon bleu and it was very easy for me to sub out french fries and sub in parsley potatoes instead. \n\nWhen the meal came, it was a tad over-cooked (fried too long), but still delicious. Didn't order dessert this time, but I usually do and it is always good. \n\nService was great, quick, and friendly. The chef came out to say hello and our service was very attentive. I couldn't believe how quickly our meals came out. \n\nI like the decor of this restaurant, it's fresh, modern, and clean. \n\nThe regular menu seems to change a bit. Which is good for the variety, but bad if you find something you really enjoy and then it disappears (like the corn soup, which was one of the best soups I've ever had and is now gone :( ).","useful":1,"funny":1,"cool":1},
{"review_id":"KWI2bOW6Jh9cl41OrFQU1w","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"wKx2qCvHthF5O6WPgMU6iQ","stars":4,"date":"2015-08-21","text":"This is a great place for coffee, but it's not my cup of tea for food. \n\nI like the atmosphere, especially now that they've expanded (before I remember this place being pretty cramped). It is a bit loud when it's packed but it's nice, bright, and airy. \n\nThe coffee is also delicious and it's one of the few places where you can find a real flat white, just like what you would get in New Zealand. \n\nThe food is too over the top for me. I'd prefer some more simplistic stuff on the menu. If I recall correctly, they used to have a grilled cheese on the menu that was really good but now it seems to only be on the kids menu. \n\nI'd re-visit this place for a coffee some time but don't know if I'd come back to eat anything.","useful":1,"funny":0,"cool":0},
{"review_id":"I4OTrxgz6p2FTVi7m1cEgg","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"mQkVFNSDpD4frPUMycVoWw","stars":3,"date":"2015-07-06","text":"Would give 3.5 if I could. \n\nMade reservations for dinner and decided we wanted to sit on the patio so saw very little of the interior of the restaurant. The patio itself is quite small but we were the only people out there and since this restaurant is set back from Lakeshore, it was quite pleasant. \n\nThe food was very good and worthy of more stars. The bread served at the table was incredibly fresh. Since this is a wine bar, there's a decent selection of wines and we tried something we hadn't heard of before. I had the veal chop special which was served with two large and yummy prawns. I wish I had been asked how I liked my veal as it served well done and I prefer more medium rare. For dessert, I had tiramisu which was excellent. \n\nMy problem with this restaurant was the service. Our server was friendly at the beginning but we had a couple of problems. My grandfather is a 93 year old man that can't hear well and can't speak all that clearly. The server misunderstood what he ordered and when utensils were brought out for the food, it was clear there had been a mistake. Instead of apologizing for it, the server got defensive and said that she had repeated the order and no one corrected it. She went back to the kitchen and corrected it, then came out and asked him if he was ok with that. He said of course, because it's what he ordered and she said yes, you better be ok with that. She started off quite friendly, and she ended quite friendly, but this caused some tension. \n\nMy other complaint would be the amount of time it took. From sitting down to being served food it was 45 minutes. Similarly, from ordering desserts to getting them it was about another 15 minutes. I can't comment on how busy the restaurant was because we weren't inside but this still felt lengthy to me. \n\nNot sure if we'll be back. It was good food with a slow kitchen and weird blips of anger from the server.","useful":1,"funny":0,"cool":0},
{"review_id":"9v0Wjtwb5XTUbvV7o7qz_w","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"9prl00viUUFrEcPIpXZDOw","stars":4,"date":"2015-08-03","text":"I've been here plenty of times and have never once completely ordered for myself. I love the cold milk tea but every time I try to order it, the waiter looks at me like I'm from outer space and my friend takes over for me in Chinese. \n\nAside from the language problem, food here is quite good. I've tried quite a variety of things but really enjoy their fried rice, beef in black bean sauce, and the stir fried snow pea leaves (I've never had this before until this restaurant).\n\nWe like being seated in a booth and usually can unless it's very busy. \n\nService, aside from my language problems with the milk tea, is pretty good. They bring food out quickly, replace tea quickly and always ask how things are (I'm assuming... they ask in Chinese to my friend). You do need to waive down someone to get the bill but that too comes quickly and things are pretty cheap.","useful":0,"funny":0,"cool":0},
{"review_id":"2FrkzcHWnLjsXnlUOkJeLw","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"D_s16LOzlDkLwa4S8QPabw","stars":2,"date":"2015-08-01","text":"Had a Groupon deal for this restaurant so went and tried it out having heard some good things about their burgers (and not so good things about their service).  Thank god we had a Groupon deal... I can't imagine paying for this meal full price.\n\nWe made reservations and when we arrived 5 minutes early, the waitress looked at us like she had no idea what to do with us. This restaurant is very small - only 10 tables, but there was a table for 4 and a table for 2. I'm not sure what's hard to determine on where to seat 2 people? The waitress had to ask someone else for help on where to seat us. \n\nEventually got seated, ordered drinks (pop) and were told the specials. My husband ordered the burger, I ordered their steak special. My first mistake was not asking how much the steak cost. I would have expected a little under $30 and instead it was $34. A little overpriced. The burger is more than fair at $17 and a huge portion. \n\nThe problem with this place is the absolute asinine prices they charge for pop. The two of us each ordered a Diet Coke and then asked for refills. The bill came out to $16 just for the drinks!!! 16 freaking dollars for soda!! We could by 3 cases of pop for this. Instead, we probably had 3 cans between the two of us. I had to pick my jaw up off the floor when I saw this charge. \n\nIn terms of food, it was pretty tasty. \n\nFor service, we had problems getting the refills (maybe we would have been better off if the service had been worse and we didn't get them at all). It also took an hour and 45 minutes for one course. I noticed the table beside us had to ask 3 times for their drink. \n\nOh yes, and every table around us had bread on their table but we got nothing.","useful":6,"funny":2,"cool":2},
{"review_id":"zUT_NPJQCYc814601Cot_g","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"rs1KuGK15t5xcykB9UFH1w","stars":3,"date":"2015-08-29","text":"Visited this place in the middle of a warm  weekday afternoon. As other's have mentioned, it's a pretty small place but this didn't cause us any issues. \n\nI'll be honest, I don't really understand how to order.... still. I ended up with one flavour of ice cream (are you allowed two? I don't know). I wish there was a little more selection in the flavours.  Then I added two items to my ice cream and it was mixed in well and put in a waffle cone.  The waffle cone was very good. The ice cream was ok. I chose the dark chocolate ice cream and it wasn't too dark chocolate tasting. \n\nThere's also a CAA discount, which was appreciated.","useful":0,"funny":0,"cool":0},
{"review_id":"ViFRY09qwoP8ro8CdnEcwA","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"hSZp_aa8Zjofb2mC9ZdZug","stars":1,"date":"2015-08-16","text":"Visited Erin Park Lexus without an appointment to look at the 2015 CT and had to wait about 15 minutes for someone available to see me. Not a big issue because the receptionist kindly offered coffee while we waited.   \n\nI let the Sales person know I was looking at the CT and got some background information on the car before being taken to his desk and asked about whether I wanted to finance or lease. Upon saying finance, the sales rep proceeded to break down all of the costs for leasing and why it's better. I'm just at the beginning stages of looking for cars right now! I don't care about financing vs. leasing. I need to pick a car before I do so.   \n\nThe rep finally goes to find us a car to test drive and I'm put in 2011 CT. That's right, a USED car with 80k on it. There was a brand new CT on the lot, which the rep said they had just gotten in, but apparently putting potential customers in used cars when they want to buy new is how this dealership thinks it is going to get sales.  \n\nFine, let's test drive this car. Half way through the test drive, the rep gets a call on his phone and says we need to be back at the dealership in 5 minutes because he has another customer waiting.  \n\nThis dealership obviously doesn't care at all about having me as a customer. Rest assured, the feeling is mutual and I will never return.","useful":1,"funny":0,"cool":0},
{"review_id":"WpsUavLGnB-LJBo-dS3PtQ","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"eityWbFA-jVVcFiE3Mn3Bg","stars":3,"date":"2015-08-23","text":"Walked in on a Monday afternoon and not surprisingly it was dead. There was still a decent selection of treats and the smell was divine. Staff was friendly and we were served after taking a look at everything there was to offer. \n\nWe ended up with 2 sausage rolls and half a dozen pecan butter tarts. Price came out to a little over $20. I didn't have the sausage roll until the next day but it was still yummy. The pastry here is good. \n\nThe butter tarts, however, were awful. No flavour and overly gelatinous. I think I could make better butter tarts.","useful":2,"funny":1,"cool":0},
{"review_id":"WbqipuGwgqIL1_d37lxX1w","user_id":"mfCYP8z56MdjaopG_zbbRw","business_id":"-L88B-PrtzwujhLuYc2k_g","stars":1,"date":"2015-07-18","text":"Edit: 8\/30\/15 - just got my credit card bill for this restaurant. I had used a new credit card so couldn't put in my pin. Joe Badali's decided to add to their tip above and beyond what I gave them. I gave a 15% tip! I can't stand restaurants that do this. Lowering my review from 3 stars to 1. Congratulations Joe Badali's. You suck. \n\nOriginal Review: Having been here a few years ago, I remember thinking it was mediocre and hadn't been back until this week, where I was reminded how mediocre it is. \n\nI was here for lunch, where this restaurant has a fixed price menu (outside of Summer\/Winterlicious). I tried this and had a Cesar salad which had nice and creamy dressing, the pappardelle alfredo which was pretty bland, and then a scoop of gelato. The gelato was vanilla and pretty good, however I wasn't allowed to choose what flavour I wanted. Is vanilla the only flavour they have? Overall, a pretty blase meal. \n\nService was ok, nothing special. I like the design of this restaurant though, it's pretty cool, if you don't mind the subway rumbling below your feet every few minutes.","useful":1,"funny":1,"cool":0},
{"review_id":"PSoVbu8mAg6ia_nX9GoTcA","user_id":"mwOQopxgh0sPRWCpG9hdyQ","business_id":"pLXMNQf-niTyf7dm3llrNg","stars":5,"date":"2016-11-30","text":"I've seen many doctors from both eastern and western medicine, but no one has helped me as much as the Shyu family. They are extremely knowledgeable and explained everything as we went through treatment. Told me what I might expect and what I should do to complement the treatment. The results were immediate and I continue to see them when I need help.","useful":0,"funny":0,"cool":0},
{"review_id":"lehG5EuYUTjUbNggVf5r7g","user_id":"OGqfjKKMf-9kzAWTbqecSA","business_id":"5-KisjcYyWN6Fwcp-wDYmw","stars":4,"date":"2013-11-13","text":"Lots of choices to suit everyone's cravings! From Mcdonalds to Aroma, Indian, Japanese cuisine, etc. Lots to choose from. It gets busy during lunch hour, but if you manage to arrive just before noon, it never takes more than a few minutes to find a table.","useful":0,"funny":0,"cool":0},
{"review_id":"vDfwKMnKfshbs39S__h20w","user_id":"c5KNDNEti52w0hAtGG1mPw","business_id":"MaQpLkBf5JDE0KXqAh189A","stars":1,"date":"2015-06-02","text":"While we were happy with the end result of the build the options were limited but they did manage to work with us on a few things. The real problem wasn't so much with the builders but the TBI lender they are affiliated with. They had 6 months to help us secure a loan. We were rushed into doing our walk throughs in April and it is now June and still haven't closed. They have chosen a lender Wellsfargo that seems to be in the business of not giving loans. I blame TBI for not preunderwriting our loan and getting everything in place. They seem to have zero clout with their lender and don't have any interest in going to bat for you. There is not sense of urgency and we have been lied to every step of the way. My reccomendation is to get your own financing. They are horrible to deal with. We were scheduled to close 6 weeks ago and have just had to switch to a private lender since they continued to string us along.The stress has been incredible.On the quality of workmanship I would give a 5 start rating, The options three stars and the TBI lender zero stars.","useful":12,"funny":0,"cool":0},
{"review_id":"NuRt_-Lksg4x-EQSdSAwLg","user_id":"6b6w5iDuuKlciQ37gW5IkA","business_id":"HSqIZk89hcgkQTBfTMdG-g","stars":5,"date":"2015-11-26","text":"I visited here today to check out the cars. I absolutely loved this place, and will be referring to everyone I come across looking for a car! They have beautiful cars that are in very good shape. Clean interior and exteriors. Very good prices; they have the best prices out of everywhere I've looked (and I've been looking for a while.) After coming just once I bought a beautiful E320 Mercedes Benz. It runs beautifully, very smoothly. It's a 2003, but looks and runs like it's practically new it's in such good shape. The workers here are friendly and held a very professional yet comfortable atmosphere. The dealership is very clean, as are the cars. I am very happy with my purchase, and with this dealership. I definitely recommend to everyone and anyone that is looking to find a beautiful used car that is at a great price. Very fortunate to have came across this place.","useful":0,"funny":0,"cool":0},
{"review_id":"04PZxzT3gtmZRc9EzEV_bQ","user_id":"YD6riK7QT0MDP1jYdqkxuw","business_id":"5WQZRY8UeN-lUKoBOn7yLQ","stars":5,"date":"2012-08-15","text":"I can't say enough about Helen and her team at Alligator Soup! From start to finish, our experience was wonderful!  The save the dates, invitations, inserts and thank you stationary for our wedding in La Quinta, CA this past March were beautiful, reflected the old Hollywood theme of our wedding and the service was excellent. I would happily work with Alligator Soup any time!\n\nThank you Helen and Team!\nLisa Bassewitz","useful":0,"funny":0,"cool":0},
{"review_id":"fr6IgbuXdX0sfTasKIiniA","user_id":"epwbNbNJHSeen64QXuuHtA","business_id":"5uUACWfCXMLjuL41O-v4aw","stars":2,"date":"2017-04-20","text":"First he wouldn't honor my restaurant.com coupon I paid for. Says he don't use them.yet he does nothing for them to stop. Food was a bit salty and was suppose to have red palm oil in both leave dishes but seems to be alot more vegetable oil. Chicken tasted like it was rotisserie so it lacked the true seasoning from the stew. Hope I find a different african restaurant before I leave","useful":2,"funny":0,"cool":0},
{"review_id":"Bf5HHi1pOinCfRqXMf6GcA","user_id":"epwbNbNJHSeen64QXuuHtA","business_id":"_5S-0t10CgqKuMW6yiklHQ","stars":2,"date":"2017-04-20","text":"The food was bland. I did not taste any cumin or cilantro.  The sauces taste like pureed tomatoes from a can. They put ground beef in most of their buffet items. No variation in meat. It tasted like some gringos was in there cooking.","useful":0,"funny":0,"cool":0},
{"review_id":"DxFOOMgSa5C8FLJ1k9yvgQ","user_id":"Sl6M9d1Z_S89A6_Yscvbyg","business_id":"tfTDzXqPEg3QgbX9WPYAVg","stars":3,"date":"2013-09-08","text":"Good course - especially for the price. BUT the staff is rude and abrasive - they act like the customers are an inconvenience to them. If you ignore them, it's a pretty good experience.","useful":4,"funny":0,"cool":1},
{"review_id":"lE1Zs4FgNtSm8g46sQA2BQ","user_id":"Sl6M9d1Z_S89A6_Yscvbyg","business_id":"v0O4O4poJ3-mY8BS_Ye2kQ","stars":5,"date":"2013-07-13","text":"I have been getting manicures every two weeks for over five years and this is one of the best manicures I have ever had.  My tech did an excellent job of cleaning up my nails and shaping them. She spent time and did it correctly. She let the gel paint set and dry enough between each coat so it didn't move or bubble. Clean and friendly. Going back for sure!","useful":0,"funny":0,"cool":1},
{"review_id":"Ys38jHl-VDQ5YoED6FqTrg","user_id":"Sl6M9d1Z_S89A6_Yscvbyg","business_id":"B3UsjglAAC5NvTmGfpO7RA","stars":1,"date":"2013-04-27","text":"By far the worst property management company I have ever rented from. Tried to scam us several different times including trying to charge us for a service call that they claimed the appliance company was charging them. I verified with the appliance company that there was no charge to MBA. At move out they Initially charged us $1500 on top of our deposit including $800 to reprint the house which is illegal since we had been there over a year. We left the house cleaner then it was at move in with improved landscaping. Even if you love the property, it's worth walking away from and finding something different. You will regret renting from MBA.","useful":19,"funny":2,"cool":1},
{"review_id":"hjRGj5m4ntIuKFY_RF30kw","user_id":"Sl6M9d1Z_S89A6_Yscvbyg","business_id":"oqeBR3-TEMlbCBI4jofnIw","stars":1,"date":"2013-03-26","text":"I was referred to this office by my general doctor to have a cyst removed on my arm. After THREE visits, and an emergency visit to my regular doctor to fix the packing,  I was left with a huge scar. I wish I had never gone.","useful":7,"funny":2,"cool":1},
{"review_id":"Ea0u1MW8r_nRQVg2W4zQYw","user_id":"lUo5YUGlTB9epcv6WdkvLA","business_id":"kB41y8iPB9tNrG4jIciiig","stars":1,"date":"2015-05-21","text":"Third flight in 3 days with delta, batting 3 for 3 for delays. Sitting on Tarmac waiting, to get fueled. Hopefully won't be another 2 hour delay like MSP. Stay clear of this airline! Last time I ever fly Delta","useful":0,"funny":0,"cool":0},
{"review_id":"a762vTPnfofG7I15Xq5D2A","user_id":"IUqa4T8VKzm__WriJMeoSQ","business_id":"1A6wgPpLZ6nW9ekRuBHDpA","stars":5,"date":"2017-06-19","text":"I have used them twice to repair Epson printers and have been satisfied both times.","useful":0,"funny":0,"cool":0},
{"review_id":"F3EHPjj4FywaMy7DwE-N_w","user_id":"TYStqWV1GTbh8_F-Er-oHA","business_id":"yOBDY3fpaTpX4Q5JpmExMg","stars":4,"date":"2014-10-29","text":"This is the best Mexican food I've had in Charlotte since moving here from California. Having lived in LA, I have very high standards as far as Mexican food is concerned. Their staff is very friendly and greet you as soon as you come in. I've had their asada, carnitas and chorizo tacos and they're okay. Their chile rojo is pretty good, it's also really spicy so if you can't take heat I'd stay away from that. Their chile verde is okay. I had their chile rojo wet burrito and it was pretty good as well. I was hesitant after reading all the mixed reviews but decided to give them a try. Just as everyone else says, don't be fooled by the location of the place. It's in a small strip mall and you can possibly miss it but overall it's good. I'll be returning to try other items on the menu.","useful":1,"funny":0,"cool":1},
{"review_id":"IoKp9n1489XohTV_-EJ0IQ","user_id":"vKXux2Xx3xcicTgYZoR0pg","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2014-05-03","text":"Love the outdoor atmosphere. Price was right, service exceptional and the food tasted fantastic","useful":0,"funny":0,"cool":0},
{"review_id":"OmS7j5bHsjJl8KHr0B4UYA","user_id":"XP096mIINH80XJidVoj7bg","business_id":"eJPckkV1k7gn0V2awA1pzA","stars":5,"date":"2017-12-16","text":"I'm so..... Heated... I bought the 3 amigo and it was amazing.... I can't believe they'd serve me something this good","useful":0,"funny":0,"cool":0},
{"review_id":"pyDLJG9qxp1wyRSOz89CQQ","user_id":"WXbyQ5DTnRcvydk39lsfhg","business_id":"CA4qhLICQWX0H_bf9iGw0Q","stars":1,"date":"2017-11-18","text":"Apples support is horrible, eff this place. Honestly WORST customer experiences when I go there","useful":0,"funny":0,"cool":0},
{"review_id":"Ci7CEF27JPAPGwy5XHoxbA","user_id":"psDKpe3vtyszJFS7_R41HQ","business_id":"PhL85G9Y6OstQzThDIllMQ","stars":5,"date":"2015-10-22","text":"We were traveling, and we lost our luggage -including all our dog toys and \ndog food. Our dog is VERY PARTICULAR. Just the way he is. A friend suggested Little Bear. Charles was amazing. He played with Mauser (our dog), showed him different plush toys and bones, and even gave us a dog sweater to make sure he was warm. And the funniest thing is that before, Mauser would only eat Natural Balance. Charles suggested Wild Calling. We tried it and now it's the only thing Mauser will eat. He has more energy and a shinier coat. Thanks Little Bear!!","useful":0,"funny":0,"cool":0},
{"review_id":"5oyLPTwurV01RkDUIRj5NQ","user_id":"IBf3-iCBFrw53GLgySNVkA","business_id":"d_L-rfS1vT3JMzgCUGtiow","stars":5,"date":"2011-08-23","text":"We went for brunch on a Sunday morning after reading about Border Grill in Vegas\/Rated magazine.  For $24.99 you get an all-you-can-eat brunch - but this isn't your usual Vegas buffet - everything is made to order and served tapas style.  \n\nWe started with the fresh fruit plate and guava empanada.  The guava empanada was heavenly...the filling was almost like a guava cream cheese.  Next, we tried the chilaquiles and the green corn tamale.  The green corn tamale is sweet and delicious with just a little sour cream.  We followed this with the Yucatan eggs benedict - not as delicious as all of my fellow Yelpers let on - and the steak and eggs.  My husband was a huge fan of the steak and eggs...I think he only shared one bite.  The breakfast enchilada and the chorizo and egg taco were last.  I am not a huge chorizo fan so I did not enjoy the taco, but the breakfast enchilada was amazing.  The chicken was so flavorful and tender and I loved the cotija cheese.  For dessert, we ordered the coconut french toast, which was a perfect ending to a fabulous meal...just the right amount of sweet.  \n\nOur server was tremendous - very sweet and always there with a refill for my all-you-can-drink mimosas (only $5!).  The passionfruit one is incredible - I may have overindulged!\n\nCheck out restaurant.com to see if they have a gift certificate available.  We got a $25 gift certificate for $10 before we went.","useful":0,"funny":0,"cool":0},
{"review_id":"inkPVGhssQFKDR5eVMfwdg","user_id":"IBf3-iCBFrw53GLgySNVkA","business_id":"gBfPyzPRmeOaj3SdcIj0Rw","stars":5,"date":"2011-08-23","text":"I can't go to Vegas without hitting up Sushi Roku...I love everything about it, from the service to the drinks (my favorite is the Tokyo Cooler, although the Pineapple Upside Down Cake martini is a close second) and the view and the food (hanabi, I dream about you!).  \n\nOn my most recent visit, my husband and I went for happy hour on a Monday afternoon.  Happy hour is only available at the bar, but it is an amazing deal!  We had a spicy tuna roll and the rock shrimp and jalapeno roll.  Roku has the best spicy tuna of any sushi place I have ever visited.  We also had the popcorn shrimp - ask for a side of spicy mayo to make this even more delicious - and the miso eggplantt.  They even have dessert on their HH menu and how can you go wrong with a mini chocolate volcano cake?","useful":1,"funny":0,"cool":2},
{"review_id":"_oK0zHwB9goZ6bxak7a9qA","user_id":"IBf3-iCBFrw53GLgySNVkA","business_id":"loSgYD9dHOsjjm7QCly5qw","stars":4,"date":"2012-04-18","text":"I dream about the cheddar cheeseburger...a delicious burger patty folder inside of crispy cheese!  Try it on the jalapeno cheddar bun to up the level of yumminess.\n\nSweet potato tots are delicious.","useful":1,"funny":0,"cool":1},
{"review_id":"dJ-Lo_M_fza9qUpD57Q7Kg","user_id":"IBf3-iCBFrw53GLgySNVkA","business_id":"0NmTwqYEQiKErDv4a55obg","stars":4,"date":"2011-08-23","text":"We went to Scarpetta to celebrate our 9 year anniversary. As requested, they gave us a table so we could see the Bellagio fountains.  Our reservation was at 9 PM and we were disappointed to find out that the chef was no longer offering the tasting menu that evening. Our waiter, however, said we could create our own tasting - excellent!  \n\nWe started with the polenta with mushrooms - delicious, but it maybe could have used a bit more salt. Next up was the infamous $24 spaghetti. Well worth it - this is the best pasta I ever ate. Since we were indulging, the next course was more pasta. The duck and foie gras ravioli. It was good, but very rich and not even close to as good as the beef cheek ravioli from Carnevino. I am not sure why people would compare the two. On carb overload we then had the lamb which was fantastic. For some reason they also sent out a duck entree which we had not ordered. Not a fan of the spices - cardamom and clove. Nor was I a fan of the waiter attempting to charge us for it. \nDessert was the chocolate salted caramel cake. Good, but nothing to rave about. \n\nWine prices are high but on par with everything else on the strip. \n\nOh, I almost forgot the bread basket and dipping sauces. The Stromboli bread with salami and cheese is phenomenal. The marscapone butter could make even cheap white bread taste good. \n\nDefinitely worth a visit to try the spaghetti. I will be going back for that!","useful":0,"funny":0,"cool":0},
{"review_id":"vde8tmPeRxLcmKmGOPreDw","user_id":"IBf3-iCBFrw53GLgySNVkA","business_id":"By7P2EBBvhqoSDj8PnQa8g","stars":2,"date":"2012-04-18","text":"After eating at Scarpetta, I had high expectations for this place.  Unfortunately, it left a bad taste in my mouth - even the bread was meh.  \n\nI had the Pici with duck sauce as it was highly yelped about.  The noodles though were too thick and a little too al dente.  The sauce was overwhelming and so rich it made it difficult to eat much.\n\nMy friend had the carpaccio, which was very bland.  \n\nThe dessert menu was so underwhelming that we passed - which never happens!\n\nI wish we had hit up Scarpetta instead!","useful":0,"funny":0,"cool":0},
{"review_id":"rrynfRJ6-jnQbQJLOMvFug","user_id":"h_Cn2H6l7U7wtM_WDli8vA","business_id":"w3JBz9gLbZ0CKWQM07nONw","stars":4,"date":"2011-06-02","text":"i wasn't in an objective frame of mind, given that i was a visitor from another state and was willing to try just about anything local. that said, this place left a smile on my face.\n\nmaybe it was the 1950s-era big neon sign out front. maybe it was the fiberglass horse on the roof. maybe it was the kitchy old-school cowboy-themed decor inside. maybe it was the fact that our waitress wore a holster and 6-shooter. or maybe it was the sawdust all over the floor.\n\nside note: sawdust? really? WHY? aren't they concerned about people slipping and hurting themselves?\n\nwe ordered breakfast and it was good. it's hard to screw up eggs, hash browns, and bacon, and they didn't. yum.\n\ni'm glad we didn't go to IHOP.","useful":1,"funny":0,"cool":0},
{"review_id":"beTplLIX2ShG5IBulWkClw","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"KaGZE0_o1EmmSN4Fo_cpUw","stars":4,"date":"2014-10-03","text":"Food Is good. Service is slow. Large salads and sandwiches  with plentiful sides. Burger was cook ed as ordered. Their special sauce is killer good. Peppery spicy alone but on the burger is fantastic.  Cuban sandwich is large and filling and delicious. Brownie Ala mode is enough for two, maybe three. Order dessert only if you are not pressed for time. Took over 30 min to get dessert menu, order and stated eating.  It will take 1 hour for entree and another for dessert. Hard to get into a lunch hour.","useful":2,"funny":1,"cool":1},
{"review_id":"5BoTcEIkfPwf7eHgN6Bf-g","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"rbH0HuTcBvZBbiAnqufRqQ","stars":5,"date":"2015-02-20","text":"Excellent gorditas and tacos made on home made corn tortillas.  Reasonable prices.  Nice people.","useful":0,"funny":0,"cool":0},
{"review_id":"npU4TsBeJd9DnJG-sMxWuA","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"TfabYPasZ1oOMN6JLa-yvw","stars":5,"date":"2015-01-22","text":"Hidden gem not in the best part of town but it is worth the trip.  The buffet has over 12 different dishes to pick and choose from...all delicious.  Salads and sauces. Fresh bread served at your table, your choice of plain or garlic.  Two very good desserts...rice pudding or creamy mango custard.  Will definitely be back.  This resturant was referred to my Virginia friend, Yaseem by her brother who lives locally.  Thanks","useful":1,"funny":0,"cool":0},
{"review_id":"kuOQffOurysInrISziFEDQ","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"Ffhe2cmRyloz3CCdRGvHtA","stars":4,"date":"2015-03-12","text":"We had the Chicken Bacon Avocado wrap that was stuffed full of chunks of chicken, crunchy bacon bits, some avocado and lots of lettuce and skin-on cucumbers chunks.  Next time I'll tell them to leave those off.  Kind of dry so needed more mayo that they supplied in packets.  The pesto chicken Cavatappi was delicious but small portion.  It  should include a side or at least a piece of bread.","useful":0,"funny":0,"cool":0},
{"review_id":"7Z12sEigOCEXxgnMmFwoFg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"_8VkSb_Mryb6bHQxSWB7Pg","stars":5,"date":"2014-12-29","text":"Great experience for cooking for self. Fresh veggies and meat. Lunch portion was plenty of food and filled me up.  Sauces and condiments an added plus. I will return again. Be sure to check in for added bonus.","useful":2,"funny":0,"cool":1},
{"review_id":"YYHJRLJ-DWgOSF25y-9gbw","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"IOwTrStIy6NinyquhBrLZQ","stars":3,"date":"2014-09-29","text":"Overwhelming usage of ginger on practically everything...fried rice, noodles, orange chicken and mildly on the House special ginger chicken.  Bourbon chicken and green beans were good.","useful":0,"funny":0,"cool":0},
{"review_id":"cP0AOWayOqENSzIZ3u4jhQ","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"MXC9pwIxovWUc9yu1F8OxA","stars":5,"date":"2014-12-24","text":"Fantastic sushi...fresh and yummy.  Large portion and selection. Also offers all-you- can-eat for $26.95 for 60 minute dinner. Tempura very good, too.","useful":2,"funny":0,"cool":1},
{"review_id":"0bFKoowvHuMJIBk2p_d69w","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"-G7MPSNBpxRJmtrJxdwt7A","stars":5,"date":"2015-02-27","text":"Very authentic pupusas.  Hand made to order  so expect to wait . I had a spinach and cheese one and chicharron  with cheese and beans. Big and thick and very filling.  The rice is good but don't expect Spanish rice. Serving staff helpful and nice.","useful":0,"funny":0,"cool":0},
{"review_id":"daGPgA0TITTYDI-2yQKqaQ","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"ufmokEGxGqEWIdvIVsNg_Q","stars":5,"date":"2015-01-15","text":"Hidden little gem tucked in the corner of a strip mall.  I had the combo beef and chicken  koobideh. Very moist and tasty chicken and tasty beef.  Lentil soup very fresh and hot.  Everything was great.  Check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"czMVKqV1fGuAM1RrZq92Yg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"djAWtGq2IxKaxMIMw-P58A","stars":5,"date":"2014-09-21","text":"Fantastic buffet for brunch. All the possible breakfast fare from eggs benedict, porridge,  biscuits and gravy, fresh fruits, yogurts,  peppers, Mexican and Asian and Italian assorted dishes. Plateful of bacon tops it off.  If room, have dessert, too. Peach cobbler with bread pudding icing tastes great. Good value for $9.99.","useful":0,"funny":1,"cool":0},
{"review_id":"lMa8SGrkj1Bs3id77nR6PQ","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"TyZnv8aX1OJfBKoyuYgZLQ","stars":5,"date":"2015-02-07","text":"Very healthy portion of chicken  on the firehouse chicken sandwich  and served with sweet potato fries. Fantastic","useful":0,"funny":0,"cool":0},
{"review_id":"PGbcQtuMkQltjplFQ3nGAg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"SzhD5J80IhpyeBftzQ950Q","stars":5,"date":"2015-01-16","text":"Love The chicken flavor.  The chicken and shrimp  to stadia under 500 calories is great.  Not very many parking spaces but worth the walk.","useful":0,"funny":0,"cool":0},
{"review_id":"bk_uLg118L2AKvD55oj6eg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"zEOfVGv6DeprEzmFYMFhXA","stars":5,"date":"2015-03-03","text":"Great food and service, as always.  The wood fire  cooking is an added plus. With only salt and pepper blend the serloin steak is so much beeter. Matched with coconut shrimp with orange sauce and brocolli. I had my starch fix with t h e potato soup and started it all with a blooming onion.","useful":0,"funny":0,"cool":0},
{"review_id":"af5TIiM1VvhU5nshO1-Reg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"ZosrzTfiiPhbURA04AQTUA","stars":5,"date":"2014-09-24","text":"Great San F r an cisco club sandwich (12.99) served on sourdough bread and Monte Cristo sandwich (12.99) with fries or potato salad.  Breakfast served during lunch time too.  Raspberry  iced tea the spot.  Nice attentive servers.","useful":0,"funny":0,"cool":0},
{"review_id":"V9gt8UguanEgggnRiAY0rg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"ZAqgv1gply0m_4fHAIffWA","stars":1,"date":"2014-09-29","text":"Watch for what they charge you for.  Ordered the kids meal and still got charged for full combo. Chicken taquitos.  Sick all night. At least I got thru the concert before it hit me. Maybe it was the green hot sauce???","useful":1,"funny":0,"cool":0},
{"review_id":"fFC13U7-pKFjaEo6QoCn7g","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"PeLzCf2_GZlNZns2PLBueA","stars":5,"date":"2014-09-20","text":"Great food. Tasty and delicious.  Standard menu along with sushi and duck dishes. Lo Mein is mostly noodles not half of all other stuff like vegetables,  bean sprout.  Great sweet and sour chicken. I go back many times and enjoy it every time.","useful":0,"funny":0,"cool":0},
{"review_id":"94F_BlLLrbAIcqZ2Pu-jkg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"SYGbbZlLk81_bOlBptbS7A","stars":5,"date":"2015-02-22","text":"There is no better gyro then the special gyro at Kyklos with feta cheese on a warm pita. The service is friendly. Ask for samples.","useful":0,"funny":0,"cool":0},
{"review_id":"OXgAh97tVp6CtNAoo9-gEg","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"2Mp53KxlGeZJkodTuqpVow","stars":5,"date":"2014-09-19","text":"Make your own special pizza just the way I Want it.  Choose peppeeoni, feta, pineapple, olives, bacon.  Tasted fantastic together. Can add so much more.  They are quick preparing but it's got to melt together.  Worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"JV-yxKxMFp-d0rLDc_2_6w","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"zKw09ftu1730wEIZBZPoFg","stars":5,"date":"2015-01-04","text":"So relaxing combined with the meditation  and reiki. I'm still floating somewhere out in space. And breathing so much better. This was my first time and I will definitely be back.","useful":5,"funny":0,"cool":3},
{"review_id":"QLuRicyKk5S586y8v6-Dyw","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"h-1cbSCEMQlf3ampVX6pLw","stars":1,"date":"2015-04-16","text":"A place that serves shakes should have fatter straws, of course that won't help trying to get a 1 to 1-1\/2\" chunk of banana up it. A spoon would have been nice, too.  Also ordered the chicken dinner but did not get t he gravy or any other sauces. Total disappointment. Not going back here.","useful":0,"funny":0,"cool":0},
{"review_id":"pCI_lOMjwjt8XSZ1QpiQMA","user_id":"3mZFkwfa6XV0BBazRTva9w","business_id":"Z3y47L3EY-axAEVbwmXZaA","stars":5,"date":"2014-09-18","text":"Great ice cream. I had the pistachio in a Waffle cone. Prices are very reasonable and quality is outstanding.  I want to come back again and again to try some other flavors like chocolate brownie.","useful":1,"funny":0,"cool":0},
{"review_id":"ssRuiKQ02OngEWYeicXbKg","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"5o6qOFzZ4NrJ6bJ39ohCtA","stars":5,"date":"2015-04-11","text":"These are definitely the best Bagels in Arizona. I haven't been able to find a good NY bagel for awhile. Will definitely be back!","useful":1,"funny":0,"cool":0},
{"review_id":"P7dn8-9VmV7p8qbBIL2RHQ","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"h9ESVzpA6xQcFTzI4cX7ig","stars":5,"date":"2015-08-14","text":"I have been getting Haircuts from Eddie for a couple of years and can say that he is by far the best barber in the area. Eddie always cuts my hair exactly how I like it and has never disappointed me!","useful":0,"funny":0,"cool":0},
{"review_id":"XPh04emfzsueWM67uQNbXA","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"xSAAykOm0H7We4_i0vMjiQ","stars":5,"date":"2015-04-03","text":"I have ordered a lot of products from these guys. I've used other websites, but unique has always given me the best deals!","useful":1,"funny":0,"cool":0},
{"review_id":"3odv-pJBQi4sQVoKLwQaoQ","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"TuWw6Om50yA5jSXm7dma3g","stars":5,"date":"2017-12-19","text":"This place is definitely not your ordinary pizza place. Wow!!! Love at first Bite!\n\nThe name goes with the pizza. The crust was nice and Crisp, and you can tell they use quality ingredients \n\nI would definitely recommend checking this place out! I now have a new favorite pizza place in the valley.","useful":2,"funny":0,"cool":2},
{"review_id":"B7mYUwUvIllvgvGI3IzkAg","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"LPzx71DCvPyNIrPdbKLDbg","stars":5,"date":"2012-04-06","text":"Have brought all of my cars to John. He's by far the best in the business.","useful":4,"funny":0,"cool":0},
{"review_id":"Jg7xvdU7mlQPoLoADuzAxw","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"f4Y3634vku_QlaPTqmfQNA","stars":5,"date":"2017-07-30","text":"I've used Chris for a couple of different projects and he has done an excellent job. I highly recommend him for any projects for your home or business.","useful":0,"funny":0,"cool":0},
{"review_id":"6bzlzJj3jrbWSnXtv80D_A","user_id":"VTjCebjbadCMAGRoXvs7Zw","business_id":"0QBFtNNj9RIggZGeivcbEg","stars":5,"date":"2013-07-23","text":"Great food and service. Spinach enchiladas are my favorite. Beer is ice cold","useful":0,"funny":0,"cool":0},
{"review_id":"DMMRF5pMnwiFfaTFh_0k2g","user_id":"bnRVDXDKFMVlr3bnR1o89Q","business_id":"COnqdubhr87gCDJjPGwT6A","stars":4,"date":"2017-12-21","text":"I tried the food first time here and enjoyed it.Good food and service.I liked Chicken shawarma its really too good.","useful":0,"funny":0,"cool":1},
{"review_id":"eFZwGBf2Ec5e5FdHo76gQQ","user_id":"8xPI_sfHcSiHjEZ_qRMDIg","business_id":"jkqSUjv8qTvTJQKOPeLxMA","stars":5,"date":"2014-09-03","text":"As a first time patient here I was very pleased with my visit! Very friendly staff and knowledgable. My cleaning and examination went very smoothly and I felt comfortable.","useful":0,"funny":0,"cool":0},
{"review_id":"DiU3gQE-z6hJp19ZE5fRGg","user_id":"qsL5AGgqf9CFkUk9ffohkA","business_id":"zphJAv2g4uWYkzzhC2HiYw","stars":5,"date":"2014-04-18","text":"As an out of state bidder I can state that J. Levine Auctions provided one of the most courteous and professional telephone bid experiences I have had in over 40 years buying at auction in Los Angeles, New York, London, Paris and other venues. J. Levine's service is simply outstanding. I highly recommend doing business with them.","useful":5,"funny":0,"cool":0},
{"review_id":"WkvqPjxCzxzt3u-HefTaGA","user_id":"16BhG2NgKaPTKo7Kx_73wA","business_id":"qUfaMjN_45EuIlMrPhB_bw","stars":5,"date":"2016-08-19","text":"What a great experience for anyone needing any type of print services. I am a graphic designer and I have ordered from them before. They have been very helpful anytime I've needed help by phone or through chat. I am ordering again and Tina has been more than helpful on the phone even letting me know about their current promotions. I will be using them any time I need anything printed.","useful":3,"funny":0,"cool":0},
{"review_id":"0BwOQFAqvsIK1qqdcrQwEg","user_id":"AJVIsIzznYPDfuKm7tBg1Q","business_id":"Zo0DWTyHTSyKRVIWIYVf-w","stars":5,"date":"2016-03-16","text":"Came to this location for some pre-surgery tests. Staff was super friendly and absolutely great. I would highly recommend this location.","useful":0,"funny":0,"cool":0},
{"review_id":"CoL5mKHekMFoKW5MHCj6HQ","user_id":"AJVIsIzznYPDfuKm7tBg1Q","business_id":"6nbPXEjmBnDtsgM_YNwGjw","stars":5,"date":"2016-03-23","text":"I called in for a take-out order. The staff was super friendly.  They were completely accommodating as I continually adjusted my order. The food was completely off the charts delicious. Hands down the best Ahi Poke in the valley. The Furikake Chicken is absolutely amazing!  The portions are big and the flavors are wonderful. I will be back again and again","useful":1,"funny":0,"cool":1},
{"review_id":"LnSVbzwuHy_ZNa17EOm-IQ","user_id":"yw4rNufjosU5ahURAFOZUQ","business_id":"mIJO9f2A3gfj4ahAM0QBQw","stars":5,"date":"2016-04-30","text":"Great work done.  Had them run 3 lines of cat6 for high speed networking.  Also made a wiring cabinet in our upstairs master bedroom so all lines could be connected.  Also had them move an in-ceiling speaker to a different location and mount TV.  Was great work.  I love asking questions and the installers answered them all professionally without getting annoyed. Fast response, fast scheduling and fast implementation.  Will certainly use again when I need to run more cable in my home.","useful":0,"funny":0,"cool":0},
{"review_id":"hAVXzBzYm_yXfrclv4_9og","user_id":"yw4rNufjosU5ahURAFOZUQ","business_id":"hL5tldgv2eLcL-AUnPZ9gA","stars":5,"date":"2016-04-30","text":"Amazing service. The team at pure plumbing came out to check on a few things on the house I just purchased.  They looked at a old water softener system that was no longer functional. After discussion, they suggested a new system that provides softening and filtration.  I did NOT feel pressured for purchase.  Instead, they gave me all the information and allowed me to make my own decision.  After giving the thumbs up, they were back in a couple of hours SAME DAY with the new system and got it all installed.  All questions I had about other repairs on the property (replacing outdoor piping, checking for leaks, etc) were answered without ego or frustration.\n\nAnother problem they found was I had a leak in my laundry room that had been present for quite some time.  It caused damage to the drywall and required repair.  They referred me to an excellent service and repaired the leak by installing new valves.\n\nA couple days later, after moving in and getting my washer and dryer installed, I called AFTERHOURS and was surprised to get a callback almost immediately.  They came out next day to install the gas line for my dryer and check my gas fireplace quickly.\n\nThis service is amazing.  Had no issues and would certainly recommend them again.","useful":0,"funny":0,"cool":0},
{"review_id":"Cs5UYp8y4WPS3rzlRWjGbw","user_id":"cYJiJRGbuyQbWvcXOzY2Zg","business_id":"ThNGovQZjZ5mn-ZwX_N2BQ","stars":1,"date":"2017-08-31","text":"I don't usually take the time to share negative experiences however this one is unusually bad...I wish I could go back in time and choose any other hotel and save what was supposed to be a fun time in Vegas.  Parking is confusing and signs point you in general direction but stop short of guiding into the connected garage. I ended up parking in their overflow lot and walking half a mile through a winding set of corridors, elevator trips and turns to get to the front desk. It probably took me 20 minutes from car to front desk (if you decide to stay here, pay a few extra dollars and valet!). Next I learn my reservation didn't exist in their system. I showed several email confrmations and they promised to fix by the time I checked out in the morning. When I get up and attempt to check out, I come to find they have double charged me for the room and refused to call Hotwire to resolve.  The rooms are really nice, especially for the price, but be prepared to walk an extensive amount and struggle through the most complex set of twists, turns, multiple elevator rides and frustration to get to your room. It took us 10-15 minutes to reach our room each time we entered the property. Avoid this place like the plague if you value your time and courteous staff that doesn't make their problems the customers.","useful":0,"funny":0,"cool":0},
{"review_id":"nBLoV0U15sT8FuVENPyxOQ","user_id":"P0jepoKSYHs9DpUKxc_Klw","business_id":"698nukvxe7mq2Fra5vDikQ","stars":2,"date":"2016-06-17","text":"It was ok. I had the Loco Moco and it was good, but wasn't that great. I'll probably go for a steak and egg breakfast or one of the waffles or something next time. The serving for the chicken and waffles is huge too, biggest I've ever seen.\n\nHowever, for being a breakfast place, they need to step up their coffee game. This is some of the weakest and worst coffee I've ever had and that alone makes me not want to come back with so many options nearby.","useful":0,"funny":0,"cool":0},
{"review_id":"KLadJayf6GSCe0rxPbtuCA","user_id":"N3QcinahcFMvE3b1qcmmrw","business_id":"IPiRBDgjSFGOZeewrAVIMQ","stars":5,"date":"2013-01-17","text":"I find the last review (Riki L.) Very comical. I happen to be in the store the day she came in trying to pick up her table on that Sunday. Her paperwork clearly said Monday and she had the wrong day. In fact I had to stop getting customer service so they could help her. She was yelling through the store and cussing at them using profanity I had my children in there. Total white trash is how she acted. I had to stay in the store until after they closed because of her stunt going over to the other store. She went to pick up her table at the 59th Ave. and Bell location she put it in her truck and she left and never paid for.  The owners daughter on the E. Bell Rd. location called her several times as I was sitting right in front of her. Rik never picked up her phone. I would say in the 15 minutes before she called the police she had to have called for probably 10 times. She knew she owed the money when she loaded the table she should have paid for it then. Howie world was left with nothing left but to call the police to protect themselves. I have never seen someone in my life be so rude to people in a store as this Riki was. Howie world was not rude to her or mean to her. She wanted them to deliver something on a different day and hour before closing. And it simply could not have been done. Riki Did not read her paperwork for the delivery date she messed up and she wanted them to take the blame for it And she drove the other location picked up the merchandise and didn't pay for. You never know who's watching who's going to read these reviews it truly helps to be honest!","useful":0,"funny":2,"cool":0},
{"review_id":"mWzqnsFeHSzNim5El1G7QQ","user_id":"GudXzPScVDpoHXLxLtO4zQ","business_id":"PVuBYiGaPtpF3VFpvjJ91g","stars":4,"date":"2010-01-23","text":"Solid 4. \n\nTypically, there is not much on this planet that excites me more than fresh, local, organic ingredients on a sandwich, but when I can have that and a salad bar I am a happy little tree-hugger. \n\nJason's is an all-time favorite sandwich place of mine and of my fellow vegan foodie. The portabello wrappini (hold the cheese, please) and the salad bar with their black currant tea are the keys to the good life for lunch and a mid-afternoon craving for a friggin' good sandwich. (And of course, the occasional slide on the vegan diet for a much needed fill of cheese that can only be satisfied by their french onion or tomato basil soup- yummo). \n\nA few bummers-  the lack of veggie sandwich options ( I think there are only 3 or 4), which is why I pretty much order the same thing every time. But having this in mind, I haven't been displeased going there for my mushroom wrappini. \n\nThis is a good place to take anyone because they have stuff that everyone likes (even pasta for those who don't want a sandwich- in which case you should rush them to the nearest hospital because something ain't right- who goes to a damn deli and doesn't get a sandwich?). \n\ncheers and happy sandwiching, \nthe vegan foodies\n\n(written by Tara, the Karim in Karimaford- admittedly high strung half of the vegan.foodie.team )","useful":0,"funny":0,"cool":0},
{"review_id":"Ie9tprkeWTXUk1ZpeRYf0w","user_id":"22XsIqgvxcNjExB9UzjQmA","business_id":"CpPJ2UKAxDLwj95-HNFPHg","stars":4,"date":"2012-01-04","text":"Solid location; makes you feel displaced from the suburb surrounding area.  Coffee isn't making me twitchy yet, but it's only the first cup...","useful":0,"funny":0,"cool":0},
{"review_id":"egBTPo6XmOplA5ClLv6YZw","user_id":"VYU6ZQP58KkgqL2_o2QQhA","business_id":"KYkUtRB1QKrI6Twov98leA","stars":1,"date":"2017-03-10","text":"Horrible service. First, I wanted it to go and it was presented to me for dine in. Second, the sandwich was wrong, even after I asked if it was a BLT with Avocado. Good thing I checked before I left. And there was no acknowledgement of the inconvenience and wait time. That goes a long way. Will likely find another Einstein to go to.","useful":0,"funny":0,"cool":0},
{"review_id":"AXEe7ashu4GOMRX-oEjTGw","user_id":"VYU6ZQP58KkgqL2_o2QQhA","business_id":"UjvFjN1Aqp-pysEvpjelMg","stars":5,"date":"2017-01-13","text":"What else can I say about Mountain Park Chiro except for \"PHENOMENAL\".  From day 1 service has been exceptional. I feel cared for and cared about. Great Customer Service.  Keep up the good work.","useful":0,"funny":0,"cool":0},
{"review_id":"BLsyciNMIn1NcWqqMCHWWw","user_id":"BnIBIKZ5hqsD1HYYcDyCzA","business_id":"-Ht7HiGBox8lS1Y8IPjO8g","stars":5,"date":"2012-04-17","text":"In town on business and a friend recommended this place. I must say the food & service was outstanding! Had the Thai tacos for an app and the Cowboy burger as my entree. I'm from TX and have eaten a lot of beef in my time and their burger was damn good! Has my seal of approval.","useful":0,"funny":0,"cool":0},
{"review_id":"z-kvMQEgTkd6dlHuKhoM_A","user_id":"PURl_f97Tvp-blFADzFohA","business_id":"Z2iYtj0ybh_ovOyRD8bjMg","stars":5,"date":"2014-10-11","text":"Great people-watching bar, with a terrific beer selection and adventurous, mostly excellent cocktails. Awesome collection of spirits and amari. I have to give a nod to the bartenders, whom I found warm, exceedingly competent and friendly, even to some true meatheads. I'm so glad I stumbled across Atomic; it's a real highlight of this short stay in Las Vegas' fascinating and vibrant downtown.","useful":0,"funny":0,"cool":0},
{"review_id":"oe7z9R8ZaS0D93l-8pfUDQ","user_id":"TqA62bkhCTevlTB6AmVfow","business_id":"H6skMpg_g-sOrfTQf_Q5LQ","stars":1,"date":"2014-09-06","text":"This is probably one of my worst restaurant experiences. I ordered the food at 8.50 PM for home delivery and they never turned up even after 10.00 PM. When I oridred, they told me that they would deliver the food in 45 mins to 1 hour. When i tried calling them at 10, they were closed. Never ever order food here. The worst thing I had paid for the food but never got it.","useful":0,"funny":0,"cool":0},
{"review_id":"yiYtWslFko6rfTdI0HvFtg","user_id":"TqA62bkhCTevlTB6AmVfow","business_id":"1Vbt1GsmtQm2dkC4A2L_-g","stars":4,"date":"2015-09-07","text":"Great food...very affordable...the momos, especially are amazing ...they also provide free wireless..","useful":0,"funny":0,"cool":0},
{"review_id":"hndH-d02HfaTPGiMsOPDEQ","user_id":"VutyoCZNODBw67WRtvnCMA","business_id":"K7fip0nDFFdCC7OCnNOotQ","stars":3,"date":"2015-06-13","text":"Good view of bellagio Water falls. Music ok. Promoters doing usual pathetic advertisement. Typical Vegas club. Ok. It not amazing but it not horrible","useful":0,"funny":0,"cool":0},
{"review_id":"3o02BTJn5HVokdJ1Luz_cw","user_id":"VutyoCZNODBw67WRtvnCMA","business_id":"WUq8HJHIZU4uteB154XN7w","stars":4,"date":"2015-06-13","text":"Obviously not worth going to Vegas unless you are rich, and this club exemplars that statement. Kaskade good DJ and some others, but really overall this club is all right. Like all other Vegas clubs, It is overcrowded and obnoxious with random people. Good location being middle of strip. Overall, nothing stands outs compared to the other competitors.","useful":0,"funny":1,"cool":0},
{"review_id":"yB9n7NYagSm3hAIoRGjg8Q","user_id":"hQvqcFOhIQuX7yt1FmHOGQ","business_id":"uxKGdN6hKQniEKV7J6_DsQ","stars":5,"date":"2015-05-21","text":"The staff is all super friendly. The atmosphere isnt divey, depending on who else is eating there. I really like their Pho. It is great when you are not feeling well and will most likely leave you feeling better. I always get it with meat but end up getting seconds and thirds of their rice noodles before even touching the meat. The soup is so delicious by itself.","useful":0,"funny":0,"cool":0},
{"review_id":"cG8IGjNzpaTLjKpDboBnPg","user_id":"Pfl95BRzikUQ3Rn4hohmfA","business_id":"Kt4jEhVbVoEqCl1VsOqlfA","stars":5,"date":"2016-05-03","text":"Today Dr. Veena and Julie came to our home and helped my family say Good Bye to our beautiful Louie. My children and myself were with Louie holding him and loving him. At these times, one is not able to think straight, Dr. Veena and Julie were a true blessing, guiding us all in every step of the way. They were our guiding angels in my family's time of sorrow. And they made Louie feel as if they've known him forever. Thank you soo very much Dr. Veena and Julie. The Osborns","useful":0,"funny":0,"cool":0},
{"review_id":"3Jqk01r2A9cLGSekhbrV8w","user_id":"HbLMYOEK7hdhI44qWZA_mA","business_id":"2KWkeOk1KaH50Es_A-8cnA","stars":5,"date":"2017-04-22","text":"The menu at this place was almost too much. I wanted to try it all. I opted for the pancake flight (try the peanut butter cup ) their house made chicken sausage was also amazing. Cool retro decor. Highly recommended","useful":0,"funny":0,"cool":0},
{"review_id":"i-MF_To-7NsyeVLW_PlUxw","user_id":"2v24FLR0gBPg0gw_AQvu4A","business_id":"cYo-gd6nqXNXHMZoJrM6hQ","stars":5,"date":"2014-03-02","text":"I have had the distinct pleasure of working with Jonathan during a recent shoot. Being an internationally published fitness\/bikini model, I have been blessed to work with so many photographers and Jonathan is one of the best! He stayed in communication with me leading up the shoot and came ready with ideas on the images he wanted to create.  Our shoot was long, taking advantage of our paths crossing, and he afforded breaks whenever required.  Incredibly fun and incredibly comfortable, I was very pleased with the whole atmosphere. \n\nHis images are ALWAYS beautiful and I was so anxious to see some of the work and he didn't disappoint!! I received several shots in a timely manner and THEY ARE INCREDIBLE!! MAGAZINE QUALITY FOR SURE!! THANK YOU SO VERY MUCH!!","useful":1,"funny":0,"cool":0},
{"review_id":"z4oKLavwr1HVK2ow9nQX2w","user_id":"xVd0b2ryzceCcBPw1l-33g","business_id":"NbigxJ5d_wNk92Wm_2lF8Q","stars":5,"date":"2017-07-11","text":"Called them this morning at 8:15.  They called back a little over an hour later.  They were here a little after 10:00 and done by 11:30.  They fixed a problem that many others had tried to and couldn't.  They, also, fixed two serious leaks.  I am very happy with them and will be working with them in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"hIcz7NkKxSHZk6_g_XtMww","user_id":"xVd0b2ryzceCcBPw1l-33g","business_id":"FndkIvEO5vjb0s8cRpzsKg","stars":5,"date":"2015-07-31","text":"One bathroom and the laundry room flooded in the main house.  Intermittently had problems flushing the toilet in the guest house.  I called at 8:15.  They were at my house by 9:00.  Had problems in both houses fixed by 10:00.  Service person was Mekie.  He was great!  Receptionist was great!  Very good price.","useful":0,"funny":0,"cool":0},
{"review_id":"aY_FpB3W6ZgJn3tSl91vsg","user_id":"xVd0b2ryzceCcBPw1l-33g","business_id":"uoaXG4PDHuFYRMftxWtMyw","stars":5,"date":"2015-03-18","text":"I was looking for variety and different levels of exercise.  That is what I found with Yoga for the Soul.  I like this place better than any other I have found.  Wendy is awesome!  The Piloxing class on Saturdays is spectacular!","useful":0,"funny":0,"cool":0},
{"review_id":"eImVGLtS5Gs381Vo-JYIFg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"uuGlYAIvYAX1q1KhpY6dtA","stars":5,"date":"2011-09-21","text":"Wow! I love BRAND STEAKHOUSE!! My husband and I went here for our 1st wedding anniversary. The food was absolutely perfect. The service was top notch. \nWe began with the hot rocks appetizer. The steak was thin sliced and had a marinade that was full of flavor. You cook the steak to your liking and eat. Wonderful idea.. After the appetizer, I had the wedge salad. The presentation was beautiful and the flavors were consistent and well balanced. Yum. My husband had the caesar which he enjoyed.\nWe both had the Filet Mignon medium which was cooked to perfection. The side sauces were so good and really brought out flavors of the meat. We ordered the asparagus, the mac and cheese and the garlic mashed potatoes. My favorite was the mac and cheese... Seriously, I wish I had the recipe.. They were amazing!! The asparagus was not soggy which I find is the case alot of times. They had a fire roasted flavor which I enjoyed. The garlic mashed potatoes were great also.. some of the best I've had.\nOverall I think that Brand Steakhouse is one of the best steakhouses that I've eaten at. It should be in the top five of Las Vegas... I will definitely go back. I dream about the Filet with their signature steak sauces and the baked Mac and Cheese. \nThe atmosphere was also something to be admired. I kind of relaxed yet elegant feeling. Just perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"R6aO59fF_122zjxJdCdr5Q","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"lfXfxBms5z1nwzkxxLFBWg","stars":3,"date":"2011-09-21","text":"I have mixed reviews about Gardunos. The bean dip is really amazing which keeps me coming back for more. It is addictive....\nThe food however could use a little love. I did have success with the steak fajitas this last visit and those where great! The steak was tender and full of juicy flavor... \nThe beef enchiladas need help. They are flavorless, dry and very spicy. \nI would never order their tomale ever again since they add food coloring to make it a turquise blue color for some reason... It just seems wrong.. and is probably unhealthy.\nI also feel that the pricing is a little high for mexican food. Im sure that they get away with overpricing their dishes because their main clientel is tourists but as a local, they need to have better food or lower their pricing.","useful":0,"funny":0,"cool":0},
{"review_id":"tuQSSWuRUK63dmBvjUjs8Q","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"SkiV_RLC0wy1fqWM2rBTHg","stars":5,"date":"2011-09-22","text":"I love Roy's Liquor! This place is personable and welcoming. Roy, Charlie and Bettie are all very kind and informative. \n\nThe selection of wine is great! I am a Sommelier and choose Roys because he is always seeking out what the customer wants. He has a large variety of many regional wines, old world and new world.. He has a great beer selection including my favorite IPAs and seasonal selections.. If he doesn't have it, he will get it!! The cigar room is amazing.. I haven't seen one as pristine and well stocked as this..\n\nIf your looking for a local wine\/ liquor\/ cigar shop... this is the place.","useful":6,"funny":0,"cool":8},
{"review_id":"eRXujz8EkDQvY_rksjMd0w","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"WyZAeMGsjUE7OToI4Jdqfw","stars":5,"date":"2011-09-21","text":"I love Chipotle!!!!! The food here is excellent. You also cannot beat the price anywhere. The company is very respectful and practice their Food with Integrity motto. I think it is great to see a restaurant care as much about the source of their product as they do about what goes into their pocket. Many other companies should take note. \nThe steak, chicken, pork and barbacoa are incredible. All slow cooked to perfection, the flavor profile of every ingredient that goes into each meal is compromised. \nI normally order the bowl here which i order with rice, black beans, med salsa, corn, sour cream, cheese, lettuce, and guacamole. Yuuummm...\nSo good and always enough left over for late night snacking. The chips here are fresh and perfectly salted and the salsas are full of flavor.\nI will forever be a loyal customer at Chipotle!!","useful":0,"funny":0,"cool":0},
{"review_id":"KCONsM-KafVziblEWs5vMg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"VxZ-CAj2EfRZhaxX_UV7TA","stars":5,"date":"2010-08-16","text":"Love this place!!!! Great atmosphere, friendly service, knowledgeable staff. I moved here from Euphoria. I had no idea what I was missing... and the prices for my services are actually cheaper here. \nAnother reason the Nail Bar stands out to me is that it is very sanitary and clean. All of the tools are either one time disposable or go into a UV sterilizer light. \nAlso, the pedicure chairs are amazing!!!!!","useful":8,"funny":2,"cool":2},
{"review_id":"cuLk5YcdjOq18fn1EItrnA","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"ugf6qjoG5h6VXR5-vpq0Qw","stars":4,"date":"2011-09-21","text":"I love the atmosphere. It is nice to have a kick back place located next to Summerlin that is open late. \nThe food is okay.. The patio area is fun and inspiring. \nI go here to nibble on food and maybe enjoy a cocktail.","useful":0,"funny":0,"cool":0},
{"review_id":"sQJH9sibaB8YiEiE4-Rysg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"lIdzQkSWB8HpX0ac4isKnA","stars":5,"date":"2012-05-11","text":"First of all, Pico Madama has the Moxie crew but is in a new location. Very professional as always. The salon is very clean and somewhat retro. \n\nMy husband has been going to Ama for about a year now for his hair cuts. He will not go to anyone else. She is very meticulous and always does an incredible job. I finally took his advice and had a haircut done by Ama yesterday... I am amazed by the quality of services she rendered!! She understood exactly what I was looking for. I had a gloss treatment done as well and now my hair is as shiny, healthy, and lustrous as it's ever been.\n\nI would absolutely recommend Ama if you are looking for a quality haircut!!!","useful":2,"funny":2,"cool":2},
{"review_id":"XuTHEHtQVlP_j5qhqOT4lg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"Qy_tDaVTWlS14fEglzo1Tg","stars":5,"date":"2010-08-16","text":"I love Rachel's Kitchen! The atmosphere is very relaxed with an upscale feel. The service is fast and effiecient. I love the chicken caesar wrap, the 440 sandwhich and the onion rings are seriously amazing... Cooked to perfection everytime. \nThe breakfast here is also very good. I had \"the favorite\". It consists of three eggs scrambled with goat cheese, sundried tomatoes, avacado, mushrooms and basil. The breakfast is served with breakfast potatoes and toast. \nI highly recommend this restaurant to anyone as I always do.","useful":3,"funny":1,"cool":2},
{"review_id":"vKUcBUBQhziaXRKBRIZvMg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"vKvXz-mTPBKwrOYUeN1u9Q","stars":5,"date":"2013-07-04","text":"I went to Another Wild Hair to get my hair cut and styled today. Lisa was my stylist and I have to say that she did a beautiful job!! I had her give me bangs which I was a little nervous about but she nailed it. I am so happy! I feel like a new woman. \n\nThis location could use some love.. Some nice lighting or some upgrades but still I would highly recommend this salon to friends strictly basing this review on the services that were received.","useful":0,"funny":0,"cool":0},
{"review_id":"ZW0gJXJBfZ6B1ipsN4Hz3Q","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"T3ASfec34b8-uYr3xZj8Lw","stars":2,"date":"2011-09-22","text":"I grew up going to PF Changs.. Mostly locations in California. \nThis PF Changs however is in desperate need of help. My husband and I have visited here two times to be met both times by slow, incompetent service and slow, poorly cooked food. \nWe will not be returning to this restaurant.","useful":2,"funny":0,"cool":0},
{"review_id":"-MpQ6FnoNflWNVg1ET7A_g","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"H8qlBw1YaxMsItfz25-AyA","stars":4,"date":"2010-09-19","text":"I really like it at john cutters. I've had the tbone and the filet mignon. The steaks are always cooked perfectly. The JC salad has mixed greens, vinigarette, feta and pine nuts. The fries are fresh. I order the BBQ sauce for dipping even though the fries have such good flavor already. I also really like the chocolate cake. The atmosphere is a little loud and a little dark but overall I will keep eating here.","useful":0,"funny":0,"cool":0},
{"review_id":"-U7msAVtf_bWAp0ELcpzwg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"OVTY-NpcTA7iXbMQmusv3A","stars":5,"date":"2011-09-21","text":"This place is always poppin!!!! I love it here and the food is great! The one thing i wish was different is the parking... I have been coming here for years and parking is always an issue.\nSome of my favorite dishes include the french dip, the bbq chicken salad, and the balsamic glazed chicken. The pazookis arent bad either;)","useful":0,"funny":0,"cool":0},
{"review_id":"MR4MsuIWq-naHCTnKuO56w","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"6PQve0oFCLPSh4wnIzvJtg","stars":5,"date":"2013-10-10","text":"I love Buon Gusto Ristorante! \n\nMy husband and I had dinner here for the first time a few days ago and I am so glad we did! From the moment you walk in the door you feel as though you've walked out from Las Vegas and into a quant yet classy restaurant somewhere in Italy. The staff was also very professional and quick to fulfill every need. \n\nRight away our server brought out fresh, hot sliced bread with olive oil, garlic and balsamic... Wow! Great start to our meal.. I ordered the pasta with garlic and olive oil which included a salad with their house made ranch(which was creamy and delicious). My husband had the lasagna which came out piping hot.. still boiling in the pan.. I can definitely say that the lasagna was the best I've tasted.. the presentation being a plus. His dinner also included a salad which he upgraded to a caesar salad. To top our meal off, we had Chef Joel's signature bread pudding for dessert. WOW!!!! I would come back specifically for this dish. It was served hot with an addicting rum sauce as well as freshly made whipped cream that had been frozen to deliciousness. \n \nI would definitely recommend this restaurant to anyone. We cant wait to return.","useful":2,"funny":0,"cool":0},
{"review_id":"wYbeErQ_vUd5DYMnasKuGA","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","stars":3,"date":"2011-09-21","text":"I really love Archie's Thai Kitchen. My husband and I have been going to the Flamingo location for years.. We normally order the Pad Woon Sen, the beef fried rice and the wonton soup which is incredible..\nWe have had unpleasant experiences here at this location several times now. It is closer to our house than the Flamingo or Rainbow location so we really wanted it to be more convenient for us. Sadly enough, every time we go here our order comes out wrong. We order a spicy number 6 and no spice is added, we order a spicy number 4 and it burns our heads off. We don't run into this problem at any other location. \nWe have also been to this location and it is super busy and their is no one to help us sit or order food. \nNew management is needed here. They really need to change these things. I would love to frequent this restaurant but find that it is hard to trust that our food will be done consistently.","useful":0,"funny":0,"cool":0},
{"review_id":"5Qu2S5FWyXz1pp1s55AbZg","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"CHW_DPKnTqudyRaDa4vwkg","stars":1,"date":"2011-10-05","text":"This McDonalds needs help...\n\nI used to travel alot and Mcdonalds was always the \"go to\" fast food restaurant for us. Always consistant food and fast convenient service.\n\nThis branch is a very poorly run store. The last few times I have gone thru the drive thru the man taking the order was very rude. (the same person i think).. Could not seem to awnser any questions or be polite in any such way. And the food was sub par.\n\nTwo nights ago, we went to grab a quick snack wrap.. We were greated by a big man who had a very poor attitude. I thought maybe he was just having a bad night?? As we pulled to the counter to grab our order a car from the drive thru went around us to leave. He actually yelled at the man who takes orders that he needed to learn how to treat customers. I then knew that the rudeness that was suspected was not just my imagination.. \n\nTonight was the absolute last time I will ever go here.. We went thru the drive thru around 12:00 AM and for some reason the man who normally takes the order said that they would be closed for 15 minutes for a break??? This is supposed to be a 24 hour location. I wasn't sure if he said 15 or 50 minute break so I asked him when they would re-open to have him yell 15 back in the headset? Some seriously bad service. \n \nI will pass the word on that this location has inconsistant food and horrible service. The management at this fast food branch should be fired as well as the employees who seem to think that yelling at customers and treating them poorly is okay to do.","useful":0,"funny":0,"cool":0},
{"review_id":"20P4mGwJO3RQyfs_AN0VeA","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"PgQZfKQwW6Q9fIvViD7Xrg","stars":5,"date":"2011-09-22","text":"The location is great! The prices are spot on and the environment is relaxed and comfortable. \n\nThe salad bar is fun and they have a pretty descent variety of offerings.\nThe soups are always great. The chili which was one of my favorites, the chicken pot pie, the beef stew,and the tortilla chicken. Jasons Deli always hits the spot when you are looking for a quick and healthy meal.\n\nI also LOVE that they have introduced their healthy initiative.. Yay Jason's Deli!! I am a loyal customer!!","useful":1,"funny":0,"cool":1},
{"review_id":"jaNeU0Fji2D9uqg-vpZiXw","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"uufFYaIiNeISTgzSsEcYwg","stars":3,"date":"2010-09-19","text":"The atmosphere here is nice. Good variety of music. My fiance and I came in for a late night meal. I had the cheeseburger with onion rings. I do like all the additional items you can add to the Burger. I added grilled onions, Swiss, and mushrooms. In all my meal was pretty good. We started off with the chicken wings which were also pretty good. The service was the best feature here. The only complaint I have is that the staff was hanging around the bar getting drunk. It seemed pretty unprofessional and kind of rude.","useful":1,"funny":1,"cool":0},
{"review_id":"TjXARDnt6_rQCCVAJQ15SA","user_id":"hvZ5o9YNJJ-TVCcdT42VoQ","business_id":"w8RWhhuKxMiFCpvFvIQ3zg","stars":5,"date":"2010-09-19","text":"Wow!!!!!! This place is incredible! Its like a chocolate heaven. The menu is full of a variety of food (not just chocolate). I had the club sandwich which was served with Chipotle Mayo(yum) as well as waffle fries sprinkled with chili and cocoa powder! The fries were great. I had the eighties chocolate shake with my meal. Soooo good!!! I can honestly say that that was the best shake I've ever had! After my meal I tried the chocolate popsicle fondue. Amazing. \nI would highly recommend Max Brenner to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"a256TA2yJIzEr1dvfmi8_A","user_id":"H-wlEP96IRjEqZ7p4XZrpQ","business_id":"IMLrj2klosTFvPRLv56cng","stars":5,"date":"2017-03-07","text":"Where here with a group of 90 people and we were welcomed, served immediately and had an amazing meal and service without feeling rushed.  Highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"yYLAOKFF5oNOwcANAmvVAg","user_id":"5udPKInkEh3XJjBHSIK79A","business_id":"DVJkxZkLKS76Khb2y6XA6A","stars":5,"date":"2016-02-08","text":"I have been here 3 times absolutely love the food and smoothies! Tastes so good its almost unbelievable that it is all healthy! Also, the service I received each time was awesome and fast. The tall blonde boy helped me each time and explained a lot about the menu and suggested his favorites. Will be recommending to all my friends and family:)","useful":0,"funny":0,"cool":0},
{"review_id":"wYJpWVCAQ7D9-VEG9-BB0Q","user_id":"73Uy-Dnn5imqhxkdttteFA","business_id":"SzfC5CWkFRap2X4bG_CtPg","stars":1,"date":"2015-11-19","text":"It was a disappointing experience when I patronized the Thai Express at Bayview Village. I ordered a Noodle Soup and a Stir Fry. The noodle soup was so-so but the Stir Fry was a disappointment. This happened on Oct 25th afternoon - please refer to the attached picture of receipt. First, the chef thought it was just stir fry with no rice, and later on someone came over and put the rice back and gave the dish back to me with no apology. The Cashier was not interested in saying hello or trying to promote what's good in the restaurant. She didn't want to look at us in the eye - it's a bit rude honestly. Well, the owner smiled but that's the person who cared. \n\nBack to the Stir fry, take a look at what we got vs. what's up there on the menu board. The menu board stir fry looks a lot better - nice pieces of beef with broccoli and fresh veggie. Look at what I got! Lots of bean sprouts, which were not cooked very well. I was told it's the way they make it - it's Thai. Yes, it's true, but the bean sprouts reeks because it's not cooked well. Why? It's not fresh!!!!\n\nAnyway, I was about to complain but when I checked out the Pad Thai another customer got across from my stable. It's merely two pieces of shrimp mixed with noodles. It didn't look too good either. I was like, well, I might as well save my breath. \n\nI mean, I have been a Thai Express fan since the day it was born. I like your Mini Soups and your Noodle Soups. Once in a while I visit your restaurants, but this time, it's the huge disappointment. Your menus aren't cheap. It's comparable to a fine dining Thai restaurant and I expect something better. \n\nIf you wish to keep us as frequent customers, you have to do a better job.","useful":1,"funny":0,"cool":0},
{"review_id":"GkLJBNhJe6_IqVP0VIO4NQ","user_id":"73Uy-Dnn5imqhxkdttteFA","business_id":"TLp092gHMUnGPDE0U8gSxg","stars":3,"date":"2015-11-24","text":"Thanks Alex from Storage Mart for the follow up. Appreciated your help and your willingness to satisfy your customers :)","useful":0,"funny":0,"cool":0},
{"review_id":"T6_pthpsYTAfbuxZ2dpw7w","user_id":"73Uy-Dnn5imqhxkdttteFA","business_id":"2cYTy7YlmlS9uuuQI1Trzg","stars":4,"date":"2015-11-22","text":"Interesting Place! \nI love the Shrimp Soup and the sausage in 'flame'. We should have had the Seafood Platter but instead we got the steak. The owner was friendly and so were the staff, but super busy place on a Saturday night. Great place for casual Portuguese dining.","useful":0,"funny":0,"cool":0},
{"review_id":"JZF56oxbM_XYb3BWGtFIjg","user_id":"3HKl0YriGNXOGkSgzAZFOQ","business_id":"JdywUXidDtRhjuKdJC-SVw","stars":5,"date":"2016-04-10","text":"A great team with Dr. D.  They always make my daughters feel comfortable and they explain everything to me and my husband.  We are still in treatment with our oldest daughters but I am confident that her smile will be fabulous!  Dr. D is a top notch orthodontist and his staff is friendly, professional and efficient.  All concerns are addressed promptly and with compassion and care.  I would not take my daughters anywhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"_-i3RHnbr4eov9t-YkzgTQ","user_id":"3HKl0YriGNXOGkSgzAZFOQ","business_id":"llCxryWr8j1S39tusYCWxg","stars":5,"date":"2016-09-03","text":"I'm not one to gush but what a great place.  This is better than NY pizza.  Everything is fresh and flavorful!  Garlic knots were crusty on the outside, soft on the inside and did I mention the flavor. The staff is fun and attentive.  Can't wait to come here again!","useful":0,"funny":0,"cool":0},
{"review_id":"2-MOEheHLxqeO80v_JpKfw","user_id":"3HKl0YriGNXOGkSgzAZFOQ","business_id":"Bt4Wq3orQDxwFnQpgcVrHA","stars":5,"date":"2015-02-15","text":"A completely, wonderful experience.  Highly recommend driving any of these cars or riding in the pace car!  Great and caring group of people who want everyone to have a top notch experience!","useful":0,"funny":0,"cool":0},
{"review_id":"sZPFNTH3CDOn_YLS7qmJWA","user_id":"oxgzn8jCiTOWxeCchXbf3w","business_id":"OPSNdO3LNPMt7qz1MNb42g","stars":1,"date":"2017-05-08","text":"Nothing special about their Indian food and costly!\n\nOrdered butter chicken and asked twice if it came with rice. Both times they said yes. Walked over to pickup the order and brought it back to my place to eat to only find out that there was no rice!!! Called and told them that they forgot my rice and told them to give me discount. They said no. So told them to deliver and waited but they never came!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"iyD_RDYHpvXajvIm49HhLg","user_id":"oxgzn8jCiTOWxeCchXbf3w","business_id":"dd3GZs6zW2t7BM0cbxAzvg","stars":3,"date":"2015-08-13","text":"Was expecting to be better than what zagat rated it for. Nothing special but not over priced.\n\nIt is what it is. Not exceptional.","useful":0,"funny":0,"cool":0},
{"review_id":"EygwEO4XT-pFlUHrnFQCMQ","user_id":"oxgzn8jCiTOWxeCchXbf3w","business_id":"sa1ZAswk7kEQfg9Mb6iQwQ","stars":5,"date":"2016-05-28","text":"This is probably one of the best restaurants in all of Toronto. Do what we did and you won't regret it. We didn't want to pick from the menu instead told them to pick for us including the wine. We were 6 people.\n\nIt was out of this world! L'Unita has some crazy talent in the front and in the kitchen. Their manager and sommelier, Rob is one talented son of a bitch. He chose some amazing dishes and perfect wine to pair and kept it all reasonable without gouging!\n\nIf you haven't tried L'Unita then you have missed out on some amazing food porn!","useful":0,"funny":0,"cool":0},
{"review_id":"bEsvNgJdSebvOh7hcuhaOg","user_id":"uBurjKlcA9pj7U6fSNmZIQ","business_id":"Cp-clhAJs3NJRwXpXk_saw","stars":5,"date":"2013-12-08","text":"I love this bar. It's cozy and because it's small it is an awesome place to meet other people in the neighborhood. A great place to go when you just want to feel \"home\".","useful":0,"funny":0,"cool":0},
{"review_id":"C6OTWcKSGPQbPstZ3VdXwg","user_id":"uBurjKlcA9pj7U6fSNmZIQ","business_id":"hNsRj2nXuALlJS4Op-8MmA","stars":3,"date":"2013-12-08","text":"The Garage does not have great food....but it is a great place to go for a late night cocktail. When I'm not in the mood to be in a bustling bar, but just want to go somewhere for a nice conversation, this is usually my stop.","useful":1,"funny":0,"cool":0},
{"review_id":"ZoY1cT-Bfff868FfCJn0jA","user_id":"uBurjKlcA9pj7U6fSNmZIQ","business_id":"wOk2b8zUHWylJOd6FtNsRw","stars":4,"date":"2013-12-08","text":"Yes...the service sucks. Yes...the ambiance leaves you wanting \"more\"....but who cares! The food is amazeballs! Best chips and salsa in town and I have never had a bad thing off the menu. This is legit Mexican food and if you are a foodie, you will not be able to shut up about how good your food is while you are eating it. I hope the bad service and horrible decor don't kill this restaurant because the thought of never having those flour chips again makes me wanna cry.","useful":0,"funny":0,"cool":0},
{"review_id":"JhAfb3zNoo0apt79-P7L3g","user_id":"uBurjKlcA9pj7U6fSNmZIQ","business_id":"wB2mrl_xHyj55UObucaVRA","stars":5,"date":"2013-12-08","text":"Ollie Vaughns is adorable! had the grilled cheese without mushrooms and added tomato. It was heavenly...crispy on the outside and melt in your mouth juicy on the inside. Yum!","useful":0,"funny":0,"cool":1},
{"review_id":"aAPf3U040O7lOFzRCh7CGA","user_id":"uBurjKlcA9pj7U6fSNmZIQ","business_id":"j_prxgHnMvuRdrGjAI9qXQ","stars":4,"date":"2013-12-08","text":"So...I'm not usually one to frequent corporate restaurants....but I can't stay away from those dang frozen margaritas! If it wasn't for them, we wouldn't eat here half as much. I would give the menu 3 stars, but there are two great things on the menu. The chili pork verde and the diablo chicken pasta. Can't go wrong there...and the Tejas trio is great to snack on if you just want a small bite.","useful":0,"funny":0,"cool":0},
{"review_id":"2licOFRCdamLfLbzWjWJIw","user_id":"XoiBk3HfY0F5WSBgDPZFog","business_id":"hq_vUJwOEvkNCD8f601eEw","stars":5,"date":"2017-08-13","text":"There are so many great things to say about working with Rebecca to find your new place in Toronto.\n\nAs an international renter, the idea of trying to find a place to live in a very hot real estate market was beyond daunting. I did some research online and time and again the advice I came across was to get a realtor. This then led to the next challenge: how would I choose my realtor? \n\nAnd to Yelp I went. Rebecca's name popped up near the top with great reviews stating how professional and involved she was (both very true). Upon visiting her website, I was instantly struck by how straightforward and open she seemed. Her bio is down-to-earth and includes details that make you feel comfortable and like you're about to get down to work with an old friend.\n\nTo me, she was the obvious first and only choice. I'm so glad I picked her! \n\nAfter sending her a detailed email of my situation and rental needs, she replied promptly and with positivity, reassuring me that while my situation was unique, it was hardly impossible. She set to work adding me to a database that would email me potential rentals that featured the specific things I was looking for. So awesome to be able to apartment hunt from your inbox! \n\nI did indeed find the perfect place, and I couldn't have done it without Rebecca. She made communicating with the landlords and their realtors a breeze and was able to prepare the lease and handle other details, freeing me to focus on other things associated with an international move.\n\nRebecca actually cares about her clients, and finding them the right rental or forever home is both her goal and her specialty. If you are looking to rent or buy, Rebecca should be your go-to choice.","useful":0,"funny":0,"cool":0},
{"review_id":"ufRC-QtDN3MCiB1Q1xV16A","user_id":"XoiBk3HfY0F5WSBgDPZFog","business_id":"QfIJFYIVeZQ3phDJ96JRmw","stars":4,"date":"2017-08-15","text":"As a recent transplant to TO, I was worried about finding the right shop to process and purchase film. THIS IS THE PLACE! \n\nBecause I'm strictly a film photographer, I was looking to find a store that would offer great support in terms of my analog needs. I tried one other place in the city and was disappointed by their crappy customer service and the fact that they kept their film stock hidden away from view. \n\nNot at Downtown Camera. With a wall made of vintage cameras and a range of films right out in the open, I knew this was going to be a good fit.\n\nNot only do they have E6 outlab services, their turnaround time for film processed in-house is quick, and you can receive text or email updates to know when your film is ready. And they offer a punch card (for in-house developing only) to keep track of the film you've dropped off -\n once you've hit your ninth roll, your tenth is free! \n\nSeriously, if you are still shooting film, are only shooting film, or just getting into shooting film, this is your go-to lab and photo store! With so many places choosing to only cater to digital shooters and doing away with film processing altogether, we need to take care of the stores that are taking care of us! Make your film cameras happy, come into Downtown Camera! :)\n\n*UPDATE*\nAs I've been taking more and more advantage of the film processing services at Downtown Camera, I've become aware of a few issues that I find problematic. Thus why I've felt the need to alter my original review. First, the customer service is very touch and go. Some days I go in, and it's fantastic. Other days, it's as if the person behind the counter is going through the motions. The assistance you receive is never consistent, and that's pretty much a bummer. Second, and even more disheartening, is the fact that next day film service at Downtown Camera is now three or even four days processing time, something that seemed to have started within the past month. I inquired about it possibly being due to a large influx of film to be processed, but the person behind the counter claimed that this was the norm. Not sure how next day can be advertised as such, but I do know that there are other film processing places in TO that will develop your film either that day or the very next day, dependent on how early in the morning you drop off, and that is their regular service. Just a few things to consider when assessing your film processing needs.","useful":2,"funny":0,"cool":0},
{"review_id":"pPO7Mg2t8BHt3F89LAnwag","user_id":"XoiBk3HfY0F5WSBgDPZFog","business_id":"AuijWOQLSYGRCZKH0SZqcA","stars":1,"date":"2017-08-18","text":"I'm new to Toronto and wanted to get a pair of boots for the upcoming fall and winter season. I looked online and saw that this store carried Blundstone boots. The official Blundstone site even listed this shop as having the boots I wanted - #584 - in stock. \n\nAnd then I went inside. The saleswoman wasn't what I'd call warm, but coming from NYC, I can be used to brusque salespeople. She informed me that they did not have my size in that particular boot in stock, but that I could check back in September. I then asked if I could try on another pair of Blundstones just to see how they feel on your feet since I've never owned a pair. The saleslady seemed put off. She told me that they wouldn't fit the same as the winter boots. I told her, I was aware of that, but if I was in the store, I'd still like to try a pair on to see if I even like the brand, especially if I was to wait until September for the ones I want. These boots aren't cheap either, so yeah, trying any pair on can give some insight into their fit.\n\nShe actually continued to dissuade me from trying them on. Someone whose very job revolves around getting people to buy shoes. It was confusing and she came off seeming like I was putting her out by asking her to pull a box of boots from the back. \n\nI repeated again that, if I'm going to spend that much money, I want to know what I'm getting into, and would like to know how any iteration of the boots fit. She finally acquiesced and went and got me the boots.\n\nWhile all of this was going on, I felt awful. Unwelcome and unwanted. There was literally one other customer in the store with her mom. And me, being treated like I'm dumb for wanting to try on a pair of shoes.\n\nI can say that many other stores in Toronto sell Blundstone boots and I would suggest if you would like to experience being treated with respect and decency, to avoid this store. Especially as a new arrival to this city, this kind of experience leaves me feeling flummoxed and bummed out. \n\nI should point out that I proceeded to pop into five or so other shops after going into this store, and every salesperson that greeted me did so with enthusiasm and kindness and provided exemplary customer service.\n\nWe all make choices with our wallets. I personally wouldn't spend my money or my time in this store in the future, as they made it very clear that I wasn't worth theirs.","useful":2,"funny":0,"cool":0},
{"review_id":"wH9ba46MH8dYb-m8pT3guA","user_id":"XoiBk3HfY0F5WSBgDPZFog","business_id":"egLYFnycp8ktxMCvilFdLw","stars":5,"date":"2017-08-14","text":"John's place is:\n\n* Fast - I was in and out in less than 10 minutes.\n* Friendly - I've never met someone so genuinely kind and interesting all in one go. And he loves taking photos, so the experience becomes something special.\n* Fantastic - The photos are fabulous. He really does a wonderful job making sure you leave satisfied. \n\nGet to Chinatown, climb the stairs up to the studio, and you'll have the best looking passport photo you're ever going to find!","useful":1,"funny":0,"cool":0},
{"review_id":"lQK6NI28LE8DwEbXcXbsvQ","user_id":"XoiBk3HfY0F5WSBgDPZFog","business_id":"GexEfiyVAtNjrBFYMwJEWA","stars":5,"date":"2017-08-18","text":"Wow! This place is amazing! A great running store, yes, but the nicest people around also happen to be staffing it.\n\nI went in with questions about running clubs in the area and left with new shoes. The entire process couldn't have been easier. The woman helping me was genuinely kind, answered all my questions, and was quick to bring out any pair of shoes that she thought might work for me and my running style. She even helped me determine whether I've been pronating\/supinating with their bio-mechanical analysis. She was thorough and friendly and it made my time in the store pleasant and super enjoyable.\n\nIf you're on the market for new running shoes, gear or just have questions about getting together with other runners, this should be your go-to spot.","useful":0,"funny":0,"cool":0},
{"review_id":"rg1EwtgVlvkpLq3o7sflRQ","user_id":"UQbMNLQBy7niCn5z6nhEuw","business_id":"OicpDroqnfmbtw5jSgf4lQ","stars":5,"date":"2016-03-17","text":"I called several places after my car accident and Craig P Kenny was the first person to call me back in record time. My lawyer Lawrence Mittin and his assistant Joli Hanks are the very best. \nThey will take such good care of you that I thought I was related to the owner of the company.\nThey kept telling me just get better and we will take care of everything else. Thier main concern was for me not to worry and leave everything to them. They took care of  insurance companies, doctors, medical bills, etc. This is a firm that doesn't advertise on tv or radio but I found by the grace of god. The whole staff is the best and will work hard for you and really care about you as a person. When I was told that they settled my case I finally cried.  They are amazing!!!.  I ended up with a generous settlement to make sure that I will be well cared for in the future. I would definitely recommend their services to anyone. Thank you again Lawrence Mittin and Joli Hanks!","useful":1,"funny":0,"cool":0},
{"review_id":"RfDjwcN5EqI2CM47qsbI0A","user_id":"ZxtNw766fHsEsi_gpSWHKQ","business_id":"m9iqRUgclcsQs-z8c2FTeA","stars":1,"date":"2017-01-08","text":"This place is awful!!!  A friend told me about their sale on Botox so I thought I'd try it - buyer beware. I have NEVER, EVER had a place doing botox treatments DEMAND my credit card number while making an appointment.  They said it was incase I cancelled and that hotels do this all the time....um, I'm getting botox, not booking a room.  When I arrived, you have to sign in and state whether you're paying by card or cash which I thought was odd.  I met with the Nurse who was to do the treatment and she was nice enough.  She gave me the quote and I agreed.  Before she would even start, she said she had to have my credit card to take to the front desk to be run BEFORE treatment.  Seriously???!!!!!  I was treated like some deadbeat criminal!  I gave her my card, then had to wait while the front desk ran my card for the amount.  Obviously the charge went through without problem, but the experience left me disgusted with Suddenly Slimmer.  I drove 90+ miles to come to this place and I wouldn't come back if the Botox was free.  The office staff is rude in that they don't even acknowledge you when you enter the place and sign in.  The Botox was ok at best, but the service was deplorable!  STAY AWAY!","useful":4,"funny":1,"cool":1},
{"review_id":"Yyv9FMDHg_YUeAxG7Z1J2g","user_id":"OtQ55u-3t9eZZBnLSRahrg","business_id":"-A5jntJgFglQ6zwAmOiOMw","stars":5,"date":"2013-08-17","text":"I stayed at the Baymont Inn And Suites during a recent weekend visit to Las Vegas. The service was wonderful, the rooms were functionally pleasing with free WiFi, free lobby-located web service, large screen TVs, reliable maid service, a pool, and a reasonably priced gym.\n\nThe hotel is located in walking distance to shops, department stores, and drug stores. It is also located only 4 miles from the strip. I thoroughly enjoyed the accommodations and the service.","useful":1,"funny":0,"cool":0},
{"review_id":"yrWvnIjBfZOBHf34OtBHVw","user_id":"uUNPZx0M36UNSJ6FlcR9hQ","business_id":"9_JYDL4Ni1tQhnWl01tFNw","stars":4,"date":"2013-05-15","text":"Would of gave it 5* but the brow wax wasn't the best. But they did a fabulous job on my hands and feet me and my friends will return.","useful":0,"funny":0,"cool":0},
{"review_id":"3c3eUsTwZjnSwpVIz6tF7w","user_id":"_Lifn8yv9DQ4sOZs5oYvkA","business_id":"uteI0OIVarN_qkmORgPPgg","stars":5,"date":"2016-01-19","text":"I'm a fan of reviewing based on expected results (in other words I wouldn't rate a fast\/carryout place based on formal restaurant expectations).  That being said, the establishment was decent (as good or better than expected for a non-formal dining setting) and the food that I got in the lunch special was terrific. The basmati rice has a great flavor that went well with their curries.  With a range from somewhat spicy to very spicy, the flavor was delicious across the two curries and the soup\/curry (whatever the third item in the lunch special was today).  The naan was average; I have had some better naan, but it served its purpose alongside the curries. The rice pudding (Kheer maybe?) was pretty good, but I'm not a big dessert person so I could take it or leave it, but it was nice after the spicy curries. The place was clean, I ordered and had my food within about 5 minutes or less and the guy taking orders was friendly.  This was $8 for lunch (with plenty left for dinner) that did not disappoint.","useful":0,"funny":0,"cool":1},
{"review_id":"6VfhXZgYOL_KyYVcV2D8Yg","user_id":"RCJRK4WbcR6z3tTawg8DKQ","business_id":"72hF6mdlbFutmojpkFwMUw","stars":1,"date":"2015-03-19","text":"I can't believe this place is still in business. As others have noted they have been NO-SHOWS FOR THE 3RD DAY IN A ROW. Entirely unprofessional doesn't even begin to describe their phone manner. Nobody is willing to accept responsibility for their horrible INCONSISTENT AND UNRELIABLE service. Do your self a favour and absolutely DO NOT give this company your money, they don't deserve it. Absolute waste of time. I cannot wait to see this company go out of business. I wish I could give this company ZERO STARS","useful":1,"funny":0,"cool":0},
{"review_id":"xv_hrnrATlmF5SEO_juPLw","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"I-5qHCVwT7k_KH67-YOx3A","stars":4,"date":"2014-06-04","text":"Omg! I love this place, amazing food, service, and friendly staff. My boyfriend and I come here quite a bit you have to get the avocado egg rolls they are the bomb ! Served with chili line sauce and chicken pot stickers but I would ask for the sauce on the side.for some reason the potstickers are swimming in the sauce  if ordered in original form.  If you decided to get a strawberry lemonade make sure to ask for water because it's overly  sweet. Entrees I got the luau salad it's amazing very healthy and he got the teriyaki chicken so good comes with your choice of brow., Or white rice . Lastly our server was very nice and attentive but seemed to be overwhelmed so we felt bad asking for anything.","useful":0,"funny":0,"cool":0},
{"review_id":"KFWFY7nn9iFc2QYYFjFTsQ","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"C9ImzBi5fn742ZcAYDww2A","stars":5,"date":"2014-07-07","text":"One of my favorite breakfast spots the have pot of bread that you can get instead of toast get it ! So amazing it's like a cinnamon bun without the frosting soft melts in your mouth. My family enjoys the red velvet pancakes intense chocolate flavor almost don't even need syrup. The omelets are so fluffy and packed with flavor and the crispy hash browns will knock your socks off. I would recommend anyone to come here bring the family and a plus the service is wonderful Amanda I believe is her name pretty girl with green eyes very attentive our drinks where always full","useful":0,"funny":0,"cool":0},
{"review_id":"l_ZQ3Tf6u7wFaRkz4yFvXg","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"At2bqa8emnEr5WNIosi0ow","stars":5,"date":"2014-08-22","text":"We had the best breakfast we've had in a long time you have your choice of coffee cake or toast the coffee cake is fresh and with the right sweetness the skillets are da bomb I changed my veggies skillet to egg whites and sweet potatoes instead of breakfast potatoes my man got steak and eggs with a side of biscuits and gravy everything was amazing including the service Cindy was greAt she was very patient and attentive my glass was never empty and I'm a drinker I drink a bout five glasses of water throughout one meal at least or more lol we were so full but very happy","useful":3,"funny":1,"cool":2},
{"review_id":"JTtNF48bAxhc5hKNkRr_rA","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"KWM6C4g9x7Fnmjdz8H18sw","stars":2,"date":"2014-12-31","text":"Okay Let me start by saying that reason I am giving this place a two star was service first thing I call to ask if they serve food all night and what the hours were the bartender on the phone was a female this is her exact words \"Yes this is a BAR we are 24hrs and serve food all day\" I said okay thank you and she hung up no good bye or thank nada! So, I am starving I just got home from working on the strip and I work at Bar too that closes at one in the morning that is why I called to ask. My husband and I walk inside and sit right in front of the bar at one of the high tops it was 15 mins before anyone came to greet us or give us any menus. Finally, a male bartender came and greeted us he was friendly but was in a rush to get our order he just handed us the menu and asked \"Do you know what you want?\" We needed a min and did not ask if we wanted some thing to drink or nothing just \"I assumed you been here before\". Retarded how can you say that to a guest. So, he came around sooner than I thought to take our order the way it was going we asked for it to go. I ordered the chicken dinner with rice and veggies; my man got a bucket of buffalo wings with extra buffalo on the side and an order of fried cheese. Then he asks do you want a drink while you wait we both said no it is okay.( In my head you'd probably bring it when the food is ready anyway.)  So it took 30 to 45 mins for the bar food to come out; we had paid before hand too and had to go up to the bar to ask the bartender how much longer that's when he finally got the food. I guess he noticed we gave him 20% and was extremely fast and nice I walked out My husband stayed to get some ranch to go. When we get home his wings were PLAIN we hand to melt butter and mix it with franks to toss the wings in to make them buffalo. Other than that the food was good the veggies did not seem fresh if anything they are frozen or canned. This review got two stars because the male bartender was nice and food was okay.","useful":1,"funny":1,"cool":0},
{"review_id":"Au7MG4QlAxqq9meyKSQmaw","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":5,"date":"2014-07-07","text":"So my boyfriend and I came here for my birthday ; I have been wanted to try this place since it has opened big fan of Gordon watch him in Hell's Kitchen so I couldn't imagine so where better to celebrate my birthday. Daisy was my server she is so sweet knows the menu very well and suggested great items I didn't even really have to look at the menu I had some fruity cocktail it was very refreshing and her server asst. helped by cleaning items off table and refilling our waters. I got the ribeye medium it was so good ! I ate all it's served with potatoes and my boyfriend had the chicken pot pie chicken was very juicy and gravy was top notch! She suggested the sticky toffee to top it all off it's the best dessert I have ever had I still dream about it served with a vanilla ice cream. I will be back !!!! Thank you daisy for making my birthday special","useful":0,"funny":0,"cool":0},
{"review_id":"CJmrdo3Kq4WYyBc5Izatgw","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"OWiKC7bjIvc7L2iIuBsHxw","stars":4,"date":"2014-07-07","text":"My boyfriend and I come here all the time and sometimes we get good service we had Taylor she is by far the best server we have had there I love their breakfast here their dinner menu is ok they changed some stuff like instead of fresh veggies they use canned I was disappointed when I ordered the lemon chicken.","useful":0,"funny":0,"cool":0},
{"review_id":"3vcc0LI3LYaOLuG-_pPANQ","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"ETO1WestONWAxuhACej-ZQ","stars":5,"date":"2015-03-09","text":"Daisy carpet cleaning has done an amazing job for many years with us. How is a responsible owner and owns up to his 30 years of experience. He has cleaned all of our homes that we have rented and taken out almost impossible stains. In our last condo we had gotten our new puppy lucky who made a lot of accidents on our carpet pee stains, poop stains, as well as chewed up the carpet by the front door. Joe was able to come clean it while we were at work we trusted him to let himself in and just do his thing he notified us once he got there and also called when he was finished. When we came home the carpet looked almost new he said that it was tuff to clean he had to bring down the scrubber, put in some special chemicals for the pet stains and odors and as for the chewed up carpet he suggested either patching it or just replacing the whole area. Other than that it looked amazing! thank you joe for your wonderful service.","useful":0,"funny":0,"cool":0},
{"review_id":"VKDJwOKKxWZhA4MRRr_78A","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"7njZaRjDXi8anBaGlGQu4g","stars":4,"date":"2014-07-07","text":"One of my boyfriends favorite places come eat it had one of the best salads I have had in a long time chicken almonds on a bed of greens with balsamic dressing. My boyfriend loves the streak with the mushroom sauce he's in food a coma. Make sure to get Lauren she is wonderful so attentive, sweet, and friendly. They are lucky to have her working for them .","useful":0,"funny":0,"cool":0},
{"review_id":"rdA_qsewahc0uvsFkfdCOg","user_id":"8bFE3u1dMoYXkS7ORqlssw","business_id":"IE7sVOweBucNusO3jhrEpw","stars":5,"date":"2015-01-08","text":"This place is amazing they are super nice love my huskies Nala and lucky and best of all always know how to treat my pups quick and painless. The vet is very friendly and will answer all my questions. It's also nice that it is affordable no hidden fees or unreasonable fees. I recommend everyone come to this vet.","useful":0,"funny":0,"cool":0},
{"review_id":"O_tVLYuch0LirpLd65qamg","user_id":"aWs94L_FYsyEZDH4kNDGQA","business_id":"tvxI5iRImLnPdLbiI1HXhA","stars":1,"date":"2013-04-01","text":"Horrible customer service. The staff always have attitude and are not helpful at all especially the manager. I ordered the low fat mango smoothie. Although the store promotes a healthy attitude towards food and appears to use the freshest ingredients this place is far from healthy. The person making my smoothie jus poured in some sugar filled mixture into the blender and added sugar filled frozen yogurt. This drink was full of preservatives and sugar. Definitely not worth the calories or the price. And I could do without the attitude.","useful":3,"funny":0,"cool":0},
{"review_id":"21C5drdBIMAq0MglOFlMHg","user_id":"aWs94L_FYsyEZDH4kNDGQA","business_id":"pfn4CSTtpjSkN-OeyAafJQ","stars":1,"date":"2013-08-17","text":"Horrible service! Ugly decor! Horrible processed food not sure why anyone would give it a good rating.","useful":1,"funny":0,"cool":0},
{"review_id":"TEGQxlVpePpQRKQa19cbEQ","user_id":"3ZLaWq1ESGsxc8M6e4rH-g","business_id":"G_05ZI4Vpl4bxjjZR11jEQ","stars":5,"date":"2016-09-06","text":"Tips - wear comfortable shoes and clothes.  You will walk and walk and walk - you get the picture. I would take a blanket and a picnic lunch and a refillable water bottle is a must.\nGive yourself 4-6 hours to look around - all day if you want to see the entire park.\nI LOVED the insectorium!\nWe were there for the lantern show which was a nice little bonus, although it was a bit crowded.\nEasy walk from metro Pie IX","useful":0,"funny":0,"cool":0},
{"review_id":"2Eb_89PhOTamk1IAI1TxgA","user_id":"3ZLaWq1ESGsxc8M6e4rH-g","business_id":"ctNVGh_5lE6oiu3GQhmd3Q","stars":5,"date":"2016-09-06","text":"Great park - we could sit and watch these silly squirrels play for hours.  Seriously the most hilarious squirrels I have ever encountered.\nWe had coffee at the little cafe one morning and it was so relaxing to sit in this park and people watch.\nWe came here twice during our 4 day stay - so glad we happened upon this park!","useful":0,"funny":0,"cool":0},
{"review_id":"tICseEL7TT7HgylEKBq0pA","user_id":"3ZLaWq1ESGsxc8M6e4rH-g","business_id":"BZtmcWxwJp8z0EKoQ4awyg","stars":5,"date":"2016-09-06","text":"The Nutella crepe with bananas and strawberries was great!  My husband got the bagel sandwich with egg and cheese.  I was a little disappointed in the lack of vegetarian options if you weren't in the mood for something sweet.  They had tons of combo options that looked delicious but not a single one was veggie - boo. \nWe enjoyed our breakfast.","useful":0,"funny":0,"cool":0},
{"review_id":"_uX-tbiW07oIIKxxnZLWVw","user_id":"3ZLaWq1ESGsxc8M6e4rH-g","business_id":"3DGtOhtb6jNdRs9T9gH9WA","stars":5,"date":"2016-09-06","text":"The food was exceptional. I had the omelette with feta, spinach, shallots, and tomato which came with potatoes, fruit, toast, and coffee. My husband had the Mexican burrito which came with potatoes and fruit. The service was very good - we went on a Tuesday around 11am and there was no wait.  I would highly recommend this restaurant for brunch!","useful":1,"funny":0,"cool":0},
{"review_id":"WyETz4rq_N-dipFSCZTkoQ","user_id":"6BGYhuAB9-DnH78dMJsLaQ","business_id":"p4M-Tu7unXFi5jru6QSm2A","stars":5,"date":"2015-01-31","text":"I have been going to Monica for over 15 years. She is amazing and the J Salon is a great atmosphere. Thank you for the coffee and cookies.","useful":1,"funny":0,"cool":0},
{"review_id":"QLxIy-t3kvQRHM7uSUy85g","user_id":"6BGYhuAB9-DnH78dMJsLaQ","business_id":"52sY8-9al5LJi475nNJkyQ","stars":5,"date":"2011-10-06","text":"This place is awesome.....food is amazing. The sauce is to die for. The fries are so good and the service is amazing as well. Please go try for yourself. I love this place.","useful":1,"funny":0,"cool":0},
{"review_id":"nzEgDBd2-HTnF2hO2vbL5w","user_id":"6BGYhuAB9-DnH78dMJsLaQ","business_id":"uKKNw68mZZaa1jcyszEbyA","stars":5,"date":"2017-05-06","text":"OMG that food is amazing. I got the chorizo breakfast crepe burrito. So amazing. Lattes are amazing too.","useful":0,"funny":0,"cool":0},
{"review_id":"M6qZv2mI5yqO5nITCBSWtQ","user_id":"r_AfwGz88M4FZuLdNVffZA","business_id":"NTKxxbg2l55sdKD1UmBiBw","stars":1,"date":"2014-03-26","text":"As I said POOR SERVICE! you go anywhere and don't receive some sort of refund for the wrong food will always be in the wrong. And surely to deal with an attitude on top of receiving the wrong food is insane. Once again as I said they lost my business and every coworker  from my job because they knew they would probably do something such as spit in their food .. I didn't give them that reputation their attitudes did.","useful":2,"funny":1,"cool":2},
{"review_id":"hoP9_e5U7drQvch9bwceRQ","user_id":"r_AfwGz88M4FZuLdNVffZA","business_id":"YCYqEsAabSPzfdKeT7KJIA","stars":2,"date":"2014-01-22","text":"I was a huge fan of Champps  and when they closed wanted to find a similar sports bar that sold Potato Skins. I went on a hunt an this was one of the places that I tried. First issue was there was no were to park. We ended up parking were it might have been considered the side walk.(Good thing we were only doing takeout). I got 4 skins. Now they were a great size but they had no taste to them at all. It was undercooked and there was more potato then anything. I will give this place another try because I love sports bars but i'd probably try something else.","useful":2,"funny":0,"cool":0},
{"review_id":"yUy6QXrcUE7Fj8Pnl1j7oA","user_id":"r_AfwGz88M4FZuLdNVffZA","business_id":"hyyy_yFDI3CJJaG3uROGBA","stars":5,"date":"2014-01-22","text":"I have only been here twice and I love it. The atmosphere just has a real home feel to it. I have received great service both times and its very clean an the food was great ! I ordered potato skins and they were well worth the money. I always have some to take home. I have already recommended this place to several people.","useful":0,"funny":0,"cool":0},
{"review_id":"9EN3RCLTXKMQ6-aKCcwSDQ","user_id":"r_AfwGz88M4FZuLdNVffZA","business_id":"3NSeHqI4QrXx8Smw2j662w","stars":1,"date":"2014-02-09","text":"This place was nice on the eyes... an that's were it stopped. After being seated it had taken a while to place orders, we didn't get bread until we asked for it as we happened to catch the waitress walking passed. Then we got bread an side salad with the meal. There was a weird smell coming from the butter an shortly after not finishing half of my meal, I felt sick an resulted in vomit. I love trying new things but I regret to say the service as well as food gets a thumbs down for me.","useful":0,"funny":3,"cool":0},
{"review_id":"Vf9-CFFBjamxSy364N6KAQ","user_id":"uqpzo06dsUujPBqtQlrD5Q","business_id":"-wUKgQXAMC4H5hiBOgpT6g","stars":1,"date":"2017-08-07","text":"Let me start by saying I love Taco Bell, but this one is the worst one I've ever been to. More often then not when I order something, it comes out wrong. Last week I asked for a Cheesy Gordita Crunch with no spicy ranch, a burrito supreme with no sour cream, the burrito came out right but the Gordita had that awful sauce on it. It took the woman taking my order about 4 minutes to figure out how to put it in, which ok they had a new system so I'll cut them some slack but still. Today I went and ordered a single Double Chalupa, 10 minutes later I went back up and they said \"they're making it now\"...seriously? A one item order and they wait till someone is basically out the door to make it. The best part when I said \"don't worry about making it just give me my money back\" they looked like I just asked them the mathematical formula for calculating the speed of light. I'm happy y'all get $11 bucks an hour now but seriously try to not suck at your job.","useful":0,"funny":0,"cool":0},
{"review_id":"pn_XzZoZ4slXWA8qBCdKRw","user_id":"qhHXobL7gGGW_3h36TZ2hA","business_id":"FlaKnTMLBE_pzRYHjXTOLg","stars":5,"date":"2016-03-21","text":"Quality and quantity both are fantastic. It's a good Afghani cuisine. Reasonable price!","useful":0,"funny":0,"cool":0},
{"review_id":"KDAp5-VYO-onYd8hr_hbMw","user_id":"nJgufFuXkgKZrdhZI7Tovg","business_id":"OF19lUVQHj8pVaSACNewWg","stars":2,"date":"2014-07-28","text":"Very disappointed! I normally don't write reviews but felt compelled.  After taking forever to take our order and to cook the meal, our food came.  I took a bite of my Berry Salad which was actually a salad with bacon and blue cheese.  I don't like blue cheese. So I started eating the salmon on top which was so hot it burned the roof of my mouth.  It still hurts! We were able to flag down the waiter, who apologized.  I asked for just the Berry Salad without the salmon and he brought it.  The salmon was good once it cooled down.  Other restaurants would take the meal off the bill or offer a free dessert but not the Burntwood Tavern.  An order of pretzel bread also came out terribly hot.  More like burnt mouth than Burntwood.","useful":0,"funny":0,"cool":0},
{"review_id":"Fih9mG516a3tZJGRnFBNGQ","user_id":"iWuA1qWF2I_c-vex6LYZUg","business_id":"Kxz6WSfmz0YTf5nV1vhkpg","stars":1,"date":"2017-12-02","text":"DO NOT lease here. Worst apartment complex to lease at. They have very unprofessional people working at the office. The complex is right next to a sketchy trailer park whose residents jump over the wall and steal belongings off the properties. The management does NOTHING to properly secure the area (security, cameras, etc.) The shape and condition of the apartments are crap. You can hear every footstep of the person walking above you. They charge for unnecessary maintenance that is clearly their fault. Very mediocre and old appliances put in.","useful":0,"funny":0,"cool":0},
{"review_id":"zEJh_dfzsl8xBWt9P0_OtQ","user_id":"XDZ8Igqxd_7Qk9YE7gvVfA","business_id":"VyjyHoBg3KC5BSFRlD0ZPQ","stars":2,"date":"2011-09-04","text":"Yelp Says that Two Starts = Meh. I've experienced better.\n\nHere is how Ceasars Palace got two stars from me:\n* STAR 1 - Saw it in almost 24 yo movie called \"Rainman\"\n* STAR 2 - Saw it in Hangover\n\nIt would have gotten 3 more starts if:\n* STAR 3 - Coffee and pastries in downstairs coffee shop were each $3 less and tasted better than hot bitter liquid and old newspapery food\n* STAR 4 - They cut their prices in half and doubled the quality of their rooms\n* STAR 5 - I had no other options\n\nWhen I was a kid, this place was amazing...but even back then, I would have taken a Motel 6 and a happy meal toy over staying at Ceasars Palace.","useful":0,"funny":0,"cool":0},
{"review_id":"c2rfkQ8FkBUQw0mjeq_APw","user_id":"p6KNXlWEFPynwWLq_WFylg","business_id":"ayOJSIl-P16HZAQBcQfUyQ","stars":5,"date":"2017-11-28","text":"My Aunty and Uncle have been visiting the Cal with Vacations Hawai'i for a few years and always had good experiences there. On their recent trip, Uncle had a medical emergency and fainted while standing in line for the buffet. As my Aunty was calling for help, a nice man standing behind them caught my Uncle to stop him from falling and security immediately came to help him sit down and called for an ambulance. The security even provides transportation to and from the hospital.  Everyone there was very patient, kind and concerned.  You could really feel the Aloha spirit there! Mahalo Nui to the California Hotel!","useful":0,"funny":0,"cool":0},
{"review_id":"IM_vvyBvk-aTYkVE6mvPHg","user_id":"au865pXcpZBgyP8qfl7FJA","business_id":"KxqE9n2i21ol9DiCv8iknA","stars":5,"date":"2012-12-10","text":"My son goes to school near Cleveland.  We were looking for a place for BBQ and we stumbled upon this place last night.  I had the Rib Tips and he had the Pork Chop dinner.  All I can say in the meal was Amazing!  This has to be one of the best kept secrets in Cleveland.  The food is very affordable and the taste is Fantastic.  I will be back on my next trip to Cleveland.","useful":0,"funny":1,"cool":0},
{"review_id":"jowM4fArCSL9uXqD1uYe_g","user_id":"X0wnk_STxsUh3Gcce-7Shw","business_id":"vzoAKt7ND2YPLYfnVRi_Cg","stars":1,"date":"2015-12-16","text":"I stopped into this location for a quick lunch today.  Restaurant was pretty busy.    Upon arriving at 12:35 Pm the tables that were not taken with people sitting at them had dirty dishes on them.  After I ordered and went to sit down I asked the cashier if she could wipe the table, she didn't come over so I just put the dirty dish from the table on the counter next to the register.  I had a salad bar salad and piece of pizza.  By the time I was finished lunch at 12:55 NONE of the tables had been bussed or cleaned and my plate was still sitting by the register untouched.  I was very disappointed in the atmosphere not being clean and only can think about if your dining area is that dirty how dirty is your kitchen?","useful":0,"funny":0,"cool":0},
{"review_id":"rB7sdzB8TGi2hpEbpJEOQA","user_id":"X0wnk_STxsUh3Gcce-7Shw","business_id":"Q2tiD6Onk0Dg-o6quoZp0Q","stars":5,"date":"2016-11-16","text":"Image 360 is top notch.  My first introduction was to Brad at a Chamber Event.  I have gotten to know Brad over the years and when the time came for a new banner I remembered and wanted to give them a shot.  Image 360 kicked it out of the park, Dealing with Kelsey & Sheri in the office was a breeze.  They listened to suggestions and produced a banner that I am thrilled with.  I previously had a table banner that I had to tape onto the tables at expos, I purchased a retractable banner and realize now how much easier life could have been.  Thank you Image 360, keep up the good work.  Stacy -- AJR Public Adjusters --","useful":0,"funny":0,"cool":0},
{"review_id":"fKIJUPY5y7jTzVAI9LFCMw","user_id":"X0wnk_STxsUh3Gcce-7Shw","business_id":"5ZxhCmYZV6628c9xVkNywA","stars":5,"date":"2016-10-17","text":"Was recommended to Brenda by my previous balloon sculptor from the East Coast.  She saw her work via the website and told me I had to hire her.  All along the process Brenda worked with me and walked me through the steps to ensure I was choosing the right decorations for my party.  They created centerpieces for all my tables and did a wonderful large balloon arch in the entry to the room.  Brenda is responsive and cares about her business and I highly recommend her and Balloon Happy AZ for any affair.","useful":0,"funny":0,"cool":0},
{"review_id":"n1AN3_UXtI-YP193wpGiQQ","user_id":"X0wnk_STxsUh3Gcce-7Shw","business_id":"JDDZAflMR3oHBH5cKOQNpw","stars":5,"date":"2016-12-01","text":"Our family was forced into car shopping as our previous Volkswagon was totaled in a car accident.  After calling around the Valley to get prices, I placed a call to North Scottsdale VW. Spoke with Nate and he promptly told me he would match the price I was given elsewhere.  When I got to the dealership he put me in touch with David Bonanno to finish the transaction.  I can not say enough wonderful things about Dave and the experience we had at this dealership.  No game playing, straight talk and reliable information.  They do what they say.  Dave went over all the details clearly and made sure we were comfortable with every step.  We purchased the first car, then a few days later decided our family needs the 100% safety of being in a VW, so we traded in our other cars and rounded out the family in Jetta's.  Our family motto is Volkswagon's for the win and Dave Bonanno is OUR GUY.  Thanks Dave, keep up the good work.","useful":0,"funny":0,"cool":0},
{"review_id":"xLxca_wZrN-rB1cFuN6tFw","user_id":"vqQHaEkdT073RRO4xDu4tQ","business_id":"OQR6ORSaKpjSbxcJJjwlbg","stars":5,"date":"2017-06-09","text":"I have used Mike for many rental property renovations over the last 2 years.  He has not only renovated these properties but took over as property manager.  Mike inspects the properties before I buy them to ensure that the project fits into my \"portfolio\".  A friend & brother (based on my referral) also use his expertise for their properties.  Mike treats our properties as if they are his own, and is very good with the tenants.  Tenant service calls are handled in a timely manner.  Mike communicates with me almost daily with updates.  His repair and property management rates are reasonable as compared to the competition and he is honest & trustworthy.  I would not hesitate to recommend Mike and I plan to use his services for years to come.","useful":1,"funny":0,"cool":0},
{"review_id":"6C5Np-KDaxi5ks7TBmpZxg","user_id":"C7IrOaBaxd7tYyFnb4b-lw","business_id":"iA8Ve2sZKN5Vz3mYKrtCaQ","stars":5,"date":"2013-02-28","text":"Good Thai food here.  Had laarb kai, chili mint, and pad Thai.  All great dishes and made very well.  I'm a bit surprised that their main competition is across the street, lotus of siam.  Well, food here is definitely good and worth a stop.","useful":0,"funny":0,"cool":0},
{"review_id":"SR_4BhuyLwVfM9C3IqG8QQ","user_id":"C7IrOaBaxd7tYyFnb4b-lw","business_id":"QH1lePb3lwTKRF_OXH_6uw","stars":4,"date":"2013-02-27","text":"Greek food is as good as any other Greek restaurant that I've ever been too.  Service is just lacking.  Takes forever for them to bring the check to the table and it's not even busy.","useful":0,"funny":0,"cool":0},
{"review_id":"eC0RSWZudPhMiswsLYckHA","user_id":"C7IrOaBaxd7tYyFnb4b-lw","business_id":"DVfCbJhJUDWRlUfrKzaKOA","stars":4,"date":"2013-02-27","text":"Good food but not everything was cooked right.  Three out of four dishes tasted good and beats anything I've had on the strip.  Everything on the strip is mostly flash and and pricey.","useful":1,"funny":0,"cool":1},
{"review_id":"LpTnbz9qhjbhOvFB6JCMhw","user_id":"C7IrOaBaxd7tYyFnb4b-lw","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":2,"date":"2013-02-28","text":"Had dinner here and nothing really special compared to Louisiana buffets.  King crab and snow crab are on the menu but they are served cold and almost frozen.  Louisiana casino buffets actually steam their crabs which I believe taste better.  Everything else on the buffet was just nasty or below standards in taste.  If it wasn't for the crabs, I'd give this place a 1 star.\n\nSeems like all Vegas buffets suffer from the same disease, they are large in square footage but small in selections and high in price.  They are built for flash.","useful":0,"funny":0,"cool":0},
{"review_id":"-ycDCwz2Tk1xaVMqwWz-sw","user_id":"h9djgA-pjnaqGDc850uxkQ","business_id":"2DMxJUDUlHiS7P_GKDPvxw","stars":5,"date":"2016-11-15","text":"Bryan was the most helpful! Acknowledges you right when you walk in the door and is very polite,  I went in with a flat and he patched me up took care of the spare and sent me on my way with such a great attitude! I'll be needing new tires soon and I'll definitely be coming back to this location!","useful":0,"funny":0,"cool":0},
{"review_id":"WI8NcqUgTzccCuJbS56ooA","user_id":"UcRp7qAhP-pmZzuA6YlHig","business_id":"WAmCIDi3qn2VI7OUqZfjYQ","stars":4,"date":"2014-06-08","text":"We stumbled upon this place when the brewery we came for was completely packed. What a great find! The menu is mostly sandwiches, but they have a large variety and a lot of interesting options. I had the Philly cheesesteak and it was one of the best I had ever had. They put their house-made beer cheese on it and it was just amazing. The fries were great too. Good beer selection and lots of TVs with different sports events on. Service was a little slow, but good other than that (and in fairness to them, it was pretty busy). I recommend a visit if you're in that part of Charlotte!","useful":0,"funny":0,"cool":0},
{"review_id":"xYEStTbmsgeF6Lx8aqKKYg","user_id":"3pHPg7XF7qNfuGgLmEqIBA","business_id":"eb31LLI9QhMbtjBlkyx7VA","stars":1,"date":"2012-12-25","text":"This review has everything to do with business practices and bait and switch advertising - Do not believe any advertised deals this course posts -  I tried to redeem an ad sent via a short code text and when I attempt to redeem the club house states it is for clark county residents.  It's not like I sneak myself onto their database!!!  if you are operating multiple databases track your blasts and stand behind your mistakes, While the course is beautiful, the business practices make it one of the worst muni tracks you can think of.  Shame Shame Shame","useful":0,"funny":3,"cool":0},
{"review_id":"DWmBtYzd3UnKxZboDSgt5A","user_id":"3pHPg7XF7qNfuGgLmEqIBA","business_id":"qcltTph9ALOpiljbwMluKQ","stars":5,"date":"2015-06-12","text":"I love this course - If you are looking for a lush country club type course then this is not your track - this is a true links course just like you find in Scotland - it is not lush but the greens are wonderful and the holes play similar to the British Rotation holes they pay homage to.  The bunkers are brutal and you will have to come out sideways.  \n\nIf you like challenges and want to think your around the course then please enjoy.  Also having marshal's that are pace of play demons makes the experience good for everyone - pace of play is for the people behind you.  I fully support their attitude and would appreciate it if more courses took the same approach!!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"6wKEyA8pM-Hx8mjJkQak4Q","user_id":"3pHPg7XF7qNfuGgLmEqIBA","business_id":"gtqtnzgzDCWVFi298dIvow","stars":5,"date":"2015-05-09","text":"Always in tip top condition - this course is wonderful and convenient from the strip - challenging greens water comes into play a lot plus the par mate program adds a layer of Vegas glamour","useful":1,"funny":0,"cool":1},
{"review_id":"uw2DF-9nzzvQycz6OEjv6A","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"O_6LcGyHZfP-OzQ0YBPnLg","stars":5,"date":"2011-09-21","text":"Love the decor, service and the ribs are probably the best in Montreal.","useful":2,"funny":1,"cool":0},
{"review_id":"bg-HLd4QVhSzHhE5Ij-O6g","user_id":"ftLmo96CeyaNcVqHleDSHw","business_id":"qauawyA4HmtCIvRG9gk-BA","stars":1,"date":"2011-10-10","text":"Did not have a good experience there at all. Seemed good from the reviews, but food was bland and all the staff looked like they wanted to be somewhere else. Atmosphere cold as Ice. Much better places elsewhere.","useful":2,"funny":0,"cool":1}]