[{"review_id":"-Mg9SVMzkSbhKmR1zx-6Mw","user_id":"Obgx2s0baPrjpDI4ZMey9Q","business_id":"TjJdpI5XX2zwHmXQbnEWeQ","stars":5,"date":"2016-03-22","text":"IF you like gyros this is by far the one to try .Absolutely   the best cant say enough good things about .Gyros and nat.Try it you will love it","useful":1,"funny":0,"cool":0},
{"review_id":"W_jvrMOdAnfjcImhkoyVqg","user_id":"c-JTzd6G7Zx32GkIm1j5Kg","business_id":"6cIkrXJ1KDTZYh400sdwDA","stars":5,"date":"2017-03-27","text":"I used Kangaroo bounce for a military event and Jaime exceeded the high expectations I had. Jaime was very easy to work with and accommodated my every need. The event was very successful and Jaime had everything setup on time and the kids loved the bouncy houses! The prices were more than reasonable and I would highly recommended his services to anyone needing something fun to spice up a party or family friendly event!","useful":0,"funny":0,"cool":0},
{"review_id":"wknDqRyoiKPOY9-zqiDeSg","user_id":"7U3WCeIXk6hmqBaLxJFlQQ","business_id":"zSR5_6AKPbof35rUh6xiXg","stars":5,"date":"2015-01-24","text":"My husband and I received gift certificates for Christmas from friends of ours to Aydin's and it was a great experience. The staff is friendly and happy and I am so happy with how my nails turned out. My husband had a great first pedicure. I will definitely be going there again and will recommend to my family and friends.","useful":0,"funny":0,"cool":0},
{"review_id":"F_MKI1C9wJIMzxtEFHELnw","user_id":"7U3WCeIXk6hmqBaLxJFlQQ","business_id":"3yTStxt-5SuuvcUR9mZ1Hw","stars":5,"date":"2015-01-07","text":"I love Thai boat, they have the best spring rolls I've ever had any where. Beef yellow curry is delicious and pad see yu is amazing with coconut rice. It's the one place I never get disappointed in the service or food. The people there are so nice and they all work together so efficiently. \n\nIt's one of the few restaurants I've ever been to that all staff serve you and you're not stuck waiting for your server or trying to remember what they look like when you need something.","useful":1,"funny":0,"cool":0},
{"review_id":"exp3nPvi9ZSG42toFcB16A","user_id":"7U3WCeIXk6hmqBaLxJFlQQ","business_id":"sVxwIvPhari07dmjJx7bjQ","stars":1,"date":"2015-01-07","text":"This restaurant doesn't even deserve half a star. They put me off from eating Pho for a very long time. The restaurant is dirty, the food tastes like it was all cooked in a microwave and the BEST part was the hair and bug I found in my vermicelli. I wouldn't go to this restaurant if it was the last food source on earth. \n\nClean up your act, you have A LOT of competition.","useful":0,"funny":1,"cool":0},
{"review_id":"CS7wO_fAAhADPCGuOJau3A","user_id":"76cvRSlMo2jwuIQTvBW5FA","business_id":"Nrk1AJwGbvyY9M0zZVU4Tw","stars":5,"date":"2016-03-01","text":"Today was my first time visiting this place to get my nails done, and I absolutely loved it! They have over 300 nail color choices that you can pick from. The lady who was doing my nails was really polite and kind. The pricing was also very reasonable. I definitely will be looking to go back to this place again! :)","useful":0,"funny":0,"cool":0},
{"review_id":"TljdnDfc2GHya3X_C1DiEQ","user_id":"s40XoBiPGRiFuyztMJOzSw","business_id":"ER0rUoLqAJQ2Mlv2_GnwyQ","stars":1,"date":"2017-11-22","text":"Food is hit or miss.  Service is horrendous, all the time.  Whether sitting with a total of 4 people at the bar and 2 bartenders working or sitting in a booth with a server, the service is not good. I will spare all the details of our last visit but it was bad service (had to go to the bar from our booth to get drinks), bad food (brisket was 50% gristle) and we had tables on either side of us full of dirty dishes for the last 20 minutes we were there. This is management 101. There is a manager who seems to spend most of her time as a food expediter rather than managing the restaurant.  She'll walk right by you and your empty glass in the bar and not say a word.  Not even hi.  I don't get it.  I wish it was better. The place will survive just because of location and the sheer volume of need here but under any other circumstances it would be a year or two at most.","useful":2,"funny":0,"cool":0},
{"review_id":"5yxlZ5-ylECXxI4coj_mww","user_id":"1L-kdx0aTQum4zyZsf3LnQ","business_id":"cZ7EVBRYfxHWGy828jlhDw","stars":1,"date":"2013-07-02","text":"Mission statement is:  \"to make every one of our clients feel beautiful.\"  HUGE fail.  My daughter booked an appointment weeks earlier for colour, makeup and style.  She let them know we have long, thick hair, so they could schedule appropriately.  When my colour was started, I was advised that due to some error, they did not have the time to cut, style or blow dry our hair...and we had to leave with wet, unstyled hair after shelling out over $300.  I never felt less beautiful and would have liked to complain, but I didn't want to embarrass my daughter.\nLess than a week later, I went to another salon to get the cut and style I'd originally wanted, and she asked if I coloured my own hair, because I'd \"missed\" a lot of spots, and my colour wasn't consistent.\nIf Fortelli treats all 'new' clients this way, they better have a strong customer base.  Never going back!","useful":1,"funny":2,"cool":0},
{"review_id":"iR-AXpNl5TgnK1n3y5bhbg","user_id":"UKwewudvMYdupcP-e4119g","business_id":"556i_WzeMeptcpd7ALQroQ","stars":5,"date":"2009-07-08","text":"Just by chance I passed by the studio and saw the ad for the 'Hip hop hustle' workshop.  Four sundays in June for $40--never mind that I live an hour away, never mind I'd be out of town for one of those sundays...I. Wanted. To. Live. My. Dream.  Yes, it's a save the last dance\/step up kind of dream but dreams are quirky.  You want what you want.\n\nI told this all to the husband, he quickly agreed-not because he really wants me to achieve my dream-he didn't mind spending a day in Madison every week.  \n\nThe dance space is nice, a bit over the top pink but there was a respectable mirror ball.  My instructor, Jeanne, was friendly and, more importantly, helpful.  The first 15 minutes was a little warm up, learning some pretty easy choreography and then the majority of the class was learning a longer hip hop piece.  We learned a chunk every week and put it together at the end.  I felt pretty accomplished by the end of the lessons and wanted to continue the dream...\n\nThe studio offers lots of different lessons, even a thriller workshop or a britney spears set of classes, and---my next dream: west  african dance.  I had been to Mali and there is really nothing to compare dancing with live drums; you are alive and you are joyful.\n\nI either wish I lived closer or they moved here...but moving to beloit? or janesville? hehee....highly unlikely.  I could probably fit a couple more classes but once summer is over, I'll have to put the dream away.","useful":3,"funny":3,"cool":3},
{"review_id":"pNuMWGL-LKxSzhhKVTPrmw","user_id":"UKwewudvMYdupcP-e4119g","business_id":"Dcj69NZJnbJhK-YHP_nULA","stars":3,"date":"2009-07-08","text":"I had been hearing good things about this place, most importantly: the frites.  I've known some good frite:  I used to work 5 blocks away from pomme frites in NYC and have basically tried all their toppings.  \n\nI love the fact that it's a stone's throw from the trader joe's and the neighborhood is precious.  The pedestrian walks have flags you can pick up and drop that you can use to cross the streets; parades can happen ANYWHERE.  \n\nSo, we went after 1ish and it wasn't too packed but noticed there were only two servers.  We weren't in a rush so I thought it would be fine. We ordered and since the husband, whose first love in potato, wouldn't share, we each got an order of frites.  Husband ordered the cheeseburger, our friend Kate got the reuben and I got the avocado BLT.  \n\nAnd then we waited, and waited.  I had to order coffee or else I was going to pass out.  I had just finished a hip hop class so I was starving.  Their beer selection was impressive, with husband pointing out that they serve Wychwood beer, from his hometown in the UK.\n\nWhen we finally got our orders, I noticed the portion of frites were huge and regretted not sharing them with Kate.  I also noticed that a) husband said no tomato and look! tomato and b) the avocado was missing from my AVOCADO BLT.  It took some time to flag the waitress and then she apologizes and brings a plate of sliced avocado for me.  I was like, 'um, great, i get to assemble my own sandwich'.  I drowned out my grumpiness in frites doused in mayo, because fat makes everything okay.\n\nWe felt guilty because we over heard the waitress tell a table that they had run out of frites.  We had ordered the last ones.  But then I thought, hello? it's your signature dish--how can you run out?\n\nAnyway...I would try it again and see how the dinner menu goes and taste their booze.  The food was pretty tasty, the service, not so much.","useful":3,"funny":2,"cool":0},
{"review_id":"IlnxwokKfFWBYZluy_GocQ","user_id":"UKwewudvMYdupcP-e4119g","business_id":"Trs4cEYdP6AX_KihTk9kWQ","stars":4,"date":"2009-06-29","text":"Had lunch on the outdoor part...glorious sunday with buskers (this time decent) across the street singing songs...\n\nThe food is really solid.  Bread is fresh and tasty with olive oil.  I had salad with yogurt-cucumber salad..the husband had the soup (rice, carrot, mint & yogurt) really nice...\n\nI had the lamb rib chops with asparagus, beans, carrots and rice pilaf (with sultanas).  With the exception of the raisins (not a fan), everything was flavorful and had 4! generous pieces of lamb.  Husband had the dumplings with spinach and feta...hearty and the yogurt sauce was really flavorful.  Wished I had room for dessert and coffee...don't fret...I'll be back.","useful":1,"funny":0,"cool":0},
{"review_id":"KesQ-ngOKbeUILdDK74Hxw","user_id":"LL4hVgo8q0KcLDb1-0NWJw","business_id":"Va8FJiCP9z2sOW2rKxShGQ","stars":4,"date":"2010-08-12","text":"Incredible customer service, prompt and knowledgeable. They make you feel important and welcome as you make your service selections. Will definately return. FYI - If the product you are interested in is out of stock (which is not very likely) be guaranteed you will get it asap. Thanks. Great service!","useful":0,"funny":0,"cool":0},
{"review_id":"FyzItBb9g9JU4tnDQ_L4tg","user_id":"hLiZQqeLJwp59hK-OheFBw","business_id":"eEnNw3_hBvxcFHyr23kAuA","stars":2,"date":"2017-09-17","text":"My husband an I originally was going to Daytona Beach Florida for 9 day's. But due to the hurricane at the last minute everything was cancelled an my travel agent had to rearrange our trip. So here we are in Las Vegas an here we are at the Hard Rock Hotel the casino tower.  Check in was very quick an everyone is very friendly. We've been here for almost a week now. I can say the room is big an at first it was clean but I noticed as we were there for a few days my room wasn't very clean things were not being stocked an sheets have hair on them pretty nasty even the towel had a stain on it ugh gross  I also can say if you want towels you need to leave a note or you only have 2. Our room has no refrigerator only one we can't use cause it's filled with alcohol an the prices are outrageous. There is no coffee maker cause they want you too spend money in one of there expensive restaurants or cafe. The bed is uncomfortable an pillows are small  be careful for the 33.00 resort fee. Don't understand what I'm paying this for. There's 4 pools only 2 open. There really is nothing special about this place. If I ever come back to Vegas I definitely won't stay here not worth the money. It's not even on the strip. Oh before I forget the pool we did use was nice an clean water was great. Just crowded. They do have a shuttle only runs from 10 to 5 an good luck if you get a seat  it's small an there's only one. Just not that great of a place an yes we are in Vegas but jeez for the money so not worth it... Updated I have been itchy for a day now it's from this room I'm pretty sure it's from this nasty lumpy bed. Can't wait to leave","useful":0,"funny":0,"cool":0},
{"review_id":"U7ogVRPRCTqtZgcuDA1arw","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"7z8Qlmr97ct8--5H1IlKRA","stars":5,"date":"2016-11-14","text":"Love Sally's for gel color.  I was welcomed by all three employees working.  Offered me help.  Erica checked me out and was so kind and professional.  I have never had a bad experience here.  Great store!","useful":0,"funny":0,"cool":0},
{"review_id":"xCXiBh3_yfiI1exYU5mgHg","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"LFOIMbdGcwEFsUVJKB6_Ng","stars":5,"date":"2017-07-17","text":"My son who is 11 just tried the gluten free pizza and said it was the best that he has had.  I have had the regular pizza md it was really good.  The customer service was awesome here.  We can't wait to try the sandwhiched next time.  I highly suggest Zella's.","useful":0,"funny":0,"cool":0},
{"review_id":"e9OFtVG01DsA-aHISiqHZw","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"tlTOSRv0LxI6pQcc_4t8sQ","stars":1,"date":"2016-10-21","text":"I just left the salon and won't return.  I really don't put negative reviews on anything but feel I need to.  I have been here about four times for pedicures.  My first time I had Kim do my pedicure and she did a great job with a friendly attitude.  So when I saw her today I asked if she was free.  She kind of glared at me and walked away after pointing to the pedi chair for me to sit in.  I sat there for over 15 minutes waiting and she was no where to be seen.  Not one person acknowledge me or cared that I was just sitting there.  By the time Kim came over she did not even look at me once through my entire appointment.  I told her I wanted my toe nails square and cut short but to not cut the sides with the cuticle cutters. She proceeded to cut two toe nails out of the ten.  It had been about two months since my last pedi (I usually come every two weeks) so it was obvious my nails needed to be cut.  When I asked her to please cut them she kind of snarled and was so annoyed.  She hardly filed them and the scrub at end was pointless.  My nails are uneven and look horrible. She may have been having a bad day but a pedi is a treat for me and if she is grumpy she shouldn't have helped me.  I also sat in between two elderly women who were so friendly and kind and their techs were not friendly.  I won't return to this shop.  Too dirty and unprofessional.","useful":1,"funny":0,"cool":0},
{"review_id":"Nrll73FqrHuJTHglHjkeSg","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"af2Hgh9_GuzknpH_Aa2PuA","stars":5,"date":"2016-12-16","text":"Eric is an amazing stylist!  I found him on Yelp and so glad that I did.  He has done my hair 3-4 times now.  I came to him with damaged, brassy and uneven colored hair.  I met with him for a consultation prior to him coloring and cutting my hair.  Once he did my hair it was exactly what I wanted and I loved it!  Since then he has completely transformed my hair to healthy and shiny.  He is a very talented man.  If you are looking for a great stylist, he is a must!","useful":0,"funny":0,"cool":0},
{"review_id":"Q1gDRxz6qCKmOCAHvFqrxQ","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"KGS8NdjkMzrS_BoBTo5nBA","stars":5,"date":"2016-11-10","text":"This is our second time here.  My fiancé and I had Rachel as our server and sat at sushi bar with Jackie.  They were both amazing!  Food was fresh and good.  Happy hour prices for great food and service.","useful":0,"funny":0,"cool":0},
{"review_id":"6pdYqFzadCbDeiec0b8flg","user_id":"vo4UwfG1UOu8GpIQGXpxrA","business_id":"YUFxSG6idHePsxOmnSHtpQ","stars":5,"date":"2017-06-01","text":"My son and I had the best service.  Our server was Mark.  My son has severe food allergies and they catered to this.  Mark was so kind, friendly and just overall great.  Food was amazing as well.  The manager spoke with the kitchen to ensure my sons food was prepared without cross contamination.  We will be back and will ask for you Mark!","useful":0,"funny":0,"cool":0},
{"review_id":"_6bLHbe3Iy07kidd_GT2YA","user_id":"5sE9RotpKeALGhnw4igMHw","business_id":"9g0JuC-_vx35T0m3lidwBw","stars":4,"date":"2014-07-30","text":"Every Friday we go there for lunch and sometimes breakfast! The food is very good. and  the owners are wonderful people! You feel very welcome and they ALWAYS aim to please!!","useful":0,"funny":0,"cool":0},
{"review_id":"yqUVkmfv_3mROvOir29Zsg","user_id":"5sE9RotpKeALGhnw4igMHw","business_id":"ZN8EHmoe4Xjy4q4Y8ROEfw","stars":4,"date":"2014-07-30","text":"Great place to grab a quick lunch or dinner. Nice family restaurant. B4 is the best!!! It is an older place but the food is great!!","useful":0,"funny":0,"cool":0},
{"review_id":"anhV4xgVILFA8PRnwg8JNw","user_id":"QDPgguMF4mxenalwwW94PA","business_id":"q3YnYPjLuBGRDi_59yTC5g","stars":5,"date":"2015-08-13","text":"Omg...seriously? Like seriously?!?! How did they make it taste so f*ucking good?! It's unnatural! I had the Grilled pork and egg rolls rice noodles with the fish sauce and man...man! The way the mint interacts with the sauce and the way the crunch of the bean sprouts compliments the basil, and the pork, dear GOD the PORK?!?! It's unfair I tell ya! I give it 2 thumbs and a big toe straight to the heavens, where the recipe descended from!","useful":0,"funny":0,"cool":0},
{"review_id":"wuvAvDmy_qQmRflyuZcT6Q","user_id":"iVpbYnfpJFZUk2-ivScSmw","business_id":"yXvyFDIdJTM0kLGSe7VYAw","stars":5,"date":"2013-08-21","text":"They really knocked our food service out of the park. It was truly the most amazing food I've ever had at a wedding and being that it was my own, I was adamant about the quality being key. I don't want to diminish the fact that if I were at a restaurant and ate this food I would be extremely satisfied. \nI still keep receiving unprompted feedback stating that this was the best food my guests have EVER had at a wedding. Thanks for making my day so great and my guests' palates satiated!","useful":0,"funny":0,"cool":0},
{"review_id":"-3HG7clsvvrPs0hqSUEs9A","user_id":"HZBu1fBlPGX6WROL1fnQow","business_id":"mjDo6APNdY_KHLYbS1BeHg","stars":5,"date":"2017-04-25","text":"The best ice cream place!!! Can't wait to give the  rest of the  chocolate flavors a try","useful":0,"funny":0,"cool":0},
{"review_id":"fBZtQmz_8ENwCskAsklSqA","user_id":"HZBu1fBlPGX6WROL1fnQow","business_id":"xTuStxvwM5e8S-ZB9eUd-Q","stars":5,"date":"2016-05-29","text":"Tried their chicken shawerma today and its by far the best shawerma in Toronto specialllly the chicken !!!!","useful":0,"funny":0,"cool":0},
{"review_id":"nmK75eo7KchvBc4ds1Oh_A","user_id":"oaS5rPjU7Ba7h8kZAQOGdw","business_id":"amwEhW6y9PZtq5ZYNJhQBA","stars":4,"date":"2016-11-06","text":"wow, we are finishing our meal right now. everything was delicious! veggie omelette, tomato soup, grilled cheese, house salad, coffee, and the red sangria. one of the best meals I have had in vegas in a long time. Beautiful restaurant and the best service I have ever had in vegas. We will be back Barcelona! Thanks :)","useful":3,"funny":0,"cool":1},
{"review_id":"Zgd3kAv_vMB_1nnoNW8OmA","user_id":"oaS5rPjU7Ba7h8kZAQOGdw","business_id":"gp5a5jJ4zl-I-2DQgy3o8g","stars":4,"date":"2017-04-25","text":"walton needed a new food spot and they finally have it. simple, delicious food with great service. Well priced, big portions. Love what the owners did with the place! We had a great reuben, caesar salad, fish\/shrimp basket, and waffle fries. Yum! We will be back.","useful":4,"funny":0,"cool":0},
{"review_id":"mh5XfCZcnBGTgy0tdIgxiQ","user_id":"oaS5rPjU7Ba7h8kZAQOGdw","business_id":"cYwJA2A6I12KNkm2rtXd5g","stars":4,"date":"2015-11-12","text":"i will keep this short. if you are a burger fan, just go! we had the poppers, the bleu cheese burger, the euro burger, and truffle fries. all of it was delicious! ESPECIALLY THE EURO BURGER. goodness, i crave this burger often (i really love truffle) haha. \n\nservice was good, too! we will be back :)","useful":0,"funny":0,"cool":0},
{"review_id":"RH6eaczC_3VW_dMnqzDbbw","user_id":"oaS5rPjU7Ba7h8kZAQOGdw","business_id":"hIUKufhwR6Ifn7bi0-phLA","stars":4,"date":"2016-02-08","text":"Wow, baguette cafe is definitely a new favorite spot in vegas! Wish we had known about it much sooner. First, Olivier is such a sweet man and is so warm and welcoming. The place is small, clean, and cute. The food is GREAT! Thank you fellow yelpers. \n\nWe had the vegetable quiche with salad, cup of carrot soup, eggplant\/prosciutto sandwich, and apple carrot juice. Everything was wonderful! You can tell everything is homemade, fresh, and made with quality ingredients. We hope to see this place continue to thrive, because we will be back anytime we are in vegas!","useful":0,"funny":0,"cool":0},
{"review_id":"FM-mnaWBKNa6FqqX3CFGqg","user_id":"FuII7XmTyS3-cmTjoRbIMw","business_id":"r_BrIgzYcwo1NAuG9dLbpg","stars":4,"date":"2016-03-14","text":"Amazing food, great atmosphere, and spectacular value overall. The only drawback is that it often has a wait time and I feel it always takes a while to get our food. As a result, I don't go nearly as often as I'd like. If you're not in a rush and looking for some great Thai food, look no further.","useful":0,"funny":0,"cool":0},
{"review_id":"Ka-Us6BhzbUiGgdGxMwVgw","user_id":"FuII7XmTyS3-cmTjoRbIMw","business_id":"wNXw53wmePcf_V3rF18LUg","stars":4,"date":"2016-03-02","text":"Went here for dinner before a show at Absolute Comedy. The service was excellent, the food amazing, great prices. Four of us came in when it was absolutely packed, but managed to get the last table. Put in a rushed order since we didn't have much time before the show, and it took about 30mins for our main courses (pasta) to come out. The pizza people next to us were eating looked amazing too. It came out to about $80 for 2 of us after tip - bottle of wine included.\nWill definitely go back.","useful":0,"funny":0,"cool":0},
{"review_id":"2tVhdF_mKDYbqJerphpSLQ","user_id":"-iP9xIiFDR3wo3av6VJnfw","business_id":"qy6f94ehot4zom1xpcBQfg","stars":4,"date":"2014-10-20","text":"I would go again for the Groupon deal of $38 for a 20 minute foot soak and 70 minute massage.  The facility is new, the room is clean, quiet and relaxing, the masseurs are attentive and fit, and the foot scrub and hot stones were unexpected extras.  My wife and I were the only ones in a large room with 8 \"tables\" and a \"hospital curtain\" divider for couples massage.  There were 2 other rooms too.  Wow, the forearm down the right back was the most sensational and therapeutic for both of us.  We're glad we tried and tipped $20 each.  Thanks Sam's and Groupon, the discounted deal matched our budget.","useful":0,"funny":0,"cool":0},
{"review_id":"b0BPkcOWfege1rbgPEBwAw","user_id":"-iP9xIiFDR3wo3av6VJnfw","business_id":"3_QNAH8yVzY0sBPftWyNhQ","stars":4,"date":"2012-09-24","text":"We requested female but got male masseuses for couples massage. The great part was the intro Yelp price for the 45 min deep tissue following 30 min detox foot bath for $29 each. The lady next curtain over was moaning in ecstasy.  I don't know how\/if the ion detox works but we both got \"Yellow!\" results even tho I thot mine was brown\/orange.  Thanks Yelp for special to try something new!!","useful":1,"funny":0,"cool":1},
{"review_id":"vgorjNe0fmFkQsUHLBBpwQ","user_id":"bfHjYC50U5mKTCWL34BefQ","business_id":"rof8X8-2R6Z2sLuDrr1OXg","stars":5,"date":"2017-05-17","text":"The food here is absolutely amazing! The best part of my meal was the Bonoffee Pie dessert! Literally I could eat this every day. It's got the right amount of sweetness with a good crunch! Every bite was perfect with its gram cracker crust, homemade caramel sauce, homemade whip cream and sliced bananas on top! YUM!","useful":0,"funny":0,"cool":0},
{"review_id":"yjGZeYb3gY5ScS-90h82Yw","user_id":"FlIrWdc23G17OUJUZg0WQw","business_id":"3SLDrXzPmKF0iCY8WriLsA","stars":4,"date":"2015-10-24","text":"My bf, his dad and I come here every Tuesday for tacos. Great value and friendly service. \n\nOur main critique- consistency. There have been a couple times where I was ecstatic. The food was fresh, delicious and portions were perfect... Then there are times where the meat is tough, flavorless or they totally skimp on portion sizes.\n\nOver all, we are pleased and will continue our tradition here.","useful":1,"funny":0,"cool":1},
{"review_id":"Nj5TFBnj3APZA2Tz2x3hIg","user_id":"FlIrWdc23G17OUJUZg0WQw","business_id":"cz5vz-893D3LNH3TMQYR1w","stars":4,"date":"2015-03-18","text":"Went for the first time on a Saturday night. Of course it was pretty packed outside.. But we did find some cushion couches off in a corner by themselves.. Our server was great and very friendly. A friend and I had margaritas which were decent. Didn't come with salt or lime or anything. Our other friends had some fruity kiltlifter? They really liked it. I snacked on a side of fries which was pretty yummy as well. One friend had the mac and loved it.","useful":0,"funny":0,"cool":0},
{"review_id":"pOHCPeRRsiuIpFDzc66AcQ","user_id":"FlIrWdc23G17OUJUZg0WQw","business_id":"wx7fvfCq53tNFieI4FiBWg","stars":4,"date":"2015-10-24","text":"We have been here a few times now and service has always been good. My bf and I both love pizza and, due to my many food sensitivities, this concept is great... We get to both have our own pizzas exactly how we want them. \n\nMy main wish for MOD is that they come out with a vegan friendly red sauce. I have to be very careful with dairy consumption and while I'm very thankful for their dairy free cheese.. Their only red sauce is not dairy free... I understand they have bbq sauce and garlic rub... But to me pizza isn't pizza without red sauce :(","useful":0,"funny":0,"cool":0},
{"review_id":"dD3ObM8KOraTRUf588XDFg","user_id":"FlIrWdc23G17OUJUZg0WQw","business_id":"FM4gP7gevi8znCo2qcy2Cg","stars":5,"date":"2015-06-06","text":"Our sweet little poohuahua (what we call poodle\/chihuahua mix :] ) turns into a demon dog any time WE attempt to trim her nails.  I drove by this place a few times and decided to try it out. We were in and out in less than 10mins... The $10 was so worth it! Plus, they were very nice.","useful":0,"funny":0,"cool":0},
{"review_id":"BRG6MbMeLrd7ZSDtvp_5yw","user_id":"W37bJMmRr6b7CKIhA6WgLw","business_id":"1jdiIc69VElLkloLKY0RAg","stars":1,"date":"2015-07-28","text":"Slow, didn't even have 1 pepperoni and 1 crazy bread ready... Thursday night too, understaffed?","useful":0,"funny":0,"cool":0},
{"review_id":"tXORQS3uaKpeme3pGh7Hkg","user_id":"lwly-WPXCZoWTEJzYZD4WQ","business_id":"5874jeQ4BlypNzCJbL0Phg","stars":5,"date":"2015-12-01","text":"Great price, great service! Fast and professional. Long line at the rental counter. A rep showed me to a self Kiosk. When I told him I needed to buy insurance. He helped me at the counter. Whole process took a few minutes. When returned, it was fast too, only a couple of minutes. Loved it. Will definitely rent from them again.","useful":0,"funny":0,"cool":0},
{"review_id":"aK50P9Vhh_Dxi7y3DPtsMg","user_id":"7X5QUtjSz7LrHpCvQJxEhw","business_id":"xVEtGucSRLk5pxxN0t4i6g","stars":5,"date":"2014-01-11","text":"Great view, food, and service. My GF and I went here to celebrate my return home from deployment. Wonderful experience!","useful":0,"funny":0,"cool":0},
{"review_id":"F4dMMGQVxY_xEEWfX4Sl1A","user_id":"ymjPxNQsIAlrAQklcHvBNA","business_id":"8E2Uc0Mn4cn_yEY0xFv-9A","stars":5,"date":"2017-08-01","text":"What a great dealership! Stopped by out of the blue because I was caught in a pickle between the RAM 1500 and Toyota Tundra...Grifan Fair, the sales guy who helped me out, was phenomenal and made my experience worthwhile...I think I am going to go with the Tundra because of that 10.5k towing capacity (compared to RAM 1500 8.5k). I would never have known that and other stats it if weren't for Grifan's exceptional knowledge. Great guy great dealership!","useful":0,"funny":0,"cool":0},
{"review_id":"3v2EIhfiw5XwN686rGi1wg","user_id":"ftmLCX-RJFvdXY_zNJFrEQ","business_id":"y7Js-07RF8d3N_AEtaw2VQ","stars":2,"date":"2016-12-05","text":"I went with great expectations when I went to Las Vegas after reading news about them.  The whole experience was contrary to what I expected though.  \nFirst, the cash part.  Come on, what is the reason for not taking credit cards when the whole world accepts it?  That you might die and credit card might not get cleared?  \nSecond, the menu.  Just a handful of items?  I was expecting something more than just a burger \/ fries and hot dog.  \nThird, the food itself.  If you make your burger in lard and is supposed to have 1000s of calories, it should be tasty, rt?  Or so I thought.  I finished it only because I just wanted to avoid a scene of arguing with them that I don't want spanking even if I did not finish food (though most of the people over there seemed to enjoy it - maybe I am the minority, but it was not fun for me).  I think it is the chilli that spoiled the taste of the burger.  But whatever it is, the taste was nothing to write about.\nFourth, the ambiance.  I will rate the indoor atmosphere only at the same level of McDonalds or Burger King.  \nFifth, the security - locked doors only to be opened by security after verifying you paid.  Why?  I mean, they seriously make you feel like you are in a mental assylum with the nurses costumes and the spanking machine in the middle.  No problem for me with a restaurant having security, but I have never seen any one watching at the door so closely as if people eating there might run away in the middle without paying.\nI definitely think they have a unique theme that can attract people.  But make a great tasty food worth the calories and improve the ambiance - it can be a game changer.  Also, please be a bit more family friendly or advise that this is not a family friendly place.  As a family man \/ Christian, this place has been my first big turnoff place in US.  I have been to a variety of restuarants before.  But this is the first one that I found to be odd - in an unpleasant way.","useful":0,"funny":0,"cool":0},
{"review_id":"szNSw5M7Tu5Fg5MWLAvMZw","user_id":"3-F5RRKKTfhKjj-ocEo8Ew","business_id":"gTw6PENNGl68ZPUpYWP50A","stars":1,"date":"2014-02-07","text":"I have been to all the Korean restaurant in Las Vegas and I would rate this restaurant as MSG overdose.  It's not all bad,great location and plenty of parking space.  I would hang out here and have couple of soju!!  I'm from LA..  Korean food central!!\nSo I guess I'm spoiled..  But having a healthy and great tasting food is privilege,,T.T. But for time being I'm gonna have to lower my standard ..!!","useful":1,"funny":1,"cool":1},
{"review_id":"_OcQnpSSesXjbjga2WHhKg","user_id":"3-F5RRKKTfhKjj-ocEo8Ew","business_id":"oN1_FGeKwKUoKKTRjxk9rg","stars":5,"date":"2013-08-05","text":"like their second location on maryland park...many different wig selections...amazing customer service......this location has been here for 20 years....  i never seen so many wigs in one spot......price is amazing too... i love to find place like this in vegas...","useful":0,"funny":0,"cool":0},
{"review_id":"J4hTE7zO1JGVr4KrgBWvOA","user_id":"3-F5RRKKTfhKjj-ocEo8Ew","business_id":"JnTKbdKZNZqFnYl1cXsV0g","stars":2,"date":"2014-02-07","text":"I would not say this is the worst beauty supply store in the city .. But disappointed at their service and product line..!!!!\nWhy is so many stuff that was outdated and ripped open like it was used before.???\n I have gotten a hair which I paid 150$ (cheaper than any other location) but when I got home it was matted and smell like someone had used it before...left me wondering :: am I wearing something that had been on someone else's head???\nIt's not worth it...","useful":2,"funny":5,"cool":0},
{"review_id":"cWjA_iwTUmeMP5GJ3LWvNg","user_id":"3-F5RRKKTfhKjj-ocEo8Ew","business_id":"eR7Iw_X54m3YLWkXp9y35Q","stars":3,"date":"2014-02-07","text":"Really great donkatsu ...!! But that's about all they got.. They need to develop more stuff to put on their menu.. It's all about getting more people coming to the restaurant, and just having great donkatsu isn't enough..!!!!!!!!!\nNnb\n\nA.      A.         A.      A.","useful":1,"funny":0,"cool":1},
{"review_id":"SRwVldxEM_dVp9QmYbLuqQ","user_id":"3-F5RRKKTfhKjj-ocEo8Ew","business_id":"t55OEa8kSgMBnGH-KzNHkw","stars":5,"date":"2013-07-29","text":"when i walk in , i was shock how big and nicely organized this place was!!!!!\nprice was pretty great and stuff came to help me locate the item that i wanted quickly.\n\nand they have some of the wig that you can;t find anywhere else in town....\n\nthis is like a wall mart of wigs and cosmetics ....LOVE IT...","useful":0,"funny":2,"cool":0},
{"review_id":"Zlkc6jBHqKrN3qY6UmgZig","user_id":"ia_aL0wvG2kHK_WO9GAHLw","business_id":"nMo0ozHO7cqsPaxw_7N6ow","stars":1,"date":"2015-02-16","text":"If you are looking for a professional, clean place to eat do not go here.  They are super rude, the place is very dirty, and the food is not fresh.  We were super disappointed!","useful":1,"funny":0,"cool":0},
{"review_id":"rJPLNGgBn_Zif54XBcRsNg","user_id":"7Y7317_44kbnxp-8Ujxz9g","business_id":"ASvQjxsHVd8J8o_kHJUQiQ","stars":5,"date":"2016-01-25","text":"Great variety of tasty salads and paninis. Prices reasonable and staff very friendly. Will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"NXD5znFZKQfcmlpjrZq3wQ","user_id":"lSKRXSASCSvJQfOdkDuVbA","business_id":"qOd7QUh-sIB7zN7RbP1-qw","stars":3,"date":"2015-08-08","text":"The bowls at thrive are pretty tasty, but the customer service leaves much to be desired. I have been on three separate occasions and have been greeted properly only once. However the other two times the same person was very unhelpful explaining the menu even after I said that it was my first time there. To me first impressions are everything and if you want someone to come back and buy what you are selling then you should make them feel appreciated or that you  like them spending their money at your place of  business.","useful":0,"funny":0,"cool":0},
{"review_id":"GwwasE1yaylZ6FlMsDKAag","user_id":"uluFy0ert8rp8_tPGUkF4A","business_id":"IE0QRqaUSW51RmShZ9dX1Q","stars":4,"date":"2015-09-08","text":"nachos are a must try. chana masala taco - an interesting attemp at indian cuisine. overall, will eat with them again...","useful":0,"funny":0,"cool":0},
{"review_id":"xy8LlU0tOyCkXMxUHgCa6A","user_id":"uluFy0ert8rp8_tPGUkF4A","business_id":"NvOdaJ7uIrBuofR8_Q7g2Q","stars":3,"date":"2015-09-01","text":"since there is no option to give 3.5 stars, i am giving 3. the place is better than most others that I have tried recently. but not too great either. the bread of pizza was too oily for me. and the cake too sugary... like, way too sugary. \n\nwill i go there again? probably won't mind...","useful":0,"funny":0,"cool":0},
{"review_id":"x4VzykjdCwqw9lIvGJqksA","user_id":"OIiMK2GoqAOln54CywEkOg","business_id":"k9mMqaHBo81suZzIK9dq9g","stars":1,"date":"2017-08-16","text":"I purchased a groupon and was sorry the minute I walked in.  They were rude.  I had polish on and was told that it was 10 dollars extra to take it off.  The manicure sucked and the skinny girl filed my cuticle until the skin came off.  I told them I wanted a hair cut she did not even wash my hair and she charged me $35.00.  She then had the nerve to ask me if I wanted to book another appointment, I almost laughed in her face!  I don't know why people are in the people business and know nothing about customer service.","useful":5,"funny":0,"cool":0},
{"review_id":"nY6hB6kl444StaNzYXzquw","user_id":"DrdpnUUjsNwU_INuCm9DCA","business_id":"BTCyGInJYzRTQVBhZvC9qw","stars":5,"date":"2016-02-17","text":"Used them on 4 installs,  2 commercial and now 2 at my home. Have been very happy with them! Quality installs too. I'm a do'er and a fixer type person and always go the extra mile,  I'm not easy on anyone doing something for me if they cheat. I would put extra glue and upgrade the screws at Ace Hardware on ikea furniture. These guys do have a great team. I don't know what's with all the complaining on aged systems or service calls. A business can't run off giving you everything free. I read a review on here a guy was quoted for 2 items, needed 3 and wanted that free too, geez! I'm sure he had to push for the \"could be quote\" also. Having done field service, no one says for sure what your problem is without looking first in person. I'm just disappointed in yelp and online reviews all together due to these types of people. They are making it so these reviews don't hold any value for a researcher at all!","useful":0,"funny":0,"cool":1},
{"review_id":"3FaARkVkhCiAxLCT9SaBIA","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"pLP4zc_eImuD5-AMtZAYHg","stars":5,"date":"2012-03-18","text":"Moms to Be is my go to store for baby\/toddler items. When registering, the sales associate helped us as first time parents navigate all of the NEED items versus the NICE TO HAVE items. Huge selection and yes, it can be pricey, but they stand behind what they sell.\n\nDon't forget the AS IS store too. Great deals!","useful":0,"funny":0,"cool":0},
{"review_id":"h46ErsYv1Y3CFH5vPbaxJg","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"_EU8Viz7ng9cXNdIjxwNRQ","stars":1,"date":"2012-02-21","text":"This is the closest family restaurant to our house and we want so badly to like it - but after two bad experiences, we're left wondering how many more chances we will give them. Last night we went with our two-year-old son and hoped to have a quick, simple meal. The restaurant was busy with other families but not overly full. Servers passed by us as we stood at the door and the bartender (who we also assume is the owner) waved us to an open table, where we waited to get menus. We ordered two burgers and pasta for the little guy. It took more than 30 minutes to get our meal and my husband's burger was not prepared as described (or having experienced it at other locations).\n\nSince this is the second disappointing experience, it was clear to us what is wrong with this restaurant. The kitchen is clearly mismanaged and cannot handle being busy. Food quality is inconsistent, even when ordering a simple burger. Tip: do not order the steak.\n\nIn addition, it seems to be poorly run as there is no rhyme or reason to how people are seated and served (a table that arrived well after us received their appetizers and we were waiting on our only order).\n\nWe have had good experiences at other Shoeless Joe's and want badly for this location to thrive on a difficult strip of Eglinton but their kitchen needs to step up. We'll give it one more try but after three strikes, you will be out Shoeless Joe's and we will make the drive to Bayview for other restaurants.","useful":1,"funny":0,"cool":0},
{"review_id":"GcaEqvh1ZXyH5saWsCRKzw","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"9pIRk8qlM85YxYTJnm7ShQ","stars":4,"date":"2012-03-18","text":"Having tried yoga several times, I decided to give it one more go with a Groupon deal for Serendipity. The studio is a two minute walk from my house, so rain or shine, there is no excuse for me to skip out.\n\nAfter my first class with Chris, I was sore but felt looser and more relaxed than I have in years. Looking forward to my next class! No skipping!","useful":1,"funny":0,"cool":0},
{"review_id":"ywj9t59t0INNfJfBn-Rqbg","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"3gdjVkNeUa9piW9H708Aig","stars":4,"date":"2012-03-18","text":"Have only tried their takeout but can be picked up in 10 minutes and soon you are dining on some delish fish.","useful":2,"funny":1,"cool":2},
{"review_id":"cfXLc8JLr_dawXc_Q-uSaw","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"ZpPOiNYi4AHNneI7uco7GQ","stars":4,"date":"2012-04-23","text":"Our family loves going to McSorley's. Our toddler always has a great time and the staff is friendly. Good variety on the menu and a lot of food for your dollar.\n\nWe often go weekly and the bacon for brunch is perfectly cooked.","useful":0,"funny":0,"cool":0},
{"review_id":"wvzt5S4smURrYA0FLttLxw","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"xzU6o2UgxfZyXrPc4zF9-A","stars":5,"date":"2012-03-18","text":"So excited they've moved into the neighbourhood. Spring-like weather let us walk down to get some great yogurt with yummy toppings. Will be a weekly treat.","useful":0,"funny":0,"cool":0},
{"review_id":"R7GnoVWDHkba_RoHCO9cBw","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"RwxU6hhZUZIB-gdm5sOmvA","stars":5,"date":"2012-04-23","text":"I have been going to Shagg for nine years. After searching high and low for someone I could trust with my hair, I found Justin. He has encouraged me to take some risks and always gets it right, giving me styles that work with my face. \n\nThey always remember me by name - which is the height of great service. Looking forward to another great nine years!","useful":0,"funny":0,"cool":1},
{"review_id":"gPOGU0Ct2P--B64W2SJDHA","user_id":"scaPIsZT65tJn_ofLWJbyg","business_id":"PxH02Eu2Z4MUycBLU80D8g","stars":3,"date":"2012-03-18","text":"Tried lunch here a couple of weeks ago. Have not had Indian often but the lunch special was good value. Lots of food and it was yummy. It was very quiet so a good place to go if you want to have a good chat. \n\nNot sure if I'd go back for dinner - depends on price.","useful":1,"funny":0,"cool":0},
{"review_id":"fJb4Dp3EQ8YO7vaVbXT6hA","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"oi6txZ8-Hj8BU4Dsk4hn5g","stars":1,"date":"2014-07-20","text":"Went to Don Lencho's last night with husband, and I must say I was not impressed. First we walk in and we were not greeted by the person who is operating the register, I assume it was  the owner. We then were greeted by a waitress she sat us, took a while before she offered drinks, their salsa is pretty much watered down and it tastes bad, in would of much rather have canned or tapatio than theirs. She brought our food we had no silver ware we asked twice for it while our food was already in our table. I had to ask for a refill and what they were out we had to wait for it, really it's understandable but please be prepared. We then proceeded to pay the lady did not say a word yeah not a good way to make business heck she did not even thank us. And. It to forget how uncomfortable she made me feel. right above where I was sitting was a tv she was staring at it constantly. I ordered fajitas and they were defenetly not what I was expecting. Needles to say we won't be back.","useful":2,"funny":0,"cool":0},
{"review_id":"aBG_vU4wMWs9ppXsO81ntQ","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"Cp_wAQDPDm0MESkLvKY9yw","stars":5,"date":"2014-06-23","text":"When I learned that Anise Cafe was closed I about died! I'm sure a lot of people felt the same way. When I found out they just changed name and new location I was jumping off the wall! Why? It's simple The food is delicious, outstanding service!, pleasant environment!  I am now a happy happy person!","useful":4,"funny":0,"cool":0},
{"review_id":"ChIE5tnKx9VHnMiAmCnALA","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"Ynm7H4c2ll5vZEX3iLdxmw","stars":4,"date":"2014-07-30","text":"Went to this place to make sure it was as good as man vs. Food made it seem! Was not disappointed it was delicious, I orders a Milanesa nothing but perfection!! The only reason why I give it a 4 is because of the crazy loud music they have playing, god I can't even Hear my self thinking I had to scream for them to get my order and for a person who talks loud like me to scream it must have have super  loud that they could not hear me!","useful":0,"funny":0,"cool":0},
{"review_id":"EQz7kvAArdlLR05VKWUp1w","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"3HrT5IcO3sd4pSBCFP4OYw","stars":5,"date":"2014-07-28","text":"Oh boy was I pleasantly surprised by this delicious place. Always stop by Starbucks and this time I decided to try it and oh boy was I missing it! It is just simply delicious their egg drop soup is phenomenal their teriyaki chicken out of this world! Would decently recommend it!","useful":2,"funny":0,"cool":0},
{"review_id":"UTv430ftfEtayjn-N8ePCA","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"AsLqWQH86sie035iDtQPOA","stars":1,"date":"2014-07-25","text":"The food is reasonably priced, the service is excellent but not too Impressed with the Food or my experience. I ordered a Torta and it was very simple not much flavor at all! Their salsas are watered down. I did love the pickled jalapeños and carrots thought. The reason why I'm giving such a low score is because when I get there before I ordered i asked for the restroom she said, no you can't use it I'm cleaning it right now, really you are cleaning the bathrooms as she is carrying some used paper towels and a bottle of windex. I still placed my order I observed her she continued so help people she did not wash her hands! Yeah needless to say I did not enjoy my Torta and will not be back!","useful":1,"funny":0,"cool":0},
{"review_id":"5lIq56ucF-DGXH0wGPX_-A","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"-fMdqIROzS2V3t5QQPj5-g","stars":5,"date":"2014-10-28","text":"I love this place, every time I come I feel right at home getting pampered. The staff is very professional and friendly. They do a fantastic job.   They are always willing to do what ever crazy idea I come up with. I highly recommend it.","useful":0,"funny":0,"cool":0},
{"review_id":"Rhsu8SpBJ2zb5huHTmi4yA","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"KkmSbkWOWC3DtY-Sxa9PmQ","stars":5,"date":"2014-07-22","text":"This place is absolutely the BEST!! You will not encounter one thing I their many that is not good. Their teriyaki sauce is to die for. I mean everything is delicious! They are all so friendly, fast service and they make you feel right at home.","useful":0,"funny":0,"cool":0},
{"review_id":"xPBZx3b_AHe5AbLXy2tBWA","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"aGA_iSHm9laGTrfPLJG1yw","stars":5,"date":"2014-08-07","text":"My husband is peter piper pizza #1 fan, and I must say I have gotten to love it to. Today I placed a care your order and was pleasantly  surprised that the phone only ringed once and one picked up so super friendly with a great attitude. Once I got there I proceeded to pay the girl in front was very helpful and with a good attitude. I asked for a cup of water and the manager asked if I was waiting for a Carry out and he gave an actual drink cup. I thought that was very nice. I'm happy to see that people take pride in serving well with a great attitude. After being in many fast food places and stores people really have bad attitudes and are not helpful I was happy to be treated well. And not to forget the food it was delicious as always.","useful":1,"funny":0,"cool":0},
{"review_id":"GyXiWRRL8eRN6IjnJK3P-A","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"RG8487-T5dZii3f7APO64w","stars":5,"date":"2014-11-12","text":"Oh boy, what a pleasant surprise! The food is amazingly delicious fairly inexpensive! Would recommend it. The fresh spring rolls Are double the size other restaurant serves for $3.25 others charge $4 and up. The Pho is so delicious I want to take the pot home. I don't mind paying for good food but at this place the prices really surprised me.","useful":2,"funny":0,"cool":1},
{"review_id":"zc0r8XFZSXWKG_lB91Orzw","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"ept9mIlqGIsemr6w0RczaA","stars":5,"date":"2014-06-25","text":"Walked in to place a carry out order I was greeted  immediately. the waitress was so hopeful in assisting me with the more healthier choices of their menu. Answering all if the questions that I had, and like always you never go wrong with going to pita jungle so much to choose from and their service is wonderful!","useful":0,"funny":0,"cool":0},
{"review_id":"iHpCrNYCGjUpZxoNk0Ihgg","user_id":"Vue9_VsoYdF8h5G4T-_-8g","business_id":"kkEqZmVvVkgmCaOqE13mDg","stars":1,"date":"2014-07-21","text":"Was craving good authentic Chinese food, while I was shopping at metro center mall So I decided to try #1 Sushi, the service was wonderful very fast service, their prices are wonderfully affordable and their portions are huge. I mean $.75 cents for a full side order of noodles you can't beat that I said! Well then I finally got to sit to enjoy my meal and wow the chicken is so bland, flavorless and the wonderful deal with the noodles not so wonderfully at all they just taste like boiled pasta. So I drenched the pasta and the chicken with sauce and Siracha in hopes that it would add flavor yeah no, my mouth is on fire and it still tastes bland. The only good thing was the rice, yeah the rice cause I mean there is so much science in making white rice, right! Since I'm not for putting my mouth on fire again I won't eat there again.","useful":1,"funny":2,"cool":0},
{"review_id":"RsUvmWbYgFjiY2asQtjS7w","user_id":"uBhg8JSdQ3oRou64GkFtEA","business_id":"Lo-lpCxoP1_T3cvTpp4ZCw","stars":5,"date":"2017-09-18","text":"Stopped in while my boyfriend & I were on our way to Cathedral Gorge. With all the driving we were desperate for a good beer. Friendly staff & we loved the Hop Ride American IOA. We are from San Diego so we basically live off IPA's. Awesome addition of going upstairs and checking out the beer vats and where they brew from the glass wall. Well worth a stop on our drive :)\nBONUS: We loved all the chalk art.","useful":0,"funny":0,"cool":0},
{"review_id":"iIvFQe1MZef1vnWUqlsBnA","user_id":"aolR29gJ94AIRl0TR_Sq7g","business_id":"c7HllzFeeEEE8YjXAqxvYQ","stars":5,"date":"2017-09-19","text":"I've boarded my cats here for the day multiple times without any issues!  The staff are always so sweet & you can tell that they are true animal-lovers.  It's tough to 'abandon' pets for a day, but I always feel reassured as soon as I drop them off.  I was 5-10 mins late (after 6pm) picking up once, & they were extremely accommodating.  10\/10 would recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"hhsAqcqIN_zzV2dS4MWcwQ","user_id":"aolR29gJ94AIRl0TR_Sq7g","business_id":"8rJvJE_sFy-y3nG5R4PW7g","stars":5,"date":"2017-08-11","text":"Our office is extremely clean thanks to Michelle & Alyssa!  Not only were they thorough & efficient, but they were also extremely polite & friendly.  Thanks ladies! :)","useful":0,"funny":0,"cool":0},
{"review_id":"tkC_6BNvOcrZe3vzXVGFsg","user_id":"aolR29gJ94AIRl0TR_Sq7g","business_id":"dhBAQJLKPCI7nm3x0WjXTw","stars":5,"date":"2017-12-22","text":"Got the Ahi tuna bowl - the ingredients were fresh, colorful, & delicious!  Perfect for anyone who's sensitive to spicy foods (like me).  Every member of the staff was friendly & extremely helpful.  10\/10 would eat there again!","useful":2,"funny":0,"cool":0},
{"review_id":"jUBh0zupdk7DJ4BJb8ahKA","user_id":"myw1gIaYsZjV-dCrUi-YiQ","business_id":"hihud--QRriCYZw1zZvW4g","stars":5,"date":"2015-12-26","text":"The wait wasn't that long and the dwen jang jjigae was pretty good! With the exception of being charged extra for lettuce, was a great experience!","useful":0,"funny":0,"cool":0},
{"review_id":"5kdndlbWogB-H7xwo1mFRA","user_id":"OFgEdmBoWr6LZEKnssJbQQ","business_id":"z-uc0kT6_mrWxwxfVzTcKA","stars":5,"date":"2017-01-06","text":"Just ordered a few drinks from this Starbucks inside Albertsons. I wanted to give a shout out to the girl working, Kristina! She helped me out so fast, and was very personable. She was the only one working, and busted out my drinks so fast &  helped the next customers as well as she helped me. I wish I could have left her a larger tip for her awesome personality, but I'm hoping writing this review will give her some good credit!","useful":0,"funny":0,"cool":0},
{"review_id":"8_CvA8vgps7LyJH-KYu5oQ","user_id":"OFgEdmBoWr6LZEKnssJbQQ","business_id":"81nNDsj6rNh25UnhSENETQ","stars":5,"date":"2016-10-18","text":"I will be recommending Michelle to everyone I know with a newborn! The pictures she took came out better than I could have imagined. She had such patience with my daughter while waiting for her to fall asleep for the shoot, and seemed like she knew every trick in the book to calm her down. I don't think there would have been a situation that Michelle could not handle and still get amazing photos from. She truly exceeded my expectations.","useful":0,"funny":0,"cool":0},
{"review_id":"5n0igidEanReFoJl0DbXsQ","user_id":"OFgEdmBoWr6LZEKnssJbQQ","business_id":"PYiECJCrpF8P0UdzxAkAsg","stars":5,"date":"2017-06-29","text":"Best car wash my car has ever received! My car was a mess & needed a lot of help. Thomas literally left my car looking brand new. It's also clear he uses great products to clean, because my leather is still shining from the conditioner.","useful":0,"funny":0,"cool":0},
{"review_id":"LwJtHCcyxoOxVD0W0eYKEg","user_id":"SfUvta6mi7rn8krKQQ0RMQ","business_id":"xYiFdD4PGIqtSC77uJ29kQ","stars":5,"date":"2016-09-20","text":"I've submitted a dozen print projects to Digital Insight over the past 3 years and have always been pleased at the next-day turn around, material quality, and print quality.  My perfectly designed business cards, stickers, full-page fancy flyers, and floppy tri-fold leaflets all looked good on my computer -- and absolutely amazing in real life, thanks to the crew at Digital Insight.  A++ will submit many more projects through their webpage to be picked up hassle-free super easy!","useful":1,"funny":0,"cool":0},
{"review_id":"oZAIpiI_j-7JBmV3kn7y_Q","user_id":"rRvnWpLBghCqP5cM66PCLA","business_id":"c2sDJFcMv-r5V1d85KUM-w","stars":5,"date":"2011-01-04","text":"the best place on earth. despite being pretty busy even at odd hours, the employees have been claiming that they're going out of business for at least ten years now. arrive early to hear christopher (the grill man) curse himself as a \"fucking cheesesteak slave\" or listen to john himself casually mention how shitty his life is. the only thing better than the cheesesteaks are the meatball hoagies, and i legitimately struggle with deciding which one to get days before i even get back into town. they use only the realest rolls \"from conshohocken\" and utz crab chips are usually stocked. as of thanksgiving 2010, the arcade features mortal kombat 3, but asking john to break a dollar so you can play is not for the faint of heart.","useful":2,"funny":0,"cool":0},
{"review_id":"ggRLQuufGR3gtbQva-gnUg","user_id":"RXBM9-jYbCH7o9T8LaDuVQ","business_id":"N42CouuodYv-yGpmuUZyew","stars":3,"date":"2013-09-26","text":"To start with, the food was very very tasty. Loved the flavors and the spices underlying them. Quite honestly, I believe that you could basically order anything and love it. Ethiopian for those who haven't tried it before generally includes eating food with your hands on a bready-pancake like food where all over your selections are placed upon allowing the tastes from those selections to seep into the bread.\nExpect portions to be filling and fairly large.\n\nNow that said, I will admit this won't be the best written review because every review should tell you what that person had and ideally include a photo. I'm admittedly doing neither mainly because I did love the food and it was already halfway gone when I realized I should have taken a picture.\n\nWhy 3 stars? I came here with my mom who had heard about the restaurant in an article and wanted to try it out. We went in for lunch at about 12:45pm and even though the standing sign outside displayed their hours and said they were open, the sign on the door said closed. We tested the door anyway and found it to be open.\n\nMe made our way inside and were struck by how dark it was (it was a cloudy day outside and there were no lights on in the restaurant) and secondly by how empty and bizarre it felt. The only light coming in was natural from the windows. The music added to that obscenely strange atmosphere. It was the WQED station on the radio playing a rather dark and mysterious piece.\n\nNeedless to say, we stayed, and enjoyed a wonderful meal. However, service was a strange element as well. It took 20 minutes or so for food to come out which is fine but once we were finished with our meal, we waited half an hour looking for someone to take our check. Since we were the only ones in the restaurant the entire time we were there for lunch on that Friday, we would have expected them to be a bit more attentive. It wasn't until we finally hunted someone down in the back of the restaurant that we were able to pay and leave.\n\nThe food earns this restaurant 3 out of 5 stars. However, service and ambiance kept it from receiving a full 5.","useful":0,"funny":0,"cool":0},
{"review_id":"xhVGpUac19y8n-XyXhNsrg","user_id":"HRrY-Btr-5w-TArnl7jBKw","business_id":"f4vb5tv60WaBcwzRhKpANA","stars":5,"date":"2015-01-24","text":"I've been waiting for this place to open for months and now that it is I couldn't be happier. The food is amazing, the place is clean and welcoming. Prices are decent and Id come here everyday if I could.","useful":1,"funny":0,"cool":0},
{"review_id":"KFQk6199aHOdk8umi0j5pA","user_id":"HRrY-Btr-5w-TArnl7jBKw","business_id":"h3pMMRwqBjMeMtk0_qQzRQ","stars":5,"date":"2017-06-19","text":"Came here for Fathers Day dinner and I must say it was an overall success! All the food from the appetizer special we split (mezzo sampler) to the desserts were great tasting, well served and just plain great. \nIt took forever to choose entrees from the menu, but not a single one of us was disappointed. \n\nTheir ac is down so it was really hot throughout the meal but other than that everything was really great. \nThey're not too expensive either, with an awesome happy hour\/lunch menu. \n\nWe will definitely be back to try the other items on the menu!","useful":0,"funny":0,"cool":0},
{"review_id":"2qVfQKGaKSnmgAVtsxNobA","user_id":"HRrY-Btr-5w-TArnl7jBKw","business_id":"mIzlYJ0n8cXIHs1JiPN8kg","stars":5,"date":"2017-06-14","text":"The ramen is awesome and the prices are great, you get a lot of food for your money. The broth and noodles are tasty  ! \n\nThe spicy miso broth is super good and you get a lot of toppings and a hand roll for $10! \n\nThe young lady who served us was very nice and helpful. \nDefinitely coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"mbRaMJnCZ8mhmocd2R-G6g","user_id":"HRrY-Btr-5w-TArnl7jBKw","business_id":"t4bBKVXbr8bIN9nEJIobYg","stars":5,"date":"2014-12-07","text":"This place is amazing. I could eat here everyday. The staff is extremely friendly and welcoming and the food is awe inspiring. I've developed a taste for spicy food because of this place and now I can't get enough. Any meat dish is cooked to perfection always tender and perfectly flavored. The prices are decent and the atmosphere is peaceful although I'd love to see them expand. I cannot stress enough how good the food is!","useful":0,"funny":0,"cool":0},
{"review_id":"0q-XnAMiAPu2BF_eTHb4gQ","user_id":"HRrY-Btr-5w-TArnl7jBKw","business_id":"Z3ZSar8IVAR2qIupqxMynA","stars":3,"date":"2017-07-18","text":"Best pizza in Las Vegas, hands down. BUT, it is so expensive that I have to take 2 stars off. Their dough\/sauce recipes are awesome and they're open very late with delivery. BUTTTTTTTTT, just so freaking expensive. Make your slices cheaper, or start running deals guys! Over 400% mark up on slices is craziness.","useful":0,"funny":0,"cool":0},
{"review_id":"kPzsAg1-XJ6fdq6nkyufUg","user_id":"JaHLP8eK83z6oXBpV8UFwA","business_id":"bkh5o6bCzDCovSkRYBsU1w","stars":5,"date":"2017-08-10","text":"We had the best service! The food was amazing! Wings was just perfect. We both had the outlaw stake mmmmm the prices were a bit high but all in all we loved everything we orderd which was a lot! The key lime pie is soo yummy!","useful":0,"funny":0,"cool":0},
{"review_id":"sL68ZsK3zUBziVzIICXMNg","user_id":"JaHLP8eK83z6oXBpV8UFwA","business_id":"eWg_XPt--3IWyMCZ_1dFlw","stars":5,"date":"2017-08-10","text":"We had to stay here a week and its been a great place to stay. The staff is amazing. They are very respectful and super sweet. All the extras you get for staying here just tops it. Two free hot meal! That are very good. And free soda n popcorn..plus 3 free happy hour drinks woohoo","useful":0,"funny":0,"cool":0},
{"review_id":"ZLs8Ca1aBoZAPHderNA1lw","user_id":"JaHLP8eK83z6oXBpV8UFwA","business_id":"6o6XxnI8RWhnAVSdxqCJWQ","stars":2,"date":"2017-08-08","text":"I was staying in town for a week. I wanted to try new places while i was here. I read reviews for Jet. Couldn't wait to bite into it. When i did i was very bummed out. Nothing like the reviews at all. Altho delivery was fast and food was hot.","useful":0,"funny":0,"cool":0},
{"review_id":"AiaTFgpbuvViiwmG_Dy1nA","user_id":"JaHLP8eK83z6oXBpV8UFwA","business_id":"sjpsGKPABZDnABCv3wYtUQ","stars":5,"date":"2017-08-11","text":"The pizza was full of flavor! Lots of topings! Sauce is perfect! If i lived here in town id deff order again!!!","useful":0,"funny":0,"cool":0},
{"review_id":"-BxRg3Dq-cM_mqpmGYblhg","user_id":"cms9sU07JrjfF5V0t5lNBQ","business_id":"ioY-a1TntpsAGJAG5_1Zyw","stars":1,"date":"2012-12-21","text":"Well ordered a pizza from here just a simple 2 topping with some wings.  They said it would be 30-45 min. After an hour went by they finally showed up, driver said they had forgot the wings, pizza was not hot anymore and delivery driver made me tip him by claiming he only had a certain amount of change.  \n\nA very mediocre pizza place that would never recommend or ever order from or eat at again.","useful":0,"funny":0,"cool":0},
{"review_id":"2EwHgIdR88aXSfTlHppoTw","user_id":"cms9sU07JrjfF5V0t5lNBQ","business_id":"_n3w5BK4-k7iXCWifCjUZg","stars":5,"date":"2012-12-21","text":"I came here for a friends birthday and was blown away. It reminds of being back home in the Midwest! The food is incredible with service to match!","useful":0,"funny":0,"cool":0},
{"review_id":"2lgwRHU1bGnmfLY1QWJboQ","user_id":"4aSZ8vwLs0pliAqjxS_xkg","business_id":"AE_q1IxLxwDeU0LdTnXxtg","stars":5,"date":"2014-07-04","text":"I recently had the awful experience of having two tires slashed. I looked up tire companies and teetered between going to Walmart, which I figured would be least expensive, and Norris, a local and family-owned company. The insistent advocate for small business in me won (despite how poor I am these days), and I called up Norris. I am SO glad I did.\n\nI called at 9:00am and talked to Scott. I told him my story and asked if I could bring my car in this week or next. He said to bring it on in today, and then asked if a tow truck already had my car. No, I hadn't called up a tow company yet, and he said not to worry, that he would take care of it. He took down the description of my car and its location and said he would send someone to pick it up.\n\nLess than an hour later, Scott calls me to say that my car would be ready in HALF AN HOUR. In just 1.5 hours, they had arranged for my car to be picked up, had gotten it to the shop, and had the new wheels on my car.\n\nThe price ended up being very fair, and especially considering the short time it took and the outstanding customer service. On my way out the door, Scott told me they rotated the new tires to the front (it had been my rear tires that were slashed) -- something I hadn't even asked of them. What professionals!\n\nI went from being quite moody about the car vandalism to being completely happy and positive. While it sucks that people out there slash tires for no good reason, people like Scott & the other staff at Norris restore your faith in humanity.","useful":3,"funny":0,"cool":1},
{"review_id":"czDa-muqfOdFjJjGjJkThQ","user_id":"4aSZ8vwLs0pliAqjxS_xkg","business_id":"CJ0sbMmixbh21d9fUoBEMg","stars":2,"date":"2013-03-14","text":"This place is hit-or-miss. But 90% miss. There have been a number of occasions where they steam the milk so hot that it destroys its natural sweetness (and I have to wait 20 minutes for the temperature to become bearable). There are almost always coffee grounds at the bottom of my espresso drink. And the staff just are never in a good mood. I actually feel like I'm bothering them when I place my order.\n\nTheir saving grace is the location and the zucchini bread. Hence, two stars.","useful":0,"funny":0,"cool":0},
{"review_id":"JvWgpYlZiSBW9waA4f5faA","user_id":"4aSZ8vwLs0pliAqjxS_xkg","business_id":"yJlqyI_w9bQ3I2nCJNYLQQ","stars":5,"date":"2013-03-14","text":"A friend of mine had recommended Caring Hands, and I couldn't be happier with them. The vet and the staff are knowledgeable, friendly, and compassionate. My cat had a problem with her eye, and they treated her gently -- their love for animals is incredibly apparent. They explained to me what was going on, prescribed for her some eye drops, and showed me how to administer them on my own (this would have been challenging without their instruction! The cat is not naturally amenable to me putting foreign liquids in her eye).\n\nFor what it's worth, I am a budget-constrained student, and their services are reasonably priced.\n\nThank you to Rebecca, Nancy, and staff for taking good care of my girl!","useful":2,"funny":0,"cool":0},
{"review_id":"LKXBR-J02wHGOfDdmB9dLw","user_id":"PNFkch6uS4x2Y78sHSK5sQ","business_id":"TLl79KIrEhjDr6u6rsoLhQ","stars":3,"date":"2016-03-01","text":"Things started out great. Scott (owner) was in the Scottsdale\/Thunderbird store when I came in. My wife and I decided on the porcelain plank tile, which looks outstanding and was a great price. Issues arose during the hand off from Arizona Flooring Direct to the installers.\n\nThey arrived a day early, when I wasn't home, and were ready to proceed with the installation. I was in the middle of a full remodel which would not be completed until the next day since floors needed to be the last thing done. I had to come home and I ended up hauling boxes of tile (they didn't have a dolly and broke mine) into my condo so they had the materials on site to start the next day. Despite repeated calls and messages, I never again heard from Scott. I finally spoke with Gabe (GM) who was useless and left me feeling as if I was being unreasonable with my concerns. I went back into the store and found out Sheila, the saleswoman, no longer works there. \n\nAt the end of the day, the floor does look nice and it was a great price. However, I ended up going elsewhere for my carpeting needs due to their lack of accountability. I hope this ends up helping them with their customer service in the future.","useful":14,"funny":0,"cool":1},
{"review_id":"7Bd8N-IFxf0tsMesDpmOGA","user_id":"PNFkch6uS4x2Y78sHSK5sQ","business_id":"Q73jL-_BC1oEbCm8RKyraQ","stars":2,"date":"2015-12-28","text":"Everything started out well enough. Very nice sales staff but the pricing is murky at best. I put together a 4 piece appliance package (~$2,500) with Thomas and returned the very next day to followup. A different salesman, Kevin, told met the refrigerator was now $200 more because a sale had \"expired\". At no point was this mentioned when things were originally being priced out, nor when I stated I'd be back the next day. They wouldn't honor the price difference so I went to the Scottsdale Road location, which was a fantastic experience. Just go to that one and ask for Keith or Don.","useful":2,"funny":0,"cool":0},
{"review_id":"RseDkxeNjiU_21uVYrNFjg","user_id":"PNFkch6uS4x2Y78sHSK5sQ","business_id":"emi5FTQzpg0ScG2-I3c0bg","stars":5,"date":"2015-10-05","text":"Dr. Baldree recently performed a much needed septoplasty. He could not have been any better. Having read horror stories on the internet, I was not looking forward to any part of the procedure. He explained everything and took plenty of time making me feel comfortable with the surgery. I had very little postop pain or bleeding and already am breathing better. He is incredible from start to finish. For the best ENT, see Dr. B! I'll trademark that one.","useful":3,"funny":0,"cool":0},
{"review_id":"g_Xj43zlt3_GS7AK53VifQ","user_id":"PNFkch6uS4x2Y78sHSK5sQ","business_id":"fKlr9qNoV37WQJwQ826POg","stars":4,"date":"2015-10-05","text":"I'm a huge Fogo fan and have visited locations in various countries. The Scottsdale restaurant is pretty solid. When busy, the service can be a bit inattentive, and the premium cuts don't come around that often so be sure to ask! Overall, a fun restaurant with a great atmosphere. Enjoy.","useful":0,"funny":0,"cool":0},
{"review_id":"tLp3EfklBhPKT_MP7lLq6w","user_id":"PNFkch6uS4x2Y78sHSK5sQ","business_id":"T4M_GZ9zA9dKqME5s7TzBg","stars":5,"date":"2015-12-28","text":"Keith and Don could not have been better. They matched prices I found from other stores and even beat them with rebates etc. Great experience and I ended up with a Whirlpool appliance package (fridge, range, dishwasher and microwave). Overall, I was impressed since appliance stores can be hit or miss and often come with a negative connotation.","useful":0,"funny":0,"cool":0},
{"review_id":"aZw_J0GoUnDWUmfwq_WYpA","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"Qmx1rFrQHpcYT6XPNgv0zQ","stars":2,"date":"2016-08-04","text":"I have a complaint of being overcharged.  The product is  mediocre, the older woman ringing my order up, insisted on charging me individually for each cupcake, when I had a 6 pk. and a 4 pk. of cupcakes which costs $32.50.  10 single cupcakes were $36.50.  I even put a nice tip in the jar before she started ringing.  Made me sorry that she felt she just had to swindle an extra $4.00 out of me.  I left because it was busy, but, it's bothering me.  Seems there's a buy 5 get 1 free deal.  I wasn't given that, either.  Just ripped off in more ways than one.  Will never be back and hope to save you from an unpleasant experience.","useful":1,"funny":0,"cool":0},
{"review_id":"6Zi7t6FHzr-yu8muPuqNcg","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"JLbgvGM4FXh9zNP4O5ZWjQ","stars":4,"date":"2016-08-04","text":"A really neat dining experience, esp. when ordering the giant rib eye on the bone.  It was cooked to perfection, tasted awesome and the muscles with tomatoe were the perfect appetizer.  We couldn't quit sopping up the sauce with garlic toast and I enjoyed my dining experience, very much, here!","useful":0,"funny":0,"cool":0},
{"review_id":"hpAOEcinFPc0INLB_5fcPw","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"w6WxZu_4-6XDt2eQaAqlWg","stars":1,"date":"2015-10-30","text":"I am beside myself with anger and disappointment.  This story is a little lengthy but necessary.  My medical center gave me a gift for a FREE, one hour massage, which I gifted to my young daughter who was excited and in desperate need of a good back massage.  She called to make an app't, in advance and gave the gift card number and all the information before going.....When she finished with her back massage, she tipped the therapist $10 and proceeded to check out where she turned over the gift card...The cashier told her she owed an additional $11 because it really wasn't free and she owed the additional money anyhow.  My daughter added another $10 tip on her charge card for fear that the $10 cash she gave the therapist might not be enough now and paid another $11 that she was told she owed, even though there was nothing stated anywhere that there was any additional charges and in fact, clearly stated this was for a 1 hour FREE massage.  What should I do?  She ended up paying $31 for a FREE  gift.","useful":2,"funny":0,"cool":0},
{"review_id":"bvNO5HRpTsNh4yTBZF_XMw","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"ivugOYd-QcXVEfnm1OyqZA","stars":1,"date":"2013-10-06","text":"I knew the original owner of Beto's and she would be furious for what is being done to it, now.  If the pizza slice gets any smaller, you'll have to call it a breadstick.  There was almost NO meat, on my Italian hoagie, which used to be the best around.  Whoever recently took over, should be ASHAMED.  Betos now STINKS.","useful":1,"funny":0,"cool":0},
{"review_id":"AvEyv67lhpytV6S53u6m4Q","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"rOHLBGBcWzlxdvNI6squgQ","stars":1,"date":"2016-04-12","text":"Ordered a chimichanga, got a soggy burrito, bland rice and bland beans, and not even a grand opening portion or flavor!  Look what kind of meal one gets for $20 and this was seriously sad and disgusting.  WORST MEXICAN FOOD, EVER!!!","useful":1,"funny":0,"cool":0},
{"review_id":"L6bcybeQ7CKtJkeczN5qfw","user_id":"qXLWeNPNcEplWj4meCckdA","business_id":"6V8D6uCQ-ChFap59Fc-ZoA","stars":3,"date":"2017-03-06","text":"I was disappointed twice.  Never by the food.\n1st time ordered a shot and beer.  Usually get top shelf liquor.  My shot was watered down and I told the barmaid.  Thought they should know something like that. \n2nd time, was given shot...fine and good.  Ordered 2nd shot and heard barmaid tell waitress out of my top shelf and was giving me lesser brand.  The waitress brought it and never said a word.  When the bill came, I was charged for 2 shots of top shelf and $1 more on my food order than the menu said.  I was nickled and dimed by a waitress for I don't know why.  I don't think she owns the place, so, why?!!!","useful":2,"funny":0,"cool":0},
{"review_id":"sieLUZOLx1Rt_t4N7jO1Hw","user_id":"1fJAOAy492YrhG8d6YhWSQ","business_id":"HPLB1Tr8ZB5UkD-2umKPdA","stars":5,"date":"2015-08-28","text":"Can't wait to go back and try more.  Service was great, restaurant was cool and clean, and the food was excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"MpdUXWvwj-8Ds2bdb55zrg","user_id":"MbT-IPb8UbOeW78Vvfl5_w","business_id":"SE6VY8EWjEuAOzl19IQiCw","stars":5,"date":"2015-07-13","text":"This place is awesome! Great coffee, great food and Elvis. You MUST try an Elvis!!  I stop by on the way to drop my kids off at school. Call my order in and run in and pick it up!!  Great service!! Seriously love this place!!!","useful":0,"funny":0,"cool":0},
{"review_id":"UlbbMW3SGh4EhiyZZkezaw","user_id":"JuIyVOouMHNDhpVJHHiU5w","business_id":"qmymSqVwHYRqdwfcBatzpQ","stars":4,"date":"2013-02-27","text":"had a great time food was excellent.  had prices that were affordable, its a great place to go relax after a long day at the office or to take your better half out for a nice evening.  also them having gaming made it all the better!","useful":0,"funny":0,"cool":0},
{"review_id":"_l2xFX7AM4vsAaL69cLANw","user_id":"JuIyVOouMHNDhpVJHHiU5w","business_id":"3sHuMp7XtNHE28ZcQ1mk_A","stars":4,"date":"2013-02-27","text":"when i first walked into the place i was a little taken back.  being a local of Las Vegas, this was  not like every other nightclub.  it had a dark feel but in a good way,  live entertainment every so often, and characters walking around mingling with the crowd.  reminded me of a rave style place but after being there a little while it turned out to be a great place.  the music was great and although not that big of a place they did not jam pack the place like most clubs in this town where everyone is touching your shoulders unless you buy bottle service.  the only complaint was the drink prices, but other than that i would def. go back and had a great time.","useful":0,"funny":0,"cool":0},
{"review_id":"qMze0138sxLWlKZyTbMH-g","user_id":"9QrE24JaemD3TLFihmTKxg","business_id":"SYKC66fxrtytQAIae9xd-Q","stars":5,"date":"2011-04-15","text":"I was able to get discount tickets to this show, B section, for only $38 bucks, but even if I had to pay full price, it would have been worth it. I arrived expecting to simply see a bunch of boobs swinging around for an hour or so, but the show ended up being so much more than that. \n\nThe intimate ampitheater-style venue is perfect for such a performance, as everyone gets a good view. There are a series of dancers, who come out for group or solo performances, but it's supplemented by a woman who has an absolutely amazing voice. I can't recall her name, but I wouldn't be surprised if she one day becomes a recording artist on a major record label, as she hits all kinds of notes, effortlessly! So there I was, enjoying the music, and the dancing, when another element was injected into the show....comedy. I truly wasn't expecting it, but it was a good surprise. The comedian not only told jokes, but also was an impersonator (James Brown, Sammy Davis Jr, Tina Turner, Michael Jackson), and worked his way into one or two of the acts with the dancers. \n\nThe combination of the music, dancers, costumes (or lack of), and comedy, created a great evening for me. And I'll mention, that I'm a gay man, and I thoroughly enjoyed this topless show, so it's definitely something for all adult audiences! Although the show is sexy, it's not sexual, if that makes sense. Anyway, it's worth checking out. Oh, and one last point, if you sit int he first couple of rows, you'll get a chance to have the singer and dancers come by and shake their boom booms in your face :)","useful":1,"funny":1,"cool":1},
{"review_id":"J3_URWRQAv8K54OibgLALg","user_id":"9QrE24JaemD3TLFihmTKxg","business_id":"pKOy7-pP-BdSVcCrtQo_ww","stars":5,"date":"2012-04-09","text":"Excellent designs for men and women, and bend over backward sales staff.\n\nAfter walking all up and down Las Vegas Blvd, seeking a pair of unique men's shoes, I was starting to give up hope.  Every place I went had hot hot hot women's shoes, but the men's shoes were so boring and department store-like.  Then, while walking in The Forum, out of the corner of my left eye, I spotted a pair of leopard skin men's shoes, on a pedestal, which I swear had my name on it.  I took two steps back, and made an immediate left turn into that store, determined to walk out of there with a pair of shoes that I knew I'd never see on other men on a regular basis.  Armed with that criteria, and a good eye for shoes that pop, the sales woman, Isabelle, set out on a journey to help me fulfill my desire.   While Donald J Pliner did have some standard designs, such as classic black loafers, the majority of the shoes were made to be the star of the outfit, more so than the clothes.  A calf skin loafer and boot, leopard skin buckle over loafer, silver loafer with metallic embellishments, were just a few of the amazing pieces they had.  I walked out the door with a pair of silver sequined shoes, with hand-sewn glass beads, creating a sparkling stepper.  As I took them out of the box, other patrons in the store were begging me to do a runway model walk of the shoes, which I was pleased to do.  While there were four shoes there, which I wanted, my luggage could only accommodate room for one pair.  Though, on my next trip to Las Vegas, a second pair will likely be obtained.\n\nThe sales staff are knowledgeable of the makings of each shoe, where the materials come from, and where the shoe is assembled.  If your size isn't in stock, they will order the shoe for you, and have it shipped to your door.  Though I wasn't in the market for women's shoes, I can say that if the men's shoes were as awesome as they were, then the women's collection must be even livelier.","useful":4,"funny":0,"cool":3},
{"review_id":"BVLnZXjkUFyEoXnnVJjBbQ","user_id":"9QrE24JaemD3TLFihmTKxg","business_id":"4GXII-GU7S0ZyU6ElkhscQ","stars":2,"date":"2011-04-14","text":"On my most recent Vegas trip, I went for a bachelor's party, and Hooters is where they guys wanted to stay. Though I prefer to lodge elsewhere, I didn't want to separate myself from the group, so I took a deep breath, and dived into the place that I was so happy to check OUT of a couple of days later. \n\nMy feeling of dejection began the moment we pulled into the garage. Everything is tightly packed in the garage, so each time we turned a corner to ascend to the next level, I had to close my eyes out of fear of that we'd scrape the car against a pillar, or another vehicle. In the garage, there's an elevator, which takes you to the casino level of the main building. The elevator is as dirty and raggedy as something you'd see in a rundown portion of an old NYC subway station. Unlike many other hotel\/casinos, which have adequate ventilation systems, to counter the smoke, this casino floor smelled like a tobacco factory. I will give credit to the check-in staff, however, they were very friendly, and a pleasure to interact with! The rooms were ok, nothing special, but it was clean, no bad smells, and I did have a decent view of the strip (8th floor). It's an older no-frills place, so I wasn't expecting marble floors and stone counter tops, so I was ok with what was there. The only issue that I had inside of the room was the shower. The shower heads have only one pressure setting, and it feels like needles pricking your skin. Otherwise, the accommodations where aligned with the pricing of the facility. \n\nI'd say there's a very low likelihood that I'll ever lodge at Hooters again. For me, it's definitely more worthwhile to spend the extra money and stay someplace directly on the strip, with a higher star rating. For the drunken Las Vegas visitor, who just needs a place to sleep, then this is the place for you. Again, despite my dislike for the place overall, I give kudos to the check-in staff for maintaining customer service competence, regardless of the surroundings.","useful":2,"funny":0,"cool":0},
{"review_id":"_y4M_SwRqSIvYAQZdDsc3Q","user_id":"9QrE24JaemD3TLFihmTKxg","business_id":"_j2EtQtgLuXGRBfbM5YwZA","stars":3,"date":"2011-04-25","text":"I suppose Noodle Asia fist the mold of the late night \"fill-me-up\" food, which people seek after a night of drinking in Las Vegas.  Maybe I ate here at the wrong time, totally sober, and fresh off of the airplane.  My hunger was satisfied, and I must have liked it to a degree, as my plate was pretty much clean, but reflecting back on it, my experience was simply, ok.  \n\nThere was a total of 6 guys that I went with, and we each got different things, so I was able to sample a couple of things other than what I'd ordered.  Shanghai Noodles was my choice.  It's a dish of wok-fried noodles with napa cabbage and pork.  The plate looked and smelled good, but the noodles were truly too oily.  I honestly couldn't help but think of Michael Jackson's 1980's jheri curl, so I suppose I can say that the noodles were straight up greasy.  However, one of the guys at my table got beef congee.  It had that nice thick porridgey texture that I love, not watery, as I've experienced at too many other establishments.  Also, the beef was tender, which I previously thought was impossible in a soup.  \n\nThough the noodles, their flagship product, aren't my favorite, I can say that they had excellent service.   We were seated immediately, and almost as soon as we sat down, water was at our place settings.  Additionally, time between placing our order, and when the first dish was delivered, was relatively quick, and when it arrived to the table, it was piping hot.  It is one of the \"casual\" dining spots in The Venetian, so don't expect a meal to write home about.  However, as I hinted earlier, if you're in need of balancing your liquid-to-solid ratio, after boozing, then head on over there.","useful":0,"funny":0,"cool":0},
{"review_id":"1wExxdvE5NVAtse9285IUQ","user_id":"9QrE24JaemD3TLFihmTKxg","business_id":"w8RWhhuKxMiFCpvFvIQ3zg","stars":4,"date":"2012-04-05","text":"More than just a chocolatier!\n\nThough widely known for their hand painted truffles, packed in decorative boxes and tins, and decadent hot chocolate, I discovered that Max Brenner dabbles into the savory side of life as well.  \n\nIt was after a few hours of exhausting shoe shopping in The Forum, that I needed to rest my feet, and found myself conveniently located right in front of the Max Brenner menu display. Though I could always go for a serving of their thick hot chocolate, it was the mushroom and ricotta pizza, which drew me in to have a seat.  Being alone, I opted for a comfy bar seat, which was a great idea, because the bartender was there to take care of me immediately, and check on my regularly throughout my time there.  I loved the flat rate pricing on the drink menu, $6 for cocktails and wine, and $4 for beers, regardless of brand.  That mushroom and ricotta pizza, along with a glass of sparkling wine, were my choices for the evening.  The pizza was a perfect-for-one-person sized flat bread, with mozzarella, chunks of ricotta, black olives, and sun dried tomatoes, with a drizzling of balsamic vinegar.  The smooth ricotta, combined with the chunky bite of the mushrooms, and the crispness the crust, offered a great combination of textures.  The sun dried tomatoes provided the perfect amount of saltiness.  Though this was the only food item that I ordered, I eye witnessed other bar-seated patrons ordering other things, and making positive comments about what they were indulging in.  Because of my surrounding observations, I may just have to come back and try a few more things.","useful":0,"funny":0,"cool":0},
{"review_id":"XFx5ZBsX9kSVtvgZSKh44g","user_id":"6DglCjROPLec4a883IjOrw","business_id":"EkuSy_kM8dpGrlb2pTxCBw","stars":3,"date":"2015-10-10","text":"Where can you find 24 hour AYCE Korean BBQ?  here's the place! If you're staying at the Rio, take the free shuttle to Ballys then walk 2o min on the strip to reach this place. It's in the back of what looks like an abandoned ally\/lot. There's lots of options on the menu for Korean dinner and meats. It's about $27 for AYCE which is worth it because most of the a la carte dishes are at least $20\/ plate. We decided to order individually instead of doing AYCE because we had 7 people and there's no one we could eat our worth. The soup bowls are medium sized so I suggest sharing one unless you can finish the whole thing by yourself. The shrimp fried rice was surprisingly very flavorful and moist, however, the brisket meat was disappointing. At $25,  we got a medium size plate that resembles the thicker beef slices in pho. \n\nIt was mediocre,but we may return to try the AYCE at a future date.","useful":0,"funny":0,"cool":0},
{"review_id":"KLN6Qek0mvXI2m-ih5Ma5g","user_id":"6DglCjROPLec4a883IjOrw","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":5,"date":"2013-08-24","text":"This is the place that I have been searching for all my life!!!! I wanted a place that offered a unique culinary experience and boy did we get it here!!! Service was impeccable; Steve was awesome and delivered great service. The wait was 40 min for our group of  9, but it was so darn worth the wait!!! I literally wanted to order everything on the menu; they're known for their hashes and Benedicts. \n\nKeep in mind that you aren't going to get the traditional Eggs Benedict with hollandaise sauce.  Instead, they create their own special sauce and everything we ordered was delicious! We ordered:\n\nSage Chicken Benedict: Crispy Sage infused chicken on top of a mountain of carbs (2 grape size biscuits and mash potatoes) smothered in a creamy Chipotle sauce with sauteed spinach. One word: Heavenly. \n\nMeat Loaf Hash: Meat loaf was tender and well seasoned. Best part, you didn't overdose from the salt because there was barely any! \n\nBlueberry Pecan Pancakes are as gigantic as a large pizza and was crispy on the outside and moist and fluffy on the inside. \n\nSage Chicken & Bacon Waffles: This meal changed my life. I never understood the hype over Roscoe's Chicken & Waffles or the new Lays Chicken and waffles potatoes chips, but this dish seriously was the best ever!! The sage not only elevated the super juicy and tender chicken, but the fried leeks seriously took the dish to the top level. I wish they had chopped bacon bits throughout the waffle rather than just one strip, but their homemade maple syrup wasn't overly sweet, so the juxtaposition of sweet and salty was like an explosion in your mouth.  \n\nWe are definitely coming back here every time we're in Vegas.","useful":3,"funny":2,"cool":2},
{"review_id":"Lc08mjC1ZG8ixADkJfVSRQ","user_id":"6DglCjROPLec4a883IjOrw","business_id":"kICgNgVRkIh4doz0atyMMA","stars":3,"date":"2013-08-24","text":"Boyfriend and I wanted something special, so when we saw that Hakkasan was located in the hotel we were staying at, we decided to try it out. Based on reviews, we tried their famous Duck salad with pomegranate, pine nuts, and sprouts The braised duck was super tender, but overly salty because of the sauce, but the pomegranate and pine nuts was a nice touch to the salad. The next option was the deep fried scallops with chili mango sauce which ended up being the only star dish of the night. You get a slight crispy outside with perfectly cooked scallops and the sauce was sweet and spicy. Boyfriend ordered the signature Hakkasan cocktail and that ended up being very delicious, so I would recommend it. Third dish was the pea sprouts and crab sauce which was very bland and didn't live up to it's hype. The crab sauce lacked flavor, so imagine a bland sauce on top of bland vegetables, it wasn't worth the price. The 4th dish received mixed reviews, we loved the tender and juicy fillet tenderloin, but we weren't impressed with how extremely salty it was. Supposedly their intent was to create an edible fried funnel cake like garnish under the tenderloin, but the batter was bland, hard, and inedible. When we told our server, he didn't even do anything about it or apologize! For the price we were paying, I expected better quality and service. To us, these dishes are described in an exotic way; however, if you really think about it, these are just typical Asian dishes that you can make at home. Overall, we were very disappointed with our food adventure and will only return for the scallops and drinks.","useful":0,"funny":0,"cool":0},
{"review_id":"K937wrtlYhbAm_W11LsXbA","user_id":"6DglCjROPLec4a883IjOrw","business_id":"ugLqbAvBdRDc-gS4hpslXw","stars":2,"date":"2013-08-24","text":"This place has great potential, but they give you soooo much rice!!! They literally packed it on, so we got full on our first round. The quality was surprisingly very fresh for AYCE and includes many special rolls which were tempting to order, but after just one roll, we just couldn't do it.\n\n My favorite item I usually order  is a crunchy hand roll and they got the crispy part done right, but it was overwhelmingly drenched in eel sauce resulting in it being a sickeningly sweet and overloaded rice roll. The service was definitely lacking, you get ice cream or mochi at the end of you meal, and it took 20 minutes for the check and another 20 just to get our green tea ice cream. 40 freaking minutes to get out of there despite reminding two different waitresses 4 times!!! Throughout our meals, we had to request for more water, our rolls, and napkins several times. So the price and quality of the fish is decent, large selection of special rolls, but if you want to get full, just order one hand or special roll and you're set.","useful":1,"funny":0,"cool":0},
{"review_id":"RfMqQOYL4AQkmPAlvgkxzA","user_id":"6DglCjROPLec4a883IjOrw","business_id":"nu1GQ_Q43JqzrWMZE_dE1Q","stars":4,"date":"2015-10-10","text":"The restaurant is located inside Caesars Palace all the way in the back near Mesa Grill. \nWe ordered the following:\n-Lt. Dan; an alcoholic ice tea lemonade perfect for those who like strong herbal tea flavors. \n-Snake in the grass;  a classic mojito with lots of mint. \n-Pan Seared Scallops with Couscous and Citrus Sauce;  three jumbo size scallops cooked to tender perfection on a bed of couscous with pesto and citrus sauce. The  couscous was delicious and blends very well with the thick pesto sauce; however, there was that additional sweet and sour like sauce  that the boyfriend and I weren't fond of because it didn't add to anything.   \n\n-The Porkbutt with whiskey apples and bacon emulsion was the most popular and recommended dish, but had mixed reactions from us. I'll admit the pork was so tender, so moist,  and practically melted in our mouths, but I found the porkbutt and bacon emulsion too salty and overwhelming. If you love salty foods like the boyfriend, then this is a must try dish.  I do love the whiskey apples which added a crunchy texture and pickled flavor to combat the salty and fatty porkbutt. \n\nOverall, it was a good experience and we will definitely come back to try the duck next time.","useful":0,"funny":0,"cool":0},
{"review_id":"eDBnSFj1P7R8bISggDZPVA","user_id":"zbJMCsr7T7uEY5r0YkW7Yg","business_id":"sqRX-XLlhx4rs2c1TpBf8A","stars":5,"date":"2016-06-07","text":"i  highly \nrecommend\nthe duck \nagadashi   \nits  very very  good","useful":0,"funny":0,"cool":0},
{"review_id":"NgpByQR1DzoZE3bb9hCKIQ","user_id":"4geH0oydJL_nvK5vYuDC5Q","business_id":"XdC9VC5Dp3wtctgoSAuo0A","stars":1,"date":"2014-10-19","text":"- DONT WASTE YOUR MONEY. -\nI'm here right now, and it's terrible. Been here for 3 hours and haven't been on a single thing. Obnoxious preteens everywhere. Save yourself the time and money and go to something worthwhile. Never coming back.","useful":2,"funny":2,"cool":0},
{"review_id":"c9bjiYWivtwWh4Mj6a5zUQ","user_id":"ktVA7E35SrieTb3S3V8JDw","business_id":"q-ioRQtzXpg498cbOR7F2g","stars":5,"date":"2015-05-13","text":"I had been looking for years for a massage therapist that is professional, knowledgable, and listens to my concerns and as well as adjusts the massage according to what she finds as the massage is taking place.  I have found that in Rosie.  It was the best therapeutic massage I have had in several years and will be returning as well as referring my friends and family.","useful":1,"funny":0,"cool":0},
{"review_id":"U2ahOxBzLFZI4FVrks1FgA","user_id":"ktVA7E35SrieTb3S3V8JDw","business_id":"JO_hCJISMK3sz_RWhg2e0A","stars":5,"date":"2016-03-12","text":"Great Place.  The owner Melissa is passionate about what she does and it shows. The pancake, oatmeal, and donut were phenomenal. Great variety of favors with healthy ingredients.","useful":0,"funny":0,"cool":0},
{"review_id":"HgTdMdU1Ea-nKQYElv2u5w","user_id":"IX10PnNm87TOnyMrubrOzA","business_id":"1exkETttojxwrYgrq3qMJw","stars":4,"date":"2017-05-23","text":"Local business with local employees. The gentleman at the counter was DEFINITELY hard of hearing, which made me laugh. I got 2 keys copied for just 4 bucks!!! He showed me their versions of my key, and was polite.... I just had to be super loud so he could hear... Again. COMICAL. But He did his job well.  I ordered special motorcycle keys online, and was referred here by North Valley Honda. I'll be back for any lock\/key related needs for sure.","useful":1,"funny":0,"cool":0},
{"review_id":"qDj10AjZJ-GBCLY4Ac7JdA","user_id":"IX10PnNm87TOnyMrubrOzA","business_id":"Fe_SCLiXz8P9yrbWijkIDw","stars":5,"date":"2017-12-05","text":"Love the atmosphere! It makes my 6 year old want to be a leader. Here they really are so patient & understanding. The classes are big, but everyone is in tune! There are ALWAYS enough instructors to give the children direction. They even encourage the parents to CHEER and CLAP for the kids! It is such a healthy environment of inclusion and success. We will be here until my son has the black-belt he has always wanted.","useful":0,"funny":0,"cool":0},
{"review_id":"XREWDngzxakUBa28q1du3w","user_id":"t2FYVCEGXZmbL28qbsociw","business_id":"QJS8r7COJYqVSzMGO8Us5g","stars":1,"date":"2017-02-24","text":"I like to try new places often and am pretty understanding when things aren't running as smoothly as they could. This place quickly struck out and kept at it. Sitting at the bar one would expect to not have to beg for service but here that was very wrong. \n\nAfter having to ask for a drink menu we were told that 1\/3 of the drinks couldn't be made because they were out of required ingredients, and there was no beer on tap because the system was being replaced. This place just opened a couple of months ago and the taps were apparently overlooked. The over-priced and under-sized old fashioned was about half sugar, the jigger used was not filled and half of what was in it was spilled on the bar.\n\nWhen ordering food we were told the choices for sides were chips or fries, and that other sides would be an extra charge. No problem, we got fries--only to find that they also charged another $4 for the fries. After waiting 40 minutes for food we waved the bartender down to say that if the food wasn't started to please cancel it as we had to leave in a few minutes. Fifteen minutes later she came back from the kitchen, having not come back to the bar the whole time, with our food. The burger was a burned little patty that could have come from the McDonald's  dollar menu and nowhere near medium as ordered. I won't even get into the state of the fries.\n\nOverall it was the most expensive dinner of the week and I only had about a bite and a half. I'd recommend any other restaurant in or out of town over Carve, including that dollar menu at McDonald's.","useful":0,"funny":0,"cool":0},
{"review_id":"qcxk9pjv-_kqGIRXyAJZ1g","user_id":"pGv05_gwnW39l-4JpIT3Dw","business_id":"u8C8pRvaHXg3PgDrsUHJHQ","stars":1,"date":"2017-02-18","text":"Worst experience in 20 years of visits to Champaign! Will never eat Papa Dels again. Doug, the so called mids 30s mgr with 45 pieces of flair on his cheap hat is low life ignorant loser. When my group of 18 complained about it taking 1:45 for thin crust pizza and water he copped an attitude, walked off, then tried to act tough lol. The pizza sucked, service was worse and doug is pathetic. #Never Papa Dels!","useful":0,"funny":0,"cool":0},
{"review_id":"nqwGiyPofIbqAX4BST1Dmg","user_id":"8ZJW1JgnY5B55ZfMDNA0gg","business_id":"K8KX4XqFhXwz-GAewBzDGg","stars":5,"date":"2017-03-18","text":"This place is excellent, from the service to the wine (especially the wine), to the food, to the stunning minimal interior design that seems to take you far away from downtown Calgary, not to mention they even have some interesting spirits.\n\nThe food here is really good, we had some Comté cheese with sourdough bread and the Beef Tartar all of which were beautifully presented and prepared. Lots of flavor and attention to detail.\n\nWe intended to come in for a bottle but they were pouring some excellent wines by the glass that we couldn't pass up all of which were at excellent prices. From some killer Riesling, to a fun and oxidative Chardonnay from Jura, to an delicious Red Burgundy, the wine selection here will not disappoint. \n\nDid I mention the excellent interior that made you feel immediately welcome and as if you had been transported to Copenhagen?\n\nThank you Thomas and Will for the excellent service, the good juice, and the excellent experience overall, we can't wait to come back.","useful":0,"funny":0,"cool":0},
{"review_id":"AWgsNPQLpMbFp6Bz2byHlg","user_id":"5CSTRNF7Wl-yGtrE8CQ2LQ","business_id":"TTDMJetAQKfxVzKZy4Z_2Q","stars":1,"date":"2016-06-26","text":"Literally the worst airline in the entire universe. Their policies and procedures are not aimed for customer satisfaction. They choose to nickel and dime you for everything and could care less if their customers are happy. Every flight I have ever been on has been severely delayed. Also, how classy of an airline, a wheel fell off of a plane and their flight attendants talk about it like it is some hilarious situation instead of a huge safety concern for their passengers and workers. I spoke with Ticket Agents, Gate Attendants, Managers, and Customer Service on the phone about unfair charges I was given, and each person said that Allegiant is a horrible company to work for and that they never address customer concerns. Sounds like a well run, customer service based company, NOT! If you have any other choice for an airline to fly, even if it is hundreds of dollars more expensive, I HIGHLY recommend doing so. My $150 round trip flight turned into $410 dollars with all of their outrageous fees and HORRIFIC customer service. Run as far and as fast away from this airline as possible!!!!! I wish I could give them 0 stars.","useful":2,"funny":0,"cool":0},
{"review_id":"pphHueI5u5qIKiIZCPKd9g","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"syRPwPqdV6h3eenuV1d6rg","stars":3,"date":"2015-09-24","text":"??\n\nSul Lung Tang, Stewed beef broth, and beef serving with rice\nGamjatang, Stewed pork bone and potato soup","useful":0,"funny":0,"cool":0},
{"review_id":"L2Q6lgacxhw--lexbNHPMA","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"r_BrIgzYcwo1NAuG9dLbpg","stars":4,"date":"2015-09-23","text":"Gaeng Kiaw Wan (in a coconut), Green Curry with bamboo shoots, kaffir lime leaves, basil leaves, green peppers and coconut milk. Served in a coconut!","useful":0,"funny":0,"cool":0},
{"review_id":"9RMlQUCWZ6TPFc4BNnlO4w","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"HakulcKdPE-RaWCVF1GUKQ","stars":3,"date":"2015-09-25","text":"???\n\n???\n???\n????","useful":0,"funny":0,"cool":0},
{"review_id":"085Of3_rdY_-0N41t28CwA","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"pIB-Js9drl27qrrSjKK_eA","stars":3,"date":"2015-09-09","text":"??\n\nwok lamb che mian, ??????","useful":0,"funny":0,"cool":0},
{"review_id":"6Kt1n3N3N8U9lEJQcTNyMQ","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"Q_Iia5C2quTUVfE5_8jObw","stars":3,"date":"2015-09-23","text":"?????\n\nBeef chow fun, ????","useful":0,"funny":0,"cool":0},
{"review_id":"mC95P8xcj6GEtnL_f_VD6Q","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"4m_hApwQ054v3ue_OxFmGw","stars":3,"date":"2015-09-21","text":"Jamon Iberico De Bellota, 36 Month Acorn-Fed Black-Hoof Jamon Iberico\nPan Con Tomate, Spanish Anchovies\nAceitunas, House Marinated Olives\nEmpanadas De Carne Mixta, Slow Cooked Meat + Guindilla Sauce + Mojo Picon\nBistec A La Parilla, Prime Beef Striploin + Padron Peppers + Crispy Potato\nBocadillo De Higado Graso De Pato, Foie Gras Bocadillo + Pedro Ximenez Redution + Quince\nBombas Con Salsa Brava, Chorizo + Aioli + Spicy Piquillo sauce","useful":0,"funny":0,"cool":0},
{"review_id":"ylpi2rdmbDpPmAsEs2hISw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"-KqJjXDhqq6Ah5cMiF-sug","stars":4,"date":"2015-09-09","text":"???\n\nblack tea creama with mini pearls, ????","useful":0,"funny":0,"cool":0},
{"review_id":"j7-eEHNoANuOXrQteUTqrw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"RI09fylw-_70RN6190LikA","stars":3,"date":"2015-09-28","text":"ST LOUIS CHICKEN & WAFFLES, Two Belgian waffles layered with hand breaded chicken tenders, topped with Garlic Dill sauce and sweet Sriracha. Served with sweet potato fries and a side of Ancho Chipotle mayo.","useful":0,"funny":0,"cool":0},
{"review_id":"S_U4MiWiZf3McSzJilhzDw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"Nxg73OigmRQQq0d1pKtkUQ","stars":4,"date":"2015-09-21","text":"???\n\nbeef tenderloin pho, ???\nspring rolls, ??","useful":0,"funny":0,"cool":0},
{"review_id":"ux-Y4B4CgTN3u-JcRaJ9rg","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"GhCbfTGJtB8Y1ZVjTzx53A","stars":3,"date":"2015-09-25","text":"????\n\nJapenese Matcha Tea Latte, ????","useful":0,"funny":0,"cool":0},
{"review_id":"MChFOoUhbG4QjJqRPQWZnQ","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"SW6ZQk22G1_CV81_gfnvNQ","stars":3,"date":"2013-10-06","text":"rice & corn frituras\nchorizo taco\npaletas - cookies and cream, chocolate peanut butter","useful":0,"funny":0,"cool":0},
{"review_id":"Z1BPdu28m5dkiV7V8OyoBA","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"cw9Vp_nxdgH5KzYuu1AC2Q","stars":4,"date":"2015-09-25","text":"????\n\n???\n??\n???","useful":0,"funny":0,"cool":0},
{"review_id":"1XxuKnkEjql3y2EOZ6tyng","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"HUYEadSbGSQNHXFmT2Ujjw","stars":4,"date":"2013-10-09","text":"kitsune udon\ntakosen\nsalad","useful":0,"funny":0,"cool":0},
{"review_id":"j9IkegLMr2kid_GgRqIcOg","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"i--dxuKd_6Dx7mwgQ5nl-g","stars":4,"date":"2015-09-09","text":"teachers pet, a basket of cornbread, banana-chocolate chip muffin, biscuit\nblack 'n' blue flapjacks stacked high, w\/ black + blueberry sauce + brown sugar butter\nsuper cheesy bacon french toast, w\/ loads of gooey cheddar-jack served w\/ syrup + greens \nbuttermilk fried chicken + waffles, served w\/ tobasco-pepper honey + crunchy cabbage slaw\nlavender lemonade","useful":0,"funny":0,"cool":0},
{"review_id":"zPrgTWxR3lDBvGEtM3Bz0A","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"8iKrvvY-GqNrh2UOjor-Iw","stars":3,"date":"2015-09-23","text":"????\n\nsushi all-you-can-eat, fountain soda included","useful":0,"funny":0,"cool":0},
{"review_id":"-QYC4YH_BYEULi8JrLStDA","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"P6yxSaaMDuY9zgDHzU1n6A","stars":3,"date":"2015-09-28","text":"Strawberry Coconut, absolut vanilia, malibu coconut rum, strawberry liqueur, fresh strawberry puree + house-made sour mix","useful":0,"funny":0,"cool":0},
{"review_id":"gxTIoJRWBaPMXZH1cRDdDw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"zrYpLdnGKA_EmOhgRCy_vg","stars":2,"date":"2013-10-06","text":"maast-e saadeh\nvegetarian fesenjaan","useful":0,"funny":0,"cool":0},
{"review_id":"o1bLOfESeo6ecZ52wIy3BQ","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"Lv9wzkvPrVG-VdPGcw53_A","stars":4,"date":"2015-09-23","text":"????\n\nLobster combo","useful":0,"funny":0,"cool":0},
{"review_id":"3rjHDN1pNC67m6em20iMmg","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"mAhu38hHUQyOatamyQsOww","stars":4,"date":"2015-09-09","text":"sangue rosso\npizze san pietro (prosciutto + pear + arugula + gorgonzola + honey + fior di latte)","useful":0,"funny":0,"cool":0},
{"review_id":"FBuXk85GpXen1ZvL-SXc6A","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"7fbR8yaEV_aAdOaaE4-0FA","stars":4,"date":"2015-09-23","text":"???\n\nHouse Famous Specialty Curry Crab, ??????\nGrilled Jumbo Prawns with Garlic, ??????\nPad Thai Noodles, ????\nChicken Satay, ??????\nAVOCADO & SOUR SOUP, ????????","useful":0,"funny":0,"cool":0},
{"review_id":"BPgTLvtdcqujGAOKOZWyHw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"gTUaz3Wlh8eyQ3s7T-6txw","stars":3,"date":"2015-09-28","text":"????\n\n???\n???\n????","useful":0,"funny":0,"cool":0},
{"review_id":"bjbH8JFNyHx2iUnFtQRl6w","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"bK7dxnD1FYuV4mVVVCMeNA","stars":3,"date":"2015-09-21","text":"????\n\nChongqing-style noddles with shrimp, ????","useful":0,"funny":0,"cool":0},
{"review_id":"awhG6gah6TOnmwDAaK3Kkw","user_id":"w0PGaBMEUjYPSqUYGeU1sw","business_id":"JMiaNitMzMbJm6Kh0RbT5A","stars":3,"date":"2015-09-23","text":"Chilled Sweet Corn Chowder, baby shellfish, sorrel & wasabi oil\nAlberta Beef Strip Loin, rapini, birch onion jam & Kennebec potato\nValrhona Chocolate Ganache Cake, sea buckthorn & whipped mascarpone\ncucumber + gin fizz, Tanqueray No. Ten gin, St-Germain, muddled cucumber,\nfresh grapefruit juice + soda","useful":0,"funny":0,"cool":0},
{"review_id":"GDlpLcXJ_CINSrRELXC-EA","user_id":"CAuEFDhJj_CYWoEr407WwA","business_id":"LdOwDyRqFgBwRmUPp0k1BA","stars":4,"date":"2013-11-24","text":"Walgreens is one of my favorite stores this one has a wide selection of many things from candy to phone accessories.","useful":0,"funny":0,"cool":0},
{"review_id":"4VTl4hMQenJ9-E540QWsvA","user_id":"CAuEFDhJj_CYWoEr407WwA","business_id":"gLIXCIjfarKXSeE4dGyLKw","stars":4,"date":"2013-11-24","text":"I always come here for cases for my iPhone. The store has a big selection to choose from like iPhone cases and accessories, candy, books, toys, and more.","useful":1,"funny":0,"cool":0},
{"review_id":"gSawgfcCCiuZCs6eckJ_Xg","user_id":"CAuEFDhJj_CYWoEr407WwA","business_id":"wjvyVdtP-VpHrzZ3qEHg6g","stars":4,"date":"2013-11-24","text":"I love the convenience of this place the subs are good and fresh and healthy and fresh.","useful":1,"funny":0,"cool":0},
{"review_id":"uIQeZQqiamfyQ5SoRwlYug","user_id":"LhsWsWoSLkrTKSwgLI6DDg","business_id":"7SemopLjhDc3IQkI-JUYdQ","stars":5,"date":"2016-06-09","text":"Stopped by to try the lunch special and the food was delicious! The soup is amazing! Service was great and the owner is super sweet. I love that it is local so we can go back for more.","useful":0,"funny":0,"cool":0},
{"review_id":"Sb54c_NItP6xvxJw3fMW4A","user_id":"Tx4n8frdstp8jgXNugtaFg","business_id":"QVTDzJ3OFlXxKFo_EgNYNQ","stars":1,"date":"2016-05-28","text":"Let me start by saying that David Gates, the sales representative, was GREAT and quite personable.  However, their financing tactics, lying, and unprofessional sales manager LEE JONES, has left me frustrated and unsatisfied.  I called numerous times to notify the managers of the under handed tactics the finance rep. used, but only received the run around and no possible solutions were offered..  Lee Jones, the new car manager, took my information, stated he would ca l me back the next day, and I did not hear from him until I called him back a week later. On that call he did not apologize not getting back to me, no did he offer a remedy.  To make things worse, he told me to call the GM and the hung up in my face. \n  His actions are not professional nor are they acceptable.  A few weeks later I  had to reach out again in regards to financing.  Mr. Jones took the call and said he would call me back the following morning.  The following evening I received a text from a random number discussing some finance info.  I asked who was texting and what was it in regards to. The response was, your Infinti payment.  How unprofessional! To text and not call, but not even to identify who was texting, Lee Jones, is just unacceptable.  DO NOT buy a car from Infiniti of Scottsdale.  Coulter Infiniti on Mesa is much better, and I should've worked with Rich over there.","useful":0,"funny":0,"cool":0},
{"review_id":"50M1r3dY8xhwq8S0ZedPBQ","user_id":"ITZFwrnf7u4FE99QlFacfg","business_id":"LFhvb4H5muJkyUhlTyormg","stars":5,"date":"2017-06-17","text":"Wonderful and tasty Korean restaurant. We tried three different dishes that were very good. Highlight was the homemade ice cream! Service is also friendly and efficient. We'll go back in a heartbeat.","useful":1,"funny":0,"cool":0},
{"review_id":"cIZBsxs0n2yra2v9EPLn3A","user_id":"sxytxu-x1O4cmoOfBZNNjQ","business_id":"bXbCGFk3ZjLcTdQQB-xPyQ","stars":5,"date":"2014-08-02","text":"had the pleasure of going to this fine restaurant for the second time, both trips we had great food and  like the half price bottles of wine on wednesdays, had  the chance to taste a more expensive bottle for a good price, my next visit to charlotte i  will be back","useful":0,"funny":0,"cool":0},
{"review_id":"06iSbqT19iiqpq5hy7l2Sg","user_id":"xve3z_1gywxc4-7VzEoIEQ","business_id":"Enk9JYWnEdg_Pht2-HcyNA","stars":5,"date":"2016-12-29","text":"The vegetarian platter was delicious! Generous size and a wide variety of fresh vegetarian items","useful":0,"funny":1,"cool":0},
{"review_id":"rQgy4Nfx3nshU9Ig2pkJ1w","user_id":"GgII8qZ125wPPvv07N8-gQ","business_id":"qUfaMjN_45EuIlMrPhB_bw","stars":1,"date":"2010-11-29","text":"HORRIBLE customer service. \n\nTHEY are supposed to be the graphic designers, and yet they can't tell me SQUAT about how to change the dpi, or image size to fit their specifications. I'm in the automotive business, and I know nothing about dpi or resolution or any of that crap.\n\nYou'd think that if you got the basic image over to them, they'd be able to take care of any minor adjustments. Nope. They're useless!\n\nNEVER USING THEM AGAIN.","useful":12,"funny":3,"cool":1},
{"review_id":"ZKeMdwG63YKtiZ88JhhIuA","user_id":"26hyJn_cHzM4aLXE81AmLg","business_id":"DXlDzOcpdUE_F21tok0fgw","stars":4,"date":"2010-06-07","text":"I did like this show.  It's not my first Cirque show so it was a bit of a transition.  There's a story line they follow.  It seemed a bit slow & dance-y to me at first.  I LIKED that, but I wasn't sure my husband would.  (He said he did.)  It really got moving & got in the true \"Cirque\" stuff (see: moving stage) and it would've been 5 stars in my book if that had been the whole show.\n\nI did really enjoy it.","useful":2,"funny":1,"cool":1},
{"review_id":"9Zb7MZVYRgG3zky88NZcKw","user_id":"26hyJn_cHzM4aLXE81AmLg","business_id":"J3FUxMAHfCl-WFo86u5DqA","stars":4,"date":"2010-06-07","text":"having seen the original group some (15\/20) years ago, I knew this was going to be different, but wow!  \n\nThey were true to the original intent of the show, which is a lot of why this was good.  But it was Vegas Baby! for sure.  \n\nWe had great seats (poncho zone means you wear a poncho & may get dirty!) close, but not too  close.  \n\nThis is a great show if you have a varied group.  Everyone should enjoy some aspect of it.  It is loud.  The band was good, but like I said, LOUD.  There were parts where I wasn't sure they added much, but the parts they were integral in were very good.  It was pricey, but not any more than other Vegas shows.","useful":0,"funny":0,"cool":0},
{"review_id":"Ndx9hRydJjF-kfC5nfX-Rw","user_id":"26hyJn_cHzM4aLXE81AmLg","business_id":"eWKZyDPXdkhrT8v8XD2OrQ","stars":4,"date":"2010-06-07","text":"I spent the better part of weekend (and a lot of my bank account) on this spa, so you'd think it would be 5 stars, but here's why not:\n\n1. price, not super expensive, but hey, it's NOT cheap\n\n2. got a couples massage first day w\/husband.  His was meh, & so was mine.  Maybe the therapists, not sure.  Wasn't awful or anything, but I've had better & for the price...\n\nHowever, I spent the next day & got a cocoon (OHMYGAWD, you should totally get one!) & then a facial.  Was so relaxed I signed up for a full body massage.  Had lunch while waiting in the cafe.\nThe facial was AMAZING.  I'm not sure how or what she did, but WOW! \nBecause of the facial I signed up for another massage which was too rough (& I usually like them that way) the next day.  So 4 stars instead of 5.  Also LOVED the water area, the different saunas, hot tub, relaxing area & the salt grotto was my favorite. \nFound the wave room to be odd (bird chirping, not wave sounds...wha?)","useful":0,"funny":0,"cool":0},
{"review_id":"9UB0cKDAR2XORvxZa7R-zw","user_id":"26hyJn_cHzM4aLXE81AmLg","business_id":"Wxxvi3LZbHNIDwJ-ZimtnA","stars":4,"date":"2010-06-07","text":"Room was super nice.  As indicated sunken living room w\/bedroom.  Nice bathroom w\/shower & bath.  TV in lving room, \"bed room\" & bathroom.  I thought the bed & living were a bit much, one would have to muted for sure.  And I get that the bathroom is for the sports fans, but it's still sort of funny to me.  I used to go to Vegas like every other month for tradeshow work, so I know my hotels.  This was nice.  We also had a fax\/scanner\/printer which, from a business standpoint was super nice.  We paid the VIP fee & had unlimited WiFi, local calls, use of fitness spa.  \n\nPrimarily used pool.  Really liked the wading pool aspect for lounge chairs.  And it was memorial day weekend (super crowded) so it was nice that we could use the Plazzo's pool as well.","useful":0,"funny":0,"cool":0},
{"review_id":"IEKkH1dnW0qwefIvrDW8Iw","user_id":"HSYLX8vtmvAYRrIp5lewSA","business_id":"GXb5fi7sJGzgYVbL1G8rqA","stars":1,"date":"2010-04-16","text":"NEVER use this company.  Dave the owner is a COMPLETE flake.  My story starts with attempting to order boxes advertised on their site and he refers me to another company.  I sent an email asking to set up a move date, no answer.  I call to set up a move date and he says he has that date available but to send him an email reminder to confirm.  I sent another email, no answer.  I call and he says \"Oh yeah, were you the guy who emailed me?\"  So I send another email and finally get a confirmation for 4 guys and a truck between 8-9 AM on the moving day.  I call Dave on the moving day at 9:15 when he isn't there.  His response when I ask him where he is, \"Ohhh, were you today, I think I got my schedule mixed up...  I am way out in West Phoenix, but I am on my way out right away\" but he only hasone other guy with him.  When I suggest the idea of a discount because of this he hems and haws and says we'll see.  Later he gives me some story about he got an email saying an auction date was moved back so he cancelled my appointment and I tell him I have no idea who that email was from but it sure as hell wasn't me.  An hour later I get a call from another moving company who wants to charge me more money and not move until that night.  When I ask what happened to Dave \"coming out right away\" they basically say I don't know and said they don't think Dave is coming and I am stuck with them.  They go one to not make it out to my place the next day and overcharge me, I have another bad review to write and go post for them.  Don't believe whatever BS excuse Dave posts to excuse his flaky behavior.  Just talking to the guy you get a sense he has a horrible memory and isn't very professional.  Throughout this whole ordeal, even after he bailed on me and stuck me with the other company, he even said \"I'm sorry\", let alone offered any financial compensation.  Thanks Dave.","useful":0,"funny":0,"cool":0},
{"review_id":"DRBmMV2Ez8rhqfniwRGnig","user_id":"wr7ejQF4dgL3QH6V2jReDA","business_id":"bIl02CY-4wSCCGxxeMOsig","stars":5,"date":"2017-04-08","text":"Great customer service and the burgers are AMAZING.  Everything is made fresh to order. Definitely my new favorite burger place.","useful":0,"funny":0,"cool":0},
{"review_id":"JjMuJ4xivcV8w8tD25euKg","user_id":"I4ne3YlGtCB3yd97drzcWQ","business_id":"QNtLcQzUYoIJH3S4Hv8F9g","stars":5,"date":"2010-03-13","text":"I love Urban Kidz...  You will find very unique clothes\/accessories\/gifts here!  I have a baby boy and I hardly ever find stores that have really cute boy things... well, Urban Kidz has them and more!  My daughter loves going to this store, she wants to try everything on!  The owner, Lila is the nicest woman ever and will help you will pick out the perfect outfit!  If you're little girl likes tutus... then you have to stop by Urban Kidz... they have the cutest tutus ever!  Oh, and the blingy tanks with your birthday number is the perfect top to wear with your tutu!  I can't say enough great things about Urban Kidz... I'm so thankful that I found this store!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"0ThcjTrzPbquEBNYktxInA","user_id":"MKpIbUNcvbZvuyEJSYTWrw","business_id":"1uPQTz5XZSWr0ti7kUpaDw","stars":4,"date":"2017-01-21","text":"Love it there. The pork shrimp coriander dumplings are exceptional. The wasabi salad is perfection . The service is ok, but the food is a winner. Simple and delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"uUR-IuvrlTjf8sfzakexjw","user_id":"MKpIbUNcvbZvuyEJSYTWrw","business_id":"zWVSNGmW2O1iN7PEViyK5A","stars":5,"date":"2017-01-21","text":"I've been there a few times and it never disappoints. The service is great, the waiters know the menu and what to recommend in line with your likes. The food is always tasty and great for sharing and discovering. The quality\/price is fair. I would definitely recommend this place for a nice date or catching up with friends and family.","useful":1,"funny":1,"cool":0},
{"review_id":"F26fZc5E8QhPgJNrjZuaSQ","user_id":"MKpIbUNcvbZvuyEJSYTWrw","business_id":"9KeJfn7-6DFfUFoZLu_DNQ","stars":2,"date":"2017-01-21","text":"I forgot to post my review from this summer. I had been there many time so I was happy to recommend it for my friend's b-day. I must admit the food was very good. But that night,  Worst service I have ever had. We were 7 people and somehow they forgot to put in our order for 1h30, We didn't manage to even get guacamole and tortillas on the table until 10pm (we arrived at 8h30pm) and that was after inquiring about our order 4 times to different bus boys and waiters. We had to constantly request more than twice everything, be it a drink, water or additional tortillas or until I finally got up to get it myself. It was aggravating. The only comp we got was shots that we didn't order... and I mean shots on an empty stomach is not really smart. I like this place, but i wouldn't recommend going as a group. I don't think they can handle it.","useful":0,"funny":0,"cool":0},
{"review_id":"_uJx9uGrYh_kRrBQ6h1CgA","user_id":"MKpIbUNcvbZvuyEJSYTWrw","business_id":"gwlgv3yZ_B0Mk9aLcwTpSw","stars":2,"date":"2014-02-23","text":"I went there for the first and last time last night. The food was ok.The service was very bad. We were a group for a b-day dinner. We brought a cake with us and They cut the cake before singing happy birthday, if that's not bad enough, they tried to charge us 2$ for each piece of cake for cutting it!?!\n\nThey tried to convince the birthday girl that her meal was the entree size rather then appetizer even after she told them about her doubts. It took the manager to convene to get her the right dish. When asked for an empty wine glass they brought a filled one and charged for it.\n\nThere was also very few choices for the vegetarian guests.\n\nThe manager was nice enough to try to fix everything by giving shots to everyone but it was far from smooth sailing all night! Good thing they have wine for Saq prices.","useful":2,"funny":0,"cool":0},
{"review_id":"8rwa4Kv09u4n2NmclwRGEA","user_id":"MKpIbUNcvbZvuyEJSYTWrw","business_id":"OuBlNEyfJpxfq9SQgELiAA","stars":1,"date":"2017-01-21","text":"Pretty place and nice ambiance however the service is a complete joke. I went there for drinks and what was supposed to be dinner at around 7h45. Got the drinks fine. Ordered some food, somehow after 30 minutes or so the waitress comes back and tells us that they had forgotten to put our order in but that she'll punch it in right away. Then she comes back and tell us that the first little dish that they brought us (6 polenta fries) were offered, since they forgot us, which was nice. By 10h20 pm still no sign of any other food... finally another waitress comes to ask us if we need anything, to which we inquire about our meal.... so the initial waitress came back to explain that there was no other meal. Somehow the initial waitress decided that we no longer wanted the main dish, without a cancellation of dish ever uttered by us. Granted they offered us everything for free, nice i guess... but we didn't receive much of what was ordered to begin with. Had to go find something else to eat for dinner at 10h30pm. Lets just say, it wasn't a very successful evening and I could not recommend this place even if I wanted to.","useful":0,"funny":0,"cool":0},
{"review_id":"2o4GyK7Q9I0YesRBN9IWDw","user_id":"g2Ne3Oxm49P28AZ0pIMu3A","business_id":"RyMc1sBJ_CrI6x8Q8ZbT8g","stars":1,"date":"2016-06-14","text":"I came in for a rotation and balance and was told 1 hour 10 min....2 hours later my car hasn't been touched and I was told at least another 45 minutes. There is only one car in the bay and at least 6 employees in the garage doing absolutely nothing. I will not be coming back in the future","useful":0,"funny":0,"cool":0},
{"review_id":"NdndVX7W8Su8xayf80UMcA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"coBLz73uWQp1gbMQGkvM3g","stars":4,"date":"2014-11-07","text":"Atmosphere is Top Notch Beautiful! Sushi Rolls and Food is one of the best and freshest in town! The only down side was a select few waiters\/ waitresses did not have the time of day for us after our orders were taken.. Plus its awkward when another waiter has to check up on your table.. If your not at the Bar or Hibachi I would go somewhere. Great Food Overall.","useful":0,"funny":0,"cool":0},
{"review_id":"Ns2AhQojy6-ryrbF5JkfZA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"rI1wtjri4NhO3V-hCsMCiA","stars":1,"date":"2014-11-07","text":"No just no. The food was way below PAR I ordered the chicken enchiladas thinking it should be a delightful one..It was a big fat NO! Chicken was not cooked and the sauce was so bland I wanted to slap myself for coming to this place. A big let down to cheap and easy mexican food..","useful":0,"funny":1,"cool":0},
{"review_id":"2K2gnXkYptV3MWiJwdR9gw","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"HQcel0uvg7N7KfhHJChfSQ","stars":5,"date":"2014-11-07","text":"One of the best sushi places in town love the chefs, servers, and the atmosphere is nice! Quick on serving your food! I recommend to get AYCE you can't go wrong with it! Ultimate Albacore, California Dream, and Crusty Philly Roll are a must! Oh and don't forget the awesome Pot Stickers!!!","useful":0,"funny":0,"cool":0},
{"review_id":"VYbkKT-BJE0P19VFPbMgqQ","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"dEAk-gE-5Q95a7p91gNn8A","stars":5,"date":"2015-02-01","text":"This is a Top 3 Contender in my book for one of the best sushi places in town! Highly recommend this place great AYCE menu. Spicy Tuna, Tiger, Nigiri Rolls, Cajun Albacore, Deep Fried Cali, and some Gyoza are the best!","useful":0,"funny":0,"cool":0},
{"review_id":"0ndwobuPt96wrqnTMstj4A","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"zuwba6QEBIDZT0tJZmNhdQ","stars":2,"date":"2014-11-07","text":"Seems like this place is deteriorating by the day..Been going here for almost 8 yrs. and it does not flare like it did back then. It was always great for 50% on Friday and Saturday. \n\nBut just recently changing it to 30% off on the same days does not attract to me seems like a bad business advertisement. Plus the workers seems like they do not care anymore neither does the boss it seems. .\n\nIf you want cheap go here, but I wouldn't recommend it to my friends or colleagues.","useful":0,"funny":0,"cool":0},
{"review_id":"RtMGhrhjAcZm_qiONXPRzw","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"tXqaK0lBEE1XJbzDPsdFvg","stars":5,"date":"2014-11-07","text":"I simply love the fact that they have Tapatio for your fry's it brings me back to Huntington Beach, CA.. It is definitly a contender in my books for one of the best burgers in Vegas!","useful":0,"funny":0,"cool":0},
{"review_id":"yRuaGUUTctekoLH6dOVgBA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"SzB85-8tmDEvoapZSDTBkQ","stars":5,"date":"2014-11-07","text":"Everyone knows this is the Best place for something cheap and Amazing! If its just for a nice Breakfast, Lunch, Dinner, or Hangover Meal its perfect! I love this place not only there food, but easy service, and quick serving!! My suggestion is to go inside rather the drive thru it will be quicker trust me!","useful":0,"funny":0,"cool":0},
{"review_id":"wNqAT4ZMaKqxYGH4B0oOFA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"Gaq3S9lmjXVcuDCZ8ulppw","stars":4,"date":"2014-11-07","text":"Starting to become fond of this place. Always treated with great service, and great food! Spicy Tuna Roll is one you cant miss out on! And there pot stickers have a unique taste, and this really mind blowing with the sauce!","useful":0,"funny":0,"cool":0},
{"review_id":"t7R82fbEDs3Pce-ndRbxHA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"VfFHPsPtTW4Mgx0eHDyJiQ","stars":4,"date":"2014-11-07","text":"Can't beat some beers, pool, sliders, and some good ole Rock n Roll!! All the waitresses are beautiful makes the place a lot better!","useful":0,"funny":0,"cool":0},
{"review_id":"-MG-NQCJPsISXFBlhLkVfA","user_id":"ur-c8lxxpLvcnJNE22xjkw","business_id":"PQER4ba8Q0zqB1G2QiXamQ","stars":5,"date":"2014-11-07","text":"Just started coming hear this year, and wow that Breakfast is amazing especially there potatoes. One of the best Breakfast places in town I must say!","useful":0,"funny":0,"cool":0},
{"review_id":"6oMTK5lyUHp4a_WcFwZXjQ","user_id":"eAiqFkF8W7wRVwSZUJzWww","business_id":"e2SP1ZLQI45948rv_sNIUg","stars":1,"date":"2015-08-30","text":"Becarful of the email rewards they send you  discounts with no expiration date but they do have a time frame that you find out at the cash register.when it's to late. Confronted the manager and after waiting 10 minutes he pulled up the email rewards for justification of the discount denial.He had no empathy for our concerns!  Lost a long time customer of a few dollars.","useful":0,"funny":1,"cool":1},
{"review_id":"bBU9FhRrrwX99eG0KfhfNA","user_id":"eAiqFkF8W7wRVwSZUJzWww","business_id":"S2tt5zkDvfiMob7lSj9KUQ","stars":5,"date":"2015-09-01","text":"They have a very friendly and knowledgeable  staff! From top to bottom. Honestly is there number  1 customer priority. Highly recommend this  organization!","useful":0,"funny":0,"cool":0},
{"review_id":"ugHwIwaZWvc_LiRKGvIDTg","user_id":"eAiqFkF8W7wRVwSZUJzWww","business_id":"PEnlf5CJ8JJonph2jIljCg","stars":5,"date":"2015-08-30","text":"Always great food.great service top notch place everytime every plate!!! The bakery is the bomb  fresh super tasty and priced right","useful":0,"funny":0,"cool":0},
{"review_id":"hpyFyddIkPhdnAvGKhbJbQ","user_id":"boD3m56Rg0RoU0eRYaD2Og","business_id":"djwMJmuyODu9Z1MXGi4KLA","stars":5,"date":"2016-06-02","text":"What a great company to handle all your HVAC needs.\n\nBackstory: Our A\/C stopped blowing cold air on Tuesday night. We called in to a popular HVAC company to get a recharge of freon. The inspection pointed to a leak in the evap coil. Called home warranty company, was given several horrid companies to do the work. Did a Google search and STB came up as the top rated result in the Gilbert area. Thankfully, we were able to choose our own contractor for the job!\n\nCalled and spoke with Ashley, who is AMAZING at ensuring you are treated like royalty, is very knowledgable, and answers all my crazy OCD questions (and should receive a raise! ;)) She told me someone will return my call with an estimate. Ryan, who is equally amazing, called back almost immediately and sent me an estimate within twelve hours. He then came out after business hours to do a second diagnosis inspection. (Ryan also deserves a raise! ;)) It turns out it, in fact, IS the evap coil leaking.\n\nThe next morning, I get a call at 7:30am saying that the installers will be there at 8:00am. Danny shows up and expediently gets to work, removing the offending coil. Dean shows up a little while later with the new coil to replace it. (Again, Danny and Dean deserve a raise for working in the hot attic for a couple hours!) The install went well and both were very efficient in doing their work. They were also very friendly, which is refreshing to see with installers!\n\nAdditionally, Ashley helped setup the communications between STB and my home warranty company, which was really appreciated, as I was getting a bit annoyed by said warranty company at that point...\n\nOverall, I will say that because of the above and beyond service I received from Ashley, Ryan, Danny, and Dean, I will not hesitate to call them for any future HVAC needs. I recommend them whole-heartedly!","useful":1,"funny":0,"cool":1},
{"review_id":"T8QU2YvIhSVNhVJD2MKb3A","user_id":"0hiBe_Agxs7baGd7alCBbw","business_id":"N6hX6Hwc3RipPoOYMh97Mw","stars":1,"date":"2017-04-25","text":"Absolutely terrible health care provider. I went in for the first time to this office and my experience as a patient was worse than I could have imagined. First off, the doctor reminds me of that doctor from the Simpsons that will perform heart surgery on you for 5$. He is so creepy and when I came in, I could visibly see him in the back fixing his hair in the mirror, and walking around doing literally nothing while I waited for 30 min. When he walked into the exam room, he didn't shake hands or give any personal touch that a \"doctor\" might be able to comprehend is necessary and advantageous to his private practice. Further, the equipment is literally from the 1800's, I stepped on a scale that said I was 190, I'm 220 pounds... they literally WROTE DOWN my medical history whereas most reputable Healthcare providers use-I don't know- a computer? Worse yet, they put that piece of paper into a file that looked like one Benjamin Franklin would have used when he was researching electricity. At the end, he needed to get my medical records from my old Healthcare provider and he literally gave me a form and said, \"Go fax this to health span and bring your records to us.\" I was like.... wtf am I paying you for? That's literally the worst doctors office in Ohio.","useful":6,"funny":0,"cool":0},
{"review_id":"OKIYNuJSheT2tLVDAS8ZqA","user_id":"hoKQ5xT5Xc_X0-dZaKQxug","business_id":"Q4orLuzDAB9TnucYXksgLQ","stars":3,"date":"2016-11-06","text":"Good place for a burger with the family, though expensive, and can be slow. Beet salad is good as are the burgers and fries with Parmesan.","useful":0,"funny":0,"cool":0},
{"review_id":"Ij_vQpVxWF6Ub-CkcBNz2A","user_id":"hoKQ5xT5Xc_X0-dZaKQxug","business_id":"gd-fV04gMKMz724XM32xQA","stars":3,"date":"2017-01-04","text":"This was my second visit to Bandit. The first was during opening weekend where there were some kinks to be worked out. Or so I thought. \n\nAs a non-drinker, I found my latest attempt with Bandit to be disappointing. I asked for a Diet Coke and they don't sell it. Then A virgin caesar. Nope. Ok. Just a coke (even though I don't like sugar drinks) \n\nService was sketchy with drinks and food coming out at random so our group didn't actually eat together. Apparently the kitchen was \"backed-up\". Hate to see what it's like on a Saturday night when full. I don't blame servers for that, though our server was mildly absent minded. We were a large confused group, so again not necessarily all their fault. \n\nI love the atmosphere and ambience. A little loud, which creates a fun vibe. \n\nThe food, for me is the reason I keep giving this place a try. The steak is really good, and I love the fried chicken. The other people in our group seemed to really enjoy the food and craft beer they make. \n\nThe sticky toffee dessert is good, but not exceptional. Asked for a coffee to go with my dessert but apparently coffee is not on the menu either. Sigh. \n\nThe food is really good, but I would love to see them add some better wines, cocktails, and mocktails so that food and drink pairings work well. Not everyone loves beer, sorry to say. \n\n\nI will be back with beer drinking friends, but many more of my friends drink wine or not at all, so that leaves Bandit off my list for much of my entertainment dollar","useful":1,"funny":0,"cool":0},
{"review_id":"KMV3FG5OjGPiF7B8DQvxOQ","user_id":"hoKQ5xT5Xc_X0-dZaKQxug","business_id":"gB4JpmmLKClE1ZFAwFWBJQ","stars":4,"date":"2016-11-06","text":"This is our regular weekend breakfast joint. A good breakfast place for eggs, pancakes, French toast etc. Wait staff needs a few reminders and this is not the place to go for a high-end brunch or customization. Just a casual \"joint\" to grab a bite, have a coffee (free refills) and read the weekend paper.","useful":0,"funny":0,"cool":0},
{"review_id":"8RZT47jXmnYv93xpEijSyQ","user_id":"hoKQ5xT5Xc_X0-dZaKQxug","business_id":"9xdVIIzHp12Zrox5aFaaHA","stars":2,"date":"2016-11-06","text":"I keep giving this place a chance, and will continue to do so. \n\nFirst- the pizza. It is great which is why I keep going back. It would get 4 stars but for what follows. \n\nThe service is the problem for me- I have been there frequently for 45 minutes watching tables (like 3)that arrive after us get served and leave before our pizza arrives. It seems like they staff one hard working, competent server AND one poor server per shift. Or the kitchen is just disorganized?\n\nAt other times I'm the guy getting my food and leaving in a reasonable time. \n\nIf it were consistently slow, I would only go when in the mood for a leisurely date night and be perfectly happy.  But with my luck, that would be the night everything arrives in 15 minutes and there is a huge line out the door with pressure from the server to pay my bill.","useful":1,"funny":0,"cool":0},
{"review_id":"DUVI4Z7ciXQ2Omi6uYx49w","user_id":"xwL3MjdFc7iCq0sAQIWFRg","business_id":"UE3AvVnaPEBPneVahYT2eA","stars":2,"date":"2012-04-22","text":"A much anticipation of a return trip to WCG,and I must say I was terribly disappointed. For starters, we HAD a reservation and it still took us 40 minutes (and several inquiries) to get our table..... Once seated, a good 10 minutes passed before our server came to our table. Had to ask for water refills. The food, while good was a bit pricey (accept for the dessert, I will say it was yummy)\nSadly, I will not be returning here anytime soon.","useful":1,"funny":0,"cool":0},
{"review_id":"JxfBd_lfl9nE-Xr5zN94eQ","user_id":"DwadRg3K5XEjx-ZM5fJOeg","business_id":"yN_eSsPDb9zmrp9GSiWg6w","stars":1,"date":"2016-09-05","text":"Kevin you're a racist. You should look in the mirror.\n\"Hispanic male\" has nothing to do with me being late to my flight.\nThanks for ruining my great weekend.","useful":4,"funny":1,"cool":1}]