[{"review_id":"MancGWUXvYzYAoNKJq_SVA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"FJx8D4LjgBRAjfOh-hmPGw","stars":2,"date":"2015-08-20","text":"Dasha's review pulled me in for the cheesesteak.\n\nGot one for about $6. Steak was real steak, not pressed meat, but nothing to write home about otherwise. Cheese was alright. Bread was unremarkable. Onions weren't grilled enough for my tastes. Mushrooms were too tough and chewy. Flavors didn't really click or pop, so to speak. I just wouldn't order it again.\n\nOne of us ordered chili; she said it tasted like dog food.\n\nAmbiance is screeching chairs, crashing trash bins, and tourists with varying degrees of volume control, milling around a cavernous metal-and-tile cafeteria.\n\nThe highlights of my experience were the cups of free water and that one of the employees had on a cool Mighty Ducks hat.\n\nMaybe their ice cream and smoothie options are great; maybe the cheesesteak would be better with fresher ingredients or a different chef. I won't find out. Sorry!","useful":0,"funny":0,"cool":0},
{"review_id":"2eX2Xi_1g8V1gaPHhBH9FQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"tstimHoMcYbkSC4eBA1wEg","stars":5,"date":"2014-05-23","text":"So sadly far from where we live in the valley. This place would become a weekly staple if only it weren't about 30 miles round-trip for me.\n\nWe had the enchilada verde special on the chalk board: about $9 for three enchiladas in green sauce with beans and rice. Meal came with fried tortillas to break into chips, and some fresh red salsa. Everything tastes authentic without melting our gringo tastebuds.\n\nWater was clean, server was nice, music was pleasant. Food reminded me of a place that I grew up with back in SoCal and pined for when I moved out to the valley a decade ago. It took a long time to find this, and I am sad to spend like $5 in gas just to make a trip out here, but it's worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"l3dvK6Ddh4dtQMTxX-3CMw","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"WpI5MZC3XzlTpcUOKXzCbA","stars":2,"date":"2015-08-20","text":"Ngah. I wish the food was as good as the view. If you enjoy alcohol with your meal, you'll probably get tipsy enough to gloss over how mediocre the food is. And if you're fine with sloshing hot sauce on the main dish then you're probably not very picky about whether the meat tastes gamey or the tortillas greasy. Maybe we got unlucky, or maybe we ordered the wrong things, but I ate at the DI location about a decade ago and remember it tasting equally disappointing.\n\nServers were friendly and helpful, even while comping half of our meal; chips and bean dip were above average, but so too were all the prices. Water was clean tasting if you care about that sort of thing. View is fantastic. And I really disliked the food.\n\nWe would love to find just one meal here that works for our cursed picky-eater super-taster palates, so we'd have an excuse to come by and enjoy the view and friendly service. Who knows what it'll take to come back, though.","useful":0,"funny":0,"cool":0},
{"review_id":"DzOOJZRhN80ihVtiNKyvjA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"krPKgiC0EolDhSHz3kLp6g","stars":5,"date":"2014-04-26","text":"This place is like a treasure chest. It is the sort of place that I'll miss if I ever spend too much time away from Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"ViBP5aP2RV6lfYTpgBXyxA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"6Na0jTJjX5GQY_ZJ53G02A","stars":2,"date":"2014-06-21","text":"So apparently there is another Verrazano location on Rainbow which has been around for about thirty years and is run by the same owner it opened with, who is himself a New York Italian. I made the mistake of thinking this was that. It's not that.\n\nThe pizza was not bad enough to send back, but bad enough to not finish. What I had today on a Saturday morning was a poseur of a slice. Yeah, it's thin and crispy enough to fold in half. No, it doesn't taste like a serious pizza chef made it. Couldn't tell who the chef was, but the only guy behind the counter was a young Hispanic guy. It tasted about as good as you'd expect if you went in thinking you'd get a thirty+ year veteran chef and got a young Hispanic guy instead.\n\nEither today was a serious off day, or the five star reviews you're seeing on this page were meant to be written for the Verrazano on Sunset. I'm considering my five bucks a donation to a local business rather than money paid for a meal.","useful":0,"funny":0,"cool":0},
{"review_id":"Jq8OsOTmnv0OUpYIQ4wVrQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"hojZyJk1Wf2UE2CpG7cgIg","stars":5,"date":"2014-08-18","text":"My go-to fast food hamburger joint. Much as I love Fat Boy's pineapple-packing Hawaiian burger, or a good Fatburger on the char (always order on the char), Freddy's hits the sweet spot for me in price, distance, consistency, and drink selection (I like Wild Cherry Pepsi; your own mileage may vary). I can say that some days are better than others, but overall it gets my highest marks. I very much love the maillard crusting along the skirt of the thin double patties; it's good proof that you don't need a flame grill to make a great burger.","useful":0,"funny":0,"cool":1},
{"review_id":"MhALPZh6IE6eJJSvT5VTxQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"O7UMzd3i-Zk8dMeyY9ZwoA","stars":5,"date":"2014-07-12","text":"I went in with Expectations, here, and they were well met. This is the kind of place that I will be bringing friends and family to when they come to visit Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"Kxb0o_2am1TjLP1i3BLpcQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"5FiuxRWs-indyk2Y9imkSg","stars":3,"date":"2014-07-05","text":"Back to three we go. They brought back the drink that they stopped carrying the time before, they made my meal properly unlike the time before, and this time I didn't see any roaches roaming. It wobbles in quality and reliability, but it's my local go-to cheap Chinese at this point.","useful":0,"funny":0,"cool":0},
{"review_id":"i_xXMeSNoOuZrzSv32RmeQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"HYKTKG3X7jtLe6elxp63JQ","stars":5,"date":"2015-08-20","text":"Second time in. It's just plain delicious. Dan serves the best fish & chips either of us have ever had, and his buttermilk dipping sauce recipe is fantastic enough that we buy extra to take home.","useful":0,"funny":0,"cool":0},
{"review_id":"j6M_Ub7YbeZbXj1rYXZD5A","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"qoiUo-7k2ATm0eokxNr8nA","stars":3,"date":"2014-08-17","text":"It's more of a 2.5 star to me, here, but whatever. I tried this place several years ago and the food bored me too much to become a regular customer.\n\nWe finally gave it another go, because maybe things are different now, etc. Just like the first time, service was friendly, and I liked the restaurant's ambiance and cleanliness. Price is nice for the lunch specials. But, just as before, we found the food boring and mediocre.\n\nIn the same way that the five star reviewers here can't understand why us two and three star reviewers are disappointed by the food, I just can't understand how anyone could call it yummy, great, or the BEST. It's nowhere close to those things for me. Too bad.","useful":0,"funny":0,"cool":1},
{"review_id":"vlKH_VrIsijzPY__USkYRA","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"WDKTg468bkRPW0LqbAZfmg","stars":4,"date":"2014-03-25","text":"IMPORTANT NOTE: Mondays are no longer all-day happy hour. There's a photo in the yelp gallery showing that it is, but we were informed today, March 24 of 2014, that they're not doing that anymore. Now their happy hours are from 3 to 6, Monday through Friday.\n\nWe went in around 2 to split a happy hour burger and try one of their shakes. Our server checked with management and gave us happy hour pricing on the burger just this once, which was kind of them. Service was nice, ambiance pleasant, and things came out in a timely manner. Their water was some of the cleanest we've had in a restaurant. The strawberry shake is probably the finest I've ever had ? but it had better be, for $8, you know? The burger came out well done even though I ordered medium, and it seems to be one of those pre-formed, pre-grilled burgers with a bunch of liquid smoke added to it. Aside from the patty, everything else about the meal was good ? but because of the patty, I'll never order that again, and I'd have been disappointed to pay $14 for it.\n\nIt's weird to give the place 4 stars mostly just for the great shake, super-clean water, and nice service, but here we are.","useful":0,"funny":0,"cool":0},
{"review_id":"n9dR80bpT9Hf7ucMmPAyBQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"7BK6vckOh2Ywq8ryy8P7Ow","stars":3,"date":"2014-08-23","text":"On the up-side, the ambiance was very neat, and the staff were friendly and helpful. On the down-side, dine-in water cups smelled a bit like dish rag, and the food wasn't impressive.\n\nCoke on tap, with Pibb rather than Dr Pepper.\n\nOne of us ordered a chicken bowl, which was bland, and not even as good as a dish we used to order from Applebee's years ago; the other ordered a charred (but seemingly still precooked) kahuna burger, which was sloppy and slipping apart, the flavors and textures didn't blend as well as they could, and it left a small longing for the Hawaiian burger from Fat Boy.\n\nIt was all OK, but just OK, not even \"A-OK\" as Yelp says. I noticed that a Braddah's is going in soon on the other side of the parking lot; it'll be interesting to see how that battle goes.","useful":0,"funny":0,"cool":0},
{"review_id":"6xcfZRmDTknz-lOjJNL0GQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"WS9BUR9E1I6JIIP_OTDkLg","stars":3,"date":"2014-09-18","text":"Pretty alright. We went in with a buy one get one coupon, and we might return if we had another. Ordered fish & chips, and a turkey burger. The fish & chips turned out nice, the turkey burger was not nice.\n\nTurkey burger's meat was spicy for some reason, and came with house-made thousand island which was also spicy for some reason. I don't mean an eye-wateringly powerful spice, or an interesting spice that added to the flavor profile, just an unadvertised \"I wouldn't have ordered this had I known in advance\" kind of spice. Beyond that, the flavors and textures didn't mesh or impress. And I'm sorry to not be sorry here, but I've grown tired of eleven dollar burgers that are so huge that you can't eat them without a knife and fork. I ended up taking half of this thing home, and then couldn't bring myself to eat it because it was so unimpressive.\n\nOtherwise, service was nice enough, and ambiance was okay (construction going on in another part of the building, so there was loud beeping and drilling that echoed around the open floor plan). The five-starry reviews around Yelp are speaking of their regular burgers, so maybe if we ever return we will split one of those between two people. Maybe with another coupon...","useful":0,"funny":0,"cool":0},
{"review_id":"qAkKws9D3MYoTBQniHk_4w","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"8YJOMfdnk42v3PvpkDxJGg","stars":2,"date":"2014-09-18","text":"I am so sorry that I didn't take a picture of the cheese enchilada that was served to us. It was the sorriest enchilada I have ever seen. Maybe a quarter of an inch thick, with cheap cheese that melted into liquid grease. 100% unappetizing, and they wanted to charge three dollars for a single one. No sides or anything.\n\nMeanwhile I got their Thursday $5 special, the carne asada. It at least had a proper portion size. But the meat was chewy and tasted almost old. Beans tasted pretty good, but rice was very mediocre. The waitress insisted that everything is fresh and they go to the market every morning for supplies. If that's the case, then they've figured out how to take fresh ingredients and capture that mysterious and elusive 'slightly outdated' flavor that's so hard to achieve with fresh food. I only managed two or three bites before giving up.\n\nThe chips were alright but nothing amazing. We got two rounds of them, and the second round tasted fresher than the first. Salsa was alright-ish but lacked sophistication, and had a slight burn in the back of the throat that managed to drag on and on. Top this off with the water tasting either like tap or like their filter had gone out. We both drank from my tea, just to mask the dubiousness.\n\nSo far this is completely in 'Eek!' territory, so why 2 stars instead of 1? The waitress that day was great. But she's apparently one of the bartenders and was just covering for the Maribel's staff today while they were short. She was extremely understanding, and took off both the terrible enchilada and the disappointing carne asada. We left without being charged, but we still happily left a tip.\n\nAnd really, there were other patrons here who seemed to be quite happy with what they were getting, so I'm very confused about how lousy this was for us. I remember reading over these yelp reviews and wondering how you end up seeing a bunch of 4 and 5 star ratings and then an intermittent 1 or 2. I've definitely had a 1 or 2 experience today. Not sure if I'll ever return to try for a 4 or 5.","useful":0,"funny":2,"cool":0},
{"review_id":"0zm0tww8gPG1iWpK3ux_uw","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"95CCHowiE0W_ovv5-9lQAQ","stars":5,"date":"2014-03-29","text":"We come to this happy hole in the wall just about every time we've gotta be on this side of town. Easy service, and food that has been consistently great or at worst very good every time we've been by. $3.50 Hawaiian, and $5 pastrami: just the right seared crust on the patty, and just the right softness in that bread.\n\nA part of me would like to give 4 1\/2 stars for unimpressive drink options, or the kinda sketchy local experience ? today we had a guy walk in and work some hustle trying to sell cheap perfume to diners ? but even with those little reservations, I just plain love this place and always look forward to coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"qwf12YiHq_c4eMi86-M10w","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"SueEpC916vd8Lo3Lyl9_pQ","stars":2,"date":"2014-08-27","text":"Did I order the wrong thing? Or maybe it was an off day? I feel a bit bad for giving them two stars, but honestly: \"Meh. I've experienced better.\" \n\nChicken katsu had skin on every piece, the oil tasted a little off, and they left in a bunch of lousy bits on the meat. My mother was actually gagging from one of the pieces. I pulled off a bunch of inedible things but otherwise managed to finish the rest. What I didn't finish was the macaroni salad, which didn't taste as good as what I'm accustomed to.\n\nPortion size was about what I've come to expect from Hawaiian places for this price. Service was pleasant. Ambiance was mostly hole-in-the-wall, and I feel like I made a mistake sitting under the kinda loud and tinny mono speaker in the ceiling.\n\nWe ended up going somewhere else after this meal and paying for some better food to clean the palate. Too bad.","useful":0,"funny":0,"cool":0},
{"review_id":"7MXScgDQe3zTmocrvShzlw","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"fL-b760btOaGa85OJ9ut3w","stars":3,"date":"2014-04-26","text":"Came for the famed Outlaw Burger. Hoped that it would remind me of some burgers from restaurants I grew up with which are now long lost. It didn't.\n\nFood was OK. Service was quite nice. In the end, probably won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"ku3hYUm6lhrdssVHtXYOPQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"p-w6g8cuQq5PU_4U1XNCzQ","stars":5,"date":"2015-12-23","text":"Mark us down as more California expats who have been confused for years why it's so hard to find a restaurant-style Mexican food in this valley that lives up to our standards. Not cheapie take-out chains, not little specialty places, and not restaurants that need you to be tipsy before you taste. We've had very good sit-down meals in CA, AZ, UT and CO, but NV has let us down pretty consistently over the past ten years.\n\nEl Mescal lives up, though. We'll be back again and again.","useful":2,"funny":0,"cool":1},
{"review_id":"-nyM99ESLZzli534R_zEMw","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"7IkSGKKiWhfkXQBCT8EOgA","stars":5,"date":"2014-08-28","text":"That patty melt continues to be the best we've had. This time got it with a side salad, which was also pretty excellent.\n\nI tried the sliders, which to be quite honest had slightly dry buns and the burger meat tasted unimpressive. I wouldn't order it again, personally. On the up-side, the sweet potato fries were again excellent, and stayed remarkably crisp and delicious even as they cooled.\n\nJust like my last review: The staff were super friendly and cool people, the restaurant was clean and comfortable and looked great. We're absolutely coming back, even just for the patty melt.","useful":2,"funny":0,"cool":0},
{"review_id":"voGyT7sGhFNSNEYNR1_sZQ","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"dqO24yvvHJc5jgHm3LcliA","stars":3,"date":"2014-08-17","text":"2.5 stars if I could. What gets me is that I'm not sure that anything was done 'wrong'? Like maybe it's completely intentional that the soggy and limp crust tastes like little more than yeast and charcoal. Maybe the sauce is supposed to be watery-textured with a mostly-acidic hint of tomato. None of these  textures or flavors stood on their own or worked well together. Thankfully the salad was alright, anyway.\n\nService was friendly. Prices were okay for the area. The cup smelled of sour dish rag, so we asked for a paper cup, which was cheerily granted. I only saw one fly, and one other customer. The music was a CD of emo pop rock for some reason?\n\nThe high star reviews I'm seeing here use words like 'awesome', 'fantastic', and 'ridiculously delicious', but based on my pre-lunch weekend experience, I totally cannot fathom using those words.","useful":0,"funny":0,"cool":0},
{"review_id":"CJmBbtcx_l9hlS-xbwQ5fg","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"Nw24O7pZTBKtQ9_DFUiRgA","stars":5,"date":"2014-07-27","text":"Such a great surprise. The closest thing I'd compare this to is the also-five-star-to-me Art of Flavors, which is up past the Stratosphere, where LV Blvd starts digging into the number streets. But Eis is down south in Green Valley, so it's a nicer part of town and easier and closer for me to get to.\n\nSo far have become a fan of both the strawberry & cream, and strawberry cheesecake. Both with real chunks and streaks of strawberry. Both delicious, and the finest strawberry ice creams I can remember having. We loved it enough to return twice in a week since we found this place! Their cronut-alike was also excellent and has set the bar for me to compare others to. We'll be coming back again and again.","useful":1,"funny":0,"cool":0},
{"review_id":"Wi2RE9yOB5gjUfg2GiKSeg","user_id":"naWOT0hrWBoWt_Xx2CmzhA","business_id":"Y1f5hhg_r_xSTdvL7zIT5A","stars":5,"date":"2014-08-31","text":"My go-to for Dole Whips. Ironically in contrast to Jessica P.'s one star review, I found the girls at the window to be friendly and helpful. C'est la vie.","useful":0,"funny":0,"cool":0},
{"review_id":"L-dUFjNpuGR4HLjwaPaFbg","user_id":"e6MFKHjLe7sgAPkUESPBaw","business_id":"FT58wwk-m-COM6oiDeGahA","stars":5,"date":"2013-09-21","text":"After hearing great things about them, I approached Funky Toque with a somewhat unique situation: I wanted my first haircut in 17 years, after having had long hair in one form or another for about 20 years. Naturally, I was quite nervous about the whole affair. \n\nI went in for a consultation with José, who spent a lot of time going over options with me and trying to find a style that would work with my face. Not once did I feel pressured to cut it if I didn't want to, and it was obvious that he had a lot of experience in making the most of someone's hair.\n\nOnce the decision was made to start, he proceeded to spend a full hour trying three progressively shorter styles until we found one that made both of us happy. He made sure I wasn't given a style that would require too much maintenance (my previous hair maintenance routine largely consisted of washing it, brushing it, and tying it back, so I'm not one for too much fuss), but that could still be sculpted depending on my mood on any given day.\n\nHis enthusiasm and attention to detail really made the whole process quite exciting, and I spent the rest of the day getting compliments from people - none of whom had ever seen me with short hair. Even the other staff members (and clients!) gave their approval, which meant a lot after so long away from the scissors. We won't even go into the reaction it elicited from my wife, though I will say it made it want to cut my hair more often.\n\nI really can not recommend Funky Toque enough. They turned what could have been a very bad experience into a fantastic one, and I'll definitely be going back for a long time.","useful":0,"funny":0,"cool":0},
{"review_id":"qt_BSOfLk_TVw4blh5xWsg","user_id":"9ts-498KpWU0_z7JUNxZ-g","business_id":"fGurvC5BdOfd5MIuLUQYVA","stars":2,"date":"2017-01-07","text":"Food is great , but people who work\/ own it are assholes. Not only did they get mad at me for not understanding her accent but she made fun of me when I figured out what she was saying.","useful":0,"funny":0,"cool":0},
{"review_id":"_jtKvKnzz-_tBr8oT-0eRA","user_id":"9ts-498KpWU0_z7JUNxZ-g","business_id":"63I-0GhkRAEyGng8UPdT6A","stars":5,"date":"2017-06-01","text":"Jamie is so comforting to work with! I feel confident and relaxed every time I sit in his chair and I leave every time feeling like my best self.","useful":0,"funny":0,"cool":0},
{"review_id":"TS_mZqx7X5wNi6K0vj5bhw","user_id":"xQD6Oc4_OoTIFesWeE4wQQ","business_id":"G9L2Z211Yi70iN_6eudxuQ","stars":5,"date":"2017-02-02","text":"For quite a while (a number of years) I had bad neck and shoulder pain - resulting in nerve pinching and cartilage build up. Dr. Missiha was able to diminish the problem, resulting in a taller, painless me. \n\nNot only was he able to explain things in a way that made sense - and was sensible - he is sincere and caring towards patients. Dr. Missiha has a genuine passion for seeing and following through with his patients to their best and healthiest versions.   \n\nHelpful, knowledgable, congenial, and most importantly, effective. \n\nHighly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"1t0DUxRvq6J5pEgQNRKXQw","user_id":"xQD6Oc4_OoTIFesWeE4wQQ","business_id":"0QjROMVW9ACKjhSEfHqNCQ","stars":5,"date":"2017-12-12","text":"I love pho - Tried many restaurants around the city - this is the best and best price. Quality, service, the whole package.","useful":0,"funny":0,"cool":0},
{"review_id":"YFjJ96YGoB-U2j0GFpZ7UQ","user_id":"pRiZE9SII1Gm3FmCvlA1Jg","business_id":"OAyV0I6LZQQ8BRiGLRFnag","stars":5,"date":"2017-06-06","text":"Pam does a beautiful job with my hair color and style, and is a kind and approachable person. I always walk out of the salon feeling fantastic. I've had hit and miss results at other salons, but never with Pam. She listens to my requests and will give me her input as well when I'm undecided, which I genuinely appreciate. My husband and daughter are also clients and are always happy with their hair. We highly recommend Pam!","useful":0,"funny":0,"cool":0},
{"review_id":"ieDGoEGueNK4TPhWenbFAg","user_id":"pRiZE9SII1Gm3FmCvlA1Jg","business_id":"Z8oLB6IEr58CkNU6oCGWHw","stars":5,"date":"2017-04-14","text":"I've been seeing Dr. Gorman for years and have been extremely pleased with my care. I willingly drive 45 minutes to her office because she is thorough and balanced, and I always feel at ease. She takes the time to really explain test results and treatment options. As someone who is typically anxious in medical settings, I truly appreciate this. She always listens to my concerns and makes sure we set attainable goals, so I can be proactive with my own health. Everyone in the office is kind and considerate as well, which makes for an all-around positive experience. I highly recommend Revolution Health!","useful":10,"funny":0,"cool":3},
{"review_id":"8Dpp-eKSuVArS2-DOwnn1A","user_id":"E-Pq85XhYQ163K2EX9yDMg","business_id":"EbAki-FltBiwSKxoi2_vYA","stars":5,"date":"2015-12-08","text":"Bobby was fast, efficient and knowledgeable.  Thank you.","useful":0,"funny":0,"cool":0},
{"review_id":"0g07fkRRFaShdcFj3of7Tw","user_id":"E-Pq85XhYQ163K2EX9yDMg","business_id":"7S_L-3ggy4YpFr50Q08fcQ","stars":5,"date":"2017-04-03","text":"The are so professional and pleasant to visit.  The have a recreation room upstairs with cable TV if you want to wait for your car.  I now only take my car to them.\n\nThank you.\n\nClaudio","useful":0,"funny":0,"cool":0},
{"review_id":"p4YgoUija3e_OC5YiaO_pA","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"BrhyYc1-gn3lPuhlkqNk2w","stars":4,"date":"2014-10-29","text":"I would say overall that this pizza joint is a good one. It's not far from our house, so it usually doesn't take long for delivery. I've noticed that when Frankie (the owner) works there, the pizza is amazing. We usually get pepperoni and garlic knots. A couple of nights we've gone to pick up an order, it isn't ready when they said it would be, and the pizza just doesn't taste the same... that is when there are teenagers working- so maybe it had to do with that? I'm still sold on ordering during the day- the prices have kind of gone up but they do have some great specials.","useful":1,"funny":0,"cool":1},
{"review_id":"a_ZtJGE3xVK-MBtwWGC-0Q","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"cxZIhD-jcooZexgwvQGOUA","stars":4,"date":"2015-01-26","text":"I like to read reviews about places, especially when living in a new area. The first massage I ever received was in Texas by some random self-proclaimed spa. I walked out of there feeling like I had just wrestled a 400lb she-woman. I was sore for three days, and have never gone back to get a massage, until this past Saturday (1\/24\/2015).\n\nMy birthday was the 20th, and it was a gift from my boyfriend to choose a spa package and have a day of spoils for myself. I called on the 20th, and was immediately sent to a voice machine, where they guarantee they will call you back within a short period, yet I received no call back. \n\nI called again the next day after shortly considering going to another spa- but couldn't find a place to beat the cheap prices at The Healing Arts. \n\nI signed up for the Pamper Me package- where you can choose three different combinations, so I got a 60 minute hot rock massage, a 60 minute Belavi Facelift facial, and a 60 minute hand and feet feast (reflexology massage).\n\nAs soon as I walked into the spa, I started to relax! It is dim lit, and smelled like the sweet heavens. I filled out some paperwork, was given water, and then taken into a room that was dim lit as well, with soft music playing. After taking off my clothes, I proceeded to enjoy an hour of amazing massage work by Terrell. She worked hard at extracting the stress from my body with her witch craft.\n\nAfterwards, I was treated to a facial in which I fell asleep during. \n\nAll and all it was a great experience! I'll be going back for sure.","useful":6,"funny":0,"cool":2},
{"review_id":"uQ87ecedNuVBHBye9nRxeg","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"amNromvj2O7OAYYrlDEUcQ","stars":4,"date":"2015-02-24","text":"You have to be slightly out of your mind to want to do this.\n\nBut that's ok, there are plenty of others just like you... including me!\n\nI died.\n\nAbout 46 times. \n\nIs there such a thing as a 3rd, 4th, 5th...etc. wind? I discovered that there are... or I just dug down and pulled what was left out of any willpower I had to do Echo Canyon Trail, and I finished.\n\nI'm overweight (working on it, give me a break!) and this was seriously a lot of work. \n\nYou may have seen someone sliding down the pole on the way down the trail... yeah that was me. I was too afraid I'd go rolling down it if I didn't decide to slide down on my ass.\n\nBe prepared, mentally and physically. Take plenty of breaks. Gloves can come in handy but aren't absolutely necessary. I highly recommend a camelback for water, it came in handy for sure. Bring a snack with you to eat at the top. \n\nGet ready to climb over boulders, and to constantly think.... oh! I made it to the top!! Only to discover its just another mini peak, and you have yet another half mile to go before you reach the top. \n\nWear sunscreen!! You will need it. A hat might do, but I feel like it would get in the way of seeing other hikers making their way back down the mountain. \n\nI seriously reached the point of exhaustion, and three days later, I am still sore. Even my back was sore after this hike. I also discovered a nice purple bruise on my buttcheek from sliding down some rocks...LOL.\n\nThe view at the top is absolutely worth it. Don't feel like you have to rush just because people are sprinting behind you. Move off to the side and let them pass. Take your time, rushing is only going to get you injured. \n\n\nOnly negatives I have:\n\nParking SUCKS. The lot was full at 8am when we got there, and it was really frustrating because 3-4 cars drove out at the time we were circling around, yet the people in charge of monitoring parking weren't paying attention. Instead of being able to drive in, we had to park at AJ's which was a mile and a half away. Apparently they only open up the lot every 10-15 minutes. You will be better finding a spot to park and just walking, otherwise you will spend more time trying to get into the parking lot than you would walking to it.\n\nIt's not a fashion show. I'm glad a lot of women are confident and proud of their bodies. But honestly, I don't want to look up to determine what boulder I'm going to grab, only to see half of your ass hanging out of your waistband rolled up neon shorts. I also don't want to look up and see your tits hanging out, on the verge of nipple flashing. \n\nSome people brought kids, and it's not really something they should probably be seeing. I'm sure the dudes don't mind, but really?? Go to a strip club if you want to be naked.","useful":1,"funny":1,"cool":1},
{"review_id":"zyPRvdeui2H_-IafJYw6lQ","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"QmQCw_y9C1VEYUVPALh2MQ","stars":2,"date":"2014-10-27","text":"I started working with fast signs over a month ago to have signage made for the company I work with. I started working with Hali in the beginning and since we weren't quite sure what we wanted, and knew we needed indoor and outdoor signage, she referred me to their outside sales rep, Mandy. \n\nThings were good at first, Mandy came out to our location at no charge to do some measurements and get more information from me. She left after telling me she would get me a quote within the next day however, I did not hear from her for a week. After sending an e-mail to see when I would receive a quote- I got an e-mail with one the next day. After about a week of back and forth Q&A I told her we were ready to go forward with the project. I did not hear back from anyone after six days so  I sent Hali an e-mail on the 16th of September asking why I had not heard back from anyone, I finally got an e-mail from Mandy on the 17th; by that time had already decided to seek out another vendor. \n\nThe vendor we talked with quoted us almost twice as much as what Fast Signs did, so I will commend them on their pricing. \n\nI had to ask them to revise the proof they sent to me four times because they kept sending me incorrect proofs. The first proof that was sent wasn't even a proof for our company.\n\nWe paid half of the payment, and I let them know that we were ready to have everything installed except for one indoor sign, as we were repainting and doing some rearranging. \n\nThey showed up with only one sign to install, and nothing else. I asked them where everything else was and he told me that they said I only wanted one sign installed. I had to let him know exactly what my e-mail said, and after he called the store, the owner, Sam came out to help install the rest of the signs except for the one sign we weren't ready for.\n\nThe signs for our front door have a white border- in which I pointed out to another sign we have, as a reference to the width of the white border we wanted- the signs they printed have almost twice the size border we wanted. In the proof it did not look as big, so we approved it. \n\nAfter telling Sam about my issues with the slow response times, the multiple proofs, and the border width, he apologized, but offered no means to satisfy myself or my CEO. The only thing he offered was a 10% discount if we wanted to reprint the signs.\n\nIt is my belief that a company that offers a product or service should ensure a customer is 100% satisfied with it.\n\nI am extremely disappointed with the service we received with this location. Although the pricing is good, we spent a large amount of money on our signs. The low pricing reflects the low standard of customer service this location has, and I am not quite certain we will use them again.","useful":3,"funny":1,"cool":0},
{"review_id":"VUaLq1MpGf4Rn8k_jFPCkg","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"pxRy9F0HwN7zJ7J89AwUpQ","stars":4,"date":"2015-01-26","text":"I ate here for the first time before going to the spa for my birthday. It was good food, and the hot sauce they have on the table was amazing- I wish I had written down the name! The waitress was kind of standoff-ish, she seemed weirded out that it was only me eating, and that I didn't have people with me. She didn't even attempt a smile... so other than the less than friendly waitress, the food it good, and fresh! Didn't have to wait long for it either.","useful":0,"funny":0,"cool":0},
{"review_id":"8ZbD7ckk1vN7Pw-RZxHT_A","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"nNG5mcebzeQWjkZnm3WsAw","stars":1,"date":"2014-11-12","text":"I would give this 0 stars if I could. I found a rental online through this company, with the map online saying it was in Queen Creek. Upon asking the realtor (Preston) if the electricity was on, he said it should be...let me get back to the start. FIRST we go out to Queen Creek, but apparently the map was WRONG on the website and the house was another 25 min drive. I get ahold of the realtor and he says, \"ohh yeah that's wrong, its in San Tan Valley\".... Okkkk would have been nice to know that in the first place.\n\nAnyways we go out there figuring we might as well if the house is nice enough. Wellll he used the pictures from before the house was destroyed because when we went inside, it smelled like animal piss, the carpet was ripped up, the electricity was OFF, food splatters on the wall, dried up POOP in the toilet, I mean FILLING the toilet... someone had a horribly upset stomach. \n\nWe left and I told him I was pretty irritated because it was a huge waste of our time. I get that the owner has to get the property cleaned up... but as a realtor, WHY WOULD YOU SHOW THE HOUSE IN THAT STATE?! His reply was because he just got the app on it, and was completely rude to me saying that had I actually read his e-mail I would have seen it was in San Tan Valley. Well, sorry dude, I just moved out here in July from Texas, so I'm going to trust a map that is on the listing website saying where the house is. My bad, could have done some more research, but you could have clarified it with me before I went to look.\n\nRude realtor, and untrustworthy in my book, I'm thinking if they are willing to let you go 40min out to look at a house that has no electricity, and looks like a poop bomb went off inside, they won't really give a crap about you if you move into a house and have any issues.\n\nDon't waste your time with this realtor, or this company.","useful":0,"funny":0,"cool":0},
{"review_id":"hiHXiQ8NxdDFO6ITVVLPtQ","user_id":"5ZBY5zqBsApYlbuFoCmoTg","business_id":"9Wc9cypUeTtjkoPLkPsF-g","stars":1,"date":"2015-02-16","text":"My boyfriend and I decided to eat here for the first time yesterday. We figured it was right next to the theatre, where we were going to watch a movie after, so why not? The dining area off to the right was pretty full, so we sat at a booth in the bar room. At first it looked like only one waiter was serving for the entire bar room. Finally, someone walked out of the kitchen and came up to us to take our drink orders.  I ordered water, and a lemon-tini. She came back fairly quick with our drinks, except I was given a tea with lemon... simple mistake, no biggie. We already knew what we wanted food wise, so we placed our order with our drinks- I ordered the boneless stripper wing platter with fries, and my boyfriend ordered a simple burger and fries. \n\nWe sit there and wait...... and wait..... finally, 10 minutes goes by and I still haven't gotten the lemon-tini I ordered. I look at the bar and see it sitting up there, and see the waitress standing off to the side watching tv. She glances at my drink, and then walks into the kitchen and comes back out to go over to where the menus are stacked and chats with another server. I get her attention and ask if my drink is ready, and she says, \"Oh! I'm sorry, I asked another server to run it for me, I guess they didn't.\" She of course, as to my guess, grabbed the drink I figured was mine that was just sitting there on the bar.\n\nUhhh what? You asked another server to run a drink for you, so you could watch the game on TV? Wow. \n\nSo then, we wait. And wait....... and wait. By this point we had been there for about a half our. A half hour, for some wings and a burger??\n\nMy boyfriend gets up and goes to talk to the waitress, who was again just standing there watching TV. He heads to the bathroom to wash his hands, while she goes to the kitchen to check on the food, and sure enough.... literally right after my boyfriend said something to her and went to the bathroom, she comes out of the kitchen with our food.\n\nHe comes back from washing his hands, just as she is setting the food down on the table. At this point I knew our food had probably just been sitting in the kitchen. I tasted a fry, it was hot... ok cool, lets try the wings.\n\nThey weren't even luke warm!!! The wings on the outside of the plate were cold. Literally cold, and the ones in the middle were barely luke warm.\n\nMy boyfriend bites into his burger, and what do you know??? Barely luke warm. \n\nOur food had obviously been sitting there for a while, for it to have gotten that cold. \n\nHe gets the manager, who asks if I want my wings re made, but at this point we don't have time because of the movie time. He said he would give us boxes to take it home, and he would take care of the meals for us. During this time, he was rushed and didn't really seem too genuine about his apology, and he hurried off. The waitress comes with the check, and we see that he only took the wings off of the tab.\n\nBull crap, we waited a half hour for some cold wings and a cold burger- and you want us to pay for it? Hell no. So I told the waitress flat out I wasn't going to pay for cold food. \n\nShe comes back with the revised tab, and I paid for the drinks. The manager comes back and gives us two $10 vouchers to visit any Native Bar & Grill. He then took the time to actually apologize, and seem sincere. I told him that this was our first time visiting. I've worked in the service industry for 7 years on and off, and was not impressed. He apologized again, and we went on our way to watch the movie.\n\nIDK what the deal was, the bar area was not that busy, while yes the dining room was, but that does not excuse cold food and a lazy waitress who just wants to watch TV. \n\nWe won't be going back to that location.","useful":2,"funny":0,"cool":0},
{"review_id":"jB-UGOOmlKjH7S86anesEQ","user_id":"BVbIvzIHnK7EoJyBngUrSg","business_id":"m7Xo-WioJMkeGPj8bVyS4w","stars":1,"date":"2017-11-08","text":"I agree with some other reviews about the rude older lady that works there. We were new to the office and she acted like we weren't worthy enough of her time. Won't be returning because of her. Also, going to send a complaint to our insurance.","useful":2,"funny":0,"cool":0},
{"review_id":"CKOhMUiprnmqEEBML5PdMA","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"u71djaZjecGVU1MqMevQ4g","stars":2,"date":"2017-08-20","text":"We used to come here a lot when it was at the old location.  Was looking forward to a triumphant return after a few years and was very disappointed.  Food was subpar (ie Caesar salad was soggy, pasta was bland) .  I thought maybe, just MAYBE, the experience could be salvaged by good service.  NOPE. Waiter was downright curt and rude. Couldn't even be bothered with us I guess.  Sadly I will not be returning to his restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"vgZIv104oZg7kdGR8m4QfA","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"n2N7C1MltVF2wa7JBE5O7w","stars":5,"date":"2015-11-16","text":"In 2013 my very rambunctious 8 month old boxer puppy had recently gotten kicked out of a downtown daycare due to her high energy and I was desperate to find an overnight boarding facility for her that could handle her \"unbridled enthusiasm\".  \nI quickly realized that I needed to find a daycare for my girl that provided not only high level exercise throughout the day, but also provided the behavioural supervision required of a boxer going through her nightmare \"teenage\" phase.  Not only that, the place needed to be OK feeding my dog her Raw diet and be a place I trusted to truly take good care of my girl.  Let's just say my options were very limited.  \nLuckily, someone recommended Doggy Boom to me and the rest is history.  My dog and I had a Meet and Greet with Antoinette at her place at Mt. Pleasant\/Eglinton and I was immediately impressed with how she understood my dog's needs and WHY she was behaving the way she does.  Not only that: She feeds her dogs raw as well!\nAs many boxer owners would understand: I have gotten used to automatically apologizing for my dog's behaviour.  We started with daycare with Antoinette and each day I went to pick up my dog, bracing for Antoinette to say: \"Sorry, this dog has way too much energy...I cannot allow her to come back\".  But each time I picked her up, I brought home an EXHAUSTED and better behaved dog.  Antoinette would tell me about their HOURS long hikes and how great my dog is.  I noticed a huge change in my dog almost immediately.  She listened, she has learned how to control her enthusiasm, she no longer jumps and most of all: she has learned how to properly interact with other dogs.  Not only that, I have also learned how to watch her interactions with other dogs and read situations.  All thanks to Antoinette we have a very happy and well-behaved boxer who loves her boarding stays with Antoinette.  I am so relieved to have found Doggy Boom and have a place that we can leave our dog for overnight stays without having any worries.  Thank you Antoinette!","useful":4,"funny":0,"cool":0},
{"review_id":"Dmu_IzEIlDWHKM5MfMrHBA","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"YtfQQHdcQ_bGl2V0Agxw1A","stars":5,"date":"2014-12-03","text":"Brought most of my indian relatives here. All were very happy with the quality of food and exceptional service.  \nVery happy to have an indian restaurant of this caliber in the area.","useful":1,"funny":0,"cool":0},
{"review_id":"6jGtYYOvhAidVoSHCF5apQ","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"zew94PCbpWKFTldA04Wx8w","stars":3,"date":"2016-01-03","text":"Cocktails were great.\n\nFood was edgy for the sake of being edgy. Covered in oil.\n\nWine list was minimal, mediocre and insultingly overpriced.","useful":0,"funny":0,"cool":0},
{"review_id":"Fxv0lbLeV-kWDUGEzubwMw","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"3cAy1gxlprn1ue0q3L_ziw","stars":4,"date":"2016-01-03","text":"Went here Jan 1 and ordered the following:\n- fiery wontons\n- xiao long bao\n- hot and sour noodle soup\n- Kung pao chicken\n\nFiery wontons weren't as good as they normally are. Looked like they had been sitting out for a while. \n\nXiao long baos were fresh, hot and delicious as usual. Not as good as ding tai fungs but a great showing nonetheless\n\nHot and sour soup with noodles was good. Oddly came with rice noodles, was expecting egg noodles.\n\nKung pao (something we never order) was surprisingly the stand out of the meal . SO GOOD - nothing fried just deliciousness!\n\nSo great to have a delicious dumpling place in yorkville!","useful":0,"funny":0,"cool":0},
{"review_id":"rvaNbs-ZlQL13QBj5xcwgA","user_id":"6qnEDlLvskelBXIlxp6k4g","business_id":"FGy2_opT9IGH3LRR7k4LVw","stars":5,"date":"2015-06-04","text":"Wow. Just wow. I came here in a pinch and they just got a customer for life.  Professional and I got ushered in for my haircut immediately.  I really appreciate not waiting. Amazing shampoo\/condition job and then a 10 minute neck and shoulder massage. \nMy cut was done by a Level 1 named Koichi, quiet and very nice.  My hair is naturally curly and I like it blowdried straight.  He did a good job - perhaps straightened it too well.  Overall it was a great experience and I will be back.","useful":1,"funny":0,"cool":0},
{"review_id":"SqF-89GMiWQMxNcKuCF2vA","user_id":"1On2MBW0Kri67L9vQpUjfQ","business_id":"61Do3_JKSyzUr3T3nZRROQ","stars":1,"date":"2014-06-05","text":"Pure garbage!!\n\nWhy waste words when I can just say it's not worth it. \nMy wife actually said \"we are never going there again\" and I tend to agree.\n\nSorry guys, should have worked out the kinks before you opened and not after.","useful":3,"funny":0,"cool":0},
{"review_id":"WSCOVOFWgMY2qltVKPlfTg","user_id":"SMPOLUJ2esOPsTfEW6OI5g","business_id":"g-VYySAKLlEZt8AqtdMzMw","stars":2,"date":"2012-06-20","text":"They completed my ultimate wash in about 10 minutes, which was quicker than I expected, and would have been nice if my car had been clean. There was still dog hair inside my car, along with missed spots on the dash. But the outside was worse, there was still bird poop on my car! For an ultimate wash I would at the very least expect my car to be clean. Very disappointing. On the plus side, I wasn't hassled to upgrade to anything.","useful":0,"funny":0,"cool":0},
{"review_id":"EeGsaEE5xdEkpMDwjPJYHA","user_id":"vtKPs_eOqsYi_o8qPa4dVw","business_id":"3CG7oBD_k85M8jJ_JlhL-A","stars":4,"date":"2010-01-21","text":"I do not like pickles, but Penguin's fried pickles with Ranch are amazing! As with any good restaurant there will probably be a line, but it is definitely worth the wait!","useful":1,"funny":1,"cool":0},
{"review_id":"bHbIqcuVB7oR_4d_oDoODw","user_id":"vtKPs_eOqsYi_o8qPa4dVw","business_id":"x7WmDyWVYUy4sPfT69nk5w","stars":4,"date":"2010-02-09","text":"Tuesday nights, free bacon and $1 beers! what more can you ask for?","useful":0,"funny":0,"cool":0},
{"review_id":"wYw3OiK22hYyzl502pb24Q","user_id":"XY6rgbxlaG392Gm6NBsXyw","business_id":"WFWkQjfjofNUmOERWqvKpw","stars":5,"date":"2017-07-09","text":"We love Camp Bow Wow, and the hours are perfect for our busy schedule. It also smelled very clean when we walked in, which was surprising considering the number of dogs. Dinardo is always pleasant when he greets us, and we love the updates on how they did in the yard. He's so helpful when it comes to advice on behavioral questions, and always has their best interest in mind. I LOVE the white doggie pools you put out in the summer, even if they do come home a little smelly. Makes me feel better about bringing my pups to play knowing they're being attended to by a great staff.","useful":0,"funny":0,"cool":0},
{"review_id":"9n_lknKqhH9V8zx_gX4soA","user_id":"XY6rgbxlaG392Gm6NBsXyw","business_id":"o3SafLqbLT_zT2HyqHwvhg","stars":3,"date":"2017-07-09","text":"Eh, drinks where overpriced and weren't that good. Service was fast for it being the lunch rush. The chicken wrap was good but needed more sauce and less lettuce. All around it was okay but not worth the price.","useful":0,"funny":0,"cool":0},
{"review_id":"Gg1Kw54XF79VH9DdZF54yw","user_id":"i9u5L0l_JeMwYCWlC21HvQ","business_id":"QQAMCmRXq0FRdMw0N17DNQ","stars":5,"date":"2014-10-24","text":"Awesome staff, they are all really kind and super knowledgeable. Dr. Bessemer was not judgmental or pushy, but still gave me information on what I should take into consideration based on their age and breed, which I really appreciated. Plus... he acted like my dog was the cutest one he's ever seen which all pet owners love to hear!! :D","useful":0,"funny":0,"cool":0},
{"review_id":"eJfVrFrYDnrzl1VuE_28EA","user_id":"i9u5L0l_JeMwYCWlC21HvQ","business_id":"vMsIy9yIbmIwR9s4q_ESxA","stars":5,"date":"2014-06-13","text":"After seeing the reviews here, I'm really surprised, so I had to write my own! I went here for the first time a few weeks ago -  and WOW - sooo much variety!! Especially some of the more rare fruit trees... no way you could find those at Home Depot. Plus, they are grown IN Arizona. We purchased 4 plants - watermelon, 2 bell peppers (1 black, 1 blue), and one more (can't remember... possibly cantaloupe). Planted them when we got home that day, and they're doing fantastic. I'd say about 2.5 times the size as when we got them!! Admittedly, I was a bit worried because they looked almost half dead... maybe that's hence the other reviews, but they truly are doing great. They also have the most awesome playhouses, sheds, barns, even doggie houses (so freaking cute), and lots of garden accessories, like statues and fountains. The thing I loved MOST about this place was how much I learned just talking to one of the guys there! I asked a question about my dying lemon tree, and he gave me TONS of advice!! Extremely knowledgeable and honest... I can't wait to go back. And I WILL go back... I've got my eye on one or two of their fruit trees :D","useful":0,"funny":0,"cool":0},
{"review_id":"kb5w8I7V7wzi9wBwbKaS0A","user_id":"i9u5L0l_JeMwYCWlC21HvQ","business_id":"eBPovHBx27RAFVjgtOWMKw","stars":5,"date":"2013-07-23","text":"I am always looking up reviews for EVERYTHING, yet have never written one myself, but today's appointment at the 43rd Ave Animal Hospital was the best vet experience I've ever had. Ashley was our nurse, and Dr. Stiyle was our vet. I couldn't believe how sweet they both were, and as another reviewer said, were so genuine & truly cared. I called this morning right when they opened after discovering my 15 month old dog laying on the floor, not moving at all. They said there were no appointments available until 1PM, but the receptionist must have quickly realized the concerned tone of my voice and that it could not wait, and from there she, as well as the rest of the staff went above and beyond, out of their way to make sure my little one could be seen right away. The prices do seem a little more steep than other clinics I've been to, but it is definitely a WAY better experience than I've ever had at any other vet! Plus, I found a coupon on their website. I will definitely be coming back here if one of my pets gets sick. They truly do care, and show their affection for your animal.","useful":0,"funny":0,"cool":0},
{"review_id":"ohjyRmabG8riYirq1gOY4w","user_id":"i9u5L0l_JeMwYCWlC21HvQ","business_id":"lsHmnOZNlsKnEDsNmT-5_Q","stars":5,"date":"2015-05-07","text":"Fantastic experience all around! We just got our first water softener installed, along with a Reverse Osmosis. I called a few companies who gave me really high estimates and the whole longggg sales speach... Tom came by, was here for less than 15 minutes, and the price was great. I called him back within the hour to schedule an appointment and they came out that day!! Super professional, answered every question I had and explained everything thoroughly. Thumbs up to Angel, Higinio, Fidel, and Tyler who installed the Water softener & RO!!!! Thanks guys!!","useful":0,"funny":0,"cool":0},
{"review_id":"8lc1VfywEQZMW7bDz5-g8A","user_id":"i9u5L0l_JeMwYCWlC21HvQ","business_id":"UYx74_29WV8dbBQgWPozDA","stars":5,"date":"2013-08-15","text":"This is a great clinic. Debi, the front desk receptionist, is so sweet and it's obvious she adores all animals! She's the type to baby talk your pet like it's the most beautiful cat or dog in the world (what owner doesn't love that?)! Hehe. She's very genuine about her affection for the animals! It's great. I got my 7 month old puppy neutered here, along with getting his nails trimmed, AND his rabies shot. I believe the total came out to $100 total. That's CHEAP! And it includes pain medication for 3 days after the surgery (during, too, of course, they are \"put under\"). The important thing to remember here is that THIS IS NOT LIKE GOING TO THE VET. Wanna go to the vet and wait 45 minutes for a full exam and all these things? It would be well over $400. I was checked in immediately, and the surgeon, Scot, took his weight and checked heartbeat, and that's it. Perfect. I also took my pregnant cat in to get spayed (don't worry, she was not far along at all, no pain was felt by the unborn kittens), and because she was pregnant the total came out to $105. STILL CHEAP! Again, got checked in immediately and was given 3 days of pain meds for her. The only \"con\" I would have is that they don't include the dreaded CONE. It costs $15 (any size). Dogs usually need to have these! Cats generally do not. Both animals are doing great, and considering you're paying a fraction of the cost that vet offices charge.... a lot of these \"low cost clinics\" don't treat the animals like the prince or princess they are! This clinic is the best option when you're not willing to pay several hundred dollars for the same surgery (and you should be!). :)","useful":4,"funny":0,"cool":0},
{"review_id":"0kHjcLhKMhRIHxIuB6-QMg","user_id":"RILMMUaF6bpCsnQAzc_bAQ","business_id":"67FzueRMlcTQV3Nuep2qPw","stars":5,"date":"2017-11-20","text":"Friendly and helpful staff. Great lunch prices. I highly recommend visiting Lotus Chinese Cuisine","useful":0,"funny":0,"cool":0},
{"review_id":"K3U8tfBkhidmVlLXL0B5OQ","user_id":"x1U_FmDSJTIFCEF-OYhFug","business_id":"ZX1dtmAJfaOPrZPRU39ayw","stars":1,"date":"2013-11-10","text":"Don't stay here. Stayed 2 nights. No hot water. Room stunk with a sickly sweet smell. Rust on the bathtub and stains on the lampshade. 6 noisy air conditioner compressors outside the window. They did not care.","useful":0,"funny":0,"cool":0},
{"review_id":"t4CDwVpb2-I-9inbeH-3Ww","user_id":"zzNTR-hRVqEYfoSQLJtqqg","business_id":"PfT-Sws-1bHnzLkp7AedmA","stars":5,"date":"2011-06-17","text":"This is one special event, it's not a hair cut so don't come here for a quick snip, it's an experience and and education.\n\nIt's not cheap so don't be afraid to handsomely tip on top of a not cheap cut.","useful":3,"funny":1,"cool":2},
{"review_id":"DznatQV3SM0Sb2ZSSabTHA","user_id":"kzvJK30GrB8DLUiz1Pdrfw","business_id":"J6TGHzwKKq5bqBR4_WsnUA","stars":1,"date":"2010-03-08","text":"The driver was on time and cordial when he drive me and a colleague from the Illini Union to CMI. But he charged us $13 each. I told him that the sign on the window says $13 each or $10 per passenger from the same location. He called the dispatcher who said since we had different rooms at the hotel, it counted  separately. That is dishonest.","useful":12,"funny":2,"cool":0},
{"review_id":"kgpqk5ZfAX9zhZpD2pQJ6g","user_id":"kzvJK30GrB8DLUiz1Pdrfw","business_id":"yLKoESPQ8BN7dn6ADzZicQ","stars":2,"date":"2011-10-22","text":"The servers were friendly and the salad was nice and big. However, I didn't go to a kabab house for a salad. The beef kababs were dry and tasted over-cooked. The Lamb Kadai which the menu said had ginger and green chiles. If a green pepper is a \"green chile\" then I guess that counts but I expected a bit more kick. I also was unable to identify any ginger in the entire dish and the lamb taste overdone. \n\nNot worth repeating.","useful":4,"funny":0,"cool":0},
{"review_id":"dBhS8VSEcwOpICQGsEWdiQ","user_id":"CNxAm7UxFPyCYwWFUExlHg","business_id":"vbVJzKDhHlhMnKRpES5QzQ","stars":1,"date":"2017-01-25","text":"If there are is a zero star, I would give it. It's a freezing night, we were waiting table inside, a waiter came and told us we NEED TO WAIT OUTSIDE because inside is the dining area. WTF?! Do Not Come. Period.","useful":0,"funny":1,"cool":0},
{"review_id":"L1dKbKEiSxxbS4n8hvvUaQ","user_id":"3cZPpN-IrA8CSc5PkZLbXA","business_id":"na4Th5DrNauOv-c43QQFvA","stars":5,"date":"2015-02-21","text":"Great 6 night stay. Very quiet, large rooms with a huge bath, great service and. Lovely pools . It was a bit crazy because of the new year but it was handled well.","useful":0,"funny":0,"cool":0},
{"review_id":"g8ojbzP1xoX9dbDfQv2KJw","user_id":"3cZPpN-IrA8CSc5PkZLbXA","business_id":"RESDUcs7fIiihp38-d6_6g","stars":5,"date":"2015-02-21","text":"Miche better experience this time around. We were invited back by the manager of the bacchanal buffet for dinner tonight  after a less them stellar experience earlier in the week, and it was a total turn around. Service was great we had drinks quickly this time.  The food quality was much better and maybe they had an off day during breakfast, but this time they were right on point. Still looked like there was a bit of a wait for tables which is to be expected. The lamb chops were our favorite item, very flavorful and seared well. Since they were a lot busier, there was much more staff and you had someone's attention quickly if you wanted something cut\/carved or spooned out. \nThe pastry team is impressive and my favorite item was the purple yam cupcake, very moist, there. Was a huge selection of desserts and since I love sweets this was a nice treat. \n\nWe appreciated the manager reaching out to us and inviting us back. We had the experience I had heard so much about previously and we really enjoyed ourselves tonight, we left very full, glad we just to walk to Bellagio to get to our room. Thank you Toshi and your team for a great recovery from a poor first impression.","useful":0,"funny":0,"cool":0},
{"review_id":"UCq0eAXGlNNXkmgFun0Gsw","user_id":"3cZPpN-IrA8CSc5PkZLbXA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2015-02-19","text":"After reading others reviews about the steak frites and location we decided to give it a try. It has a great location where you can watch bellagios fountain show If seated on patio. We were seated quickly and orders taken quickly. The baguette and butter is really good although we would've loved french cultured butter for the bread but it was still good. We had the country pate for appetizer which was a healthy portion size with onions and cornichones and toast yummy. For mains we ordered steak frites which was well cooked,a nice portion and tasty, hubby had moules which he said was very tasty with lots of sauce, og portion as well. Overall a nice experience we would return as the servers were attentive and food flavorful and plentiful for price.","useful":0,"funny":0,"cool":1},
{"review_id":"Ax0QL8Dpd8fb0T3yC0IVzg","user_id":"3cZPpN-IrA8CSc5PkZLbXA","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":5,"date":"2015-02-19","text":"Go here if you are starving or just love an great home cooked style meal. Glad we made time to go. Great prices and for 20 dollars you can have a great meal big enough to share. We had chicken and waffles which was amazing the waffle batter rocks as does fried chicken. Also we had the tasty Indiana pork which was huge and flavorful. Drinks are big and good make sure you have room for the free biscuits and strawberry jam. I wish we had one closer to nj!","useful":0,"funny":0,"cool":0},
{"review_id":"qw0JE7FumPeh7j57b9CkIg","user_id":"3cZPpN-IrA8CSc5PkZLbXA","business_id":"rtlsfmdufArhk-47sWIf2w","stars":5,"date":"2015-02-20","text":"Had the multi course degustation menu tonight sand every course was spot on. From the amuse Bouche of fluke tartar to venison, artichoke salad, many other courses and foods ending with lemon raspberry soufflé were all spot on delicious, interesting and well executed. Service was prompt and attentive.loved the little nice of chocolates and box of petit fours to take away. Highly recommend","useful":0,"funny":0,"cool":0},
{"review_id":"zdbrTSkq5v2BfYSkgZJgDA","user_id":"6D6STMlqZcVrU4crbRWmwg","business_id":"hf8WoI724TuDeAtH80bgPg","stars":2,"date":"2016-04-07","text":"Service was great. For lunch I had the Prime Dip sandwich, too chewy for 14 bucks. Probably won't go back.","useful":0,"funny":0,"cool":0},
{"review_id":"p-mpmMP1N71Ka75y6we4rw","user_id":"THU0-m9cUGo53Dm_k4KrKw","business_id":"v2tjswIV3e0c8o7_7MwYmg","stars":5,"date":"2017-06-08","text":"My wife took me here to look at a possible retirement party spot.  Wow, this is not just a spot for that.  From the moment we walked in, the smiles, the laughter, the fun oozing from every corner, every decor - even the light fixtures, you can't help having a smile on your face.  Next came the menu and the beer list.  So many choices and ones I haven't seen any where in Phoenix (hint: Any of the Deschutes beers), all on tap no less.  Then the food, appetizers and pizza, the best I've tasted in forever.  The staff; our waitress, McKenna was fun, attentive, and made us feel even more welcome.  After thoroughly enjoying a relaxing meal, the General Manager came over ( Matt Bertrand), just check up on us.  After explaining our retirement plan, he sat down with us and gave a run down on how we could do it.  I could go on and on, and this place deserves all the accolades, however I'll just say, this will be the place to have our party.  And, we have just found our new favorite place for a night out!","useful":0,"funny":0,"cool":0},
{"review_id":"J-CpefaWrz6BF98Fs2WwSw","user_id":"THU0-m9cUGo53Dm_k4KrKw","business_id":"nxCRx5_US4XLxufkF6-Tlw","stars":5,"date":"2016-02-29","text":"Have used the Super Shuttle at least half a dozen times.  I have never once had a bad experience!  All the carriers were above and beyond courteous and professionals!  I highly recommend them \nand will use them again.","useful":0,"funny":0,"cool":0},
{"review_id":"8WmJ-sGxFzBNcJ_mkE4tNw","user_id":"UyQU8DSQm0_Zh-OzfCpcVA","business_id":"5Zc41a446gV3K_o7CDs69Q","stars":2,"date":"2014-07-11","text":"Comfy bed, decent sized room. NOT AT ALL WHAT I REQUESTED instead of getting the two queen beds in a smoking room i got a king bed in a non smoking room and they did nothing to accomadate me. TERRIBLE SERVICE never brought in a cot either!","useful":0,"funny":1,"cool":0},
{"review_id":"QL9ftbC09X0KmsaMP1nXrQ","user_id":"DssAU9wrJtQIAmigTMFCmQ","business_id":"FGRw7knltfK9q4Z6_hev6w","stars":5,"date":"2014-11-30","text":"Awesome people they real know there stuff and Jody is the best!! She is the tour guide knows her stuff really well and will lace you up on much info.\n\n\nThx Jody we will definitely ask for you next go round!!","useful":0,"funny":0,"cool":0},
{"review_id":"1-PxZ0GFZLoQeKL9gJRNGg","user_id":"RvnZgQNm0EX7XsY5SZcKeg","business_id":"O589S0opFB9oK8VcL5tRcA","stars":1,"date":"2017-05-01","text":"This was by far a VERY uncomfortable experience. We came here to be entertained not haressed every 5 mins for lap dances and when we declined the guys got pissed off looks on their faces. They were like vultures circling their Prey except for one male stripper that was actually polite & respectful. Thank you Rebel for being a gentelman & for the memorable lap dance. (Rebel & our waiter - I would give 5 stars.....the rest not so much). I'm not a prude by any means but this was too much...I at on point had to tell one of the strippers to back off because he was making me uncomfortable and he still continued to massage my scalp & kiss my hand\/arm. Never Again!!","useful":0,"funny":0,"cool":0},
{"review_id":"vP6sFngesH8vss_AbYO7lg","user_id":"3CgMxL0z-TZk-19oNm0zLQ","business_id":"7xmuQuhpzBlkkSbWePFeVQ","stars":5,"date":"2013-02-05","text":"Orale! is fantastic. Not only is filled with friendly and accommodating waitstaff the food is outstanding. Fresh and interesting salsa, great chips and their negro modelo beer battered avocado tacos are something out of my craziest food fantasy. \n\nAbsolutely worth not only stopping by, but making a trip specifically to Ohio city just for dinner.","useful":2,"funny":0,"cool":0},
{"review_id":"j-3DsnbjVqrpoG1ZwSEbHw","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"YAODkC2s68TbF_kB9rFmMQ","stars":4,"date":"2017-01-06","text":"Kyle, my service advisor is awesome and always so helpful!!! I always get top of the line service when I visit. Thank you!!!","useful":0,"funny":0,"cool":0},
{"review_id":"8Kau-hcAHzJYdEW-Mb5KVA","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"2iLeiQ4OCJVwfodR9egMag","stars":4,"date":"2016-08-14","text":"Hosted my birthday party there and the service was outstanding. The food was delicious and brought out hot and on time.  Our waiter was extremely attentive and made sure that whatever we needed, we got. While it may be a bit pricey----its a great place for those special celebrations that you'll remember for a long time.  The atmosphere is super fun and a great place to party with friends. I would highly recommend this place to plan that special occasion with friends.","useful":0,"funny":0,"cool":0},
{"review_id":"x863I-lDez7h92gm-AotvA","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"xvIKjbhFydKRzrnibKuBDA","stars":1,"date":"2017-02-11","text":"I was having trouble with my MacBook air so I made an appointment for 6:45 PM to take it to the Genius Bar to have it looked at.  I got to the store about two minutes before my appointment time and when I walked in nobody approached to help me so I took my computer and walked back to the Genius Bar and just stood there and waited and waited and waited.  I went over and tried to find someone to help me and they said that I needed to check in so I did and he found my appointment on his iPad and directed me to go wait at the Genius Bar which I went back and did for almost an hour!!!  The store manager came over to talk to me when he clearly saw that I was upset when I told him how long I had been waiting for.  He told me a Mac technician would be over very soon and one did come and help me.  He took a look at my computer which I explained to him was working extremely slow. He spent about five or 10 minutes tapping around on it having me put my password in a couple of times and said that it was fixed and it should be working fine.  So I thought my computer was fixed. I brought it home and lo and behold it's still had the same problems that have made me bring it in in the first place my computer is now sitting at data doctors being fixed. I will never take my computer to the genius bar or to an Apple store again. The customer service at the Apple Store at the Biltmore was horrible.","useful":1,"funny":0,"cool":0},
{"review_id":"7JaVY6VFg2rgD0lGkXeP3A","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"HkmXmW-39-kmo2pLB65w5Q","stars":5,"date":"2016-06-07","text":"TJ did an excellent job installing my antenna on my condo roof.  He was on time, very professional and made sure I knew how to use the remote to change the channels for my regular tv stations.  He even took my old direct tv dish off of the roof for me.  He gave such excellent service and I would HIGHLY recommend him!","useful":2,"funny":0,"cool":0},
{"review_id":"-G3KWenVus64cOBoOf36Pg","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"Hym8oKpBMiRfMHy_5GaQBQ","stars":4,"date":"2015-11-03","text":"I have been going to this location for three years.  The staff is always very professional and helpful.  One of their associates, Mathew, was very helpful today when I went in and had suggested I try a different kind of contacts that would be more comfortable for me.  :)  He was right and made sure today that my new contacts would be shipped to my home, as they didn't have my prescription in stock.  He sent me home with an extra pair until my order is shipped.  Great service!!","useful":0,"funny":0,"cool":0},
{"review_id":"cU4No9kaNBBgGnSuNDzjbw","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"lRL7x-HMBscWyELxEVq85w","stars":3,"date":"2016-09-24","text":"I went here yesterday for dinner.  Had a turkey burger with pepperjack cheese, tomatoes and lettuce with a side of sweet potato fries and a small lemonade.  The food was very good---fresh tasting and made to order. However, the bill was $15.00. Kinda pricey for a hamburger and fries. I will probably go back, but not too soon, based on the price.","useful":1,"funny":0,"cool":1},
{"review_id":"xo7heKrUGlf9-IqAEqaPng","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"-6tvduBzjLI1ISfs3F_qTg","stars":4,"date":"2013-06-18","text":"Loved this place!!!!  Had the guacamole \"Joyride\" style.   Soooooooo yummy.  Tried the carne asada tacos and the crispy fish tacos.  Absolutely delicious.  Great service, friendly staff.  Only had to wait about ten minutes for a table for lunch.  I plan on going back to try the other taco options on the menu........","useful":0,"funny":0,"cool":0},
{"review_id":"C0aVKBjeAPyyfppsG_nQ4A","user_id":"n_BR4Hg9LFVXKStmYKQapQ","business_id":"Y2gXaC9VQ613Oa4nZd0WsQ","stars":1,"date":"2017-12-20","text":"Raced to get there today to drop off a package and walked into line at 4:58 pm.  There's some random guy standing there with a scowl on his face and says \"Sorry, we're closed. \". Really?????????  NICE customer service, with less than a week before Christmas. Just lost a customer forever.  Not buying one single thing in that place EVER again.  In this day and age of the big box stores and online retailers, the ONLY thing these neighborhood stores have to offer is CUSTOMER SERVICE.  Good luck staying in business.","useful":0,"funny":0,"cool":0},
{"review_id":"fy-EefsAflKb7Br6UFw--Q","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"qpqB77Fao7b058dcdRFUaQ","stars":1,"date":"2015-11-29","text":"I have had multiple horrible experiences with Swirls Cupcakes. Trying to secure an order was difficult. After ordering cupcakes for a party several of the guests, myself included, got some pretty bad food poisoning.\n  Dealing with the owner to complain gave me a second wind of pain.  \nI would not recommend this bakery to anybody, especially those who will be serving large groups or children.","useful":0,"funny":0,"cool":0},
{"review_id":"59UP86CXS9hnKci-Okk5gw","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"0v8icS8wOOgEDiHDCOQkZQ","stars":4,"date":"2015-11-24","text":"Great food!  Fast, easy to take out and great vegetarian options.  My family and i frequently take out from here.","useful":1,"funny":1,"cool":1},
{"review_id":"3gWUreqqOE-IXPGG_B0Seg","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"qIfw1ZXlbg8rvgvn7XUEhw","stars":3,"date":"2015-11-24","text":"Tried Moon sushi to compare to orher AYCE sushi restaurants.  As it is smaller than the rest it is a mixture of a mom and pop sushi restaurant with the popular AYCE style.  The sushi was fantastic but the cooked foods werent thay great.\nService was good as it was very busy when i went.","useful":0,"funny":0,"cool":0},
{"review_id":"oZfWYMuCnol0x-Yt9_Fnlw","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"xqocOGl5Hvjc3hb1r_U4xA","stars":5,"date":"2015-11-29","text":"This place is a Mississauga GEM.  I have friends that drive from far places just to have rotis and doubles from Leela's.\nThe goat curry roti is the best and i have never had a dish here i have not fallen in love with.\nThe servings are huge amd the prices are good.  The best part of it all is the warm and friendly service that comes with your order!","useful":1,"funny":0,"cool":0},
{"review_id":"D-CGFZ4hhqyyp4dvlBri0g","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"uT7iCFfZV018S-Q1ox5O7w","stars":3,"date":"2015-11-29","text":"Great food! QUICK service and always a good option for late night eats.  Prices are fair but have a good selection of a different korean dishes.","useful":0,"funny":0,"cool":0},
{"review_id":"CT77cNUUjtGuYT1wity09w","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"5N8R7ALESZ30EoAzVJtabw","stars":4,"date":"2015-11-24","text":"My first experience at Dirty Bird was amazing.  I ordered the ODM and it was delicious.  Boneless fried chicken thigh on a fluffy waffle!  There was a sauce on the chicken which was a mixture of red hot hot sauce and medium chicken wing sauce, which was so good.  Their coleslaw and potato salad are also a must get!\n\nI would recommend take out as there is very limited seating!","useful":0,"funny":0,"cool":0},
{"review_id":"jV6Ztj12J4akCvcaDDeFXg","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"YKGTLE-Q9nQl7M1NwLvFZg","stars":4,"date":"2016-05-07","text":"AMAZING tacos! Great selection of different fresh salsas and always made to order.  The burritos are huge and give burrito boyz a run for their money as it tastes more fresh.  Chorizo sausage is always my go to but steak is just as goo and always grilled perfectly.","useful":0,"funny":0,"cool":0},
{"review_id":"V9LsamSVHuAw4dfd5mj2pA","user_id":"VjY0PzJP2JS7lHaPfut2tg","business_id":"M1U7h2PUg_smJI8fgeixOw","stars":5,"date":"2015-11-29","text":"BEST Italian Bakery in Mississauga by far.  Everything at the hot table is delicious, esp. the veal.  Bread is always fresh and the gelato cant be beat.\nThe only complaint about this place is that there is only one!","useful":0,"funny":0,"cool":0},
{"review_id":"LYb5HO6ADoui6BYK50nTYQ","user_id":"gD_y8CECa4_sXHBSRAapQw","business_id":"faPVqws-x-5k2CQKDNtHxw","stars":5,"date":"2016-02-29","text":"Had the fried chicken with spicy honey sauce. Perfect crunch, perfect flavor, perfect all around. Green beans with yogurt sauce, biscuit, and deviled eggs rounded out a meal that I would again fly across the country for! Service was friendly, anticipated my every need, and exceeded expectations by a long shot.","useful":0,"funny":0,"cool":0},
{"review_id":"XB2xoiQt2uAERZekhmYwlA","user_id":"9S_oiBSZbTKBvt4FCLbliA","business_id":"-JFVxwdVQfX207554dx1nw","stars":1,"date":"2015-09-25","text":"ZERO STARS! The customer service and staff including the manager need to be replaced immediately! I purchased a groupon for two bowls for 7.99. I call in the order over the phone AND notified the girl that answered that I will be using a groupon- she said that's fine just present at the register at pick up. Upon picking up my order the girl now doesn't know how to ring it up so her coworker says oh we don't accept groupon. I said well isn't that something that should have been Disclosed when I placed my order and stated I had a groupon? His attitude was horrible - he didn't care if I left the food do to their mistake. I figured I was dealing with people that did not have basic education so I requested the manager. Well not to my surprise, he was even worse. He said all I can do is charge you for two drinks and give you one bowl free. The math came out to me paying double  what I would have originally. I paid for the two drinks and didn't even take the cups, it's the principle. I will never, nor my family, and I will inform co workers to not go here. This place is not worth my money. I suggest they offer courses in customer service to their employees.","useful":0,"funny":2,"cool":0},
{"review_id":"WmYxLhnienbIawSt7bxdZA","user_id":"9S_oiBSZbTKBvt4FCLbliA","business_id":"cjLf6ijfBz1WcsI3WEr-ww","stars":1,"date":"2015-12-06","text":"I wish I could give negative stars for this airline but it's not an option. I flew on frontier from San Francisco to Las Vegas last Sunday. Since this was a holiday weekend I made sure to be at the airport 2 hours before our scheduled flight. My fiancé and I both checked one luggage. After landing in Las Vegas we sat on the runway for well over an hour. Once we got to the carousel only his bag was spinning around. The frontier 3rd party company at the office was short, didn't want to help and when I requested a manager he refused to come down and speak with me. I have spent my whole work week trying to get through to people and have been shuffled back and forth. I asked them to review tapes in San Francisco and Las Vegas to determine if it even made it on the flight or it someone walked off with it. I'm told they can't\/won't do that. To top it off the one time someone did reach out to me it was to tell me my emails and phone calls are annoying and unnecessary! I  will not stop until my bag has been recovered. If you can avoid this airline please do! Another thing in case you weren't aware even though they give you a bag tag they do not scan your bag. So your bag can be stolen and they have no way to track it. Inside job if you ask me","useful":1,"funny":0,"cool":0},
{"review_id":"lcOx5vcG60dsedWEhctc7w","user_id":"YjmehsINO3QnTi0lk71PRw","business_id":"E7UDr5VghZucaGAnETmphg","stars":5,"date":"2009-05-13","text":"Auto Glass Excellence did an awesome job on my car! My Statefarm agent recommended them as a company to use for my windshield replacement.\n\n I called them right away, they took my information and set up the replacement for the next day at my work.\n\n I got exactly the same glass that was in my car to begin with, not the generic kind that alot of companies use. \n\nThey billed my insurance and all I had to do was sign the paperwork. No cost to me. \n\nYou hear so many horror stories about auto glass companies but this turned out to be a cake walk.\n\n I would highly recommend \"Auto Glass Excellence\" and will deffinetly use them in the future.","useful":1,"funny":0,"cool":0},
{"review_id":"luKwRoBmYW3hKiWT0oY48w","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"olGDZrn42yKo_9wsyDXRIw","stars":5,"date":"2017-11-02","text":"Mr. Sunshine is thorough, professional, and reasonably priced. They will fix it right the first term. Their scheduling is flexible and they arrive precisely when they say they will.","useful":0,"funny":0,"cool":0},
{"review_id":"dEtdH57j2rjPxkffJjNhqw","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"OASX1Yrgq_7R1PsYpixRcw","stars":4,"date":"2017-06-15","text":"Good food at a reasonable price... all the staff at this location are very pleasant... they answer the phone quickly","useful":0,"funny":0,"cool":0},
{"review_id":"iMGnnjVJEctog1fwPYfIlw","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"8WCG4rs5o2rfwz0NvKshZw","stars":5,"date":"2017-06-15","text":"David and all the people at Innovative Pool Systems are a pleasure to deal with. It is a family business so rest assured you will know everyone that is coming in and out of your property. The quality of their work is top notch. I got multiple quotes before selecting David and his team and I can honestly say that he was the only one I didn't feel was trying to take advantage of me during the process. (FYI this is not my first pool install or remodel) I read a lot of reviews on here about lack of communication but to those people I would suggest you educate yourself on the process of the job you are requesting someone perform for you. Be an engaged home owner and do your homework. David is easily accessible and returns a phone call or text shortly after receiving it. In short if you know what you are asking for and you want quality work with someone you can have a honest discussion with then Innovative is the way to go.","useful":0,"funny":0,"cool":0},
{"review_id":"UQfbJo1xfJUAR105-eEhew","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"RQTatUj2f9Nz9JViTH4aAQ","stars":5,"date":"2017-06-15","text":"Took my wife here for our 1 year anniversary. The view from the patio is exemplary. The service is top notch and the food is absolutely delicious. They have a good wine list. Recommend the lobster bisque soup as your first course.","useful":0,"funny":0,"cool":0},
{"review_id":"Me7OKxIXWmVXoGOpgDOG1Q","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"RwlumSqNBunw1a1LXccN8A","stars":4,"date":"2017-06-15","text":"This is my local breakfast spot. My daughter and I come here at least once per week. All the waitresses know us and our order. They come by and say hi to her and play games with her. The food is consistently good. If you want a great mimosa or to try something a bit different a brewmosa.","useful":0,"funny":0,"cool":0},
{"review_id":"kjdo7k_Jn_kcJuyr2iVzEg","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"_Ggfchx5t3KYZOWu5N3y-A","stars":5,"date":"2017-11-28","text":"Just got a beautiful yellow lab for my little princess for Christmas! Kelci was awesome! Definitely come here for if you want find your future furry companion and see Kelci! Here's to my daughters new best friend!","useful":0,"funny":0,"cool":0},
{"review_id":"Vlb_RHHQAERGl4OEc7wWNA","user_id":"117De4KPhmtzAXpXzwrNfQ","business_id":"n8fGqb4CCheGyWtr9KM6qw","stars":5,"date":"2017-06-15","text":"Absolutely love eating here! My wife who I would say is very picky with food has never had a dish she wasn't thrilled with. They make a special cheese ravioli in Alfredo's sauce for my 2 ye old every time we come. The waiters know us by name and we love the complimentary Amaretto after dinner. Atmosphere is very casual but ambiance is romantic. This ristorante is perfect for any occasion.","useful":0,"funny":0,"cool":0},
{"review_id":"bP9x4FSH82ontEJhiP-BRA","user_id":"CB0GJlMX_-MSD5i9wL-_Cw","business_id":"BvV9SSaQhC4fvpC3XyQjjA","stars":4,"date":"2011-07-16","text":"Stopped here for dinner when passing through the area. Very good, Authentic, home-made Italian Food by local owners. Prices were reasonable, too....","useful":5,"funny":1,"cool":1},
{"review_id":"uN_4COlINvlYsP2EfYJnug","user_id":"kX-uV-eJ_Nc5nkgOx0ENCw","business_id":"bGoGHSWHvhftHMWWxQXYbw","stars":4,"date":"2013-11-19","text":"Omg! This place is very modern with a hint of old school style, beautiful earthy colours make you feel relaxed and comfortable. The music here is very rustic and in Greek so I don't understand a thing! But hey who cares if it sound good I'm not gonna complain. The lamb here is quite scrumptious! Btw I normally hate lamb because of the gamey wild taste and foul oder the meat has. I had the mussels and vegetables in wine sauce as a starter and I found it mediocre but I would come back to this place and that's says a lot. Service is good and food came out quickly. Definitely a hidden gem on he danforth that I never tried before :)","useful":0,"funny":0,"cool":0},
{"review_id":"S25wiT0Zw77vqeCd_-lZwQ","user_id":"ztOev7W5XvNzQU7asiKiXw","business_id":"qYMnY_A5Qh5wpK26TnfKGQ","stars":5,"date":"2010-09-09","text":"So I sent these to a client in D.C. and paid more for shipping than I did for the chocolates, but they're damn impressive and they taste fantastic.  I think it's a classy gift for those people whom you know who like sweets.","useful":0,"funny":0,"cool":0},
{"review_id":"IglwW1eN7rbcN0l57ZnlHA","user_id":"poTLAUysIxd_qCqX90fwkQ","business_id":"sOYsxYYFl03PhHmz_rBDZQ","stars":5,"date":"2014-08-31","text":"this place is truly a hidden gem! \n\nfirst of all, the decor and atmosphere creates an amazing intimate ambiance that is original and unmatched in local restaurants in Las Vegas. the style is eclectic and the music suites this place perfectly without overpowering customer's conversations. \n\nsecondly, the food is fantastic! the seared diver scallops were beautifully cook and the spicy seafood pasta was phenomenal. \n\nAndy, the part owner\/manager was very gracious and took great care of everyone equally. the customer service here is better than the 85% of the restaurants I've been to on the strip. I would sincerely recommend 'the sparklings' for that reason alone!\n\nthis place has the ability to accommodate any sized party wonderfully and I am definitely coming back and recommending it to everyone! it's simply fantastic","useful":2,"funny":1,"cool":1},
{"review_id":"RYd99o14eeATFUeFa8SVzQ","user_id":"poTLAUysIxd_qCqX90fwkQ","business_id":"5_ymZOB8eIfi6nzzL5-SbQ","stars":5,"date":"2015-05-26","text":"I came in with my sister on Memorial Day. being women who work in the industry and experience dining at it's finest, this place is a gem. chef Eric was kind enough to come over to the table, not once, but a few times to check on how the food was and even let us try something new he was working on. we are coming back especially for chef Eric and the rest of the friendly staff.","useful":0,"funny":0,"cool":0},
{"review_id":"rMbF2npWhrTmMk1BPTKUHw","user_id":"vuTMJH3wOS-cTIgda6UAOw","business_id":"dUffgo9Lh_Vk9TLuFR5ywg","stars":2,"date":"2008-11-11","text":"Oregano's is OK. The pizza is passable but not a million miles from a toasted lavash cracker, the beer is all right, and the pizza cookie is pretty good (it's basically a cookie half-baked in a deep-dish pizza pan). \n\nThe problem with Oregano's is that it's something of a victim of its own success. They don't accept reservations no matter what the occasion, and there's almost always a wait. I've yet to figure out why, because it's really not all that. Unfortunately, I have friends who like it, and my polite requests to go elsewhere aren't always properly considered.\n\nOregano's relies on gimmicks--swing music, gigantic menus that are awkward to hold, and cutesy names for the pizzas. Sports fans take note: There is no cable TV.  When I  politely asked if they could turn on the Suns game (this was playoffs time, mind you), I was sternly told that Oregano's is not a sports bar. God forbid anything should distract customers from the frighteningly chirpy wait staff. \n\nSo after waiting a good long while to be seated, expect to be led through a gauntlet of manufactured greetings and well-wishing on the way to your table. If you're particularly unlucky, you may be served by the effeminate robotic waiter who avoids eye contact--he manages to be chirpy and rude at the same time, the worst of both worlds. I think he's worked there for a long time. If you veer off script, his head just might explode.\n\nI'm just too damn cranky for this overrated pizza joint, I'm afraid.","useful":2,"funny":1,"cool":2},
{"review_id":"xYEeGpw_rBlc4AXiD050Gg","user_id":"vuTMJH3wOS-cTIgda6UAOw","business_id":"_jTULkoQIqb9nvitg2dIXg","stars":3,"date":"2008-10-07","text":"I'm of two minds about this place. I and my man have been going to Shady's on a somewhat regular basis pretty much since it opened. \n\nThe bartenders' level of vanity is bewildering. Weezer typically chats up anyone other than the customer he's serving. His sidekick, Mr. Facial Piercings, looks at you like you just kicked him in the balls and he's waiting for the pain to register. I've yet to determine the deal with this increasingly shabby treatment. I suppose the attitude could be based on mistaken identity. Speaking of attitude, a new bouncer \/ ID checker \/ empty glass collector was hired within the last year. He is young and angry with a shaved head and looks like a live-action mug shot. He does not speak. He looks as if he's about to murder someone and gleefully dispose of the remains in a shark tank. Given his colleagues, I can see why.\n\nRemoving the staff from consideration, Shady's is a cool bar. The draft beer selection isn't huge, but they do have Stella, and a number of decent imported canned beers w\/ the widget. The mixed drinks, by all accounts, are quite generous. The jukebox, excellent people-watching, and continuous showing of an interesting assortment of movies on a few small TV screens (w\/ subtitling) throughout the bar are other highlights.\n\nMan, I wish the bartenders weren't such self-regarding dickwads, because Shady's does have much to recommend it.","useful":1,"funny":1,"cool":1},
{"review_id":"uwDpMjmgIE7oWUYyln39bQ","user_id":"vuTMJH3wOS-cTIgda6UAOw","business_id":"AzYkEcENi7I1DsR2iushEg","stars":4,"date":"2009-05-15","text":"Nice rolls. Delicious mini-streudel. Tasty homemade pretzels. Rye bread is well represented. However, I don't really like rye bread, so I'll have to leave the rye bread review to someone else. \n\nThere's a small grocery section with really overpriced stuff. A box of European coffee (I'm not sure if it was actually from Germany) was something like $12. \n\nThe ladies who work there are friendly for the most part, if a little moody. Mostly I go for the rolls.","useful":4,"funny":0,"cool":2},
{"review_id":"BMiickg9uO298HYcGi4kOg","user_id":"vuTMJH3wOS-cTIgda6UAOw","business_id":"wcNvlrB5xSxzXex2M3UyvQ","stars":4,"date":"2009-05-07","text":"A less pretentious place you will not find in the Valley. Good assortment of beer on tap (including my current favorites, Sierra Nevada Pale Ale & Widmer Hefeweizen), and every night they have a different beer special for $4 in a giant mug. A giant mug of decent beer, that is--none of this Extra Lite Carbonated American Urine stuff. I think they regularly have a bottled beer special too. \n\nThe people-watching is good. On the weekends, expect groups of shrieking ladies in their 40s w\/ excellent 1980s hairdos being ogled by middle-aged guys with large, round stomachs. \n\nOther entertainment includes a pool table, table shuffleboard, and many flat-screen TVs w\/ sports. Bonus: We ended up there on a Saturday night during karaoke and were treated to a guy in his mid-50s belting out \"I wanna fuck you like an animal!\" with great enthusiasm. I hadn't expected that when we left the house for the evening.\n\nThe food is basic but edible. Apparently they have a 10-inch burger. I find the idea somewhat nauseating, but I suppose it would be money-saver if divided among several people. It's important to line your stomach with a big slab of protein before downing big $4 mugs of beer, one after another.\n\nService-wise, the bartenders are quite good, but table service is hit and miss, particularly if the place is busy.","useful":0,"funny":0,"cool":0},
{"review_id":"YgtEC2GiHPX-XUIh5x2OuQ","user_id":"vuTMJH3wOS-cTIgda6UAOw","business_id":"AwcNjlTqWBObQ9XXCFpg2g","stars":5,"date":"2011-04-11","text":"I decided to give Paradise Carpet Cleaning (i.e., George) a call after reading all the excellent Yelp reviews, and I must concur: George is great. He returned my call within a couple of hours, showed up right on time, and did a great job on the carpets. It wasn't the easiest job because I live in a fourth-floor unit, but he figured out a way to get the hoses and whatnot all the way up here. The cost was quite reasonable, and he was very nice.","useful":0,"funny":0,"cool":0},
{"review_id":"k3WWLjg6dyxMq1Gk0WcmXw","user_id":"R-UW_ahZi_g1RVZZWYGc8A","business_id":"R-DCYO_bEIPskFvhNLfeAw","stars":5,"date":"2016-07-02","text":"Best selection, great staff, perfect location....what more could you ask for? With the biggest humidor in Toronto, there is always something new to try!","useful":0,"funny":0,"cool":0},
{"review_id":"UBXnINOztgKl1IxDw-yx7w","user_id":"R-UW_ahZi_g1RVZZWYGc8A","business_id":"C4UWgrpXE2lZVc_BQwWQjg","stars":5,"date":"2015-02-05","text":"Being a very particular about my cars, I am exceptionally pleased with the work that Avenue Collision did on my X5. While there were some issues at first with the replacement of my doors, John and the entire crew at Avenue did not stop until it was resolved.....to my satisfaction. They were accommodating in every sense of the word. From picking up the car at my house to scheduling a time for me to come in with it to work through the pain staking process of getting the car perfect and just the way my BMW should be. Their commitment to great customer service is what sets them apart in their industry.","useful":0,"funny":0,"cool":0},
{"review_id":"wfE-ixcVO5k-AwZGL_70rA","user_id":"kYhe1d9BwVkWsJ5WR5e1WQ","business_id":"kUQwaqwxKlScAQNhRx2_2w","stars":5,"date":"2016-03-23","text":"One of the best places to eat on the strip. Everything on their menu is delicious, especially their chicken fingers. Great people and great food, how much better can it get?","useful":0,"funny":0,"cool":0},
{"review_id":"-3AU0Gsz_l0PqEtGao_Nsg","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"sUTgw9d2-OkYSRmF0wK75A","stars":3,"date":"2017-11-06","text":"At the outset, excellent service - very frequent and attentive, but not disingenuous or perfunctory.\n\nAs a group of 6, we ordered various dishes to sample:\n\n- one whole chicken: excellent; tender and moist\n- one whole Uncle Ray's Seoul Brother Fried Chicken: tender and moist with some spice and kick\n\n- Truck Stop sandwich: decent hot chicken sandwich entree; open face pulled chicken sandwich with gravy and peas; the gravy is really heavy on the black pepper; the bread is thicker than Texas Toast (but not toasted) and the chicken was tender; though I like peas, they didn't do anything for me for this dish\n- Lightning Chicken plate: super spicy battered chicken on thick bread; for spicy food fans, this takes it up a notch and can clear your sinuses; tons of batter, but otherwise the chicken is again nice and tender and moist\n\n- Butter Lettuce Salad: excellent salad; great complimentary flavours with the rich dressing and good serving size \n- Poutine (Triple Cooked Fries): average; cheese curds and gravy were sparse and could have used more\n- Spit Fired Sweet Potato: excellent side of 4 small servings; very soft and gently sweet; \n- Mikey's Southern Coleslaw: nice side, good portion size; not too creamy and subtle flavours\n\nTriple chocolate brownie: chocolate brownie with chocolate sauce and chocolate ice cream that's excellent for the chocolate lover; the brownie was nice and fresh and the ice cream was great; loved everything except for the sprinkled salt\n\nThe mains and sides came in skillets and I liked how they provided small tongs to everyone for easy sharing.\n\nAll in all, decent food and excellent service - great first impression.","useful":0,"funny":0,"cool":0},
{"review_id":"oog_mIUSzV1lUyn6yAXTSw","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"FJMMPL3pxAPYGEPB0Hwlhw","stars":4,"date":"2017-06-25","text":"We had reservations with a group of friends on a Saturday night for 5:30pm and the timing was perfect because this restaurant was incredibly busy as the night wore on - not sure if it was because of a typical summer Saturday night or the tourists because Toca is located in the Ritz Carlton.\n\nAlmost everyone had the tasting menu (foie gras, a lobster pasta, beef cheek and chocolate ganache) and I would get it all over again.\n\nThe foie gras, though rich, was balanced by toast and get this - a red onion sorbet. The combination was the most bizarre-sounding yet one of the best I've ever had. The sorbet was sweet and cold with a red onion twist. And initially, it seemed strange with the hot and cold, but it was perfect. The lightness, sweetness and tartness of the sorbet counter-balanced the fois gras. If I could go into a Baskin Robbins and ask for a red onion sorbet I would. I could easily eat 10 of these. The only other appetizer that can rival this for me is Michael Mina's tuna tartare.\n\nThe lobster pasta was nice and light despite being pasta. The serving size was just right, giving me a great taste of it but not over the top so that I felt uncomfortably full after (with not enough space for the rest of the menu). They gave a good-sized lobster claw and with the al dente paste, perfection again.\n\nThe beef cheek was incredibly tender - cooked just right. It was tender and juicy, on a bed of potato mash and gravy. I love beef tongue and the texture was similar, except it was a thicker meat. This was also very rich.\n\nLastly, the chocolate ganache was lovely as well. The coffee grinds and maple ice cream were a nice compliment and the ganache itself, light and slightly rich. \n\nSome friends also had the wine pairing ($95 for the tasting menu and $45 for the wine pairing) and the wines (including an icewine at dessert) they said were perfectly complimentary. They said the chianti served with the beef cheek was just right.\n\nMy husband was the only one not ordering the tasting menu - we were told that the signature ravioli was one of the best dishes so he decided to get that. He loved (and so did I). I would come back and try that as my main next time.\n\nThe service and atmosphere here were bar none. The server thoroughly explained each wine we ordered (including the single servings) and when our food was brought to us (we were a party of 8), there were 3 to 4 servers who laid our food down so that the rest of the table wasn't always kept waiting. Even as one of us went to the washroom, a server just passing by would pick up our napkin left on the seat and fold it nicely, leaving it back on the table for us. \n\nI'm so glad we came here and I would definitely recommend this restaurant and come back. We're told that the breakfast (particularly the scrambled eggs) are excellent, so that may be something we'll try as well.","useful":1,"funny":0,"cool":0},
{"review_id":"2HtKnOyjDKeIoJA8jr_7dQ","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"7dwz8CKjFDRDW5pUccfgpg","stars":5,"date":"2015-03-10","text":"We would go with All Night Long Entertainment again in a heartbeat and highly recommend them to anyone considering their services.  Jeremy Wolff was our contact throughout our planning stages and he was always very responsive and accommodating.  My husband and I went back to Vegas about 4 months prior to our wedding to meet with them and get a feel for their energy and they were great and easy to talk to in person.  At our actual reception, our DJ was Tom and he was, by far, one of the most professional, attentive and all-around nicest people we dealt with for our wedding.  \n\nWe are from Toronto, Ontario and brought 103 guests with us to celebrate our wedding and marriage at Caesars Palace.  Of course, our ceremony was one of our main priorities in terms of ensuring that it went smoothly, but our reception (the food and music) were of utmost importance as well because so many friends and family attended.  So there were 2 things that we wanted to ensure we gave our loved guests - a beautiful outdoor ceremony (thanks Caesars Palace!) and a rocking party.  \n\nTom was fantastic from his emceeing duties, to the attention he paid to our song requests, to his regular (and not bothersome) follow-up's with us throughout the night to make sure everything was going well, to being accommodating for the surprise games that our guests had planned for us.  His mixes were also fantastic and he ended the night on a super high note for us.\n\nWe also went with photography and lighting services through them.  The prices for their lighting were incredibly competitive and affordable compared to others.  And the photographer they assigned to us (Jeniffer LaRocca) was fantastic as well.  She was very accommodating, so friendly and very professional as well.  She provided us with about 720 pictures of our reception.\n\nWe also went through them for our Elvis impersonator and we was A+!\n\nOur only regret is that we wished we ended our reception later and we kept Jeniffer for the whole night!","useful":0,"funny":0,"cool":0},
{"review_id":"NPOIpBYGbYj9f7rAixln8w","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"GUXQCsnKIzSpRJcAbTT59Q","stars":4,"date":"2017-05-11","text":"I've been to this restaurant too many times to count now because we live nearby and it never disappoints.\n\nThe staff are warm and attentive, the ambience is relaxed and it never gets too loud on a busy Friday or Saturday night or during the Sunday brunch crowd - you can always have nice and pleasant conversation without loud thumping music or having to scream above other patrons.  I had dinner last night (a Wednesday night) and though it was busy (they had a huge group sitting), it was still as relaxing, peaceful and enjoyable as all of my other visits.  \n\nThe decor is modern chic with a relaxed flair - completely beautiful.  It might appear pretentious to some, but the amazing, friendly staff have always consistently made me feel warm and welcome (I never once experienced attitude by anyone).\n\nI was also there last Friday and was served by the same server, Katie, who was just as attentive, friendly and warm.\n\nBecause I'm a regular, I've tried a lot of different things (but not everything because to keep things fresh and moving, they do change their menu every once in a while).  \n\nMy go to appetizer is always the zucchini chips - fresh, light, not over fried or dripping in grease, perfect crispness and a great aioli sauce to accompany them.  My second favourite is the polenta fries (not great when they're cold, so eat while they're still warm!).  My husband loves their spicy tacos and though I hate spicy food, I did try a bit and they were good.\n\nI will always highly recommend their short rib main - the beef is so tender that you don't need a knife.  This meat will melt in your mouth and you end up needing to pull pieces away with just your fork.  It's the most tender meat dish I've ever had; also came with root vegetables, mashed potatoes and gravy - perfect accompaniments (one friend substituted the mash with fries at a different dinner and it was nice, too).  To avoid myself from having it a third time in a row, my friend ordered it (gave me a small piece to share) and this time, I had the spaghettoni with seafood.  The pesto was great and it was nice and light.  Small scallops, but good size shrimps and definitely a good serving size.  \n\nFor dessert, I recommended the carrot cake to my friend and she loved it (I had some, too) and I ordered the phyllo-wrapped cheesecake with blueberry compote (to die for).  Both the carrot cake and cheesecake were incredibly moist, fresh, sweet but not too sweet and a good serving size.  I have a sweet tooth and though I love sweets, I hate when it's overdone and they do sweets here perfectly.\n\nThough we had finished our desserts and had just been chatting for a while, Katie attentively refilled our waters and coffee without asking and her great service made the experience that much better.\n\nIn the past, some of the other dishes I've had were the pizza (flat crust - nice and light), steak and frites (nice and traditional), salmon (also nice and light) and their burger (juicy, fresh and filling).  \n\nWe're coming here again...and again...and again...","useful":1,"funny":0,"cool":0},
{"review_id":"uTYXLsiEAACgt4_7UGpT_g","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"6T8YFkN7xkGlBfLMqdp28w","stars":5,"date":"2017-05-11","text":"Agreeing with Martin and Irina's comments, it's a little local place and just look beyond the very simple set-up and aesthetic to discover the best Filipino breads I know I've ever had.\n\nThis is actually their bakery location and their pretty shop is on Burnamthorpe, so it explains the basic aesthetic here.\n\nI have enjoyed their ensaymada (sweet buns with butter, sugar and cheese) for the past few years - it's my favourite by far, especially when it's warm!  Go in the mornings!  I once picked up their party size tray (such a great deal and perfect for a BBQ, party - I ordered this one for a work event and heads up that if you're doing this, you have to order at least 2 days in advance.  Needless to say, everyone at work went berserk for it).  I've also had their Spanish Bread (yumm) and pandesal (I could finish half a package in one sitting).\n\nI do call ahead of time to make sure they have ensaymada because they go fast.  If they're out, I just pre-order for the next day.  \n\nI picked up some buns yesterday in the mid-afternoon, and luckily they had just made a fresh batch so she was so incredibly sweet to send me off with fresh buns versus the ones that were made in the morning.  \n\nAlso good to note that you should bring exact change or have a mix of coins\/bills because they don't have cash on the premises - they focus this location on the bakery operation whereas the Burnamthorpe location is more the pretty shop to peruse and purchase items.  \n\nThese people are great.  The baked goods are amazing (especially when they're fresh of course) and the staff is warm, thoughtful and accommodating.  It's definitely a gem worth trying.","useful":0,"funny":0,"cool":0},
{"review_id":"idmewiBvOp2I1jNjyN2-mQ","user_id":"pv0_1NonpTQN3n0J8QzDZA","business_id":"Snfb8_wVuswY0IdWgoWAKw","stars":4,"date":"2017-05-11","text":"My husband and our extended family (11 of us in total) visited this location and the food was great - nicely seasoned, fresh and served warm.\n\nI preferred the Captain's Boil non-spicy (I don't do spicy at all) and it was a perfect blend of flavour and spice. We also tried the mild and medium and they were enjoyable for the spicy eaters as well. The Cajun medium was spicy enough for our party, but the Garlic Butter was very disappointing - bland and borderline boring (the garlic was barely there).\n\nWe did the clams, mussels (huge), shrimps, fish & chips, chicken tenders, Cajun seafood fried rice, sides of corn and potatoes and 3 sizzling plate combos (1 with rice and 2 with udon; fish and chicken). Note that for the sizzling plate combos, you only get the additional seafood before 4pm.\n\nEverything was excellent. Definitely get the rice (so good) and it'd be perfect to go with a pound of shrimp and a pound of mussels (or whatever) between 2 people - just enough. FYI re: the sides - when you order corn, it's just one piece of it (not a whole corn on the cob - probably just a third), but the potato servings are big. Contrary to the corn, if you order a potato, you get a whole potato and they cut it in half, so order a potato side with caution. Wish they served more of the corn than potato. And better to have the corn\/potato mixed in the bag with the seafood and seasoning rather than on its own.\n\nThe sizzling plate combos were awesome (definitely worth getting, but go before 4pm because the extra seafood isn't available for dinner). The chicken teriyaki was perfect - nicely seasoned with big, chunky pieces of chicken. The serving size of the combos are huge, so you can go with an empty stomach, share or have some for take home. The udon noodles were nice and again, provided in generous portions.\n\nThe only downside was the consistency - we had also been to the location at Sherway Gardens and it was different.\n\nAt the Newmarket location, there were no buckets on the tables to dump the garbage\/seafood shells. The server said she would come by every so often to clean up the mess for us. This never happened and made the meal particularly messy (it's already messy eating there as it is). It was actually an ongoing complaint for our entire party. The food was good, but the constant mess and piles of seafood shells overshadowed some of the positives. Also, because we ordered so much shellfish, it would have been nice to have been provided with extra gloves without having to constantly ask. So the food was good, but the service could be improved.\n\nIn relation to the Sherway Gardens location, there were buckets on the tables (thank goodness) and the service was great. The only downside here was that the food was incredibly salty to the point where I wasn't enthused about visiting another location. I also had the non-spicy Captain's Boil shrimp here and my husband had the medium Cajun mussels and all we pretty much tasted was salt. So the food wasn't as enjoyable, but the dining experience was better (and much less messy). The only reason why we decided to try the Newmarket location was because of a family event and we're all big fans of Hot & Juicy in the U.S. (same thing, but American). What I liked about Hot & Juicy was not just the seasoning (not at all salty), but that they also serve softshell crab (yummm) and the service - they constantly checked on us, brought extra gloves without asking and they even tie your bibs for you! Okay, that last point is a bit much, but the service was exceptional.\n\nI'd try Captain's Boil again, but maybe another location to see if the seasoning might be different. I'm not sure why one location's seasoning would be different from another, but I hope that anywhere we go, it will be less salty. Ideally, I would take the food from the Newmarket location and serve it in the Sherway Gardens location and that would be perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"nrnm5HT5x27Znf2b8DxJ1A","user_id":"29od6ooFUin927cO9V2RBQ","business_id":"euL4wrPoczkOBkS93pxv5A","stars":2,"date":"2012-02-28","text":"I always loved eating here over the years. Lately, it seems that the service has become lax, takeouts have become notoriously incorrect. Last night, my pollo asada had a piece of metal in it. The salsa seemed watered down. Chips tasted old and mostly scraps. \nNot sure what is happening. Macayos has always been the reliable restaurant in Tempe\/Ahwatuckee area that you take visitors to serve them good Mexican food. \nKind of bummed. Please, I hope management is reading this and save this once great restaurant.","useful":3,"funny":0,"cool":0},
{"review_id":"weFcIYhWobRyKO2LbHYtTg","user_id":"GDxwby_yKgd1reGHM16_qA","business_id":"EaDpmkkBnxPR5RjrZ0PCVA","stars":5,"date":"2014-10-13","text":"We were impressed with such a great work, integrity, punctuality, and friendly service.","useful":2,"funny":0,"cool":2},
{"review_id":"yZxJJM2XemiyzMhqRKQVLQ","user_id":"NxAoFB4I3emPyePAhy7STg","business_id":"zQrX-thIWHsIl4G9KmLy2w","stars":5,"date":"2016-07-14","text":"Ma boucherie préféré de loin, une équipe de professionnel sympathique et des viandes local à des prix compétitif, que demander de mieux? Petit conseil, essayer les côtes levées, ils sont très bonne.","useful":0,"funny":0,"cool":0},
{"review_id":"65vEJw9fwf_At320_r5SIQ","user_id":"ZY6qvHbhTnHuMn0pB7XBNA","business_id":"t5Ip9ggWaam6qAUH0WPKVg","stars":5,"date":"2015-05-29","text":"Met up here  with some friends who were in town visiting. Upon arrival the host dropped us off at a table right next to the soda machine, in the middle of the hallway. We must of showed our discomfort for this seating pretty vividly,as a gentleman quickly came over  and  insisted we'd be more comfortable if moved to a \"luxury sky box\" upstairs. We had a good laugh and we're lead to some upstairs tables  which was a 100x better seating option. (They really shouldnt seat people in the soda hallway until they have too).The meal itself was very  enjoyable, pizzas came out perfect , and the staff was very friendly, server was lots of fun.","useful":0,"funny":1,"cool":0},
{"review_id":"MVYfRAWQ-mKhbD2NQhJ9Eg","user_id":"ZY6qvHbhTnHuMn0pB7XBNA","business_id":"Wb6Q0YVcNghQ2w20hUYRoA","stars":4,"date":"2015-05-29","text":"As a coffee snob I was excited when I came across this place. Seemed pretty cool inside, nice little patio overlooking Mccormick Ranch and a welcoming decor inside.  Best part is they take their coffee seriously. Usually if you can sense the passion a place has for its craft immediately, the craft turns out pretty darn good. That is the case here,  great coffee, and what excited me also was great iced coffee, they aren't just putting coffee over ice here they take the time to do it right.","useful":1,"funny":0,"cool":0},
{"review_id":"qI_GQL8CpFmfcLmySkpVtw","user_id":"ZY6qvHbhTnHuMn0pB7XBNA","business_id":"DZpUH96f1Uomk7N8FlZLjg","stars":4,"date":"2015-05-29","text":"Grabba Green is a worthy guilt free splurge. Great atmosphere, friendly team. The smoothies are the real deal, and come loaded with fresh, colorful ingredients. The juices are 100%. I enjoy the premade elixirs they have available.  Always feel invigorated after leaving. The pricing is fair and comparable to competitors Who offer the  level of freshness you are getting.","useful":0,"funny":0,"cool":0},
{"review_id":"sBY6i1f1s72AUQb3ECEI5Q","user_id":"iGVvj008rRMyuBa0f3tGSA","business_id":"rYq0k33eJxISVP1ufx6Kmw","stars":1,"date":"2015-06-21","text":"Ordered the Mexican salad this past Saturday and was unsatisfied with the taste of unwashed lettuce. Upon confronting the waitress about this she apologize which I was thankful for. Offering to make me another which I refused due to that being a waste of food. The manager then approached me saying this was a normal complaint from people in the restaurant. Blaming it on the meat making it taste like dirt. I proceed to tell her I had the same meat on the nachos and they tasted fine. The woman clearly had no culinary experience telling me how the same meat tasted more dirt like in my salad. I having personal culinary experience in schooling and job atmospheres laughed to myself and politely just asked for the bill. On top of all this my friend had ordered a dish with the same lettuce which also tasted quite nasty. If your looking for fresh this is not the place to be. Your getting fast food quality for steakhouse prices.","useful":0,"funny":0,"cool":0},
{"review_id":"uOhh_41QjiYd4RR7YkaniA","user_id":"okhbdbWhX8jjjiromI5R7g","business_id":"BIBWGO_r_1znnlmLbp4Nxg","stars":1,"date":"2015-01-16","text":"HOTEL FRAUD! TERRIBLE CUSTOMER SERVICE! STAY AWAY!\nI had my hotel booked for me by another person; when it was booked my name was misspelled. (Spelled Darin with a B). I called the hotel to confirm that I had a reservation, while driving to Vegas, and I was told that they couldn't find it. I quickly booked another room so I had a place to stay. When I arrived we figured out the missed spelling and my original reservation was found... When I tried to cancel the duplicate night and very unfriendly lady informed me that it couldn't be done because I should have known about the original reservation... I explained the mistake with my misspelled name and I was told it was my fault because I should have known about the reservation.... They double billed me for one night... My mind was blown! I have never experienced something like this in my life..STAY AWAY!!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"glRn8AHqZbZ8nPdcZApPeA","user_id":"86JNBYIsGvTX2sOkStaYzg","business_id":"cB7FhpOwFCn380G6WGpJzw","stars":1,"date":"2017-01-03","text":"We are frequent customers (both take-out and dine-in) and today ordered take-out. Three of the containers that we picked up were barely a third full- the tofu, spicy beef and hot and sour soup. When we called to ask the restaurant about their tiny portion sizes, the female manager we spoke with was super defensive and told us \"that's not possible\". We offered to send a photo (posted here on yelp) so the restaurant could see that our meal looked as if it had been half-eaten, but the manager refused to provide an email or phone number to which we could send an image. When we mentioned that our only recourse would be to post about our experience on yelp, she hung up on us. Disappointing customer service from a restaurant that was once one of our favourites.","useful":3,"funny":0,"cool":0},
{"review_id":"X-n9AQQPx5CKKAxp8tDtBw","user_id":"Nap9nF-IbYdq1HeC5QM2ow","business_id":"2A23tPwqknI14klHK34psg","stars":5,"date":"2014-12-30","text":"I don't usually write reviews but I was so impressed by the wonderful job that Mythy did on my car. I bought a Groupon which was a great deal so I didn't have high expectations. Mythy emailed me back promptly to set up an appointment.  He took over an hour and a half to detail my five year old ride. It's beyond clean - it's shiny and sleek and smells brand new! Strongly recommend Mighty Fine Detailing to everyone. I wish he was open on weekends or evenings for my convenience, but next time I need my car detailed, I will go back to him.","useful":1,"funny":0,"cool":1},
{"review_id":"sGMDQnJ-0uLpLUodRonlUA","user_id":"x9tfZjzEmHxySDraOH8imQ","business_id":"gRCEObNuHtI61xR32ytqNQ","stars":1,"date":"2015-06-03","text":"Stayed in the courtyard for 4 nights , First room was horrible, Found cockroaches in our room was then moved to another room. Had a mixup with room service and tried to fix the problem they wouldn't have it though. Phil was very rude and racist , Told me \"do you even speak English\" found that very rude. Was planning on staying here once a year for the festival might just look somewhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"DM3lhP1Ignqa7N4h4sEgqw","user_id":"x9tfZjzEmHxySDraOH8imQ","business_id":"5SpXQTVDVLthQkPtYS-jIg","stars":5,"date":"2015-06-03","text":"Very awesome Camera shop , Very knowledgable staff and great products. Always welcoming and was there visiting and stopped by . Will come again","useful":0,"funny":1,"cool":0},
{"review_id":"smmMuL16QqIxu3PftGH32w","user_id":"FP-0AACTq4ZrkDccLJ6Uhg","business_id":"4ucJBvnGR3wa2kEgMz0C2Q","stars":2,"date":"2012-03-10","text":"Okay the food here is awesome, and would love to eat it all the time but.... they have very odd hours or are just randomly closed. I want to order from there but phone is never answered and if you call both their numbers, their voicemail is always full. \nGot take away and it was good an you get quite a bit more at a decent price, but also had a problem with that. I called in and was told forty five mins, but actually took an hour and fortyfive. Not pleased.","useful":0,"funny":0,"cool":0},
{"review_id":"ZlVlQqW4m-NsjAyAhtKaNA","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"SYE9W_JKRE2r9AVzW7q6Sw","stars":4,"date":"2010-07-10","text":"I'd taken note of this place after seeing an article in Creative Loafing--so I looked it up while in that area.  I was pleasantly surprised when I walked in (most ethnic markets I've visited are small, crammed full, and not super clean) --this one was just the opposite.  They had a small selection of sandwiches so I ordered lemongrass pork to take home.  While waiting on my eats, I decided to browse.  While they had a vast array of merchandise--anything from fresh octopus to okra, it was nicely displayed making it easy to check out the great variety of items.  I love to cook, but I admit that many of the items I had no clue what they were or how to use them.  That's what made this place so fascinating for a culinary enthusiast.  I could have spent over an hour taking in the wide variety of items --they probably had more than 20 different kinds of soy sauce alone. If you're a fan of stuffed dumplings, they had a plethora to choose from.  I didn't check out their selection of loose specialty teas--they had many boxed varieties as well. \n\n I chose a few goodies for myself --my sandwich was waiting for me at checkout, and I had a chance to speak with the owner on my way out.  Seems this place has been here for about a year and the present owner purchased it 3 months ago.  I'll definitely come back when I have more time and am not so hungry.  Fast Fwd. to home-- the sandwich is delicious!  First,  I was impressed with the quality of the baguette--it was golden and crispy on the outside and chewy on the inside.  The pork was superbly seasoned and my sandwich was stuffed full of fresh cilantro, pickled diakon, and julienned carrots.  It was quite a bargain for $3.99!  I'll try some of the other sandwiches when I'm in the mood for some good takeaway.","useful":3,"funny":0,"cool":0},
{"review_id":"4NzH-dT4iNRfM4zvzIBPjw","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"ZCsvwa_dsqNB8d8tYHPdjw","stars":2,"date":"2011-03-17","text":"I went there today to celebrate St. Patrick's Day at lunchtime.   I was surprised to see a few items on their menu that seemed more Asian than Irish, but what the hey.  I choose the Rueben Sandwich--sounded like a safe bet.  What a disappointment--two undertoasted pieces of white bread with one piece of corned beef between and a spoonful of sauerkraut on top.  I was still hungry after I forked out 10 bucks for this appetizer sized lunch. \n\nI would have thought that since they would be drawing folks in that perhaps hadn't eaten there before (I have several times over the years) that they would want to put their best foot forward to garner some repeat business.  Based on what I saw, they favor quantity served vs. quality of food.\n\nI will not be going back anytime soon.","useful":2,"funny":2,"cool":0},
{"review_id":"Ig-CQD0ZKrlMNIflEfsJMw","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"jXHmmircEbhQmZjWDR1xIA","stars":4,"date":"2010-07-26","text":"OMG, I have a new love in my life and we met at Bistro La Bon!   Too bad we can only see each other on Sundays--but it's worth the wait.  Yes, I've been totally smitten with the chocolate waffles served at Sunday brunch.  This is not to diminish the  wonderfulness of the other items served, but this is like eating chocolate air further indulged with chocolate sauce and whipped cream.  I ate mine at the end of the meal as sort of a dessert, however, it's not nearly as sweet as it sounds,.\n\nOther items I found delectable were the Swedish Meatballs, the Mozzarella Pinwheels and the Silver Dollar Biscuits.  There was a great selection of items on the buffet with plenty of options for vegetarians as well.  \n\nI'll definitely return for a rendezvous with my new love!  I'll make a reservation next time--I was lucky to get a table right at noon without one this time.  As it grows in popularity, which I'm sure it will,  reservations will be a must at prime time.  Luckily they do serve until 3 pm for those who might want to dine when it's less crowded.","useful":3,"funny":1,"cool":1},
{"review_id":"C_hSy8TgxUCJvfxZhmMpkA","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"82hYL5WPQpvxg8ekDsB83A","stars":1,"date":"2013-10-18","text":"I've been to this chain before, just not this location.  What a disappointment.  First,  I asked the server questions about a specific pizza on the menu which she readily answered.  However, when it came time to order and I ordered this pizza, I was told that the pizza oven was broken--are you kidding me???? An Italian Grill with no pizza oven--why not tell me that when I first inquired about the pizza!  So back to the drawing board, I decided on the lasagna--figured that would be a safe bet.  What a disappointment.  A portion about the size of a deck of playing cards arrived on a large white plate--creating an enormous amount of negative space on the plate--further accentuating the minuscule portion size.  Honestly, I've seen much larger portions at my child's elementary school!  If that wasn't bad enough, the lasagna was made without any cheese--no layers of ricotta between the layers of pasta, and if there had been any cheese on top, it had hardened since it was cooked the first time.  It was camouflaged with a marinara sauce. dumped on top.  Had it not been for the bread, I would have starved!  I will not be returning!!!","useful":3,"funny":0,"cool":0},
{"review_id":"MYa2qib_3xZ4neKKS8Sncg","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"AuIiqDeL65kczmiFSkAWrA","stars":1,"date":"2013-03-21","text":"Went there today for lunch with a group of 7.  Not one person had anything good to say about their food.  Even the BOGO pasta person was dissatisfied.  The restaurant was practically empty and the service was extremely slow.  I had their chopped salad to start which was described as having tomatoes, bleu cheese, and prosciutto among the ingredients.  They were so sparse and tiny that it practically took a magnifying glass to see them amongst all the lousy iceberg.  A definite ripoff and disappointment.  My entree wasn't terrible--ordered off the light menu.  \n\nEven though we specified when we ordered how we wanted the checks split; at the close of the meal, we were told by our server that their system wouldn't do that and that we should pass around the master bill and figure it out for ourselves.  After getting a manager involved and quite a lengthly wait, we finally got our totals and were out of there.  This lunch experience in a nearly empty restaurant took almost 2 hrs.  All around a huge disappointment.  I definitely won't be going back!","useful":3,"funny":1,"cool":1},
{"review_id":"KIaHpH5H-NOGNpWH5Yxx5w","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"MUIP2T5ZUUm4gvzTF0SVeQ","stars":1,"date":"2010-08-29","text":"Wow, what a disappointment.  I'd been curious about this place for awhile and decided to take a friend there for a birthday dinner.  It was a weeknight and the place was packed--but few were dining.  The outside patio had the drawing card of a live musician, inside, part of it was sectioned with a curtain which appeared to be some kind of business event going on and the other folks were the after work crowd still hanging out and drinking.  Now I see why no one was eating.  As a starter, we decided on the shrimp and avocado spring rolls(plural on the menu) which actually was one springroll cut in half--pretty cheesy. The menu was very standard fare--pork chop, meat loaf, steak, tuna, ect. without even any interesting preparations.  Without going into detail, our entrees were very so so.  For dessert their warm brownie with coffee ice cream and chocolate sauce was sans sauce and the brownie not even warm but extremely dry and crumbly.  \n\nAs for service, our server informed us that she would be tailed with another server who was in training and between the two of them, we still had very poor service.  \n\nThis is one place that I'll not give a second try!","useful":3,"funny":0,"cool":1},
{"review_id":"8IRLjBRrP5UHGYqpuQuzUA","user_id":"-jqjlvvIJNnLYhpb4ovDUQ","business_id":"lbvlltOemKzyoFOZMvoruw","stars":5,"date":"2013-08-31","text":"Was so happy that they were open early on a Sat. morning.  I'd just eaten breakfast nearby but couldn't resist stopping in after hearing about this place.  The lady at the counter is so very nice.  I brought home a guava and cheese empanada and a piece of tiramisu.  Both were out of this world.  This is definitely a place that I'll revisit often.","useful":0,"funny":0,"cool":0},
{"review_id":"Ozrcu1cXLH0cbRPdA9emIA","user_id":"OAK2DMdNneIerEdekbMByA","business_id":"Ds7Q4ix3luhMmm0kFt2xVg","stars":5,"date":"2017-06-29","text":"Laylow makes great beer and great food. When it comes to beer, they know what's up. They always keep it interesting with new beers on the menu. The food is always great, whether you're there for dinner or brunch (brunch on weekends!) They've been a great addition to the hood - beer, food, tunes, brunch - what more could you want?","useful":3,"funny":0,"cool":0},
{"review_id":"PiU_e5r0U3MRlC6eLpPBjQ","user_id":"OAK2DMdNneIerEdekbMByA","business_id":"dhvePGMLjWvl4fhk9lgxew","stars":5,"date":"2016-06-07","text":"This is the place to go if you want an amazing cocktail. The bartenders know what they're doing and you can see their passion in it. The interior is stunning and you can tell there was a lot of thought and attention put into the whole place. Love it","useful":0,"funny":0,"cool":0},
{"review_id":"cd2MEjpWfaq9uqILeBRswA","user_id":"ckUuwfjyNgr2TaOn4q_8LQ","business_id":"pIzuXtFdkj8fHuzJfYiwqw","stars":5,"date":"2014-04-10","text":"I'm visiting Calgary from Toronto for a few days and discovered Chef's Market  a short walk from the Glenbow  Museum. This place has quickly become my kitchen away from home - yesterday I enjoyed a wonderful flatbread with chicken, roast veggies, kale and goats cheese - delicious. Today I went for the fresh beef curry - with the chai latte. The curry flavour was complex and authentic -the dash of cinnamon on the latte complimented the food perfectly.  I  took their roast veggie wrap and chopped salad back to my B & B for dinner. (Hate eating out by myself). As one fellow diner said, why go looking for greasy processed food from the food court when you can watch the chef throw together the ingredients and make something healthy and \nfresh. I couldn't agree more. Congratulations and good luck to Nuno and his crew!","useful":4,"funny":1,"cool":3},
{"review_id":"Y443X2AfIhoTqqSQQ4DlyA","user_id":"oIuKHLEU1AIBUM6g2AQy-Q","business_id":"s_VpeEfBsG-sGg6Vyq8afQ","stars":4,"date":"2014-07-15","text":"Arguably one of the best pho restaurant in Montreal. Portion slightly smaller than other competitors for x-large size. Very quick service.","useful":0,"funny":0,"cool":0},
{"review_id":"29GRv1JxeJQil-pBlEKmbw","user_id":"YWWV3U6URAw4zrHET0ReBA","business_id":"5qc1Xv36E36DF6zCBG51Cw","stars":5,"date":"2017-06-23","text":"I haven't cut my hair in 12+ years and was nervous about how my drastic makeover was going to turn out, but the staff made me feel so comfortable from the moment I stepped in the salon. Excellent hospitality all around and my hairdresser had a great vibe to her. She answered all my insecure haircut questions professionally and with humor! Would recommend this salon to all my friends. Thank you, Hannah, for the great haircut and for the wonderful salon experience.","useful":0,"funny":0,"cool":0},
{"review_id":"yY6jcVCaXVzK10Hwth0Uuw","user_id":"svEJeBA4ZAJK8qvph6PJuw","business_id":"uoZwJJaplLsktVrRw0JiQw","stars":2,"date":"2016-11-29","text":"It's just not right Thai Food \/ Vietnamese combine ? Thai food just doesn't go with it","useful":0,"funny":0,"cool":0},
{"review_id":"4zRYAENBqIorVuAvfoFfag","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"WGkqfp1-3130v8xhCb3APg","stars":1,"date":"2013-06-23","text":"Whaaaaaaat a disappointment. Maybe it's my fault. I dont know why I expected a good taco from a place that calls itself \"Silly Taco.\" Silly me.\n\nThe meat in the steak taco felt like it had been cooking for four days. DRYYYYY! It tasted like nothing. No, that's a lie. It tasted like salad. There was a pound of lettuce and tomatoes on top of my steak taco. Who the eff puts salad on a taco?\n\nThe beans on my bean and rice taco were DRYYYYY and tasted like windex or something. The rice was nothing more than Uncle Ben boil in a bag white rice.....no cilantro\/lime no cumin\/tomato. No salt even? Geez. \n\nI asked for soft corn tortillas, because what self-respecting taco-eater eats anything else? I picked up my taco and the shell split down the center and my pound 'o salad fell out into my dish. Duh. I guess I had to ask for WARM corn tortillas. Who makes tacos, calls themselves \"tacos\" and does not know how to properly assemble a taco? Taco Tontos. That's who.\n\nSalsa verde and some other sauce I got were alright (must have been pretty great if I can't remember what it was!), and the waitress was very nice. \n\nBottom line: this place SUUUUUUUUUCKS.","useful":2,"funny":2,"cool":1},
{"review_id":"AeEE8kw49vp3YyOYhPsYog","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"4qCYRklxSuTdN2z6dC2KeQ","stars":1,"date":"2012-09-07","text":"I remember going here a few years ago and hating it. But i couldn't remember why. I went today with my mom and sister, and now I remember: the food was terrible and the staff was unimpressive. \n\nI ordered bacon, eggs and hashbrowns with toast. I asked for my toast to be plain, but it came out with a \"yellow flavoring\" making it greasy and soggy. My eggs were cooked properly overeasy, I appreciate that (hence the second star in my rating). My hashbrowns had no color on them whatsoever. They were just greasy and mooshy, there was a puddle of grease underneath them. My bacon wasn't cooked crisp, and maybe it is a personal preference, but I don't like it when the bacon fat is still soft and chewy. \n\nI only ate my eggs and toast with the weird fake butter on it. The waitress noticed and asked why I didn't eat. I told her it was a little greasy for my taste, and she said \"what do you expect it's breakfast food?\" So it's my fault, I guess.\n\nMy mom mentioned how bad my breakfast was to the manager (?) and he told me I had picked a bad time of day to order breakfast and took about 2-3$ off our bill. (My breakfast was 7$). So again, I guess it was my fault for ordering something off the  ALL DAY BREAKFAST MENU at the wrong time for him.\n\nEveryone else there looked like they loved their food, and they all looked like regulars. I was uncomfortable in my chair and it was too loud for me. I won't be back. Somehow I don't think they will care.","useful":3,"funny":2,"cool":1},
{"review_id":"1rQ0T_yzjoWIBDBbmFoIWA","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"T8xMrEv3s3NvSm7Qtmbxvg","stars":1,"date":"2013-06-23","text":"I love cheeseburgers. I mean really really really love cheeseburgers. I don't love peeps with my patty. I don't want peanut butter smeared on my donut bun. So I ordered a freaking cheeeeeeeeezeburgrrrrrrrrrrr. What did I get? Grill marks on a bun. That is all it tasted like. Grill marks. That's all, I'm done.","useful":0,"funny":1,"cool":0},
{"review_id":"Q0h8Kgf5F1YsdRhNU1XVsg","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"0S4mVrhhSfTsKRtBF_W_BQ","stars":5,"date":"2013-10-15","text":"Somehow I always manage to stretch my birthday into a three-week event..... Tony's Southside was my absolute favorite of all my birthday dinners this year!\n\nWe ended up getting a couple cocktails, meatball appetizer, three pizzas (my favorite was the prosciutto and hot peppers), a beer, glass of wine, dessert and one cup of coffee. The bill was almost $100. Although I wasn't the one footing the bill that evening, I can honestly say that this place is worth it! \n\nThe ambience and the homey-friendliness of the husband\/wife\/sister running the place was incredible and the food was so great. They use a Sunday-style meat sauce rather than pizza sauce which has so much depth and pairs perfectly with the sweetness in their pizza dough. I am drooling remembering it. \n\nKeep in mind, their pizza is not meant to be scarfed down but savored and appreciated; there is so much flavor and texture going on. I can't wait to go back for more.","useful":1,"funny":0,"cool":1},
{"review_id":"F9cKYiWfQJkqhVLzARMn0Q","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"OXcK4sbPpLF27b-_79BXKw","stars":4,"date":"2013-06-23","text":"Okay. I'm generally a love-it or hate-it girl. Last time, I was so not impressed. But I've been back a few times and the boys and girls working have been much more friendly, and my drinks have been tastier, and the new owner let me try the new hummus she will be putting on the menu. She was super nice and ill be happy to go back to support her business.....I'm also curious what other changes she will make to the menu. Thank you for saving my coffee stop!","useful":2,"funny":0,"cool":0},
{"review_id":"3k5ndfvGaLV66JxdD4gfbA","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"D31JSfofD0dYbIx7Yak2Yw","stars":2,"date":"2014-04-24","text":"I had my choice between this place, Yours Truly and First watch. I picked Scrambler Marie because I haven't been there before....bad choice. \n\nWe stood at the hostess stand and several people walked by without even looking at us let alone saying \"hello\" or \"someone will seat you soon\" so we justs stood there for awhile. We were finally seated and offered coffee and OJ.\n\nAbout ten minutes later (they didn't seem busy compared to how much help was walking around) our waitress showed up with coffee and juice along with another girl and they literally twirled around each other to set a pot of coffee on our table and the table next to us. She apologized for the wait and took our order. \n\nI got the Mini Classic which was supposed to be eggs, bacon and a mini pancake, and my boyfriend got an omelet with sausage gravy (sounded gross to me). Our food was not good. It wasn't in edible or anything, just not good. And my breakfast was enormous with two huge pancakes......I don't know, having that much food in front of me is nauseating. I ordered the \"mini\" for that reason.  The waitress only came back one time during our meal and asked us how our food was, but she was facing the other table, and then we sat for a long time waiting for our check after we were done.\n\nWhen we left, no one near the exit said goodbye or anything. I don't need anyone to kiss my butt or anything, but it was just a very unwelcoming place. And the food isn't worth leaving your house. \n\nStay home and have a pop tart, it doesn't say hello either and the quality is about the same.","useful":3,"funny":3,"cool":0},
{"review_id":"1icbITYtpFTWu-fynTUGVQ","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"Pnv-BffVgfQmXb8y_DEWMQ","stars":1,"date":"2012-08-23","text":"I should have gotten a hot dog.\n\nMy boyfriend and I were headed to Happy Dog, but at the last moment I decided I just didn't feel like a hot dog. So across the street we went to Latitude 41 N.  \n\nAfter being handed menus, we were already uneasy about our decision. The menu makes no sense. There are bar-appropriate appetizers, salads, pizza, pasta, sandwiches, burgers and breakfast. Oh, and smoothies were advertised on a chalkboard on the wall. I already knew this place would be bad since they didn't seem to specialize in anything. How could they execute well if there is such a broad (un)focus? \n\nWe ordered the artichoke bake appetizer, chopped salad and southwest quesadillas. I also ordered a mocha smoothie.\n\nArtichoke bake: Uuuuuuuuuuuuugh. Gross. It was sorta sour, had about nine artichoke leaves in it, and had more cheese on top than anyone needs to eat in a month. My boyfriend said the cheese was choking him when he swallowed. It was served with \"crispy tortillas,\" but really they had a weird malleable cardboardy stale texture.\n\nChopped salad: Eeeeeeeeeeeeek. Ick. It looked slimy. It wasn't, but it looked slimy. It was shredded lettuce, tomatoes, a little bacon and a little bit of cheese. It was already mixed... I guess I like my toppings on top in a pile so I can pick up what I want in each bite. The balsamic dressing didn't taste like much. They offered seasoned bread (which I asked for but didn't eat) or fried dough. I asked what fried dough was and the girl said it was pizza dough deep fried with sugar on it served with cinnamon-sugar butter. Basically a donut, she says. WTF? Why would I want cinnamon donuts with a salad? How dumb.\n\nSouthwest quesadilla: Ehhhhhhhhhhhh. Blah.  This had no flavor. How gross is it to chew something, get it mooshy in your mouth and not even taste anything salty or greasy or meaty or anythingy??? The description said there was chorizo on it, and I saw it, but couldn't taste it. \n\nMocha smoothie: It tasted like a frozen international delight. Made with a powdered mocha mix. What more can I say?\n\nThis place tasted like Applebee's is it's hero.\n\nThe girls working were very nice, I can't say anything bad about them. But, we were asked if we wanted our artichoke bake first as an appetizer, which we did, and all the food came out together. Minor goof in my book.\n\nThe absolute WORST part of the experience, was the 40-minute drive home. We couldn't get home fast enough, if you know what I mean.................\n\nBottom line: if you have to choose between hunger and Latitude 41 N, just go hungry.","useful":1,"funny":0,"cool":1},
{"review_id":"btDWwp5v2IMr1xUklxdToQ","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"K6fYrrTorlpXmqutRcrHzg","stars":4,"date":"2014-06-06","text":"I don't drink beer, so I just get water. It's pretty great water. All my friends tell me the beer selections is even better than my water.\n\nI love their food! Burgers, chorizo tacos, pork belly nachos! MMMMMMMMM!!!\n\nThe patio is relaxing, inside not so much.","useful":0,"funny":0,"cool":0},
{"review_id":"aegl_4q9dA6iNNWAV8P06A","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"h39PkiW3Zt0N_syoRsKbGQ","stars":3,"date":"2014-04-24","text":"Ehhhhh.... This place is okay. It's clean, the server was sweet, the food is decent. It's definitely better than Don Tequila or El Rodeo, but I love El Señor in Painesville for my authentic Mexican. \n\nWe had chilaquiles (soggy), tamales (unmemorable), tacos (the pastor was tasty). The green sauce on the chilaquiles, red sauce on the tamales and the salsa for the table was all tasty. I'd go again if invited and be happy, but I won't make the Thierry minute drive to come back on my own.\n\nThe food is definitely quality, just not the best I've had.\n\n.....oh, and the tv was way too loud. Sit far away from it!","useful":0,"funny":0,"cool":0},
{"review_id":"pYamjNQ3KBbysYIxHucr3g","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"Mk7ptSIjvcBPfCLf4PNGWA","stars":5,"date":"2014-04-24","text":"This is the best authentic Mexican in Cleveland. Hands down, there is nothing that comes close. It is the standard to which I compare all other Mexican food. I can't get enough of their chorizo, and I always leave with some from the grocery store so I can cook it at home later in the week. The pastor is another favorite of mine, and every sauce on the table is outstanding...great flavor, great heat. \n\nIt's totally casual and there are only a couple places to sit, so it doesn't have fancy atmosphere going for it, but it doesn't need it. El Señor is the best, and the grocery store, La Mexicana, which it is tucked inside of, is great too!","useful":3,"funny":0,"cool":1},
{"review_id":"nqkE_-HEL15tzSa3lYmhDA","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"bhwWkioO5ROkyYQhABESfg","stars":4,"date":"2014-06-02","text":"My cousin and I stopped in for brunch a couple Saturdays ago. We were seated right away and our waitress was nice. I notice a bunch of the reviews complain about the service here. Can't say I experienced the same poor service, but we weren't very needy that day.\n\nOur food was awesome, and that's always most important to me. We shared a salad with fried goat cheese on it and an eggs benedict-ish thing with crab cakes and fried green tomatoes. YumEEEE!\n\nThe coffee was pretty decent and made us want dessert, but they were out of just about everything on the desert menu. So that sucked, but I'm looking forward to going back for dinner soon.","useful":1,"funny":0,"cool":0},
{"review_id":"BCw7F4-_-rlTVu3p3jkYYA","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"ss978X4omzcJjIeq6K-kag","stars":5,"date":"2015-10-25","text":"Vero has come really far in a short time. It is not nearly as awkward as it had been in the past when they were first opening. The food is always incredible, you can't go wrong with any of your selections. \n\nA few months back we ordered a cheese and meat appetizer and there was honey made from blueberry flowers WHAAAAAT?? Delicious! I inquired where to get this honey and apparently it comes from the dishwasher's uncle's apiary. I guess what I'm trying to say is these people don't mess around with their ingredients. \n\nDon't ever go here if you are in a rush to go somewhere, they will probably make you late. Settle in and enjoy your experience at Vero.","useful":0,"funny":0,"cool":0},
{"review_id":"6Eda2BJEbfmywc7a-ZxT1A","user_id":"-x5EfjCVUxGX1NGbDabglw","business_id":"0uwQIGlKICIYuRtayVnh7g","stars":2,"date":"2014-06-06","text":"What happened to this place? It was so amazingly unexpectedly delicious when it first opened. Now, the people are not nearly as nice as they used to be and the piadas have gotten so sloppy they're not that appetizing to eat. Piada please fix yourself!","useful":0,"funny":0,"cool":0},
{"review_id":"CnL8T4bxvw9FM4_NzUSN8Q","user_id":"jPgaSH_OEX1wYpZFcsX_8Q","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":1,"date":"2017-01-01","text":"This place sucks to much people lots of time waiting for costumer service it's just sucks","useful":0,"funny":0,"cool":0},
{"review_id":"-dWd6RcUiG5yDtCIDPCYrA","user_id":"9GcGbH1batgsB-ZEPr0TjQ","business_id":"mbLguBsFuy34zKlor2xcIg","stars":2,"date":"2012-08-29","text":"I actually enjoyed my stay here, very good value for the dollar. Being a Hilton Diamond club member, I was looking for a Hilton property to boost my points. What I didn't anticipate was that Hilton would sell my cell phone number to every sleazy time share operator across the country so that I would be receiving calls from Florida , Nebraska , California and elsewhere on a near daily basis. I haven't stayed at a Hilton property since.","useful":1,"funny":0,"cool":0},
{"review_id":"rlSja0_-XKuHXDODiLAwqA","user_id":"jLNdCQBNw-FvxO4wJb-vVg","business_id":"NMuTBEDmBKj3pwSm3_RCcA","stars":5,"date":"2015-01-17","text":"The staff is super friendly and the store is always clean! The gas is cheap and the customer service is excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"ImmEteazbwKHmViyAMrx9A","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"szUlmJA4MfIhi7xbtsQPYQ","stars":3,"date":"2016-12-13","text":"Madhatter is located just off of State Street. Although the venue lacks personality and is fairly small, they have good drink specials. I did not order any food while I was there, but their menu includes mainly pub food and a variety of appetizer options. This restaurant seems like a good place to go if you are looking for a place to catch a game and avoid the more crowded bars.","useful":0,"funny":0,"cool":2},
{"review_id":"7ZI5O3k9hfdVmri1KKO54A","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"JUZKAEK1ihMqB0x2GS90zA","stars":5,"date":"2016-08-26","text":"Whether you are looking for a late snack or groceries for the week, festival has absolutely everything you could possibly need. Prices are fairly reasonable and the store is pretty much brand new!","useful":0,"funny":0,"cool":0},
{"review_id":"IaAZ7rFPCUCjdquD60KOdw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"N3uOrQCnx_n_841Q8EwbzQ","stars":4,"date":"2017-01-14","text":"I am not a regular Hookah enthusiast, but Mediterranean Hookah Lounge and Cafe was definitely a step up from previous Hookah bars I had been to. Rather then being stuffy and full of Hookah haze, the venue was pretty spacious and vibrant. On Friday they do Karaoke which was a lot of fun. Additionally, they have so many flavors to choose from and are extremely helpful when it comes to setting everything up!","useful":0,"funny":0,"cool":1},
{"review_id":"Rnn0Jjs-EXfyX1HkB53FRg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"2akmY6-92B8y_WLs_gr65g","stars":3,"date":"2017-01-14","text":"Dragonfly is a great place to go if you are looking to try out yoga for an affordable price. I took one of the walk in classes for $5 and felt that the pace was a little fast. Rather than focusing on form, the instructor really encouraged everyone to do their own interpretation of the various moves. Be sure to check class availability online because classes can sometimes fill up!","useful":0,"funny":0,"cool":0},
{"review_id":"Pw6B_8HH_qI1Cb6iNCjb2w","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"Wcw-xq_c89e4AaRsUtkaLw","stars":3,"date":"2016-07-24","text":"When we first got to the restaurant it was extremely crowded due to happy hour. The drinks were great and service at the bar was quick, but getting a table proved really difficult. We waited for almost an hour and a half to be seated. At the bar we ordered the soft tacos which were extremely delicious. All the ingredients tasted extremely fresh, which created a unique twist to the normal Tex Mex cuisine one would expect. The rice was absolutely to die for! Will definitely make an effort to go back and try brunch.","useful":0,"funny":0,"cool":0},
{"review_id":"82cHNkUHWc-nqQTWDRy3hg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"g-kRq6VKB5ld00OOpJvaTg","stars":4,"date":"2016-12-01","text":"Greenbush Bakery is a great place to stop if you are in need of an early morning pick me up. Not only do they have a wide variety of doughnuts, but the small hole in the wall venue makes you feel as though you stumbled upon a well kept secret! The prices are extremely affordable and there is a parking lot conveniently located out front for quick trips! The only problem I had was that the different doughnut types were not clearly labeled. Although it is fairly easy to deduce the chocolate glazed from the vanilla sprinkled doughnuts, it would have been nice to have a clear list of my options.","useful":1,"funny":0,"cool":0},
{"review_id":"K3apNVQfqqVO5kXFusvluw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"DUUY9UpEbA69xhketnsdLw","stars":5,"date":"2017-01-14","text":"This is officially my favorite place to spend a lazy Saturday morning. Not only does Matcha offer a wide variety of tea options, they offer a selection of extremely unique and delicious pastries. The venue is very laid back and the service is spectacular. Each time I come here, I always discover a new favorite tea and learn something new! They do not have wifi on the weekends, so be ready to unplug and take full advantage of the best tea house in all of Madison.","useful":0,"funny":1,"cool":0},
{"review_id":"bLFL9-zZ1_8bi4n_Eaekpw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"lXrsrmIcbOstYC2vtip8ZA","stars":4,"date":"2016-09-28","text":"In an attempt to change up my normal morning coffee routine, I decided to stop into EVP on my way to work. I was a little worried about parking, but luckily there is a small parking lot right next to the coffee shop. Overall, the menu is pretty straight forward, offering a variety of classic coffee options, pastries, and tea choices. This morning there was only one barista, so the line grew pretty quick. With this being said, the service was great, but just make sure to give yourself some extra time to ensure that you are not late for work. I am most definitely going to keep this place on my list for great places to spend a Sunday afternoon getting caught up on work or reading!","useful":0,"funny":0,"cool":1},
{"review_id":"IWq7OjXi3EQuf9P15yZ2SA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"5paKcA2AAguJgZYBkr-I7A","stars":4,"date":"2016-09-30","text":"Cargo coffee is one of my favorite places to get some weekend work done. Not only do they have plenty of seating, coffee, tea, and food options, but they sometimes have live music. There is plenty of nearby street parking and a small parking garage next door. Additionally, if you prefer something quick, the E Wash location has a great drive through!","useful":0,"funny":0,"cool":0},
{"review_id":"KuPPoiRTAvT5CPzA9WGWgA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"WMpXWa8iiEaDzb4vLTZjcw","stars":4,"date":"2016-09-24","text":"Although HopCat can be extremely loud and crowded at times, they offer a draft list that I have yet to find at any other restaurant or bar in downtown Madison. I absolutely love brining visitors here because it is almost impossible for anyone to not find a beer they will enjoy. In terms of food, the options are fairly comparable to other restaurants that specialize in pub food. I would note that their service is fairly slow. If you are in a time crunch, it may be smart to find another option!","useful":2,"funny":0,"cool":0},
{"review_id":"9L9MOKuXrssrZzykYQcslA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"tkldC-ulyfr_xf8IhQAFnw","stars":5,"date":"2016-09-24","text":"After weeks of walking by the Madison Museum of Contemporary Art, I finally managed to visit for the Wisconsin Triennial. In addition to the various rooms of different exhibitions, the building itself is an absolute work of art. As we climbed up the clear staircase, we were able to catch a wonderfully unique view of downtown Madison. Overall, my visit to MMoCA was nothing short of spectacular.","useful":0,"funny":0,"cool":0},
{"review_id":"38r5mBrjRaR7KsnsKmbPeQ","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"NYf9TKBKPpa1wkA_uwIlfg","stars":4,"date":"2017-01-14","text":"The Weary Traveler is a great place to go if you are looking for delicious food, great live music, and a laid back venue. I was originally in the mood for something light, but was persuaded by the waitress to try the restaurant's famous Bad Breath Burger. Although it ended up being a lot of food, the switch was definitely worth it. The burger consisted of traditional burger toppings, with a unique twist. Be sure to save some room for desert because the restaurant offers a variety of unique ice cream flavors, in addition to other options like Key Lime pie!","useful":0,"funny":0,"cool":0},
{"review_id":"KMr2VBFcwMnXO8vNVbB2Qg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"xI8GXDAdJcPX5dIP0acBvw","stars":5,"date":"2016-08-16","text":"After working up an appetite walking around the farmers market, Basset Street Brunch Club was the perfect place to grab a bite to eat. Although there was a forty minute wait when we arrived, there were multiple patio seats and tables outside of the restaurant that made waiting quite comfortable. We also made sure to order a few drinks at the bar to sip as we waited. In terms of the menu, there is a wide variety of options, but the fried chicken is a must! The biscuit and gravy that came with the dish were extremely delicious and not too heavy.","useful":1,"funny":0,"cool":0},
{"review_id":"uM-2ucdi-nCUs0wUYUzRtg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"eNEgDEtad9xtErB1rCFr4A","stars":5,"date":"2016-11-14","text":"As a first time barre student, and avid runner, I was a little skeptical as to whether I would actually enjoy my workout at barre3. Much to my surprise, my experience was absolutely wonderful. Not only is the studio extremely clean and welcoming, but the instructors are very personable and friendly! By the end of the workout, my legs felt like jelly, but I knew I would be coming back for another class. I loved how although everyone was doing the same exercises, the instructor did a great job at encouraging everyone to make it their own workout. For each move, there were multiple variations to ensure that everyone was able to get the best workout possible. No matter your level of barre experience, I would definitely recommend stopping in for a class!","useful":2,"funny":0,"cool":0},
{"review_id":"zXJ79GTfaAMr8ZqojcJ_YA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"FjyZX8MwtveCowW0TR11dg","stars":5,"date":"2016-08-26","text":"The Edgewater patio is by far my favorite place to enjoy a summer sunset. Be sure to stop by on one of the nights when there is live music because you will surly be in for a treat! On the patio, they have a small roll out bar that features a few local beers and sangria options. The next time I am celebrating, I will be sure to stop by and try the food menu!","useful":0,"funny":0,"cool":0},
{"review_id":"BPcX4nJavi_zLHLbb6Rr0w","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"15LVDu1_v97JEx-g97wnfA","stars":5,"date":"2016-08-13","text":"As a pizza lover, Salvatore's Tomato Pies are unique and flavorful. We ordered the bacon and fig pizza which was the perfect melding of savory and sweet.  The menu offered a variety of choices, making it hard to decide what type of pie we wanted to order. The venue is pretty small, so it would be smart to order takeout on the busier nights or try and beat the dinner rush. Due to the small size of then venue it is a little loud when crowded. We are definitely planning to go back to try some of the other menu options!","useful":0,"funny":0,"cool":0},
{"review_id":"28Z1xNE-aeRKBxuMFz0mgA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"aWYWNfHuQJyRwDHaHq8X1w","stars":5,"date":"2016-08-13","text":"We were initially drawn to this restaurant due to the fact that it is the only place with frozen margs in all of Madison. When we arrived with our group of eight, we were told that it would be about a thirty minute wait. We ended up waiting over an hour, but the staff was kind enough to give us a round of drinks and appetizers on the house. The menu provided a variety of options for all preferences or dietary restrictions. Great place to visit with the family or on date night. Would definitely recommend getting there before the dinner rush!","useful":0,"funny":0,"cool":0},
{"review_id":"xPd378sZdZyl54k34dzIaA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"MpWkXcBH1sSVcjReplDB3A","stars":4,"date":"2017-01-14","text":"Old Sugar Distillery is the perfect place to go if you are looking for a unique vibe, strong spirits, and good conversation. Not only are the bartenders extremely nice and knowledgeable, the venue offers an open warehouse feel and large tables that are great for larger group gatherings. Although I am not a big fan of whisky or bourbon, the menu offers a variety of drinks that anyone could enjoy.","useful":0,"funny":0,"cool":0},
{"review_id":"Y-aXCBxXqZRpzrENC-0moQ","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"XmsBtCykUtObXg4Q1mYpvg","stars":4,"date":"2016-08-21","text":"In the mood for a burger, my roommates and I decided to checkout Graze. There were a lot of people waiting for tables, but everyone was seated quite quickly. Make sure to show up with your full party because they will not seat you until everyone is present. In terms of the food, I ordered the smaller burger option and was pleasantly surprised.  It was the perfect size burger if you aren't too hungry or in the mood for something heavy.","useful":0,"funny":0,"cool":0},
{"review_id":"0V75gYIyLaioCO9wVPRhqg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"cTPdZ9Va0HCLESf5gNnXwA","stars":3,"date":"2016-09-24","text":"As a pizza enthusiast, I was really looking forward to trying the trendy flavors this restaurant offers. Unfortunately, the pizza fell somewhat short in comparison to other pizza venues around town. Not only was the pizza a little pricy, but I felt as though it lacked the unique flavors described on the menu. On a different note, the service was absolutely wonderful. Our waiter was constantly checking up on us and even gave us free drinks when someone from outside accidentally threw a cigarette butt into my water glass.","useful":0,"funny":0,"cool":0},
{"review_id":"B39M2BdFUEzV9oqTaIXreA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"sTEmdsTMxoiKmjtRXRxCoA","stars":5,"date":"2016-09-24","text":"There is something \"Majestic\" about every concert I have attended at this venue! No matter where you stand or sit, it feels as though you are attending an intimate show. The calendar of events is quite diverse and tickets are fairly affordable. I also love how it is a few blocks away from local restaurants, so grabbing a drink or dinner, post or pre show is extremely easy. If you happen to be running late, don't fret because there is a bar within the venue!","useful":0,"funny":0,"cool":0},
{"review_id":"cikqkbmgYcp9ZTX9WOlYHg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"k1mNR7eIi-UWVmj_t23Yog","stars":3,"date":"2017-01-16","text":"I have now eaten at Sujeo twice, once dining in and once via take out. Although the food was pretty delicious, I felt as though it was extremely overpriced. I ordered the chicken wings, which were quite flavorful, but lacked the substance expected from a $15 plate. Additionally, when I dined in, the service was extremely slow and our waiter was somewhat rude. One thing to keep in mind is that they are closed on Tuesdays!","useful":3,"funny":0,"cool":0},
{"review_id":"mrh2pL561UW1E2iIdv34aw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"Lf5qFOWu5qg1zHYkZQgeNQ","stars":5,"date":"2016-08-26","text":"By far the best ice creamery in all of Madison. They have a variety of ice cream flavors ranging from strawberry cheesecake to multiple non dairy options. As someone who has food allergies, I thought it was super cool that they had dairy free waffle cones. Additionally, it is extremely affordable and conveniently located on the center of state street.","useful":0,"funny":0,"cool":0},
{"review_id":"Z6BUT-AbpCmZGHEcMURKHA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"K_FjKc69zg6A8fZkaKS48Q","stars":5,"date":"2016-08-26","text":"I am so glad I stumbled into this specialty store. Not only was the staff extremely accommodating and informative, but the liqueurs I tried were delicious. They have a wide range of flavors and can ship to anywhere in the United States for a few dollars extra. I would definitely recommend stopping in to try something new or find a great and unique gift for a friend or family member.","useful":1,"funny":0,"cool":0},
{"review_id":"9xsQoDdCDOQXqUVZLe-WeA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"I3S2BseRUaSHuTSsYivMlw","stars":5,"date":"2017-01-16","text":"Ever since my trip to the Dominican Republic a few years ago, I have been in hot pursuit of a place that serves tostones. La Taguara is a hidden gem of Madison. The menu offers a wide selection of traditional Venezuelan food at an extremely affordable price. In addition, the staff was extremely kind and helpful. They made sure to explain every dish and answer any questions we had about the menu. The overall venue is a little small, so be sure to plan when you visit or be ready to wait a little if it is crowded. I will most definitely be visiting again, not only to taste some delicious tostones, but to work my way through the absolutely amazing menu.","useful":4,"funny":0,"cool":6},
{"review_id":"uGcvKiz8bCeVSvLtbcmqtQ","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"hoqk5SFvERVDJVXUaFLpLQ","stars":4,"date":"2016-08-13","text":"A friend and I stopped here for a late night snack and beer. There were so many options that we were a little overwhelmed at first. We ended up getting the portobello mushroom sandwich. It was extremely savory and the perfect amount of food! I would definitely recommend coming here if you are with a large group full of different taste buds. Seating is available inside and out.","useful":0,"funny":0,"cool":0},
{"review_id":"WxCnm7aqhzzFoIQe50B90w","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"ElQ6-m-PxRe6wBvmlxwrUw","stars":3,"date":"2016-09-24","text":"As a kid, my family and I would make an annual trip to pick apples from our local apple orchard. Although it has been years since my last trip, I was somewhat disappointed with my experience at Eplegaarden. The overall location was extremely close to downtown Madison, but the selection of apples was quite limited. Although it seems as though there are rows and rows of apples, most of them were the same two or three types. This may have been because we went a little early in the season, but even then, many of the trees seemed quite picked over. Also, make sure to bring cash or check because they do not accept debit or credit cards!","useful":0,"funny":0,"cool":1},
{"review_id":"xd2PnBN9IBvJKQUFuBlSaA","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"HO2knNxcc_8lFtgGxN8q2A","stars":3,"date":"2016-08-21","text":"Nitty Gritty is one of those classic college bars full of students celebrating the weekend. Make sure to stop by on your birthday to pick up a souvenir birthday mug and complimentary beer or beverage! Although it was pretty crowded and loud, they offer great drink specials on weekends.","useful":1,"funny":0,"cool":0},
{"review_id":"nnb9FMcpoUjDUq-9LBk0cg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"RMEzxhYfpnEsWlfozit_xw","stars":4,"date":"2016-08-13","text":"Ale asylum was the perfect spot to visit before catching our flight. Located about four minutes from the airport, the venue has a large parking lot and variety of indoor seating. We sat at the bar because we were in a bit of a rush. The bar staff was great at recommending taps off of their menu and also provided us with various samples to ensure we picked a drink we liked. Although we did not order food, the couple next to us order multiple appetizers that smelt and looked delicious. We will definitely be going back to take a beer tour or try some of the other menu options!","useful":0,"funny":0,"cool":0},
{"review_id":"UQuaeq58Fr-P48KZSvjpSQ","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"vxByu2zWCbv1qMRf3kOW6g","stars":4,"date":"2017-01-16","text":"Bos Meadery is a great place to visit if you are looking to try a new type of alcohol and take in some live music. They host a variety of local artists, in addition to having open mic afternoons on Sundays. What I liked most about this experience was the wide variety of mead flavors. I had never tried mead before, but the bartender made sure to explain the various flavors and the process involved when making mead. Additionally, their menu is always changing which guarantees a unique experience with each visit!","useful":0,"funny":0,"cool":2},
{"review_id":"UZYFnscPN-KvBwc5VgojOg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"GjkgXXicSJokejRge-g3xA","stars":4,"date":"2016-08-26","text":"Open mic night at Genna's is a great weekly event that exemplifies the general vibe of this bar. The venue itself is very unique and homey, with a somewhat artsy feel. Although they do not have an extremely large selection of beers on tap, they have a rather extensive list of bottled and canned beers.","useful":0,"funny":0,"cool":0},
{"review_id":"IJxbrZKc4fM-TGs62XmqtQ","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"PVHC67qH2d6DonAGRxvymA","stars":5,"date":"2016-12-01","text":"Prior to visiting PainBar Madison, I was a little unsure what to expect. I had been to other Paint Studios before, but they always lacked the personality one would expect from an art studio. When we first walked in, we were immediately aided in picking out a canvas, paint colors, and a place to sit. Our waitress was extremely patient and made sure that we had all the painting supplies and drinks that we needed. We were pleasantly surprised to discover that Friday is Open Mic Night. Rather than sitting listening to normal coffee house music, it was nice to have a variety of local artists serenade us as we painted.","useful":2,"funny":0,"cool":0},
{"review_id":"f9bPm4ooX0M7-F33XW3gJg","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"lUzX5Prr8TfXeWRt94POBg","stars":2,"date":"2016-09-23","text":"Sotto is one of those places that in theory sounds like a blast, but always seems to be a bit disappointing. The dance floor is located downstairs and tends to get extremely muggy as the night goes on. I would definitely recommend Sotto if you are looking for a fun place to let loose and have fun. Just be sure to bring cash because they sometimes have a cover at the door.","useful":1,"funny":0,"cool":0},
{"review_id":"BQTetHCVXHRCrf3drEZFsw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"cVPUJEJqjSR1oHjl2JPHqg","stars":3,"date":"2016-08-18","text":"As a barbecue enthusiast, I was really looking forward to trying Red Rock Saloon. We arrived with a fairly large group and were seated immediately. Unfortunately, the food ended up taking almost an hour to come out after we ordered. The Mac and Cheese was pretty delicious, but the barbecue was quite dry. Overall, Red Rock seems like a great place to grab a casual drink, but I would definitely recommend grabbing dinner somewhere else!","useful":0,"funny":0,"cool":1},
{"review_id":"uJKsMVX4vhFKq7xJoPh7hw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"98NHr5pJyJS-PlrfZ2q6kA","stars":5,"date":"2016-09-23","text":"As someone who is debatably the most unathletic individual on the east side of Madison, I was thoroughly impressed with how much fun I had at Keva sports. They have a variety of courts, are a great place to check out if you are interested in joining some sort of sports league, and have beer specials almost everyday of the week.","useful":0,"funny":0,"cool":0},
{"review_id":"HVUuB781M_GfbNE6ZMnHpw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"IXXERocY1bqGwRllcy8J2w","stars":4,"date":"2016-07-24","text":"As the first brunch location I have tried since moving to Madison, Sophie's kitchen provided a quaint and homey atmosphere. The food was delicious, but the wait was a little long. I would definitely recommend trying to get to the restaurant earlier in the morning to avoid a longer wait time. We were lucky enough to to enjoy our omelets in the outdoor seating area. Overall great place for brunch!","useful":0,"funny":0,"cool":0},
{"review_id":"cwyWEryKSveHazeM7KQs1Q","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"CUGPOzeBRz84cdIOGSXcLw","stars":4,"date":"2016-08-18","text":"The Brass Ring is a perfect place to go if you are looking for a place to practice your pool skills, check out a unique beer list, or catch a laid back round of trivia. Make sure to check out their specials because on certain days, an hour of pool is just a few bucks for the whole table.","useful":0,"funny":0,"cool":1},
{"review_id":"D4gr-0NwkzB-xMO1XjmbDw","user_id":"Wt8Naat13FOHfl0yuJtM8g","business_id":"zNcj8OHjk5wrF7zJeNhWjg","stars":5,"date":"2016-08-18","text":"Since moving to Madison, I have been looking for a new yoga studio. I ended up doing the two week trial package for thirty dollars at the Studio and loved every second! Not only does the studio feature beautiful rooms with high ceilings, large windows, and a unique homey interior, but a large variety of classes are offered daily. Monthly memberships are a little expensive, but I would definitely recommend at least trying a class or two!","useful":1,"funny":0,"cool":0}]