[{"review_id":"4wv4J4An-bYr5hjs2Xe1zQ","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"i3mZIwNi1EiJ7-1A8amoyw","stars":5,"date":"2013-01-03","text":"Great middle eastern deli with several vegetarian choices.  Very inexpensive and extremely friends staff.  Baklava is a must.","useful":0,"funny":0,"cool":0},
{"review_id":"EpTolIqsQN-n_7fvglx0aA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"HUWLnKD5LSZY134amUO2Rg","stars":4,"date":"2012-12-03","text":"Great lunch specials.  Good New York \"Godfather\" feel to the place.","useful":0,"funny":0,"cool":0},
{"review_id":"xOZ1RopwvTs6mLTYB4g1pA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"6Z6IyosSMciZtwk8hRLRag","stars":5,"date":"2012-11-12","text":"Lived in Chicago and DC and this is my favorite Chinese.  Very authentic and tasty.  When they didn't have a friends favorite dish on the menu, they made one up.   Spicy Wontons are the best.","useful":0,"funny":0,"cool":0},
{"review_id":"aako0tVOA0kGN2-96s2KWA","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":4,"date":"2013-02-24","text":"I have a love-hate relationship with Hash House.  It's always busy and I've ordered wrong before, but overall the good far outweighs the bad.  The one on Sahara is the only one I like.  They had a pork roast scramble special once that I still fantasize about, but for me, it's mostly about the breakfast and the PANCAKES.  The blueberry pancakes are good but the banana brown sugar are AMAZING.  If you like pancakes, they are the best and worth every penny.  The vanilla waffle is pretty blah.  The mashed potatoes are crazy good.","useful":0,"funny":0,"cool":0},
{"review_id":"TmbCM_nailoOo4EKt4-t1A","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"eZcCFV-8X91ZSnmB9807bw","stars":4,"date":"2012-12-26","text":"Great service.  Good food. Monster portions and a menu that goes on forever. Just your typical Cheesecake Factory.","useful":0,"funny":0,"cool":0},
{"review_id":"w5U4X96kmMd7PZRMlGyfrQ","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"_3FxLxdg1unUQc3QqIgJuA","stars":3,"date":"2013-02-24","text":"Food was very good, but the place is crazy expensive considering it's in Red Rock Casino. Service was good, but had a few hiccups with the bill.  Overall, it's a nice option for a business meal or out-of-towners.  As a local, I don't need to spend that much on a meal.  Careful with the coupons: many are not accepted on Fridays and Saturdays.","useful":0,"funny":0,"cool":1},
{"review_id":"F3xuvwbRd9HkLZZyWorC6Q","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"F65UAC9crwFePN69UqKRJw","stars":1,"date":"2014-08-24","text":"This was my nightmare home repair experience.  Everything I asked about was a $200 issue, including a toilet flapper replacement.  I ended up buying the $10 flapper myself and putting it in in about 5 minutes. I think the man who came thought I was someone who would just fearfully tell him to do $1000 in repairs.  These are like the car repair crooks you always hear about. I wasted $35 on the coupon but it would have been much worse if I had let that guy touch anything in my house.","useful":10,"funny":5,"cool":2},
{"review_id":"kHv-ZxGZZeLRCFbMxyWf5A","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","stars":5,"date":"2012-12-03","text":"Pad Thai with tofu was real good and flavorful.  Prices were very good.   It's one of the few restaurants in Vegas that doesn't feel designed for tourists or as an afterthought.","useful":0,"funny":0,"cool":0},
{"review_id":"-1a7DLqgCV_s8Inzr0T7Dw","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"YCEZLECK9IToE8Mysorbhw","stars":4,"date":"2013-01-03","text":"Very small portions but good food nonetheless.  Healthy places like this are few and far between in Vegas.    Very yuppie crowd.","useful":0,"funny":0,"cool":0},
{"review_id":"dZiLJlMWA3LnPgeA5RM85A","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"PyrcymoNDAJDm_Zn9yl-7A","stars":5,"date":"2012-06-08","text":"Good and authentic.  What it lacks in ambiance it makes up for with taste.   And yes the credit card machines are working again.   I'm an army brat who lived in Germany many years and the schnitzels and spaetzle took me back in time.  (Get it with rahm sauce).","useful":0,"funny":1,"cool":0},
{"review_id":"wX3O8W2mClsyIXd9e5EUYg","user_id":"INbqkFXtHeCdEP_wPp2dUA","business_id":"4qG3Gh8QyugC1XvoTlmgcQ","stars":5,"date":"2015-01-18","text":"This place is back up to snuff for me.  The trick if you're a pancake lover and picky is to ask for them to make them very thin. Improves the blueberry to batter ratio significantly and improves the taste.  The staff is much better than they were for a while. Back to loving it.","useful":0,"funny":0,"cool":0},
{"review_id":"jdEFpuiLjahExIiXD927-A","user_id":"0dAJK53XoiEIodSWhKf0LA","business_id":"BnMDLIYT17-fl6_pFpFlrA","stars":5,"date":"2017-06-13","text":"very reliable, reallu quick service! i was locmed out of my car, called the locksmoth and within 20 min he arrived. job was done very fast. highly recommended im defenitly going to use again !!!","useful":0,"funny":0,"cool":0},
{"review_id":"kAg8fCJkJnX8RmssPvWUSQ","user_id":"BV2PT9MNLvNZlm3chC4y8g","business_id":"qNPY1O_9rKjd8vmOMp1HqA","stars":5,"date":"2012-06-28","text":"I've been here for several different treatments - peels, facials, and photo facials. Lovely staff in a relaxing environment, this is now my go to spa.","useful":3,"funny":1,"cool":2},
{"review_id":"iXEO9493AVcDZmOkGJpIgw","user_id":"z7dWikbkqL7NelG4JeSt4g","business_id":"19VNsxhnPZ11zc0KBauonQ","stars":1,"date":"2015-02-03","text":"worst customer service.Mainly the manager Matt. Who made it very difficult to return a damaged product sold at that location.","useful":1,"funny":0,"cool":0},
{"review_id":"_S7eQErdN0E9RdD63eLq4A","user_id":"z7dWikbkqL7NelG4JeSt4g","business_id":"POkNk-y-sS2Od39kP5NN5Q","stars":5,"date":"2016-03-31","text":"This location is awesome, not only are the burritos on point. The staff & service is pretty out standing. I've been to this location multiple times. And I'm always blown away with how friendly the staff are.","useful":0,"funny":0,"cool":0},
{"review_id":"GQbYOuWNrBr6oP9bGnSRnQ","user_id":"sEc07tLRRGJeTknahO5Qsg","business_id":"s6EMPZrpNorn9KP2TSkc_g","stars":1,"date":"2013-05-10","text":"They took my money and now will not answer my calls! Joe, Mitch and Melissa are absolutely the most shady people I've ever met. Run!","useful":1,"funny":0,"cool":0},
{"review_id":"GpCOpDNX2lpFkI-dpm7izQ","user_id":"sEc07tLRRGJeTknahO5Qsg","business_id":"ovtlrcsVRlgZZQUlHs_ovw","stars":5,"date":"2017-02-12","text":"Absolutely love this place! The red sangria, vogue burger, actually everything I've had has been amazing!  Little bummed they changed the menu and got rid of my favorite dish but hopefully I'll find another go to!","useful":1,"funny":0,"cool":0},
{"review_id":"otCcfBRDEaAZwkRX-62dvw","user_id":"NpqvUOrZdVE5qYCEDP2BCg","business_id":"1G0C1xuMONSIQS76LMjGyw","stars":3,"date":"2011-10-21","text":"In one word, class! Smartest bunch of girls in town. They all wanna be doctors.","useful":0,"funny":10,"cool":0},
{"review_id":"y_O_XhR1lEv342YoPXttJQ","user_id":"I_2TkQR085ZjsTMRj-XebA","business_id":"mdAY2mCRiaOKn3BONyTG4g","stars":1,"date":"2016-02-01","text":"Dirty room and HUGE ROACHES!!! \n\nStay at 3 Palms in Scottsdale its about 10-15 min away with bar by the pool and nice clean rooms","useful":0,"funny":0,"cool":0},
{"review_id":"XeA3BGOhduTRdnprL4ULGQ","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"RESDUcs7fIiihp38-d6_6g","stars":4,"date":"2014-04-15","text":"Best Buffet I experienced in Vegas! You have to be open minded to trying new and gourmet foods very ethnic foods. Everything was cooked to perfection! It was very spendy but worth every Penny!","useful":1,"funny":0,"cool":1},
{"review_id":"J5nctRtC0L5oSExNj1XGEA","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"ijg7qQCYnhUWBd5JUxbfvA","stars":4,"date":"2014-04-15","text":"Yum! Love the atmosphere the food was awesome we came back a 2nd time while staying at the hotel! Fun flash back in times prices were afforDable ;)","useful":0,"funny":0,"cool":0},
{"review_id":"1xlYVWhyLedoA0HddOJMOw","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":4,"date":"2014-04-15","text":"Very great atmosphere had a wonderful bartender so much that we came back to eat and it was awesome food SPENDY but worth it! Thanks Matt for the homemade Sangria!!","useful":0,"funny":0,"cool":0},
{"review_id":"eBxGjZkwr6qNxyfh2wf_UQ","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"ByFMv3p5X1aNeZhU61rDcA","stars":3,"date":"2014-04-15","text":"Just spent 4 nights here the room was nice we were asked if we would like to be upgraded for a additional fee of $25 a night and ended up paying OVER $200 additional! So don't be taking in like we were thinking it's a great deal! I did enjoy the suite ;) Just not the prices! And skip the Buffet it's gross but Roxys Dinner has excellent food!","useful":1,"funny":0,"cool":0},
{"review_id":"xKoiChS7y0Ab0sEGbXIICw","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"3xmfT7l3xNH5LK1dLzfvGw","stars":4,"date":"2014-04-15","text":"Everyone told us to visit Freemont Street while in Vegas and you sure get a EYEFULL of live entertainment! It's fun for ADULTS not a place to bring children REALLY WHY WOULD YOU BRING KIDS AFTER DARK TO VEGAS ANYWHERE REALLY? Anyways had a lot of fun here!","useful":0,"funny":0,"cool":0},
{"review_id":"9h4RxO0QLxvXNqzqyZTA8A","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"4mYPOzBokDgz307TW2EIKw","stars":1,"date":"2014-04-15","text":"It was overly priced for food that looked like it sat there all day! Dry meat and not a lot of choices! I couldn't even make a decent salad! Worried about even trying the fish and the deserts looked gross!","useful":0,"funny":0,"cool":0},
{"review_id":"WP5487GT3BxCqB-tPpJEmw","user_id":"yvlRColhqo_4TzpUFKyroA","business_id":"rTS8LsUmNIiXsXydE49tPA","stars":4,"date":"2014-04-15","text":"Live entertainment as we were served beverages it was so much fun one if the best memories we had in Vegas! Jaw dropping!","useful":0,"funny":0,"cool":0},
{"review_id":"u9OSLcItFm42-p_PHKHyXg","user_id":"93kKUZ3_PcuuDxyul5vlPw","business_id":"18DZZhcuabNnuVCX5rDw7w","stars":5,"date":"2014-03-26","text":"I have never met such a caring, patient optometrist as Dr Loc Pham. He's compassionate, knowledgeable and very helpful. The receptionist, her name is Yen, is exceptional. She helps me with my frame selections without being pushy. She showed me different price ranges. I had an exceptional experience.","useful":0,"funny":0,"cool":0},
{"review_id":"1qvsicXSLKkTqrmHRxuKDw","user_id":"gOLIB6vpg1cEWbDo8IQSqA","business_id":"wROj9KOvOHgKwXlG9PUsIA","stars":5,"date":"2015-11-28","text":"Went on a Friday night with one friend. Arrived around 9pm and we were lucky to get a table as the Canadians were playing on the TVs(in New Jersey against the Devils!). The atmosphere was super fun, especially with all of the hockey fans. Our food came super fast (everyone else was just ordering drinks at that time). The fish and chips were amazing, very high quality tasting fish :) 10\/10 would come again :) Definitely a pub atmosphere and they had a good selection of draft beers. The place was very loud but that was to be expected with the game on.","useful":0,"funny":0,"cool":0},
{"review_id":"UkFXGAFkkiKoAiaT-H8EIQ","user_id":"6Kwhv2QHfGCtK6VHYIZFqQ","business_id":"75h1zQoWi_D7SMHIIYpeMQ","stars":5,"date":"2012-09-28","text":"I had just moved to Arizona last year and was desperate to find a hairdresser who was skilled at cutting short hair. I saw a woman in Whole Foods one day who had a really cool and hip short cut, and boldly asked her who cut her hair. She said 'I'm a hairdresser,' and instantly my connection with Christian was born. \n\nI have just read the other stellar reviews of Christian on this site, and found myself nodding and smiling in agreement with all of them. I will add that I have never in my life had a hairdresser who was so caring and concerned about understanding what I want for my hair, then working to give it to me and 'get it right.' Christian is a beautiful person, inside and out, and I feel as if my appoinments with her are also  visits with a friend. \n\nNot to mention that she is a kick-ass, super-talented stylist and my hair has never looked better! I was leaving the salon the other day after Christian did my hair and the next customer commented that I looked 'really hot!\" Now that is the kind of compliment you want to hear after just having your hair done (especially when you're in your 50's!) Love, love, love!!!","useful":0,"funny":1,"cool":0},
{"review_id":"9Q-nJxyads8jZIjhvzFT9A","user_id":"6Kwhv2QHfGCtK6VHYIZFqQ","business_id":"cI9xcJnBFpJoXKeqc5P6OA","stars":5,"date":"2017-12-06","text":"Can't say enough how thrilled I am to have found Lisa and her service. My 89 year old mom lives alone and can't always get to the store, so will often run low on groceries. Living in another state, I am often frustrated about how I can help her. \n\nEnter Lisa, ta dah!! Not only did Lisa bring the groceries into the house for my mom, but offered to put them away for her!! Then followed up with a nice note to me to say 'mission accomplished'. I am so grateful Lisa - not only that your business exists but also for who you are as a person. Many thanks. I will be a repeat customer for sure and will spread the word!","useful":2,"funny":0,"cool":0},
{"review_id":"aUyn0PUaVH1wygbhh_K9Ag","user_id":"cyABEo-94nt4zZDA-cYzgg","business_id":"-OSAVEMgZFleSC2Tb6Tcvw","stars":2,"date":"2016-09-10","text":"We went to this place because I saw a used vehicle that I really liked and we were looking to get my payment down. Once inside it took 30 minutes to just talk to a sales person. Then he was a waste of time. He looked my car up on Kelly blue book and gave us a price that blew me away in a bad away. He said something about how they buy cars in bulk and then sell them but tells me they will give me 4,000$ less then the same car they are selling on their lot with more miles. The vibe we got was they had no time for us.","useful":3,"funny":0,"cool":0},
{"review_id":"BPuF8ptBR_3wFicO5Hr91A","user_id":"cyABEo-94nt4zZDA-cYzgg","business_id":"EfkhcHuVyakw3LE85CGsnw","stars":5,"date":"2017-06-19","text":"I absolutely love this place!! My family moved to Mount Holly in August and I wish so bad we would've found this place from the start! My 4 year old went to a daycare center and he really started to have alot of listening issues bc of the poor staffing at that center. But the staff at Early Beginnings stood by me and helped me every bit of the way! They offered me support, made me feel like family, and showed me options on how to help my child. As a mom, it isn't easy to admit your child needs help. But when you actually have the teachers standing with you and telling you it's going to be ok and they will help you....that means more than the world!!! My son woke up EVERY morning excited to go! He has only been there for 1 week but he is finally back to himself after 2 months :) thank you to ALL the staff at Early Beginnings!!","useful":1,"funny":0,"cool":0},
{"review_id":"PrOBlWJe9eB1plmwMoYXfQ","user_id":"cyABEo-94nt4zZDA-cYzgg","business_id":"m7VEdzaW2FxTyZPvdaOkMg","stars":5,"date":"2017-06-24","text":"I haven't ever found a dog park like this one! The park has a really big area for the dogs to run and every time I go I always meet new ppl. Everyone is always so nice and I never have a problem with any other dogs being mean towards mine. I also have a 4yr old and they have a play area for kids which he loves! There is an area with picnic tables that are covered near the trails. It's a very beautiful area and there are even geese at the lake area where u can fish too :) needless to say, I highly recommend this park for any occasion!","useful":0,"funny":0,"cool":0},
{"review_id":"qhwRhySy5HVyU1MzkRvriA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"UsJYr7l0fOaQZG223BbpeA","stars":5,"date":"2017-08-31","text":"Love this place, the food is excellent, so much better than the Tempe location. I also like the chill atmosphere much better than it's predecessor. Friendly staff, good drink specials, can't go wrong with their pizzas or appetizers. Porco pizza is life","useful":0,"funny":0,"cool":0},
{"review_id":"Hfo_fU59H9QLKChzP34FiA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"1heHNQIZiHL23rUsVhOmWQ","stars":2,"date":"2014-05-18","text":"It was an overall unpleasant experience in the one year I lived here. Much of it stems from the fact that these apartments were built in the late 80's \/ early 90's and haven't kept up with the times. My apartment had a leaky A\/C unit which would freeze up and drip down onto the carpet. That's exactly what you want during Arizona summers. I changed my air filter often, but the air vents are old and dirty and made me have respiratory problems. Management loves to provide little input or real change and instead just sends the maintenance guys who are able to do little to nothing for these old, troubled rental units.\n\nBesides the units themselves, as I mentioned you'll get problems from management to add to it. Nothing topped off a day at work like coming home to see a note on my door that our entire building will have the water shutoff tomorrow starting at 5am until 5pm. I think this is just a little bit of short notice in the instance of \"routine maintenance.\" I recall this happened at least three times, and once was actually due to the old pipes freezing up during a cold winter. Then when it came time to move out, it was a hassle and negotiation for my full deposit to be returned when it was due to existing problems, and they're making zero investment to renovate and remodel these old apartments. \n\nI understand you want to be near Old Town, but you can do better.","useful":9,"funny":0,"cool":1},
{"review_id":"dGCac3rFvfsxmabrMLcf8g","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"qMJyOW1FdPOf8sli8DIq_A","stars":5,"date":"2015-01-10","text":"Delicious Crepes! Delice has the feel and menu for an authentic bistro. This place will be a great Breakfast or Lunch spot. I appreciate any place that has fresh juices! Mill Ave is lucky to host this business.","useful":0,"funny":0,"cool":0},
{"review_id":"kHoh2EX-1C9iuvDA8lYeqA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"lUczD7I5o4wTWru7jzSqeQ","stars":1,"date":"2017-07-05","text":"Take the bad reviews to heart, we didn't and got burned by it. You can do a lot better for the amount you are going to spend. Find a place that cares about your big day as much as you do. Superstition Manor only wants your money, and they aren't even willing to work that hard for it. Really pathetic experiences the more we got to know them. \n\nWe spent a lot of money and made our wedding look good, but still got treated poorly, and worse our guests were treated poorly. It was like we worked for them and not the other way around. A $10K or even $20K+ event shouldn't be a DIY experience in which the staff is rude and a hinderance to pulling off the day the bride dreams of.\n\nNow getting going, you've got much better places to look at!","useful":10,"funny":1,"cool":0},
{"review_id":"Ong45E3GPNKCEZqHKTmKMQ","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"mRKmp_d7y_QaY_KBmJCTNA","stars":5,"date":"2015-11-26","text":"This place is probably the only place I could consider myself a regular. It's very good, authentic Vietnamese. Excellent pho and we love the crispy pork rolls and pork chop. Many love them for the oxtail. What are you waiting for?!","useful":1,"funny":0,"cool":1},
{"review_id":"4iLzdjEIVTtiNRqDbzrGzQ","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"41qbd6aGiz2GWp7TI8HSEg","stars":5,"date":"2015-11-26","text":"This place is awesome. Besides the excellent food (the berry bites are insanely good), the staff is super friendly. Props to Thomas, that guy knows hospitality. Go get yourself a Big @SS slice, some wings, and save room for berry bites (everybody has to try them once)!","useful":1,"funny":0,"cool":1},
{"review_id":"MpZaku1mmWG0Vb4Fby3kkA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"8B1TIuaqhaZ7QMEhDUu-Gg","stars":5,"date":"2014-10-29","text":"Their breakfast sandwiches have guided me through many a hangover. Cali club, breakfast club, smoothies, all good stuff. Price is on the higher end for sandwiches and such, but good ingredients and quality  taste are there.","useful":0,"funny":0,"cool":0},
{"review_id":"JpJMoq33ZG_Z6HfE_mzhEg","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"gDOuHjntsN37XEjROoQ2Aw","stars":5,"date":"2013-12-19","text":"This place is fantastic for Sonora style fried fish and shrimp tacos. The toppings bar is awesome for making your tacos the way you want, and the staff is very friendly. My only knock would be the ventilation isn't amazing and it is a smaller space, so it can get a little stuffy and you'll leave with a full belly but clothes that smell like fried fish.","useful":0,"funny":0,"cool":1},
{"review_id":"TtU7pt6X_xR1oZFtfMClkw","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"O5jWRmilHqaW54ChJh1oFg","stars":1,"date":"2014-09-28","text":"Terrible customer service, really bad for Peter Piper. \n\nOur food took forever to arrive, and yet it wasn't all ready to be served with only half the order available. This was despite the lengthy wait and our buzzer going off to alert that our order was ready. No sufficient explanation or apology was given when the issue was brought up. The staff does not go above and beyond, or really even meet the standard expectations.\n\nSo all you're left with now is game machines for your kids, except those don't entirely work. Some had tokens jammed to render them inoperable, others simply didn't operate correctly. \n\nVery unfortunate family experience that won't be repeated.","useful":0,"funny":0,"cool":0},
{"review_id":"sTW4OABJB5ZxuqmeWVPrnA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"bWucOPNoIjd8ECdiDyVq9Q","stars":5,"date":"2016-06-01","text":"I visited for the first time tonight after having driven by the restaurant many times on my way home. Truly a unique and delicious dining experience. If you want really good Chinese food, then come to Singing Pandas. I'm not much of a fan of Chinese food, and I thought the food here was worth repeat visits, and I'll now be bringing friends and family along to try it too. The staff is excellent with their customer service as well.\n\nWhy the friends and family comment? What really set this experience apart was the live entertainment; the \"singing\" is not just a clever name. There is great, live musical entertainment included with your dining experience from 6-8pm. \n\nIn a friendly room with a full bar and tables to accommodate all party sizes, the dining lounge was one of a kind. I can't think of anywhere in AZ that you can get a great meal and see great local musical impersonations and performances, along with songs performed by the tremendously talented owner herself, all for a very reasonable price of dinner. Singing Pandas blows the pants off something you'd pay for at a casino or local theater when you factor in the quality plus the cost. \n\nTry Singing Pandas today, they even have a good sized and well kept parking lot so the whole experience is easy-going fun.","useful":1,"funny":0,"cool":0},
{"review_id":"9CFUoZI8fsKGA_8Xtej5mA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"fRKqHIt0H0uLlD8deiY44Q","stars":2,"date":"2015-07-13","text":"Average sushi, with weak service. It isn't an inviting atmosphere and you can get so much more for the same or even less $ in terms of the sushi spots in AZ. If you do go here, pick Sunday as that is their deal day.","useful":0,"funny":0,"cool":0},
{"review_id":"7PilBLo2aUkpk0eTxlf3uA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"C2BR0TjNacoNzItPLUHTAA","stars":5,"date":"2013-12-19","text":"Great food, we are lucky to have this place! It can get busy around normal meal times as it isn't huge, but well worth a small wait if it happens.\n\nThe burgers are all I gotten, and I really like the mahi mahi burger :)","useful":0,"funny":0,"cool":0},
{"review_id":"wgke-mNlweS-2nSziBR1lA","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"imyDPttCKVNsCUs_al3PkQ","stars":5,"date":"2016-06-05","text":"Had my air ducts cleaned on 5\/27\/2016 by Roy and Drake. They were prompt, knowledgable and professional. It's surprising the lack of quality duct cleaning companies in the valley. I actually called J&M on short notice after a previous company flaked two days prior and I already took off work. Liz in the front office is awesome, the whole teams seems very skilled and helpful. I highly recommend, and will keep in mind they help with emergency services too.","useful":0,"funny":0,"cool":0},
{"review_id":"3KRM2dkb7Ob8JCt0VyMLVg","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"Pthe4qk5xh4n-ef-9bvMSg","stars":5,"date":"2016-09-05","text":"The staff is very kind, and the atmosphere and decor is very cozy and welcoming. I'm glad to have found a go-to Thai spot. The food is excellent and a great value. Their Tom yum soup is great, and so is the Pad Thai.","useful":0,"funny":0,"cool":0},
{"review_id":"jQIKotesM15qStRivKas_w","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"gZYt10Kn-eHpo3n4lx3iBg","stars":5,"date":"2013-02-13","text":"Great food and nice atmosphere, Quality Italian dining!","useful":2,"funny":2,"cool":4},
{"review_id":"A0mW07m1MJDarQLAZP3RJg","user_id":"FfqX7xdQY80nbkdNoeh_6Q","business_id":"5ZzmZjt5-5fsX03BL70DgA","stars":3,"date":"2013-12-19","text":"Tried it the first time in California, and my experience here didn't compare. Even the store design was bland by comparison. If you've never been to SubZero, I would recommend going once just for the liquid nitrogen experience, and who knows maybe you'll like it better than I did :)","useful":1,"funny":0,"cool":1},
{"review_id":"D3ZNXi428GuMZrnP6FAWkA","user_id":"Ndl1ZwGIsc5oq0qlmbO_AQ","business_id":"2mZGnGIMUNRQY3d0hjdAxg","stars":5,"date":"2015-11-19","text":"Update - I went to this place on Halloween night with friends. I was amazed to see the staff managing the crowd so well. I had never been to Tacorrito in the evening. Loved the fish quesedilla and Mexican Poutine. I highly recommend this place to everyone. Places like these should be encouraged in the neighbourhood !","useful":0,"funny":0,"cool":0},
{"review_id":"0wbotnR8QMu8c4So7EQR5A","user_id":"Ndl1ZwGIsc5oq0qlmbO_AQ","business_id":"9VhZRkmyoEho58vmnMh_Hg","stars":5,"date":"2015-10-25","text":"This is pending since long. I really like the food here. This is one place I prefer visiting every week for dining during weekends. Two of the most delicious things they have, are kapow shrimps and four cheese spinach dip.","useful":0,"funny":0,"cool":0},
{"review_id":"vHvADqKb_2b1vs3zrsHaGQ","user_id":"Ndl1ZwGIsc5oq0qlmbO_AQ","business_id":"m65oi2C7b1CJM7DaXbFi-g","stars":4,"date":"2015-11-19","text":"Came in at a busy time and had to wait for a while to get seated. That's the only problem I face here during weekends.Dessert was so delicious that it was worth the wait. I would recommend everyone to try it at least once. I am posting few pictures as well.","useful":0,"funny":0,"cool":0},
{"review_id":"-8_zuSnWhyaJwGyCBlu4NQ","user_id":"Ndl1ZwGIsc5oq0qlmbO_AQ","business_id":"Ae4ABFarGMaI5lk1i98A0w","stars":4,"date":"2015-11-06","text":"I visit this place whenever I crave for spicy chicken momos with gravy. I have not come across any other place in Toronto which offers momos as good as this place does. \nI wish ambience could be a bit better but the staff is so friendly that you won't think twice before going there.","useful":0,"funny":0,"cool":0},
{"review_id":"yvO94hAR0Sx9gdIfy4WSXQ","user_id":"HgFcyjBaNI4EiGq-gdS4Dw","business_id":"2GIuCQJ9vfMY7rERB-SkUA","stars":5,"date":"2012-03-31","text":"Flowers by Renee has some of the best quality flowers in town. They are prompt with orders and they are always beautiful","useful":3,"funny":0,"cool":1},
{"review_id":"BwBGme-CKocxzWDpEVyyBg","user_id":"TE19WORpOSfHegKFkKsXsA","business_id":"d4z4gjdhQYs-WOVClISf_A","stars":5,"date":"2014-08-06","text":"I had one large tree and 4 small bushes removed from my front yard. The quote I received was very competitive and reasonable. The work was done exactly when they promised and they left the area in great condition when they were done. I would use them again in a heartbeat.","useful":1,"funny":0,"cool":0},
{"review_id":"oUyAKw5-Q0-e17YcqiBNFA","user_id":"JGpwdNCD1lZFkpPZbcqSOw","business_id":"xk-fOf_M39kDTgzfVgu0Tw","stars":5,"date":"2016-09-24","text":"Went there today for a gluten-free lunch. Had the signature pasta with quinoa pasta and chicken it was awesome!!  I highly recommend it.","useful":0,"funny":0,"cool":0},
{"review_id":"oicjv7wNPlF5gncow8KsHA","user_id":"qQvJAccCabfSEUKYf51NiA","business_id":"w6frk94BwGwxenre_zeXUg","stars":4,"date":"2015-03-19","text":"Very friendly staff, Heather was awesome and the owner, Dave, came out and visited. We were driving through Phoenix on our way back to Tucson from Sedona and the Grand Canyon and was looking for a place to stop on the north side to let the work traffic thin and found Caps on Yelp. The boneless mild wings were delicious. We had several salads and they were huge! Several ordered steaks and were pleased. Mom loved the grilled veggies and bonus was ladies night with $3.50 margaritas, Mai Tais and martinis! Glad we found it! Thanks Dave!","useful":0,"funny":0,"cool":0},
{"review_id":"wpb_BJsHcyain8KAB5AJ9g","user_id":"_dE8tkhgSRq4qxpzvC7e-w","business_id":"vlSZ8rprcOkgez314T-aVw","stars":1,"date":"2016-03-24","text":"I attempted to rent a vehicle for a one way trip from Vegas to Cali. Reserved everything online with my debit card. I go to pick the vehicle and was told NOPE!! I have to have a major credit card which I don't have! Then I get a dumb ass excuse of why I can't use a debit card and then an employee wanted to see 2 copies of a bill from my home. WHAT?!! Are you fucking kidding me?!!! I'm treated like a criminal !! \nAnd to top it off, your employee was extremely rude. Her name is Justine. Not only was she rude to me and could care less about her job. She apparently also has a mouth of a sailor. F bombs flying everywhere. She needs a class on proper customer service and etiquette of how to be professional. Neither was her strong areas. I will NEVER EVER rent from this company!","useful":0,"funny":1,"cool":1},
{"review_id":"gsmEcwcVYoKJ0qM0xxsvhQ","user_id":"_dE8tkhgSRq4qxpzvC7e-w","business_id":"a3vug2R5PvBCmzr6KU5RnA","stars":1,"date":"2016-03-01","text":"I'm very upset about my experience at this location. I came in with my dog and was informed the dog could not be in the store. I informed the associate that the dog is my service dog. She still insisted the dog can not be in the store. Again, I stated that the dog is my service dog and offered to show her the dog's service dog card. Which she did not seem to care and proceeded to reiterate the dog can not be in the store due to the food. What this girl did is breaking the law. I can bring my dog in as long as I have her service dog card, which I had. But she didn't care. Your employees need to be aware of the ADA laws and rules. Clearly they are not. I will be calling the manager tomorrow when she gets in and filing a formal complaint. This is ridiculous and this girl needs know what animals are allowed and not allowed in the store. I'm furious and you've just lost a customer.","useful":0,"funny":0,"cool":0},
{"review_id":"idvaCFsgd3PxEp3i2OQGSg","user_id":"0hMNWo0wncTITltCYw1osw","business_id":"93ncJl30FNA5a1sIEffWwA","stars":5,"date":"2011-04-07","text":"Fabulous family owned cafe within the Scottsdale Spectrum office complex on Scottsdale Rd. between Indian Bend and Lincoln. They opened this location about 8 years ago and they know all of their customers by name! Even after your first visit, they will remember you and know your name! I don't know how they do it!  I love their breakfast, they make the bacon perfect and crispy! Lunch specials vary by day and always consistently good. Mary Ellen bakes the most amazing cupcakes and cookies and coffee cakes. I have so many favorite cupcakes, but two of my all time faves are her red velvet, melts in your mouth and the newly created peanut butter chocolate. Has half a mini reeces peanut butter cup on top...mmmmm! Please stop in and support your local business! You will be so glad you did! I always leave there laughing!","useful":3,"funny":0,"cool":1},
{"review_id":"-NkWNbbKtUKNlOjU31mK-A","user_id":"0hMNWo0wncTITltCYw1osw","business_id":"GTuAPBRsM5dVPqPy9oe14Q","stars":5,"date":"2011-04-07","text":"This is an awesome hidden gem! I've worked right down the street for 10 years but never knew about this place until my uncle recently told me about it. I had the philly cheese steak with peppers and sauce and it was amazing ... and huge! I could only eat half. Great prices for so much delicious food! This is a great little family owned place that has been there for 34 years!!! (They had a big sign stating they just celebrated 34 years on 4\/1\/11)  It is a cash only restaurant, so make sure you stop at the ATM first. The chef's daughter offered me a sample of the chicken salad her dad makes there daily. It is amazing! They sell over 100 pounds of this a week! Just a really neat place, friendly people, and amazing food! I will definitely be back!","useful":2,"funny":0,"cool":0},
{"review_id":"LGMko1ZCT9NSrKnIWVJMSQ","user_id":"ovYanehQULdKbvFGfgFJag","business_id":"dyq9my28t5NW8N-6s8OgfA","stars":5,"date":"2014-10-03","text":"Great in the spring and summer.  Even in fall and winter this place by the lake is fun. Fireplace, scrumptious seafood, heated patio, beautiful bar, live music Friday and Saturday ........and did I say scrumptious seafood?","useful":0,"funny":0,"cool":0},
{"review_id":"U-ObNzt-GLSBPeMxt4vzIg","user_id":"-MUF6bAWqDWuA7fq3nm1kQ","business_id":"kxXaazqtldJU7TWBhMXRRA","stars":5,"date":"2015-11-16","text":"coming from a mechanical family, I'm very picky about those who touch my stuff, but these guys have my business.  met them through two friends who recommended them, and I'll continue to recommend them.  \n\nThese 2 have been working on my Bandit since I got the bike 20,000 miles ago, and it won't see another mechanic.\n\nset up an appointment or call for emergencies they can always try to fit you in.  I've had Kyle pick up my bike 3 times now.\n\nlast stop in, Adam was nice enough to pull an H2R off the lift to stop and work on my bike, couldn't thank them enough.\n\nThese guyes are good!","useful":0,"funny":0,"cool":0},
{"review_id":"3jnl5tE2BaYYQIWWnVQ3eQ","user_id":"r3u9y04v1ONr-JR-lio34A","business_id":"h19bR52xQ9fQWGMTSbjnbw","stars":4,"date":"2014-03-03","text":"The food was amazing. It was something new that I had never tried before. The taste was authentic and homemade. Other then the taste of the food the most compelling aspect was the friendly waiter. She was very kind and enlighten.","useful":0,"funny":0,"cool":0},
{"review_id":"jYYz9T5OvAWbZUdtsZAsQA","user_id":"r3u9y04v1ONr-JR-lio34A","business_id":"GAKCd5eIPQ-_B0psppX81g","stars":5,"date":"2014-11-08","text":"I was highly satisfied by my haircut. My hair was the best it ever look. Laura did an amazing cut. Would definitely come back.","useful":0,"funny":0,"cool":0},
{"review_id":"2h_G9uwqcBMYg8v_LZyGEQ","user_id":"r3u9y04v1ONr-JR-lio34A","business_id":"XsSgv3vBOyOBXn3Co8EVIg","stars":5,"date":"2014-03-10","text":"This place was great. The wings were the best I had and the pizza had the most stretchy cheese. :) Always best eaten hot and never warm. ^^ I also liked the rice dishes. You won't be disappointed. \n\nThe environment is more of an urban and youth theme. I really enjoy listening to the pop and kpop while enjoying my meal. The art was also nice too. A great place with friends and maybe dates ;)","useful":0,"funny":1,"cool":0},
{"review_id":"YSHInoiOGZ_kYSypKFZ0Jw","user_id":"jjDkYVZkU55697Xk_FOHKw","business_id":"u0wSFmWfg7IFJRl-WdSrNQ","stars":2,"date":"2016-07-31","text":"Super cute place but slowest service EVER! Don't come here unless you have a full day to spend waiting for your (small & simple) order","useful":0,"funny":0,"cool":0},
{"review_id":"SSM2S2I-mzt2sy0TeGfbMA","user_id":"p-uGsYJkx7eeQ5nr3Qth-Q","business_id":"CJu3t6lqoJATXIZaH9sJug","stars":5,"date":"2017-05-06","text":"This is a wonderful coffee & espresso shop . It is such an inviting place and the espresso is delicious. Simply reminds me of morning's in Italy. Kim, Cole and Nick are fantastic. My husband and I can't help but go here everyday. If you haven't been to Arriviste yet, you are missing out on probably the best coffee & espresso experience in Pittsburgh!","useful":0,"funny":0,"cool":0},
{"review_id":"pPaO3gBlZWr3MDeXZxKKtA","user_id":"1po30PVblm1zJbfvM71BRA","business_id":"dizdLoOk0GMaSS_qQAuklQ","stars":3,"date":"2012-09-05","text":"The Fifth Grill and Terrace was rated on a blog as one of the best steaks in Toronto.  My husband and I were excited to go, especially because it also boasted a beautiful rooftop dining patio.  The experience was neat, as the entrance is an unmarked door in an alley and after being checked off the reservations list were escorted up an old industrial elevator to the top floor.  We had the place to ourselves which was a little weird at 6:30 on a Saturday night.  This meant our waitress was very attentive.  The wine list was short and expensive but did have a bottle of Canadian red which was delicious.  The food was very expensive as well and was fine, but not delicious and worth the cost ($50\/main mean plus $7\/side vegetables).  The salmon appetizer was very disappointing since it was just a couple slabs of cold salmon and no flavor profile.  The ambiance was very nice, though there is no view since it is squashed between taller buildings.","useful":2,"funny":0,"cool":1},
{"review_id":"HEs496kXxUXIxYRss0zrgw","user_id":"SdKbaLOpxCn9zJPszXQltg","business_id":"gtffarZ2Y_rLfCegMg-nqw","stars":5,"date":"2012-05-29","text":"Ok, it's a Chipotle Mexican Grill. It's exactly like all the others, and the menu is the same.\n\nThat being said, it is inside a mall, and has a reasonably large and clean seating area outside the restaurant in the concourse. The food was good, and the staff was efficient and served promptly and hot. It is possible to get some variability in the freshness of the food and cleanliness of the location of course, and on both points this location was great.\n\nThe only reason I'm adding my review here, since I don't think every single Chipotle needs a review, is that it was one of my best meals in Vegas. The last time I was in Vegas it seemed a little easier to find something vegan. Especially in some of the $100+ per person restaurants, I'd expect the chef to be a bit more accommodating.\n\nAnyway, two thumbs up (and five stars!) for finding a Chipotle convenient to my hotel, the Palazzo.","useful":2,"funny":0,"cool":0},
{"review_id":"yp7oy3VU7e1QIr5HOnSQkw","user_id":"SdKbaLOpxCn9zJPszXQltg","business_id":"VsewHMsfj1Mgsl2i_hio7w","stars":4,"date":"2012-05-29","text":"I went here with a group as part of a conference, and we were served a fixed menu. I'm vegan, and they were very accommodating, even though we weren't ordering off of the standard menu. The service was great, and the waiter said they'd bring me something. The salad was simple but the dressing was delicious, and the waiter came by twice to give me extra. The pasta was especially good, and was served with the largest head of broccoli that I've ever seen.\n\nGreat food, attentive service, and they wanted to make sure we were happy.","useful":0,"funny":0,"cool":0},
{"review_id":"kWXS0JnrL9qXmjii9gUphw","user_id":"SdKbaLOpxCn9zJPszXQltg","business_id":"KXITXbKuE60WSUDs7NZVLQ","stars":2,"date":"2012-05-29","text":"Disclaimer: This is a vegan's view\n\nI expect most high-end restaurants to be able to put together something vegan, especially if you ask without regard to price. But after being seated here with a fairly large party, I asked what my options were for something vegan. I don't expect miracles, but in Carnevino, the waiter came back and said the chef would take care of me. I ended up with salad and some vegetables, but filling enough and very good. And I had something with every course.\n\nAt Table 10, I got a response that I'm used to from chains like Applebees. The waiter came back and said that they didn't really offer anything vegan, and only suggested a salad, though didn't offer specific recommendations on which had dressing without egg or dairy. Ultimately I ordered fries, spinach, and charred peas. It ended up being filling enough, but unsatisfying overall. The $9 serving of spinach was ordinary, though the charred peas were good.","useful":0,"funny":0,"cool":0},
{"review_id":"toM1cwhRn0xx-DFYUVMPRw","user_id":"SdKbaLOpxCn9zJPszXQltg","business_id":"PwpSY0vO3XlQXKOuqiqZMQ","stars":1,"date":"2012-05-29","text":"Disclaimer: a vegan's view\n\nI often don't bother reviewing restaurants with poor vegan choices, but feel compelled to here because this one couldn't even get me a salad that was sufficient.\n\nI thought I'd get pizza with no cheese. Their pizza dough has egg in it.\n\nOk, salad. ALL of their dressings except for one also has egg whites in them. That's odd, but whatever. So I get the chopped vegetable salad with the one dressing they can offer. The salad was mediocre and meager in portion size. So after lunch here I had to go find something to eat.","useful":1,"funny":1,"cool":0},
{"review_id":"-HPHAi54BgplFubSKy8gGA","user_id":"Zh3i-pVrhb8UrCE0lkBfig","business_id":"raVyoZbWWuN7JcFUdT7k2g","stars":4,"date":"2014-01-15","text":"Very good, creative Asian\/Thai fusion cuisine! Nice, low key club atmosphere. We went on a Tues. evening, which was Tapas Night, with three generous tapas dishes for $20.","useful":1,"funny":0,"cool":0},
{"review_id":"5cVvvSNgMaKHvURXhxyIIQ","user_id":"rxIQSA15QvO4LUYbp6NuBw","business_id":"0UlMUHtEDgDMkycBQpoAew","stars":5,"date":"2016-09-29","text":"Following our review, we immediately contacted by the general manager.  I am extremely  impressed in how our concerns were handled.  We will definitely return.","useful":0,"funny":0,"cool":0},
{"review_id":"Gl1zXZzQXFuLSoT_YKUBAA","user_id":"T9240z_FiwKZoCtibHZMew","business_id":"l-UsKevA9YyOM4wGtS5gGw","stars":1,"date":"2016-09-12","text":"Pumped my gas and self paid outside.  Went into the store to buy a drink...  Returned to find gas dripping onto the ground and shooting out of my tank! The pump overcharged me ten dollars.","useful":0,"funny":0,"cool":0},
{"review_id":"sLz4aFFV0Ci_YDKnGQMWMw","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"_PfpHaeuekLUGaKKtee2KA","stars":5,"date":"2016-07-28","text":"Amazing customer service..before I even walked through the door I was greeted. I came in for an estimate and it no lie took a total of 10 mins. 15 mins max.","useful":0,"funny":0,"cool":0},
{"review_id":"4jOKulXwODQpFFPfPQ0ThA","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"ExQpwVK2xg6w3Ip4tKyvhA","stars":1,"date":"2016-08-20","text":"Here with my friend to get his car fixed. The place is behind autozone, and it's pretty run down. The receptionist is rude and a smart (butt)..two qualities unneeded when already frustrated with a broken down car lol. Before we arrive we call to find out what parts will be needed..we go buy the parts. We get to the place and he tells up that we'll need additional parts. We ask for a print out\/quote so that we can take it to autozone (to compare prices). He says \"you can write it down. It'll all be about $50.\" Ok cool whatever. We go back to auto zone, receive a quote of $23, buy the parts and head back to the shop. Once at the shop the receptionist says oh yeah you'll need two bottles of that. -_- so back to auto zone. Hopefully this'll be the last trip.","useful":1,"funny":0,"cool":0},
{"review_id":"q2tb_b3y9sHxvRkQiMsN-g","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"42DvUONuqa1mC1YbnZ0o0w","stars":5,"date":"2016-08-17","text":"One of the best Taco Bells I've been to. I came in around 1230 on a weekday, and it wasn't busy at all. I placed my order and went to wash my hands..by the time I came my food was ready. So you know how you'll take a bite of your food and the contents fall out of the opposite end? Well that's what happened with my beef chalupa (that's a good thing). The food was fresh and they weren't skimpy with the meat or anything lol. Customer service was good as well. No complaints!","useful":0,"funny":0,"cool":0},
{"review_id":"fU9wCVzNAJzR-2nYbRJPqA","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"zG5XbWcg7GNqyZtz112XjQ","stars":5,"date":"2016-07-21","text":"So one thing that really stands out to me: one of the employees (John I believe) emailed me a copy of my inspection before coming out to talk to me. And the email included pictures! I've never seen this before. Maybe I'm behind, but before coming here I always went to Honda of Concord and Scott Clark Honda (wouldn't recommend either) and I've never seen this. I'm always cautious due to receiving false info regarding needed car repairs. This definitely gave me a peace of mind. This is my third or fourth time coming here and I'll definitely be back. The only downside for me is the business hours of 8-5 but aside from that I love this place.","useful":1,"funny":2,"cool":1},
{"review_id":"xs0BMHzhi5hUwkcMlgHiMg","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"-cC2BgtL4fBfZx3w6tAgyw","stars":4,"date":"2016-08-19","text":"Cheap wine! Cheap fruit! Cheap everything! And friendly staff. Living in Charlotte it's nice to come here and not have to wait in Walmart-like lines or fight through traffic, nice location.","useful":0,"funny":0,"cool":0},
{"review_id":"ZAer7okI2e9ceGT5zv1yJw","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"Z15a7_8FQ82_baSJiqMoIw","stars":5,"date":"2016-08-15","text":"Great service so far. It's a Sunday around 8:30. We were seated immediately, and the waitress too our drink orders before we even settled into the booth. We ordered wings and the nachos to share. Ultimate nachos are plenty to share. Wings are always flavorful and hot. Oh and they're playing Real Housewives on one tv, Law and Order on one and the Olympics on others. Perfect!","useful":0,"funny":0,"cool":0},
{"review_id":"rJBnimtD0vPkziwJ83Mh9g","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"wMiOsYLtgwbUoyV2DttqMg","stars":5,"date":"2016-08-18","text":"So I've been to Harris Teeter several times but never for lunch. Their pizza is better than any chain pizza place. No lie. And their sushi is always fresh and good. Friendly employees and there's a Starbucks with dining space.","useful":1,"funny":0,"cool":0},
{"review_id":"VD2B8X-IDZodziQHHlMUPw","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"UhdlNJz_ZNb-m3kF-YLSgw","stars":4,"date":"2016-07-09","text":"If you love cheesiness you have to get the chipotle cheesesteak. It's honestly one of the best subs I've ever had. I've been a couple of times where the bread wasn't the freshest, and the AC was broken, but other than that I love it.","useful":0,"funny":0,"cool":1},
{"review_id":"6xBYOr4EsK9NcOcLm8jb_w","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"OIO1RVPOE6kfqnPptF38-Q","stars":4,"date":"2016-07-23","text":"I got here at 3:45..I'm about to head out at 6:15. Mani and pedi. They were really busy, which was fine with me today since I wasn't in a hurry. They're very organized and clean. I like that they use disposable sponges to scrub your feet. They've been open for about two or three weeks I think, so all furniture, equipment and polish is nice and new. I wasn't greeted when I first walked in, but the staff were nice and personable. They offer a variety of complimentary drinks (red and white wines, water, sodas). They're offering 10% off all services at the time, so my mani and pedi came out to $45. I'm pretty happy with the experience overall.","useful":1,"funny":0,"cool":0},
{"review_id":"O0ttxNGxHKtD8Cnnwc_j1g","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"WdBWhGe4Siqg3IYTc4_K4A","stars":1,"date":"2016-08-15","text":"Sunday at 8p. Not many people here at all. We were seated for 10-15 min, and no one came to take our drink order. We were nicely greeted at the front though. Guess there was a disconnect between the hostess and waitstaff.","useful":0,"funny":0,"cool":0},
{"review_id":"DpCZVwANot4HD03meiuCRw","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"Y1kXjWwEhQvtk6e7tXiXXg","stars":3,"date":"2016-08-19","text":"It was 21 and up at one point and was the best place to be on a Saturday night. Drag\/talent shows, good music, main level, second floor and outdoor patio. The first floor has two separate areas (different music). The cover isn't bad unless it's a holiday. Then they changed back to 18 and up. Blah. Not the same. At all.","useful":0,"funny":1,"cool":0},
{"review_id":"kbl5QRi92tdogxpkJD4fxg","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"mIwbgnIAuPGpsEqQktZUWg","stars":4,"date":"2016-09-27","text":"They have really great customer service at all levels (greeting, when taking orders, ringing up order, bringing out food and even when leaving). I always order the same thing, and it's consistently good.","useful":1,"funny":0,"cool":0},
{"review_id":"ZbH2WCmafJrkrhI47pyY3Q","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"ki5qgWUCuTpb9si0eJL1fQ","stars":2,"date":"2016-07-23","text":"Drive through took 30 min, no exaggeration. It's a Friday at 11:30, but it's still fast food. Gave me the wrong order, which isn't a big deal. Luckily I checked before pulling completely away form the window. They took the bag back and relaxed the incorrect items..it was still wrong lol. Everyone makes mistakes but on top of service being blah and the wait being so long..yeah..not a happy customer.","useful":0,"funny":0,"cool":0},
{"review_id":"7pRTYpVULp65uLqIIyRf1A","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"MtzjOi57BkQrqF8wqNOyHg","stars":5,"date":"2016-08-19","text":"Love this place!! The food reminds me of Thanksgiving back home. So one thing that really stood out to me..I called to see if they had banana pudding. The lady answered and told me yeah. Cool..we head to the restaurant. About two minutes later I receive a call back and it's the lady from NaNas and she says, \"I'm so sorry to be calling..just wanted to let you know that I went to double check and were actually out of banana pudding right now. I didn't want you to drive all this way just to find out we didn't have it\". So this may seem pretty simple, but it was a big deal to me. She didn't have to call back - she was so nice and personable. We still ate there of course lol. I was too stuffed for desert anyway. But really friendly people, gave food suggestions and samples. Would recommend.","useful":2,"funny":1,"cool":2},
{"review_id":"YRpbVd-IVQWF6NQjpUkDWg","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"lHYMeXf8JH1Q8Dazn9s3Gg","stars":5,"date":"2016-04-16","text":"Couldn't have asked for a better experience. Justin and Gilley helped me out and they were both super friendly and professional. They repair flat tires for free, and didn't try to sell me on anything I didn't need. Will definitely go to these guys when my tires need replacing. Thank you!!","useful":0,"funny":0,"cool":2},
{"review_id":"qb-kaFuCxQh5Rl8qilzZxQ","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"7THF9if6Jgm7vcMgFCxX6w","stars":5,"date":"2016-08-18","text":"Cheapest movie tickets in Charlotte, especially with military discount. Reclining seats are pretty spacious and comfortable. Clean theatre. They have half off popcorn on Tuesdays and other month coupons on their app.","useful":2,"funny":1,"cool":1},
{"review_id":"E4S2OJpQorhXbtw0eIhz4A","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"sBrrWO-Nv7imsqU0e5504Q","stars":5,"date":"2016-07-13","text":"Came here around lunch time. I ordered ahead online to avoid the line. As soon as I walked through the door I was greeted by several of the workers. Somehow they already knew what order I was there to pick up. Oh and the sub hit the spot. As always.","useful":2,"funny":0,"cool":0},
{"review_id":"RF4Hf3Nhu-OHCrP4WXsTow","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"JnhuORtEQOW8XkVXB3l2tQ","stars":5,"date":"2016-08-19","text":"I use the pharmacy here and I've never had a poor experience. So I initially used Walgreens on N Tryon (avoid x10) and wasn't satisfied with the service, so I switched to CVS. The lady was super helpful on the phone. She called Walgreens to get everything sent to cvs. She was patient when I couldn't remember the name of the prescription and placed her on hold to look it up. I've been to the pick up window maybe twice and inside two to three times. They window service is prompt, but the speaker is damaged so you can barely hear anything they're saying. Overall, nice experience. Nice staff. Clean store. Doesn't seem to get too busy.","useful":0,"funny":0,"cool":1},
{"review_id":"Ocmvx8ZH1cSmo-bm8d675A","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"AdtaU4YPa5ejSsepQHfkQA","stars":1,"date":"2016-06-09","text":"I called to see if my prescription was ready and see how much it'd cost. After 45 min of holding I just went to the store..just to find out they don't accept Tricare. They move super slow and weren't helpful at all.","useful":0,"funny":0,"cool":0},
{"review_id":"lpzRJDEDMlfEqXQbzXur8A","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"dY7erNwqdfjVrgigPUcoGw","stars":5,"date":"2016-07-16","text":"The red wines are my fave..very sweet. We used the groupon which was about $15 for both of us. The groupon included wine tasting (with storytelling), wine tour, souvenir wine glass and a full bottle of wine. Yes, there's a dog walking around and a red solo cup for dumping waste, but its a really nice vibe to me. They have rocking chairs, picnic tables, corn hole, a lake and lots of greenery. Oh and live music on Saturday nights. They have a friendly and diverse staff - always a plus. The atmosphere is very chill..would recommend to friends.","useful":1,"funny":1,"cool":2},
{"review_id":"G2A0UZliYiooT8aWyLY9QA","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"jUF7BSWB2s7Xgp5PbISbsg","stars":4,"date":"2016-06-13","text":"I go here all the time. Aside from them always being out of Mac n cheese, I have no complaints. Foods really good and they give you more than enough","useful":1,"funny":1,"cool":1},
{"review_id":"cKsCaQ3wd878kFMGy0sDzA","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"7LLU_dpe7iN97nJzYmTvjQ","stars":5,"date":"2016-07-09","text":"I usually get the hibachi chicken and steak. It's really good and affordable. The lady at the register is always nice. I've eaten in like twice and called in for carry out 5+. No complaints with either experience.","useful":0,"funny":0,"cool":0},
{"review_id":"u1ya23pPwRo2YeJd_BDBdw","user_id":"ic9zIsm7zoxUm3Axyegx8g","business_id":"S4Gb3V7p5piEqRaP8dk1oA","stars":4,"date":"2016-08-19","text":"I love this place. I've been about four times and there hasn't been a night I didn't enjoy. The most recent show I went to was a comedian from Wild n Out. Hilarious. The set up is fine. Staff is friendly. I don't think they typically have food\/drink specials (on weekends anyways), but the prices aren't too bad. If you're having trouble finding the building..go down the ramp you'd use to get to Label, or you can go in through Wet Willies and head to the back.","useful":0,"funny":0,"cool":0},
{"review_id":"CWdKu6u8k_Q966nQntqUsQ","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"uOWWk2duBzNao8fiQFWkJQ","stars":2,"date":"2011-06-02","text":"Broad ideas and poor execution -- Wild East tries to offer so many different cuisines that it's difficult for them to perfect any of them.\n\nThe menu is vast, from sushi and sashimi, to curries, pad thai, rice bowls, chinese-style fried rice and noodle plates, teriyaki plates, etc. Our party of four started with some appetizers that were underwhelming (overuse of large sauteed onions), and the main courses were generally unsatisfactory. The curry was described as \"very mild\" but was spicier than the sweet\/hot thai dish which was described as \"spicy\". The teriyaki was served with rice, but there was not enough sauce to put the rice to use, whereas the thai dish was swimming in cloyingly sweet sauce that tasted like it came from a jug. The California King Crab roll was small for the price, though the flavor was apparently good.\n\nThere was a wait at the door for a few minutes while they prepared a table, but when we were shown to the cramped booth, there were several empty and clean booths on the way, why the wait?\n\nOur waiter was also a bit awkward, bringing entres out over a five minute span instead of at the same time.","useful":0,"funny":0,"cool":1},
{"review_id":"dniyMgz75aFbp0uREyB6jw","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"-O31O2krgdg7quizo3LcCA","stars":5,"date":"2011-11-22","text":"Excellent baked goods, the cupcakes are excellent and moist, with delicious frosting.\n\nThe lunch menu is a reasonable size for lunch. Eating here you'll be full, but not stuffed. If you want quantity over quality, go to a buffet. The ingredients have been of the best quality, and well prepared.\n\nThe fresh salads are well balanced and served with a reasonable amount of dressing - not a vat as would be served elsewhere to tempt you to grossly over-dress your salad.\n\nCoffee and Tea selections are excellent, and well prepared.","useful":0,"funny":0,"cool":0},
{"review_id":"iBmSHWiwWuPd2pCzrj0Keg","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"IFXsOJvq8BaaLjGij639Ow","stars":2,"date":"2011-08-30","text":"In short: avoid the steaks.\n\nWas there with a group last night, and had a poor experience generally. The wine\/beer list is varied, looks well curated, and is not overpriced (though not cheap). I had half-sweet tea which was a bit more tannic and less sweet than I would have expected, but still good. My wife had a good bottled cider. The pretzel sticks before the meal are a cute touch, and they work well.\n\nWe skipped appetizers, though we tried some of the lobster mac-n-cheese that a friend ordered and it was good.\n\nFor our entree we each ordered a steak, the spinalis (medium) for myself, and a filet (rare) for my wife. The spinalis is a tough cut to cook right, so the slight overdoneness can be forgiven, but it was also over seasoned and poorly trimmed. The steak sauce with which it was served is very one-dimensional, and did not pair well with the arugula\/parmesan garnish at all. Would avoid the sauce if you want to taste the beef. My wife's filet (ordered rare) was medium-rare at the thicker end of the cut --yes, a filet with a thicker end-- and was medium\/medium-well at the thinner end. This imparted a chalky mouthfeel to what should have been a silky cut of beef.\n\nMy steak was served with fries, though I asked for the truffle-parm fries. The fries were a sad portion, with a few full-length fries that were cooked right, and the rest of the portion looked like the leftovers from the bottom of the fry-basket --short and burnt. The truffle oil was applied too liberally and smelled almost scorched. My wife's steak was served with yukon gold mashed in a cast iron skillet, and they were moist and delicious. Would recommend the potatoes to other patrons.\n\nI had opportunity to try the dessert paired with the prix-fixe vegetarian meal, which was a chocolate-and-berries cup with whipped cream. The cream was delicious and a great pairing in general, though the chocolate hunks should have been cut smaller - they were three-bite size.\n\nI imagine that you can have a delicious meal at Zink, but when you're not precise with temperature, lack delicacy with seasoning, and are missing some small but noticeable details, it shows. If I were to return I would stick to easy-to-execute and more forgiving dishes like a burger.","useful":1,"funny":1,"cool":0},
{"review_id":"KVs4--zveYc1vqWQhdKs8Q","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"06graki4XxJJJp5b8H9aGg","stars":1,"date":"2012-02-07","text":"We order lunch every day for the office, and someone always goes out and picks it up.\n\nOrdered Skillets today, and they added an 18% gratuity to a large take-out order. Refused to take the tip off when confronted about it.\n\nWe will never be going back.","useful":6,"funny":2,"cool":0},
{"review_id":"hiHnWREUPc1r6nGOhmvHdg","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"ui8KERxCwlx8B5vWvpXxqg","stars":5,"date":"2012-06-15","text":"My wife and I have been to this Hawthorne's a few times, and though they've always been good, our first visit was noteworthy for being perfectly executed.\n\nExcellent service: the waitstaff has a good knowledge of the menu and is able to answer questions and make recommendations when you're not sure about your selection. Consistently quick with bringing food to the table, clearing dishes, and taking drink orders. Great waitstaff are great for NOT being noteworthy, they just make the meal progress and everything happens at the right time, with very little fuss.\n\nThe pies are excellent, try the special-white (ricotta, pesto, sundried tomatoes), and the plate of meatballs as an appetizer. The food has been consistently better than most other pizza places in the area.\n\nThe beer selection is good, with a couple options on the list for beer-snobs, and not unreasonably priced.","useful":0,"funny":0,"cool":0},
{"review_id":"3bKvxeQx9r5f7znEjyBD2w","user_id":"NaORI-qPPhej_Ce_sRH2Iw","business_id":"yIBeZebnXb-hvexqknnDCg","stars":5,"date":"2014-04-04","text":"Last night my wife and I enjoyed a nine-course tasting menu, and I had the best crab cake, salad, salmon, steak, and cheesecake I've ever eaten - all in one meal.\n\nOur meal started with a crab-cake and a small crab salad (with dill, apple, and celery). The crab cake was so warm and fell apart beautifully, perfect spicing, a little n'orleans remoulade underneath, and the lump crab was so sweet and tender. The salad was rich and creamy, a few bites of decadence.\n\nWe then had an artichoke bisque, which was unfortunately the low point of the meal for both of us as neither of us loves artichoke much. The base of the soup was fantastic, but the tough bits of artichoke were just okay, and the cracked pepper garnishing the dish was very coarse ground (which provided contrast to the consistency of the soup, but seemed out of place).\n\nThen on to a baby wedge salad, mine with blue cheese and buttermilk, Barb's with a housemade vinaigrette. The salad was composed with perfect bacon, dried bing cherries, spiced pecans, the blue was fragrant without being overwhelming. Barb's vinaigrette had so much body and cling, with such great balance that she couldn't stop making pleasant-eating-noises - you know the ones.\n\nWe had a little sorbet (blackberry, such concentration of fruit flavor), and then the three main courses.\n\nThe salmon was served with wilted spinach and a potato hash, but the salmon itself was cooked to a perfect and consistent temperature throughout without overcooking the edges, or a slightly-underdone-center. It had a gently spiced rock-hard crust on one side, with perfectly cooked salmon immediately below. The plate was served with a smooth and tangy lemon beurre blanc. Best salmon I've ever had.\n\nNext was the duck course, our server Johnathan mentioned reminded him of Christmas. Beautiful rare duck breast, served on a bed of whipped sweet potatoes (perfectly smooth, none of that stringyness you sometimes get with sweet potatoes) that had been flavored with vanilla and brown sugar. Not overly sweet but absolutely decadent, and a small serving of sauteed brussel sprouts. The richness of the duck offset the cabbagyness of the sprouts, and the sweetness of the potatoes was a great offset to that pair. On top was a single sage leaf - the most fragrant I've ever smelled - which tied it all together and made it feel like christmas.\n\nThe third entree was the filet mignon, what Barb would have chosen, had we only had one choice of entree. Served rare to mid-rare, it had the same amazing cookery as the salmon, where the temperature and doneness was consistent throughout to almost within a millimeter of the soft crust. Served with a green peppercorn sauce, by far my favorite sauce of the night, which had spiciness and richness. The mashed potatoes served with the filet were nothing much on their own, but served as a perfect vehicle for the sauce, and the braised collards were noteworthy for both their balanced flavor as well as the fact that they were perfectly cooked. The greens had little snap in the backbone, they weren't wilted as so many collards become. They were barb's first bite off the plate, and made her eyes light up and she was almost rushing me to try a bite. The steak itself was pure silk on a plate. Warm, lucious, flavorful (uncommon for a filet!). Unfortunately, I do think that Barb's half of the filet was slightly more cooked, and came out mid-rare\/medium, but mine was perfect.\n\nNext, a small goat-cheese log stuffed with dried fruit, rolled in crushed nuts, and served with two pieces of baguette. The baguette had a wonderful quality of being crisp and light (like melba toast, but not as dry), without having a crust that was so hard as to be painful to the gums (as so many toasted baguettes do). Also on the plate were a few tiny slices of celery, and a small drop of wildflower honey. This is not your store-bought-in-a-bear-squeezy honey, but rather it was fragrant and flavourful, very sweet, and brought out a dessertlike quality to the cheese\/nut\/fruit\/bread combination. Barb, I'm sure, would go to great lengths to find that honey again, she enjoyed it so much.\n\nLastly, the cheesecake course. When it arrived, it was small, and we both looked at eachother and said \"this is how cheesecake should be served\", not a huge slab that's a chore to work through, but a small indulgence at the end of the meal. It was rich, but fluffy, and so moist. None of that powdery or clumpy feel that you get at a factory. Served with a bourbon-vanilla-cream sauce on the plate. The sauce was sweet, complex, but not cloying. The cheesecake was sweet and rich, and I mopped that plate clean. But the whole course was never too much of anything, it was just a perfectly walked tight-rope, never too sweet or too rich, never too moist or too dry, but everything was executed wonderfully.","useful":3,"funny":0,"cool":0},
{"review_id":"cfn0Zv55asyNFNM841t51g","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"momjERcb6G6ienrfPuNArw","stars":5,"date":"2014-12-14","text":"This is some of the freshest, best tasting food - and you will crave it.   The staff - ask for Abner- is friendly and attentive. My favorite is the \"soup on the side\" but too frequently I have company and it's not a great sharing dish. The curry is great - and go spicy - it's a tollerable heat.  One more advantage - good wine list, all bottles just $20. Enjoy one of my favorite spots.","useful":1,"funny":0,"cool":1},
{"review_id":"mhwL-HRreGdiXVkZtOCY4w","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"iIjVO7cLD1UEmIO7G05Ujw","stars":5,"date":"2017-08-12","text":"Craving Rosita's - have been coming here for 20 years. Never disappointed. The staff is so friendly and efficient.  The food is always fresh and mouth-watering delicious. Can't find a better place - and we have some great competition locally.  Spend locally, eat locally and support local jobs.  \nCan't wait for the annual summer vacation to end and the doors reopen.","useful":0,"funny":0,"cool":0},
{"review_id":"XeLWSsEgrS-wY55FhVrxaQ","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"fSBhe0A6Dfa8JCYccfpMog","stars":5,"date":"2016-03-13","text":"Best tasting bagels in Arizona and of anywhere that I have tried in the world.  The owner makes you feel like family.  My son loves to go too.  \nMy staple - bagel breakfast sandwich with lox.","useful":1,"funny":0,"cool":1},
{"review_id":"BPu3lazlo804lBUjVRPTJg","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"mnwRtuVQEsIUomBchu0gwg","stars":1,"date":"2016-03-13","text":"Walked out.  Host staff disorganized. Plenty of seating and they say, \"it'll be a 15 minute wait.\" Then take number to text when the table is ready.  They've called non-stop since. We went to Arcadia Tavern -- far better and friendly!!","useful":4,"funny":2,"cool":1},
{"review_id":"fFRuqNlRKM8u_o3tYS4Paw","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"luNd6T7VYFQZvfipwBYtsg","stars":5,"date":"2017-09-10","text":"The staff here is incredibly informative and professional, willing to answer any question and help customize a uniquely personal regimine.  Give it a try. Neil provides exceptional customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"vURAQqDU50fj9HM8L88wjQ","user_id":"R9sFeYJ4hgpnUYaFk2kp1Q","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":5,"date":"2014-12-14","text":"Genova pizza is amazing.  Pesto that will light up your palate. Potato that smoothes each bite.  Italian brick oven pizza crust. Simply amazing. Go enjoy.","useful":1,"funny":0,"cool":0},
{"review_id":"ZlYFKkneDMFIUV_vAQ9brA","user_id":"4RXC9BnjoABuNxd6rELUbw","business_id":"vVvJ0ZilcEw7TKjLRHTJkw","stars":4,"date":"2015-06-10","text":"I did a walk-in pedicure and ended up getting a gel manicure as well. Cathy took great care of me and did a very nice and quality job. Everyone was very friendly. Highly recommend this nail salon.","useful":0,"funny":0,"cool":0},
{"review_id":"u_EZI2txD3S89IAj47FCHA","user_id":"4RXC9BnjoABuNxd6rELUbw","business_id":"QjkA38rDhT_HdN5M31skqQ","stars":5,"date":"2017-08-31","text":"Tony did an amazing job on my door dings and even buffed a scratch I had. It looks great. Highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"zHDqdbvKWvJB9uPYum5EDw","user_id":"kNp9UXukhGozlSkTE0-krw","business_id":"aP2ZadiZMZvIXyikcNfQPA","stars":2,"date":"2015-11-20","text":"I have to start by saying that I love their goldieritas. And I love that they are across the street from me... Which is why I want to love their food. The first 10 or so times I went, the food was great. But the last 3-5 times, the food left much to be desired. The quesadilla had no cheese, only chicken. The chili is not even similar to a real chili. And the focaccias are not as tasty as they used to be... Where's the filling in the focaccia?! I used to love bringing friends there, but now I am too embarrassed about the food. My last friend date just pushed her food around and said that it was \"interesting.\" This is a great spot, but stop dropping the ball, Goldie's!","useful":0,"funny":0,"cool":0},
{"review_id":"br7gMymEDNB-ziOnNKGk3g","user_id":"kNp9UXukhGozlSkTE0-krw","business_id":"yaEZHD2NsTkq3CM6mQimWA","stars":5,"date":"2017-05-12","text":"I was referred to Dr Hobgood by my allergist. Within seconds of consulting with him, I knew he was the right doctor to perform my septoplasty. Dr Hobgood is not only incredibly personable, but he also does an amazing job! My surgery was quick, pleasant, and painless... All words that I couldn't imagine using to describe a surgery, but it's true. Although recovery lasted about 7-14 days, I wasn't in any pain throughout the process and I would describe it as extremely mild.  Dr Hobgood's pre and post op paperwork was clear and the surgery center was perfect. Even on days when I was early to Dr Hobgood's office, I never had a wait. Last but not least, I am so happy with my results! I would recommend Dr Hobgood to anyone!","useful":2,"funny":0,"cool":0},
{"review_id":"2jGxCUtBti2dGcFgzWgeFw","user_id":"kNp9UXukhGozlSkTE0-krw","business_id":"ZHiT9EIlnKMqbpBUmxSh_Q","stars":1,"date":"2017-01-24","text":"This medspa uses sample products that are given to them by reps... I overheard a conversation between employees about this and became a bit wary. I still moved forward with the service and both my products wore off in one month.. these typically would wear off after 3 months for Botox and 12 months for juvederm. They say it's because everyone metabolizes differently... but experts would say this is due to dilution. Groupon prices are amazing but not so much so considering the potential dilution and the fact that they are using free products without telling us. That being said, Lori was fantastically personable, thus earning the one star for this place.","useful":12,"funny":0,"cool":0},
{"review_id":"bl6WJnhCl0s1Jd4TUcSX_g","user_id":"AEUVAyYfaS6of9gm4UGBDA","business_id":"ZM-ljL_Y6bR4qEYsGHws5A","stars":2,"date":"2016-11-05","text":"Called to see if they had availability and a guy told me he had a no show, so come right over.  I said I was a \"10 minute drive away and it would take me 5 minutes to walk to my car.\"  I showed up at their business 15 minutes later and he had given the time away to another customer.  There's a lot of great massage places in the area.  I'll be patronizing another.","useful":0,"funny":0,"cool":0},
{"review_id":"Z8cHXXYSyofQw4G2_QGsQg","user_id":"ZPbewZ0E3ACMCP9bcFEe8w","business_id":"XeUm1QS078kgjwONhul0ng","stars":1,"date":"2017-04-04","text":"This was our first time in, as soon as we walked in the door we felt uncomfortable and the young girl that was behind the counter was not friendly, helpful, professional or service oriented at all !!!!!! The crust on the pizza was very good but, the sauce taste straight from the can. The bread with the salad was excellent but, if you want butter with your bread it's extra  $ ... lol !! Oh Yeah !! no balsamic vinegar or olive oil either.   We ordered two slices of cheese pizza , split a house salad , 1 peroni, 1 pilot grigio and don't forget the butter for our bread  $ 35.57. Lol !!! I suggest Famous Ray's Pizza 350 East Bell road Phoenix . True NY style pizza . There are many other Ray's in town but, this is the best one by far. Hands down awesome food, at Ray's .","useful":0,"funny":0,"cool":0},
{"review_id":"HQDcfxzQl9Pik0qh0oyqdg","user_id":"490j6BGPryXSTkvP6oaUlA","business_id":"XNudJHO9xBElglTwqzhh_Q","stars":5,"date":"2015-09-12","text":"Just ordered a catering order today. They arrived early, with all my food correct. Everyone enjoyed their pizza and wings! We had an assortment of different pizzas, all tasted fresh and great ! We will be ordering their catering again in the future. Thanks for the great food!","useful":0,"funny":0,"cool":0},
{"review_id":"Z4ZtKWDpaDlAm0rwnhRTzA","user_id":"490j6BGPryXSTkvP6oaUlA","business_id":"TIYnquDIPdYmVJK4GNeXSQ","stars":4,"date":"2015-09-22","text":"My girlfriend and I went here today, the food was great and the service was great. I just don't like spending $50 on two meals I can make and serve myself .. Which I am the one who went there to pay, I just feel it's a little bit over priced, as most restaurants ... But over all the waitress made it well worth our visit, she had a light lovely personality !","useful":0,"funny":0,"cool":0},
{"review_id":"fwxc4mt6XAVoKltTI4_J4w","user_id":"490j6BGPryXSTkvP6oaUlA","business_id":"iFfSUhyv0yRIiBt8y0A_xA","stars":5,"date":"2015-09-22","text":"There's only 3 other reviews for this shop and I am surprised. But I must say they gave them the right ratings. 5 stars all the way every time . I take my cars here religiously because I trust them working on my car, I trust their advice, and I am always treated with the most respect. From the manager Tony down to the techs, they have a light uplifting attitude. If I am having a bad day I come in to \"check my tires\" mostly just to see someone in a good mood. Also I like hearing them call it all out, it's a fun oil change.","useful":0,"funny":0,"cool":0},
{"review_id":"bpIiAByHAMRlJiHFqG_iSg","user_id":"490j6BGPryXSTkvP6oaUlA","business_id":"IOxRbnv2YnLtErYY3TrU3A","stars":5,"date":"2015-09-10","text":"Went in on a Tuesday and got 2 gyros for 5.99! Food. Great. Atmosphere. Great. Customers and employees. Great. I ate one gyro there and took one home and ate it the next day. It was fantastic both times !!! The bar itself is also amazing during the night life, very great atmosphere for students!","useful":0,"funny":0,"cool":0},
{"review_id":"Eh2-dDqkoJ_WEl9Ql7Ru3g","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"-Tq6H24JUsMjZLJBa5YkZg","stars":5,"date":"2017-07-29","text":"I came here to paddleboard with Outdoor Afro group. We learned how to paddle board and enjoy the beautiful weather. They had an opening tonight with free food and drinks.","useful":1,"funny":1,"cool":1},
{"review_id":"wV7vNA4a_Bf1TBTTr9TWSw","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"kRhjWeAPs-U5RmakIKz0Pg","stars":4,"date":"2017-07-11","text":"I went to Bingo Monday's and had a great time with friends. The lamb sliders are AMAZING! Love the outdoor seating. I would definitely recommend this place if you need something fun to do on a Monday night.","useful":0,"funny":0,"cool":0},
{"review_id":"v_aFreRhHac5KnKp2zsBig","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"T2tEMLpTeSMxLKpxwFdS3g","stars":5,"date":"2017-06-26","text":"I've always been leery about fish tacos and have yet to find a good one. Cabo's Fish Tacos are one word, \"AMAZING\"! I ordered there Honey Soy Glazed Salmon Tacos and they had the perfect seasoning and very tender. I also had the Carne Asada Tacos. If you are a beef eater you can't go wrong with these tacos. Again, seasoned perfectly and although the beef was cut in chunks they were still tender juicy pieces. And the spicy guacamole pasta as a side was probably one of the best pasta salads I've ever had. This restaurant gets a perfect score from me. I will definitely be returning here.","useful":0,"funny":0,"cool":0},
{"review_id":"MCZ0SkGOhVGLrZl42jZiGA","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"QeDkfLmXVguytF3Of9zg-Q","stars":2,"date":"2017-06-11","text":"The grits were a bit dry\/crunchy and the crab cake croissant sandwich was salty. However the mimosa was fantastic! I loved the dinning area. I was able to sit inside but still enjoy the outside air with the windows being open. Over the environment is great and the employees are nice but I wasn't completely impressed with the food.","useful":0,"funny":0,"cool":0},
{"review_id":"sjLCbfFxs0WecLmojmgIFg","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"zDKH2ua2DauqiWOAP9yz7g","stars":3,"date":"2017-06-27","text":"Although the service was great, the food was just okay. I loved sitting outside on the patio and enjoying the fresh air. I had the buffalo chicken sandwich and I ordered it spicy instead of mild. It was a pretty decent size sandwich but definitely not spicy. The side order of fries were pretty good. My friend ordered the home made chips which were also  pretty good. Parking is easy, but during prime time (between 5p and 7p) it may be a little dicey to find a spot. I would go back simply for the atmosphere, oh and the drinks are pretty good. (This is a late post. I actually went last night for dinner and forgot to write a review until this morning)","useful":0,"funny":0,"cool":0},
{"review_id":"tDXY4qXQvazciCsmiWI6iw","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"1Geg7R5ACFL0oassVziNiQ","stars":5,"date":"2017-07-04","text":"I went to this Crispy Crepe for breakfast on the 4th of July. It's a cute and quaint restaurant. You have the option to sit inside or out. I ordered the egg and veggie omelette that was nothing but amazing! My side of fruit (melon and pineapples) was freshly cut and delicious. The crepe is huge so come hungry. Parking is easy. There's a free parking garage behind the building or you can park on the street. This is definitely a new favorite spot for me. I will be back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"e5PXNL6YhkxracbWS9TyJw","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"o5QDrg_kb4hgsWxV6cV_Uw","stars":5,"date":"2017-06-18","text":"Let's just say I found a new favorite breakfast spot in Charlotte. The Southern Scramble was amazing and I'm not big on cheesy but they were delicious! Normally when I eat out I have leftovers, but today I cleaned my plate. The atmosphere is fun and the customer service was great. I will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"Rd-sbwjPRMnOiyt9DBozjA","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"MMs2BKvQau-kSl-kmNRcAw","stars":3,"date":"2017-06-24","text":"After a long day of kayaking this was a great stop afterwards to unwind and relax by the river. The J Peters Burger was okay. It's pretty huge, I could only eat half. The fried were fresh and delicious. I would want to come back and try some appetizers.","useful":0,"funny":0,"cool":0},
{"review_id":"yDxgG5d0RXwL20HyaAjUnQ","user_id":"caV30R9uCewFdvtdhDg3Nw","business_id":"Uftnd7njdHNFxhz_6rpUrA","stars":5,"date":"2017-09-16","text":"I love the outdoor seating here and the atmosphere is really relaxing. The duck taco is delicious, mostly sweet with some spice. The shrimp bun was very good as well. I never thought about a shrimp patty and may try it at home! Great choice all around. The food portions were just enough. Oh, and the hurricane punch (half of the proceeds go to victims of the recent hurricanes) was very delicious as well. Nate was my server and he is pretty awesome with lots of energy!","useful":0,"funny":0,"cool":0},
{"review_id":"X4glBKsOvs6fgjHNJ0IUjw","user_id":"xDjaGtx-TZUDdUxRKJnKCA","business_id":"fIuquIgWrkNEM5yvYSHPgw","stars":5,"date":"2014-08-05","text":"What a compassionate and thorough professional.  Our family had the pleasure of meeting Dr. Gilchrist and his associate Alex today when they came by to assess our 14 year old dog. This was such a positive experience for our dog to be examined in the security of her home. We were given plenty of opportunities to ask any questions and our questions were thoroughly answered. We will definitely call Dr. Gilchrist again.","useful":3,"funny":0,"cool":2},
{"review_id":"Q8eonI5I2oIKZkoZoplOgA","user_id":"xDjaGtx-TZUDdUxRKJnKCA","business_id":"a27HkTUMzJrFFuv6ty6Ldw","stars":1,"date":"2016-10-20","text":"Worst experience ever and it keeps on haunting us!  We moved our daughter in to the District on Apache in August 2015.  During her time of residency, she and her room-mate were chased by an aggressive trespasser resulting in them filing a police report - apparently the security gates and doors were not working properly.  Additionally, her vehicle was towed from the premises in error and subsequently damaged in the process - courtesy of the towing company hired by The District.  The District had been paid for our daughter to lawfully park there and did nothing to resolve the matter when the serious problem presented itself.  Our daughter was forced to be late to her place of employment as well as to make arrangements to retrieve her vehicle from the tow yard.  Finally, we knew that we were dealing with unscrupulous individuals at the District and therefore, made sure to request a physical walk through at the end of her lease this past July '16.  A maintenance representative walked the unit in our presence and provided a written receipt that the unit was in good condition \"no damages\".  This week, more than 75 days later, we receive a bill from the District for apparent damages that have since been found.  Do yourself a financial favor, and look elsewhere.","useful":2,"funny":0,"cool":0},
{"review_id":"6vCMRobc9X_hlhsnSfHH2A","user_id":"WncPRE2uAJ3eQx4MG6uYRA","business_id":"Y9kXVlU4xPfSZvkZH6C_2Q","stars":1,"date":"2017-03-20","text":"Horrible service!!! Ordered a pizza online and when I came in to pick it up, it wasn't ready. Waited 30 mins for waitress to tell us that the pizza got stuck and they are remaking it. By the time I finally left with pizza in hand, we waited 1hr 30mins. We got no sorry for the inconvenience, no this is on the house... NOTHING!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"uDgWTAh9VcfbdtwV1Mukqg","user_id":"WncPRE2uAJ3eQx4MG6uYRA","business_id":"3pSUr_cdrphurO6m1HMP9A","stars":5,"date":"2017-01-01","text":"This place is amazing so much fun!!! I would recommend for any celebration! You have the quietest people getting up and singing. I love this place will be back again.","useful":1,"funny":1,"cool":1},
{"review_id":"oPOGbmUKKXrcJ1QKy9DWMw","user_id":"TAOJZgcPSBkJAZb7Wn00ZA","business_id":"xkVMIk_Vqh17f48ZQ_6b0w","stars":2,"date":"2017-03-20","text":"Very disappointing! I've been to many high end steak houses in the Mid West and Craftsteak would not rank in the top 10.\n\nThe good :\nAll the sides we tried were very good. But at $15-$22, the sides should be good. The risotto was the favorite. The mashed potatoes are also very good. The Caesar's salad was a classic with real anchovies. \n\nService was decent but a little slow at times\n\nThe bad :\nI had the grilled NY strip bone in ordered medium. After a lengthy wait. The steak came out way past medium. I sent it back. After another 15 minutes another steak came cooked properly. My wife finished her meal however before my second steak came. But the steak was the worst $50 steak I've ever had. For a dry age steak it was very tough. Even with the steak knife it was hard to cut. Most high end steakhouses will trim the gristle and fat from the outside of the steak but not here. I only ate half of my steak. \n\nThey offered nothing for the inconvenience, no free desserts or discounts on the meal. Just a sorry. \n\nWe made reservations at 7:45pm. There are plenty of tables available when we called. We got seated next to the bar, in the bar really. Terrible seats! Loud and constantly getting bumped by people at the bar. \n\nThis is not what i expected from a Tom Colichio restaurant.","useful":4,"funny":2,"cool":0},
{"review_id":"2_GW45qzk7vqLukTZW5GFA","user_id":"TAOJZgcPSBkJAZb7Wn00ZA","business_id":"hDyc9DdjGldhxis5E1rd3w","stars":5,"date":"2017-03-20","text":"Excellent! Very fresh and delicious. It's a hole in the wall but don't let that scare you from getting it out.","useful":0,"funny":0,"cool":0},
{"review_id":"F3lJBmBiPxeJDvJImTmKfg","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"ftvZ6BVmbZndKcVPEdakIQ","stars":5,"date":"2016-08-29","text":"I love this place. The variety of Arepas is great! Which makes it hard to decide which one to indulge in. So I usually go for the Arepa sampler. Which is 3 mini ones, a meat, chicken and a veggie. The side sauces are great. Go easy on the red sauce, that one has a kick! They pair well with a cold beer. Service could be better.","useful":0,"funny":0,"cool":0},
{"review_id":"DQEcOAfbaRxp8s1ijoxgdg","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"28TtvOd1npZQ-tH7Hm432w","stars":1,"date":"2016-07-30","text":"I was surprised that we were able to get a patio table on a Hot sunny Friday afternoon with no wait. Now I understand why. Slow service, bored staff, mediocre food and an over all unpleasant experience. It's burgers and salad...! How do you mess that up? Apparently you can. You're better off dining on street food.","useful":0,"funny":0,"cool":0},
{"review_id":"t8XI-hIXaaeWqWTFqfVLvQ","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"DXl9YviWyzAwMeUtrBPW7w","stars":1,"date":"2016-08-25","text":"A friend and I walked around the neighbourhood looking for a place to eat and we stumbled upon because it looked lively and had great atmosphere.\n\nGreat patios, indoor seating, decor was great, good music. But that's ALL this place offered.\nThe drinks were mediocre, which came half way through our meal.\nCorn on the Cob was not cooked all the way through\nThe guac was tasteless, not condiments just onion\nThe ceviche was overly \"fishy\" tasting\nThe tacos were cold, great tasting, but warm shells would have been great. \nThe service was extremely poor and needs some serious improvement.\nOver all, visually GREAT, but that is where it ends. Terrible food, drinks and terrible service. Extremely\ndisappointing, because I love Mexican.","useful":6,"funny":0,"cool":0},
{"review_id":"r0SRB6p1cHGl825YR8rObg","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"7v91woy8IpLrqXsRvxj_vw","stars":3,"date":"2016-06-06","text":"The food and drinks great. The service, not so much. A table was sat 5-10min after to us, they got their water, drinks and special told before we even got water or any drink menus. Same server. My drink came half way in to my meal. I've been here a few times and the food is always delicious. It's the only reason I return.","useful":0,"funny":0,"cool":0},
{"review_id":"7jFLqSQlJBSgPY6aA81REA","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"qXk2CS1-6jKTKpMUIgN9kQ","stars":4,"date":"2017-07-05","text":"Been here a bunch of times. Great bar and patio.... day and night, also always entertaining. The food unfortunately sucks and the service mediocre at best if you're eye candy. Ahi Tuna salad is particularly tasteless. Great tasting beer, but gotta give that to the beer makers. Pick your shit up.","useful":0,"funny":0,"cool":0},
{"review_id":"YtdVGqYtMTOD5e7qEDFrqg","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"eoG9zP7xxsDHVM0kJYrvkw","stars":5,"date":"2016-08-01","text":"Absolutely loved this place. We only stopped in for drinks. But the drinks themselves are worth the visit. The dinner menu wasn't very extensive but every item looked thought out. Can't wait to come back. The bar staff were very friendly and provided a fun unique experience.","useful":0,"funny":0,"cool":0},
{"review_id":"KoI5MRHwbhqCeqhMnN_Cnw","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"bLtC8xJXkd1b6MT0KjnSvw","stars":4,"date":"2016-07-12","text":"The food was very delicious. We had the garlic mussels and Cajun shrimp. Food is served in bags. No cutlery unless you ask for it. It's very messy but well worth it. The corn was a highlight if you like sweet corn. The service was not great, that was the only downfall. Otherwise, I'd love to try all their seafood!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"Vs9PxZEo-i2fweo5a6FFmQ","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"-PKUAor_Nz_IaNjP_jIwyA","stars":3,"date":"2017-05-28","text":"Food was delicious- Guac, the corn and the tacos... delicious! The service was nothing over the moon. Someone takes your order, 20 other people drop it off and the server no where to be seen. We wanted to get desert and another drink, but the waiter said that they had another rsvp for our 2 seater table in 15mins, even though there were 6 available tables surrounding us upstairs.","useful":0,"funny":0,"cool":0},
{"review_id":"2UB59dG7bPZgVSOCNgZtfA","user_id":"ZJrUFhtPyYsHUKUTAbMSEA","business_id":"zC-RnKVTlGEBmzCngDzp0Q","stars":5,"date":"2016-06-16","text":"The food was awesome. Ordered a few things off the menu and everything was great. Korean with a twist. The Ribs were phenomenal. Great staff and service. Closing soon. Very sad I check it out so late.","useful":1,"funny":0,"cool":0},
{"review_id":"bESHTsjWT4V-gYaZXNV7zg","user_id":"We0xKzwLt9vhqzus5KPgow","business_id":"ceQE2ktRVBnQsaT5aeOAeA","stars":5,"date":"2015-09-26","text":"Amazing amazing amazing spa! Both massage and facial were great as well as the customer service! Highly recommend this place!!","useful":0,"funny":0,"cool":0},
{"review_id":"ZWGVO_A5TvfRR7g2xGVMDw","user_id":"We0xKzwLt9vhqzus5KPgow","business_id":"wBSyC1z2xKcVzmRah4RPkQ","stars":1,"date":"2016-07-28","text":"RENTER BEWARE!! If I was able to give zero stars I would. AZ Management manages Lake West, Hampton House, Parkway Manor, Beacon Hill West, Kensington Club, Oxford Court, Colonial Club, Grace Apartments, and West Shore Manor- all in the Lakewood\/Cleveland\/Rocky River area. Beware of signing a lease at ANY of these locations. This management company will screw you over any chance they get. To say there is a lack of communication between management and tenant is a HUGE UNDERSTATEMENT. Communication is virtually non-existent.  If you try to reach out to these people, namely LINDA who is the office manager, GOOD LUCK!  These apartments are beautiful but you will save yourself a lot of time, MONEY, and aggravation by renting elsewhere.","useful":7,"funny":0,"cool":0},
{"review_id":"5u5PknqdguLy207CEidsdw","user_id":"64AXDc1lZYJR7ua3SPfa-w","business_id":"hdumn1NtNMgE1GbAf-HwsA","stars":1,"date":"2017-03-20","text":"I used Charlotte Mechanical for over several years until they started price grouching. My last experience was horrible. Once the technician came out and expected my pipe link. Instead of fixing the problem he told me if I didn't get additional replacement like an additional expansion tank and a new water shut off valve for my main water turn off switch. That he would not do any work in my home. The technician left my home without fixing the pipe link I had on my second level home. Which was accruing major water damage. Watch out for price grouching, I would not use them, they never give you a price quote over the phone and charge you $89 just to come out. They will not service calls on weekends and\/or holidays unless you buy their service plan.","useful":0,"funny":0,"cool":0},
{"review_id":"sJen3gl5z9NJrtHPWUGtjA","user_id":"OyA20DYvFEdlvAnpb5Ifew","business_id":"KpgPSQmQDgx3tJ6RlKVCBA","stars":1,"date":"2014-12-24","text":"Recently had pizza and wings plus two drinks. The food was decent but once the bill arrived the thrill was gone. With a good tip our bill hit $60. A bit ridiculous for pizza n wings","useful":1,"funny":0,"cool":0},
{"review_id":"OJwHSTEuN_Lw_tVgRLVkew","user_id":"c2Qj4Dzldeh6k7JcH2xWzg","business_id":"MCBsyPnsOn8kOuyCbP2O4A","stars":2,"date":"2016-11-11","text":"Cannot make reservations in holidays and weekends.  What's the point ... who needs a reservation on Monday thru Thursday?   gotta laugh at this concept.  :o)","useful":2,"funny":0,"cool":0},
{"review_id":"Q4aA8DNvZOxS8DmtZGHmDA","user_id":"bldp7R-Rm3eHoZCXnL9LoA","business_id":"OGFUJTsNlCAnUIg8OOD66g","stars":5,"date":"2016-05-11","text":"What an OVER-THE-TOP experience I had with Party Booths. I work with a Nashville radio station and we partnered with Party Booths for a major station event. Leading up to the event, the team was very prompt in answering my questions, professional, timely, and truly a joy to work with! Our listeners enjoyed the custom take-home souvenir (photo) they received and all of the photos were available to view online within a few days following our event! I would HIGHLY RECOMMEND Party Booths to anyone looking to add an element of FUN to your event.","useful":0,"funny":0,"cool":0},
{"review_id":"EZA3fmy4-uhumCpGqFcO-g","user_id":"vEjfCQCHCpHzZQLpDndCmA","business_id":"AqpiBApzrd30LA-vmU3Rvw","stars":5,"date":"2012-02-07","text":"We come to Vegas 5-6 times a year and no matter what we are coming for we always start each night at The Bar at Times Square in New York New York Casino. The place isn't huge but it has the best atmosphere, best patrons, best drinks and best bartenders (ask for Mario, he is our favorite). The dueling pianos will have you singing along to all the songs you didn't even know you knew the words to. Everyone is having so much fun that you will meet tons of people that you can hang out with all weekend long. The only down part is that they close earlier than the clubs, but other than that, I only have rave reviews for my favorite bar in Vegas. We have stopped in so many times for one or two drinks and before we know it the whole night has passed by while we sang and made new friends. You have to love a bar like that! Plus, cover is only $10!\n\nBest place to kick off your night in Vegas!","useful":1,"funny":0,"cool":1},
{"review_id":"NfEnDn6EzNFw7E4fK8lCNQ","user_id":"vEjfCQCHCpHzZQLpDndCmA","business_id":"yhYhK7tb3la5KcLlVzG5Lw","stars":1,"date":"2012-01-31","text":"We came to LAX on 1\/21\/12 for a girl's weekend and got table service. This was the worst table service I have ever encountered. The waitress was never around so we could not order anything and the bouncers are bullies to the people getting table service. This was our first club of the night and we had not even started drinking at the table but one of the people in our group was escorted out because she was \"swaying\". We tried to explain that her feet hurt and she was shifting in shoes because we had been waiting for over 30 minutes for our table to be setup, but management was rude and refused to let her back in or give us a refund so the entire group could leave. \n\nWe come to Vegas 5-6 times a year and regularly get table service at the main casino nightclubs. Do not waste your time going to LAX, but definitely do not get table service if you go there. You will get better service and be treated with more respect if you go to a kiosk bar in any other casino.","useful":5,"funny":1,"cool":1},
{"review_id":"-OETOEXrh3vTWSr-T16l_g","user_id":"vEjfCQCHCpHzZQLpDndCmA","business_id":"8Q6jl7OW8DZzwANggDspcw","stars":5,"date":"2012-01-31","text":"We came to Sugar Factory for the first time on 1\/22\/12, but this is now one of our new favorite spots in Vegas! The bartenders are so friendly and make the most amazing drinks; we especially loved the bartender KC. We had the Twinkie drink and it is our new obsession, you must try this! The food is delicious; we had salads, appetizers and dinners. You should defiantly go to the Sugar Factory on your next Vegas trip for dinner and drinks. We already made a reservation for a bachelorette party on our next visit.","useful":0,"funny":0,"cool":0},
{"review_id":"QXzgdKOdmrccxZ60Er7gig","user_id":"---PLwSf5gKdIoVnyRHgBA","business_id":"Y5CTA3S9TVkpr3Yvwaki-A","stars":3,"date":"2016-06-12","text":"I love iPic in that I don't like crowds and I hate the seat roulette, I also love being waited on :)\n\nI am almost at a gold membership for this year, seriously Im there a few times a month, and there is only one reason this isn't a 5 star (it used to be).\n\nThe seats are becoming uncomfortable, I have even sat in a seat that was broken and the back would click in and out when I would recline (I only sit in premium). The back support is starting to lose the stuffing and I have been using my pillow and blanket to fill in. The seats are also becoming a bit stained.\n\nI am hopeful that they will begin to re-stuff their seats and apply new coverings. Right now I have taken to ordering seats on the sides as they have less wear than the center seats I prefer.","useful":0,"funny":0,"cool":0},
{"review_id":"5Y_hKqpo4wb1pPtFgtCqrA","user_id":"---PLwSf5gKdIoVnyRHgBA","business_id":"kuQtE_ERgRxIbSnSIxEWCg","stars":5,"date":"2017-02-13","text":"Anna did an amazing job on my nails, I was unsure what I wanted and she helped me pick an amazing design and nail shape\/length. She was very friendly and creative! I will be going back again!","useful":0,"funny":0,"cool":0},
{"review_id":"vlJgzUq1bMH73HJ4-F1sJg","user_id":"AeYL-4rVuWfgeDJ-PGwlEg","business_id":"Uq-GOs9_IqweUsB5MdII9w","stars":4,"date":"2015-10-10","text":"No wait is too long for a classic breakfast spot. \n\nOn a warm sunny October in Toronto, it was time to check out Emma's Country Kitchen on St. Clair W. The place was packed and the wait time was 20 minutes, but the staff was very accommodating and coffee ($2) was provided in take out cups for patrons outside waiting. Homemade donuts are available too which were a hit with many (arrive early for the bacon maple donut since they run out!).\n\nInside, the restaurant is light and bright and filled with a wonderful energy. The server was on his game and was very helpful with the specials and all our needs.\n\nThe group choice was The Classic ($10) which was a heaping plate of 2 eggs any style, bacon\/sausage, delicious home fries, choice of toast and a side dish of happiness. The meal was hot, delicious and coffee refills were done promptly. I was so hungry that I ate it all before I remembered that I should have taken a pic. Oops.\n\nLots of other great meal options including eggs benedict, pumpkin (boo!) pancakes and quiche of the day.\n\nMeal was ridonkulously inexpensive for Toronto. I would definitely return for more. \n\nLots of street and bike parking. :-)","useful":1,"funny":0,"cool":0},
{"review_id":"13e5Z3OH15Zphjxue_PLXA","user_id":"AeYL-4rVuWfgeDJ-PGwlEg","business_id":"fqBnZxSkG287OOyU9LvTig","stars":4,"date":"2015-10-11","text":"Beers for you, hard cider for me.\n\nIn between downtown events, the time was right to check out Barhop for a quick drink and snack.\n\nWeather was cooperative in October, so the patio was the destination. The hostess was accommodating and the server was quick to provide the menu and options.\n\nIn the end it was a hard cider day. West Ave Heritage Dry hard cider and KW hard cider were the chosen ones and they were both great. Stuffed jalapeos was the appi which was hot (warning provided by the server) and sweet. Bacon makes everything better, right? These jalapeos popped!\n\nDef on my hip radar for another pint.","useful":0,"funny":0,"cool":1},
{"review_id":"2gcMSTZSRZQMpMBIDPrZrg","user_id":"AeYL-4rVuWfgeDJ-PGwlEg","business_id":"8PZGCtgG5MZKvz9i3B9gCA","stars":4,"date":"2015-10-11","text":"Great food with an Indian twist! You can't go wrong for $10 with the massive butter chicken wrap from Eastern Twist. \n\nNo frills, lots of delish thrills.","useful":0,"funny":0,"cool":0},
{"review_id":"_0Q8TwXpvQG85E7XkNC6Kw","user_id":"KZHdkUVKJIjbYX_7U7YfZA","business_id":"lJvcWyi6_vGWVavWkMrbVw","stars":5,"date":"2012-06-02","text":"We are from Atlanta and do Mexican quite frequently. This place is a sure bet...food was EXCELLENT, came in with a party of 6 at 6 pm on a Friday and got seated immediately, and the service was great. Not overly friendly, but very efficient and food came out quickly.","useful":0,"funny":0,"cool":0},
{"review_id":"6Scxj2LGk1tX9hzvb2xT8g","user_id":"ZxwD92_EUWEAn5VBNr9QWg","business_id":"oFAZkf2087LEilOIMWJ5xw","stars":5,"date":"2017-11-02","text":"This was the first time I ever did this. I went in for a tarot reading. The things lauren revealed to me, are amazing. I recommend Lauren to everyone.","useful":1,"funny":0,"cool":0},
{"review_id":"pl6G8YCk1OL877yv2vFemw","user_id":"1s6BOw2WYb-5fi_R71ifxg","business_id":"QJatAcxYgK1Zp9BRZMAx7g","stars":5,"date":"2016-01-18","text":"I love shake  shack it's very relaxing and  the people is uplifting and always joyful it's very clean and I love the big screen TV so you can watch your sports it's a perfect setting to be outside or inside I go there all the time","useful":0,"funny":0,"cool":0},
{"review_id":"D_CuN3l0P_wX84QuRY-4Dg","user_id":"-gtyNPUaHRCkTxgMfSVM7g","business_id":"-PL-4fFYPYrOjnNd0lO4Lg","stars":4,"date":"2016-12-04","text":"The drinks were great, and the service was acceptable - but the nachos were poor for a 'Gastro Pub'","useful":0,"funny":0,"cool":0},
{"review_id":"uwsvwOiQpXb0dWwevutHpg","user_id":"-gtyNPUaHRCkTxgMfSVM7g","business_id":"nb2Bpt5uGGZvNhnkEGMnpw","stars":3,"date":"2014-07-02","text":"We stopped in here on Canada day because OMI, down the street was closed.\nWe had wanted to try this place since it opened and were lured inside by their fish taco's on the display menu.\nWe sat outside to their lovely patio.\n\nWe indeed ordered the Fish Taco's, pulled pork taco's AND the calamari salad because we were hungry.\n\nThe food was okay - but unfortunately there wasn't a lot of it - so we also left hungry and ended up at the Loblaws sushi counter to satisfy our initial craving and persistent hunger.\n\nThe portions are really small for what you pay. I expect more than one grilled calamari tube and a small heap of 'greens' when a salad is 15$ \n\nThe fish taco's had the equivalent of one thumb size portion of fish. The Pulled pork taco's we slightly more generous.\n\nAgain the food was palatable, but not so amazing as to justify the portions vs. value.\n\nHave a beer on their patio, but if you are hungry, and you don't want to go broke satiating your hunger, this might not be the place for you based on what we ordered.","useful":0,"funny":1,"cool":0},
{"review_id":"P60Cm8kdcXxLELaD6yQisw","user_id":"-gtyNPUaHRCkTxgMfSVM7g","business_id":"o6Yor6ofIw2TqM3mN28Kzg","stars":2,"date":"2013-08-20","text":"If 'soy-sauce' is authentic 'mexican' sure, enjoy....\nThe fish burrito was a total let down. After all the hype I was very excited to try this place... But it was over priced for what you got, and nothing special.\nThe burrito consisted of a mostly (90% no joke) mix of bland rice\/beans with one strip of fish buried in the fold of the burrito.\nSeriously, I had to OPEN it to make sure I hadn't received the wrong order. My dining partner had 3 pork taco's, which were better... But nothing special.\nRebozos makes better Mexican....and their fish didn't taste like it was seasoned with a packet of soy sauce, left over from another places take out.\nWhannnn whannnn. I give it a 'meh' out of ten.","useful":0,"funny":0,"cool":0},
{"review_id":"DgVW-_3Byeg9k--LKwEl3A","user_id":"-gtyNPUaHRCkTxgMfSVM7g","business_id":"LZiapN1JLUulrCSHVhrcKA","stars":1,"date":"2014-08-20","text":"I always appreciate it when I get yelled at by a Drive Clean Technician. YELLED at!!!\n\nThere is a REASON they are available last minute to do e-tests!!! They aren't busy because the customer service here is in the negative.\n\nI got YELLED at, because we disagreed that him charging me full price for an emissions test, after he refused to even do the test in full, was unethical.\n\nMe: Hey my car needs an emissions test.\nGrumpy man: *hooks up electronic code machine* it's not ready. It won't pass.\nMe: Well I had the work done to it, and two mechanics said to get it done, so it should pass, can you test it?\nGrumpy man: they need I go to school...It won't pass. Drive it more, bring it back. That will be 33.00\nMe: But you didn't even test it.....\nGrumpy man: it won't PASS and if *yelling now* IF YOU won't LISTEN to me you can call the DRIVE CLEAN People' *flicks a drive clean brochure at me*\nSeriously.\nMe: Well, they will be hearing from me. You charged me for a test you didn't even finish....this is ridiculous, and can we please not yell at each other!?\nGrumpy man: 'I DONT NEED YOU as a CUSTOMER!!!' Still, obviously yelling.\nMe: You don't have me as a customer.\nI will pay you, because I am honest. You are not.\nGrumpy man: 'I DONT NEED YOU as a CUSTOMER'!!\n\nSo yeah. If you want to pay for incomplete work, verbal abuse, and for somebody's grampa to make you feel horrible. A-1 is the place for you.\n\n*** That was sarcastic. DO NOT go here. \nThis is the reason they aren't a busy shop.","useful":1,"funny":0,"cool":0},
{"review_id":"MEN0qQRQQW34iFIdkoiHaw","user_id":"fT1rTmiR6mhzL7GMgstvJQ","business_id":"JqBtQ1bSynPHE9gbyuSSvA","stars":4,"date":"2013-10-29","text":"I LOVE this place. It's fun and friendly and the food is really good. Juicy, flavourful burgers that come with many different toppings. Great fries ( I prefer the Waffle fries which unfortunately are an extra 2$). The menu is extensive and I've yet to tray anything but the burgers 'cuz they just call to me  but that have mac and cheese choices as well as other diner faves.\nThe place does get a little loud but thats ok, it's a gathering place after all. \nI can't wait to come back!","useful":0,"funny":0,"cool":0},
{"review_id":"nUlS-KXM13XIpbftVoxPqQ","user_id":"fT1rTmiR6mhzL7GMgstvJQ","business_id":"T73icFhinDygLlCmJHd2CA","stars":2,"date":"2013-10-29","text":"The food was good; interesting and tasty flavours but the reason I will never be going back is that the services was horrible. I went with 2 other friends and we had a coupon from groupon. I don't know if it was because we had a coupon but the waitress was seriously rude, slow and very condescending. We still ended up paying extra because we ordered wine ect but the service was just disgusting.\nNever going back.","useful":1,"funny":0,"cool":0},
{"review_id":"an36CDB32k_7a--Hrc5Yxg","user_id":"fT1rTmiR6mhzL7GMgstvJQ","business_id":"VVHriswJMjWUobrNO4Fj2Q","stars":2,"date":"2016-02-29","text":"I had the meatball sandwich and a small side fry. For 15.50, it was a let down and nothing special.","useful":1,"funny":0,"cool":0},
{"review_id":"5kWXMoPja4wknryyZV-_jw","user_id":"fT1rTmiR6mhzL7GMgstvJQ","business_id":"on9Ex8TcopX9lU0JQsuiuQ","stars":4,"date":"2016-08-30","text":"Love this place! My new favourite ramen house!! The chicken karage with the freshly grated daikon radish is excellent as is the ramen. The cha-siu isn't too fatty but still tender and juicy. The only issue are that there's not a\/c so it can get hot inside.","useful":1,"funny":0,"cool":1},
{"review_id":"CpQGfqy9fK-CA530Y0bL2w","user_id":"fT1rTmiR6mhzL7GMgstvJQ","business_id":"0k-WPC8TGbdSdl7qKHcRvg","stars":5,"date":"2013-10-29","text":"This is my FAVE all you can eat sushi place. The sushi is great, always fresh and not skimpy slices of fish either. They have many varieties to choose from and lots of tasty  non-sushi items too such as udons, rice dishes, salmon etc etc. \nThe service is friendly but, as with most all you can eat sushi places I've been to, they forget things we've ordered etc but that's ok, we just order more.\nThe price is good too and I've brought many friends there that now make it their go-to sushi place.\nLove it!","useful":2,"funny":0,"cool":0},
{"review_id":"tsiLNAp20TwXFu60Liosqg","user_id":"l3_iVfWstvDkKH9TKfzZBg","business_id":"Rm-Vq0RF_cCcXsR6DaTkww","stars":4,"date":"2017-09-20","text":"If u are looking for a great pizza place with fresh ingredients, great hospitality, very positive atmosphere, then this is the place for you.  I had the meateaters pizza that's comes with pepperoni and meatballs but I substituted for bacon, sausage and pepperoni with roasted garlic, and it was delicious.  Depending on bomber of customers, the pizza prep may take a little time but cooks very fast, less than 3mins.  Also try the blood orange lemonade was really good, I would recommend this restaurant to anyone.","useful":0,"funny":0,"cool":1},
{"review_id":"jJnLsq7hgzhBjwSy97MSzQ","user_id":"EulWZF1aLlhsMuUYvWAuhQ","business_id":"svdEhLmNmpVaIv1WLtoOvQ","stars":2,"date":"2015-09-25","text":"we went sunday at around 1pm, party of seven. It wasn't to busy, they had only one server at the time they took our order, the food was good, but they really need help on service, no prebussing, no refills we had to raise our hand every time we need it something. they add 20% service charge to the check ( we knew that) maybe thats why they didn't care about our table, they knew they were getting a tip any way. we mentioned it to the server at the end, thats when she told us that the other server had left, cause it wasn't too busy. She  said i'm sorry and offer  to give us a free dessert or another beer.","useful":1,"funny":0,"cool":0},
{"review_id":"AQ7i93ns5uLw9Ldi6UYmmA","user_id":"EulWZF1aLlhsMuUYvWAuhQ","business_id":"nHT_lECT2AIndXf5h_cfpQ","stars":2,"date":"2016-10-06","text":"we came sunday nite around 8pm party of 7 people. great food good portions and good flavors, the hostess did a good job with a big smile, the problem was our server, a mature lady around 50's she didn't look so happy,no smile, no welcome, nothing. incomplete drink order, when taking our order she wasn't paying attention of what we ordered, (kind of like ignoring you) 'NO UP SELLING' after a our meal we had to ask her COUPLE OF TIMES if the service charge was included finally she just moved her head up and down with a dirty look. good food like always but service needs work.","useful":0,"funny":1,"cool":0},
{"review_id":"Y5rix908xJdEZG6bX8W-Rw","user_id":"hNbf9zGQUkYtDD-xEEpFkQ","business_id":"e2uWs-oYZ2PB4ybr-UhErQ","stars":5,"date":"2017-04-01","text":"Inside 99 ranch market. So worth it. Best vegan food in Vegas, made fresh after you order. Made with love","useful":0,"funny":0,"cool":0},
{"review_id":"oWO4iUdGS3MwXSqUn_wA8w","user_id":"glk2FtfJMDIIkbRGilzfTQ","business_id":"IkMwuS3eViVHK09npuG1jQ","stars":1,"date":"2017-10-22","text":"where the heck are they getting their chickens?\n\n8 pieces of chicken barely filled half of my foam tray.  the other half had bean & mashed potatoes cup.  their chicken is the smaller, smallest of the town.  they are chicks, not chickens.\n\n\nhey, the owner of this dump.\n\ni will never come to your place again.   and i will be the voice of consumers who are sick of getting ripped off by people or group like you.!!\n\nPeople...  PLEASE stop patronizing places like this!!","useful":2,"funny":1,"cool":0},
{"review_id":"EtxRt4kHsvfmTclXoTBrEw","user_id":"KlYxbd_VaYOlo4u7IkfE7g","business_id":"d65kicaKohFwQmByS0duyA","stars":1,"date":"2016-06-24","text":"Do not take your Birkenstock sandals for repairs to this place! First of all, they led  me to believe that they are replacing everything but the straps. When I came in to pick them up I noticed that the footbed was not replaced and I asked the person who brought my sandals about it to which he said it would have been extra 30$ and walked away. I was so disappointed that I didn't want to inspect the sandals any further and left the store. At home I started looking at them and  got even more frustrated because they did a terrible job. I payed 70$ for my sandals to look worse than before repair! I would have gotten a better repair in a third world country! And considering the previous reviewer's experience with them, it is pointless taking them back and trying to talk with the people working there. \nAnd this place has been doing Birkenstock repairs for 40 years?!?!? That was the only reason I agreed thinking that they know what they're doing.\n\nUpdate: Is this a \"quality repair\" that falls apart one month later?","useful":1,"funny":0,"cool":1},
{"review_id":"wdrhyEzowiXOHok2L1SXkQ","user_id":"YEu8CwCRKHol5D2WFys5tQ","business_id":"F6JMC6ib4f2gLY0ggAGw9Q","stars":5,"date":"2010-03-02","text":"I first went to Carolinas Natural Health Center to take part in their Ultra Lite Weight Loss program. I connected with the entire staff from day one. Ultra Lite not only helped me reach my goal weight, but taught me how to keep it off. I was also impressed with their menu of  services including facials with Eminence products, Thai foot massages, pregnancy massages just to name a few. Most importantly, as a Naturopathic physician, Dr. Smith takes a natural approach to healing the body from within and treating the person, not just the symptom or disease. I am thoroughly impressed each and every time I visit Carolinas Natural Health Center.","useful":8,"funny":0,"cool":0},
{"review_id":"cB9q51tyypaeMGz1O6MSmQ","user_id":"YEu8CwCRKHol5D2WFys5tQ","business_id":"hyYm9Tb8HPpFSSLZzI6pqg","stars":5,"date":"2010-10-06","text":"Great full body workout combining weights, pilates and ballet with small isolated movements with upbeat music.  Results evident after 10 classes. Well worth the monthly dues.","useful":3,"funny":0,"cool":0},
{"review_id":"6E8G9CwZVjDEq6fNk6tBVQ","user_id":"YEu8CwCRKHol5D2WFys5tQ","business_id":"0JoteSDMdGJSgYzk60vSdQ","stars":5,"date":"2010-10-06","text":"Located in the basement of Organic Marketplace on New Hope Road, the staff makes fresh soups and hummus daily. Also homemade salad dressings on thier raw food and salad bar. They make healthy wraps and pizzas and have a great selection of smoothies.","useful":8,"funny":0,"cool":2},
{"review_id":"am96N6tj0rEWzIViROjg5Q","user_id":"jyKNypKgkA9JsutB3obJYQ","business_id":"LtNgP4FqXp5nMFOHErK8cw","stars":2,"date":"2017-09-13","text":"Amazing sushi, I love going here because it's decent price for good sushi. \n\nWhat I don't like is the servers, they never smile, can't seem to figure out how to take care of there tables. I am a regular here, I go about once a weekend and the servers are still rude. Never expect a drink refill or for them to talk to you after you get your food.","useful":0,"funny":0,"cool":0},
{"review_id":"e5r_nLOhy-k2IzYm2KEw7w","user_id":"jyKNypKgkA9JsutB3obJYQ","business_id":"mmeKyvhdKHsW-gh0JvLbGA","stars":1,"date":"2017-07-31","text":"Paying to much money for a gym that's always packed. Tried bringing my daughter and they stated she needed an ID who brings their ID to the gym? I'm paying you money to be here and to be able to bring a guest. Find a better gym that's nots packed all day long. Equipment is never open, leaving this gym and going somewhere else that's cheaper and less packed. Look other places before coming here.","useful":1,"funny":0,"cool":0},
{"review_id":"JuFAPWieOvXf5n_tMhE6HA","user_id":"QAkLJ2KZaJAqTi6KEVabWw","business_id":"u8-WDsLXAl0dXQW_wqWrDg","stars":1,"date":"2017-02-24","text":"THE DRYEST BURGER IVE EVER EATEN.... $40 for 2 burgers and fries and I would rather eat a McDonald's double cheeseburger.","useful":0,"funny":0,"cool":0},
{"review_id":"wbjm7ChpSB0EbL9Umun2lA","user_id":"jNz3ic5TdcDIZJtx7iM5wQ","business_id":"QdganL5AW9E_fNoRVroLig","stars":1,"date":"2014-03-11","text":"Had duck fried rice which was full of small crunchy bones. The cashew chicken had a funky odor and the pad thai was horrible. Not to mention the restaurant is dirty and condiment bottles are crusty. This place is overpriced for poor quality food. We will not be going back!","useful":1,"funny":1,"cool":0},
{"review_id":"JHWWdKmzNUItE_An5u_uJg","user_id":"jNz3ic5TdcDIZJtx7iM5wQ","business_id":"aokqWHt8vMf5iwj8KZZ5eg","stars":5,"date":"2014-04-26","text":"Excellent food and wonderful service! The best Reuben sandwich I have ever eaten. And the iced tea is very good and the prices are hard to beat. We will be back :)","useful":0,"funny":0,"cool":0},
{"review_id":"n-wkLClD42v3a4fkZzpZrw","user_id":"GvjexZRFBYiqNzOmoKHRTg","business_id":"69Gyhl3O04NG6DGAoZ6t4Q","stars":5,"date":"2015-02-06","text":"I love this place... been getting massages there for years and have never been disappointed. Become a member for the best price as the ala cart prices are a bit high. Gorgeous relaxation room. Wish I could recreate that room in my house! And their music is very relaxing. Sauna is perfect to ward off Cleveland's winter cold. Love the staff. They couldn't be nicer.","useful":1,"funny":0,"cool":0},
{"review_id":"V8yjQpkbl_KVVUM4JZ1D9g","user_id":"GvjexZRFBYiqNzOmoKHRTg","business_id":"CuT2Xh3vAYvRfxUWlUo6oA","stars":4,"date":"2015-03-18","text":"I figured the wait on a Sunday would be long and it was. 25-30 minutes turned into an hour for a table in the restaurant not a high top at the bar. Server was just ok. Never checked on us once to refill drinks until we were ready to leave. Probably because we didn't order beer. Wings were excellent. We ordered dry rub with 2 sides of sauce. Hubby's burger (Thick Rick) and fries were delicious - enough for 3 people! STAY AWAY from the Bay of Pigs Cuban pork sandwich. It was nothing like the sandwich described by the PD food editor. Unless you like 80% fat and gristle. It was gross... I'd definitely come back but stick with a burger or chicken sandwich.","useful":1,"funny":0,"cool":0},
{"review_id":"-hDhvTjt9_XEB9EB4h4aPw","user_id":"bSHBhG1fLuLaMZKFjSKVSQ","business_id":"na4Th5DrNauOv-c43QQFvA","stars":1,"date":"2017-07-07","text":"Bellagio is disgusting. They have decided to cater to ghetto people and the homeless. I was told I had $300. In resort fees and parking fees in addition to the price of the room. I felt sucker punched. Asked why, she said all resorts are charging and bellagio isn't as much as other resorts. What? Why not just include it into the price of the room? I had planned on tossing around thousands of dollars on gambling, dining, entertainment and shopping. But since bellagio insists on catering to ghetto people who only have a couple hundred dollars to spend have damaged thousands of dollars in resort property. I refused to spend another dime here. The room overlooked the fountains but was small and beat up, obviously by the ghetto people bellagio caters to nowadays. Homeless are lounging around the hallways and the lobby, kind of smells bad.\nUpdate: now bellagio wants to bill me for more hidden charges. Check it out, these new charges are from July 13th, we left on the 2nd, watch out for this place, they are dishonest. Total disaster!!!!","useful":1,"funny":1,"cool":0},
{"review_id":"qXI_w6yrPCIAnSJGHctngQ","user_id":"TNzJfZb1IVwvywldn5JsbQ","business_id":"Gyrez6K8f1AyR7dzW9fvAw","stars":1,"date":"2017-09-18","text":"Service here SUCKS. I came here for breakfast on a Saturday morning. Food came out ok, when the check came out, I advised my waiter my host at Venetian will take care of the bill and they had forwarded the comp to Casanova's computer. My waiter walked to the back, talked to someone and came out telling me that comps only work for lunch and dinner, not breakfast. Uhhhhh......wth? Since when were comps allowed only for certain times. I called my host, my host told me that its weird, it's supposed to work anytime. I told him i wanna speak to the manager, and he showed me to someone named Maria, i told her the situation and she said they never got the comp from my host, and even if they did, it only works for lunch and dinner. I called my host again, and told my host to speak with Maria, Maria told my host they never received the voucher, guess what happens....... she then said their system is down so they never got it. So i told them you know what, forget it, i'll pay for it. So i paid.\n\nI was waiting around 30 minutes for them, then she tells me their damn system was down? Really? It took that long? Such pathetic service, my host had to tell guest services to walk the voucher up to them.\n\nNEVER COMING BACK AGAIN","useful":0,"funny":1,"cool":0},
{"review_id":"sZiAaVJfJ9Ovm8dnCMOWDA","user_id":"wNltctNC59TVPXMeDHsM1Q","business_id":"LwNZ1AR4_5iukgQYuhmTOg","stars":4,"date":"2011-08-27","text":"I have been looking for a used 750. I have searched and searched. My name must be at every dealer in Vegas. A few of them have reached out to be with a car they found but It had so many miles. I am searching but im not desperate, I still want and good running car, in good condition. One of the last dealers I stoped by was Desert BMW. Within one week Desert had reached back out to me and had a car on their lot. I went down the same day and they pulled off what looked like the impossible. Good job guys and keep up the great work.","useful":0,"funny":0,"cool":0},
{"review_id":"_1mEuMVgjJTKzwZ_XVIghQ","user_id":"wNltctNC59TVPXMeDHsM1Q","business_id":"6i85_hLuAdymNIy01LLl0g","stars":4,"date":"2011-08-23","text":"going to a BBQ?? this is the places to pick up your stuff..","useful":0,"funny":0,"cool":0},
{"review_id":"zxEIqOGx6T-YClLPGwg3SQ","user_id":"wNltctNC59TVPXMeDHsM1Q","business_id":"5PD6FDa_03U6NXrd7E4yGA","stars":4,"date":"2011-08-10","text":"i have been here a few times. very time you are here you feel like there is a really big part of Nevada's history is here.","useful":0,"funny":0,"cool":0},
{"review_id":"gzBB-2e8fLOYFk997KnNvQ","user_id":"Auxu_C_QmuyM_DW0jFK_hA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":2,"date":"2011-06-28","text":"So disappointed.  There were five hostesses standing around as we showed up ten minutes early for our lunch reservation,. We were seated about 12 minutes after our requested time.  Once seated we waited forever for a server.  The entire experience was just SLOW.  My meal was just average, the salad was overdressed and we had to ask for water and more drinks.\n\nI was glad I did not suggest this restaurant since everyone in our group was let down","useful":0,"funny":0,"cool":0},
{"review_id":"1xNdc8jU4_hIqlq9BipJCA","user_id":"Auxu_C_QmuyM_DW0jFK_hA","business_id":"eqQnIjAAhOUuHqK6gTWRXw","stars":5,"date":"2011-06-28","text":"the most accomodating gluten free menu on the planet.","useful":0,"funny":0,"cool":0},
{"review_id":"c_7DC_ZC5Nf-2X-kHNZcuw","user_id":"Auxu_C_QmuyM_DW0jFK_hA","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":5,"date":"2011-06-28","text":"There is reason this is the most popular Sunday brunch in Vegas,   Do not let the long line intimidate you, it moves fast.","useful":0,"funny":0,"cool":0},
{"review_id":"hfffDITEHJAxmtCM_vKn1A","user_id":"Auxu_C_QmuyM_DW0jFK_hA","business_id":"ii8sAGBexBOJoYRFafF9XQ","stars":1,"date":"2013-11-16","text":"If the show extreme makeover hotel edition is looking for a project, the Paris Hotel in Las Vegas should be the pilot episode.  We stayed only one night last week because it was beyond gross.  Here is a short list of the problems that must be addressed:\n\nHuge stain in carpet near our bed\nMolded grout in the bathroom\nFaint lipstick stain on drinking glasses in the bathroom\nCigarette burn in the sheets \n\nIf our client had not paid for our room in advance, we would have checked out and stayed somewhere else for the single night.  \n\nDo.  Not.  Expect.  To. Be. Impressed.","useful":0,"funny":1,"cool":0},
{"review_id":"1WayniD2mKAs5OBHH9yKYw","user_id":"Auxu_C_QmuyM_DW0jFK_hA","business_id":"1Df5WnLX3DqN6ymlhqznaQ","stars":5,"date":"2016-09-02","text":"I'm always looking for a high quality, value minded happy hour for an early dinner of appetizers.  If you're in Las Vegas for a show, or arrive from the east coast and are ready for dinner at 6:00 (it was 9:00 in NY and we had flown all day). this is a winner. \n\nThe bar area is table service with a dozen different choices for snacks that add up to a meal.  Sushi, and cocktails at a bargain price.   The pineapple martini is a hefty pour with flavor.  \n\nWe (3 of us) ate and drank for an hour and a half in the bar during the aloha hour time period 5:00-6:30 pm.  We each had 2 cocktail drinks and more food than we should have,  we essentially had a full dinner from the aloha menu, with taxes and a 20% tip for superior service our bill was $78.","useful":0,"funny":0,"cool":0},
{"review_id":"VNGIjPzAKfGSrTTxhE1pKg","user_id":"uv5lNYrRXl50P6ITLWpbpg","business_id":"dVvij7VRh55dISu02I0IGw","stars":5,"date":"2015-05-05","text":"Excellent!\n\n-Free Guacamole during happy hour!\n-HUGE menu\n-Ordered a salad, gazpacho, grilled octopus, and artichoke appetizer.  All were DELICIOUS!\n-Friendly and attentive waitstaff.\n\nOnly negative--Sangria was just OK.  \n\nWill definitely return! Great place!!","useful":0,"funny":0,"cool":0},
{"review_id":"H5q1yEGNupwYiTlm8MaakA","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"eLMCasvWCkJYDkvkKREz7A","stars":4,"date":"2016-05-18","text":"Excellent Thai food. We go here at least once a month. The staff is courteous and the food tasty. Service is fast. This is great value for money and kid friendly as well. Try it!","useful":0,"funny":0,"cool":0}]