[{"review_id":"_1YvbrbPliWmo2utbtKFtw","user_id":"UkmqSW27QHOL2E-wFxfrGw","business_id":"IWKtGvVg4hqc9rWHjW8KoA","stars":4,"date":"2017-01-10","text":"The M resort buffet is my favorite, this buffet provides lots varieties of food to choose from. The staff is friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"6nkUfee12srWOduaFiIAbQ","user_id":"QvAE_Rd3wOLMZ6HPxskIxg","business_id":"8ZyOqUYfHB5YygUb97TS3A","stars":5,"date":"2015-09-03","text":"I love going to this salon. Don is my guy. He does exceptional work, the attention to detail puts me at ease. Well, that and his quick wit. He is always a joy!","useful":0,"funny":0,"cool":0},
{"review_id":"6NcXxm83t1D62HI72z3RlQ","user_id":"QvAE_Rd3wOLMZ6HPxskIxg","business_id":"LHyj66waFlDcw9UToo27JQ","stars":4,"date":"2015-10-21","text":"We ate there with a friend and had a good time. The food is yummy, and the staff are friendly and fast. The only drawback for us on first visit was the noise level. It's loud and would be a fun place with family or other large groups. We'll go back soon.","useful":1,"funny":0,"cool":0},
{"review_id":"9ROS0BE7kAveLsCTJsCw3Q","user_id":"QvAE_Rd3wOLMZ6HPxskIxg","business_id":"3U__XOTBFptjhBeHrPGqrg","stars":5,"date":"2015-10-21","text":"The food is excellent. We've enjoyed several of the pastas, pizzas, salads, and platters. The Mediterranean Pasta is a favorite with the house salad but we always get the seafood platter. The seafood is fresh and cooked perfectly.\nThe owner's and staff are wonderful. All are friendly, knowledgeable regarding the food, and nice people. We stopped in a few months ago to try it out. We've been back every week or so.","useful":1,"funny":0,"cool":0},
{"review_id":"ezMrs8ZyTf0WXvvjulRdRQ","user_id":"iu31zLGfTeq9Tyw6k859vw","business_id":"VtqvCh3JlfwrPRhvSde0lQ","stars":5,"date":"2016-08-08","text":"these guys rock! I had a bad experience at another shop and was about to give up on vaping until I found this place. Belag (sp?) and Zack set me up with a system that's perfect for me. if you're going for juice make sure you have time.... the selection is huge. this is my new vape shop.... so happy I found them! thanks guys.... see you soon!","useful":1,"funny":0,"cool":0},
{"review_id":"6rxHek0_BhIICde1Q9mOpQ","user_id":"iu31zLGfTeq9Tyw6k859vw","business_id":"9ANHGGeqvPfv_W3ehFLWLg","stars":5,"date":"2016-08-08","text":"I had a terribly rough dentist as a child and as an adult my anxiety over the dentist was huge. my sister comes here and swore up and down they were nice and gentle and that the environment was calming. she wasn't lying! for my first two appointments I was medicated with anti anxiety meds. I'm so pleased to say I've been back and no longer need the meds. the staff are so nice and understanding. they helped get over my fear and get some much needed dental work done. a big thank you to the whole team at Martindale dental.","useful":1,"funny":0,"cool":0},
{"review_id":"J6JhKSouIfY7fS8c_PFcWg","user_id":"oplUanmw7-fTvU0b0A0PzQ","business_id":"bjllusUsLq9zE4yZnLpOzg","stars":5,"date":"2015-10-01","text":"awesome food everything was so flavorful price was not too bad considering the amount of food that youll be getting and the customer service was amazing.i will be coming back for sure","useful":0,"funny":0,"cool":0},
{"review_id":"3zuNw3wAGmjisNuUZUzxuA","user_id":"oplUanmw7-fTvU0b0A0PzQ","business_id":"FNe5PPA9pyj8FjcDefCBpg","stars":5,"date":"2015-03-07","text":"really good thai food..big serving and the best part is the service very nice and attentive waiters..will be coming back for sure","useful":0,"funny":0,"cool":0},
{"review_id":"cSzrsKMN_pNC97Ci4xFjQA","user_id":"vgxJkkCk36-a5OzMW3cQkw","business_id":"qQCsLGMncJp1xWUGnOKCQA","stars":5,"date":"2015-11-11","text":"Great place to eat and hang out whether it's day or night!  Service is awesome and it has a drive thru too!  They have a great breakfast burrito with a tummy green salsa. The patio has been updated recently so night time dining or happy hour is great. Highly recommend this local spot!","useful":0,"funny":0,"cool":0},
{"review_id":"q5gTvWcqlyI-RWQnubJMCw","user_id":"vgxJkkCk36-a5OzMW3cQkw","business_id":"xdphjWZymq-3dqOWmA_wwA","stars":4,"date":"2014-08-10","text":"I'm always looking for different types of Chinese food in the Valley so I was excited to try this place out. The food was better than the overall rating they have. You could tell the noodles were made from scratch along with the pork dumplings. The Chef's Beef noodles were delicious with lots of great flavor.  You generally know when a Chinese restaurant is good when you see other Chinese people there too. \n\nThe next time I go I will definitely try the stinky tofu along with a few of the other dumpling options there.","useful":0,"funny":0,"cool":0},
{"review_id":"D0a6dLoPQGhf1IQueTmryA","user_id":"vgxJkkCk36-a5OzMW3cQkw","business_id":"PNTyiqS7R-0c1ofxOfDijQ","stars":5,"date":"2014-04-25","text":"I took my boyfriend there for his birthday and the food was absolutely amazing!  The owner Christian was so wonderful and even gave us a tour of the kitchen. The food was perfectly prepared with perfect pairings of wine. I would recommend it to anyone and we will be back there again very soon.","useful":0,"funny":1,"cool":0},
{"review_id":"zL6YyFyxpYJ93xBymoV70w","user_id":"vgxJkkCk36-a5OzMW3cQkw","business_id":"hTsZSiftorNUFb1VaHCHHg","stars":4,"date":"2015-09-30","text":"Went there for dinner a few months ago. Had a great experience and the food was fantastic. It's a bit hidden in the shopping center, so I wasn't sure what to expect. Ended up being a great place for some drinks, appetizers and dinner. I would definitely recommend it to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"6kru06MuYwQ8Wsn89BvBKg","user_id":"vgxJkkCk36-a5OzMW3cQkw","business_id":"zcb1nHcTuMRmWcAXkeDoeg","stars":5,"date":"2015-09-30","text":"I was very very sick a few days ago and has a great experience there. People were very nice and attentive. The place was clean and I didn't have a very long wait. They even called me today to check and see how I was doing. Urgent cares get a bad wrap, so I thought it would be good to share a positive story.","useful":1,"funny":0,"cool":0},
{"review_id":"pcKYczJt05aBOccB3mxOOw","user_id":"zhbbwhOqEfUqjpmsbGEIMA","business_id":"CWNMLT-ppaUjLMmrnYDPVg","stars":5,"date":"2013-02-06","text":"Very attractive decor along with excellent food and service. A great place for a night out with friends and relies but also for an intimate dinner for two. The Asian chicken with noodles was especially good. Pity we live in England otherwise this would be a real favourite of ours! Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"nxweR0WoCyzkShOajpCqEA","user_id":"zhbbwhOqEfUqjpmsbGEIMA","business_id":"IT_4EEIbv6Ox1jBRMyE7pg","stars":5,"date":"2013-02-06","text":"Another great Del Frisco's! Food is excellent and so is the service. The steak and crab cake were superb, but they saved the best 'till last; the bread pudding! Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"ZB5UHivQMZZ80Bp0ncBH8Q","user_id":"cSHXUA-VYbRMyWhg50tc-g","business_id":"HEMdpGwvwgsrGRIYSWqgBQ","stars":5,"date":"2016-10-24","text":"We have at good quality food and drinks on time we make this restaurant from now are home! Hugo he is the manager on duty and the Jesus (server) great team work.\nClean restaurant good place to eat.","useful":0,"funny":0,"cool":0},
{"review_id":"wlCCOcbHMnlQvWKsV99dOA","user_id":"1P9d_pM5Lu7OS6jQwkTbjQ","business_id":"PxTKXsdYqoFHWAG2amz0XQ","stars":5,"date":"2016-12-18","text":"As a person with many dietary restrictions (gluten and dairy free) it is difficult to find restaurants that can accommodate. The service was excellent, and they were more than happy to accommodate, which was such a relief. The atmosphere, food, wine, and staff were all worth coming back for.","useful":0,"funny":0,"cool":1},
{"review_id":"wa4dq-j5msWXEUoMVisRzQ","user_id":"85wA9y5dXRR0jACZ8ChrTQ","business_id":"UxWH8zRYIBgs6Q2oykvRdw","stars":2,"date":"2015-01-25","text":"We came to Cluny's for brunch and was slightly disappointed in the food given the cost. The decor and ambience is really nice though, it is very unique and very elegant. From the floor to the ceiling, there was always something interesting that would catch your eyes. Overall, 2\/5 due to the food but will not mind coming back again to see if it's better the next time around.\n\nAMBIENCE [4\/5]\nVery elegant and classy. Everything is laid out very nicely inside the dining area. Definitely a unique feel inside with the beautiful floor and ceiling and distinct tableware. The music that was playing in the background didn't match with the feel of the restaurant though.\n\nSERVICE [3\/5]\nWaitress was friendly but was not very attentive to our table. She was preoccupied with the table next to ours most of the time.\n\nFOOD [2\/5]\n\nFresh Baked Bread - FREE\nThis was probably the best dish that we had. Portions were generous and the bread was very fresh. \n\nFrench Onion Soup - $16\nDisappointed that the French onion soup was not hot when it arrived at our table. It was just warm. In hindsight, we probably should have asked the waitress to take it back. It was not overly salty like typical French onion soup but was nothing special as well.\n\n2 Poached Egg Benedict with Crab Hollandaise - $17\nDisappointed that the dish came out with the English muffin burnt! For the price of this, I expect more attention to detail. This dish wasn't bad nor was it particularly spectacular. It was just average in terms of taste.","useful":1,"funny":0,"cool":0},
{"review_id":"KNldA0rZU2ijSpTMLb1FxA","user_id":"85wA9y5dXRR0jACZ8ChrTQ","business_id":"GqSA5t_OD1uxDZMwVLpoXA","stars":3,"date":"2015-07-08","text":"We decided to go try out Marben for summerlicious as they had the John's Burger on the menu. Summerlicious lunch was $23 which included an appetizer, main, and dessert. Overall, 3\/5 as I had expected the burger patty to be more juicy. I would come back again and specifically ask for medium rare next time.\n\nAMBIENCE [5\/5]\nGreat design and trendy. Marben has an outdoor patio as well as a indoor sitting area with nice couches and chairs. There was nice lounge music playing and at the right volume. \n\nSERVICE [5\/5]\nNo complaints here. Our waiter was very attentive and answered all the questions and concerns we had. We mentioned that the burger patty was more on the medium well than medium rare side and he relayed that message right away to the chefs.\n\nFOOD [3\/5]\n\nChilled Cucumber & Snap Pea Soup - Appetizer\nI usually do not order cold soup but on this particular bright sunny day I decided to give it a try. I must say this soup was delicious! Take a spoonful of the soup with the mint, pickled red onion, ginger, and cream and the soup comes alive.\n\nJohn's Burger - Main\nI was so excited to try this burger out as my chef from culinary school said this was the best burger in town. Well, let's just say that was not the case and I was disappointed half way through eating it. The waiter told us it was made medium rare but we felt that the burger patty was medium well on this day. I was looking forward to a medium rare patty with some pink to the meat and some juice to trickle down my fingers but these elements were not there. Other than this, the burger itself was one of the better ones in Toronto. The choice of the bun used was perfect as it was soft and fluffy. There was branston pickle inside the burger and it was just the right amount to give it a unique taste. Fries came with the burger and it was alright.\n\nStrawberry Gazpacho - Dessert\nDidn't like this dessert but this could be a personal thing. I never had gazpacho before so I didn't know what to expect. Personally, I thought it was too sweet. Also, there were chilled fruits sprinkled in the centre of the gazpacho which were too frozen making it difficult to chew on.","useful":0,"funny":0,"cool":0},
{"review_id":"QzJpYXsBVT4VMpwcYvcnLg","user_id":"85wA9y5dXRR0jACZ8ChrTQ","business_id":"OdKz_1uTROWkJWmNdwlGmw","stars":5,"date":"2014-12-19","text":"Just had my oil change done at MotorFabrik. They are a great group of down to earth guys and have wealth of knowledge on German vehicles.\n\nThe shop is clean and the waiting area has everything you need including WiFi. Would definitely recommend anyone with a German vehicle to go their for servicing.","useful":1,"funny":0,"cool":0},
{"review_id":"JEGCXEuPFKW5vYKoFgyAHg","user_id":"85wA9y5dXRR0jACZ8ChrTQ","business_id":"e59uNE07Gf-yrIl4rX3KZw","stars":4,"date":"2015-01-26","text":"Decided to come into Bareburger and give it a try as it just opened not too long ago. This is the first location of Bareburger outside of the US and is situated in a prime location as it's very near the Eaton Center. There is a good selection of different burgers with various kinds of patty (beef, bison, elk, wild board, duck, turkey, and vegan options). You can also customize and build a burger to your liking too! I also liked that Bareburger has Sir Kensington ketchup. This is not your ordinary ketchup at all. It's way more delicious and is the best ketchup I've had so far. Overall, 4\/5.\n\nAMBIENCE [5\/5]\nGreat design for a burger joint. The decor had a rustic feel to it and definitely was very fitting for a burger joint. The music that was playing in the background matched the setting and was at the right volume. The restaurant really has a nice and relaxing feel to it. Interestingly, both TV's in the restaurant was on the Teletoon channel.\n\nSERVICE [5\/5]\nService was very good as the waiters and waitresses were very attentive and friendly. The waiter for my table also gave an introduction on how the menu works and highlighted important information.\n\nFOOD [3\/5]\n\nThe Standard Burger - $11.25\nThis burger was fairly good. One of the better ones that I had in Toronto. The meat was flavourful and tender. I personally would have liked it to be a bit more juicy. This burger had the right amount of toppings and sauce such that it did not over power the flavour of the meat. Overall pretty good but fairly expensive for just a burger. Note that all the red meats are cooked medium well, so if you want it differently you need to ask.\n\nSweet Fries (Sides) - $4.85\nThese were good and was a good quantity for a side dish. They tasted just like sweet potatoes and were very fresh. However, my order didn't come with the two dipping sauces: special sauce and buttermilk ranch. It seems like these two sauces only come with the order from the \"Shares\" section and not the \"Sides\" section.","useful":1,"funny":0,"cool":0},
{"review_id":"HzBq_7GzY4AntgzfG8ezUg","user_id":"85wA9y5dXRR0jACZ8ChrTQ","business_id":"fnLiPkJL0ur4-pS99bgqGA","stars":1,"date":"2015-08-24","text":"We decided to try out Grand Noodle as it replaced Fish Soup Noodles House, one of our go to places for lunch, and was very disappointed in the quality of the food that was served. We didn't try the soup noodles so this review is based on the other food that Grand Noodle serves. Overall, I'm sad to see that Fish Soup Noodles House was replaced by Grand Noodle and I personally would not be coming back.\n\nAMBIENCE [5\/5]\nNothing fancy here but it was clean and well lit. \n\nSERVICE [2\/5]\nService was overall okay. The waitress got us whatever we needed when we asked for it. Some key points that they are missing in terms of service. First, patrons should not need to ask for refill of tea. The waitress' and\/or waiters should come ever so often to check up on the tables to see if they need a refill. Second, why do we have to ask for plates when our deep fried fish skin arrived on our table? How do you expect us to eat it without any plates? Lastly, We asked our beverages in our combo to come out last but why should we again need to ask for it to be served. The service staff should have a sense or feel that the patrons are ready for their beverages when they are almost done their meal.\n\nFOOD [1\/5]\n\nDeep Fried Fish Skin served with Soup - $3.50\nThis was the only decent food item of the three that we had. Fish skin was fried nicely and soup was hot. Quantity wise it seemed a bit small. When Fish Soup Noodle House was there before, there was much more fried fish skin served.\n\nFried House Noodle with Black Pepper Chicken - $7.95\nI can't believe how horrible the quality of this dish was. It's like something you would get at Manchu Wok. Actually, it's probably even worse than Manchu Wok. The chicken in this dish was very chewy and it did not seem fresh. For $7.95, I can get something so much better at the food court at First Markham Place.\n\n\"Submarine\" Baked Pork Chop in Tomato Sauce on Rice - $9.95\nThis looked quite interesting based on the pictures posted by other reviewers. It looked sort of similar to the coffin bread served in Taiwan and stuffed rice in bread toast at My Wonderful Kitchen. The presentation was nice but that was about it.  It turned out to be a huge disappointment. The sauce was on par but everything else was not. The pork cop was chewy and overcooked, the bread was just a big baguette so you can imagine that it's quite tough to eat, and the rice wasn't good either. There was another table that ordered one of these \"Submarine\" on Rice dishes and like us, they didn't finish it.","useful":2,"funny":3,"cool":0},
{"review_id":"wYkEZYChdg1U69fNIAyhKA","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"7_vGbkiXM_eyVtIxmc0rFQ","stars":4,"date":"2016-02-16","text":"I stopped in here on a random weekend around 11-1130a.  It's a very small place (presumably family-owned).  They have a nice variety of juices, though when I checked the refrigerated cabinet, it was slim pickings.  It seems the variety was somewhat lacking after the morning crowd had had first dibs.  \n\nHowever, the juice I selected was delicious.  The price is comparable to some of the better juices you can find at Whole Foods.  I plan to go back at a later date to try some of the other flavors.\n\nI would also be interested in trying some of the foods that they have as well.","useful":1,"funny":0,"cool":0},
{"review_id":"410ElCqjWe2rbnRrLE35Yg","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"O40nlfiMpWAKgMx7bH9h6Q","stars":4,"date":"2015-07-31","text":"Good variety of craft beers with the option for beer flights. Extensive grilled cheese menu - some very creative choices. I had the Frank the Tank, and I enjoyed it very much! We plan to visit again, and I'm excited to try a different grilled cheese sandwich!","useful":0,"funny":0,"cool":0},
{"review_id":"MAPL01L7_xzBCCcYr3aSCA","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"TFdLM8R_7Pf1xVeBNKl0hg","stars":4,"date":"2015-07-03","text":"4.5 stars. My husband and I went here a few days ago. We liked the outdoor area that was \"open tent\" - when we come back we would like to sit out there (weather permitting, of course). The beginning bread basket and goat cheese\/salted butter was fantastic! We started with the calamari, which had a delicious lemon aioli sauce coupled with an Italian sweet and sour sauce. The combo was delectable! My husband had the duck, which was juicy and tender. I had the cavatelli, which was fantastic on a rainy day. My white wine flight was wonderful! We will be visiting again!","useful":0,"funny":0,"cool":0},
{"review_id":"0a7ZTHh-SfZUBmBcQzaBjA","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"QrbS4LF0Iu5vApGAJLNzCA","stars":3,"date":"2016-02-16","text":"Food 4\/5 stars\nService 2\/5 stars\n\nMy husband and I ate here during Pittsburgh's Winter 2016 Restaurant week.  Overall, I was pleased with the food.  I had a winter salad, which was delicious, as well as the chicken and biscuit.  The chicken was cooked excellently - very juicy.  The biscuit was a little dry for my taste, but the accompanying hash was delicious.  The dessert was solid as well - an ice cream sandwich.\n\nWhere Prairie falls short is their service.  It took a while (10-12 minutes) for someone to come to the table to ask us if we wanted water.  Additionally, the waitress didn't introduce herself and seemed almost caught off guard that we had been seated in her section.  Things overall moved very slowly, despite the restaurant being about 1\/2-2\/3 full.\n\nThat said, the food was enjoyable, but I probably won't go out of my way to eat here again due to the slow service.","useful":0,"funny":0,"cool":0},
{"review_id":"E_gsxuFgwGYf-0Cjp2349Q","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"XNWXyFgCGaAwvg9QML2Ypw","stars":3,"date":"2015-07-02","text":"(Really 3.5 stars.) My husband and I thought we would try this place - keep in mind that we have just moved from Dallas, TX where Tex-Mex reigns supreme. A little unfair of a comparison? Probabl, but oh well. I got a house margaritas on the rocks - too much citrus in the margarita. Needs to be balanced out with a little bit of sweetness. I also got the Mahi Mahi tacos - not bad but not great. Decor was a little over the top in it's Mexican spirited-ness. They do have a great beer selection, which may bring us back again. They also have featured breweries and beer specials every 5 weeks or so - this week was Brooklyn Brewery, a personal favorite.","useful":0,"funny":0,"cool":0},
{"review_id":"KolpUDrJYLDyD7wWpRKB3A","user_id":"iFf4oc8NwFqsDAXlQYZFGg","business_id":"CAQ55UaTBvXMl1yEUJXr9Q","stars":4,"date":"2015-07-31","text":"My skin is very sensitive, so waxing really is not an option. I have found threading to be an excellent alternative. I was excited to learn of this place, which is very conveniently located for me. With most threading places, you don't make an appointment because it is usually a quick service. I walked in to the ?owner threading one persons eyebrows with one person waiting in front of me. The shop was very simple and clean. She worked very efficiently, and it was time for my service within 10 min of me walking through the door. She did a nice job overall. Pricing ($12) is comparable to what I have paid previously. I will definitely be returning again!","useful":2,"funny":0,"cool":0},
{"review_id":"ZmI3OcdXeWSMSxKnvy7i5Q","user_id":"8_KQNCxyfJOT-67iJJGGRQ","business_id":"Iq7NqQD-sESu3vr9iEGuTA","stars":5,"date":"2013-03-25","text":"5 stars simply because they call themselves a pancake & cafe place and they live up to it. The pancakes were the perfect amount of fluffy. Their syrup also A+. Specialty coffees A+. \n\nMost breakfast food places do the whole extremely huge portion that you'll never finish thing. This place gives you the perfect portion. Something you can actually finish! \n\n\nI will admit, the wait was a little long but well worth it.","useful":13,"funny":14,"cool":13},
{"review_id":"RUPICct-1waRDL8Px9zqug","user_id":"8_KQNCxyfJOT-67iJJGGRQ","business_id":"cKgUCzMGuRgkbKXUsgeXUw","stars":2,"date":"2013-03-25","text":"I don't know where to start with this review..\n\nWe were seated quickly, but the service the entire night was TERRIBLE. It took a good 15 minutes before a waitress even acknowledged my party. Then another HOUR for our food. There was only four of us and the restaurant was not packed. How long could it  possibly take to make a couple of burritos and carnitas? After the hour long wait, two of the plates of food came out cold. \n\nMy carnitas were delicious the second time they came out and were hot, but it was hard to enjoy my experience with such lackluster service. I will commend them, we complained and of course got the complimentary dessert. \n\n**Side note** The guacamole is over priced. I paid $10 to have an avocado poorly mashed up with a spoon and a few other ingredients mixed in. For $10 I expect more effort and MORE GUAC. Such a rip off. \n\nThe food isn't even authentic.","useful":0,"funny":1,"cool":0},
{"review_id":"UrDi35lruVuqmHqb-7NmgA","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"Gx3m4NG-iSuqSz5wSJ241Q","stars":5,"date":"2016-06-15","text":"Love them, highly recommend although it's not the coolest nail bar on the strip they do a beautiful job and it's completely full service.","useful":0,"funny":0,"cool":0},
{"review_id":"-PxHaLJbHkQQ_NFYWR7LJA","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"yU5mfSJOmaJkegn2ad48Iw","stars":1,"date":"2016-06-15","text":"Where to begin...I ordered our food (take-out Hibachi) and told them, extra vegetables, hold the rice. When I got home, it was extra rice and not a vegetable in site. My bad, I should have checked but please explain to me why the chicken, steak and shrimp were so over cooked and dry? When you spend over sixty dollars, you have expectations! Everyone's dinner sucked. Perhaps it was just a crappy night, but I doubt I will be headed back anytime soon.","useful":1,"funny":0,"cool":0},
{"review_id":"iPi2rV0e-4hH0Qz9WB4NVg","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"lPZ6RQ_jj9xlhvLEB3c4Wg","stars":1,"date":"2015-11-26","text":"Extremely upset with the restaurant tonight. While I understand it's the night before Thanksgiving, that's no excuse for horrible service. We were told 45 minutes for take out. We get to the restaurant and it's another half an hour. A call would have been nice since it's a bit of a hike. The place was so nuts we just went next door for a drink. We checked back after about 22 minutes and our food was ICE cold. Clearly sitting there for a while. Cold cheese pizza is not desirable. Especially when you just dropped over sixty bucks there. Not happy.","useful":1,"funny":0,"cool":0},
{"review_id":"YegeFEzsR2i_bkzzW8wgsw","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"d8lmIZIqmBC9oPM8y1dc7Q","stars":2,"date":"2016-08-07","text":"Easily the most disappointing Mexican restaurant experience since I moved to Charlotte. Now, I will say the tacos were pretty good. We tried a few variations between the two of us. Perhaps this isn't fair, being from South Florida but how dare these people call that shameful drink a margarita. It was awful and for eight dollars (the house), it should have been spectacular. Of course we didn't learn our lesson. My husband ordered a fourteen dollar margarita, in a vain attempt at putting the last one behind us. If you like battery acid and mediocre food, go there.","useful":0,"funny":0,"cool":0},
{"review_id":"wi1z2slifbyNlQm5iTwMaA","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"ONqFnJJuLC3yPIV-esaItw","stars":5,"date":"2016-12-18","text":"Since my last issue when I first moved to Charlotte I have had my negative incident completely taken care ofBlo is an amazing experience. My daughter and I bond there practically every Saturday. Yaz and Alexandria are our main stylists; they're fun and always have a smile on their faces. The stylists work fast and make us feel special! Go there!","useful":0,"funny":0,"cool":0},
{"review_id":"-x8o7UsOQhxOU5hvCiWxvw","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"j27Z_QgAakT6aM06MUXpYg","stars":5,"date":"2017-11-04","text":"I absolutely love this place. I have never dined in and take my sushi to go but I'm sure you can't lose either way. The people are super friendly, the sushi is succulent (a funny word but it's true). They don't cut the sushi in gigantic pieces, so you can't chew or swallow. Their traditional sushi is almost bite sized and yet somehow it's still filled with soft, yummy ingredients. Their specials are bigger but not obnoxiously big. The Unami roll is one of my favorites. Give this place a try!","useful":0,"funny":0,"cool":0},
{"review_id":"8CGb-BMeY7HXlNbbl9NvGw","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"j8qvYyHcKP1lqsMRYd7IGw","stars":5,"date":"2016-08-05","text":"I pulled up in a state! The light kept going off in my car. I knew something was up, but didn't have time to drive all over the country. Kenton took great care of me. He really assessed the situation. He didn't try to sell me something I didn't need. He was open and honest. The mechanics were fun and had a sense of humor. Plus it's clean and beautiful! There's WiFi, coffee, water and a power station! Not a bad place to hang out and work for a bit. I will be back for my oil change and rotations for sure!","useful":2,"funny":0,"cool":0},
{"review_id":"KIHPNmjqJhEO8EFWf6XaXg","user_id":"LtdbOWobNcGAgpKIroi7XA","business_id":"nMn2IR9cLP5HH7Etehyldw","stars":4,"date":"2016-08-27","text":"So I will begin my review with the wonderful, kind front office staff who greeted me warmly. I also loved the dental assistant, who carried on great conversation and eased my mind. Dr Hu (sp?), was terrific! Honestly, if they took dental insurance they we would probably become my primary! My bridge fell out and I was so uncomfortable! They took me right away and reinserted the bridge. My only moment of shock was the fact that it we as 80 bucks to see the dentist and another 260 to cement the bridge back in. I complained to my co-workers who somehow thought that was reasonable given the \"emergency room\" nature of the business. All in all, I would definitely return and highly recommend them for your dental emergencies but be prepared to drop some coin!","useful":2,"funny":1,"cool":0},
{"review_id":"DtFYRXoBK8dRvT9ijBkhOw","user_id":"9Bq2V81tcdyklsQle1GZCw","business_id":"IQnUxhO7oieEP7-5ZVJ4uA","stars":4,"date":"2016-12-19","text":"The pad see ew was great!! I also ordered the Thai wings (another must) but the fried rice was okay (wouldn't order again). Service was adequate but nothing spectacular. Overall, a decent Thai place!","useful":0,"funny":0,"cool":0},
{"review_id":"-DSN8zIyGRjNbdRMpa7-BQ","user_id":"e40yNvWLvfKFSqG0r49adw","business_id":"hTSIT3puu8m8-kOZYS4Zdg","stars":4,"date":"2015-08-11","text":"I have made the trek (20 minutes) to OCB twice in the past week. Both visits yielded exceptional, tasty, and fresh burritos. I will eighty-six Chipotle from my \"fast\" food preferences in favor of Ohio City Burrito. In fact, Chipotle does not sound appetizing to me anymore. \n\nThe atmosphere in this local joint is welcoming and the staff is very friendly. I got a burrito with Carnitas, guac, sour cream, rice, beans, an array of salsas, lettuce, and cheese. Unlike Chipotle, you can taste each ingredient in every bite. Continuing that thread, the guac and sour cream are distributed evenly throughout the burrito (both of which are FREE). The ingredients are superior to Chipotle's. The flavors omitted from them are bold vs. bland and predictable.  \n\n*I do not mean to compare the two. The reality is- until OCB, Chipotle was the best burrito I had ever tasted.*\n\nI highly recommend OCB to anyone in the Cleveland area!","useful":0,"funny":0,"cool":0},
{"review_id":"TTgtYCwzh4EOfmi5JbWt-g","user_id":"e40yNvWLvfKFSqG0r49adw","business_id":"8ou6p7T-3KaNOhDeln3Ccg","stars":3,"date":"2015-08-07","text":"Let me preface my review by stating that I have not stepped foot in the restaurant. Therefore, I will be speaking on behalf of the food only.\n\nI ordered the Santa Fe chicken salad. The chicken they use is comparable to canned chicken you may find at a supermarket. It was cold, bland, and chewy. Frankly, my buddy and I weren't sure whether it was tuna or chicken. \n\nI was pleased with the chips and the varieties of salsa they offered. The salsa was flavorful and the chips were chips.\n\nI must add, my buddies swear by the fish tacos and even consider them some of the best they've ever had. \n\nI would've given this restaurant another star-\nHowever, for the prices they charge, the quality of their chicken is unacceptable. I would not go back and would only recommend it to people who prefer fish tacos to chicken.","useful":0,"funny":0,"cool":0},
{"review_id":"7O6o7YR0Bjk_hvsx-NSUjg","user_id":"e40yNvWLvfKFSqG0r49adw","business_id":"ZyGpQ9k1D0c4xd8k7I_RXw","stars":3,"date":"2015-08-11","text":"Lehman's deli used to be a staple for my co-workers and me. That is until they raised their prices beyond what already seemed steep. Their subs -dressed with lettuce, tomato, pickle, and onion- are tasty but will leave you wanting more. I particularly enjoyed the pastrami and turkey sub. They will make any sub to your liking. \n\nTheir menu is large and they have a variety of items in their fridge. This deli has options for everyone (subs, sandwiches, appetizers, gyros, salads, fruit etc.). All are delectable but a bit overpriced. There is also a wide selection of wine and beer. \n\nThe staff is very friendly and accommodating. The atmosphere possesses a pastoral feel. I have a soft spot for this establishment (we go way back). If you have a few extra bucks in your pocket for lunch, give it a try! You won't be disappointed..","useful":1,"funny":0,"cool":0},
{"review_id":"_t5D4h8dFVQPlEMLkQfXDA","user_id":"PNxFL1brMbceK7h4tKB55A","business_id":"eUi3O-8Gqh_nJ_ZhO-25gQ","stars":5,"date":"2015-04-11","text":"Thought we'd try out this burrito place and I'm so glad we did! The staff is very friendly and the food is delicious. My wife and I both had a \"small\" burrito - no need for a large unless you want to get your daily caloric intake in one go.\n\nI highly recommend this place and will be coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"_S5-155HOZF739UFxhQPlQ","user_id":"PNxFL1brMbceK7h4tKB55A","business_id":"xAF7Tj6KDEM_mior97OBZA","stars":5,"date":"2014-01-11","text":"This is our favourite spot at Yonge\/Sheppard to take in a Leafs game. A few big-screen TV's, a (free) pool table and a great selection of imported tall boys. The bar has a very friendly vibe ... a \"Cheers\" kinda feel. The menu is limited; however the wings & fries are excellent (other options include chicken fingers, chicken pot pie and pepperoni pizza). The staff are very friendly too. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"lk0fwEqVmMy4b60dKkVD8Q","user_id":"PNxFL1brMbceK7h4tKB55A","business_id":"rROU_Ogow8clmVgIQyqs-w","stars":5,"date":"2013-12-14","text":"Had a great dinner tonight. The minimalistically-described \"house salad\" was a very pleasant surprise. Arugula, quinoa, crisped sweet potatoes, poached pears ... okay, that's more than enough of a description for a salad. Suffice to say it was quite good.  :)\n\nMy wife had whitefish and I had steak. So we lack imagination ... bah! Both were excellent. The restaurant wasn't packed but there was a good vibe nonetheless. Looking forward to returning and trying some of the other offerings!","useful":0,"funny":0,"cool":0},
{"review_id":"oXxlI-isyE8WmtsF92wUKg","user_id":"PNxFL1brMbceK7h4tKB55A","business_id":"d43KBUWXsGvwuAbC6QA2Cw","stars":5,"date":"2015-12-28","text":"David and his colleague arrived promptly (after calling ahead of the two hour window) and proceeded to take away a pile of wood that, much to my chagrin, I'd been unable to split (in my defense, and as David could likely attest to, the pieces were very large, and knotted). My only regret is not having called for an appointment sooner! As another poster mentioned, very friendly and efficient service. I highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"iLOA08oEn8oCV2D0YtTpqA","user_id":"WN58htyNuYymWWVuMgoYXQ","business_id":"NhJeHieeUfMPJj86avEubA","stars":5,"date":"2016-10-10","text":"I have taken my son to Faces for a consult. Everyone in the office is so very friendly. It took everyone in the back office to get proper pictures of my son, but they were all very patient and kind. Dr. Bader seems very conservative and does not rush into treatment that isn't needed; which I sooooooo appreciate. January will be the 3rd visit for us, and all just consults so far. I by far recommend Dr. Bader, and his entire office!","useful":1,"funny":0,"cool":1},
{"review_id":"B-f6qL9yrC6wnA9wKgPzAw","user_id":"WN58htyNuYymWWVuMgoYXQ","business_id":"hyM_SJdBeL6SYA-kfNhBag","stars":4,"date":"2016-07-17","text":"This is our 2nd year taking a \"staycation\" at this location. After reading the other reviews, I was VERY worried about our trip this year. Thankfully I had nothing to worry about. The pools were clean. I saw several staff members including a manager walking around picking up trash that others left behind (sad to think that people think it's okay to drop their dirty plates and cups because they are finished with them). There was very little garbage around. I did only give 4\/5 stars because of the room and a couple of issues there. Our 4 year old found a contact lens (nobody in our family wears contacts) on the bathroom counter (makes me wonder if it was actually cleaned). Also, we could not get the room very cool at night; we turned it as low we could and it was not very cool. Overall it was a great weekend.","useful":1,"funny":0,"cool":0},
{"review_id":"O5FKVQ9IBd4pJrpCQz_zaQ","user_id":"WN58htyNuYymWWVuMgoYXQ","business_id":"V8RhIBBwWLW7hYW24Aehig","stars":2,"date":"2014-09-20","text":"My daughter attended Spinetts for almost 1 year. I was never very impressed with the whole place, but she loved it, so I kept her enrolled. It is very busy and crowded, with very little organization at the front desk. The price is high and gets higher as they advance. The coaches are often seen sitting and watching the girls, or holding the ropes, but NOT watching the kids climb up them. There is a lot of class time wasted to standing and waiting for the next event. We have pulled her and placed her in another facility that seems to be better run all around.","useful":1,"funny":1,"cool":0},
{"review_id":"kbqDsYnvvz8eicFF-BPY7Q","user_id":"WN58htyNuYymWWVuMgoYXQ","business_id":"ffjnm1Es9fuPF1dnWEcWkA","stars":5,"date":"2016-07-26","text":"Our insurance company sent SCTowing for us and they were fantastic! Very polite and professional! Thank you!","useful":0,"funny":0,"cool":0},
{"review_id":"z2Ak_fRSVlxyV_BttS1btw","user_id":"4N_DKmLap-hoY-LrG2JZGA","business_id":"2Ky1Fi_siE7PQTpyGyo0YA","stars":5,"date":"2013-10-14","text":"I really liked dealing with Charles at Subaru South Boulevard. He was very low-key and easy to work with. I wanted an Outback in a configuration (color, style and engine size) that proved a bit challenging to find, but the Subaru South Blvd team worked their magic and the car is exactly what I wanted. I hope that the service is as good as the sales!","useful":4,"funny":0,"cool":0},
{"review_id":"kAyalPDyuSKyPzEVJG9KiQ","user_id":"4N_DKmLap-hoY-LrG2JZGA","business_id":"ILbRIjKhYqcJD0nYAqTQSw","stars":5,"date":"2016-02-27","text":"I've been with Horne for 15 years and have always been pleased. I have purchased new systems and had service agreements. Everyone is always friendly and proactive. My most recent service was especially helpful because Josh, the technician, took the time to explain a couple of things to me and showed me some steps I can do myself. I always like to understand the processes so I am an informed customer!","useful":0,"funny":0,"cool":0},
{"review_id":"NwLVev3i4J7knPoXCzmF8w","user_id":"kThFvEzd_BZ2PW0ioFm1wg","business_id":"yg4OqooJ7NjrvddPccPOiw","stars":1,"date":"2015-02-07","text":"Did not get a reminder call for an appointment and in turn received this email ...WOULD NEVER go to a salon that can send out such a rude email:\n\nHi\n\nYou made an appointment with the salon for this morning. Not showing up or calling to let us know you would not be coming is very inconsiderate.\n\n\nI hope you are well and its not because are in the hospital in a coma and was unable to communicate. if it is such that you are well then in the future you need to consider that the staff gets up early in the morning to be here for you! Potential clients who could have had your appointment slot were denied the chance to get their hair done.\n\n\nBasically, your lack of consideration has cost us.\nThink next time call and cancel. We are sure that if you came to the salon and we were not here to serve you, you would be very upset as you time has value. Our time is valuable!!","useful":15,"funny":11,"cool":3},
{"review_id":"QF1sZKxBmqiBk0MSCR79uw","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"sKWPbBAEM-XP9U5N5E4fHQ","stars":1,"date":"2013-02-22","text":"Its actually worse than it sounds in Bill P.'s review. If you're starving, park here and walk over to the Giant Eagle right there - anything in their cafe will be better.","useful":3,"funny":0,"cool":0},
{"review_id":"tILjLjnjENEmcT6LL_WvwQ","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"1dhPgc7E7IzzpxjHM2LphQ","stars":3,"date":"2013-04-12","text":"It doesn't pretend to be actual mexican food, but it is good for what it is. Big meals, cheap, served fast. I enjoyed the huge number of vegetarian options - practically everything on the menu can be made meatless if that's how you're rolling. I had tofu in my burrito, which turned out too mild compared to the loud flavors it was paired with. But filled me up, and I love any place the serves chick peas. (I know, I know. I just love them.) I tried some of the corn bread, and will say if you've never had real cornbread you'll like it. It tastes good, because its actually cake.","useful":0,"funny":0,"cool":0},
{"review_id":"8-_TgK0o4-hXMiipbZz2tw","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"3GuqcEYaF1d1WXcwOX5xPw","stars":3,"date":"2013-02-22","text":"This is a solid spot - good food, lots of choices. Only complaint here is that there's often a wait (because its good), and when its full the servers and kitchen are too busy too stay on track. The staff are all friendly but they need more people on busy shifts.","useful":0,"funny":0,"cool":0},
{"review_id":"BDWk0O0DkBvGquOeOR0bJQ","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"OTSQq4ycH4NNhWIHcjnGaw","stars":2,"date":"2013-02-22","text":"I really don't get Giant Eagle. They are nice enough, but pricing just makes no sense at all to me. It is close to my house so I'll drop in to buy a thing or two, but would rather go just about anywhere else for my weekly shopping trip.","useful":1,"funny":0,"cool":0},
{"review_id":"9GNUIb2i8x7WugYg8G94sg","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"oeW0vIYd3rUnAPgmD4fEFg","stars":2,"date":"2013-06-26","text":"It's ok. I went on a week day at the end of breakfast, so it wasn't too busy. Still, service was scattered and the kitchen slow. \n\nI had a veggie breakfast burrito, the man had a more traditional breakfast. The burrito was .  . . edible. It was enormous, big enough to feed me for a day and still have leftovers. Inside a soggy tortilla I had mounds of scrambled eggs and about 2 pounds of vegetables - onions, peppers, avocado, tomato, hashbrowns, and then some. Most of the vegetables tasted very, very steamed, and then doused in grease. There wasn't much taste to them at all, and I love my vegetables. It makes me sad someone discovered a way to make them taste so uninteresting. On top of the whole affair was their spanish sauce (tomato paste?) and an unmelted square of orange cheese-like product. All in all, it didn't taste bad, but that's not high praise for restaurant food.\n\nHis breakfast was easily as big, and looked much better than mine tasted. The waitress got the order close, but not quite right, and he didn't have the interest to send it back. It was good, but too greasy for him to eat very much of it.\n\nIf it were cheaper I would say it was a good value. As it stands, I would go if someone really wanted to go there, but if its left to me there are many other places I'd go for breakfast first.","useful":0,"funny":0,"cool":0},
{"review_id":"8U8v5EdUcOUIM8zISpNuZw","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"cbddL2q8uRA38RwycB0FJg","stars":4,"date":"2013-03-24","text":"Loved it! \n\nI was not too excited about trying to eat healthy at an Italian joint, but went with friends. I was impressed at how many healthier options they had, if that's what you're in the mood for. Or pig out on a hot plate of carbs and dairy with a side of italian sausage.\n\nMy friends and I split an order of beans, greens and tomatoes. I regret the sharing part, it was so outrageously delicious I wanted it all to myself. Next time I'm getting my own.\n\nIn the spirit of healthy eating, I went with a salad, which was big, fresh, and just what I wanted. If you like salad, you're set. If not, the pasta my friends had looked great too. You can get gluten free or whole wheat pasta for an additional charge if you like. My boy friend had angel hair with alfredo, our friend had linguini marinara with fried calamari.\n\nThe waitress was very pleasant, and kept her cool even though she had the pleasure of serving this merry band of drunk, vicious old queens.\n\nNow I would have been sold on the service and the food, everything I tasted was great. But the two pasta dishes weren't all that hot. Somewhat warmer than warm, they said. My friend let the waitress know but wasn't unhappy enough to send it back, even though the manager was adamant they could remake  the plate in no time. (I work in a customer based industry and I know first hand, nothing can be worse than an unhappy customer who isn't willing to let you fix the problem after they bring it to your attention.) So at the end of the meal, he offered to buy us a round of drinks instead. Smart guy - offer a couple of drunks some free liquor, and all is forgiven. He took an almost great meal and made it great for them. Sadly, I was driving so didn't take him up on the offer. \n\nSo - great food, beans and greens, lots of choices, beans and greens, good service, and beans and greens. If it were closer to home I'd be ready to move in.","useful":0,"funny":0,"cool":0},
{"review_id":"HKhWpHU1oMhEKTvgjPPoqQ","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"cAX-srNrvlifjfov_jpQ1w","stars":2,"date":"2013-05-25","text":"I'm torn on how to review this restaurant. Given the lack of choices in da Burgh for Brazilian steakhouses, I might rate it 3 stars. Compared to other Texas de Brazil locations I have tried, this restaurant rates 1 star. Over all, I decided to average it out at 2. It isn't at all bad, but it should be much better.\n\nOther reviews have covered the experience so I'll stick to what didn't work, and then mention the things that did.\n\nThe salad bar is nice, but not half the size of what is normally offered at a Texas de Brazil. I will sometimes opt for just the salad bar, but this one doesn't have the selection. Usually I would tell vegetarians they could eat here and be happy, I'm not sure I would recommend this location.\n\nMeat is the star of the show. It was sadly lacking here. The meat we got was good, but they had maybe half as many gauchos as normal. The experience is supposed to be like a meat parade - the meat comes in so many cuts and options, and so fast, that you can't keep up, and very quickly have to flip your card over to say you've had enough, at least for now. Here that never happened. The meats came around so infrequently we nearly always sat with an empty plate before the next gaucho came around. \n\nOf the advertised cuts of meat, we saw just about half in the time we were there. Usually picanha is rotated through frequently, but here it came by only twice. Flank and leg of lamb came by once. We were offered filet, chicken, and sausage many times.\n\nAlso, at the beginning they ask if there is any specific cut you like, and we said beef ribs, which is our favorite. When we were ready to leave, they still had not come out so we asked again. They did come out, but the meat was dried out and not very appetizing. \n\nHigh points were my caipirinha, the lobster bisque, and I'll give them bonus points for the fact three different people asked us if we liked our table or if we would like to move. \n\nThe experience was summed up by my boyfriend asking at the end of the meal if I could take him someplace else for his birthday, since this wasn't quite what he was hoping for.","useful":7,"funny":0,"cool":2},
{"review_id":"zyMtEJAAtKCaLRk3DJplzQ","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"TpZO3sokGBg8mDYyTRiGiQ","stars":3,"date":"2013-04-21","text":"As a southerner, I believe barbeque belongs to me. Personally. So my opinions are strong about how it should or shouldn't be. If you've never been south of the Mason-Dixie line, this could be the best barbeque you've ever eaten. If you are a southerner, your home made probably tastes better. \n\nDon't get me wrong, I enjoyed Union and will probably be back, especially if it doesn't stay so crowded. But more than anything it made me miss the real deal. \n\n-Brisket I tried was pretty good.\n-Ribs were good.\n-Greens were almost certainly canned - they added some ham but not much flavor. Mine are better.\n-Baked beans were sweeter than cake. That's how we like iced tea, not beans. It seemed to have a caramelized crust of sugar on top like Creme Brulee. \n-Coleslaw is fine.\n-Mac and cheese good.\n-Corn bread pretty good. Perfect texture, but too sweet.\n-Fried chicken got rave reviews from my friend, but I didn't try it. I'm even picker about that than barbeque!\n-Cocktails were extra good.\n\nBarbeque sauce is such a regional preference you can't make everyone happy. So I'll just stay quiet on that subject.\n\nLast note - its a barbeque place, which isn't a mecca for vegetarians. Don't try taking any here, they only have 3 things on the menu for them. Mac and cheese, corn bread, and coleslaw.","useful":3,"funny":4,"cool":1},
{"review_id":"zdc1LYYM_Tr6DP8nQHi7Rg","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"qfBp53c7Z2DpqUrGhV80zg","stars":4,"date":"2013-02-22","text":"I'll be back, probably many times. I am a big fan of thai food, and am spoiled with what I believe is the best Thai restaurant in the US (Ricky Thai Bistro) near my place in Florida. When I'm in the burgh, Thai Cottage does an admirable job filling that craving for curry. The pumpkin is amazing!","useful":1,"funny":0,"cool":0},
{"review_id":"YkhS4KlP3BmpL4SX-cz4Kw","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"-i3pCgQi_Y9NiSSWs6G7bw","stars":5,"date":"2013-08-28","text":"For bbq, I give it a 4. For bbq north of the mason dixie line, I give it a 6. This is good stuff. Between two people we had chicken, ribs, brisket and pulled pork, with most of the available sauces, collards, chili, and coleslaw. For me, stand outs were the pork with vinegar sauce and the cole slaw, but everything was good enough to recommend. I will be back any time I'm near by.","useful":1,"funny":0,"cool":0},
{"review_id":"2lcAieAoQ4mHpwjHuiPKCg","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"klls1rEfABAUtO8J0YXSGQ","stars":3,"date":"2013-03-28","text":"Very mixed review. \n\nFirst, the menu turns me on. I love Mideastern food, and especially love Mideastern vegetarian fare. The menu has tons of things I love to eat, so I have lots and lots of reasons to go back. My boy friend is just opening up to the cuisine, and I really hoped this place would wow him. It could have, but instead just - ummm - \"not bad\"-ed him. More on that soon.\n\nThe service was great. For a casual place, way out of the park. The waitress was on spot from the get go. Loved her. When the boy friend spilled an entire iced tea, her coworker came running to help and they both smoothed it over and cleaned up the mess. They even let him have another tea, even though I voted to cut him off since he'd clearly had enough.\n\nSo why three stars? Some real bizarreness on their part. \n\nWe both had soups, which we loved. I had a wrap, which was great. The hot stuff hot, the cold stuff cold, and everything delicious. He had a sampler with salad, rice, and three kinds of grilled meat. Which was great, except the rice was cold. Not warm, cold. Like grandma sat it outside in the snow cold. He immediately let her know, no problem she'll get hot rice. They just made it fresh. She just as quickly came back and said they would have to microwave it, there would be no fresh order of rice. He wasn't into the idea of microwaved salad and meat, nor the idea of someone picking his plate apart for him to microwave rice, which doesn't taste the best microwaved anyhow. He said never mind forget it. She wasn't liking that idea, kudos to her. She went to the kitchen and got a manager to pry the rice away from whoever was being so cranky about it, and brought it out a few minutes later.\n\nYay! Fresh, cold rice. \n\nNo joke, after she went to all that work to make his order perfect, they sent out cold rice a second time. He wasn't eating it so I stuck my finger in it to see - yeah, about the temperature of my carrot juice. Cool. Not warm. Not very appetizing, and not even a safe temperature to keep food. \n\nSilly thing to get wrong twice, I think. So aside from that, I was very, very happy with the place, and want to go back. I hope they'll earn back that last star.","useful":2,"funny":0,"cool":0},
{"review_id":"yyoul298_lY-mgQB6JDbHA","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"VC2TurJlC6DokYu_lHOVSg","stars":4,"date":"2013-04-14","text":"I liked it. I have to admit that when I came out I didn't like the T in GLBT, and wished they would go off and have their own equal rights movement. I'm glad I evolved. This bar provides a nice setting to hang out and have a few drinks with some of the most individual, quirky, unique and innately beautiful brothers and sisters in the Burgh. \n\nThe bartenders were polite and friendly, even to my drunk ass companions, and me (the driver) just standing around taking up space. Drinks were reasonable and quite generous. (Too generous, which for many is a plus!) They were cute too. \n\nPatrons are the reason to go though. From the hot girl with the purple weave, to the 7 foot tall lady who greeted us and knew I had never been in before, to the young fellow who I suspect had a vagina - this place should have been where Gaga filmed her video for \"Born This Way.\"","useful":3,"funny":5,"cool":3},
{"review_id":"2na7gNlEI1jyyrkpEJMcCA","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"xZfPdAYeimiruXuGR4nSUA","stars":3,"date":"2013-04-13","text":"Over all I like it, but its not going to be my main grocery run. \n\nI like having all the organic options, especially for the produce, beans and grains. I hate the parking situation, and their prices are significantly higher than I expect, even for organic.","useful":5,"funny":0,"cool":0},
{"review_id":"bK-QxSkp4U_g-RMLRbS86Q","user_id":"2dTQmS9iUhzdvhSElbkOOQ","business_id":"PMMp2rBcs58y5kLP96HUaw","stars":5,"date":"2013-03-30","text":"This place should have a lot more reviews - but I'm glad it doesn't, they don't need to get any busier.\n\nIts been there ages, and looks it. If you're all about ambiance, don't bother. If you pretend you're in a movie set in Pittsburgh 30 years ago it works pretty well. The service is sometimes hit or miss. Most of girls are good, one is very slow, one is amazing. They are all friendly and usually a few different people will check in to make sure that you're happy. Everything is made fresh so be prepared that nothing comes flying out of that kitchen - busy times it can take a good while to get food. \n\nThe food is AWESOME! Worth any little complaints I might think up before it gets there. Once its on the table, I forget them all.\n\n-Fish Sandwiich\n-Salmon (huge and delicious)\n-Flounder\n-Shrimp a few ways (\"Norfolk\" style is oily for my taste, and I never had it growing up in Norfolk.)\n-Hawkins St Special\n-Prime Rib (sized for two, watch it)\n\nThe prices are low, the portions are large, and just about everything on the menu  is delicious. I'm not one to pick a place because they give you a lot of food, but if you like a good value and don't want to compromise on taste, this place is a gem.","useful":5,"funny":0,"cool":1},
{"review_id":"i9xsi6bkoJ4o8JzY4sjenw","user_id":"O3blOFjGN_aQ-oC0zP8O7A","business_id":"aK99fvGIg1N3QY2JeoUM2g","stars":5,"date":"2016-05-30","text":"Great old fashioned. Finally, a no-bs old fashioned in Charlotte. That's been hard to find. The place needs to work out a few kinks - the air conditioning, class up the playlist, maybe dim the lights - but overall a great addition to Uptown.","useful":0,"funny":0,"cool":0},
{"review_id":"d88j6GPe1JBrYNBd5Lz2Jg","user_id":"O3blOFjGN_aQ-oC0zP8O7A","business_id":"MQEpDvkdL39hh1N0We3Vaw","stars":1,"date":"2016-05-30","text":"We've been here twice and have yet to actually taste a taco or receive a drink. The first time, the cavernous restaurant had plenty of empty seats (as did the bar) and yet the hostess (grimacing) informed us that it would be a 30+ minute wait for a table. We did not wait. The second time, the hostess confirmed that we could seat ourselves at the bar (which we did). But 10 minutes later, we had no menus and not even a hello from the bartender. It wasn't that busy. We left and we won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"duks2Mgb4vjcPJCBc-qM0g","user_id":"O3blOFjGN_aQ-oC0zP8O7A","business_id":"ALwAlxItASeEs2vYAeLXHA","stars":5,"date":"2016-05-30","text":"The ramen is delicious. The outdoor patio is lovely. We've always had good service, although since Futo Buta is busy at night, things can move at a slower pace. The crispy rice squares with tuna are amazing! This is a welcome addition to the Charlotte food scene.","useful":0,"funny":0,"cool":0},
{"review_id":"60w765hnCLtbbeys_vitRQ","user_id":"O3blOFjGN_aQ-oC0zP8O7A","business_id":"Tnc-QnFufxhnj32GC90C-Q","stars":5,"date":"2016-05-30","text":"Excellent market - much needed in the neighborhood. Lunch sandwiches are solid. Employees are friendly, not pretentious. Good beer selection and rotating taps. Nice outdoor area.","useful":0,"funny":0,"cool":0},
{"review_id":"SoGssCqlIwb6N9KNSP8fnw","user_id":"N2wkNFHrkQZRh6-7XGBDSw","business_id":"PL3cimEUfNHlenOGSOAdJg","stars":2,"date":"2014-02-17","text":"Just ate here for dinner. Sat at the lounge\/bar area. Spent ~$70 on two sushi rolls, one gyoza app, and two drinks. Entrees (rolls) came out before the app (gyoza). We asked the waitress abt it and she was quick to blame others (well i put it in in order!) and never followed up, apologized, explained, or made any effort to show that she cared. Never asked how the food was or how the drinks tasted. Overpriced and underwhelming. Food was average- nothing to write home about. Specialty drinks were overly complicated and overpriced for what you got.","useful":0,"funny":0,"cool":0},
{"review_id":"P1tTiOF9b2zAnhhzApRPwA","user_id":"xgMNde6NlVMpERpWLJzIug","business_id":"8nNB_yG1gzVpbqNH2EBucg","stars":1,"date":"2015-12-21","text":"Have been going here for years, and getting...and loving the cornbread.  However, as of the 1st of the month, they started charging $3.00 for the cornbread...but neglect to mention that.\n\nI would think if they changed the policy just a couple of weeks ago that they would now inform customers that they are charging for cornbread...which was free.","useful":1,"funny":0,"cool":0},
{"review_id":"TY_gd5OdT_-khuG04d3tIQ","user_id":"LYxKDnRQFfyOcYDlka_tPQ","business_id":"bW6DFx7ndvxKYDRSinXdfw","stars":5,"date":"2017-04-01","text":"Nick cleaned our windows today.  He arrived on time and worked on the windows meticulously.  He is the best window cleaner we ever had.  I highly recommend him.","useful":0,"funny":0,"cool":0},
{"review_id":"YNQ9pJ_xHM8rd05GBRrlEg","user_id":"pxwErljVaok_bbuoVOPK6A","business_id":"5T6kFKFycym_GkhgOiysIw","stars":5,"date":"2012-10-17","text":"This place is amazing. I mean, you really can't go wrong with a place that serves poutine 24\/7. The staff are definitely friendly (once they acknowledge you - see my last comment below) - maybe more so once they realized I didn't speak francais and thus was clearly a tourist. This was my second time to Montreal and I'm glad I did a little more research on Poutine (thanks, yelp!). My first time, albeit good, was certainly not the best considering I probably ate at a tourist trap.\n\nI had a small \"La Jaco\" and it was enough to send me into food coma by the time I got back to my hotel. \n\nLa Jaco = Ground Beef, Onions, Mushrooms, Cheese Curds (of course), French Fries (well, obviously!) all drenched in a black pepper sauce. Excuse me one moment while I wipe the drool off my face while typing this....\n\n\n....and i'm back.\n\nSeriously - why are you still reading this? You should be on your way there already!\n\nMy only real beef was that I was kept waiting at the front for almost 5 minutes even though there were plenty of tables and several waitstaff who clearly saw me yet didn't even say hello.","useful":0,"funny":0,"cool":0},
{"review_id":"p6zB-uTZJApseLxBCYrOmQ","user_id":"lt-DS_aNVmwaRiPQYI4umg","business_id":"hzY_oKsSawA42DOcXpOAjQ","stars":1,"date":"2016-07-27","text":"hired this company to survey residential lot. Charlie said survey done and would email survey to us. Weeks later......I am still waiting on our survey. May have to take legal actin as unfortunately we paid the company. \nWould have given them a zero if that was an option","useful":4,"funny":0,"cool":0},
{"review_id":"VTvVvrRr9np3_igoITR8gg","user_id":"VRK9iE-Fbi1NZqcRJN0c_w","business_id":"MWmuV3o6qcnYCktB755_-Q","stars":5,"date":"2013-08-10","text":"Kelly's cafe has the best breakfast in Brunswick.  The crepes are out of this world.","useful":2,"funny":0,"cool":0},
{"review_id":"eKiMnoG7SaxAXy8wBSFkIg","user_id":"UJQN0-zK04uPkvOGRkFwOA","business_id":"1uj0bdXWLIYTnFrpYdHGPw","stars":4,"date":"2009-02-17","text":"I like this shop. I have been going here about 5 years, the service centre is honest. I am one of those people who only write bad reviews with shops when things go wrong, and I thought I should write a good review, so I thought of Joe's auto. Things I like here reasonable price, honest service, neighborhood feeling. There was a time when I thought they overcharged me but there have been 5 other times when he saved me quite a bit of money and provided good advice\/ education, on the auto related issue.","useful":1,"funny":0,"cool":0},
{"review_id":"qjU7Zlm9k281sZKZ2QgXlg","user_id":"UJQN0-zK04uPkvOGRkFwOA","business_id":"kzAuYaK5h53-YESmNKqsHA","stars":2,"date":"2014-10-06","text":"We go to Pediatrix for my Sons healthcare doctor visit. Of course I get a different doctor everytime. Last time we went for a wellness checkup and the doctor also looked at my Sons acne, and when we returned home a few days later, we got billed for 2 visits. We went to the office once but had charges for wellness checkup ( we are allowed 1 free per year) and the $30 copay for the visit as well....the healthcare is becoming like  robbery.....","useful":1,"funny":0,"cool":0},
{"review_id":"aDroCFDGDPMFmDJr4sJ7yA","user_id":"OtK3NFKRt2v2_oSxL2nPlQ","business_id":"mw6g4_dXp-FISBujPUuDLw","stars":5,"date":"2013-10-01","text":"If you enjoy hand crafted cocktails made by knowledgable bartenders - Fusion is the place to go, and Steve is the one to see!  He is NOT your average \"bartender\", he is a master at his craft... (Yes, bar-tending is more than pouring drinks... It is a craft!)  His drinks are delicious, and he can accommodate your taste... ie- I do not drink sweet, so-called \"girl\" drinks---- I'm more of a bourbon girl!  \n\nOne of my favorite places to frequent when I'm in Vegas... Go enjoy a delicious libation with Steve, then go win some money at the tables!  \n\nOh, and did I mention he also knows how to flair?  \n\nboom.","useful":0,"funny":0,"cool":0},
{"review_id":"ew1_xl1NvuUlcWWjcQjICg","user_id":"OtK3NFKRt2v2_oSxL2nPlQ","business_id":"SMPbvZLSMMb7KU76YNYMGg","stars":5,"date":"2014-06-21","text":"Aria is my home away from home.  I frequent this hotel on numerous occasions throughout the year.. Besides the many dining options, the spa is a place I typically go to spend the day in complete bliss.. Having Crystals right next door is equally amazing... \n\nThe beds are COOOOOOOMFY.. Steak and Eggs via In Room Dining was absolutely superb. The Sky Suites utilize Khiels for their toiletries, which is quite nice.  Especially the moisturizer in this dry heat.\n\nEveryone is so helpful, and pleasant.. \n\nI am not the self proclaimed \"aria Princess\" for nothing!!\n\nIt's like Aladdin, and his genie in the bottle.. What ever I want or need, gets done in great time \n\nLuxury at it's finest...without feeling pretentious.\n\nHave I mentioned how much I LOVE this place?","useful":5,"funny":2,"cool":5},
{"review_id":"iTskmulKejXaR6VBL9FtOA","user_id":"LlL8tqgH5pugZkmkNe5RFg","business_id":"_nbIgkvf81AH2F6JWmbQvw","stars":5,"date":"2015-02-19","text":"The food is exactly what you pay for, so no complaints. The service is outstanding. Perfect for someone who wants to go out but is on a budget. I'm a repeat customer.","useful":1,"funny":0,"cool":0},
{"review_id":"OfcxVABozoJzq3e-8OaPWQ","user_id":"LlL8tqgH5pugZkmkNe5RFg","business_id":"qZZ8VU1Bk-xCruEAZNwm6A","stars":5,"date":"2014-07-01","text":"I have raved to everyone about the calzones here. They are simply to die for. I go there whenever I'm in town specifically for the calzones.\nAs other food is concerned, I have not been disappointed yet.\nFor the best experience, I recommend sitting at the bar connected to the restaurant and ordering from there.\nBest place to relax with friends, enjoy a drink, while your taste buds explode and your waist line grows.","useful":0,"funny":0,"cool":0},
{"review_id":"4nRvUWIkl3wdRiifHJajWA","user_id":"LlL8tqgH5pugZkmkNe5RFg","business_id":"xqxRWwtyvXCWZvVUM0tepg","stars":5,"date":"2015-02-19","text":"Put simply. Great service, 5 star food for half the price. Good wine selection. Great place to go on a date.","useful":0,"funny":0,"cool":0},
{"review_id":"ADgNg7hdvLzW8jTmWUjAgQ","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"bQ-sXUqPSr4-iJfB764Nzw","stars":2,"date":"2015-05-12","text":"I stay in the Westin often, so I keep giving this place a try, but this is probably the last time, and here is why:\n\n1) Bar service is terrible \n2) They overcooked my burger twice, and added the wrong toppings when I was 1 of 3 people at the bar\n3) Bar service is &!?$ing teterrible!  Man, the bar is where I sit...  Terrible.","useful":0,"funny":1,"cool":0},
{"review_id":"MhFIaVWa9wIBRaOIGgsP2Q","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"8sq5YfaXxLYi9qN7khxQcg","stars":5,"date":"2015-08-06","text":"Great service, very convenient location downtown, and run by nice people.  Definitely recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"gDXnjdGIC3zrosHhX--hIw","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"NoF90rswXBHESSyDaWeKKA","stars":5,"date":"2015-01-18","text":"Great beer selection,  and fantastic pizza.  I keep getting the Carnivore pizza.  It's a little salty with the cured meats but I keep coming back to it...  Can't explain it.","useful":0,"funny":0,"cool":1},
{"review_id":"AJ41K1_iaC2lis2m9bZjDg","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"e1lmVr0CJEwc8zigJjb_VQ","stars":5,"date":"2015-01-09","text":"Really impressed with the hotel.  Bar is nice, and room is very comfortable.  What really prompted this review was the awesome staff.   They have been great the whole time, but I was he over my birthday and they left this (see pic)\n\nCake was soooo good!","useful":0,"funny":0,"cool":1},
{"review_id":"ayyjEBQKMFBlG3iMToaTxg","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"-oAfSQPezog4jJgx0BaKsQ","stars":5,"date":"2015-02-01","text":"Awesome, it's a Burger King Bar.  Not really great food or beer, but pretty cool that is a fast food bar.","useful":0,"funny":0,"cool":0},
{"review_id":"DqK22lqYTchwqMgsfuGO8w","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"DdHHjdJm0ygVFc8pV4i0Lg","stars":5,"date":"2016-06-03","text":"Really liked this place.  Eclectic menu, with choices for everyone.  Mini donuts were awesome...coated with sugar, but the dough was not too sweet.  Reminiscent of a beignet.  Staff is super friendly!\n\nOnly complaint...  No stouts except Guiness...","useful":4,"funny":0,"cool":3},
{"review_id":"uq-nkpUJTHPsgADuWn8Vqg","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"VCJldkahrmApsE0s3hOe3A","stars":5,"date":"2017-02-17","text":"My favorite neighborhood joint.  Great wings, with a variety of sauces.  Daily lunch specials are always tasty and a good value.  Beer is cold.","useful":0,"funny":0,"cool":0},
{"review_id":"rkrA0050JVZT9xcqBwNzjA","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"DwP10iEz5LGf3fhcVQZm0Q","stars":5,"date":"2016-07-06","text":"I really like this place.  Staff is super friendly, the atmosphere is fun, but not loud, and they have some great fusionesk appies.  I know sush in the middle of the desert sounds wierd, but it's tasty.\n\nIf you come here, look for Victoria.  She awesome!  Great recommendations, perfect delivery, and she's cute, which is always nice!","useful":4,"funny":0,"cool":0},
{"review_id":"8x_uPXhl5Tr_d-_3JzXDFQ","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"uSRgegdEFHHasT5BbRkcFA","stars":5,"date":"2015-02-12","text":"Great spot, with a limited but good menu.  Very hidden, but somehow I have found this place 2 times by accident...so maybe the placement is genius...  Anyhow good beer selection, and great staff.","useful":0,"funny":0,"cool":3},
{"review_id":"WUSnRMHEcvSIA7kYi_A0pA","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"w8o8Q4grcp42qldVZUd9ug","stars":1,"date":"2016-05-08","text":"Avoid if you hate being frustrated...  Brought my 4 year old for a quick bite.  Literally 1 table occupied in the entire place.  Staff including two managers kept running by trying to figure out sections.  The occupied table turned out to be employees, who had an opinion of the sections, but little desire to help.  I tried to sit on the empty self seating section, but was evicted because my daughter wasn't 21...  Ten full minutes later we left for the place next door.","useful":1,"funny":0,"cool":0},
{"review_id":"htt-3h-4_Y38REsbSdSh1g","user_id":"GjzcwrVcPksUBhks4_jgZQ","business_id":"04kZ5CSh6oKhI5huU5bLdg","stars":5,"date":"2015-11-05","text":"Great Belgium selection!!!  I left a bad review last time based on the individual server I got, and that's not really cool.  This place has a fantastic selection, and a knowledgeable staff.\n\nFYI - they always keep Gulden Draak on tap!","useful":0,"funny":0,"cool":0},
{"review_id":"FjmQ4H1Vq3VN77U823q4nw","user_id":"YReSUjcINa8cuItbLPLUQA","business_id":"GMKARte5hboX_K9DdiVK2w","stars":1,"date":"2016-09-26","text":"Terrible place. They schedule 20 patients at the same time. Minimum waiting hour is 2 hours. All they care is about money.  Waiting time to get them on the phone is average of 30 minutes. When you leave an important message. No one gets back to you. Dr. Kneesel sees you maximum 2 minutes. i won't recommend to anyone","useful":1,"funny":0,"cool":2},
{"review_id":"9CmJv5DkPv23qA4eWiWTVA","user_id":"YReSUjcINa8cuItbLPLUQA","business_id":"jUeV4B3Gm8vUS2vqVGqj-g","stars":1,"date":"2011-10-19","text":"The worse tanning place I have ever been. They try to take money from you left and right.. and they don't tell you details when you go and sign up.. enrollment fee etc. etc.. where other tanning places do not have all these fees.","useful":1,"funny":0,"cool":0},
{"review_id":"o0htYQhxR7MB6c15ystDeQ","user_id":"qWY_fGA5Hy2vkjRtUo_78g","business_id":"To7hLxGbJ319OcQC0v2_fQ","stars":5,"date":"2018-01-04","text":"RE360 is an excellent leasing company. They are always quick to respond to maintenance requests and resolve the issue in a efficient manor. The staff is professional and returns phone calls in a timely fashion. I would recommend leasing through RE360 to anyone looking for housing.","useful":1,"funny":0,"cool":0},
{"review_id":"FEHlTfEjoD1Mkbzcvy3Y6A","user_id":"2kqE12U7QkAPQsm6P2KlDw","business_id":"NXTsT01IVpKYPpa_1L-Rlw","stars":4,"date":"2016-08-05","text":"great food but a little expensive good service and friendly waiters","useful":0,"funny":0,"cool":1},
{"review_id":"XH5drxUrPwyI4Mhm60hzPg","user_id":"j2fcXtmGPV-MntIE9M7Tjw","business_id":"9Rs7n2LbINBN8kLbScjhmA","stars":1,"date":"2014-08-03","text":"Personally, I was very disappointed in this place. So disappointed, that it made me go and write a review for the very first time. The lady working here was absolutely rude to my party. They actually served us the softest crepe ever when we asked for extra crispy. On top of that, I personally feel that they purposely served us a bad crepe because we brought outside drinks in... even though there were no signs to prohibit it. Instead, the owner took the sleeves from my drink and switched it with theirs. Rudeee!!!! As ridiculous as that sound, the comparison between the crepes that was served to us and the crepes served to other customers were completely different. It was also super overpriced... About $15 a crepe and that's not even \"fully loaded\" with all toppings included. I will never return here again.","useful":3,"funny":0,"cool":0},
{"review_id":"zDy12dA9EOLVbPMKHgrU0Q","user_id":"mwrNkyeDuDe_aviTmzC8FA","business_id":"Z0o7EnCj3fgzC7E3QRabhQ","stars":5,"date":"2016-10-09","text":"My husband and I love the pizza! We get the St. Anthony's and it is amazing! We tried the whiskey hot wings today and they are delicious! Staff is always friendly and drinks are good! We will definitely be back,,,,,","useful":0,"funny":0,"cool":0},
{"review_id":"dJW4JSGVES3fUA5gArPhCg","user_id":"1RFMHWr45B-kUeqYvmKR2Q","business_id":"PPBG1P0j5DOgNtbpFCMcdw","stars":2,"date":"2017-08-29","text":"Uses his experience to try and sell you a new unit before he fixes your old one even if it's a simple fix at least that's what happen in my case and after I got a second opinion and had it fixed for much less by someone else and I called him out on it he just hung up","useful":0,"funny":0,"cool":0},
{"review_id":"wmU2Aq_xVbtny5PVJ5RxMg","user_id":"bEmxyeBxCb5MB-Po82Rtug","business_id":"0qeEM6TpY6ydcMSgsF0x6A","stars":5,"date":"2015-02-26","text":"JW was very patient with my decision-making process and great with follow-through. The crew could not have been nicer or more skilled.  I love the way our house looks and very happy with Sims. I would recommend them highly.","useful":2,"funny":0,"cool":0},
{"review_id":"SVdGvyNgbAbpgpEOfbmHfw","user_id":"bEmxyeBxCb5MB-Po82Rtug","business_id":"fWS6PqM4DbcEc7UKCrUQdw","stars":5,"date":"2015-02-13","text":"I have had Stacy and Greg frame many pieces and have always been thrilled with the final results. They are so good at offering suggestions as to arrangement of items, mat color, and frame style -- always an improvement on my original ideas!","useful":2,"funny":0,"cool":0},
{"review_id":"rfEzNMb-be-TnAI4TKkzxg","user_id":"bEmxyeBxCb5MB-Po82Rtug","business_id":"brd8GD-8cSIf-TTRtLRPAg","stars":5,"date":"2015-01-06","text":"Archer Auto Repair does fine work. Joe has always been totally honest with us, telling us certain repairs aren't needed when they could have gone ahead and done them and we never would have known the difference.","useful":0,"funny":0,"cool":0},
{"review_id":"5yfrO66oUGHDPS5M8oSJyg","user_id":"iWMZhgRfxbUA8oifvbeKXA","business_id":"RUQ3td2-AJgVIBiebL0uZg","stars":1,"date":"2015-05-02","text":"They're out of business and no wonder, they're products are poorly applied\/installed leading to customer support requirements and that is non-existent.  Stay away.","useful":0,"funny":0,"cool":0},
{"review_id":"_Z2bEyhjKFxLsso7LiyaCg","user_id":"iWMZhgRfxbUA8oifvbeKXA","business_id":"Ashf3PMAJk05D_5QuUzl-g","stars":5,"date":"2015-07-12","text":"Pro Misting was outstanding from first contact through follow up after the installation. They are professional, do what they say they'll do and are polite and thorough.   I highly recommend their services.   Scott T.","useful":0,"funny":0,"cool":0},
{"review_id":"O-2M0DfvOmz1hu6ych-0xw","user_id":"S0RUtoXttDQzUpreZZ_lcg","business_id":"hyzzZdFi_RKXEGogcEAakg","stars":5,"date":"2014-03-07","text":"Best nail salon in Vegas for sure!! I've been everywhere and Harmony is the best, friendliest, cleanest, and most consistent!!! Go now!","useful":1,"funny":1,"cool":2},
{"review_id":"3pxVU_8RsA-nlDHoNsXQ7Q","user_id":"S0RUtoXttDQzUpreZZ_lcg","business_id":"8A8-xCeCZ3mKcpYT_P8_qQ","stars":5,"date":"2014-07-20","text":"Ale was amazing.  I came in today wanting a Victoria Beckham style and she did picture perfect amazing hair for me. Everything was fabulous from wash to cut to blow dry.  Definitely come and see her! The whole salon is consistent as well...hands down my go to salon for Las Vegas and the west coast.","useful":1,"funny":0,"cool":0},
{"review_id":"VRoPWz1CvcRX0xo3-UB5Eg","user_id":"S0RUtoXttDQzUpreZZ_lcg","business_id":"XBsQyfCb1T6UlipHy45NOw","stars":5,"date":"2015-04-01","text":"Dr. Raissi was magnificent beginning to end.  He was extremely honest and forthcoming with any information I needed.  I am a professional ballerina and my body is my machine so I was very careful about which doctor to chose.  Right away Dr. Raissi made me feel at ease, confident and realistic about my surgery.  I can't imagine feeling more comfortable.  When the day of my surgery finally arrived, I knew I was in great hands.  Post-op was no different.  His nurses are very personable like him and answered all the questions that I had.  My recovery has been wonderful thanks to Dr. Raissi's skills and the skills of his nurses.  I am almost back to 100% and for myself as a dancer that means the world. Thank you Dr. Raissi and your entire team.  If I need anything else, I know where to turn.","useful":1,"funny":0,"cool":0},
{"review_id":"kNwDK2As2LnL6VHwV4wMxA","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"lyIHmlIK7PKwQeGyR8svJQ","stars":3,"date":"2015-01-31","text":"This place has the best crepes in Toronto hands down. The sugar crepes are to die for!  The last 2-3 times I've been (during the summer) I ended up leaving because the wait was at least 30 mins long or the hostess forgot to seat us without apology. The third time this happened we explained to the Manger that this was not the first time this happened and she gave us a dry \"sorry\" like she could care less. We kindly walked out and never went back. The crepes are awesome yes but service is just as important as food. Without good service u have nothing.","useful":1,"funny":0,"cool":0},
{"review_id":"xBB2-Z07OYXm8uSp_w-FbQ","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"7OXmLjhdkWkbWW_SDLmc_w","stars":5,"date":"2015-02-10","text":"I'm actually very surprised with all the bad reviews here. I had an excellent experience! Everyone was nice and greeted me with a smile. No one spoke about you in their language.  They offered to put on a English speaking movie while I got my nails done (Serendipity) the woman listened to everything I wanted and did my nails exactly how I wanted. They used the Dip Powder Method that isn't used everywhere but it's fast,  neat and convenient.  After I washed my hands the woman stood beside me with a towel and dried them for me. After she completed the job she finished with an amazing hand massage. They also gave me one of those stamp cards for a free manicure on the 10th visit.  This place is clean, attractive, enough staff so you won't be waiting ridiculously long to be tended too. The price is a little more than expected but worth every penny. I will definitely be coming here again.","useful":3,"funny":0,"cool":0},
{"review_id":"o71UJhXh4gh-2tFiB2UQqw","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"eYzm1jUK0GsI2KOLTt2PbQ","stars":2,"date":"2015-01-31","text":"First time at baton Rouge,  I was not really impressed. The decor was just blah, the tables were chipped yet the service was decent. I ordered my steak medium well which came back medium rare, vegetables were half raw. The best thing on my plate was the baked potato. Don't think I'll be coming here again","useful":1,"funny":0,"cool":0},
{"review_id":"6eKqOemuuonRMrU1P3RKsA","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"zKZLxl3yBN_hVKJS7kEcuA","stars":5,"date":"2017-02-04","text":"My family and I go here religiously every other Sunday. We love the atmosphere especially on game night. The wings are amazinggg! And I'm usually not big on fries but they have they are the best! Their food is always fresh. We've been going for 3 years now and haven't had any complaints thus far. The staff is always welcoming, they even give your kids a little tablet to keep them busy with games while you wait for your food. 5 stars all the way!","useful":0,"funny":0,"cool":0},
{"review_id":"fiqxLuLFEX8zXRyOZ84qPg","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"LtzrJrQEfIf1zI_aM5jMtQ","stars":1,"date":"2017-02-04","text":"My fiance and I took a trip to Montreal for my Birthday and Seasoned Dreams was our first stop after our 6 hour drive. We were extremely excited to try their food seeing that we've been following them for months and fell in love with the menu. This restaurant is in the middle of nowhere, in an industrial area filled with graffiti (not very inviting). There is little to no seating, leaving us no choice but to take our food to go. The individual who served us was extremely rude and had a very a stink attitude. He acted as if he was doing US a favor. I asked for something that was on the menu online when he replied that is an old menu and the only food they have was on the paper menu that was taped to the wall. After looking over the limited menu, we ordered Mac n' cheese with shrimp and Half jerk chicken with fries that came up to $40. We waited about 45mins in our car before our food was ready. When we got back to our hotel we immediately dived into our food anxiously and almost immediately dived back out. The food was terrible! There was NOTHING jerk about that jerk chicken (Seeing that I come from Jamaican background, I know a thing or two about jerk chicken). The \"unseasoned\" Mac n' cheese was tasteless and had 4 measley shrimp. We were definitely disappointed and will not be returning on our next trip to Montreal. Oh and the 1 star was for display because they really do a great job at making their food look edible!","useful":1,"funny":1,"cool":2},
{"review_id":"RNBBBsG9lAvV5DvKbRg2QA","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"AQJPI5rnkb7pBnBMWtSjvw","stars":4,"date":"2015-01-31","text":"Beautiful ambiance.  The steak was cooked to perfection.  Servers were very professional, though we went at lunch on a weekday it was not full at all. There were literally 5 people in the restaurant.  I will definitely go again but probably for dinner on the weekend.","useful":3,"funny":0,"cool":0},
{"review_id":"WTYJqDZWaVecw-dtiG9D_w","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"vqgfQqPiLw6ghdVgpZ_vJQ","stars":3,"date":"2015-01-31","text":"This place is a hit and miss. Sometimes you get good service sometimes u don't, sometimes you get good food sometimes you won't.  The best items on the menu are the wings and nachos. Forget the martinis, they are all watered down unless you JACK IT UP!","useful":0,"funny":0,"cool":0},
{"review_id":"eAeXlUoyGGczvKtYj_4o_g","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"kLw_FmSiEqYH-MtFhDIUFQ","stars":5,"date":"2015-02-01","text":"Love! Love! Love this place! The food is amazing, everything I've tried on the menu so far was absolutely delicious. The restaurant is warm and inviting and so are the servers. The plates are a great portion and price point is affordable. Must visit at least once!","useful":1,"funny":0,"cool":1},
{"review_id":"m1XNyPPwWy36MGcSU_0-bA","user_id":"-eSDt3XuUoxxPula8zknXg","business_id":"uzjSN_Ac0udd3EL2oGlhFA","stars":1,"date":"2015-02-10","text":"I've been here 3 times and was dissatisfied 3\/3 times. My first visit I got a pedicure done before my vacation which was half assed, within 4 days the nail polish began to chip off of each one of my toes. My second visit I asked to get a full set done and waited 30 mins for someone to tend to me. Finally got in a chair and explained to the woman that I wanted the stiletto shape done and showed her a pic.  As she filed my nails I realized both thumbs were crooked and asked if she could fix them. She told me that is how they are supposed to be and it's straight from her angle. Going back and forth for about 5mins I told her I was paying for the services and I would like her to do my nails the way I asked. She got upset and said she can't do my nails anymore and started talking about me in her language. A woman who looked like the owner finished the job which was half decent and did not even apologize for her employee's behaviour. I told her how upset I was and she simply told me sometimes the workers are nervous. Huh? After that I was in desperate need of a fill seeing that I had the flu for 2 weeks and could not get out of bed. The same owner who did my nails the last time laughed and asked who did this job for you. I laughed and said you, and you'll never get my money again. These people are EXTREMELY rude! I will never waste my time or money here again. If I could give half a star I would!","useful":7,"funny":1,"cool":0},
{"review_id":"Ow2eFwS1azXCrQ_Et4Ny8Q","user_id":"D8-hREYsiosvZ7mh0EFrJg","business_id":"qGWFOvBOBJ2XoQl-E7WgmA","stars":5,"date":"2017-05-19","text":"My experience here was so amazing I had to make an account just to emphasis how good Brianna and Marissa are at their jobs. I was a little apprehensive as it was my first waxing experience but Brianna made the experience so comfortable, it basically felt like I was talking to someone I've know forever. Her attention to detail was spot on and she did an excellent job at walking me through the entire process. When it was time to pay Marissa really broke down the numbers in an easy and rational way where it makes Financial sense to get a wax pass. The experience was overall excellent. Five out five would completely recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"SIcWxkKqCOxFA93E0-ocrg","user_id":"rM5d3VHoV0zjxWF2qqBCXQ","business_id":"fHM09_y3QX3n4a_bIFbk_w","stars":4,"date":"2014-08-17","text":"Oh my. My BF and I arrived slightly after breakfast was over, so we chose the buffet. I'm not a big buffet person, but the WAFFLES were to die for! I ate there the previous morning and had the chilaquiles which were superb. I will definitely revisit! Service was a little slow, but overall a good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"x7IqJpdMkmvag8FN9tUG0w","user_id":"rM5d3VHoV0zjxWF2qqBCXQ","business_id":"dCUuzw3R2rPqKyN2Zl9zRw","stars":4,"date":"2013-10-06","text":"Get the Gnocci.  It is outstanding!  Tried to feed my craving here locally, and was completely disappointed. Can't wait to re-visit!  The only reason I am giving 4 stars is that our service was a little slow and our waiter didn't seem to have his act together.  Other than that, our party of 8 was very pleased with the food.","useful":0,"funny":0,"cool":0},
{"review_id":"elx1C66i7e4PCSrZ03LG7g","user_id":"rM5d3VHoV0zjxWF2qqBCXQ","business_id":"Akl6WDSUwYQ3zanxczLNSg","stars":1,"date":"2014-08-17","text":"My BF and I had a dinner reservation at 6, and I should have taken a hint from the near-empty restaurant that it wasn't very good. Don't let the price rating fool you. He had the Mongolian Beef and a California Roll and I had the Seared Ahi Tuna and Sushi Rolls. Both the meat and the fish were mushy. The Ahi Tuna was seated on a wonton with micro greens and a sauce that didn't do the dish any favors. I disliked my meal so much that I removed my FB check-in so I didn't suffer any embarrassment. Did I mention it was my birthday?","useful":1,"funny":0,"cool":1},
{"review_id":"sBeg6tUo9Cm9VO_-sbovCA","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"g93ECYDp2JB85zSVLWgK_Q","stars":4,"date":"2013-04-24","text":"Had the seasonal beef shank sandwich - really good - I'll be back to try other things","useful":1,"funny":0,"cool":0},
{"review_id":"TKjVy9Rtgh0nBPbgWrqMDQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"dn_ipqbm7_jUz5X3rDez_A","stars":4,"date":"2014-01-22","text":"Second time in Vegas, second time at Todd English PUB - \n\nOverall on both trips I found the food to be good - a modern take \/ update on simple pub food - this trip had the shrimp as an appetizer - good but I also feel like any place on this level shouldn't screw this up - and the New Amsterdam - that burger was great - good flavor with a lot going on.\n\nMy only complaint for this place was prices of some items - I get that its in Vegas and on the strip prices can be a little inflated, but $8 for a PBR and $9 for a Bud Light seems a little steep especially considering I was able to order a great craft beer for just a few dollars more rather than having a BUD....","useful":0,"funny":0,"cool":0},
{"review_id":"TIkcGRGpGGC_FoVlgFdSIQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"e7N0AW-sKkJmRIpEovxBAg","stars":5,"date":"2014-01-14","text":"I will be back every time I am in Vegas...\n\nIn town for a business trip and wanted to get away from the strip - looked this place up and headed over on a Saturday night - was not disappointed.\n\nThe beer selection was great - lot of new stuff I don't normally have access to (live on the east coast) - the bartenders were great in letting me try somethings before settling in on what I wanted to drink. I also loved that you could create your own tasting flight.\n\nFood was good - I had the cheese curds and a stuffed burger - both were done well and tasty. \n\nService was great - both bartenders I had that night were very friendly and quick with service.\n\nOverall, this is the type of bar if I lived near it, I would be there almost weekly - I liked it that much.","useful":3,"funny":1,"cool":4},
{"review_id":"FzjKwn80pPFu5DgDbWAkoQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"dLc1d1zwd1Teu2QED5TmlA","stars":5,"date":"2013-09-09","text":"I will be back to this place again...\n1. Food was really good and the price is amazing for the value\n2. The service was friendly, speedy and attentive - considering the food was so good, the service could have been half-hearted and I would still consider the place to be a great place to eat.\n3. The atmosphere of the place was nice - nothing fancy - contemporary but with some unique feature\n4. BYOB","useful":0,"funny":0,"cool":0},
{"review_id":"7e7ICHUdxmIa_VbLXFi0nQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"kyS7_vA_kNIluBQDOyWfIw","stars":5,"date":"2013-10-31","text":"Imagine those hardware stores you see on tv \/ movies where the you can go and know that you will get reliable help, well Rolliers is that place. The concept of customer service and expertise is not something of a past era. I have been here more than a dozen times for reasons and I have never left disappointed. \n\nI walked in with door knob pieces for a 100 year old door - not only did they know exactly what I was looking for, they had dozens to choose from to make sure that I had the exact ones I needed. \n\nI could only imagine the look of bewilderment that I would get if I walked into that big orange or blue \"home centers\" with the same questions. \n\nI have gone back since and will continue to go back over and over again because I trust what I am told when I ask questions - something that is hard to find these days. Yeah, some of the items might be a little more costly (not much from my experience) but that extra pays for customer service that you don't get from someplace that is concerned with shareholder profits. I would rather pay a little more and know that I am getting what I need for the job the first time rather than wasting my time over and over again.","useful":1,"funny":0,"cool":0},
{"review_id":"F62LacBGJ6EFwFf0Zm-a_A","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"b_XIKJ2nNzksuWhfMTEehQ","stars":2,"date":"2013-07-19","text":"I have been to this location twice recently - once of lunch and once for dinner - honestly I would say skip it. The service at lunch was extremely slow - I was there with a coworker - we both got sandwiches (one of which was not prepared the way that we asked for it) and it took almost 45 to an hour to get food with the place empty with the exception of two other people. I went for dinner to give it another shot - first strike was that the draft list wasn't up to date (or even close) and the server didn't even know what was on draft - you are a place that specializes in beer - know your products to be able to sell them. The food is just ok - nothing bad but nothing I couldn't live without. I guess what bothers me the most about both visits is that the service has been subpar at best. Prior to the last 5-6 years I would have said that Sharp Edge would be one of the better beer selections in the city - now there are plenty of other places you can find a great selection of beer with better atmosphere and service.","useful":1,"funny":0,"cool":0},
{"review_id":"kU2QhE3tuZrWrg0deg95Zg","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"SmkYLXEYhzwUZdS6TAevHg","stars":2,"date":"2013-11-01","text":"For a while now I was eagerly awaiting the opening of Butcher and the Rye as I have enjoy my trips to Meat and Potatoes for both food and drink. So on a Thursday night I headed over for a few drinks. \n\nUpon first entering, the place looks great - nice atmosphere, modern meets butcher shop in the woods - and then you come upon the wall of whiskey...holy smokes. So I walked over to the bar to grab a drink....and thats where it started to go south...\n\nNow I came to check out the whiskey and they do have a very impressive collection - in fact one of the best that I have come across. I enjoy the brown liquors in all forms and really enjoy those times when I run across something new, especially if it is something that I say \"wow, I want to own a bottle of that\", so when I run across a place I can dive head first into trying, I'm in heaven. \n\nI asked for whiskey menu and was handed an iPad - cool idea to convey info about the booze and a way they can keep it up to date with what they have - except that it seemed like not even half of bottles were on it. Ok - first week, I can excuse that a little but not totally - if you are a touting your collection, get your menu right before you open. My friends and I tried to ask about a few different items behind the bar and one of the responses we were given was \"you'll have to ask (guy with the hat), he is the guy that knows the stuff the best\" - really? 400 bottles and only one person is knowledgable enough to answer questions. \n\nThen came the sticker shock - their prices seem like they were set and they multiplied 2x. I have been to other places in this city (and others) that have a some of the same items and they were charging double for it. Now I realize that if you have a bottle of X and it is not something you will sell everyday so it will cost you a little more to keep it around, but when a 1 oz pour of that drink runs $15-25, it's putting a night of sampling in the $80-100 range for 4 oz of booze. I don't to sound cheap and I have my spent a fair share of money on good bottles over the years, but thats just it - I would rather take that $80-100 and go get myself a bottle - your atmosphere is not worth the mark up. \n\nSo my overall though is that they have a collection and just that - the place does not come across as someplace that you go to try and find new whiskeys, just a place to get a drink while staring at their wall of booze. It reminds me of the guy who owns 40 classic cars, but doesn't care to drive them.\n\nI will say this, the staff was friendly and fairly attentive, so I don't want to sound like they were bad - they were good - same level I would expect in any place similar. \n\nNow after writing this I might sound like a pretentious ass about whiskey (because I fairly new to a lot of it) - and maybe I am - but when I try and go someplace that touts their whiskey collection, I expect be able to experience new things while having a good time and not going broke. For me, B&R isn't that place....","useful":16,"funny":6,"cool":5},
{"review_id":"k3Dks-Zcd5T8IN2QRYH5QA","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"TpZO3sokGBg8mDYyTRiGiQ","stars":3,"date":"2013-08-01","text":"I have been to the bar upstairs (Harvard and Highland) many times, but I tried the food for the first time last night. Overall, it was ok but I wouldn't make the trip for just the food again. A friend and I sampled the brisket, pork and ribs. The brisket had the texture of a wet sponge - far too tender and if you didn't order brisket, you wouldn't even know that it was beef to when the cooking process began. The pork had some unique flavor, but wasn't the best I've ever had (had better off a friends smoker). Overall, I liked the ribs the most - good flavor and just about the right amount of tenderness. The cornbread was crappy - you could make better with a box of mix off a shelf. A couple of friends ordered the fried chicken and mac & cheese - I got a small sample of both - I would say both were the best two items I sampled. \n\nAlso - I think the prices of the food are a bit steep - usually BBQ give you so much food that you feel like a glutton - now I'm not looking to eat that much at any time, but I feel like you are paying for the name (and name of the chef - that being said I have been to some of his other places and I do enjoy them) rather than for high quality BBQ. The atmosphere is cool, but honestly I would rather eat BBQ at a small shack with crappy plastic chairs - just seems to fit the foot better. \n\nOverall, its it good - not really - its it ok - sure - but for my BBQ desires, I'll grab food from Pittsburgh BBQ company and eat on a picnic table instead.","useful":4,"funny":0,"cool":0},
{"review_id":"zQmzVqlVxbb0N0eEy6QapQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"slMjKmGTnufGx6ZWR6Mg3A","stars":5,"date":"2013-07-19","text":"I go to this place pretty regularly - the owner is amazing - he knows his place and loves to share his knowledge about beer with you. Every visit the staff has been helpful and friendly. The food - well I cannot say enough good things about the sandwiches. I also like that they feature a lot of local breweries on draft and offer you a chance to sample something new every Wednesday - great idea. Keep up the good work.","useful":1,"funny":0,"cool":0},
{"review_id":"TOkPWQ4_EWIdqg471TQsnA","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"iXnHrmTw-r6LNzC2MjjrWQ","stars":4,"date":"2013-04-15","text":"Good tacos - quick service - nothing bad to say about this place - planning on going back to check out the Friday \/ Saturday special","useful":0,"funny":0,"cool":0},
{"review_id":"OR7FZV_D7Xn2flzXr5sHWA","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"czJKX4DmZR_1JeRmPcnmbQ","stars":5,"date":"2013-11-06","text":"This place is a gem - one of the best little local joints within miles!\n\nTaco Stand:\nI don't think you can get a better taco in the city - authentic - pick your preferred meat (or potato & pepper veg option) and load it up with all the condiments that you could want - best part - $2 a taco - its hard to justify cooking when the food is that good and that cheap!\n\nMarket:\nI love this little place - fresh produce, meat, and other items all in this little place. Need something quick, just run in and grab it. I have used it more than half a dozen times for quick needs or when I need authentic ingredients and don't want to hunt all over town for them. \n\nI will be back over and over again....","useful":1,"funny":0,"cool":0},
{"review_id":"YxG0UV6ufHwLaEQaOnwPZQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"23gakZ_NlN3K0SqOBybwug","stars":5,"date":"2014-01-20","text":"After wanting to check out this place for a while, a friend and I decided to check it out during PGH Restaurant week - we were not disappointed.\n\nAfter being seated, we checked out the menu - my friend ordered the restaurant week special (brussels sprout appetizer, trout, desert) and I opted for the duck testicles and cassoulet (pork belly, chicken hearts, oxtail). The brussels sprouts and duck testicles arrived - the duck was good - nice flavor and something I would consider ordering again even though it is a little out there - but the brussels sprouts were from another planet. I don't know exactly what they did, but it almost seemed like they had a general tso's flavor to them - I would recommend them to anyone. \n\nMains arrived right after we were finished with appetizers - perfectly timed - the cassoulet was great - balanced flavors and the pork belly in it just fell apart. The trout was light, flavorful - I would consider ordering both again. \n\nWe tried the flour-less chocolate cake with the beet ice-cream for desert - the chocolate was rich, but not overly sweet and the beet ice-cream was good.\n\nThe service was great the entire time - attentive but not too much. \n\nOverall, great experience and this place will be added to my list of places in the city that I would happily return to...","useful":2,"funny":0,"cool":0},
{"review_id":"5YAPniIBDYR6t-QLcPU7JQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"MtjOk7u7sp3yWyzscAIG4Q","stars":4,"date":"2013-07-09","text":"Went in for lunch the other day - ended up chatting with the cook for the day - pretty damn good food - had empanadas, good seasoning to the meat filling and pastry on the outside nice any flaky - cuban sandwich was good - cook ended up letting us try the gazpacho - that was great - nice flavor and really fresh - wouldn't think twice about heading back to this place.","useful":0,"funny":0,"cool":0},
{"review_id":"nKIC3AddfR0_C7sjd6A9jQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"eAZqT24e0Pk8apWzy3RsAQ","stars":2,"date":"2013-09-20","text":"Found this place via Yelp and it was also mentioned in the Charlotte city guide\n1. Atmosphere is good - its a bar \/ BBQ joint - doesn't try to be fancy and thats good - beer, BBQ, sports, etc.\n2. I got the sampler that had the pork, pot roast, ribs and chicken with the mac & cheese and green beans - portion wise its enough for two people but it was the only way I could sample everything\n3. Ribs were good - tender but didn't fall apart - pot roast was interesting as it first time I have ever seen that - chicken was chicken - the pork was disappointing - I have made better pork myself. I expected a lot more from a southern BBQ joint - just didn't have any flavor.\n4. Sides were good, but nothing that was jaw dropping\n5. Service was speedy, pleasant and friendly - that was good all around\n\nOverall, I expected more from this place and left thinking that the ribs were the best thing I ate, but overall I was a little let down.","useful":1,"funny":0,"cool":0},
{"review_id":"Ow_d832eHEYPjtxcFSnmMQ","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"7m9ux0KgTe2NwUU0XA_9xQ","stars":5,"date":"2016-06-09","text":"I've had my MINI detailed there twice now and each time the car has come back looking almost new. Everything was cleaned, scrubbed and polished to look fantastic and they even the time to take extra care on a few areas that I was had concerns with. I will be back again for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"PuC9Flgk8o7bQslHXh18vw","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"Eg_M8eeu9SDEdbP7iUmVbQ","stars":4,"date":"2013-09-09","text":"I had been wanting to try this place for about 6 months - finally got the chance on Sunday night....\n1. Food was good - I had the burger, the other person with me had the prime rib sandwich - both were very good and presentation was nice\n2. Atmosphere was great - sat outside on the porch - nice area to eat with a view of Pitt\n3. Service was really good - they made a small mistake on my order but caught it before I could even get the words out of my mouth - it was fixed within 5 mins\nNice place, would definitely go back, especially in warm weather months to sit outside","useful":2,"funny":0,"cool":0},
{"review_id":"CyG16kqkLOGgMIhHmqzpsw","user_id":"jM9YePr12W78DZyFq-l-Sg","business_id":"oaqbLDW3wNqkynlnp4mvlw","stars":5,"date":"2014-01-22","text":"While at CES, a small group of us made a reservation at Lupo for dinner - I was a little worried as this is yet another place carrying Puck's name, but I left happy and very satisfied - none of us were disappointed...\n\nA few of us arrived early and grabbed a drink at the bar - both of us had higher end whiskey at the bar - prices were fair for what we were drinking. \n\nWe were seated and ordered appetizers and dinner - all food that everyone ordered was great - I personally had the bruschetta with mortadella, the beef short ribs and polenta - all items were fantastic. Others in my group had the lobster risotto, filet and salmon - all of us had the same though - amazing.\n\nOverall the service was great - servers were on top of their game, knowing when we needed something, yet not intrusive. They were even willing to make something that wasn't currently on the menu for one person in our party - their answer to that seemed like it wasn't anything big at all...\n\nNext time I'm in Vegas I would definitely consider heading back to this place...","useful":5,"funny":0,"cool":0},
{"review_id":"nsFw9h9ci1CyEV4W_6HTFw","user_id":"9hrMKgkPfqGXlf83LhFcEw","business_id":"8QYOnNLFTrpfPip44eMheg","stars":4,"date":"2014-07-31","text":"Still love the place and will continue to frequent ! But I must say that on several occasions I have witnessed Tim \" the bartender\" be beyond rude and flippant to several customers ! It's too bad !","useful":0,"funny":0,"cool":0},
{"review_id":"LhSnYJsjMXJNG32uQ0gtfA","user_id":"0JVZ6OzY26ZaGsp8wIOfUQ","business_id":"WBxR9IC6E9-4szNzq7_Y3Q","stars":5,"date":"2017-07-23","text":"During our visit to Phoenix, our friends took us for lunch a few times to Lemongrass Thai Cafe.  We were blown away on the service and the wonderful food provided by Nipha and her staff.  We were welcomed with open arms and treated like family.  Being from Dallas, we have been to some great Thai restaurants.  But my gosh...we felt like we were in Thailand feasting on the rich authentic flavorful dishes that's been practiced in their family for centuries.  I'm in love with Lemongrass Thai Cafe.  Can't wait to go back!!","useful":0,"funny":0,"cool":0},
{"review_id":"vBjpLRCXHrx13l02_qJXfA","user_id":"5AUEYdtwb4FV9jwWWIzgVg","business_id":"0JqPI6mv7xHloURlf0L4Mg","stars":4,"date":"2015-08-12","text":"Discovered this place when my best friend and I were craving Thai food and were just scrolling through the yelps.\n\nI definitely agree with the good reviews this place gets, the food is great and for a great price!\nWe were the only ones there on a weekend at dinner time, so this place definitely doesn't get the traffic it deserves, but its definitely one of the city's hidden gems. The\n\nI even went back and brought a group of my co-workers here. We all had the lunch special that comes with a spring roll and bowl of soup, all for about ~$8 and they loved it too.\n\nThe only negative thing I have to say is that the waitress that served us (both times I went) was not very courteous with us. She just takes our order and leaves, no smile. Once there was a piece of plastic wrap in my friend's cup; we told the waitress and she just took her cup and exchanged it with no apology. But this is sort of expected and common in a lot of asian restaurants, so I wasn't too surprised. Just a thing to keep in mind.","useful":1,"funny":1,"cool":1},
{"review_id":"v50P_qERttxgMNWDJzzQTw","user_id":"5AUEYdtwb4FV9jwWWIzgVg","business_id":"NGgHn-Mu2mSOaXS9e2dtvA","stars":2,"date":"2015-08-12","text":"Customer service at this location was terrible, but the ice cream was good.\n\nThere was a line when I went, and when it was my turn, the attendant asked for the order of the people behind me. I politely told him that I haven't been served yet, and the man rolled his eyes at me and said \"okay what do you want\". I was a bit taken aback and said he could finish taking the other people's orders but he sort of just looked at me. I quickly told him my order, paid, and got out of there asap.\n\nI like going to marble slab with friends for their cute ice cream cones, but the customer service has turned me off from this place a couple times. I get they must be tired, but seriously is it so hard to just be polite?","useful":4,"funny":0,"cool":0},
{"review_id":"E7XvUK9OwGlrppLeu2j2RQ","user_id":"aFU_fXgBOcEYcyzUEeGMTQ","business_id":"uGxZdLLgMQDvFSqiXyCg_w","stars":1,"date":"2016-09-24","text":"I been going there since year but every time I went this restaurant is shut down with health department I was curious why is closed then I read the health department sign at the door they had so many critical violations repeated that's why it been closed. Buffet is cheap but poor hygiene I I'll not recommended to go there if you want healthy food","useful":0,"funny":0,"cool":0},
{"review_id":"g2K9Wfdn62EGPKi-vFbYHQ","user_id":"zj8ulrRi68FGKLiv9rdmGg","business_id":"GSzgEBYd1hYebz1xi5jrmw","stars":1,"date":"2015-06-30","text":"Called in a pizza the guy took my order over the phone and said it would be ready in 15 minutes. Walked into the store and the guy that took my order said that it wasn't ready that he couldn't find my order made me wait an extra 20 minutes for my pizza. Horrible service not reliable and didn't feel appreciated or welcomed at all.","useful":2,"funny":0,"cool":0},
{"review_id":"2_QhEYzPwM6ynjqzh0oxjg","user_id":"zj8ulrRi68FGKLiv9rdmGg","business_id":"GmdujALb1Nq2RHGr7jhCaA","stars":1,"date":"2017-02-15","text":"This place is the worst \"thing\" I've ever stepped in. I was told the wait time was 30 minutes, waited for an hour to be seated with no one checking on us, when finally our turn to sit down we waited for another 5 minutes till someone came to ask if we were ready to order. The sides were dry and it seemed like they've been sitting for some time. We order a beer and when the waiter returned and he handed us glasses they had lipstick on the rim. While being grossed out we order our check and looked at us like seriously? (Are you honestly surprised)They honestly have no idea what customer service and quality is. All I wanted was to enjoy a nice dinner and I couldn't even do that. Please if you have other options immediately cross this one off. TRUST ME YOU WONT BE MISSING OUT ON ANYTHING!!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"bLVraVYLs60DC325q30X8Q","user_id":"zj8ulrRi68FGKLiv9rdmGg","business_id":"LtO6vTBfYzlgWArn3kRe_A","stars":3,"date":"2015-01-21","text":"Today sucked there has been way better times. Disappointed for it being a slow day. But got food fast","useful":0,"funny":1,"cool":0},
{"review_id":"Rp78zL9StZ43xV0M1XJlsw","user_id":"zj8ulrRi68FGKLiv9rdmGg","business_id":"NfM1YE-FJCToO1LB36T6lQ","stars":1,"date":"2016-01-11","text":"First time here and I can honestly say I WILL NEVER BE COMING AGAIN!! \nJason's deli was horrible ordered 3 items of the menu and disappointed with all 3. My turkey wrap which is a top pick was horrifying. My entire tortilla was hard and cracking apart as I picked it up. The wilted vegetables and over ripped fruit that came with it didn't help. It had no flavored and the sauce didn't help it just over powered. The half sandwich and soup option was no better actually worse. The soup seemed like powered cheese clustered into one ball and the sandwich the best out of everything was literally two bites. My panini was horrible the bread was some hard nasty plain white bread and the sandwich had no flavor. It was dry and flavorless. What a disappointing experience now I know to never come back.","useful":0,"funny":1,"cool":0},
{"review_id":"OwchPPUTSrtz7lkQLSZfmA","user_id":"ZITgfvV158q0m5xYr4ktqg","business_id":"0sX-jsw2gcFVqdzGlqU_kA","stars":1,"date":"2015-01-19","text":"After a disagreement with my husband on s pick up time for our dog, we were shocked to find out Shawna called the poodle rescue to come and take our dog after a grooming.  She never called to tell us she had done such a horrible thing and we called the shop and went to the shop only to find it locked up and no phone calls being answered.  She finally called to tell us she did this after we contacted the police.   We got our dog back with no explanation from Shawna.  Stay clear of this place.  A friend had her dogs' ear cut in half and found it days later to have been crazy glued back on with a mass infection.  They were never told this incident had happened.  In all fairness, our incident occurred over a year ago but felt it necessary to post now due to continued complaints from people about their service.  Just want to keep all dogs safe!","useful":3,"funny":0,"cool":0},
{"review_id":"bgpvLSkjwprd64uKPHI62w","user_id":"mlrzMAssE_yIXHwIv_qFAw","business_id":"wKl6qcNSFY3HziVNZ-aVKQ","stars":2,"date":"2014-04-25","text":"I had very high expectations when I went in, but if I had went in with less expectations I would have considered returning. \n\nI didn't mind that the place was small, but I did mind that for the price I was paying the portions were quite small. Having experienced authentic ramen, I was rather excited to read about the house made noodles and old school broths that were made. I ordered the tonkotsu classic, and I was immediately disappointed by the mixed green salad that was on top. Then I noticed the tonkotsu broth was clear which lead me to feel that it was closer to shio than the creamy white tonkotsu broth that I have always known it to be. I was super disappointed when I tasted the soup which was way too salty for my taste. The noodles were good, but it is far from authentic ramen noodles. \n\nThe only positive experience for me was the ONE slice of pork that the ramen came with. If they had advertised Shiki Menya as a \"new age\" ramen, I would have let many of the above mentioned things slip, but they are marketing their establishment as classic and old school Japanese umami...etc...etc...I am really not feeling it at all. This place reminds me of all these other restaurants that are trying to \"hipsterfying\" themselves. In conclusion, I won't recommend my friends to go, or return myself.","useful":5,"funny":0,"cool":0},
{"review_id":"9ap_TmcmPrVeo8doIm3vHg","user_id":"mlrzMAssE_yIXHwIv_qFAw","business_id":"5yhUr1Cv21bOL6ZkE5IdCQ","stars":4,"date":"2015-04-08","text":"Not going to lie, if you are expecting service from this restaurant you're going to be really disappointed. Dinner service usually have 2 servers, and you literally have to hunt them down for order and water. Other than that, I have to say this is honestly one of the best Chinese restaurant in Calgary. This is coming from an immigrant from Hong Kong by the way. That's worth something right? (lol) \n\nAnyway, back to the review. They make old school Canton style cuisine, and their food is always fresh and never over cooked. They are super famous for their salt n pepper squid, so I am not going to go into that. If you love seafood and cream sauce, I beg you to give the lobster in cream sauce a shot. The way they make their cream sauce is just heaven...I am not joking or exaggerating when I say that my Italian fiance will take the left overs from the dish and turn it into lobster alfredo linguine. It is that good. Another favourite of mine is their deep fried chicken. The chicken is NEVER dry, breast always moist and skin crispy, simply perfection. Favourite part is probably the little saucer plate with the spiced salt in it, oh and the prawn crackers. (Very authentic) \n\nWhy only 4 stars after such a good review of their food? 2 reasons. One I already talked about, the service. The other is because the restaurant itself is not friendly for people with disabilities, and their stairs are freaking steep! All in all, this is a really good place for good Chinese food.","useful":5,"funny":5,"cool":0},
{"review_id":"IhfocFD-mp5clbhTzzhmSA","user_id":"mlrzMAssE_yIXHwIv_qFAw","business_id":"mkQ31BFYV8ri7znJpHd7Ww","stars":1,"date":"2015-04-08","text":"Where do I start? Let's start with service. This place's service, along side with Sun's BBQ restaurant has by far the worse service or customer service I've ever received. Now, some reviewers believe it is a racial thing. I can tell you it's not because I am Chinese. When I order I speak Chinese, so it's not a race thing. I hear that they don't get paid well there, that's probably why.\n\nAnyhow, I can tell you that one time where I ordered out of the menu, gave them the item number and they recited it back to me and when the food arrived it was wrong. I told the bus person that it was not what we ordered, she told me she was not the server and walked away. Our server came back, and asked me what was wrong. I told her it was not what I ordered, and we didn't want to take someone else's food. To my surprise, instead of checking our order she told me on the spot that it WAS what I ordered, and told me I was wrong. HA wow...ok. Still trying to be nice I told her maybe she should check the order because I am sure it's not what I had ordered. She rolled her eyes, walked away and came back and insisted that it was what I ordered. It says so in her note pad. Filled with anger by this point, I looked at her and over to my friend and I said, \"let's go\". We got up and proceeded to leaving the restaurant. She was shocked, stood there for a few seconds and told her manager\/cash person about it. She came up to me and asked me what was wrong. I told her what just happened, and she said she will find out what was wrong. (No apology) Trying not to make a scene we returned to the table. A few minutes later she came back and told us it was a miscommunication. The kitchen had read the order wrong, and they will proceed to making the correct dish now. (Still no apology) \n\nMy friend and I decided to stay because we were starving. We ate as fast as we could and asked for our bill. Every one knows when you're in a Chinese restaurant, don't ever expect a compensation when they screw up. If you didn't know, well now you do. Getting our bill I noticed that they had charged the extra dish that they got wrong, I gave the bill back to her and told her it was wrong. She ripped the bill out of my hand and threw down a new one. Well no tips were given that night.\n\nNow on to the food. There was one place in time when their service wasn't that bad. My family had dim sum there on a few occasions. The variety was ok, some unique dim sum that is house special and it's steamed fresh when ordered (it's like a sushi list in scantron form. You fill out the bubble of the item you want). Quality is OK, not exceptional, but let me tell you that if you had allergies to MSG or high blood pressure...steer clear. They drench everything in MSG, I swear.\n\nNow on to dinner, their portions are small and food is really not that exceptional. You can get better quality and price from another restaurant. We ordered ribs one time, and for $16 there were only 6 bones that barely had meat on them. That's almost $3 for a Pedigree dental bone. Same as dim sum, MSG and sodium levels are off the charts. \n\nTo end my uber long review (apologies for the length), I will say that the only time that I will ever return is if I was invited for a wedding banquet there.","useful":7,"funny":3,"cool":0},
{"review_id":"Kf91XKz6aS7WBbNioG2UfA","user_id":"Whgbdk7t-36aDANqJnoijQ","business_id":"n3iI8Io1mKqQg_geU_sifg","stars":5,"date":"2013-07-14","text":"When our recently purchased used Buick started having problems, I was really bummed. It's so hard to find a trustworthy mechanic. A previous trusted mechanic told me to look for a official Napa Auto Repair Center. He said that usually means they are good. He sure was right this time.\n\nBenn at Discount Emissions (Glendale location) couldn't have been better. His bedside manner was outstanding and the work they did on the car was solid. He did everything he could to a) save us money, b) save us hassle, c) arrange for other transportation, and d) clearly communicate what he thought the problems were and how best to fix them. The car was even ready ahead of schedule!\n\nNow we are actually looking forward to getting our oil changed since we'll get to see Benn again.","useful":4,"funny":1,"cool":0},
{"review_id":"Uvk1mdUCzqoGoNYYfre9-w","user_id":"HEpxnJNUwTwviNvTfX5hMg","business_id":"PKSslavO2Bbgpl3dlTypgA","stars":5,"date":"2016-01-21","text":"We had a great experience with these guys! They had the best price out there and were nothing but courteous and professional throughout the whole moving process! They did end up being a half hour late, but they called ahead of time to let us know and they brought an extra mover (at no charge to us) to help make up the time. They did a great job wrapping our furniture and even helped re-anchor a shelving unit to the wall in the new apt. Above and beyond great service!","useful":0,"funny":0,"cool":0},
{"review_id":"WM6VnH-9pFYiclbhEk7bHA","user_id":"QSBxfPN9TDatEZ_oEuPeDw","business_id":"lbFgv1FrC0ffg5vkVrB58g","stars":5,"date":"2017-12-12","text":"Champs Family Automotive has been servicing my vehicle for 5 years. I know that i can always count on trustworthy service at a fair price. I appreciate that I can call in with an emergency and the team at Champs Family will squeeze me in for a repair. Thanks Champs Family for keeping me safe and on the road!","useful":0,"funny":0,"cool":0},
{"review_id":"fK4Kd78bHy9luyPstQfncQ","user_id":"t32fvcQt3NR_gRAGINxhBw","business_id":"o02KlhotihUxQOdiIyW19A","stars":5,"date":"2014-08-27","text":"I'm so sorry for the above person's experience with this wonderful place.  I know how emotional and frustrating it can be when it feels like no one is listening.  I had completely the opposite experience and we were far from easy.  Both of us have factors that contribute to infertility and repeat pregnancy loss and they took us with no qualms.  They basically held our hands all the way through and made us feel like family.  Our fist attempt with IVF we did get pregnant and we lost it.  The second time, we were successful in every way, and I was still a nervous wreck!  They never ever made me feel crazy (even though I was) and now we go to Baby Day.  I would give a thousand stars if I could!!!","useful":2,"funny":0,"cool":0},
{"review_id":"NI78fWHt8ed0UJ5owbYSmQ","user_id":"t32fvcQt3NR_gRAGINxhBw","business_id":"f-GasVWTMxmmm7pGOq13jQ","stars":5,"date":"2011-04-21","text":"Beth has been doing my hair for about a year now and it's never been better!  She knows exactly what she's doing and her new place is awesome!!","useful":3,"funny":0,"cool":1},
{"review_id":"XqDkYFxoE--SSzRKyqqVHA","user_id":"JlmFuNDqGTmURvsmuWGQ4g","business_id":"-6tvduBzjLI1ISfs3F_qTg","stars":4,"date":"2014-12-21","text":"The horchata and Frangelico with the Mexican street corn, chips and salsa were amazing. We tried three tacos - crispy fish, beef and ahi tuna; and a shredded beef burrito - all were tasty! Jessica and Andrew provided out of this world service! Ended the evening with Mo's special and while a little \"liquified\", special it was! Thank you Joyride for the treat of an evening out!","useful":0,"funny":0,"cool":0},
{"review_id":"FqHDXlRVI0TbiFM9iOW2PQ","user_id":"s-NPaUjwegLuuOU_NrDl2w","business_id":"Jy96qxfFFH4Wa-KhkmwSMw","stars":1,"date":"2012-08-22","text":"Wow, what a total disappointment this place was! Not only does the physical space need some serious TLC, but gone are the long line-ups out the door, and the numerous, delicious gelato flavours. In fact, calling their product 'gelato' is an insult to gelaterias around the world! Less than half the amount of choices than I had ever seen, place mostly empty and unfriendly service. No signage on the front door indicates that they only take cash, and only one flavour allowed for a small cup--a small that costs an outrageous $4.20+ tax!  No signage indicates this ludicrous rule, clearly aimed at trying to upsell customers for a medium, for a ridiculous $6. Even when my four-year-old was on the verge of tears for a second flavour, the staff did not budge. Save your money and head elsewhere...any other Italian gelateria in Toronto is much better than this one, Sicilian Ice Cream on College, or Hotel Gelato on Eglinton Ave. W. can run circles around this place. There is zero chance of us EVER returning!","useful":0,"funny":0,"cool":0},
{"review_id":"KrgT09qlOMGd_asyqwN_1A","user_id":"GphW5Co9mrXlRtix89sWUQ","business_id":"Rnck2nc0j-FbolNiae2grg","stars":2,"date":"2017-09-05","text":"Ordered the food a couple of times and have to say I very perplexed of the the taste of the chicken in their dishes so much so I am not sure it is chicken so I will not order again!!!","useful":1,"funny":1,"cool":0},
{"review_id":"CexgjDJXi_gEa6EMgXTRJQ","user_id":"8xEUW4wudgHOduj2lIcg7w","business_id":"XVVFgEY-0MsyEAR8SO7dzg","stars":2,"date":"2013-10-04","text":"The service could have been better, they messed up at least two out of four orders when I ate there. We got conflicting answers from the service staff. The atmosphere appeared hectic. The waitstaff could have been better trained.\n\nYes, it's an airport with the prices, so I didn't feel bad to ask for things that were forgotten the first time around.","useful":1,"funny":0,"cool":1},
{"review_id":"HWFYiJDMyVSkLr6gAu67gw","user_id":"5ADbINKw8OEqhG6kD0rVBg","business_id":"DB1kg0GJZXNrFYZqsxeavg","stars":5,"date":"2015-01-08","text":"Food is great I've been vegan and gluten free for a while and heard about the selection of food they had very hard working people if something isn't go your liking you will not leave u satisfied today I ordered a chicken philly cheese steak on gluten free bread I liked it so much for lunch I got it for dinner as well I was craving a chicken steak sandwich and this place is beyond phenomenal if you haven't done so check them out!!","useful":3,"funny":0,"cool":0},
{"review_id":"LbLSoDr77M26acWuyw96Sw","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"dWffjh0V6htC26wfPr8_Ug","stars":2,"date":"2016-01-23","text":"pretty good pie, I also had the pot pie, which was mediocre.  Odd location, felt like I went in someones house. Limited selection, near closing time.  Have had better Pricey","useful":0,"funny":0,"cool":0},
{"review_id":"CzkDJKJE_WJLWr0zs3TcEA","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"GB6bZTCMmqZncRSxurNblA","stars":5,"date":"2015-08-08","text":"Wonderful. Food that is uncompromisingly delicious\nEliot Wexler has done it again.  Watch out tempe. There is a new restaurant in town and it is amazing.  You must go before the lines start forming.  Great experience","useful":2,"funny":1,"cool":0},
{"review_id":"jHs1-31ClqGiTHLBU_t87A","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"Q9ZyTPQN7zzTk8MJ5J8TFQ","stars":1,"date":"2016-09-26","text":"Three things I come in for every week, and two and a half out of three weeks they are out of the products.  I get Bison Bars, I asked them to buy me a case, I go through alot of them. Once again, they are out.  Out of my creamer, again, I tell them I will buy a couple a week. out.  I understand I am small potatoes, but am very frustrated by lack of planning.  They are nice when I ask about it, I just dont understand, cant buy it if its not in stock. I  am going to start sourcing elsewhere. You lost a good customer","useful":0,"funny":0,"cool":0},
{"review_id":"gBJPf4sOE-gZg5otEac5aA","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"VYLQ3bMCqmHiNO2FS8aAsg","stars":5,"date":"2016-01-23","text":"only pizza in area that I will gladly eat. A native new yorker, I like my pizza a certain style, and they nailed it. Good value, service, prices. All good, huge fan! I tell everyone I know, and will continue","useful":0,"funny":0,"cool":0},
{"review_id":"6zmhNZVMtr3oWrafHw4_4g","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"j8j0IV_eemJpFuRRvdNobQ","stars":5,"date":"2015-08-08","text":"Nice place\n  Friendly service and great selection of wine.  A nice refuge in a busy airport.   The cheese selection was varied  and the burger delicious","useful":2,"funny":0,"cool":2},
{"review_id":"BNQYl9TW8iOPeNktZK1gLg","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"VaEqjAeKAm_iUnOpaktyMg","stars":5,"date":"2015-08-08","text":"Great food and service\n  Jeff was amazing!! Best airport restaurant  quick corrects service. I hear they are opening one in tempe. Bon appetit.","useful":1,"funny":0,"cool":1},
{"review_id":"mQjr8HnqBde5kPbZTvOHiw","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"DgZ-pZUo3drzpiCDlDr9IQ","stars":5,"date":"2015-08-30","text":"Great food and incredible service. Friendly caring and warm service. Pho is rich and balanced. The service!!","useful":1,"funny":0,"cool":0},
{"review_id":"9nSMts2vDy4_DQlTb1_pcQ","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"IbDCaYwFi-e-nhEmH-FYPA","stars":1,"date":"2016-01-23","text":"was there a month ago horrific experience, the manager called me to apologize, I reluctantly accepted an offering of two gift cards, they were never sent, go figure.  Called today to ask them how that is possible, got hung up on. Stay away!","useful":0,"funny":0,"cool":0},
{"review_id":"MHlwFRfOcZKzwg9ClW7RXQ","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"smBsHggLvIuABgntBvlYLw","stars":2,"date":"2016-01-23","text":"mediocre, nothing special, server was a kid who knew very little.  Food was bland, uninspired and it wasnt cheap. Probably targeted at the Rubes who come for the winter from the upper midwest.  Wont go back","useful":3,"funny":0,"cool":0},
{"review_id":"4s8O93NUSu2FxzSc50TPIA","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"jTTZ9PlB4VpuwQTOhr_TyQ","stars":2,"date":"2016-01-23","text":"expensive, not healthy, long wait time, besides that it was good. Really a cookie cutter shop that was out of alot of the fruit selection and it took a long time to get the items.  There were kids working there,and they were uninspired","useful":0,"funny":0,"cool":0},
{"review_id":"QLWA43v0KQnuBLK-e8PifA","user_id":"Jrlh_7kglBbP3_4OaUIe6A","business_id":"s5TJlFtdXcx_tXC4tlttlw","stars":5,"date":"2016-01-23","text":"great food, but better service, warm, friendly fun. Genuine food and they know what I eat and drink, (love the singha) I go once a week, and would like to go more.  Nice job","useful":1,"funny":0,"cool":0},
{"review_id":"Bxd_Z3XNJeuXE3lVghzuZQ","user_id":"UtJ_Fmva0pNKolmwGgNaBQ","business_id":"WnXnMFAfUYFZDVS5vRuV3w","stars":1,"date":"2014-07-12","text":"People. I just lost half an eyebrow. \n\nI just moved here from CA and don't know anyone. Because we moved in the middle of the summer and it's AZ. I get it. \n\nBecause we're actually in Marley Park, right around the corner, I've passed this salon a dozen times walking to the store. I made the mistake of looking in the mirror a little too close and realized I was long overdue for an eyebrow wax. \n\nI should probably have guessed that there was something up when there was an opening at 5 on a Friday. Or when the stylist got wax in my hair. \n\nI didn't notice in the salon, or I would have said something. \n\nIt wasn't until I got home and looked in the mirror. Something just looked off. I didn't look like myself. I tend to get puffy and red, so it wasn't until I really looked that I realized. \n\nI was missing half an eyebrow. \n\nMaybe this salon is awesome at hair. The receptionist was super nice. The place looked clean. But if I were you, I'd think twice before I got your eyebrows done here. Unless, of course, you're into the cyclops look. Then, by all means...","useful":0,"funny":6,"cool":0},
{"review_id":"nlKi6t6p9o9sDlyDNGJoAg","user_id":"UtJ_Fmva0pNKolmwGgNaBQ","business_id":"CvonRhKDJaH155xhtpz_iw","stars":1,"date":"2017-02-25","text":"The service here is so incredibly terrible that I'm writing a review... which I rarely do.  Great beer.  Great appetizers,  TERRIBLE customer service.  In the interest of fairness,  we've gone three times in the past seven days.  First time,  we had a huge party.  Service was slow as molasses.  We ended up going to the bar to place our drink order.  We were also the last to leave,  because our waitress apparently forgot about us.  Second time,  my husband went with a group from work.  What was scheduled to be an hour get together for apps and a beer turned into two because... service. We thought we'd try sitting outside just now,  have a beer in the sun after going to Lowe's,  and give them another chance.  We literally sat at a table for 15 minutes without even getting a menu,  let alone eye contact, and walked out.  I understand being busy.  As you're walking by a table,  just say, \"Hey! We are super busy,  but I see you and I'll be right with you.\" Simple.  Such a bummer,  because there is such a need in Surprise for a gastro pub, or someplace that isn't another chain.","useful":0,"funny":0,"cool":0},
{"review_id":"zlj_wBbx9HentPDmskC_qQ","user_id":"hrkRxkE3Bfsmv35YIMry5Q","business_id":"0dRqzEG9-2QNnvJtdpdDZw","stars":1,"date":"2017-01-19","text":"I've used them quite often for breakfast catering at work.  It's always a disappointment.  I've had empty coffee containers delivered, they're always late, they've lost orders (today's order specifically).  I have a meeting starting shortly and I won't have anything ready when our guests arrive.  This is the last order I'll be placing from Panera.  UPDATE:  Order just arrived and was wrong; only got half of what I ordered.","useful":0,"funny":0,"cool":0},
{"review_id":"PZzyAqeD63lNrUOfXaKPhQ","user_id":"hrkRxkE3Bfsmv35YIMry5Q","business_id":"SV8y4bp5HmgURzvUC2Rs9w","stars":1,"date":"2016-12-10","text":"We will never order delivery from Pizza Palermo again. Delivery from Pizza Palermo is the equivalent of arm wresting an octopus.  While the food isn't bad, the delivery people never want to actually deliver the food to the apartment; they'll call from downstairs and ask you to meet them at their car in the street.  That's not delivery.  We order on line, so everything is paid in advance, including the driver's tip and the delivery fees.  It's not like they're going to get stiffed.  And street parking is readily available within reasonable proximity to our building, and is free after 6PM.  They call and argue that there's no place to park while I can see from our window that they're already parked while we're on the phone.  We called and spoke to a manager to complain about this and we were told it's their policy \"not to deliver upstairs, unless it's an emergency\".  I can't imagine what constitutes a pizza delivery emergency.    If I have to put on shoes and run out to the street to pick up the food, I'd just walk the extra block to their store.  I'm paying for a service, why not deliver?  Original Milano's (412-404-7530) is better, and they never have a problem delivering to our door.","useful":0,"funny":1,"cool":0},
{"review_id":"mwtEjJs3aOZMPFvL8-mxeg","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"WETHRoXB2IbixndSlOktJA","stars":5,"date":"2015-06-14","text":"The food taste as good as how they look. Satisfying! I think it's a little expensive for breakfast but the servings are huge, so I think it's just fine. I love their French Toast which are actually like puddings. I like the apple raisin more than the blueberry peach.","useful":0,"funny":0,"cool":0},
{"review_id":"BbqaQjwXCnvM14w212T90A","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"OYHpqY6-3C-wXR-uPbHhwA","stars":4,"date":"2015-04-04","text":"The service is good but it takes a longer wait for the food to arrive because they're freshly preparing it as you order it, so I guess it's not suitable for large groups. Not suitable for those with little kids who need high chairs either because they don't have any.","useful":1,"funny":0,"cool":1},
{"review_id":"jgj_8S_IWnukbAwD2_vCdQ","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"byOhOn25YXJf863vP4e6vw","stars":1,"date":"2015-02-11","text":"Went to their drive thru. Woman behind the window looked and sounded mean. She's a Latina. She's not suppose to be in a customer service industry, in my opinion. I ordered the 8 piece chicken with 4 biscuits and one side. I asked her to make the side into just a large gravy instead. She told me she can't because it's more expensive than a side. I asked her how much the difference is. It actually has the same price. My husband was able to do this the last time we bought here and now she's telling me that they're not allowed because the gravy is not considered a side...REALLY??? Because I got annoyed, I changed my order into the 8 piece chicken only and a large SIDE of gravy...it's the first time I saw a box of chicken shoved sideways into a small plastic bag, just as the other reviews here have mentioned. This store doesn't seem like they wanted to please their customers at all...When I got home and opened the box, some of the chicken were not freshly cooked. It seems like it's been refried again or microwaved because the meat were already too dry and kinda jerky and have absorbed a lot of grease in it....YUCK!!! Never again will I buy from this place. I would rather go to the other store on the other side of Craig Road by Tenaya...You just lost a repeat customer because of bad customer service and some reheated, stale chicken pieces...NEVER AGAIN!!!!","useful":1,"funny":1,"cool":0},
{"review_id":"Y_2C4SxEX0TquA-LZefP5g","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"MX2OYa2sS5ys_6AiK-gs3A","stars":4,"date":"2016-01-16","text":"All of the food I ordered here are good. I'm giving 4 stars for that and I would have given 5 if the customer service is better. Didn't give me water unless I asked for it, the first time I ate here.","useful":0,"funny":0,"cool":0},
{"review_id":"89C9i1a0OFxJn7qFwEv-gQ","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"JjjlhlQ2LEaQMuAug4fDIA","stars":4,"date":"2015-10-02","text":"The food is awesome, but the customer service is not that great. I guess it is their culture. If you are looking for good authentic Taiwanese food, this is the place to go to, but don't expect a highly attentive staff to serve you. I've been to the other Taiwanese restaurants in Chinatown, but so far, this deli has better customer service than those ones. At least the staff here smiles at you, for me that's friendly enough.","useful":0,"funny":0,"cool":0},
{"review_id":"qkwb47AaAshMIoHL5Y8Xkg","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"iT0YmSRHLJbGgG_4aGzfdg","stars":1,"date":"2015-07-19","text":"I called and placed an order by phone so that I will save time, pick up the food and be on my way home. When I got there, the person whom I talked with on the phone asked me again what my orders were and just put it in the system as I was repeating it to her. Long story short, they made me wait for 30 minutes because it was so busy that day. What's the point of calling ahead if you still have to wait that long? Aside from that, the quality of food served was subpar. The fruits were not that fresh. The bananas on the pancake were already turning blackish and the strawberries were already wilted. The spinach omelette I ordered was not an omelette, it's just a fried scrambled egg with blanched spinach on it. An omelette is suppose to be a scrambled egg with all the other ingredients mixed with it, before frying it. Will never be back again. Horrible food and service. I would give a negative number of star if only it's allowed.","useful":0,"funny":0,"cool":1},
{"review_id":"O89uqX_Y2_Rnog9dwrfH2A","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"DC6LVnt9BVa8BkGYPAU75g","stars":5,"date":"2015-08-07","text":"My daughter has been coming here for more than a month now. She improved a lot on her singing in just a few sessions and is now starting to get rid of her shyness. Susan is such a great vocal teacher and mentor. Now my son is also enrolling with her. My daughter became so interested in music and now she's also trying to learn how to play the ukulele. I highly recommend this music school.","useful":0,"funny":0,"cool":0},
{"review_id":"McnSAZ7NWtjlgH2Qcjx7Ng","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"lV840VDGdQUS78LPVFg6ig","stars":5,"date":"2015-12-11","text":"I had a wonderful experience with ABC. I had a very minor accident wherein my right side bumper was side swiped by another car as I was changing lanes. ABC fixed it and it's as good as new, like nothing happened. Their quote is honest and is almost the same to the quote of the car insurance...just a few dollar difference. They even gave me a discount for paying in cash. I would highly recommend them to anyone who needs to get their car's body to be fixed. They are the professional you can trust when it comes to this type of job.","useful":2,"funny":0,"cool":0},
{"review_id":"MktaKXvddopHOUMP3nzMIg","user_id":"ew476n-v8Z8Y3uqIhIWPEQ","business_id":"yp2nRId4v-bDtrYl5A3F-g","stars":4,"date":"2015-08-04","text":"Food is good. Authentic Thai food, freshly cooked as you order them. I love their spinach salad. The place is a little small and cramped, so you might as well make a reservation if you're going in a group. Price is reasonable as the food are freshly prepared.","useful":0,"funny":0,"cool":0},
{"review_id":"1XVVnUyI7TojZLnRlrM2BA","user_id":"La8WpdrRH5PSfekKhEn_jg","business_id":"pQSn1vvdiZ3oumWjE1XUKQ","stars":2,"date":"2016-07-16","text":"Staff is extremely rude when you call for take out orders. Beware of disrespectful service.","useful":0,"funny":0,"cool":0},
{"review_id":"OJK_TS9YW8WOg7b-hFBCFw","user_id":"La8WpdrRH5PSfekKhEn_jg","business_id":"piHJq_NDrOh5SYk3AyQVOg","stars":5,"date":"2014-01-14","text":"I have been to Chestnut many times and it gets better and better!  Lots of gluten free options (all the salads are GF) and everything I've tried is delicious.  I adore the banana bread pancakes -- they are fantastic.  The winter quinoa salad is beyond wonderful -- I dream about it.  The coffee is incredible -- be sure to try the lavender honey latte.  Heaven!  Such a fun hangout -- love the atmosphere and the outdoor patio.  Chestnut has become a quick favorite -- can't get enough of it!","useful":1,"funny":0,"cool":0},
{"review_id":"3gFyiovIGc2zRYO1GN7x0w","user_id":"WwYgRcoZcD5jFma0DW3o9w","business_id":"zwIsw9zjZdbW0muZ31KYXw","stars":5,"date":"2017-12-11","text":"Excellent work at an exceptional price. Highly recommend Paul. He repaired the repairs other made.","useful":0,"funny":0,"cool":0},
{"review_id":"W1wYpgT1cCj1jmaDNLsssQ","user_id":"p5ORvfbCl50nVWOVukZRzg","business_id":"NWioeR6MmKxgYD87EL56wg","stars":4,"date":"2014-12-22","text":"I love this place almost for everything, but the shower area can be improved.  Most of the shower heads are clogged and\/or out of use.  And I often see people brush their teeth at shower area...gross!","useful":1,"funny":0,"cool":0},
{"review_id":"DI-wELpVcej2e4b5OsQx4w","user_id":"p5ORvfbCl50nVWOVukZRzg","business_id":"eV-5b1Bjtnn-QePN3t3taQ","stars":4,"date":"2016-02-13","text":"Food is okay, I like it because this is something different.  Service is excellent, very friendly and helpful.  We'll comeback.","useful":0,"funny":0,"cool":0},
{"review_id":"u4xvKpyVDMBNRRQVdcpf9w","user_id":"HaEMHt2mESF3ddpvAKPFBA","business_id":"aquo9Z8bgXPJxT197HN4-g","stars":5,"date":"2015-09-04","text":"My sister recommend this storage company. She said that she had a smooth and easy transition in and out. Well I am writing this review to absolutely confirm that the service is wonderful. Angela the staff at the front desk is a sweetheart! Very helpful, professional, and swift! Truly was in and out in no time. Storage was clean and enough discs at a great price!","useful":0,"funny":0,"cool":0},
{"review_id":"mHijFLY-pwsHAGvT7qu2Rg","user_id":"uvh7whodyJXypsnI6nh5rA","business_id":"ri84NqVqaCxqsCOOOlPtbg","stars":5,"date":"2016-07-14","text":"Ebony and team were absolutely wonderful!  I will continue to personally request Ebony as she always picks the best crew.  I initially chose Maid Complete because you  know exactly what the charges will be before you start.  I have used them for cleaning and also for general unpacking after a major move.  Whether you need general cleaning, unpacking after a major move, Maid Complete will get you there!","useful":5,"funny":0,"cool":1},
{"review_id":"WST8PVcL_RHrO2hY51YmBA","user_id":"nMS4w_21H3hFsefMaR8ZCw","business_id":"pAqgiVcOY5mPouuEW96R0g","stars":2,"date":"2017-06-25","text":"I liked it here okay, but this was not my cup of tea.  Dark, smokey, loud.  I guess I just don't like bars in general.\n\nI went to attend Lady Fest.  While everyone working there was at least somewhat friendly, they failed to inform anyone that the concerts moved downstairs while the next set was preparing upstairs.  I didn't even realize there was a downstairs (I guess I should've read some of the other Yelp reviews more carefully).  There was a sign up by the stage, but that was the only indication that the concerts moved downstairs.  I guess perhaps this is not the fault of the bar, but it would've been really helpful for the bouncers to share that information when I came in.....  They weren't busy at all and it wouldn't have been too difficult for them to share that info, I don't think.\n\nThe drinks were good, but expensive for my preferences.  $5 for a beer, $8 for a mixed drink.  \n\nAs I mentioned before, the bartenders were very nice, especially one of them.  However, the clientele was decidedly unfriendly. \n\nI don't know, as I also mentioned earlier, I don't care for bars that much, but had gone to see the Lady Fest bands.  This was just not a good experience for me, and I won't be back.","useful":1,"funny":0,"cool":0},
{"review_id":"iBJD-UwCgY3cN9pZ2AI1sQ","user_id":"nMS4w_21H3hFsefMaR8ZCw","business_id":"7I_xWHdCaH-CtZLQGkhsjg","stars":5,"date":"2017-06-07","text":"I came to this place while hiking on the Three Rivers Heritage Trail.  Now I will warn you, you have to cross a highway and climb a giant hill to get to it.  But it was worth it!  \n\nThe place feels like a cozy house to me.  The colors are really cool and there are several different rooms.  Also there are lots of outlets available.\n\nI got the grilled chicken sandwich and it was very yummy.  Also the waiter was very friendly and helpful.  :)\n\nI really enjoyed this cafe; it was just what I wanted!","useful":1,"funny":1,"cool":1},
{"review_id":"4l73n6TO-QQhrvUEl6lBCg","user_id":"_xBHXcdztiAdyfa6Cqm5IA","business_id":"CpPJ2UKAxDLwj95-HNFPHg","stars":5,"date":"2015-05-20","text":"One of my favorite spots in madison! In the morning you can't go wrong with a breakfast sandwich & latte. Lunch time go-to is the hi ho hummus wrap! Don't miss the lobster bisque soup when they are serving it - it's the best!","useful":0,"funny":0,"cool":1},
{"review_id":"A-UIX-Vy8dNe5hrOZg0KIA","user_id":"WxlvfLuNiEWPX_arHSONeg","business_id":"URtR6hX2cTL6n3MXratCSQ","stars":5,"date":"2015-06-16","text":"We just started a new business and went to Las Vegas Color Printing for our first round of business cards. The staff was extremely helpful and very patient with us while we decided on what we wanted. The cards came out fantastic, at a reasonable price, and within a reasonable amount of time. I would highly recommend them and plan on using them again in the future.","useful":0,"funny":0,"cool":1},
{"review_id":"SI-sJxs3rAlBFKMs71jWjw","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"xCK8AIaqR0Agmwi3MCeaiA","stars":3,"date":"2015-08-05","text":"This review is about the service department.  It is the most frustrating thing.  They actually do a good job working on cars, but they have been backed up for months.  It generally takes three weeks to get your car in there.  Obviously this is not an option when something brakes and you need it fixed now.  Not sure what is going on, but I have been forced to take my car somewhere else every single time.  At this point I won't bother checking with them anymore.  If you have plenty of time to have your car worked on, by all means, give them a try.","useful":3,"funny":0,"cool":0},
{"review_id":"BlsVvU52sl7faIjap5i3lA","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"7fiRVsawDX0vCpoMTbbxcQ","stars":1,"date":"2013-09-09","text":"I am sad to report that this place has really gone downhill over the last few years.  I used to enjoy going there, and the food was completely acceptable.  I'm not sure if it is new ownership, or if they are short on money, but the food lately has been awful.  The egg and shrimp rolls are the only thing which is edible.  I had the curry chicken today.  It consisted of 99% onions and then some chunks of a white, watery, tasteless substance which was supposed to be the chicken.  Absolutely terrible.  I ate a few bites and gave up.  My wife had chicken with Chinese vegetables.  It was basically the same, 99% celery and then this mystery chicken.  My son had sweet and sour chicken, and he didn't finish his meal, which is very telling.  He said the chicken tasted funny and the breading as weird.  All in all, it was a waste of 19 dollars.  We just had some sandwiches to fill us up and the food went in the disposal.  Oh, did I mention that the fortune cookies were stale?","useful":2,"funny":0,"cool":1}]