[{"review_id":"FvjiRz5AhudQ34C6P8YLgQ","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":5,"date":"2014-08-05","text":"pros-  our window was from floor to cielling and wall to wall with a view of the strip\nhuge rooms \nhuge bed\nfridge in closet \nsafe\nlots of mirriors\nshuttle to the strip\nonly SEAFOOD buffet in Vegas that i know of\nthe A\/C is strong\n\ncons- resort fee unless you book with easyclicktravel.com then you dont pay resort fee.\ncarnival buffet could be better\npool needs more shade","useful":1,"funny":0,"cool":0},
{"review_id":"p3A56Xd6L7JM3URwL2_91A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"gfos-L-4tZ7TKektSglXcQ","stars":2,"date":"2010-10-13","text":"This place is a coffee shop by day, and a bar by night, which may help explain the stripper pole and the dance floor. \n\nReally nice atmosphere, lounge-like seating areas and free wifi. What's not to like?  Well. While I did appreciate not being charged for soy milk, and I liked that they charged extra for to go\/paper cups (I think it was 50 cents) the soy latte I had was totally awful. \n\nBitter, sour and composed of mostly foam. Maybe this was an off day, but it was honestly atrocious. I wouldn't mind visiting Blondie's in the evening sometime, but I think I'll just skip the coffee from now on.","useful":2,"funny":0,"cool":2},
{"review_id":"lnU-YB13acJD5b3Hos9bYw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"WTGmtvIE1v9uEBZxiyXImQ","stars":5,"date":"2012-07-06","text":"Relaxing atmosphere, educational chalk based corn diagrams, and air conditioning... what more could you ask for? Well, add to all of that, that the food is delicious. Maizal is a recent addition to the Liberty Village area. They have vegan and gluten-free options in addition to non-vegan\/veg ones.\n\nThe menu is short and simple. At the moment, the vegan options are: grilled quesadillas sin queso (ask for no cheese\/dairy) with either poblano peppers or mushrooms, the sopes with black beans, tlacoyos (bean filled tortillas), and opales (cactus.) All very yummy sounding options. Their tortillas are entirely corn based (and gluten-free) and made fresh every morning. (they also happen to be delicious.)\n\nOther things on the menu I should mention: the horchata. Traditionally milk-less, it's rice based at Maizal, with a cinnamon spice, and perfectly ice cold. \n\nOutdoor patio space is out front on Jefferson, and small but decent. Interior space is ample, but I imagine it's going to be an area lunch time takeout place pleaser, a tasty, healthy meal for under ten dollars. If you sit in like we did, you can read about the history and cultivation of corn on the very aesthetically pleasing chalkboards (and no joke, it really is interesting.) And let me say it again: Air Conditioning.\n\nWe each ordered 2 grilled quesadillas sin-queso (no cheese.) We sat sipping on horchata's while we waited and enjoyed the corn diagrams. They arrived, with pico de gallo on shredded lettuce, and a side of refried beans.  One poblano pepper and one mushroom. One bite and I've decided these tortillas are made of tasty magic. That one bite was all tortilla, and it was so rich in maizey-flavour and texturally superior to nearly all other tortillas I've had up until now (so I eat a lot of tacos...)\n\nThe fillings for both were great, both hearty and satisfying with rich savory flavours. Add some of the pico and a touch of lettuce and it is perfection. The folks at Maizal are doing exciting things with food, and I'm looking forward to seeing more, and eating much more from them.\n\np.s. prices are reasonable.","useful":7,"funny":4,"cool":4},
{"review_id":"ZWGcxdt0-60YpvS7L57qiA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"eMLvsFmMFtzTaIn1LJJbdQ","stars":3,"date":"2011-02-28","text":"This is another place I'd never have stumbled upon had it not been for the Indie Coffee Passport. I'm never in the George Brown area. We dropped in on a Saturday morning and it was mostly empty.  Walking by, it looks like an old antique furniture store with a random assortment of unmatched pieces.\n\nNo, but really, I like random, and I like the atmosphere, it's weird but well lit. I'll call it... cozy. I liked the big wooden table by the window I didn't have any luck connecting to their wifi with my ipod but I saw other people on laptops tapping away. Minimal plug ins, but they exist.\n\nIt was a beautiful looking cup of coffee, but it may have also been the worst almond latte I've ever drank. I think it's great that they offer almond milk, but I'm not convinced they knew how to use it that day. Overall... my problem was that the coffee was very bitter. Way too bitter. \n\nAlthough it didn't effect me, this place is cash only. No Debit Cards Allowed!","useful":3,"funny":3,"cool":3},
{"review_id":"8ZMhRRoj3TEq32TQkGfgIA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"EJmiKQKlWfY-0iVlya7FOQ","stars":2,"date":"2011-04-29","text":"I went to Z-Teca for the first time a few weeks ago after being really excited to try it out. Unfortunately, as with most over hyped oversold places, once I did try it, I was really disappointed.\n\nService was friendly but the flavour was lacking. It felt like I had gone to Chipotle, but so much worse. The rice and vegetables were boring, and rice was in copious amounts. Beans are optional\/extra? What is up with that? It's a burrito!\n\nI doused my burrito in hot sauce to give it some flavour, and vowed to find some where else to go next time I was hungry in Fairview Mall.","useful":5,"funny":3,"cool":2},
{"review_id":"xyNUC_p5KPI8LOCrAXZHnw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"XdY36-Qh_DxnCaFpTPfYMg","stars":5,"date":"2012-03-09","text":"So it's the first day Tori's Bakeshop is open, so maybe it's premature to review them... but I can't help it. Yelp must know about a new vegan & gluten free friendly bakery.\n\nIt took me about 40 minutes on the Queen streetcar  to get here after work... but it was worth it. Since it was the end of the day, they had already run out of many of their sweet baked treats (even after apparently baking 3 day's worth of things) but I grabbed a vanilla cupcake with butter cream frosting, a delicious chocolate chip cookie, and a gluten free butter tart (and a non gluten free butter tart). They were all delicious. The cupcake was spongy and fluffy, the icing sweet, whipped, and not stiff at all. I was especially partial to the GF butter tart.\n\nFriendly service, and great interior design. I loved the overhead lights - they're freaking lamps made from giant beaters, plus every table had fresh flowers on it. One word sums this place up -  adorable. (In two words - adorably delicious.) I love the random jars with stuff in it aesthetic. Lots of greens and neutral tones.\n\nAlso - wifi.Free functional wifi. There are outlets all over the place if you look for them (one main one that I know of is right at the front corner with the comfy seating. Yes.\n\nGolly I wish this was closer to parkdale\/trinity-bellwoods - though odds are, I'll be back really really soon.","useful":7,"funny":0,"cool":5},
{"review_id":"J0WxHbfHRJRwR8v5eZSv5A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"gOBxVkHpqtjRRxHBIrpnMA","stars":2,"date":"2010-11-13","text":"I'm not quite sure what the fuss is about about Chipotle. My burrito was flavourless and unexciting. When I bit into it I couldn't help but think... wow, I waited 15 minutes in line for THIS? \n\nI think it didn't help that one of the members of counter staff left right as I got to her station, so I stood there an extra 5 or 6 minutes waiting for someone further down the chain to realize... oh nothing is happening.\n\nThe one of the things I did like was the tortilla chips with the hint of lime and the fresh pico.\n\nMaybe I had a bad experience, maybe I've just had really amazing Mexican food, maybe I should try them again, or maybe I should just try a different location.","useful":3,"funny":1,"cool":1},
{"review_id":"5TU970wx8_zGCWH6cAl6dw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"3te8dGIvzz5V5_kMIr6-Dg","stars":4,"date":"2011-04-07","text":"I'm late to the Hot Beans praising party, but not late in trying out their delicious tacos and donuts. Taking a bite out of one of their fresh lime coconut donuts makes me want to write poetry, but it looks like another reviewer has taken care of that.\n\nSo what can I say, I haven't eaten anything here I didn't like. The tacos are all delicious (though my favourite is the Yuba), and an order of nachos is filling and flavourful with spiced beans, cashew cream cheese, some kind of cheese sauce and veggies. I've been eyeing those burritos, but haven't gotten around to ordering one yet.\n\nI'm happy to see a couple of different hot sauces on the side bench, along with a help yourself collection of water jugs. You might notice the lack of garbage can, well, everything is biodegradable. Which is awesome, but I can't help but be compelled to bring along a reusable container with me so I don't waste any more paper bags on donuts I inhale in 5 minutes anyway.\n\nThe limeade can be a bit too heavy on the agave sometimes, but otherwise I have no serious complaints. Service depends on the day and who's at the counter, but it's usually somewhere between decent and awesome.\n\nThe seating is limited to about 9-12 people depending on where you're sitting, but it hasn't felt crowded any of the (several several several) times I've gone in. There is a lot of foot traffic, people running in and out to grab a quick bite. \n\nThe simplicity of their menu and pricing scheme is appreciated, just enough choice, without too much choice. What you see on the board, is what you will pay (tax is included), and combining donuts and tacos or beverages results in a nice round number which nutty folks like me will appreciate.\n\nI haven't checked them out for breakfast on the weekends, but it's definitely on my to do list. Breakfast burritos... tempting, tempting.\n\nSeriously, vegan or otherwise, at the very least pick up a donut, you wont regret it, really, go. Eat.","useful":10,"funny":6,"cool":9},
{"review_id":"LmB8A15Vah5-SDchzKzJlw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"YWd0I1BxSzFG61lSyC3IyQ","stars":4,"date":"2012-08-13","text":"I've lived in Toronto for two whole years as of this month, and I have never once had  a bad time there. More often than not, we've gone there for brunch, and the service has been stellar. Not just hey they'll bring me my order the way I asked for it, but they'll do that AND be friendly, helpful, and fast. Service is great, they have on repeat occasions gone out of their way to be accommodating (without attitude).\n\nA big one for me is they are vegan friendly (including the best most delicious vegan caesars in town) with most brunch items available veganized (and like every other brunch place they are omnivore and lacto-ovo-vegetarian friendly too,) you sit where you want, you can play board games if you want, you can drink bottomless coffee with your brunch if you want, you can ask for their fancy cocktail menu (yes, they have one), or just check out what's on offer to drink on the chalkboard.\n\nI'll also say, that the food is okay. Tofu scramble is hit or miss, but usually it's decent enough that even on it's worse. I've had worse tofu scrambles at places catering to vegetarians, so there is that.\n\nI've gone with friends, I've gone with family, I've gone in pairs, I've gone in big groups. Go for brunch. It's great. Go for drinks, it's fun. \n\nOther stuff: Cash only (but there is an ATM inside), they have baked goods and cheesecake from Through Being Cool (vegan) bakery, and conveniently close to Nazareth Ethiopian restaurant (eat delicious Ethiopian food then go drinking).","useful":0,"funny":1,"cool":0},
{"review_id":"lQkK4Gc3OBjunuacm8kH-w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"_u1Bq7QsgMUXSMex8QHqLQ","stars":4,"date":"2010-11-20","text":"I finally went to Burritos Boyz the other day and I was really pleased with what I got. Flavourwise and servicewise it trumps Chipotle entirely.\n\nI got a vegan burrito and didn't feel deprived of anything, it was a nice big meal. I really liked how they constructed it. It made a huge difference when biting in. There was an intermingling of flavours rather then the usual \"oh here's rice, oh here's lettuce, oh here's salsa\"  feeling I get from some other places. It was quite filling, though I probably could have eaten two for lunch. I think grilling the burrito is a nice touch, crispy on the outside warm and yummy on the inside. \n\nThey have veggie ground round, and vegan guacamole, and hot sauce that's actually hot. I wish they also had some daiya, because that would have made this place all around perfect.\n\nWe got there right before the lunchtime rush, so not only did we get our orders quickly, I even snagged a seat in the corner.","useful":6,"funny":0,"cool":3},
{"review_id":"97d7Qy70tyFoJJaGVuCaqg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"it1wU0wd2Lk9lCHC1xzoNw","stars":3,"date":"2010-11-11","text":"There are a few vegan options here, and they are labelled clearly on the chalkboard near the cashier (though they don't always write everything they're serving on the board). \n\nService was friendly and quick, I ordered the sweet potato and rapini pie, which wasn't as tasty as the dish my friends ordered (the cauliflower and soy protein pie). They have a vegan cheesecake that is phenomenal.\n\nIt's a cozy little space, and there were a few other folks there when we walked in on Saturday, but it didn't feel too crowded.\n\nI'll have to try their coffee next time.","useful":0,"funny":0,"cool":0},
{"review_id":"ZN6_sQ0lyfmkh80x3Pl0eA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"PlNwT37ZahtL-3GRHQ7mVg","stars":4,"date":"2012-11-14","text":"I went here last week on Friday, and it was great. I wondered why it had taken me so long to actually go in (well I know why, the outside doesn't look nearly as inviting as the inside does). Menu is colour coded and vegan, vegetarian, gluten-free, or non-veg friendly. There is probably something for everyone here which makes it a good potential spot to take non-veg in-laws or something. \n\nService was great, our server seemed to actually like it there, and was knowledgeable about the menu.\n\nI had the phish and chips and would totally eat them again, pretty delicious. Crispy deepfried pieces of tender tofu, with a side of chips and spicy house made tartar sauce.\n\nI think it's time to check them out for a Sunday brunch and see what it looks like on a busy day.","useful":2,"funny":0,"cool":0},
{"review_id":"0xHhGITMc-kyCJLn2t5trw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"Qg2ijqYI_6YUKRr7jeZy-g","stars":3,"date":"2012-05-11","text":"I prefer this location to the other ones in the city. We live really close to the Queen West one, but order delivery or dine-in at this one.\n\nDine in service is always friendly, and quick. Dishes are veganizable, there are lots of options, the food is always tasty and the portions are huge (we're eaters, but we still end up taking food home with us). The food could be spicier, but that seems pretty standard in this city and nothing a bit of hot sauce can't fix.\n\nMy delivery experiences have varied. When I order things through Order-It or Just Eat,  the resulting delivery takes forever, there are often issues with our order (like egg in the pad thai when we specifically said vegan\/no egg), and the prices are more expensive than just ordering directly. \n\nSo we started calling them to place delivery orders and things went much more smoothly. Orders seemed to come faster with no mistakes.","useful":0,"funny":1,"cool":0},
{"review_id":"slfzD2yLMjVYXjPdVumtug","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"kemSq9mBxmPaKHQrUXPJ_g","stars":4,"date":"2013-01-16","text":"I went to check out Kupfert & Kim today at First Canadian Place. It was reasonably busy, even at 3pm.\n\nService was friendly - though it seems like they have a lot of staff behind a very small counter (maybe it was shift change?) It's a very clean looking space, and I like the selection of vegan and gluten-free sweet treats, like stuff from Earth & City, Bunners Bake Shop, and Rawlly Delicious.\n\nI ordered the \"First Canadian\" , and while I've often felt really bored with bowls of vegetables\/grains\/etc, this one was a great mix of ingredients - tempeh, quinoa,  shredded red and green cabbage, sweet potato, and a flavourful dressing on the side.\n\nThey've got a decent selection of milks (soy, almond, coconut, and  rice) for prepared coffee drinks like cappuccino, lattes, etc.  and fresh juices.\n\nOpen from 8am to 5pm, they've got breakfast and lunch menus and seem like a great option for meatless, wheatless, fare in the Financial District.\n\nThey just opened two weeks ago, so they still seem to be working out all the kinks, and they don't have a (useful) website yet, but as far as the food is concerned - so far so good!","useful":7,"funny":0,"cool":3},
{"review_id":"Qwu0ke4_G4OtemDnQKeYZQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"1s0QjbBbhmjRVQx-d82NPw","stars":4,"date":"2010-10-10","text":"Love this place. Sure it was way out of town for me. Sure I can't figure out a way to get there with public transit from Toronto... BUT it's worth the trip, however you get there.\n\nTo be honest, before we went there I thought it was just going to be danishes, which was actually exciting in and of itself, BUT it had a variety of other Danish baked goods (like marzipan cookies, and kransekake ) as well as vegan chocolate bars, chocolate soft serve, cookies, brownies and biscotti. And little grocery type items like fake tuna and non-dairy cheese.\n\nThe woman that runs the bakery is so sweet and friendly, I felt like I could talk to her all day about food and not get tired of it. Another great part about this place is that it's inside of a costume shop. Can't go wrong with that.","useful":3,"funny":0,"cool":2},
{"review_id":"myPaYLCqKBNe4xc-Wt30hw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"UKpmaMZU_sKevo9AlaMPkA","stars":3,"date":"2010-11-13","text":"I neglected to read the reviews on here regarding the Greyhound\/Toronto Coach Lines line, and stood in line (at 5am I might add, 5am does not make me a happy camper) for 15 minutes while a woman argued with the counter guy about something ridiculous. I don't envy these people their jobs, I can't imagine the crap they have to deal with.\n\nSo I came to the counter, talking about Greyhound, he told me (and it's probably been the millionth+1 time he's said this.) to go to the greyhound counter down in the waiting room and talk to the guy in the vest. Well, shucks. Who knew. \n\nThe waiting room was clean, my ticket situation was sorted out without any issue well before my bus arrived, so I really don't have any complaints.\n\nI really hate going through airport security, and for certain trips (like NYC for example) the rates on the greyhound are really reasonable (especially with advanced purchase), I usually don't have to sit with anyone AND most importantly (is she joking?), I can get wifi the entire way down.","useful":6,"funny":0,"cool":3},
{"review_id":"OEGEWMmywVHgVR3TuZYZ6A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yHCoJZh5nx0Onr5xgMaUHg","stars":3,"date":"2010-11-11","text":"I'd like to say I loved this place, because for the most part I did.\n\nThe veggie selection was beautiful, the store was bright and clean, but ultimately, all of that was ruined by my experience at the check out.\n\nI went through the self check out, you know, so I could avoid talking to cashiers and go through the process quickly? Instead the attendant would not leave me alone and it took twice as long.\n\nHe hovered and hassled me the entire time I was going through the check out, he yelled out the veggies at me that I was buying from his station, and it was really frustrating. It totally ruined the whole experience for me. \n\nIf I do go back, I'm not going to bother doing self check-out (and I don't recommend anyone else does either), not much point if someone is going to micromanage the entire process.\n\nI would have given this place a five, I wanted to give this place a two after I left, but it gets a begrudging three because it has such a nice selection and a clean bright location.","useful":4,"funny":3,"cool":2},
{"review_id":"drex7uO1HzcbS4iG6HZLBA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yxdmX8dXk5Se9zJ4WAW1pw","stars":5,"date":"2010-11-20","text":"First of all, this is probably the best Vegetarian restaurant I've been to in the Toronto area, and probably in my top ten of vegetarian restaurants I've been to in North America.\n\nI took a big burly omnivore with me, and he loved everything we ordered, so I take that as a great sign.\n\nWe started things off with an order of crispy oyster mushrooms and seared dumplings. I wish we had ordered two orders of the crispy oyster mushrooms because I can never have enough, they are so rich and flavourful and the sweet slightly spiced sauce is a perfect compliment for it.\n\nWe both ordered the Special of the Day, which was a tofu skin wrapped taro root mash on a bed of greens, with a side of noodles, and a flavour explosion of a mango salad. \n\nOur waitress totally sold it. Her description got my mouth watering from the very beginning. It adds so much to a meal when the server is friendly, and she was wonderful. Moreover, she clearly loved the place and the food, which is exactly the type of person I want advising me on what to order.\n\nI was feeling pretty full after finishing my plate, but there is always room for dessert. My dining companion and I shared a piece of chocolate cake and a brownie sundae (but since they were out of brownie, they used lightly warmed chocolate cookies.)  What can I say, other than delicious! delicious! delicious! \n\nThe chocolate cake was good, but not as good as the sundae. Though I'm glad our server made sure we took the left over chocolate cake home, because while it wasn't as awesome when it went head to head with the sundae, it was fantastic by itself at 3am.\n\nIn Short: \n- order the crispy mushrooms, you wont be disappointed. \n- And the Special; it's consistently amazing.","useful":11,"funny":3,"cool":9},
{"review_id":"dZ_a6D96J3Of26svfe8Cng","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"7cMnc_zSPenfSQa9_199CA","stars":5,"date":"2014-08-28","text":"I've been travelling a lot lately and in the time I was away having fun and eating lots of great food, Bloomers opened and I was really looking forward to coming home and visiting this (still) new vegan cafe and bakery in Bloorcourt.\n\nSo finally,I got to visit them today. \n\nFirst impressions are: I love the wide open space, that there are multiple options for seating (booths, tables, high tables, etc). They've got free wifi (I didn't look for power outlets this time). Service was really nice and friendly. And I felt pretty comfortable just hanging out with my coffee for a bit\n\nToday I saw a couple of different kinds of donuts, fluffy coconut donut holes, chocolate chip cookies, butter tarts, blueberry tarts, BAGELS, and a donut Bread pudding, and probably more, but I was especially drawn to the bagels, as I haven't seen bagels around any of the fine vegan bakeries we have in our city AND I happen to really like bagels (and usually end up making them myself). as an added bonus they had tofutti cream cheese available. \n\nThey've got a variety of kombuchas, teas, blue sky soda, and assorted bottled fruit juices, in addition to fancy (and more regular) coffee options. \n\nI hear there is a menu extension coming in September with sandwiches and the like coming soon, so I'm pretty excited to check that out too when it appears.\n\nI liked it here, I would (and will) be back again soon. \n\nAccessibility-wise: Today the door was wide open (otherwise it's not powered), but there is a bit of a quarter step to get in. And  in a wonderful departure from the usual Toronto bathroom in the basement style the restroom is on the main floor.\n\nAnd regarding one of the other reviews... it seems a little (no, it seems a lot) ridiculous to complain about the lack of dairy products at a vegan cafe.","useful":3,"funny":2,"cool":1},
{"review_id":"wXbXiBW2bY65Bvf-KRK-LA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"bfR-vJvrjdOJaWsXGJgzPA","stars":3,"date":"2012-02-08","text":"I come here about once every two weeks, mostly out of convenience, since it's near my workplace, has vegan options, and offers a decent alternative to subway\/sushi\/pizza options I have in the area.\n\nService is always friendly and helpful, reasonably quick, and they don't use a microwave to heat up your samosas - which some other Indian restaurants do in the area. Ew. \n\nI've had curry bowls from here in the past and like everyone has said, the curries are quite bland.  They are spiced but not really (especially if you've gotten used to more authentic little India flavours) and just generally have a \"healthy\" flavor to them. it's not terrible, but miss-able. \n\nI'd recommend the vegetable samosas instead (or get the spicy lentils as a veg dish for a closer to normal level of spice.) They do bake them - so they aren't deliciously deep fried, but still the filling is nice.\n\nThey've recently upped the price of the samosas, but 3 samosas and two chutneys will still only run you just under $5.","useful":2,"funny":0,"cool":1},
{"review_id":"5FEDLEk1iWRBljSlfdNeRQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"t_HhQtNpKvgQrSLvK0eUEA","stars":4,"date":"2013-02-15","text":"I like this place.  I need to go back on a Friday or Saturday night to see what it's really like, but I went a couple hours before closing on a Wednesday with Nicole H, and it was pretty comfortable with four tables occupied.\n\nI like the interior, it seems like a place I would actually go to just drink coffee or do some work, with the added benefit of having games available if I wanted to play them.\n\nThey have a great selection of games in the back, and various events happen every week, including a Scrabble meetup group (Scrabble in the City) every Thursday night.\n\nBeer and other alcohol selection appears ample, but since it was 3 pm on a Wednesday, I opted for tea. Prices for food and drinks are very reasonable, as of yet, there is no game playing fee.\n\nAs an extra bonus, service is friendly but also unintrusive.\n\nNo on-menu vegan food options or treats (yet), but they do make veg sandwiches with hummus, which is something.","useful":2,"funny":0,"cool":0},
{"review_id":"tlyTYvacw8ZAXiLLlx7bAg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"StjUke9uj6T6qB4hpyzMMA","stars":3,"date":"2010-11-22","text":"I thought I was finished with Fresh, but a friend from out of town came to visit, and wanted to come here for brunch. So... okay, back to Fresh.\n\nIt still didn't win me over.  But this visit was better than before.\n\nOur server was a bit weird, but ultimately helpful and friendly so that's all that matters. One of the other servers \"helping\" the table next to us was terrible and I'm glad we didn't have her. She seemed to be all attitude, and no help.\n\nBrunch was great. I got the pancake platter, which comes with two pancakes of your choice, two vegan breakfast sausages and tofu scramble (for 12$). I could have done without the over-spiced boring tofu scramble, but the pancakes (banana-nut flavoured) were excellent, especially when slathered with margarine and dark rich maple syrup. Tofu sausage was fantastic.\n\nI got an americano.  And while it wasn't a very big cup of coffee, or very caffeinated, it was very tasty.\n\nI also ordered a side of soy yogurt, but really, I wouldn't recommend it. Unless you get some jam. It's not flavoured with anything so when you order soy yogurt that's really all it is, and it's not very good. \n\nNext time (since there will probably always be a next time with this place): BBQ Burger. How can I go wrong with a veggie burger, that also includes a couple of those delicious quinoa onion rings?","useful":4,"funny":0,"cool":3},
{"review_id":"2opOL-2onXpeXxZZpTddPg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"Avh4vPVXkYPcHEbRs1ZdBQ","stars":4,"date":"2012-11-27","text":"We went to Bello Bio earlier this month to check out their selection of products. All the food items there are vegan, and imported from Italy. The imported part sounded a little strange, since I've never thought of Italy as a very veg friendly place, but we learned from the owner, that Italy has a growing vegan\/vegetarian population\n\nGreat selection of random products. They have grain based pseudo-meats, and a very interesting MozzaRisella sprouted rice based soft dairy free cheese, which made an excellent addition to a recent caprese salad. They have prepared foods, and frozen items available to take home (such as varieties of vegan stuffed ravioli.)\n\nThose folks are friendly, and the products have a lot to offer flavourwise. And I liked that they have products that are vegan\/plant-based, without depending entirely on soy.\n\nI'm looking forward to going back and picking up more stuff soon!","useful":3,"funny":0,"cool":2},
{"review_id":"c809aHZog6sooFr2_gw3ew","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"EYKDklUoHuZ4g4mjx9q0mA","stars":2,"date":"2010-12-07","text":"We ordered delivery from this location and it was okay. But not amazing. \n\nI think their queen street location is better, or maybe we hit them on the wrong day. The fredo pizza is normally covered with thinly sliced potato and a nice level of rosemary and other spices, this time around, it was rather sparse. \n\nConsidering they said an hour for delivery, and we were only 6 minutes away (if you walk), I would have expected they'd have enough time to actually cook the potatoes properly. I wish we had just picked it up, maybe it would have been better. \n\nThey have three vegan pizza's on the menu and an extensive combination of other types as well. So I'd start the Pizziolo experience at a different location if you want something especially good. \n\nThat said, my slightly undercooked potato pizza was still better flavour-wise than the Pizza Pizza in the neighbourhood.","useful":1,"funny":1,"cool":3},
{"review_id":"rcw7dhLyknJ9fOetaT_p7w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"6ALBeke4yZcCorqLMvpFoA","stars":2,"date":"2012-11-14","text":"Easy wasn't easy. I considered getting a smoothie and word on the street is their coffee is stellar. \n\nBut it was busy, and after about 10-15 minutes, with no coffee, we left before ordering.","useful":1,"funny":0,"cool":0},
{"review_id":"5earr_XVTtD6FiP1ph8qzw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"ho5ClDsYijmOJy9OSUx8UA","stars":5,"date":"2016-01-12","text":"I've watch D-Beatstro improved their offerings and options over the last few months and it's been great to see them grow from sort of disorganized but charming to really having a solid menu, kitchen, and coffee set up. They have a nice variety of baked goods, occasionally have gluten-free options too for those of you that need\/want them, and herbalist blended teas available. But my favourite thing now is their brunch, because it's good, really good.\n\nSeating is comfortable and well spaced out, so if you're tired of sharing elbow room with other folks during weekend brunches - this might be a great spot to check out. The restaurant and cafe is also wheelchair and\/or mobility device accessible with a ramp outside (they also have an accessible washroom.)\n\nThe folks here make a great soy latte, and why anyone would recommend going to a Starbucks or Tim Hortons over even a non-dairy latte, I don't understand, but Kevin S. you do you. They also have a variety of other fun drinks - like hot chocolate, white hot chocolate, matcha lattes, and other surprises in store for you.  They also \"only\" have soy, almond, coconut, and cashew. Oh no, too many options? Branch out a little.\n\nCheck em out for brunch or during the week.","useful":4,"funny":3,"cool":0},
{"review_id":"jcDEi86UzPtvyo-5X_y6aw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"cInYKKK7p9y1FokuKClNtw","stars":5,"date":"2010-12-13","text":"You know those times when you visit a cafe or store and leave with the desire to tell everyone you meet how wonderful it is? That's how I feel about this place.\n\nThey have a great warm inviting atmosphere, and it's a cozy (i.e., kind of a small space). While there is room for about three people to sit in the window area, prepare to either stand and eat, or take a box home (or eat there, AND take a box of treats home like I did...)\n\nThe people working there are friendly and helpful, and when I walked in, all wide-eyed and overwhelmed with options, they gave me a run down of what they had and offered some recommendations. Bunner's was just all around fantastic from the start. And then... I ate one of the \"gypsy\" cookies, and I was completely sold. Oats, melty chocolate chips, dried cranberries and a few other things combined into a soft chewy cookie. I want to go back, right now, and get another one.\n\nI should probably mention that in my experience gluten free tends to secretly mean gross, and I have been known to occasionally thank my body for not having celiac disease. So what I'm saying when I say this place is good, is that it's not just gluten-free good. It's actually good.\n\nWhen I went in today there were cupcakes (three different kinds: vanilla, chocolate and red velvet), DONUTS, amazingly yummy cookies (gypsy cookie), freshly baked loaves of bread (which I'm kicking myself for not trying), muffins, and cookie sandwiches!\n\nWhat I'm going to hope for is that every coffee shop in town starts using them as their source for vegan (and\/or gluten free) treats. While they have decent enough coffee (and Silk Soy creamer is available), I sure wouldn't mind having one of their cookies or muffins with a nice soy latte. (Of course... Crema Coffee is just across the street...)","useful":14,"funny":2,"cool":8},
{"review_id":"pvqpAzPNNIbb4ng24HRSFA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"8gPvDLHY6D7NjJxpikUc6Q","stars":5,"date":"2013-11-25","text":"Balluchon is now i deal coffee. It's basically the same place, but better.\n\nI love this place now, so my regular Monday Sorauren Farmers' Market visit is paired with a tasty cup of coffee from -i deal coffee- as well.\n\nService has been fantastic every time I've gone in. It feels like a space that's good to hang out in, they have vegan and\/or gluten-free options, and have soy and almond milk at no extra charge (YEY!)\n\nSo lovely. I can't wait to keep going back.\n\nAs an added bonus, since they only recently took over that location they are part of the Indie Coffee Passport less-than-3 Edition, so you can give them a try, while taking advantage of a really great deal.\n\nThey're currently cash only, but it sounded like they were planning on getting a debit machine at some point.","useful":1,"funny":1,"cool":1},
{"review_id":"i-h0c7yy4Qla0YsInKqg5A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"xB4NNFPFHYQIyGytHvObgQ","stars":5,"date":"2014-02-01","text":"You might have seen this vegan bakery win the Toronto Vegetarian Association's Vegan Bake Off (repeatedly), and you've might have seen it at the Vegetarian Food Festival, or at the Farmers Market or a bunch of other places around the city (and Ontario).\n\nNow, you'll see it in a sweet location in the Annex.\n\nFull disclosure: I've been excited about this bakery opening for months, and I don't care who knows it. I have wanted a source for a steady supply of vegan magic squares, and now I have one (p.s. get the magic squares)\n\nI had the opportunity to visit the bakery during the sneak-peak opening in December, and bought magic squares (but not enough), a cookie, and a couple of candied apples and it felt like early Xmas.\n\nThen I waited (im)patiently for their opening this month. And today I braved the snow and went in. I left with dark chocolate croissants, magic squares (obviously), and a pot pie. My partner came home with croissants, a couple of sausage rolls and a whoopie pie. Yes, we're getting ready to hibernate this weekend.\n\nThe croissants are ridiculously flaky, the magic squares are incredible as usual, I haven't eaten anything else yet, but I've sort of come to expect that anything from APiecalypse Now! will be really good.\n\nIn the fridge & freezer so far they've got (all of these things are vegan): cashew ricotta, Caesar salad dressing, flavoured butters, lasagna, pot pies, shepherd pie, gluten free and gluten-full chili mac, potato salad, tzatziki, tartar sauce, Northwood Cold Brew Coffee (which I'm drinking right now - tasty), and more.\n\nI like that there appears to be a sincere effort made to find ethical, ecologically sound, and human friendly products to make & bake stuff, and that they have compostable packaging.\n\nService was friendly and fast & they take cash, credit, and debit.\n\nThere is no seating inside, so prepare to take out.\n\nP.S. try the magic squares.","useful":6,"funny":3,"cool":3},
{"review_id":"WLXHkQSKTQoGa18auekSPw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"c4sRmOkb3W3KgCkEffI6tA","stars":4,"date":"2011-01-06","text":"This place is huge, but lacks seating. I spent a considerable amount of time visualizing how they could fit more tables in without getting to crowded, and I can see why they set it up the way they did. But a couple more tables wouldn't hurt. (but that's what everyone says).\n\nI love the space. Floor to ceiling windows facing Queen St and the rest is brick. High ceilings, ample bookshelves and the random old stove in the center... it just works.\n\nI ordered a soy latte, and it was delicious, not too bitter, not too boring. Foam was nice and thick (but not too much) Just right. Unfortunately, they don't seem to have any \"to stay\" cups. But on the plus side, they've got free wifi and they don't charge extra for soy milk.\n\nOne thing I find really cool about Ground Level is that it operates as part of Ground Level Youth Ventures where youth learn life skills and job training (beyond just making coffee). Definitely something I'm into supporting.\n\nI went here solely because it was part of the Indie Coffee Passport, but I'll go there again if I'm in the neighbourhood. My latte was better than the cups I've gotten from other shops in the area.","useful":2,"funny":0,"cool":2},
{"review_id":"0ZdxpYp6_SMsJ4ZU7Y-hJA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"ILq2TVP7mEJ1E-VoAt1_vw","stars":4,"date":"2012-06-02","text":"Feel Good Guru is in the progress of slowly opening.  It's a take-out place right across the street from Trinity-Bellwoods Park, and conveniently located in my neighbourhood. I walked in not caring what I ordered, I wanted to try... anything. \n\nI ordered the soup, which was a hearty miso based vegetable lentil, with lots of greens and packed with flavour. Perfect for today's rainy glumness.\n\nThe space is really clean and relaxing, there is seating for about 4 people, but like I said, it's styled as a take-out place (so you know, you could hypothetically take stuff out, and eat in the park.) There are fresh herbs in a wall-mounted garden (that look absolutely lovely). They also have a useful website that actually gives you the information \n\nI've come to expect raw cakes to be delicious, and Feel Good Guru's cake was no exception. In fact... it was even better than I expected it to be (and the raw bar is raised pretty high already.)  She gave me a sample for free, and I want more of that chocolate heaven in my mouth. Luckily they are right down the street, so I could wander over any time I want. Lucky me.","useful":13,"funny":3,"cool":5},
{"review_id":"csA_guqbDHdTHVqH3J9KAA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"g71DJrR0nX3tL2WBoeSYSA","stars":2,"date":"2012-01-10","text":"Meh. I'd feel okay just leaving the review at that. This place embodies meh, I've had better. \n\nI walk by every day on the way to work, so I thought... maybe this will be my alternative to Starbucks or (on days when I feel like being treated rudely) Tim Hortons. Nope.  The coffee tasted burnt, in a bad way. And soy milk is 0.70 cents extra (I hate that.)\n\nI was oversold on the 20$ gift card. I like going out for coffee because it's relaxing - I didn't expect to have to say \"no not interested\" to some pseudo promotion (gift card - meh) repeatedly.\n\nWith the exception of the sales pitch,  service in general was quite friendly though. But not friendly enough that I would go back again.","useful":2,"funny":0,"cool":0},
{"review_id":"QBtZUwzwWdR7iESmgwJZaA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"7eSbvHOOpRmEwywDOclevQ","stars":4,"date":"2010-12-07","text":"This location was my first foray into the Pizzaiolo chain since moving to Toronto.\n\nWe went to this location at 3am on a Saturday night and asked for half a fredo (with potatoes, rosemary and oregano)  and half a vittoria (tomatos, zucchini, red peppers). They didn't even blink, no problem, done. When we got it, it was packed with toppings, hot and delicious. Everything seemed cooked to perfection. \n\nAfterwards service was a bit off, I tried to buy a drink, and stood at the counter, drink in hand while the server talked on the phone... for about five minutes. Then I put the drink back in the fridge and sat down to finish my pizza. \n\nOn the plus side, the variety of pizza they offer is nice, they have vegan and vegetarian pizza available by the slice (amongst others), and they are open super late.","useful":4,"funny":1,"cool":3},
{"review_id":"hVjdPSU7sPDXR6vsWgOU-g","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"lHYiCS-y8AFjUitv6MGpxg","stars":3,"date":"2011-07-08","text":"It's a Starbucks, with the same problems and benefits that every Starbucks has. The coffee is the same as every other starbucks, and they never seem to use separate containers for soy and dairy frappuccinos but they are quick, there is lots of seating, and a good collection of power outlets at this location (you just have to find them)\n\nOverall, it's always clean, some of the staff are reasonably friendly.","useful":3,"funny":0,"cool":1},
{"review_id":"DXsd-_QA4wmgA8IZ36EgXg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"50LSp1WnwMA3PMXXvXDj0Q","stars":3,"date":"2011-03-07","text":"No more trudging downtown to get a oily slice of potato rosemary (The Fredo) pizza for me, finally, a new Pizzaiolo up north and in my neighbourhood.\n\nThis location is clean, and at 4pm, completely empty except for the reasonably friendly dudes working there. They had a special deal going on for a free beverage with purchase for their grand opening (which is now over) but honored my request anyway. Free soda is always a plus. \n\nPizza was decent. One half of the GIANT slice was perfect, the other half was more than half of my daily requirement of olive oil. Crispy tasty crust, maybe verging on too crispy, but it was still within tolerance levels. Also, I'm happy that they actually had a vegan pizza available, which is more than I can say for half of the downtown locations I've been to after 7pm. \n\nI'd come here again and I hope business picks up because that area has been lacking in quick tasty (vegan or otherwise) food options.","useful":7,"funny":0,"cool":3},
{"review_id":"TWz4-EKzizpfzFxUYai44A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"zSpQmEBvRe3IhTUlMSA6HQ","stars":5,"date":"2012-11-14","text":"I've been going to Totum for almost a year now I think, and it's been great for seriously getting into weight lifting without having to navigate through clusters of bros and other gym jerks. Everyone is generally nice, respectful of space, and you know, no one is ever doing bicep curls in the squat rack.\n\nI still haven't convinced myself to go on a repeat visit to any of the 6am classes, but they exist for those pre-work workout fiends. I'm just too much of a night owl. I'm also lazy.\n\nClasses to chose from include yoga classes, Pilates, boxing, kettle bell workouts, spinning, crossfit, and a whole bunch of others. Lots of elliptical machines, 5-6 treadmills, and bikes. They also have a decent variety of weight machines, free weights, and other equipment to play with.\n\nThere is one personal trainer that without fail will change the music station from some amazing techno\/dub\/remix (you know, perfect workout music) to some weird classic rock\/easy listening\/crud, so word of advice - bring some headphones if you're going in the middle of the day. The weekend hours are not as convenient (they close at 6ish), but I do like that they're open later than most gyms on Fridays.\n\nOne other thing I like is that they have other sport related services available on site. In addition to personal trainers, there are chiropractors, RMTs, a holistic nutritionist, and an ND. It's nice to have the option of just going in, working out, seeing an RMT, or someone else, and going home.\n\nIt's clean, friendly, and welcoming. There is a free week trial, and I'd totally recommend you try it out. But only if you're awesome.\n\nWorst\/best thing - it's right next to Soma Chocolate.","useful":7,"funny":4,"cool":4},
{"review_id":"0JMRNpqIu1emDdydUmzXAw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"iZJ5pdY558VodrEumGyVug","stars":4,"date":"2010-10-11","text":"I went to Nazareth yesterday and we lucked out because it was nearly empty inside (however it filled up within 30 minutes of our arrival and then there was a bit of a line.)\n\nThe service was fast and friendly, but there was a bit of a wait to get our actual plate, but it wasn't uncomfortably long. Our server checked on us regularly and was very pleasant.\n\nWe ordered one order of the vegetarian combination plate, and between the two of us, we still didn't finish all of it.\n\nOver all it was a great experience, we got there at just the right time and the bill was ridiculously cheap.","useful":4,"funny":0,"cool":2},
{"review_id":"qf2E2SdZfBzPey8n4qxW5Q","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"DuPG4FgnUi1IQghyhLVplA","stars":3,"date":"2010-10-09","text":"Upon walking in I was delighted to see that they brew a very familiar coffee, Stumptown Coffee (the coffee found in nearly every coffee shop everywhere in Portland, Oregon... aka Stumptown.) The nostalgia was short lived, I think I prefer the Intelligencia coffee I've had nearly everywhere else in the city.\n\nMy barista was friendly, and helped me out right away, so that part was nice. \n\nThey charge extra for soy milk, and in doing so, became the most expensive latte I've had in Toronto (however, I should also mention, the portion is comparatively bigger than other places so I'm not exactly complaining about that part.)\n\nLit has WiFi! Lots of seating, and a nice interior.","useful":3,"funny":0,"cool":2},
{"review_id":"jU4FaU01qNMLOwlQB8Ta0A","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"w4SY_FlZnIfAb8UjDABPsQ","stars":4,"date":"2010-10-18","text":"I like this place, I guess that's why I keep coming back. The seats are comfortable, I like that I can lean back, and the temperature has always been decent (unlike some places). The location can't be beat (easy access from Dundas Subway).\n\nI know some people aren't into the \"butter flavoured topping\" that AMC has going on, but I love that it's available. Not that it's in anyway good for you (mmm soybean oil...), just that all signs point to its veganness, which works for me.\n\nAs with every movie theater, they will gouge you at the concession, and make you wish you had the foresight to sneak in your own snacks.","useful":4,"funny":0,"cool":3},
{"review_id":"H6TibVavE0ybsX9mp1zsIA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"xbmxzInleHymSlaERwhMng","stars":3,"date":"2010-12-10","text":"I didn't mean to go to Freshii for lunch the other day, but events conspired in such a way that I was in the neighbourhood (hoping to buy a Indie Coffee Pass from Crema Coffee - but they were sold out) and the line was short (because their debit was down) and my stomach decided it was time to eat.\n\nAfter looking at the menu board, I filled out the custom order form (and there were LOTS of options to choose from.) s  and handed it to the nice server informing everyone that the debit machine wasn't working. (right at noon time! what terrible timing!)\n\nI got the spinach wrap, grilled and filled with veggies, with balsamic vinegar and olive oil. Can't go wrong with that combo. It was warm and fast. Even though there wasn't much reason to (nothing to melt, nothing needed to be cooked) I'm glad I got it grilled. It seemed to help keep the wrap together as I was running down Bloor.\n\nIf you don't feel like making up a meal for yourself they also have a huge selection of \"Chef Creations\" (at least one of which is vegan)  that you can modify further if you feel like it (for an extra charge).\n\nThe other benefit to this location is that Crema Coffee is right inside, so you can get a wrap, salad, bowl, or whatever AND get a delicious cup of coffee too. And by the way, Crema has one of the best soy latte's I've had in the city... though maybe I should save that for a Crema review...\n\nJust a note, I can never get the freshii wifi to work with my iPod Touch, but I can connect to it with my netbook. Maybe it's me, but I'm just going to blame them on this one.","useful":1,"funny":0,"cool":2},
{"review_id":"2gKy-30ang9kLxVP-6QQLw","user_id":"qr4FJMmbHEsfEtbWMAcduw","business_id":"0sX-jsw2gcFVqdzGlqU_kA","stars":5,"date":"2011-09-05","text":"I love Shauna's!  The prices are great, Shauna is really nice and my dog has a good time playing there. Shauna is very knowledgeable and you can tell that she loves animals. If I had even the slightest notion that my dog wasn't being cared for, I wouldn't go there. It's too bad someone had a negative experience, but I've been here many times and have always seen the dogs in their care happy. I have sent many friends to Shauna's and am glad that she's so close by. I highly recommend!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"vFY4ynm9LlfvzTGyCLzYZg","user_id":"qr4FJMmbHEsfEtbWMAcduw","business_id":"EGktLFv2xf0x0Zi3UApdig","stars":4,"date":"2014-10-18","text":"I've been going here every other week for a mani pedi for several months now.  I like the staff. They are professional and friendly. I feel comfortable there.  I like the massage chairs and the fish tank, both help me relax.  I'm a stickler for cleanliness and their tools are always sterile (autoclaved) and they use liners in their foot baths.  The service is very consistant from tech to tech, so I don't feel the need to be choosy about who does my nails.  They give a lengthier massage than most places, but I find the massages lack-luster.  That's really my only suggestion for improvement. Better massage technique.  My gel polish lasts a full two weeks and so does my pedicure (not gel).  I really like this place and will continue to treat myself to a trip to Dream Nails every other week!","useful":0,"funny":0,"cool":1},
{"review_id":"i54ap1U43zlwQHavj9g6Hw","user_id":"qr4FJMmbHEsfEtbWMAcduw","business_id":"1_WfF9pNoNeWe233CeqE1Q","stars":4,"date":"2014-10-18","text":"We have visited many many times over the years.  I love the salsa.  The food is excellent and fresh.  I wish they would give out a larger bowl for the salsa since the small cups available are not easy to dip a chip in, however this is a small complaint.  The only other negative is the \"ambience,\" which is lacking. Not the most comfortable chairs.  Everything I've tried has been excellent.  The staff is friendly.  Love it!  We will continue to be regulars.","useful":0,"funny":0,"cool":0},
{"review_id":"FHJdD6hLQWAgZHPwlPGc5Q","user_id":"qr4FJMmbHEsfEtbWMAcduw","business_id":"QORQnn9U6QHac09XX-nAKg","stars":5,"date":"2011-09-05","text":"I love Heidi's!!!  I go here often and always receive friendly service and delicious food.  My husband and kids love it too.  As many before me have said, the bread is fantastic. We buy loaves when we are there so we can enjoy it at home. I've tried the eggplant parm sandwich, egg salad, veggie, grilled veggie and a few others and all have been excellent!  I'm a vegetarian, so it's nice to have lots of choices here.  My husband has had roast beef, Italian, pastrami and other subs and has always been happy.  I send friends and family here. Everyone has been happy.  I highly recommend Heidi's!","useful":1,"funny":0,"cool":0},
{"review_id":"J2IFDV3oKJpTAXpW5x_PWw","user_id":"0XKTRsa8Y1A3RHJB5LhuUg","business_id":"NzWpIwYwGsjujewhYjPPPg","stars":1,"date":"2017-12-02","text":"I came in to get some boba tea and there was a employee eating behind counter that wasn't professional. The cashier seem rude and unhelpful.","useful":0,"funny":0,"cool":0},
{"review_id":"GhwOhdHTy-HSeRqUiqO1gw","user_id":"nsrRDfgo4yMnb5EJEOlRjw","business_id":"byJTWhe5nmTYUxYfBSJ8Sg","stars":5,"date":"2015-03-24","text":"Yesterday I had my new patient appointment with Dr. Adams. Immediately upon arriving I was happily greeted by 3 women at a side desk. They immediately informed me that the ambulance had just left and Dr Adams was a few minutes behind. This was fine with me. There were 4 patients waiting and the office was comfortable and clean. They made sure all waiting patients knew of the situation and one by one called them back. About 45 minutes later, happily to my suprise, I was already called back!  Yolanda took my weight and BP  - she was professional and kind. She did my initial intake and we had a nice laugh as well. Dr Adams was in the room in about 5 minutes! Now where do I start. Dr Adams is very professional and thorough. She was interested in my home life and even what I was reading in the office! We discussed many options of treatment for my 3 reasons of being in the office. She gave me immediate referrals and advice that I felt was not only professional but thoughtful in her answers. She even called for my bloodwork and labs right there in the office instead of sending me on a goose chase to a random lab. She related to me and understood my past with what I felt very comfortable sharing with her. I have searched for a doctor in NV for 10 yrs. I am so pleased that I actually look forward to going back to see Dr K. Adams. You are truly one of a kind Dr. Adams! God bless you!","useful":1,"funny":0,"cool":0},
{"review_id":"LC27nzrJ6jBKDdm9C7l_pQ","user_id":"nsrRDfgo4yMnb5EJEOlRjw","business_id":"edFOP4OKtRTrBtSEtwLNuQ","stars":1,"date":"2015-03-24","text":"Today my best friend and I went to serenity nails at 1pm. They sat us down immediately. The entire place stunk of someone's lunch. They began to fill the pedicure tubs and when we asked for it to be warmer one woman began scooping the water out (while on her cell phone and chewing with her mouth open) we sat with the running water and nobody to turn it off for 8 minutes until it began to overflow. In which we recorded this embarresment of a \"salon\" proceeded to put on our shoes and leave. The blue pedicure water covered half of the back salon and at one point another man doing a manicure stood up, observed the mess all over the flow and sat back down to the manicure lol! If I could stand on the corner directing people just a block down to Dream nails I would pay them not to step foot in this facility. What a joke!","useful":0,"funny":0,"cool":0},
{"review_id":"KR7aBnvDZZcVztymr89eBQ","user_id":"Xv1ugZIyou8tslXkOm-TjQ","business_id":"PBEUEK39haiJhQzuW4tnYQ","stars":1,"date":"2012-02-20","text":"Went for a special occasion and let them know in advance, asked for a nice table, we were put in a corner in a cold area was so cold my shoulders hurt and feet were like ice, when I asked to move they were reluctant even though the place was far from full, they did move us however next to a drafty door. The waiter comes out overly friendly, with phoney smile as others on the staff. The truffel soup was like a bowl of salt water.  The Pasta dish was cheap dumplings with frozen peas and 2 mexican shrimps chopped up so small and yes a lot of salt. The Salmon  was bland but the mashed cauliflower under it was salty and not cooked all the way, the broclii was burned, we left half of our meals on our plates and no one asked why? The service was horrible we constantly had to ask the bus person to find us the waiter. Way Way overpriced and an added 18% service charge for poor service. They never said, thanks good bye or come again. I read so much good about The Farms that I really wanted to go, but it is a Never Again, does not deserve a 2nd chance, $180.00 for 2 and did not eat and 2 beverages. Also my stomach was very uncomforatable from so much salt,  I felt very nausiated.","useful":2,"funny":0,"cool":0},
{"review_id":"YKAOjFO7NDuDO1grovq-Mw","user_id":"SZHWhyG7WxJZdGp6fBVlRg","business_id":"oWHZtv98YyKvSennjtBuAA","stars":5,"date":"2017-12-05","text":"This little coffee shop offers a great spot to meet up, have an office gathering or just sit and people watch. I felt the coffee was a bit high priced but I enjoyed the atmosphere, so it was worth it.","useful":2,"funny":0,"cool":2},
{"review_id":"2Drc2lEdflD0jRUHF-LTsg","user_id":"SZHWhyG7WxJZdGp6fBVlRg","business_id":"cX2Nr_XmGYlMaBW35M0sUg","stars":5,"date":"2017-12-05","text":"This place was amazing!! It was the last restaurant my husband and I visited during our get-away. We were shocked at the quality of food for the price. Cool atmosphere and lots of quality beers to choose from. We had the brisket, hog belly, beans and the JW potatoes (I believe that's what they were called) Everything was amazing! Definitely try it out if you're in the area!","useful":0,"funny":0,"cool":1},
{"review_id":"TSqSiHfqtBigBa6ia59K7w","user_id":"SZHWhyG7WxJZdGp6fBVlRg","business_id":"VH2BjFjc9usDquDgoHhptA","stars":5,"date":"2017-12-05","text":"Amazing tacos! A must try if you're in the area. Quaint place with great service! We visited before a Cav's game! Awesome location.","useful":0,"funny":0,"cool":0},
{"review_id":"OtM6s1Y9V1EbpLp0BZnV7A","user_id":"SZHWhyG7WxJZdGp6fBVlRg","business_id":"JlkHGjgS3MJ5FqEDJdu8xQ","stars":5,"date":"2015-03-05","text":"I had a wonderful lunch with my mother at this Bravo location. Our waitress was amazing and catered to our every need. Excellent!!","useful":0,"funny":0,"cool":0},
{"review_id":"-Qm4vKgV3yJUc-YQejgosw","user_id":"a6iKZMwl-g-5d7XIXWXf7g","business_id":"jWv5GUtEp30OD5L5C8c2DQ","stars":5,"date":"2014-11-14","text":"Great service.  You feel like family as soon as you hit the door. Food was great, with a very big selection for breakfast. Owned by a Greek boy from Michigan. We will definitely be back","useful":0,"funny":0,"cool":0},
{"review_id":"mFPOlzjmRbVWHh4E5SL-Dw","user_id":"JL_O2728AX8Cf_or-_H4Rw","business_id":"trpn1eVgQdR1iWG6uLZrQg","stars":5,"date":"2012-09-15","text":"I can't say enough good about this place. Oysters are always fresh and they\nbring in daily from both coasts. Go on a Monday and you'll get the two for\none deal; that's 2 dozen for $30...wow!!!\nAs a seafood lover it has become my favorite haunt for a great meal.\nMy daughter (teenager ) loves their lobster poutine and I am in love\nwith their blue crab claw butter lettuce salade with homemade butter milk dressing.","useful":1,"funny":0,"cool":0},
{"review_id":"3BbEBQ781rVmOBDNsBrmXA","user_id":"FqadOtKcSifogynIt2rz0A","business_id":"Ws2l3kBWPzqaLdQVtZxIZg","stars":5,"date":"2016-02-22","text":"My husband and I hired Up N Smoke for our wedding reception. They had catered my husbands work and before he even proposed he said that we should have Up N Smoke cater our wedding when that time came. SO when we were planning I made sure to hire them. I personally never tried it but I trusted my husbands tastes buds and I couldn't have been happier that we went with them. Rich was so fast to respond and to answer my questions. He was even willing to work with us around the timing of our ceremony and setting up the buffet, so we wouldn't be hearing clinging and clattering while we were saying our vows. Once everyone was served, Rich and his crew put all the left overs in tin pans and had everything cleaned up in a blink of an eye! All night I was hearing about how good the food was from all our guest, and I myself have been loving having the left overs to eat and enjoy for the last few days! I almost want to find another event soon to have to order different food from them so I can try out their whole menu!!! If you want great BBQ food, and have an amazing costumer service experience go with Rich and Up N Smoke!!","useful":0,"funny":0,"cool":0},
{"review_id":"kJh7M7OjcRIKQriUgbEObg","user_id":"FqadOtKcSifogynIt2rz0A","business_id":"vMA3kcFztz9YpvGoJVnrcg","stars":5,"date":"2016-02-22","text":"My wedding was just at Villa Tuscana this past weekend. I honestly couldn't say a bad thing about these wonderful people!! I was in a few times from when we booked them in July, and they were always so willing to sit down and talk to me about my worries and my questions. In the end the hall was decorated even better then I thought. They were so willing to help me and I had a lot of last minute minor changes and they were there helping me set up the room the way I wanted it to be!!!  I also love that the base price includes SO much. Most places that I was going to to have chair decorations it was going to be an extra charge. To do this centerpiece was going to be an extra charge. Villa Tuscana does have a deluxe package but the base package includes so much that if you can't afford the deluxe items you still can have a wide selection of choices! Also there are some great things that come with the package, the DJ is included, the cake is included, and the photographer is included.  I highly recommend taking a look at Villa Tuscana for any kind of big event that you need plan!","useful":0,"funny":0,"cool":0},
{"review_id":"cSwPtcCDmQC4ZrHYoqvT-w","user_id":"tthv-AuwFsWogju1KRB0VA","business_id":"9TcC6WvSqrcCQWqKgF_sNg","stars":5,"date":"2017-07-16","text":"Great customer service! They go above and beyond with making you feel comfortable and giving you the hairstyle you ask for! Andrew did an awesome job on my husband and Mariana did an amazing job with my hair! Carlos the owner, is really sweet and makes you feel at home! Hard to trust anyone especially coming from a different state not knowing where to go! Definitely will be back!","useful":0,"funny":0,"cool":0},
{"review_id":"mPvmam5MsplMCm80pGTgCQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"M30I1NPl5JuHthxo1IXPGg","stars":4,"date":"2011-04-09","text":"I came here with expectations after reading some reviews here. I have to say the service was not as bad as I thought it would be. It is your average Asian resto service. Distant and quick. I got the pho with just the noodles and it was better than Pho Kim Long's! They do not give you a lot of mint and sprouts like Pho Kim Long but I am sure if you ask for more they will give you more. The large was not that big but it was enough for me. They have bigger bowls at Pho Kim Long. Over all I say its not bad. I will come back here just because the Pho was great. Service could be better but hey no one said you have to be happy at work. As long as they do their job right, you do not have to be my BFF.","useful":0,"funny":0,"cool":0},
{"review_id":"pqM3_nzX0YLhafZpuxKDwg","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"dZB5VuI4mCVRz8qQUwUgCg","stars":2,"date":"2012-07-29","text":"Service is bad, very slow. Food is meh. I do not recommend this place. I don't know how they stay open. Will not go back there unless there is no other option.","useful":0,"funny":0,"cool":0},
{"review_id":"jXmPNRumlqdvtWbdlnfeSQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"GMrwDXRlAZU2zj5nH6l4vQ","stars":1,"date":"2011-11-02","text":"Ok, the pho was not bad tasting at all. It was actually ok however 2 hours after I ate it I experienced dizziness and got nauseated and ill! I threw up all the food that I ate from that place. I do not now what that happened but it happened to me. The food was not bad and the waiter barely understood English. I cannot recommend this place after it made me so ill. I do not wish it on anyone. Be warned.","useful":0,"funny":0,"cool":0},
{"review_id":"eQeP51DR5P2as61W349p7w","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"fknU3sWplCBn26b6HwJ1kQ","stars":1,"date":"2014-11-08","text":"Service is slow! Don't bother coming here if you want to be fed. A couple of people were waiting and no one came to even get our drink order. It's not a big place so I don't know what the problem was. Really sad as I was looking forward to eating there.","useful":1,"funny":0,"cool":0},
{"review_id":"3UkxlpG5PMlbgGtCp7W3PQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"CoGcHxwZNwG3gdMJey_UXQ","stars":5,"date":"2011-09-03","text":"I made an appointment in the morning to see Leah in the afternoon and she was able to see me right away. It was my first time at this salon and she was great! She was very good at was she does. We talked about what kind of cut I wanted and she listened and made some suggestions. I like that she was not overly chatty and she just did what she had to do which was to cut my hair. Leah did not act like she was my bff and I like that. I did not come there to chat but to get a good haircut. \nLeah is skilled and knows how to cut coarse asian hair. She cut my hair just like the way I wanted it and she was so nice. The cut was for $30 which was reasonable and there was no push to sell you any shampoo or hair products which I really like. I dont like to be put on the spot after a haircut to buy hair products that I do not need.\nI highly recommend Leah to anyone. I am so glad to have found a great hairdresser that can cut my hair the way I want it!","useful":0,"funny":0,"cool":0},
{"review_id":"fZ2QN4W4d-iS97L0cc_mSQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"e9UsRb-fmza5ukU8Ftduew","stars":4,"date":"2013-08-25","text":"Great place! Great customer service. I checked into Yelp and got 20% off my tab. The sushi was ok, I have had better. Lots of dessert options. The food was ok. They had oysters for lunch! The place is clean and huge. I would come back here when I visit again. Recommend it anytime!","useful":0,"funny":0,"cool":0},
{"review_id":"8KmvTNOtspezwCjwWOa2Yg","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"sEjy65M87W8dLka1YD_-JQ","stars":3,"date":"2011-06-27","text":"So we went here and we had fun. We did the $20 for 1 hour and ride all the rides you want. They had about 5 to 6 rides for kids and 2 rides for adults. Its ok. It is one of those places that you go once and then thats it. he mini carts were fun but I would not do it again. I dont know why. Maybe its the smell of the fumes coming from the carts or maybe it just did not do it for me. Even our 8 yo was just ok with it. I guess it depends on how much you like mini cart rides.","useful":0,"funny":0,"cool":0},
{"review_id":"CFhTaVjg6i08YpoNxhpPaQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"88trG6dzvbgjVPEUzwTu8A","stars":4,"date":"2011-04-06","text":"Our son loves it here! For $7 the whole family can get a great workout. The bouncers can benefit on getting some repairs but not too bad, they work. Fun, fun place! Closed for parties on the weekend and open Tue-Fri 930-1230 and 2-5pm. Call first to check the hours. Worth the trip if you want to have fun and get a work out. Dont forget socks for everyone. They are mandatory!","useful":0,"funny":0,"cool":0},
{"review_id":"3aDw9UsthVsihMncIegNcA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"jK4uhkUu4hDbbHJyvkBvGA","stars":4,"date":"2016-12-09","text":"Ivy is great!  The place is clean and the techs are courteous.  The only draw back is the smell of nail salon, I dont know if it is the acetone but it is strong.  An exhaust fan or opening a door will help but with the cool air outside it might not a good idea.  Overall it was not a bad experience.","useful":0,"funny":0,"cool":0},
{"review_id":"NQbH-t9-6jVkmXf15ORlbA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"SecrRuLWCQZW5hdSgJyQPw","stars":5,"date":"2014-01-09","text":"Dr Lefever is a different type of chiropractor . No cracking, no pain or popping but effective adjustment . I highly recommend him if you are looking for a chiropractor. He is so nice, thorough and effective. His new office is located on Cheyenne and 215.","useful":5,"funny":0,"cool":1},
{"review_id":"JPjkNAg0drQoABMCQPoTnQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"n2yMw2PkNe99x464j6xQDQ","stars":1,"date":"2013-08-25","text":"I booked this hotel in a rush and my bad as I did not read the $18\/night resort fee. Basically I paid $66\/night to stay in this hotel. I would not have minded that if the hotel was just honest about it. I think that it was very sneaky for them to practice such a thing.\n\nThe resort is huge. It's like an apartment complex and since we arrived late at night the grounds were so dark it was tough to find your duplex like room. It was nice that we were connected only to another room. The grounds were clean and quiet. The bed was soft and comfy. The AC was cold and loud. It had room for 2 people and a kid. The furniture was old and the the tv in the living room and bedroom was ancient. I did not even try and use it. The in room safe actually uses a key..lol (not code).\n\nThe room has old stained carpet and the ceilings have beams. The bathroom was old and small. On our first night we actually had no hot water in our room. We showered in lukewarm water. I called the front desk to report it and the lady acted like I was bothering her. The next day at 830 am, thank God we were already awake, with our DND sign on the door we get the maintenance people at our door minimizing our no hot water complain. I insisted they check and surprise, surprise it was broken! I demanded to be moved to another room.\n\nThe man on the phone who moved us was probably the only normal person there. He was appropriate  and helpful.  The rest of the staff in this facility have no customer service skills. They just don't care.\n\nThey also put a $100 hold on your CC when you check in. I am waiting for them to remove that on my CC or I will definitely dispute it.\n\nI would not recommend anyone to stay here. Except for the soft bed and extra pillows there is nothing here to write home about. There are a lot of other places in Scottsdale that will appreciate your business and you can get more for your money. Stay away!","useful":5,"funny":0,"cool":0},
{"review_id":"JGMi5MkPwL3G1xYDw9vgjw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"HfuIfYB_CxMAAJiEnxDl9w","stars":3,"date":"2012-07-29","text":"Sushi was ok, nothing extraordinary. LIke most sushi places in LV they are owned by Korean folks, not Japanese. If you know your sushi you know it is not the same. It is ok if you want sushi on the go. Go to Raku for authentic sushi, the real Japanese style. Pricey but worth it! Make reservations ahead of time at Raku.","useful":0,"funny":0,"cool":0},
{"review_id":"7ZjF6FEOYjRkGM3fWfnihQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"SObOX1l8bkueylpptJOdmg","stars":4,"date":"2012-07-29","text":"$45 minus tip for 80 minutes massage! You cannot beat this price and the comfort! The therapist are graduate massage therapist waiting to take their exams. You can ask for a more experienced student when you make your appointment. CASH only place so bring your cash! It is a secret not too many people know so pass it along. The rooms are nice, big and quiet. It's like going to Massage Envy minus the high price. Check it out! Located by Regal Square above Patty's Closet.","useful":0,"funny":0,"cool":1},
{"review_id":"JSQY3UA-1lyJY2eGhd9JQw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"ccGIAOl08zHt2lcn_UxPfw","stars":5,"date":"2013-12-28","text":"Great gym and  classes, equipment ! Biggest gym of all the LVAC. Bigger than 24 hour fitness .","useful":3,"funny":0,"cool":0},
{"review_id":"Y-5R3PwdHRP51_C8hYywlw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"M25ITUcRPX02_KmAU5DZDQ","stars":5,"date":"2011-05-27","text":"Its amazing how nice this library is. Its new, it has vending machines and a lounge for you to relax in. I cannot get over the self service library check out and the electronic book return bin. Its so high tech! And they let you borrow up to 50 items! There is no place like LV!","useful":1,"funny":0,"cool":0},
{"review_id":"A8s89uUoUVbTwDwhJ7yH0Q","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":4,"date":"2011-06-27","text":"I do like the Bellagio buffet. Its a toss up between Mandalay Bay and Bellagio. French food is what they say this place is about. Although I do not eat any kind of seafood I have to say they have the best selection of crab. They had the Alaskan King crab and the snow crab in buckets! This place is like crab heaven if you like crab. They have melted butter that you can scoop up to your hearts content and they have champagne in a glass now not in those cheapy plastic containers they do in other casinos. I like the salad selection and of course the choices in bread. I do not eat bread although I love bread because of the high carb content but enough about that. The bread had to be tried! It was delicious, and they had real butter on the side. Soft butter, not the frozen kind. The butter was at room temperature so it was easy to spread it on your bread. Yum! \n\nAlright downside to this place is you have to be ready to wait. It felt like a line at Disneyland to get into one of those rides! The line was long! We waited 75 minutes to be seated and we stayed for 2 hours inside. Prepare to wait folks. It is worth the wait but do not come here starving hungry because you will wait and you will end up grouchy and impatient by the time you get to the cashier. Eat enough for about an hour wait and then be ready to feast! Happy eating1","useful":0,"funny":0,"cool":0},
{"review_id":"LrylCL8k3Ab7UdTwINgQSw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"ostVuyoxxQiP3Qik_L7nPA","stars":4,"date":"2013-12-20","text":"Great service . Jace is wonderful. The deep dish pizza is nothing like Pizza Hut but it's ok. The Caesar salad was delish. I recommend this place to anyone who likes American food .","useful":0,"funny":1,"cool":1},
{"review_id":"gaBrTbzBGi2-MpdwTPjaYA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"UPIYuRaZvknINOd1w8kqRQ","stars":4,"date":"2012-07-31","text":"The ramen was good. We have been to Japan and the ramen is similar in taste. The place is busy and small like they are in Japan. I recommend getting here early and be prepared to wait if you have a big party. I like their Shoyu ramen, the gyoza was ok. I thought for $5.00 it was a bit steep. I will visit again although I am not a big fan of MSG which I know for sure they have in their broth.","useful":0,"funny":0,"cool":0},
{"review_id":"c_j0q3hnRoK1Rc3bVnPnuw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"A1rAkFxGdQyMxOeaXdVmwQ","stars":5,"date":"2013-05-09","text":"If you like personal touch and friendly service then come and check this dentist out! This office will exceed your expectations! Dr Nguyen is professional, nice and the staff is so great. If you are looking for a dentist that does not make you feel like you are one of the many clients or more like a business then come here and see what I am talking about.","useful":2,"funny":0,"cool":0},
{"review_id":"HRw1w1luWIC5GyZc-M1nsg","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"eR7Iw_X54m3YLWkXp9y35Q","stars":3,"date":"2014-11-13","text":"Not a bad place. Food was good although the serving is not a lot which can either be taken good or bad. Service was not bad. It was bright inside which was a bit too much. I think the place would be better with better lighting IMO. Overall not bad. I would eat there if I am in the area but I won't go out of my way to eat there.","useful":0,"funny":0,"cool":0},
{"review_id":"uS3ZWQxgZkfPsnxWSR9sCw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"VKmGedwOk-16D7OawNg_ng","stars":3,"date":"2011-04-06","text":"I have been to both locations. It has that buffet atmosphere so there you go. People taking what they want and more. My hubby likes it because you get more for your money especially for dinner. They have lots of seafood and fresh oyster that I do not eat but hubby does. I like the Mongolian bbq although I had to tell the man making it to not overcook the veggies. No salad bar and some fruits. Love the baked bananas, yum! Will go back because of the mongolian bbq.  At least I can eat something here that I like. Kids are also half price, yay!","useful":0,"funny":0,"cool":0},
{"review_id":"5M_0WRW5xHwLsAbU58GhXg","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"w-kAAKasRVMePzORGOJ8HA","stars":4,"date":"2011-06-01","text":"Very good place for kids. Informative, very cool. However for me this is one of those once in a lifetime visit deal. Would I go there again? Probably not. But it was a nice place to visit.","useful":0,"funny":0,"cool":0},
{"review_id":"5yPsKqRQ7BmtqAvCUkKQAQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"Nsi49BE_XsjJ0oOXwhH8hA","stars":1,"date":"2011-04-10","text":"This place is terrible!  One star is generous for this place. I hope the owners realize their place is a dump! The food is old and tasteless. Its messy and the restaurant is unkept. I cannot imagine what the kitchen looks like. They do have an \"A\" rating but that food is just plain bad! We used to go here years ago when it had the same reputation and quality as Asia Buffet. The place now is like the haven of people who just need something to fill their stomachs for cheap. No quality, no taste kind of food and cheap. It is sad to see what happened to the quality of this restaurant. I will never go back there unless it is a no choice kind of situation. Do yourself a favor and drive down to Asia Buffet. A few dollars more and it will be worth your time and money. There are also some very seedy characters in the resto. Bad, cheap food attracts the bad customers? lol","useful":0,"funny":0,"cool":0},
{"review_id":"1pf5Yo1piTg-Pv9kZJ10SA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"d7Jgj1h_MILumtsTlb2aXA","stars":5,"date":"2014-11-02","text":"Great place for kids to learn how to swim. The pool is warmer than the YMCA pool which kids love. Kids can swim year long and not be cold. When they get out of the pool the whole room is warmer and the showers are nearby. The facility is clean and the workers are friendly.  Kids learn at their own pace so don't expect your kids to be like Michael Phelps after they finish their summer classes. \n\nI recommend year round classes if you want your child to be good at swimming. 2 months of class is not enough to make them great swimmers. I highly recommend this place for learning how to swim.","useful":2,"funny":0,"cool":0},
{"review_id":"nniWx2ak5gr0_G4VwB2ucw","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"rfllUEczP40Ri-cAKz8DgA","stars":1,"date":"2011-09-13","text":"Careful about signing up with this facility. This place is concerned about profit only (selling tshirts,pants, etc.). High pressure shady sales tactics.  They make it very hard to cancel your membership.  The owners are only concerned about making money off of you IMO. Please be advised. Learn from our experience. Stay away from this place. Very disappointing.","useful":11,"funny":5,"cool":1},
{"review_id":"uZ8dFllctvoI9Gj4YG6HIg","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"u3nwislXMKKwkpHAXAArbQ","stars":4,"date":"2012-07-29","text":"I like this place. It is your usual busy Chinese restaurant. No smiling, busy, no nonsense waiters. I like their fried fresh off the fish tank flounder, mixed seafood with crispy noodles, etc. The prices are reasonable and they are open until 2am! Try and see for yourself.","useful":0,"funny":0,"cool":0},
{"review_id":"BCzKbTC3qHXq8M3Cqf4aCA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"CHjmzfE0PhHhetuQLEEE6g","stars":4,"date":"2012-07-29","text":"Go to Leah at this place. She is great, not a chatterbox and knows how to cut Asian hair which is hard to find in LV. Reasonable price and no pressure sales to buy products. They are close on Sundays so plan ahead.","useful":3,"funny":0,"cool":0},
{"review_id":"ysyrCABgIDRyeR2wnjeIFQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"zP_U5nyuLamO4j4ghY6zbA","stars":5,"date":"2011-05-08","text":"Sandy is a great buyers agent. She is accessible, prompt and will be an advocate for you. She goes out of her way to make things happen. She follows up and calls you or texts you back right away. I recommend her to anyone buying a home and does not know anyone. She will look out for you and be your ally. She is patient, kind and very knowledgeable with her profession. We are very lucky to have found her!","useful":1,"funny":2,"cool":1},
{"review_id":"Uz7zSHltHnU1vLx098n6hA","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"1DmKzgvvcthVwcBUj_nlJw","stars":1,"date":"2012-08-23","text":"I read a review here so I lowered my expectations when I got there. They gave me robe and your own locker to put your things in. I was so far impressed. I did not have to wait for very long at all and my therapist got me into the nice massage room right away. My therapist was ok. She was not the friendliest although I like that she was not chatty at all. Her pressure was not that firm. I guess I could have told her to give me more pressure. No water at the end of your massage like other places. She disappeared after the massage never to be seen again...lol.\nThe check out was interesting. There was a pimple faced teen ago boy at the desk that was not sure exactly what to say. I figured a business like this will have a receptionist all the time and not an awkward boy at the check out not knowing what to say to customers. I cannot even express anymore how weird the check out process was and the tip giving. There was no envelope to put your tip and my therapist was no where to be found! I gave her a good tip and handed it to the boy. I hope she gets it.\nOverall the customer service at this place is terrible. The massage was ok. I would NOT recommend this place unless you are just desperate for a massage. This place feels like these people are just going through the motions. Their hearts are not in the right place and I did not feel any pride in their work.  It is clean though, other than that..stay away.","useful":10,"funny":5,"cool":1},
{"review_id":"gtKhCkG92ZBavVpjpIv4OQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"Cpb142L849ilMzgiSR4a0w","stars":1,"date":"2015-06-04","text":"The place is a sit down kind of restaurant . The menu is not very helpful and the food selection is limited. I am used to Filipino food places like Fiesta Filipina where you can come in and pick any food you want quickly because it's ready. I was disappointed to see that it was a sit down place. There is also a distinct smell to the place. I don't want to say it smells bad but it was noticeably present.","useful":4,"funny":3,"cool":0},
{"review_id":"wCfuggZpKO01-Ke7ulld4Q","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"NKg7XSXPlU8NGakmCeXGgw","stars":5,"date":"2017-06-05","text":"Sunday early morning at 130am my AC in my house broke. I called Tim and he answered my call at 130. He came in on a Sunday morning at 8am to fix my AC.  It took him less than an hour to fix my AC and charge me a reasonable price.   I highly recommend this company and Tim. Thank you so much!","useful":0,"funny":0,"cool":0},
{"review_id":"mQQcoD6oR-utusg_juXe2g","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"qsJkjQoM3Hdg6Gtqp2S9_w","stars":2,"date":"2011-06-12","text":"Its ok. I have had better Thai food. The resto is nice inside although they are so busy. Maybe we got the wrong dishes but the dishes we had like the Thom Kha was nothing spectacular. It was average. I had high expectations because of what I heard from people but unfortunately it did not rise to the occassion.","useful":0,"funny":0,"cool":0},
{"review_id":"vOGpi51QEv_JVm7MmrRqIQ","user_id":"qr9hmaIxq1z9ycgT28PpRw","business_id":"3_QNAH8yVzY0sBPftWyNhQ","stars":4,"date":"2012-07-31","text":"Massage done by Joe was great! Pressure was just right and the shoulder massage was my favorite. I was not a big fan of the ionic thing but it was ok. The place was nice and quiet and they service was great. I will definitely visit again and recommend this place if you are in the area.","useful":2,"funny":0,"cool":2},
{"review_id":"F9onJ4gLx6uIHEoiJF78-g","user_id":"1ryvfb9F6hYoCZZZaqeCOA","business_id":"1FkUTet5GQ5mVwNLw_Ds4g","stars":4,"date":"2015-01-06","text":"My wife and I took the tour with Imbibe Tours a few days after Christmas. We were picked up from the Aria tour bus pickup area, which is underground. Once we picked up a few more people at Excalibur, we were whisked away and headed out of town. A surprise stop was first on the list as we stopped at the famous Welcome to Las Vegas sign for anyone who wanted to take pictures. After this, we were were headed up through the mountain pass in an exceptionally clean bus with a friendly bus driver. Alan had picked out some wines for everyone to do a blind taste test (whites on the way to the wineries and reds on the way back). All wines that we tasted were of exceptional quality, although the reds were all tricks as they tasted  very different from the tasting notes listed and the grape varietals selected (no wonder most people gets the red wrong). The first winery we visited was Pahrump Winery. One of the owners, Gretchen, was so very informative and enthusiastic. She was such a delight to interact with and had answers for every question we asked. Following a tour and wine tasting, we settled in for a somewhat formal lunch. This lunch was way more than we could have asked for with the price we paid for the tour. My wife and I, being home wine makers and loving all wines decided to taste a few more wines (which I highly recommend). Some of the wines that weren't on the tasting list for the tour were even better than what we tasted previously. We picked out several of our tastings and Gretchen's friendly staff assisted us with setting up a shipment of wine to our home. We also bought a few wines and the staff discretely handed them off to Alan to load onto the bus for us. We were then on the road again and headed to the next winery, I would say that after the first winery, the second one left me anticipating an equal if not better experience, but I was to be mistaken. The second winery has only been around for a few years and thus has some work to do to build up their quality as my wife and I both placed many of the samples in the wine dump bucket. As well, the tasting room was a bit \"homey\". I hope they can make it work eventually, but at this time it was a bit of a let down from the 1st stop. On our way back, Alan made sure everyone had plenty to drink, but the entertainment choices seemed to be geared towards current pop music and not necessarily the demographics of the tour guests he had at the time. I'm not entirely sure that Alan knows as much about wine as he would like to let on. I would also encourage Alan to actively listen to his guests a bit more instead of just hearing them...if someone says they have interest in eventually opening a winery, the proper response should not be to bring up how expensive it will be or steering them towards another business where they can get help in barreling and buying wine. Listen enthusiastically and respond positively. Aside from these notes, the tour is great for the value. Those who love amazing wine, great food and education on how a winery runs will not be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"qv65IQbhyJT9MeJHTv6hNQ","user_id":"1ryvfb9F6hYoCZZZaqeCOA","business_id":"YBb-sAYuFv86MGfwQP5Ojg","stars":4,"date":"2017-03-19","text":"Best margaritas around! The food is all a la cart, which is quite different from typical Mexican fair. Very unique flavors. The place is spotless inside with some nice artwork. Definitely a go-to if you like Mexican!","useful":0,"funny":0,"cool":0},
{"review_id":"7Q-yPX6J3qJ82gjBskTVwg","user_id":"1ryvfb9F6hYoCZZZaqeCOA","business_id":"USCJb3w3hOpWW-UAVYZu8A","stars":5,"date":"2015-02-22","text":"Weekly wine tasting events give a great chance for everyone to try wines from all over the world. $5 per person gets you a tasting of 5-6 wines. \n\nBrian is so very knowledgable about their wines and is not afraid to give you his personal opinion instead of the usual tasting notes you get from others elsewhere. I would highly recommend this place if for no other reason than the amazing selection they have from all over the world. Mentioning a varietal, appellation, region, food pairing or any other descriptor will get you a list of suggestions. \n\nI would highly recommend working through their selections...the wine cellar has some interesting finds as well.","useful":1,"funny":0,"cool":0},
{"review_id":"jTOx-q05xX6pWsFtpnAtDg","user_id":"1ryvfb9F6hYoCZZZaqeCOA","business_id":"or4yipilbCkKIFnF1RP5Ow","stars":3,"date":"2015-06-10","text":"My wife and I had an early dinner here on a Monday. The staff was friendly and helpful, but it was obvious that the other waiter was much more interested in customer service than our waitress. Our waitress read off some specials, but we overheard the other waiter reading off a much more extensive list and go out of his way to make his diners much more comfortable.\n\nThe food was OK, but overpriced for what we received. I would not recommend getting anything with snap peas as the chef does not know to trim the stem ends off of the peas. The risotto also seems to be a favorite as it is a side with many entrees; however, it is a bit dense (Gordon Ramsey would not approve). It is very obvious that they are doing their best to make this establishment work, but I think they still need to update themselves a bit in order to draw a younger crowd. At present, it is a \"blue hair\" establishment. This may be the image they are looking to portray and clientele they are looking to attract, but the image discourages those under 40 from dining here.\n\nI would also look to update the wine list. At present they have a wide range, but these are the very traditional and well-known mega-winery names. I would like to see some more unique items on the list.","useful":0,"funny":0,"cool":0},
{"review_id":"XLjcRFnHLVKJl6PXQ2CjoQ","user_id":"1ryvfb9F6hYoCZZZaqeCOA","business_id":"G-5kEa6E6PD5fkBRuA7k9Q","stars":4,"date":"2015-01-06","text":"This stop is a gem on the strip. Situated on the second floor of the Cromwell hotel across Las Vegas Blvd from Caesar's Palace, The view is excellent. Depending on the time of day and your seating location you may even take in a view of the Bellagio fountain show. The service was a bit slow and we spent roughly 15 minutes there before anyone came to our table, but our server seemed to have a number of tables so we can certainly understand the delay. We were there for lunch and as this was a special occasion, we brought our own bottle of wine. The corking fee was a bit high (but not for Vegas prices) at $35, but it was still a steal considering that almost every wine on the list was an ultra premium wine. Once we ordered, our food came out exceptionally fast. We highly recommend the baked pasta of the day, the Buratta cheese (buffalo mozzarella), Baby Sweet Peppers and Marinated Olives. Our total dining experience lasted over 1 1\/2 hrs. We were so fulfilled by the time we left. In the end, when our check came, we found that the corking fee was not on it. This may have been due to the fact that we bought so many dishes during lunch or maybe our overwhelmed server simply forgot, but we weren't complaining :) \n\nI would highly recommend Giada's for lunch!  All their food is fresh and homemade, which is somewhat rare these days, even on the strip.","useful":0,"funny":0,"cool":0},
{"review_id":"QudEmPtjfAQ8WlawsUKCTw","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"WWqdy9PKOSyhLgHIGaNFrA","stars":4,"date":"2010-07-05","text":"One of the best places in Tempe to get a late-night snack that isn't horrible for you.  I'm guilty of not always (or even usually) going with the most healthy options, but the sheiftalia platter has got to be better for me than a burger and fries, right?  Their tzaziki is bomb, the sheiftalia is delicious and tender and juicy and coated in just the right amount of lemon-y-ness, and their pitas are thick and soft, the way they should be.  They're open 'til 3:30 AM, and they deliver.  If you love good food and like to eat at weird hours of the night, do it here.  You won't regret it.","useful":2,"funny":0,"cool":1},
{"review_id":"TfxIr9dkQK9ZcKmDhGqEbQ","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"3Ru1_F8GoUcV-QwhX378hA","stars":4,"date":"2009-04-14","text":"This is the some of the yummiest Chinese food I've had since moving to AZ, and absolutely the yummiest Chinese delivery I have had since moving here.  I've only found three or four places total that have delivered, and all of them have been mediocre or worse, except for Asia Lee.  Everything I've gotten from them is delicious; last time I ordered Szechuan Beef, Pork Egg Foo Yung, and the free Chicken Fried Rice that comes with any order of $15 or more.  I wasn't a huge fan of the pork that came with the Egg Foo Yung, but the egg patties themselves are savory and delightful.  The Szechuan Beef is my absolute favorite, and it made a great lunch when I reheated it the next day, as welll.  I've never been inside the restaurant, so I can't vouch either way for the last review, but honestly, why would I go to the restaurant when I can have all the yumminess delivered right to my door?","useful":3,"funny":1,"cool":1},
{"review_id":"61LX4t_LBGvy00fWB27DWg","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"vU8-ATy2-MASm-bQXdhRaw","stars":4,"date":"2010-07-07","text":"Okay, so I might be a total weirdo, but I wake up craving Pei Wei's fried rice some days.  There is very little I enjoy more than waking up hungry at 10 AM on one of my days off, logging on to Pei Wei's website, and ordering fried rice just the way I like it without having to explain it to anyone and risk them writing it down wrong.  I'm antisocial, so what?  Then, I know that when they open at 11 AM they will have my very special order of fried rice hot and ready waiting for me.  The portions are huge, so a $6-$7 order of fried rice can last me up to four meals, which is an awesome [if not exactly healthy] deal.  \n\nI don't really like much of their other food that I've tried.  There's some sort of curry dish that was nice, but I'm sticking to my fried rice with extra egg...  yum.","useful":1,"funny":0,"cool":0},
{"review_id":"EbrD4_4AZDeVwh2k8-USXw","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"ba4jRrqz6xlWgg0YIjAoAw","stars":1,"date":"2010-02-12","text":"Their specials menu is extremely misleading -- I went there on a Wednesday, and according to the menu you get \"50 cent drafts with any entree.\"  So I ordered an entree and asked what they had on draft.  Apparently that wasn't specific enough, because my beers were $5 a pop.  The waitress played dumb, and when I spoke to a manager he treated me like an idiot for not asking for the \"draft specials\" rather than the drafts.  That language is nowhere on the menu.  He told me if I didn't want to pay that much, \"we were going to have a problem.\"  He didn't even offer any sort of discount or anything, claiming that \"he didn't write the menu.\"  I paid and left, and I'll never go back, simply because they're purposefully misleading and expect their drunk customers not to ask questions at the end of the night. \n\nAlso, the stalls in the women's restroom have no locks.  Charging five bucks for a plastic cup of beer, they should be able to afford to get that fixed.","useful":5,"funny":3,"cool":1},
{"review_id":"Zl-eGpZWSMLeDiYYa7sbRA","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"JzOp695tclcNCNMuBl7oxA","stars":5,"date":"2010-07-06","text":"This is my go-to bar.  I'm not into the scene at places where there's a lot of loud, obnoxious frat boys.  Four Peaks isn't especially quiet, mind you.  They play pretty good music for the most part, and almost every time I've started to groan because of the song that just came on, someone who works there changes it.  The service is a little slow, usually, but I honestly don't care.  The food is amazing, and the beer...  oh, the beer.  I love the Sunbru for warmer days, and the Oatmeal Stout when its chillier out.  I always end up drinking a little more than I planned because they're so delicious, and that leads to me splurging on appetizers.  My favorite is the spinach artichoke dip.  \n\nAll of their beers are worth trying, since they brew them there you're not going to get them anywhere outside of AZ, as far as I'm aware.  If you don't know where to start, for $9 you can order the sampler, and get a tiny glass of each kind of beer they brew, then decide for yourself.  \n\nShort version: good food, good beer, one-of-a-kind establishment, go, now.","useful":1,"funny":0,"cool":0},
{"review_id":"kO4ObhlJR-LmucOzHg2ovA","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"kRgP3LxO2ugBrC1YpWLncA","stars":1,"date":"2014-04-06","text":"Me and a friend ordered delivery through GrubHub, which was fine.  The bill, with tip, came to about $50 for two entrees and a dessert, which even for delivery seems high.  (I recently paid $65 for Chinese delivery to my office for four lunch specials, crab puffs, $8 delivery charge, and tip.)  I ordered the pineapple fried rice. I love spicy food. I'm the friend who makes fun of everyone else for eating things at 0 spiciness. I ordered this dish at a 6, thinking it would be on the hot side of medium spiciness. This was one of the spiciest dishes I have ever been served. It was inedible, because not only was it extremely spicy but the pineapples had been cooked so much they were completely flavorless, which is something I've never experienced before. So there was no balancing sweet flavor, it was just insane spiciness that overwheled everything. I am with a friend who also loves spicy food, and it was too much for him, too. He ordered another dish at a spiciness level of 3, which seemed to have no bite at all. Mine was definitely not twice as spicy as his, it was at least 10 times as spicy. I've ordered 8s and 9s that weren't this hot. He also was weirded out by the totally flavorless pineapple. \n\nMy friend's level 3 completely unspicy dish was fine; it was crab fried rice.  It wasn't anything special; just regular fried rice with a little bit of crab.  We ended up sharing that because neither of us could stomach mine.\n\nI am addicted to sticky rice. It's one of my all-time favorite desserts. Bangkok Thai's sticky rice came in a sealed plastic bag, apparently directly out of the microwave, with a coconut milk sauce that didn't have nearly enough sugar. It was overall bland, I tried some of the nuts that were on the side with it; they turned out to be peanuts, which I don't love to begin with, but when a couple of peanuts totally overwhelm the taste of what you're eating, you know that it's not very flavorful. The coconut custard was OK, but not amazing. I've definitely had better. I used to live near Thai Lotus and would frequently get delivery from them; their sticky rice with custard was AMAZING. I'm really sad there's no decent non-pizza places that deliver to my new apartment. \n\nFor a $50 delivery order, I was extremely disappointed. Worst $50 I've ever spent on a meal.","useful":4,"funny":0,"cool":0},
{"review_id":"ZcjiVPOEZzXwW-he9_-jeA","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"EUg6vHQRLHRw39bmompHcw","stars":5,"date":"2010-07-06","text":"I love Dutch Bros!  I'm a dedicated punch-card holder, addicted to iced Kickers, which are their Irish-cream flavored specialty.  They're really rich though, just so you know what you're getting into before you take my advice.  They make it with cream, but you can also get it with less fatty milks (or soy milk).  If you want the full experience, get the cream though.  \n\nI also love that their prices are all in increments of $0.25, including tax.  It's just a nice touch.  :)","useful":1,"funny":0,"cool":0},
{"review_id":"LSs3-12JEnYY6XqDdPPtnA","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"rKBZdPOd-IkRykaeQ56Ngw","stars":5,"date":"2011-12-01","text":"Oh, what a wonderful experience.  \n\nMy boyfriend and I were going a little nuts on Groupon yesterday (I think we purchased 3 different deals) when we discovered a Groupon Now! for Thai Buffet.  My boyfriend is a huge buffet fan, and we both love Thai food.  He got really, really excited and I couldn't say no, so we purchased our final deal of the day, went and ran some errands, and finished off at Thai Buffet.\n\nWe were the only ones there at that time, but we were a bit early for dinner and really late for lunch (I think we arrived around 4:15-ish).  The buffet is not your standard type of buffet where you serve yourself, but it is all you can eat.  Joann, the owner, described each of the dishes to us and piled our plates high with a variety of curries, as well as a bowl of soup and another plate of salad.  We couldn't say no to any of the dishes, they all looked super amazing.  And they were.\n\nMy favorite was probably the green curry; it wasn't as spicy as some green curries and it had green beans in it, which I love.  Everything tasted more homemade than \"restaurant-y,\" for lack of a better descriptor.  I felt like I was in a Thai grandma's kitchen, and it was awesome.\n\nAs we finished our massive plates of food, Joann went back into the kitchen and prepared us bowls of coconut ice cream with mango, pumpkin custard, and sticky rice.  This might have been my favorite part of the meal, but it's hard to say because it was all so good.  I'm a total sucker for sticky rice, though.\n\nDefinitely will be back.  You get a great value for the price (even without a Groupon, the buffet is $9.99\/person), with quality eats and very friendly service.","useful":1,"funny":0,"cool":0},
{"review_id":"-Ll2ySx7XmteA4pIppNjiQ","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"wl0QZqAzr1DelslQ02JGCQ","stars":2,"date":"2010-07-05","text":"My main problem with the Cornish Pasty Company is inconsistency.  I've had pasties that were simply divine, and I kept going back.  Once I started getting ones that were a little icky, I just assumed they were having an off day.  I stopped going after my boyfriend and I got sick.  I really want to like this place, and I do like some things about it.  The crust on the pasties is always fab, but the fillings are hit or miss.  I always got either the Oggie or the Pilgrim, and the Oggie was more consitently good.  Once I tried the Pilgrim, it became my instant favorite since is had turkey and stuffing inside, and came with cranberry sauce for dipping.  But like I said, their lack of consistency, as well as the fact that I got sick last time I went, has made me not want to give them any more chances.","useful":2,"funny":0,"cool":0},
{"review_id":"VUAwquKwz69H8zbXtn8q6g","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"6Rrlg6hnM0ir7ijhKG2ybA","stars":5,"date":"2011-10-16","text":"My boyfriend and I are super broke right now, so we're taking advantage of our Groupon credits.  We were hungry, and 5 & Diner was one of the Groupon Now! options.  I was originally thinking fries and a patty melt when we decided on going there, but when we looked at the menu the breakfast food looked extra delicious, so I went for the waffle with strawberries, and my boyfriend got the country fried steak and eggs and a vanilla coke.  As I'm writing this, he asked me to specifically mention that the vanilla coke was super yummy, so I'm doing that now before I forget.  (I had a sip, and I can verify that he speaks the truth.)  My waffle hit the spot, it was a nice texture and the yummy sweet strawberry topping was just what I wanted.  My boyfriend cleared his plate, as well.  Our server was super attentive and friendly, and even gave my boyfriend his last refill to go so we could take it on the road with us.  All in all, a very positive experience, especially considering this type of diner usually has mediocre food.  We'll definitely be returning soon.  As a side note, I had been here once before a long, long time ago, and had the patty melt and that was awesome as well.  \n\nAs a side side note, I don't know what the person who said the dining room smells like a bathroom is talking about.","useful":0,"funny":2,"cool":0},
{"review_id":"fvmbDYauSiZ20PapoJygMQ","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"VGOpZ15XmabMYuxW1J8zqQ","stars":5,"date":"2010-07-06","text":"The employees are for the most part very friendly, and right now they've got some sweet deals going on for candy.  2 sodas, 2 candies, and a popcorn for $5, or 1 soda, 1 candy, and 1 popcorn for $3.  Plus they give out free gift cards for pre-ordering movies and games.  \n\nThey also have a new thing called Direct Access, where if there's a movie or game title that they don't have in the store, they can have it mailed to you within 2-3 business days for the same price as renting it in the store.  You can mail it back when you're done, or bring it back to the store for $3 off a movie rental or $4 off a game rental.  Sweeeet.","useful":2,"funny":0,"cool":1},
{"review_id":"zQUqDmqQ17mdkb3TcSGz8A","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"CRVtzesMuwHK-phmS_ojaA","stars":5,"date":"2010-07-05","text":"I am addicted to Venezia's.\n\nA while back, a coworker picked up a slice for me and I was not impressed.  I don't know what was wrong with me.  \n\nI re-tried Venezia's on my lunch break four days ago, and I have eaten there every day since.  I brought my boyfriend there, and he is obsessed as well.  I am boring and usually just get cheese pizza, but my boyfriend always gets the slice of the day and raves about it, whatever it is.  I also got the Combo B last night, a slice of pizza with a small salad and a drink, and the salad was impressively good.  The Balsamic dressing was excellent, too.  Everyone should try this place out.  The pizza slices are huge, delicious, and satisfying.","useful":3,"funny":0,"cool":1},
{"review_id":"R_7XYxXrJ7nZ0_Tdj9ns9A","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"70umoFq_Wa24Nr78UOsilQ","stars":4,"date":"2011-10-16","text":"I crave Ono from time to time.  I wish it was closer to my apartment.  I still swing by for some Chicken Katsu whenever I get the chance, because it is tasty and delicious and katsu sauce is addictive.  My boyfriend is more adventurous than me, and he literally always is in the mood to go here.  He especially enjoys the spare ribs, bbq combo, and the spam musubi.  We both love the macaroni salad...  I get why someone said there was too much mayo, and I guess by some standards it's a little plain, but that's what I like about it.  People who say the rice is boring are obviously right, but they're forgetting to put soy sauce or katsu sauce or whatever they want on it.  It's plain white rice, guys, what do you think it's going to taste like?  \n\nThey also have these super tasty canned Hawaiian beverages at the counter that we both highly recommend.  \n\nOh, and if you have a smaller appetite, definitely go for the smaller plate option.  My eyes tend to be larger than my stomach and I can never finish the full-sized katsu plate, but the smaller one is just right (actually still a little more than I can eat, usually) and it's only about $5.  Awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"1nIrMXZ63lQkMtAesuNyMQ","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":5,"date":"2010-07-05","text":"Amazing wine list, fantastic pizzas with unusual toppings, and gnutella crepes for dessert.  It doesn't get any better.  Not to mention that the service is excellent and friendly, and the atmosphere is comfortable and welcoming, something that you don't usually experience in a place as hip as Cibo.  I get nervous going out to trendy places because I'm scared of getting dirty looks from rich people, but this was not my experience at Cibo.  Just sitting on their patio is a relaxing experience, what with the lovely foliage, glass of wine, and beardy waiter.  I always want to go back when I've got the cash.  Great for a date or special event.","useful":2,"funny":0,"cool":0},
{"review_id":"XvxR3pFbQVHSg-J1LjM09A","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"QZJpXx1TbOXqzLx6u6xmaQ","stars":2,"date":"2010-07-06","text":"Today was my second or third time coming to Paradise, but I wouldn't call it that if I had a choice.\n\nI ordered the Chicken Katsu, which is a favorite of mine when it comes to Hawaiian food.  I was disappointed that it was especially chewy, and that they served it with BBQ sauce instead of Katsu sauce.  It just didn't taste quite right.  The lady working there wasn't particularly friendly, either.  I'll just go to Ono next time I hear the call of Katsu.","useful":1,"funny":0,"cool":0},
{"review_id":"panwOEsDuMoypXyLgbUcOw","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"HwjhWHbNp56t-dRiv3-wPA","stars":5,"date":"2011-12-01","text":"I am a couscous addict, and this is my go-to place.  Everything I've tried here is wonderful, though, and I love the attached market.","useful":0,"funny":0,"cool":1},
{"review_id":"yqf2Kj40F9eGB_L_SCoRXQ","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"UCqWJWovgeelP1OUI_L90w","stars":5,"date":"2010-07-06","text":"Best. French Fries.  Ever.\n\nAlso they have great onion rings, fried zucchini, hot dogs...  I don't eat burgers really, so I can't speak to those.  I am obsessed with their tuna salad, though.\n\nI never thought I'd be ordering tuna salad sandwiches regularly from anywhere.  Tuna salad has a tendency to be that unpleasant gray or pinkish color, and have a tinge of fishiness to it, if its not fresh enough.  That is never the case at Chicago Hamburger Co.  This might sound strange, but their tuna salad is the most pleasant pale green color I have ever seen.  It's because they put relish in it.  Lots of delicious relish.  I am in love with their sandwiches, and although I used to devoutly order Polish sausages & fries, I can't turn my back on my new love.  Not the first thing people think of ordering when they come here, but it's definitely worth a try.","useful":1,"funny":0,"cool":0},
{"review_id":"Evu46hmPljDfH0xYw43KOw","user_id":"vbe6VKvvOHn0BkqAhhmEmw","business_id":"kc1_CSr60-K-uH3cYtiFTg","stars":1,"date":"2014-06-09","text":"Same deal as everyone else.  I bought the LivingSocial deal, and emailed them through their website as soon as I got the voucher.  I never got a reply, but I didn't mind because the instructions DID say to call a specific number to schedule, as opposed to going through their website.  About a week after my initial email, I called and left a voicemail at the number listed on the voucher.  Never got a call back.  Today, my boyfriend called to try and schedule a cleaning and the number on the voucher is no longer in service.  Their website has also been disabled.  I've requested a refund from LivingSocial.","useful":1,"funny":0,"cool":0},
{"review_id":"PPepHS43hbNTnav1DQDpog","user_id":"WMCgAZsXqrFDLDNYrkdEFA","business_id":"TAB_NFD7pjjouJUlCjCvKQ","stars":4,"date":"2016-07-19","text":"I was here for a conference in April, and this was probably the most beautiful hotel I've stayed in. The staff and service was wonderful, and the provided food was more than satisfactory. Wi-Fi was a decent speed (except in the lobby), and was free to members who join their loyalty program.\n\nThe main issue I had was with the room I stayed in the first night. It faced another room, and therefore didn't have much natural light. I also couldn't leave the curtains open if I wanted privacy. The worst part was the noise. There was a low pitched humming from air conditioning equipment outside the room. The noise wasn't incredibly loud, but it was very grating and made it difficult to get work done or sleep. \n\nThe next day, I asked for a new room. The staff was incredibly friendly and accommodating, and did not make me feel like a nuisance. I got a room that was much quieter, faced the street instead of another room, and had better natural light. I just wish this was true for all the rooms.\n\nOverall, 5 stars for service, 2 stars for the first room, and 4 stars for the second room.","useful":0,"funny":0,"cool":0},
{"review_id":"bCzzir-O8YmOdVKtinPARQ","user_id":"skr4z5eEw36_QjK0jeSNKw","business_id":"roR1_DDlMk7mhi5_R6XVKA","stars":5,"date":"2016-12-28","text":"Tried out this new location, and wow! Amazing. I will be back for sure! Everyone is so friendly and service is spot on. Our meal was delicious and the music was great. Can't wait to try more things on the menu! This place is a winner!","useful":0,"funny":0,"cool":0},
{"review_id":"7PIHoRMzGpR7FI5C9jGhpw","user_id":"skr4z5eEw36_QjK0jeSNKw","business_id":"k2wkwkwbCCoxhqMVjzbJZg","stars":1,"date":"2016-12-28","text":"Went to Wally's last night and all I can say is YIKES!!!!! The biggest disappointment I've experienced in a long time. What used to be this hidden gem, with the comfort of home vibe with perfectly cooked home cooked food and staff that treated you like family has now become just like every other restaurant in Scottsdale. Way over priced for poor quality of food, staff that doesn't care anymore, management that doesn't care anymore. My favorite waitress is gone, which I guess is no surprise seeing what the owner Chris did to this place. If I wanted to eat at Grassroots or Twisted Grove then I would drive a few blocks down and eat there. Wally's was something amazing, something special that is so hard to find in a restaurant these days.Now, it's ruined, now is disgusting, now it's a complete waste of your time and hard earned money. Don't bother trying it out, trust me. I will not be back to this one. I would much rather drive to the other location on Camelback that has remained the old Wally's. Way worth the drive.","useful":2,"funny":0,"cool":0},
{"review_id":"KiKChQV4kvN_FfAdfpZBZA","user_id":"skr4z5eEw36_QjK0jeSNKw","business_id":"9i7m5zn2ky8Z63dth11UWg","stars":5,"date":"2016-01-22","text":"I came into Wally's  last night for dinner with my wife and another couple. We were seated at a large round table in the corner on the patio. Our server Candy was amazing! What a gem she is. I have never had a more remarkable server. Seated next to us was a very large rambunctious group of ladies (if I can even call them ladies). The disgusting display of disrespect towards Candy was something I have never seen before. They were behaving like they were in a night club and to watch them bark orders at her and to treat her as if she was a slave to them was horrifying. But even more astonishing was how Candy carried herself through it all. That smile never left her face. I hope those women wake up today feeling completely ashamed of themselves, especially the one who did all of this in front of her teenage sons. I hope I never see any of the women in Wally's again and no server here ever has to go through what Candy went through.","useful":0,"funny":1,"cool":0},
{"review_id":"cVqk88yeuTgIMok3vf6y2g","user_id":"K2MF4olJ9yluuoLxn0LOMw","business_id":"l5MKpZThwcinpNmv4lcBgg","stars":1,"date":"2013-07-27","text":"Place was old looked dirty so I didn't bother ordering. I value my health so I won't eat there","useful":1,"funny":1,"cool":1},
{"review_id":"92JtUaqxOmcfwKyILCd3rw","user_id":"K2MF4olJ9yluuoLxn0LOMw","business_id":"aRYR0UWsICM_CsgbEkvyfw","stars":1,"date":"2017-09-13","text":"They do a bad job of repairing flats. They'll probably make you get a new tire and that's expensive but the worst thing is the tire will more than likely have a slow leak meaning you'll probably be going back again and wasting more time. That is what happened to me.","useful":0,"funny":0,"cool":0},
{"review_id":"3-5FIQAFtL3AjUCiu3bgWQ","user_id":"K2MF4olJ9yluuoLxn0LOMw","business_id":"H57kJV5TUpYyQrY0NvoWYw","stars":1,"date":"2017-06-14","text":"Last few times I made the mistake of\n Using beck and not city taxi. Beck taxied smell bad and the drivers don't seem to know the city well. I won't be using them any time soon.","useful":2,"funny":0,"cool":0},
{"review_id":"0KGq-QBoTY5b_RH4_3HBIg","user_id":"VfSyvigzBvzrQtlw16LlvA","business_id":"SurnOSM2bVVN4-Js3G23RQ","stars":5,"date":"2014-01-18","text":"Just go.  Unbelievable duck tacos, sublime filet (really how does one make onion rings so good you want more? same for the grits, good grits-WTF?).  Fiance said lamb was so good she didn't know that lamb was supposed to taste like that.  Service great, attentive without being a pain.  Sit outside if you can, inside is noisy and small but smells really good as the kitchen is pretty open (no doors between it and dining).  This was top 3 in my memorable dining experience. ( Everyone has a bad day I guess, hence some of the bad reviews, but go. )","useful":1,"funny":1,"cool":1},
{"review_id":"pGm9RZt6IkgXOuxiYvXMcw","user_id":"FRZX8NkKwJtdddsx5DZrgw","business_id":"9Na9bDNBwcNgfy18sEHLXA","stars":5,"date":"2010-12-17","text":"Great French cooking, cozy atmosphere, reasonably priced. Highly recommended.","useful":0,"funny":0,"cool":2},
{"review_id":"Bvy6q9dzLgAUYtIvwyGyOQ","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"0sX-jsw2gcFVqdzGlqU_kA","stars":5,"date":"2008-08-26","text":"We love Shauna's doggy day care! It's close to home, and her hours are convenient. And she offers half day services which are quite useful when you just need to run a few errands but don't want a crazy puppy on your hands when you get home! She has supplies, but we haven't bought anything yet, although we plan too. Also offers grooming service, which we haven't used either, but will in the future.","useful":1,"funny":0,"cool":2},
{"review_id":"tAcnAtL0cyTSkmoR2tncBA","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"pSQFynH1VxkfSmehRXlZWw","stars":5,"date":"2010-04-13","text":"This place is as good as they say it is, and more. We've been there twice. Once with another couple who were grumpy about the whole experience and thus made our experience less than par. We were expecting the wait, but they were still irritated about it. They weren't nice to the staff, the staff thus wasn't nice to us. \n\nHowever, the pizza is absolutely amazing. So, we went back a second time, just me and my husband. Our experience was much more delightful. We enjoyed a bottle of wine during our three hour wait (and therefore were not drunk as one reviewer suggests) and excellent conversation. The ambiance is wonderful. The staff was very friendly since we were friendly to them. We were not rushed to eat quickly, although the pizza is so good it is hard not to shovel it in your mouth! Overall, we were quite pleased and look forward to going again. \n\nI'm not sure how one reviewer said it cost her $70 for her meal. Pizza's are $10 to $12, I'm sure soda isn't all that expensive, and salads range from $6-9. Must have left a pretty good tip! \n\nWe've had the Biancoverde and Rosa, as well as the Spiedini for an appetizer. Delish. I just love this place and wish I could go more often. It's how pizza should be made!","useful":0,"funny":0,"cool":0},
{"review_id":"ar_MNFXRITdkU5tLmNXcqg","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"rnHU2wvqs8FPhvwf9rLQ1Q","stars":5,"date":"2008-08-29","text":"I love local business. Especially when they have great customer service like Toshi's! \n\nI too have had the green tea smoothie, and what a delightful treat it was! I've also had their blended coffee, and iced coffee. Both far exceed the quality of that \"S\" coffee place. What's so great about the blended drinks at Toshi's is that they *shock* actually blend all the ice!! At the \"S\" place, I usually have chunks of ice at the bottom which greatly annoys me. Not so at Toshi's! And they always toast the bagels, which is great. They have limited outdoor seating, and they don't mind if you bring your well-behaved dogs. \n\nOh, and I almost forgot to mention the most important part....they roast their own coffee on site!!! So you know that you are getting very fresh coffee. And you can tell....the taste is so smooth and not even a little bitter. \n\nNow what are you waiting for? You know you want to go to Toshi's!","useful":1,"funny":0,"cool":1},
{"review_id":"wdfuhnbb7uoGw2E_maB8qA","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"VK_l61W_K2OOkDj-YbDeAQ","stars":4,"date":"2008-08-29","text":"Paradise is good. Wildflower is better. But there is no Wildflower in Surprise, so Paradise it is! \n\nAs others have said, the tomato soup is quite delicious. I'm also a big fan of the salad with cranberries....but the name escapes me right now. The turkey wrap is average...lacking flavor. The breakfast quiche is also average. I think mine had been sitting out for a while, so maybe a fresh one would taste better? Cookies are good, but it is hard to screw up cookies. \n\nThe salads are gigantic. Seriously, who needs a salad that big? I guess if you want it for lunch, dinner, and lunch the next day, what a deal! \n\nIt can be a bit confusing the first time you are there since there are two lines, but you figure out that one is for the bakery, one is for the rest of the food, cafeteria style.\n\nWhy do I like Wildflower better? I think their sandwiches are better, and the soup as well. The only soup I like at Paradise is the tomato soup. The others are lacking. I need flavor! I like the ambiance at Wildflower better too, although there is much more seating at the Surprise Paradise vs the Goodyear Wildflower. \n\nOverall, not a bad place to get a fresh salad for lunch.","useful":1,"funny":1,"cool":1},
{"review_id":"f6It8U64UiH01hM196HP7g","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"GYZuhAkNUegsaLyAyI9YNg","stars":2,"date":"2008-08-27","text":"I should have read reviews before heading here. I had heard from several folks that this was a good place to eat, and we had heard that the wings were out of this world. Yeah, not quite.\n\nFirst of all, the ambiance is not that great. Lots of small, loud children. \n\nThe service was very average. We had three servers ask us if we had been helped yet, which I suppose is a good thing, but they all seemed very confused and not sure if we were their table. But good that they asked. Our actual server took quite a while to greet us, and of course he forgot my water. Brought the beer though! \n\nWe started with wings and we wanted to split them...two flavors. At first he told us we couldn't do that, even though it says right on the menu that you can. He made it seem as though he was doing us a favor by splitting them for us! They tasted more like chicken fingers and not wings. Way too much breading. \n\nI had the California burger, hubby had the fish and chips. The burger was overdone, but I expected it would be so I ordered it medium to get it to medium well. It was well done. Thankfully I didn't order well done! Otherwise it wasn't bad for this kind of place. I also order the potato chips as a side since they make them there. The chips were burnt.  The fish was seriously over breaded (apparently they like doing that here) and way too big. The baked potato and cole slaw...very average. \n\nNow all that being said.....our bill was very cheap ($33) and that included two beers, wings, and two entrees. \n\nWant cheap food and average service? Go here! Otherwise, try somewhere else.","useful":1,"funny":0,"cool":1},
{"review_id":"78Kn5oz-zD4_71VL5sNrZg","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"RPO5ISR18Xllgk9ahdPepA","stars":5,"date":"2009-02-24","text":"We went here for a belated Valentine's dinner. It was fantastic. Parking was a pain, but we eventually found a spot. They seated us immediately (we had reservations) and our server was very attentive. They immediately brought out bread (delish) and water. Not long after, our wine arrived. Speaking of wine, don't be scared when you see the wine list...I didn't see any wines by the glass, only bottles, so I simply told the server what I wanted, and there it was! \n\nI had the tagliatelle (sp?) pasta with wild mushrooms. SO good. I'm a big fan of earthy tasty yumminess, and this hit the spot. Why can't I do this at home?? Oh, and the soup... divine! The special was potato and leek soup. Perfectly smooth, must have been strained several times to get it this smooth. Very comforting. Hubby had the mac & cheese for an ap...YUM! That Vermont cheddar is just too good! He had the pork chop for his entree, and I will never be able to make pork chops at home again. Oh well! He thoroughly enjoyed it. For dessert we had the Iron Chef apples, which were perfect. We were pretty full by this point, but these three adorable little tasty apples were just the right finishing touch.\n\nThe second best part of our night (the food was first, of course) was meeting Mark Tarbell! I tried not to act like a fool, but I watched him on Iron Chef, so it was cool to meet him! He was very friendly, very down to earth, and seemed genuinely concerned about our experience. He was walking around to all the tables...great chef! \n\nSo for a nice night out, you can't beat this place. Enjoy!","useful":1,"funny":0,"cool":1},
{"review_id":"1vvHy4nGgdXwWfH4Ab-FzQ","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"7yIHC8KsR5OaE_7MgEBVhw","stars":5,"date":"2009-06-22","text":"We had a fantastic experience here! We went on a Thursday evening and with the misters on, it was still very pleasant sitting outside, even in June. The wine list was extremely affordable - most between $25 and $60. For Scottsdale, this is a steal! We shared an appetizer and a main entree. The appetizer was delish. Grilled bread (perfectly grilled, not so hard that it hurts your gums) with three spreads - an amazing goat cheese and marscapone, eggplant, and hummus. Also, they serve house bread with a great sun dried tomato butter. For our entree, we shared the fish special, which was a sea bass with artichokes, fingerling potatoes, and spinach. Fantastic. The service was also great. \n\nI've come to expect any service in Scottsdale to be rude but  this place wasn't! Maybe we were lucky, but I enjoyed our experience.","useful":0,"funny":0,"cool":1},
{"review_id":"xbCOS7iV8KtUCG5hdSUGhQ","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"UAE4XWXwlALJsq8yycmW5w","stars":5,"date":"2008-08-27","text":"Mmmmm.......bread......\n\nOh, sorry, I'm supposed to be writing a review. Wildflower is easily our favorite place for lunch, and breakfast too. This place is always clean, always busy, and ordering is always easy. \n\nWe usually get the same thing every visit, since it is so tasty. We both get the potato cream cheese soup, no matter what time of year (yes, it is that good!), I get the chicken and feta, and hubby gets the BLT. Even at half size, these sandwiches are plenty to fill up on. And, if we feel we can spare the extra calories, we will get a cupcake to go. YUM! I've also had a salad, can't recall which one, but it was fantastic as well. Sometimes we'll also get a loaf of bread to go, and we've varied the kind, all have been great.\n\nNow breakfast...ah, that was just divine. I got the lemon ricotta melt in your mouth pancakes with fruit topping. My mouth is watering just thinking about it!! And I got the apple sausage on the side. It was a little dry, but no matter since I was so full on the pancakes. All I needed was a mimosa.... Moving on, hubby got the banana walnut pancakes, which werer also oh so scrumptious. \n\nSo, we love supporting this place, and think it kicks Paradise's butt. We are wishing and praying that they would bring one to Surprise, although that might not be good for my waistline....","useful":2,"funny":1,"cool":2},
{"review_id":"WITHAta7tSvZJdRpkqb_ug","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"oD0I3JFyj2A1pi67uLnz-Q","stars":5,"date":"2008-08-09","text":"I love the ice cream here! Course, I've never seen baby roaches, thankfully. While the place isn't spotless, it is clean. I love the decor... very charming, and the employees are always friendly. I've had shakes and sundaes here, both have been very good. Also, they sell \"pup cups\"...a frozen yogurt treat for your four legged kids! My dogs love these pup cups, and at $1.25....it's a great treat for them when it is so hot out! And it is a local store...so all the more reason to support it!","useful":1,"funny":0,"cool":0},
{"review_id":"-_BKaXQCBgupepxlv52-Qg","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"4gXdyihRiytmXEAfqLNMBw","stars":4,"date":"2008-08-09","text":"I've been to Babbo's several times since it is so close to my house. My two favorites are the Pasta Martini and the Gorgonzola Salad. The bread is excellent, and I've had no issues with the wine, so maybe I've been lucky? I've also had their pizza, I can't recall which one, but it was excellent with peppers and goat cheese. The ambiance is great as well, and prices are very reasonable. The reason I'm not giving it 5 stars is because the service has been sketchy at times. But, it isn't so bad that we won't return. Overall, a good place.","useful":0,"funny":0,"cool":0},
{"review_id":"0txptKvnnQY0oACr-ez0FQ","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"f5lAnpNYukWYi22TCO1HVA","stars":2,"date":"2008-08-06","text":"I have mixed feelings about this place. I love the concept, but the owner seems to only provide good customer service to his \"important\" customers. I've been in here several times, and each time I felt as though he didn't really want us there. My dogs are well behaved, and I've promoted his ice cream socials (and told him so) but I still felt as though I was not welcomed. I may not be as regular as some customers, but I still deserve good customer service. I'm not willing to pay high prices if I don't get good treatment. I want to support his business since he is local, but apparently he doesn't want my business.","useful":4,"funny":0,"cool":0},
{"review_id":"UVl6P7OmIexCctcIimKM1w","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"NbbO83a69vdXpACNw3jKCA","stars":3,"date":"2008-08-09","text":"We checked this place out to compare prices to Target and other grocery stores. What I found....prices are essentially the same. Since I enjoy shopping at Target so much more (it is my happy place!) I will continue to shop at Target and the grocery store closer to my house. The good points....It is clean and well organized, and in the frozen section the lights don't come on unless you are standing in front of it. Nice touch...keeps the food in a dark cold area, while conserving energy. But, Walmart just isn't my thing, and if the prices aren't cheaper, then off to Target I go!","useful":0,"funny":0,"cool":0},
{"review_id":"ptWGasplfjFQkqWB8gznyA","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"i2DcZyW9vmocjpuPNcyOgA","stars":3,"date":"2008-08-09","text":"We've only had Bronoc's once. We had it delivered, and it was average pizza. The sauce was too thick and too much tomato flavor, the crust was average as well. It tasted more like certain chain pizza stores that I avoid, but it is a step up from them since their cheese tasted better. But I am a major pizza addict (usually make my own) so I am very particular. Their customer service was good, and the pizza was hot when it arrived, but the taste just wasn't that great. It's been a while since we tried, maybe we'll try again sometime and see if it has improved.","useful":0,"funny":0,"cool":0},
{"review_id":"0jg4v_u5jOs8Jr1k1UnHMA","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"ggNdavmNsIEnHx8fAK_zEQ","stars":4,"date":"2008-08-27","text":"Ok, so service isn't always the best. The workers can often be clueless and even rude. Luckily, I know Target very well, so I don't need these workers! I can find it myself! The cashiers are hit and miss. Sometimes they don't even mutter \"hello\", but whatever, I'm at Target. Yeah, it's my happy place. They always have fun stuff and great prices. Things are always well stocked (at least the workers have that part figured out). I can easily drop $100 here even though I just went in for toothpaste. How? It's one of the mysteries of the world, I suppose. So when I'm trying to save money, I don't go here! If I really need something, I do not, repeat, do not get a cart, but a basket! That way I can't fit much in my basket. \n\nI think Target is a girl thing. Guys don't really get it. But if you are a girl, you get it. It's Target.","useful":1,"funny":0,"cool":1},
{"review_id":"1NTh8_PYneaNLTEVUZP8_A","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"gA9hCYY7MYl9oZ3aym5dvw","stars":4,"date":"2008-08-26","text":"We've been to Tokoyo lobby twice. Both times were great. I'll start by saying I gave it four stars instead of five because it is small, small, small inside and the ambiance isn't fantastic. But the things you must do for good sushi! \n\nI can't recall for certain the name of our favorite roll, but I believe it was the Glendale roll. Deep fried goodness is all I can say! I know, it isn't traditional sushi, but I just can't do raw fish! Nuff said. We tried two other kinds which were good as well, but the deep fried goodness overshadowed the other ones and I have erased them from my memory. \n\nThe pot stickers were ok, not fabulous. The green tea was great and came in cute little tea pots. I haven't had sake here and I don't know why, since I usually get sake. Guess I'd better head back for some more sake and sushi!","useful":0,"funny":0,"cool":1},
{"review_id":"pX6jULXlfFLN_IgWeAPfYw","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"ovtlrcsVRlgZZQUlHs_ovw","stars":5,"date":"2008-08-26","text":"Vogue Bistro is by far the best restaurant in Surprise! Why, you ask? Oh so many reasons! Let's begin...\n\n1) It is not a chain restaurant! It is locally owned by a well trained chef. \n\n2) The Food. Ok, maybe this should be number one, but with the dominance of chain restaurants in Surprise, I think it is important that it is not a chain. But the food is FANTASTIC. I haven't had a thing I didn't love. My favorite is the Vogue Burger. It's big, but not so enormous that you have no idea how to eat it. The toppings are perfect, not overwhelming, and the meat melts in your mouth. All that yumminess for only $8!! What a deal!  I've also had the sweet potatoe fries (make sure you ask for the dipping sauces), the garden panini, the chicken panini, and the chicken salad (yes, we've been there a few times!) All were fantastic. \n\n3) The alcohol. No, I am not an alcoholic, but this is worth mentioning! The drinks here are great. I usually get wine, while my hubby will get beer. Both lists are great and reasonably priced (a great white wine for $6\/glass). Also, the martinis are fabulous. They shake and pour at your table and they have many specialties. But, what I love most about the martinis is that they are sweet, but not blast of sugar sweet. Often when you order a sweet martini you are blown away from the sweetness factor. Not here! They are just perfect.\n\n4) It has very chic decor. Lots of outdoor seating which isn't great this time of year, but is fabulous when Arizona has nice weather. When does that happen again? Moving on...\n\n5) The manager and owners are awesome. We haven't been there once that they didn't stop by for a chat.\n\n6) It is local! I am a huge supporter of local businesses, which can be extremely challenging in Surprise. \n\nOk, now for a couple minor negatives. These are not significant enough to drop the star rating, in my humble opinion. \n\n1) Sometimes the servers can be a bit lacking. I think this is because the restaurant is still new and still learning. So, we overlook it and instead take the extra time to enjoy good conversation. \n\n2) It can be crazy busy. I guess that isn't a bad thing necessarily, but we can be spur of the moment and decide to head to Vogue. Luckily we can usually find a seat at the bar and order there. \n\nSo there you go. The best restaurant in Surprise....you will wonder what the heck it is doing in Surprise. It is more Scottsdale-like, but without the snobbiness (no offense to you Scottsdale folk!).","useful":1,"funny":0,"cool":1},
{"review_id":"Dkl2s5_FxH1U0OvybS263Q","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"nsDDx67UwXJvbkNdoXHmIQ","stars":4,"date":"2008-08-27","text":"Ok, normally I like to support local over big chains, but I've always had a good experience at this PetSmart. The cashiers are always friendly, the store is clean, and most of the time I can find what I need (minus one time they were out of vitamins). I wish they had more organic and natural products, but since I feed my dogs mostly fresh food, this isn't an issue. They have a great selection of holiday items, so I am looking forward to what they have this year! And I've had no problem returning items if I needed to. Plus, they have adoption drives!","useful":1,"funny":0,"cool":1},
{"review_id":"Eoxg-VhiE2lDyg1aSpMbCQ","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"cZJ8DfdiLzILcdGSOCWI3g","stars":5,"date":"2008-08-09","text":"We absolutely love Sprouts! We shop here almost exclusively (only at other stores for things that we can't get or the price is too high to justify...but that includes very few items). The produce is always fantastic (and cheap!!), then meat is so tasty and fresh, and the cheese....oh I just love the cheese section! The cheese is cheaper than what you will find at other grocery stores...we did a price comparison. I know when I shop at Sprouts I am not getting overly processed, full of preservatives. I am getting fresh food!! What a concept, huh? And the bulk section is fantastic. I love being able to buy spices and flour and anything else you can think of (especially the chocolate covered toffees!!) in just the amount I need. Then it is always fresh and I don't have to wonder how long I've had that dried rosemary! And, it is a local Arizona store, which makes me even happier.","useful":1,"funny":0,"cool":0},
{"review_id":"vae_PBKFlbBKRT43_l8f5Q","user_id":"dNNhk8urecrV_otn7kiziA","business_id":"v4qyBRpTBvOO55M4IAqNNg","stars":3,"date":"2008-09-15","text":"I went to Tomo with a very large group (around 18 folks, we had a reservation). Things didn't start out so good...the manager wanted all of us to pay cash because he didn't want to split the checks! After we explained that none of us had brought cash (seriously, who pays with cash anymore?) he left for a bit, and then came back and said we could split the check. So, I believe they were just being lazy, since they ended up splitting the check anyway. If they had wanted us to pay with cash, they should have informed us when we made the reservations! Poor management. Overall the serves did a good job though after this incident. \n\nMoving along to the food. The green tea was unlike other green tea that I have had. It had a nutty taste to it that I didn't care for. Perhaps that is more authentic? I don't know, but it wasn't what I was expecting, and didn't drink it. The miso soup was excellent and brought out fairly quickly. Hubby and I shared the gyoza and the spider sushi. The gyoza was crunchy, but not too crunchy, and came in a boat. Nice presentation. The sushi was good too. Nothing out of this world, but good. Another person with us had a noodle dish that looked great. It had scallops, mussels, and shrimp. I didn't try it though, so can't say for sure. And the hot sake was great. Always good to have hot sake with my sushi. And to finish it all off...the green tea ice cream. Now this was delicious, and my favorite part of the evening! Nice and creamy, not overly sweet, but just sweet enough. \n\nBottom line: Don't go with large groups unless you have cash, sushi is ok, but the green tea ice cream is worth the trip.","useful":0,"funny":0,"cool":0},
{"review_id":"bwOHJLyDoy-jr5hI8M9j3Q","user_id":"Teba4neRBflxn4kvaIV0xg","business_id":"_La8tdlfTh8Eth-uvt6slw","stars":5,"date":"2017-09-21","text":"He did good work on my SV650 ABS, General maintenance and handle bar conversion.  Planning on getting more work done in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"0D_GV74HvR3O5vMq590dbw","user_id":"qtMHW48PU8-DQ_HCjNFhtw","business_id":"8jLZiv202Cfx_RbTuPOwxQ","stars":1,"date":"2016-07-23","text":"Not for me.  They sit you on a recliner, wet your feet while massaging your head (felt like they were shampooing me) -- very uncomfortable position for my back.    Then the masseusse asks you to turn over while fully reclining the chair and works your back with the elbows.   I did not like it at all, felt like it was too rough on me and am already showing a couple of bruises.  I paid $36 for the 1 hour including 30 minutes back massage.   Too loud, no privacy, cells ringing, employees talking in a foreign language, just too disturbing and I also have a headache now.  I am an expert on Swedish and Thai massages, on a massage table with the masseuse using her hands and a complete silent environment but this was a far cry from relaxing.  The masseusse was a sweet lady but the experience was not good at all","useful":0,"funny":0,"cool":0},
{"review_id":"AYDf8R-v3QP-3uzBN9pAcg","user_id":"aTitfQWAukEJZiET-DDaww","business_id":"iBPSrhDr7IlfMywxCIp-wA","stars":1,"date":"2016-09-24","text":"This place is a train wreck. The owner and management should be embarrassed to have such an under trained staff. Also the quality of food is all over the place, sometimes good and sometimes horrible. It's really sad how often we go someplace else just because of the low quality and horrible costumer service when it could all be fixed so easily. Boooooo","useful":6,"funny":0,"cool":0},
{"review_id":"5pwgzwE3GFlpF1JcEpyYig","user_id":"aTitfQWAukEJZiET-DDaww","business_id":"7h08ecPN5bcW1Gp6UQZxNQ","stars":5,"date":"2016-06-04","text":"Just had a great experience with Ronald. He showed right when they said he would and told us exactly what was wrong with our oven. Very fair price in a very timely manner also extremely polite and friendly. Like all the other reviews I highly recommend Absolute and will call them any time I need a appliance repaired.","useful":0,"funny":0,"cool":0},
{"review_id":"0dbQWR4yc_hMZrBdMJZx-w","user_id":"1fqEtwRuRWOIgx_2f9-JDQ","business_id":"TZGcI88FepqA6A5ynDidQA","stars":5,"date":"2014-02-22","text":"Vape street is the hottest stop to vape at in Vegas good looking out on mods and juices thanks vape street lv","useful":0,"funny":0,"cool":0},
{"review_id":"g61eRjLfDxuh-xrsSJKwlw","user_id":"WtzkyMdYtbeIM3bGih9_oA","business_id":"DljmXW8D07LVTA1Y69xosw","stars":5,"date":"2017-09-15","text":"Awesome taco shop! Great food, very clean, and really friendly staff. Lengua, pastor, asada, and tripas tacos very delicious!! Will definitely come back.","useful":1,"funny":0,"cool":0},
{"review_id":"nJTkhSWZpVT7jrA1B4WE1A","user_id":"EHHdg6vZwgB11pj6dz9BEQ","business_id":"vzXn4jwRraDw4jxSLZxQfw","stars":4,"date":"2012-08-06","text":"Staying at Best Western and just wanted to walk to find a neighborhood restaurant. Turned down 7th street and found Laurier. I has their special of cod, three shrimp, mashed potatoes and veggies. My dinner was excellent. My husband has a lobster ravioli and loved his dinner. Our creme brle was outstanding. The service by Milan (?) was of the most outstanding. We are going back.","useful":0,"funny":0,"cool":0},
{"review_id":"hlkaltop-7IyTRd4ft324Q","user_id":"PLvfZnIQY-3H0c_sdKy81w","business_id":"6yVBbfG2ErupprlX1GEH5w","stars":1,"date":"2013-05-16","text":"when i called them and asked for the rate they mentioned it as 1.95 but they charged me 4.50 for each shirt,which is so ridiculous..and the lady over the counter is not even answering my question which is so irritaing..","useful":2,"funny":0,"cool":0},
{"review_id":"WS2xsAOg1BZpFXOVkMtBfg","user_id":"CFhVsGVm64RApjrUeRBqVQ","business_id":"RpWwTHklokkRMlw5EA9bYQ","stars":5,"date":"2015-08-17","text":"Used them for twice to take us to airport. Booked online the day before. morning 0700 and Muktar was on time both times. Car seat was in back. No chitchat all business. Perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"htoCbKEMK3i8OoMJh2o0Og","user_id":"IFXnfPpeXNv6B4Tr__VjvQ","business_id":"grk4okZqtxGgUe-HhYPLIw","stars":1,"date":"2014-11-09","text":"STAY AWAY!!  The food was absolutely some of the worst I've eaten.  There is nothing Japanese about the cuisine.  Meat either overcooked or heated in a microwave.  Steak, chicken and shrimp with rubber consistency.  Vegetables overcooked.  Sushi didn't appear to be fresh.......Everything thrown in the garbage.  Wasted money!!","useful":0,"funny":0,"cool":0},
{"review_id":"hOaD0L5OCBQ42GWqVTiCyg","user_id":"7ke4Hx03BuAs46cX4F6YXA","business_id":"Gm---0O1y_4TAQAl5qKvqQ","stars":5,"date":"2017-05-21","text":"One of the best restaurants in Dane county and certainly the best restaurant in Sun Prairie. Friendly staff, charming space, and extensive menu.  Respect for ingredients is paramount. Always a good choice.","useful":1,"funny":0,"cool":0},
{"review_id":"pPjfrXvj_G9xbxQxa9eqdA","user_id":"cn2oqZSbsJP7a40smfielQ","business_id":"wl6w2VNMA4g6O9lu7kTvFA","stars":5,"date":"2016-06-24","text":"The steak is really good here and I have to come back once again before I finished my trip in Montreal.","useful":0,"funny":0,"cool":0},
{"review_id":"BXmdY7qWBrzkbvXI10Q6YQ","user_id":"0YPdUJV5Lex9OiHt32XdIQ","business_id":"iA8Ve2sZKN5Vz3mYKrtCaQ","stars":2,"date":"2010-12-01","text":"got take out. nothing to write home about. i guess everything is relative, but this food was less than mediocre... sorry.","useful":0,"funny":0,"cool":0},
{"review_id":"V8-exiXirxKwshtnvZxqZA","user_id":"8HFAnnpgdOyQbSwCU8GclA","business_id":"K6fYrrTorlpXmqutRcrHzg","stars":5,"date":"2011-04-05","text":"The food was AMAZING! I got the steak \"hand-held\" with a homemade bleu cheese sauce. It was unbelievable and the beer selection was great. If you get Mac and cheese and like heat, try adding just a touch of siracha sauce, two-thumbs up. The plates were moderately priced but a little steep if you were expecting pub prices, $14 for my sandwich. Good for me though I had bet my friend before we went in about the quality of food and I WON!! the food was great, wish I had a local bar like that in my neighborhood","useful":0,"funny":0,"cool":0},
{"review_id":"KIiQWswrHJktBsdOYYI1ng","user_id":"4xBCeMU8RUQWhFOGmU_JSw","business_id":"0AQnRQw34IQW9-1gJkYnMA","stars":1,"date":"2014-11-21","text":"Giving a star cause I have too. Sat for 15 min and wasn't even acknowledged. I told the manager and it seemed like he didn't care. I got out of there. Horrible customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"DnPEfsosyWY3Qb5fq-9m7A","user_id":"a132k6Km2eIZo-s1Px7MGA","business_id":"yEM0uGueLMBWRT7NLYMVnQ","stars":1,"date":"2016-05-31","text":"Truly the most horrific customer service I have EVER experienced in retail. Their return policy is horrible, everyone in the store acts like you are inconveniencing them by being there, and their store manager was so incredibly rude and unhelpful. I bought three expensive pieces of furniture for my new home, and every single one of them was broken in the box or was not constructed properly to put together. I will never shop here again.","useful":2,"funny":0,"cool":0},
{"review_id":"tHAgCklH79cdDV2WF51Etw","user_id":"P_81hAwNnAzrITeTaKO8ZQ","business_id":"9qcTpWYxrZrN13p1zAP6dA","stars":1,"date":"2013-11-23","text":"I saw the reviews and came to this place Idk If these people ever ate good Thai food but this was the worst Thai food we ever had..the meat and veggies were stale no wonder they were so quick..","useful":0,"funny":0,"cool":0},
{"review_id":"bboHmyG3GOpmfkpUfgOb9A","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"PYIwY8EqOyMLQG567xwVEw","stars":4,"date":"2013-08-14","text":"Nice place for casual Italian. Food is always good and they give you massive portions. All the staff have always been really friendly and quick with service.","useful":2,"funny":0,"cool":0},
{"review_id":"NxV92F0jeThZg88p_peVSw","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"cHTQwW-xsBVfuat5IL3dsg","stars":4,"date":"2014-08-02","text":"The food is good. The service has never been slow for us. It's great Pad Thai, Curries, etc. If you're looking for Thai food, and you're in Robinson, this is it.","useful":2,"funny":0,"cool":1},
{"review_id":"-gi91ZD5tLE357Wm3_bdzQ","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"vEwazCciremwBgkRJgfXtw","stars":4,"date":"2013-08-14","text":"Kiyoshi is always a good place if you're in the mood for sushi. Place is nice if you go in person, or they deliver which is even better. We've always had excellent food from them.","useful":0,"funny":0,"cool":0},
{"review_id":"2dxXXOY9RROl8RMC5l7FJQ","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"8MSzI-4KJHpGBLiILkrtVg","stars":3,"date":"2011-08-23","text":"This was ok. Not great but not horrible either. The sushi is good for a sushi fix, but I don't think it's as fresh as Saga normally is. The service was bad. I'm sure it was our section or something. But two tables that were seated after us were served before us. We're not that picky so it didn't bother us too bad, but it was at least 10 minutes before we got drinks. Other than that, if you're looking for a chain sushi place to get some ok food that will hold you over then this is good for that.","useful":0,"funny":0,"cool":0},
{"review_id":"CsJqzabQFNQ9ik_xSJ2Ykw","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"mJ3KbEz2fEMTGXc30cz9Aw","stars":5,"date":"2013-08-14","text":"This place has been a fantastic find for us in Moon! Pizza is awesome. Better than the other options around here. Same with the other pasta dishes. We would highly recommend this place. Delivery is quick. We've always been happy!","useful":1,"funny":0,"cool":0},
{"review_id":"F9mnLSkFbAgOIyqrmwhnkA","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"vSN3n35-3WPX3Ntf-X6jaA","stars":4,"date":"2013-08-13","text":"Selma's is really good, not BBQ pit-masters great, but very good for Pittsburgh. The pulled pork is fantastic. I highly recommend the Big Pig Wrangler (add a hot sausage to the pulled pork sandwich)! I see other reviews looking for BBQ perfection and this isn't it. But if you're craving some BBQ and living or visiting here in Pittsburgh, this place will do the trick.","useful":0,"funny":0,"cool":0},
{"review_id":"Cf9a7A51708CPQB6j5cN3w","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"oQDUqkRer00JcB6DDRNH5A","stars":5,"date":"2013-08-14","text":"This is my favorite place to eat real breakfast. No fake eggs. No garbage Sysco food. They have excellent pancakes and change them up throughout the seasons. The owner is fantastic. The food is fantastic. What else can I say!? The only bad thing is if you're not there early, prepare to wait because its tiny inside and everyone wants to eat there.","useful":1,"funny":0,"cool":0},
{"review_id":"-jZqccEkI3jEH1Oi9B1YrQ","user_id":"C01rKnHeu_ArbM8VoMc0Eg","business_id":"OSLNYVnB69k6zO9jYzRPuA","stars":5,"date":"2014-05-18","text":"I can't believe there's no other reviews on here for Hometown! This is the best pizza in the Moon area period. They are the go-to for us when we want awesome pizza. We do like some of the other options around here as well, but Hometown Pizza is by far the family favorite.","useful":1,"funny":1,"cool":0},
{"review_id":"rla2K3P4yiQF45uI3bqrCg","user_id":"o0cJ-VrzTYM2HuS8y-yRLw","business_id":"Owa9OedRZlYJ6bTLUGltSw","stars":5,"date":"2017-07-10","text":"These guys are awesome very nice and polite. Found out that last time I replaced my windshield through safelite they had broke the trim panels never told me about it ( I had gone to them on 4 separate  occasions all 4 times there was always something wrong). The guys here at advantage pointed it out to me and got me some new ones and put them on for me. Can't say enough good things about advantage not pushy in anyway nice and quick will be taking my car to them for now on. And I will be telling friends and family about them. Thanks again guys!","useful":0,"funny":0,"cool":0},
{"review_id":"bte10aI8FPiMKivuvfFA5w","user_id":"o0cJ-VrzTYM2HuS8y-yRLw","business_id":"crHxgy2flK271G5b3QjCbQ","stars":5,"date":"2017-07-09","text":"Been here a couple times now. I always have Dany cut my hair she is awesome very nice and easy to talk to and she knows what she is doing. I trust her 100% with my hair. Everyone that works here is great, everyone is nice makes for a great atmosphere. I live all the way in east Mesa it's worth the drive to come all the way to Lady Janes in Chandler.","useful":0,"funny":0,"cool":0},
{"review_id":"8OX8zfjDKUEcR3p_S1o-PQ","user_id":"-rLUJva8DAC8KYATiMLtdg","business_id":"EH86fhZPCGGpUC_mesjvcA","stars":4,"date":"2015-11-30","text":"Studio 3-26 was a great salon for my 13 year old niece! She wanted to go short and that's exactly what she received! Karen was her stylist and she was phenomenal! Very welcoming and sweet towards my niece! However, when we walked in another stylist was dying her hair and her kids and significant other were receiving haircuts from here when clients were waiting. A bit of time passed and all of a sudden another stylist started to fix his own hair up. So at this time, 2 stylists were doing their own hair. As time goes on, the male stylist starts to smoke his E-Vape IN THE STUDIO!!! The work they do is quite incredible, however they need to work on professionalism.","useful":0,"funny":0,"cool":0},
{"review_id":"X-doGP9rJ-QAm6wTvh-YpA","user_id":"rEk8yum4peo8JpNzTjZglQ","business_id":"4aPStPs9-_FgOh3HtoYUXQ","stars":5,"date":"2013-08-24","text":"The most excellent golf instructor is Shane Crosley. His goal is to make you the best golfer you can be. Within one lesson you'll be able to see an improvement in your game. Since I've been working with Shane I have improved every part of my game from driving to putting. He can help in anything you need to work on. Shane has great teaching  techniques that will help help fix anything.  Shane has been the BEST  addition to my game. He could be part of yours too.","useful":0,"funny":0,"cool":0},
{"review_id":"ZLTA1fHTLYV88m5rTiSONg","user_id":"zrmXHuYQSm9l5U7fpSzGLw","business_id":"dNuaZmTY7qqRN4glp7AVdA","stars":4,"date":"2015-01-11","text":"Out of convenience while staying at the Wekopa hotel, my wife and I dined at the Ahnala Mesquite Room thinking it a risk based on some negative Yelp reviews.  My wife had the Halibut and I had the Filet Mignon we both found our meals delicious, flavorful with a flair, and served hot!   The artisanal dinner rolls were piping hot and we particularly enjoyed the seeded rolls.  My Filet was well seasoned and covered with blue cheese crumbles that I crave.  The hollandaise sauce for the Filet and asparagus was a nice addition.  If you are nearby, take a risk but know that our gamble paid out a jackpot of a meal.","useful":1,"funny":0,"cool":1},
{"review_id":"pqb_AHWJ6anL8KJw_iRDJg","user_id":"3H9mRZ1BKkcrqM7QKeZ7hg","business_id":"DqwzURYszZ-pSNNxhAKNuA","stars":1,"date":"2017-06-14","text":"What a disappointment!  Bought a water lily on Mother's Day and it's not growing.  When I called about the guarantee, was told I never should have planted it that early so the guarantee is void.  When I bought the lily, specifically asked the clerk if it was OK to plant that day and he said it was.  Now they won't replace the plant because I should have known not to plant so early.  Tricker's, really?   They're living up to their name.","useful":0,"funny":0,"cool":0},
{"review_id":"mK9Z7wdt87Xv2Ov-xVDeHg","user_id":"ykP8KSxQJzg5akl05KXcVw","business_id":"cBoFYIJQztZNaNjMS4xmNA","stars":1,"date":"2016-03-16","text":"Absolute worst nail salon experience of my life, I will never go back. I urge everyone to choose a different place to get their nails done for the following reasons; firstly she gouged my cuticle super deep as soon as I got there, it was bleeding profusely, dripping down my arm and onto the counter (which she didn't clean up the whole time) and her response to this was to give me a curt \"oops\" then squeeze rubbing alcohol directly onto the cut. Next I told her I wanted the shape to be between almond and stiletto (so pretty pointy but on the shorter side) as I'm watching her file my nails I have no idea what she's doing; she finishes and they're all oval. After phrasing it about six different ways she finally got that I wanted the tips sharper which prompted her to roll her eyes and say \"that's not almond\" uh yes it is. As she was refiling them she messes one of them up and has to take the whole nail off and start again from scratch! The whole time she kept forgetting about the open wound on my hand and would buff and file right over it (which hurt like a bitch) which caused it to rip open again bleed more, I barely even got an apology. Next was the colour fiasco, upon arrival I had chosen a lilac colour with a light pink for the accent nails, she paints the ring fingers first then when it's time to move on the lilac she discovers that it's dried up so she gets up grabs a totally different purple off of the shelf and just starts painting, I grabbed my hand back and asked if I could choose a different colour which prompted an explanation about how the lilac was old, which I already understood I just wanted to choose something totally different. So she throws the chip wheel at me and says \"hurry up\" now I was already at the point of trying not to scream or walk out before and that almost tipped me over the edge (she even pointed out how I was sweating, well yeah I'm trying really hard to not have a freak out) so I pick out my other colour, a grey, so she goes to retrieve it, she comes back starts to paint my nail and it's an orange colour?!? I ask about it and she replies \"oh that colour was discontinued this one is the same number though\" can somebody please explain to me how that makes sense. Yet again I ask to pick a different colour which got a similar response as the first time, finally I pick out a different grey and she finishes painting them. Once that was done she refiles my nails after the polish was already applied(?!) I almost asked to speak to the manager after it was all done but I just wanted to get the hell out of there so I settled up (it cost about $20 more than the usual place I go) this whole time I was perfectly polite and externally calm I even tipped her a little bit because as a server I know what it's like to rely on tips. I only went because this place had such good Yelp reviews, so I feel as if it's my duty to save anyone else considering this place it's worth 0 stars and as a veteran of acrylic nails I know when things aren't right. As a bonus not even two weeks later I had a nail break off, ridiculous.","useful":6,"funny":0,"cool":0},
{"review_id":"dicOVEe-9bPSEfqB1x-27A","user_id":"Z1EkfE0FnO_cRXzONymxvA","business_id":"ZCzey5aPhd7jYIoHsUfjmQ","stars":5,"date":"2017-02-19","text":"Excellent food and service very friendly servers would seriously recommend the tuna chips and soft buns.","useful":0,"funny":0,"cool":0},
{"review_id":"H1iP9Da8EjI29bhVr-j_dA","user_id":"_2qsWUeMwqDliDz4RZuOTA","business_id":"BLwopwKT4lr50nAo1G0DAA","stars":3,"date":"2017-05-07","text":"The desserts were OK. The thing I doubted was they said they serve desserts with fresh fruit but my mango sago tasted like frozen mango. It's was sweet but I can tell from the texture of the mango that it's frozen before.","useful":0,"funny":0,"cool":0},
{"review_id":"XcGbHUqS8VmgbyC0KK-xFA","user_id":"U4LSfz15NClymkPVSXhSAA","business_id":"TgmATA24L3CTDn98c24RAQ","stars":4,"date":"2010-09-16","text":"Found the best scarf of my LIFE here! Which I've since lost, but everytime I'm in Phoenix or Wherever there's a Buffalo Exchange I like to stop in just for fun!","useful":0,"funny":0,"cool":0},
{"review_id":"gE38Q69oDJbp5EzrpP32mw","user_id":"YHqaaRRptjV33H_npjKO1A","business_id":"sY6hLHFn7oMpod8s0To6DQ","stars":4,"date":"2016-08-09","text":"Very clean and I love the snack\/food options. Makes it an easy stop for road trips. I just so happened to buy something a month past expiration so that was a little disappointing, but I guess it's my own fault for not checking. Other than that I have no complaints.","useful":0,"funny":0,"cool":0},
{"review_id":"JRC8wpdCe35xRweZE7vQEw","user_id":"YHqaaRRptjV33H_npjKO1A","business_id":"0FUtlsQrJI7LhqDPxLumEw","stars":4,"date":"2016-08-08","text":"Good food and the manager there rocks. She walked around and made it a point to talk to everyone. The building however can get a little crowded but it's a hotspot for Gilbert so it's to be expected. Overall it's a cute place to take the family!","useful":2,"funny":0,"cool":0},
{"review_id":"UGfHqmClg67wEoYVds9PNQ","user_id":"YHqaaRRptjV33H_npjKO1A","business_id":"ZP9W5gdd2WVzJcDbT9hcWw","stars":5,"date":"2016-07-26","text":"The technicians are all very kind and friendly. The building is spacious and clean. I always get my puppy's nails trimmed here and I haven't been disappointed. Would recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"6C0El0umFFoV6u3JUyg2Lw","user_id":"_vJOnMTXV5fyVkKO1ICO-A","business_id":"opNfFJBzC3jX_1RnADy7-Q","stars":5,"date":"2015-10-01","text":"What appeared to be a minor fender bender turned into a bit more. I originally took my vehicle to the insurance company recommended collision 'experts' and was told it would be $600.00. Figuring this was ridiculously low I took it to Sudden where they concluded the damage was more extensive and proved it to the insurance company (over $2000). They treated me how a customer should be with patience, respect and excellent service...from taking me to the car rental company and waiting until I had the key in my hand to a excellent repair with a extra repair throw in at no charge.","useful":0,"funny":0,"cool":0},
{"review_id":"Arb3jd8Sn2OL7KR9kQ8FtQ","user_id":"_vJOnMTXV5fyVkKO1ICO-A","business_id":"jdAdf7keZac1idbgNKG2pw","stars":1,"date":"2017-01-08","text":"Went with my daughter tonight and was refused due to her under the age of 21. Both employees were very gracious in explaining the NV law and offered for us to wait in the foyer if we wanted something to go (which we didn't). A few other reviews mention the smoky atmosphere which it true but again not there fault since that's there decision on how they have licensed there business. Vegas could use a family friendly Stieners because there food is consistently excellent (on all my previous visits).","useful":0,"funny":0,"cool":0},
{"review_id":"IfgnHg6zQEbNGKYVcfYWtg","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"vHt0CSynqesXox-9nBj7uA","stars":2,"date":"2010-04-02","text":"If you want a good Margarita you will love this place and their Guac live is really good too....I agree with the other the food needs some help but if you like Margarita's and Chips and Salsa this is the place to go...","useful":0,"funny":0,"cool":0},
{"review_id":"JQR9PRDcnFSr6doIcg28rQ","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"j_PL_u4SWW1LoEd2dCu0Iw","stars":4,"date":"2010-01-07","text":"One night i was craving pizza \"chicago style\" and remembered driving by this pizza place and it had recently opened.  There were quite a few cars there so i decided to stop and give it a try.  It is very nicely decorated, staff greeted us right away.  There are TV's in each booth so you feel like your at home.  The Pizza was to die for, we absolutely loved it and it is now our weekly stop.  You won't be disappointed!","useful":1,"funny":0,"cool":0},
{"review_id":"Py2FavMaxS9CK1HYRZIQDg","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"rVi34tu0bITsoxMMT9QhUw","stars":1,"date":"2010-01-07","text":"This was the worst Smoothie i have ever had....runny, no flavor and overpriced for what you get... Don't bother...Save your money!!!!","useful":0,"funny":1,"cool":0},
{"review_id":"FYM6wykuFGnkfCY9g6OKnQ","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"VbrGaAmb4CJOL5oLsj2VsA","stars":4,"date":"2010-03-31","text":"I  recently wanted to go to a buffet and decided to try Pacific Buffet it had recently opened in our area...i was surprised on how many different food options were at the buffet, and the food was good.  You should give it a try you won't be disappointed.","useful":1,"funny":0,"cool":1},
{"review_id":"YjjyHV_wlmxPA7FDU4SmBA","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"VGVs7NlTnZYQfh7uuVllfw","stars":5,"date":"2010-09-11","text":"I LOVE THIS STORE !!! If you love to decorate this is the store for you, they have such a variety, and so much to choose from you spend alot of time in there because you know your going to miss something!  Very good prices too...Have fun","useful":0,"funny":0,"cool":0},
{"review_id":"2RbH3Ly_vWeH-OtylfMdyw","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"XqKJ6PHxt7fbUptQe_SJcg","stars":5,"date":"2010-03-17","text":"My daughter and I love this place. Let me say that again: we LOVE this place.  It is the coolest thing since frozen yogurt.  I just found out there are different classes, and the latest one is cake decorating.  Never in my mind did I see myself use fondant...but here I am now.  I've make flowers, animals, and figurines.  And it's not just a one day course.  It's once a week for several weeks.  They start you out on basics and each week the techniques get more difficult.  The fondant days are the last days.  I can't wait until my next class!","useful":0,"funny":0,"cool":0},
{"review_id":"ft4gj88irDqsY2y0Sow_2A","user_id":"5qz4ICJWJNAEt-vl5yHq_w","business_id":"ozEDKl0tZw5ob1evx41gcQ","stars":2,"date":"2010-03-31","text":"I have been going to the Draft House for many years and have always enjoyed the food and the experience, but lately the food hasn't been that good and the new staff in the dining room has alot to be desired.  They were unattentive, gave us the wrong check, had to beg for a drink refill, and were pre-occupied with something else going on...not a good experience...very disappointed","useful":1,"funny":0,"cool":0},
{"review_id":"fus9odxu9bjE2lSxfwNfdw","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"ziv21pDfyrgdhlrlNIgDfg","stars":5,"date":"2016-08-11","text":"Get this!!!  Wow Karlo is amazing and best customer service you could ask for. He installed the antenna and set up all our tv's along with excellent detail explanations and conversation. We will be having my moms house done now next week also. The recoup savings from not having cable is only a few months. Already feels like we are saving money.","useful":2,"funny":0,"cool":0},
{"review_id":"NoHIRjactw4XGlVPP6bDKA","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"YulFeohJQz8ECCuxopF3NQ","stars":5,"date":"2017-02-10","text":"Best dental place ever they are so nice and when I told them my teeth were sensitive they paid attention and did a fantastic job. Our entire family goes there and I would highly recommend going there they take all types of insurance. I am the biggest chicken when it comes to going to the dentist and they made the experience wonderful.","useful":0,"funny":0,"cool":0},
{"review_id":"iepaFoVdFQQUEUC086Kxtg","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"_mUA8LjS5fQUk0oKT6u3NQ","stars":5,"date":"2016-10-03","text":"Working with Shawna was great she was able to narrow down what we had no clue of what we wanted and we had to choose between three and absolutely loved and are enjoying our new bed. We never realized the sleep would be so much better. We would highly suggest going there.","useful":0,"funny":0,"cool":0},
{"review_id":"OwYOiB_jFeL61pAdTPb7og","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"igHYkXZMLAc9UdV5VnR_AA","stars":5,"date":"2017-02-10","text":"Best bacon lettuce tomato sandwich ever services beyond great. We really enjoy sitting out on the patio in the open air. Lunch today there was great be sure if you're going to dinner there to make reservations.","useful":0,"funny":0,"cool":0},
{"review_id":"azzTniVKGTNg75XGyhPLjA","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"PtwW1Hwme8Y0wy54zNr8Xw","stars":5,"date":"2016-09-02","text":"Food was great service was excellent love coming hereand definitely will be coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"P3kenbyDsp3U2mPJNJONtQ","user_id":"ywjqPgnMrDZKOhA33v92Cw","business_id":"nJcyfIRGbI31EGLzillWYg","stars":5,"date":"2016-07-31","text":"Went there Friday evening. Food and service was excellent and presented better than most other celebrity restaurants. The karaoke mc made the place even more fun. We are locals and will go back. Btw thank you for no parking fees for anyone","useful":0,"funny":0,"cool":0},
{"review_id":"apeavIGMjBU2Db-V7tZwVg","user_id":"TNCWteunmA8LeNDVz3LjZQ","business_id":"6e1N3RKO3Q-5zb8lX0SyCg","stars":5,"date":"2017-08-22","text":"Had such a great experience at Men's Wearhouse. When we walked in, we were greeted by the manager who was very attentive and paid attention to what we were looking for. He left us alone when we were browsing and helped when we were looking for sizes. \nHis name was Jeffrey Demoure and was great. \nWhen he found out that my husband  was a police officer he very respectfully shook his hand and thanked him for his service. When we cheeked out, Jeffery gave us a discount for my husband's service. It was really sweet and we will ABSOLUTELY go back again","useful":0,"funny":0,"cool":0},
{"review_id":"yM9WN719mLif7itUtKG7rg","user_id":"c33cdBkD2tTGnGA1OeNYUg","business_id":"8xsuDn0EjpyFFBjdckkNHQ","stars":5,"date":"2017-05-11","text":"Larry and Akilah are wonderful to deal with. They are professional and friendly. When moving it became apparent that we were going to need an additional unit. I called Larry when the moving guys were just about done loading the truck. I ran over there before the truck arrived. Larry had all the paperwork ready and I had lock and keys in hand as the truck arrived. Larry and Akilah made a stressful situation much better.","useful":0,"funny":0,"cool":0},
{"review_id":"oCSkhKEcGyCTEloBlBo3RQ","user_id":"aJVwhGMTz4fy_pRYBV86Jw","business_id":"kj1p6NwUGROOoqNySf0I1Q","stars":5,"date":"2016-08-08","text":"I came here for lunch after reading previous reviews, and now I'm hooked! I come here at least twice a week now and love the salad and soup bar, as well as the red curry. Delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"wgpOyUNO9IC62E57vgX63Q","user_id":"Z96V4b63J1yrjS2D5Ondnw","business_id":"cKdox2gt3L1Dbb7MpOPdWg","stars":5,"date":"2011-03-25","text":"I was on a business trip in Montreal and I made reservations for dinner 2 weeks prior. This was my first visit to APDC and the place was just buzzing with energy and the sweet smell of pork. Order the bison tongue as an appy and it was outstanding.  My friend had the seared foie gras and he kept rolling his eyes in delight. The bottle of wine was a beautiful Cote du  Rhone Quartz which paried very well with the meal.  For main, I had the maple pig's foot.  The presentation is shocking... the whole trotter in a cast iron pot with all the trimmings.  The taste was insane.  Skin was sweet and crunchy while the meat was juicy and savory.  The mash potato at the bottom soaked up all the essence from the dish. Very indulgent.  Brought 2 cans of duck in a can and flew them back to Vancouver.  Split one can the next night with 4 senior citizens and they were very impressed.  Gave the other one to a friend and she had hers 2 days later and it was still amazing.  Verdict:  These cans do travel so long as you keep them cold.  They are good for at least 3 days.  How do they stuff all the duck and foie gras with all the tirmmings in a small can?","useful":1,"funny":0,"cool":0},
{"review_id":"8bCuZoBHY5boMtRwA0k1bg","user_id":"Z96V4b63J1yrjS2D5Ondnw","business_id":"2S9t90Q0qZWCV7X_u0rxZQ","stars":4,"date":"2011-03-24","text":"I'm from Vancouver and have tasted all the ramen shops from Kintaro to Sanpachi.  Vancouver provides a wide array of ramen shops within a 1 mile radius within the downtown area.  While on a business trip in Toronto, I went in Kenzo for a late night bite and ordered the Tonkotsu ramen.  The noodles were cooked perfectly and the soup was steaming hot and had lots of death.  It was every bit as good as the Vancouver ramen shops.  Very impressed.","useful":0,"funny":0,"cool":0},
{"review_id":"T2R9o67SoI7W_7XkLoEiAQ","user_id":"Q_SfPRF8DjAdZuLSPbctgw","business_id":"AJWrjfJ0GcR5ar2oU4gbow","stars":5,"date":"2013-10-10","text":"Excellent!!!! He came to my place and detailed my Yamaha R1 an my dirty super moto husky.  He did such a great job. The kind of work I thought only I would do with my own bikes.  I usually do them but sometimes life gets busy. It's nice to know someone takes the time to do every little detail I do. 100% happy and will use and recommend him over and over :-) \n*A true ride so he 'gets it' ;-) thank you!","useful":2,"funny":0,"cool":1}]