[{"review_id":"ZmCqrAfD9PQjkcCqv7xaHw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"4Fylkp8eS2FD9-53eycqLw","stars":5,"date":"2014-09-02","text":"My Grandaughter Haley and I went here for dinner while shopping in the mall. We love the atmosphere and the Sushi. We had the catapillar roll and chopped salads which were huge and delicious.The service was friendly and quick and we always enjoy this place.","useful":0,"funny":0,"cool":0},
{"review_id":"_wMUPWh80A1lH8nuCl8NUQ","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"dNr7VKRti8dXWE-jzfVBtQ","stars":4,"date":"2014-05-07","text":"The Perch......... Love the restaurant outdoor patio and listening to the birds.I had a good bacon burger as well. The service was quick and our waiter kept the tea coming.I would recommend for meeting a friend for lunch great place.","useful":1,"funny":0,"cool":1},
{"review_id":"CFc5tWD7iKigm_DbYzpCGg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"iJi7yebXoPVXRyGqqL-v8g","stars":4,"date":"2013-06-26","text":"This is  great casual wine bar to have a drink and the food is very good  as well!!nThey have outdoor patio area which is nice in cooler weather. The prices are very good here and great for a date night or meeting friends! Its in Old town Scottsdale area which we love. They have couch and chairs to sit in as well inside.","useful":0,"funny":0,"cool":1},
{"review_id":"j4jAXG2x0vQsT4zfsAhBvA","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"9lH0gzlZB_uXJ1dc9UkF5w","stars":4,"date":"2013-11-30","text":"This place is fun and has Great Ribs they are tasty and melt off the bone! We had the sweet potato side with marshmallows and it was delicious!! We went here on Black Friday for dinner and it was packed but well worth the 40 min wait! We didn't have reservations so would recommend them next time. Our server Brittany was excellent and kept our drinks refilled without asking her.  We will go back again for sure.","useful":4,"funny":0,"cool":1},
{"review_id":"Z6V_F_siHiws4mw0xRb_zA","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"YQFcxE9UXrKc-QuTUu7twQ","stars":5,"date":"2013-11-16","text":"I Love this casual fun place. The lobster tacos are delicious and reasonably priced as well. The service was great and quickly served us on a business lunch!","useful":1,"funny":0,"cool":0},
{"review_id":"FCgXibAlRHUfy41S3pzfhw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"vdZOiZH9sTseyll44waMuA","stars":4,"date":"2013-06-26","text":"Macayos has great Lunch time Specials! I had the Chicken Fajitas which comes with sour creme, guacamole and salsa and only 9.99! They were delicious! They also make very good Magaritas with different specials!The atmosphere is very Rocky Point and we love the decorations very festive!","useful":1,"funny":0,"cool":0},
{"review_id":"D5YhgezTuOhxnoe_yprmbA","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"QSGerT1enEKlvJnYkwthHQ","stars":4,"date":"2015-01-17","text":"We love the atmosphere at Claim Jumper its like a Rustic ski Lodge in Colorado but in AZ.The food here is excellent and the portions are large I had the Tri Tips with Coconut Shrimp which was delicious.The Waitress seemed a bit overwhelmed as she had a very large Party seated by us but she was very nice and got us what we needed.My Husband had the Steak and it was great as well.","useful":0,"funny":1,"cool":0},
{"review_id":"7QibJdJJn4o5yrN3vpXxlQ","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"orMlHMLyHSldYgzfFTaeoA","stars":2,"date":"2015-04-05","text":"We came here for dinner with high expectations and unfortunately  it did not live up to its reputation. The Restaurant had a nice atmosphere however the smoke coming from the kitchen was very irritating to our eyes. The food was Ok but not great.  I had the Scallops and my friend had the Sea bass.. The seafood wontons were Very good.We met Eddie at the door and introduced myself he was barely cordial and didn't come over to the table at all to see how our food was or say hello!","useful":2,"funny":1,"cool":1},
{"review_id":"Qkh3eRLmwyv_9hkHXeJYIg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"dSnQTUJC0tCHadU1AGzvrw","stars":3,"date":"2015-01-11","text":"We came here for dinner and were seated outside on the patio which had a great view of the greenbelt at Grayhawk.\nThe salad was very good was Quinoa with Shrimp  could have had a few more shrimp however it was very good.The server was nice but was a little slow in getting to us.","useful":0,"funny":0,"cool":0},
{"review_id":"qoU0VYuLeZ7iM5mpLCFbCg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"_3A2Rhz996JPvxQ9vBAbJQ","stars":4,"date":"2013-06-26","text":"This is a fabulous wine bar and they have a great selection of wines to choose from! the Pours are on the generous side and the cheese and fruit plate was very good to go with it. The atmosphere is casual and has couches and chairs and outdoor patio to sit on! would highly recommend for date night or meeting friends for a drink!","useful":0,"funny":0,"cool":1},
{"review_id":"pCk1RiA2MFHsNf9f5-4dow","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"5diHqpk_JSC4p8tIo4APow","stars":4,"date":"2014-12-30","text":"We stopped in here for Dinner and were able to get a seat right away on the patio! There are heating lamps out there so was not chilly at all. We had the crab cake appetizer and Loved it was cooked crispy and delicious. I had my favorite salad Which is the Luau Salad and is a huge portion! Haley had the club sandwich and was excellent as well.","useful":0,"funny":0,"cool":0},
{"review_id":"F-UH8mVrG2Azb66eBLY59w","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"MItBn_LArS9O_CvDnIHCVw","stars":4,"date":"2013-06-26","text":"Verrado grille has amazing fish tacos and we always sit out on the patio with an amazing view of the Golf Course! The service has always been very good and the prices are reasonable especially for being on the Golf course! The inside dining area is very nice as well with a great Bar area. There are Tvs so you can watch sports as well.","useful":0,"funny":0,"cool":0},
{"review_id":"oDaoE2Zt-SSXAHeJXN_3zw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"v4qyBRpTBvOO55M4IAqNNg","stars":4,"date":"2013-06-26","text":"I found this place by accident its in a strip mall with AT&T and some time to wait for my phone so went over to eat lunch! I had the Chicken Teryiaki Bowl which was a very large portion and very tasty. The atmosphere is very pleasant and a little on the darker side but we enjoyed it! They have a large selection of cocktails as well.The service was very good and will go back to try the sushi next time.","useful":1,"funny":0,"cool":0},
{"review_id":"fT4XhvP5TpUssDm7ojiWUg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"_ZKsdEkQ5K_CUSBtahjFAA","stars":4,"date":"2013-12-20","text":"We stopped here for dinner after my car broke down and had it towed. The service was very efficient and friendly and we were seated right away. I had a salad their Mediterranean Chicken which was excellent and very fresh tasting. The bread was served warm which we love.So great place to go for dinner .","useful":1,"funny":0,"cool":1},
{"review_id":"QSpHGGvIJGHFwJOE5SFpUQ","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"U9KZ-UGbdee4lpegNH0JnA","stars":5,"date":"2012-12-04","text":"This spa is my favorite In Scottsdale Az. The pool and jacuzzi area is beautiful with a view of  the Mountain and hillside homes. The food is excellent and the service was great by the pool! My daughter in law and I go every year and we have a great massage and girl day!!! highly recommend this spa.","useful":0,"funny":0,"cool":0},
{"review_id":"UOmBdqS2jeXSuCtCoUOe1A","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"ss3Fb0UCBkOZtq7D4c4Q_A","stars":5,"date":"2014-10-18","text":"I went here with a friend for dinner and we had a great time! The food was delicious .I had the Lobster Ravioli and it was perfect! My friend had the Eggplant Parmigana and I tasted hers and it was so good.We shared a salad which worked out perfectly. The atmosphere was very nice and loved the white tablecloths. The service was excellent and our waiter was so attentive which we liked.","useful":0,"funny":1,"cool":1},
{"review_id":"4p9eGpk26XrlUctgcjn0Mg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"dPGs5b0N9MarZjVgQVelGQ","stars":4,"date":"2013-06-26","text":"I love this place its got Morrocan Atmosphere and the food and service is very good! I love the variety of choices with a huge menu! They also have a Skinnylicious Menu if your trying to watch your calories. I had the Luau Salad and it was  Yummy with lots of ingrediants and very fresh tasting! They make excellent cocktails as well ! The passion ice tea is also very good!! They have amazing cheesecake choices as well.","useful":0,"funny":0,"cool":0},
{"review_id":"2Z7_Ks9x1IARQCKbDS-aFA","user_id":"OEqblm33X9ZETdIcG7EDXg","business_id":"NqYbcKMSe_WmEoj07Ke4zA","stars":5,"date":"2017-08-14","text":"For whatever reason, it seems that a good fade is impossible to find nowadays. I won't bother going to any \"chain\" salon (Supercuts, Sport Clips, etc) because they will jack up your hair. I've been bouncing around other barber shops and they are hit or miss. Bob's Barber Shop will NOT jack up your hair, and they are the only barber shop I will go to now. \n\nI've been there twice now, and received a fade from two different barbers (Zach and another fellow) and both times I was extremely impressed. The fade was smooth and gradual. They finished my neck off with a razor and warm shaving cream. The price was $13 ($12 for seniors) and I think that's pretty cheap nowadays, especially considering the service and quality of the haircut I received. \n\nIn summary, I'm glad to have finally found a barber shop that I can trust, and I would definitely recommend it to friends.","useful":0,"funny":0,"cool":0},
{"review_id":"1PDPRl_CdU3Ck5geCYs8zw","user_id":"BTp3nt2YuNaVk3gZAEeJeg","business_id":"G_5zQbGAFYYKD7vBEoWByg","stars":2,"date":"2016-09-26","text":"Up until tonight this place was one of our favorites in the neighborhood. We always order the same thing - Butter chicken, vermicelli and avocado smoothie. We liked the place because the food always tasted fresh and nicely prepared and we like that they use aluminum trays instead of styrofoam ones. Tonight we ordered delivery which took more than 40 mins.  The avocado smoothie was very dark and tasted so bad we couldn't finish it. Same with the food.. Butter chicken was bland and the beef in my vermicelli didn't taste fresh. Even the spring rolls were a bit off. Giving them a 2 star hoping it's just an off night they were having. But I'd probably will need to be pretty desperate to return to this place. Very disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"CO7MIiplC9-ME04e1VyqlA","user_id":"BTp3nt2YuNaVk3gZAEeJeg","business_id":"sDMgMEEZzcuLQj6VG15aDg","stars":2,"date":"2014-10-28","text":"I've never written a review before but my brief experience with this place was negative enough that I see the need to post this. I really didn't appreciate the way I was treated by the lady that answered the phone when I called the shop for questions and quote request. I've dealt with many other shops on similar matters but nothing as bad.\n\n I'm a freelance designer, and one of my clients was a non-profit so part of my job was to produce material at the lowest cost possible. I mentioned that we'd like to get stuff printed, would like to get a quote for the job and also asked if they offer discounts\/sponsorship for registered charities (Many print shops have community sponsorship programs, or offer at least a 15% discount to charities). Before I was able to finish, she simply blurted out \"Hold on, I'll transfer you to the person that deals with this stuff\" and then transferred me to, guess what, her own voicemail. And of course I never got a call back. \n\nI understand \"solicitation\" calls\/emails can be annoying. But not all are with bad intentions and I always stay polite and professional and make it clear from the start that we are not simply asking for freebies, but a honest quote so we can compare prices, just like everybody else would. I believe good customer service is to treat all potential patrons with the same courtesy, not just the ones that already have a chunk of bills in their hands. A simple but respectful \"Sorry, we are not interested at this time\" or \"Unfortunately we cannot accommodate\" or even just provide me with the quote that I asked for as a potential paying customer would have sufficed. Any of the above options would have taken  a few seconds and wouldn't have ruined someone else's afternoon. So, word of advice to businesses alike - things like that stick. I won't be considering this place for my future printing needs.","useful":6,"funny":0,"cool":0},
{"review_id":"Mr9g2YnKqoFbRXOGbeOTVw","user_id":"kiMxE8W-sx7Q8mr03dM9GA","business_id":"UfSwz2LHiVu0K6CJJ6-2gg","stars":1,"date":"2016-05-07","text":"Espresso was cold like the waitress. They prepare Middle Eastern food, I thought they would serve REAL coffee.","useful":0,"funny":1,"cool":0},
{"review_id":"yZ-flvT2T_1tGLTyGCInsA","user_id":"Ko27Z56JNFo5QmtO3CKhGg","business_id":"zoODlH40edpJYLPLkHilNA","stars":5,"date":"2013-08-03","text":"Love this place. The plush seating and big trays. This is what a theater should always be. I just wish the date I went with was much better. lol.","useful":0,"funny":0,"cool":0},
{"review_id":"lDifGTLtsnHOaQfnnM2rCw","user_id":"kLRo7Iu92LIwzNjCOsuZdA","business_id":"pyqnGlIfP9Zw8LLxBjyAiA","stars":5,"date":"2014-01-10","text":"The black cod miso was absolute delicious and they have a great menu. Sushi was excellent as well as the ambiance!","useful":0,"funny":0,"cool":0},
{"review_id":"pfXJ1rQbr9BSyJxqu2yeIQ","user_id":"9plIxXY0rBQNq0sbBoQuCg","business_id":"x67SU1vwwGsEngdhCxqfHA","stars":5,"date":"2011-09-30","text":"Wir waren nicht das erste Mal in der schönen Strausswirstschaft des Weingutes Raabe. Wie immer wußten wir, das wir nach einer schönen Wanderung uns dort niederlassen können.\nDas Personal ist sehr freundlich und berät jeden, der dazu kommt mit HInweisen zu allem, was im Angebot steht.\nBestellung und Bezahlung erfolgt am Tresen und ist unkompliziert, das Essen wird an den Tisch gebracht von freundlicher Bedienung....schnell und immer frisch gemacht.\nDie Ausgestaltung der Räume ist gemütlich und einfach schön.","useful":0,"funny":0,"cool":0},
{"review_id":"0W4evrnmTfxwOgv15rw5Mg","user_id":"arZho8RYAc83q7GFOe8NKw","business_id":"3sI_seI268r85-uyOmEyEw","stars":1,"date":"2016-08-17","text":"I wish I could give 0 stars.\n\nI placed an order for Overnight Print's \"Fat Business Cards\", which I've purchased before without issue. This time, however, the cards that were delivered were completely defective. I honestly can't believe the company would actually deliver such a low-quality product. I assumed my order must have somehow slipped through quality control, but after corresponding with a sales rep, it became apparent that the company simply didn't care. \n\nI provided photos of the cards I had received, showing that they were not at all close to the design I had submitted, or the proof I had approved. The cards were printed so unevenly, with borders completely crooked. The mistakes aren't even consistent - some cards are only slightly off or marginally crooked, while others are completely off. \n\n\nUnfortunately, I was told this horrible mis-printing was due to \"customer error\", and provided with a list of a dozen or so possible reasons the cards turned out this way. I'm a designer, and am not unfamiliar with file prep, printing and cutting margins, etc. My files were fine, and prepared using the template provided by OP itself. How could this possibly be \"customer error?\" Especially when the mistakes were all over the place. Furthermore, the proof I had approved before confirming the print job looked perfect - nothing like the delivered product. \n\nMy repeated, polite requests for a refund for eventually denied and OP failed to take any responsibility whatsoever for their unacceptable product and service. Needless to say, I won't be purchasing from them again.\n\nOvernight Prints - please do the professional and ethical thing, and issue me a refund.","useful":9,"funny":0,"cool":0},
{"review_id":"KE4Bk9qHcqBK50-ANIDQcQ","user_id":"NkV_Dg19t00ojGcoqSepQg","business_id":"PVRzxFHHBavqCl3UQYr6UA","stars":5,"date":"2009-04-21","text":"This mattress store is amazing! The beds are to die for and they are eco friendly!  \n\nThe sales staff are not pushy at all and they offer free delivery and the beds are infused with green tea! \n\nForget Sleep Country they have nothing on KEETSA! I am so glad they are in Toronto!\n\nI also have to add that I went back to arrange a delivery time and they asked me what time was good for me! They are coming at 10am. That is right folks! AN ACTUAL TIME! They will call first and I don't have to sit around all day waiting for a 4 hour window of time to pass.","useful":2,"funny":0,"cool":0},
{"review_id":"kv9TwUWoC4XkYvSuXAdUVg","user_id":"OYxNi0nlDXXb7w7W2Csc-g","business_id":"4kEltHsRKYhcX73mmqHBwg","stars":1,"date":"2012-08-20","text":"If you stop here, make sure you watch while they scan your items.  This is my final visit to this place because something ALWAYS is mispriced, or I grab an item that was placed in an incorrect location, so it is obviously not the price I expected.  Staff is then rude when you ask for a correction in the price- as if it is my fault.  This never happens at other stores.  Being a city with a lot of competition, these silly errors can not keep happening, or else the place will have even less customers.  Very disapointed for the final time.  Oh-one other fine fact.  Be sure to check your expiration dates....have bought expired product there more than once.","useful":0,"funny":0,"cool":0},
{"review_id":"i2wo7Af3_ytP29ZN7dXcMQ","user_id":"OYxNi0nlDXXb7w7W2Csc-g","business_id":"RMEzxhYfpnEsWlfozit_xw","stars":4,"date":"2012-11-29","text":"I really enjoy visitng the Ale Asylum with friends for causal drinks.  Love the beer and have never been disapointed by the food.  That is the main point of going out, there, right??  Well, this last Friday night was some what of a different story.  Everything was fine, except for our server!  We were sitting on the bar side of the tasting room, at a large table, and after I got my first beer, I asked if I should pay now-- just out of convience to the guy so he didnt have to run 8 seperate tabs.  He replied in a VERY condescending tone \"Um... this is called table service.  Im running a tab for the table.\"  Oh. Excuse me. Being in the service industry myself, I just let that one go./  A while later, my friends and I ordered another beer, they ordered darker beers and I ordered the lighter style (which I might add, is just as tasty as the more hearty styles).  Upon returning with the beer-- the \"friendly\" server proceeded to tell us (in the same condescending tone)  that I ordered the beer for \"People that dont like beer\".  Is it just me, or should a server not bash the product he is selling--especially at the place the product is made???  Its been a week and i am still confused by this guy. He either had it out for me, has no respect for his tipping customers or just woke up on the wrong side of the bed.  \n \nI will be back to the Ale Asylum for sure, but will steer clear of this guy and his tables, unless I feel the need for a little bash to my self esteem.","useful":1,"funny":1,"cool":0},
{"review_id":"uqE2BX7SefWmAN_6jaOWvQ","user_id":"682VeWf1PPJx1zKgVIXgkw","business_id":"rTS8LsUmNIiXsXydE49tPA","stars":4,"date":"2014-06-01","text":"Great atmosphere,  reasonably priced drinks, bartender hooked it up in the tequila & sprite drink","useful":0,"funny":0,"cool":0},
{"review_id":"FR0gsKousMFe2fPEBf4erw","user_id":"682VeWf1PPJx1zKgVIXgkw","business_id":"7dHYudt6OOIjiaxkSvv3lQ","stars":4,"date":"2014-06-01","text":"Good quick burgers not sure about all the hype but just like every regional thing. Will definitely eat there again.","useful":0,"funny":0,"cool":0},
{"review_id":"Kh4FwXn0JVrdB2nM58z59Q","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"iKMLsX1Je7P3wAOEc9scDg","stars":4,"date":"2014-11-13","text":"I have been a couple of times recently for drinks at the bar and had a really great experience. The bartender was a lot of fun and made our group a number of custom drinks. The other people seating in the bar section were relaxed and unpretentious, which was a nice surprise. If you are into tequila then definitely try the Clase Azul reposado.","useful":1,"funny":0,"cool":0},
{"review_id":"Yz4ITwA_3rOa5ENwxnEJsA","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"3glVZZh_vyZH1VvPU0307A","stars":5,"date":"2014-12-14","text":"This place really deserves it's reputation. It was my first time and I took my marketing staff for a holiday dinner. It was a comfortable, friendly atmosphere with very well informed staff. The food was excellent. \n\nWe shared 3 starters, plus their killer homemade bread. The pecorino sausage was the best dish, followed by the arancini. The tuna was okay, but not was stand out as the others. \n\nFor a pasta course we shared had the Orecchiette with squid. I really enjoyed the dish, especially the pasta. The others were not huge fans due to the saltiness of the capers. All the better for me!\n\nFor the main we did the ribeye steak. It was perfectly prepared medium rare and seasoned nicely. We also ordered the potato and rapini sides. Was not a big fan of the potato dish. \n\n  We certainly over ordered for 3 people but the experience was great. Would highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"6uYF-pdwFXkdV6EIOT803Q","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"L-nONdIDx9xjB_R9Rn85gQ","stars":4,"date":"2014-11-25","text":"A big fan of this store online and was very happy to see a permanent store in Toronto.\n\nI have been to the store a couple of times now for the Stumptown coffee. If you have not stopped in for a coffee yet, definitely check it out.","useful":2,"funny":0,"cool":2},
{"review_id":"fi1WmzoC7NS3MYkNbnVQlA","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"XT25YpQoNDuzAZHur-HZ8g","stars":3,"date":"2014-11-25","text":"The design of the newest Libretto is very nice. The ceilings are high and the room feels very spacious. The bar is very impressive with 8 beer taps coming out of a wall of marble.\n\nThere is a large area outside the restaurant that I really hope is going to turn into patio this summer.\n\nThe pizza is trademark Libretto. Our group shared the cremini mushroom and the cacciatore salami pizzas. I preferred the cremini with the rosemary and gorgonzola adding a strong flavour punch. The negative with the mushroom pizza is the crust tends to get a bit mushy. \n\nMy friends had two salads to start, the beet caprese and the arugula. Both are pretty generous sizes and my friends said they were very flavourful.\n\nA negative is the cost of the beer. A 14oz pour is $7. This is the reason for only 3 stars. I think 16oz would be a bit more reasonable, if not 18oz. I get that the location is in the financial core, but that still seems overpriced.","useful":0,"funny":0,"cool":0},
{"review_id":"uo6AfNXWtrDJ2c7-R_6Lsg","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"-PL-4fFYPYrOjnNd0lO4Lg","stars":5,"date":"2014-11-14","text":"This place has a great craft beer lineup with mostly Ontario breweries, and a couple from Quebec and internationally thrown in too. The bottle and can selection is pretty interesting and worth checking out.\n\nThe bartender was very good at helping me choose something different from the bottle selection. I ended up going with Derniere Volonte from Quebec's Dieu du Ciel, a really interesting Belgium style beer.\n\nThe menu is your standard comfort foods. I had the lamb burger which was good and the kettle chips were a nice change from fries.\n\nThe atmosphere is very relaxed and comfortable. There are three different sections to the bar so if you are looking to watch the game head towards the back where there are a lot more TVs.","useful":1,"funny":0,"cool":1},
{"review_id":"WZEM9QVNXhqYs7v22krG5Q","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"k6zmSLmYAquCpJGKNnTgSQ","stars":5,"date":"2014-11-13","text":"Wow, this place rocks. The fried chicken is amazing and the baked beans are so good. I had the their homemade lemonade too. Make sure you sit at the bar to watch the magic, but be warned your clothes will smell like fried chicken, which is not necissarily a bad thing.","useful":1,"funny":0,"cool":0},
{"review_id":"X0WpFCvs5Uakidl8blCgtQ","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"BsFAotQQE1yRVVJEDADaJw","stars":5,"date":"2015-09-13","text":"Wow, what a place. Very good small plates that are executed well, and the right flavour profile. The cocktails are also outstanding, and the staff offer good suggestions and customization. I will be back very soon.","useful":0,"funny":0,"cool":0},
{"review_id":"odNkuHsdCBoFQ9C82yeqmA","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"9tfw-OEfpF0qC2hSzRks6g","stars":4,"date":"2014-12-03","text":"I am a big fan of this place, especially with the renewed focus on the menu. In the winter the the pub is very cozy and relaxed, a nice place to spend a coupe of hours with friends. In the summer there is one of the best patios in the city that lets you watch Church street walk by. \n\nThe beer selection is solid with a number of local and international craft beers on draft. There are also a number of excellent bottles. The mixed drinks are good, ask for the Glee made by David for a fun multi-colour drink.","useful":1,"funny":0,"cool":0},
{"review_id":"bmLbi3PHNugdsBdNu2zDkQ","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"EKeck5myBgPqy2ShyGEjHw","stars":3,"date":"2014-11-14","text":"I like this place, but only for a beer or two. This is not a pub where you can sit for an hour reading a book. But if you are looking to get your drink on in a very relaxed environment with an interesting mix of people then AAA is your place.\n\nIn terms of food I would recommend the chili. It is traditional, only beef and sauce. It also comes with a bowl of tortilla chip.","useful":0,"funny":0,"cool":0},
{"review_id":"PyJX6PFjJZuGpvBWyUCSMw","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"U6ZPS03Nnm-peYC0q_bV6Q","stars":2,"date":"2014-11-25","text":"I am conflicted with this review. I like the laid back atmosphere, a place that anyone can just hangout. There are a couple of big sofas and tons of books. There is a small craft draft beer selection, but there is a pretty good craft bottle selection if you are looking for more selection.\n\nThe negative is the general feeling of being worn out. It wasn't that the place felt dirty, just worn out. I know its hard for a place to keep its character and heritage after being spruced up, but I think they could do a little that would make a big impact.\n\nHaving said that, I do see myself spend more time here. The place reminds me of an old university sweatshirt - a bit threadbare and torn, but the most comfortable thing you can wear.","useful":0,"funny":1,"cool":2},
{"review_id":"TcRJWPSNA99LcWEPuyHPig","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"RtUvSWO_UZ8V3Wpj0n077w","stars":3,"date":"2014-11-13","text":"Fun atmosphere and interesting food. The lineup in the cold can be too much, but the experience is worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"pSx880G8_G5XOB_5asIAYQ","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"DQRhUU56vjhAJW0ZF1LLcg","stars":2,"date":"2014-12-14","text":"Not a great experience. The food was okay, not great. The service was weird and rushed. Not really what we were looking for on a cold Sunday. The beer selection is always good for European beers, but missing a lot of bottles.","useful":0,"funny":0,"cool":0},
{"review_id":"kgVI4dW1kWlBJqFI6187YA","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"mr4FiPaXTWlJ3qGzp4-7Yg","stars":4,"date":"2015-01-22","text":"What a relaxed place to enjoy a nice dinner. Table 17 is intimate, split into two rooms.  The service is very personal but not invasive.  Tonight we got the right amount of attention without feeling rushed. \n\nThe menu is well edited with interesting selections. We choose the artichokes and  bocconcini as the starters followed by venison and steak tartare, with sides of amazing Brussels sprouts and frites. All excellent, but the venison was truly a standout. \n\nI have been here a couple of times, but tonight was the best. Certainly will return.","useful":1,"funny":0,"cool":0},
{"review_id":"-_cB9QqV2lvo4vduhMFwzw","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"RmgdyhVjHGnQxX0bjr9XVA","stars":4,"date":"2014-12-03","text":"FNL was a lot of fun. It was my first time going and I was not too sure what to expect. The event is a combination of music, dancing, food and drinks. There are a number of food stations throughout the ROM all featuring local, food truck style offerings. We did four or five of them, from tacos and Japanese style fried chicken to ice cream sandwiches (the best!) and apple pie. \n\nThe drinks are all $6 and the beer\/wine selection is not great, but good enough I guess. I would have preferred to see some local beers, but Perroni is obviously a sponsor.\n\nThe main dance floor is on the first level. The DJ was pretty good when we got there, but by the end of the night they had switched to a live rock band which was not as conducive to dancing. The stage on the second floor had a great band from Montreal. If you go make sure to check the schedule and plan which acts you want to see.\n\nAs others have said, make sure you buy tickets online first. It gets cold fast waiting in line if you don't have tickets. Also make sure to stock up on the ROM bucks so you don't have to waste time in line buying more all night.\n\nIn terms of the crowd it is a real mix of older and younger, people dressed to go clubbing and others in pretty casual clothes. My advice is to dress up more than less, but either way you will fit in.","useful":1,"funny":0,"cool":0},
{"review_id":"Uj3upo09oMDmb8OqOIP-MA","user_id":"8xArUHrVys0dH17X36KyJQ","business_id":"HuS6aHz8nW3jSvkWNnAIdQ","stars":5,"date":"2015-07-18","text":"A really great experience. We were welcomed quickly by the bartender and seated in the back. The menu was short but the quiche was excellent and the smoked salmon on bagels was so fresh. \n\nThe owner stopped at our table and was so nice. She found out where the bagels were from since we were so impressed...she buys everything in Leslieville!\n\nWill be back!","useful":0,"funny":0,"cool":0},
{"review_id":"bt1mLHO2fWN-uwrYAdv7oQ","user_id":"xjTXvdYPXyfyfIiiscIbhA","business_id":"qkoDky591Z6K4IYhlbt-Nw","stars":5,"date":"2014-06-19","text":"Every time I'm in the Charlotte area I get my hair cut by Ian counts at salon twelve26 the people are great and the haircuts are awesome I recommend this salon hands down.","useful":3,"funny":0,"cool":1},
{"review_id":"ydXvBOiRq38VyUneXaq3oA","user_id":"NS8XlptzfuTPCTm7nxGjtA","business_id":"5spsHFWOIlRPw_M5Mqf6qg","stars":4,"date":"2015-03-03","text":"I was told by a well known dealership that I had 3bent rims and they tried to charge $522.74 turns out I take it to spears, none of the rims are bent and it was just a bad tire. They were honest and professional. I would definitely recommend them to anyone and I will take my car back there if needed.","useful":1,"funny":0,"cool":0},
{"review_id":"d-ffieaQGZP9CTwteRtQGA","user_id":"IHhRkHP6pKDGLWb2WR0wxQ","business_id":"UqRO61xek8x-jnLZeLnJGg","stars":5,"date":"2011-02-16","text":"Really liked the store. Clothes are great, store is cool, and people are friendly. Prices are a bit high, but I can see myself shopping there again","useful":0,"funny":0,"cool":0},
{"review_id":"YuX88bOjukSm9BjpXTS9jw","user_id":"I1_0JCPvzBEKOr-C0tZeBg","business_id":"qIa7_O-k-eQpBAxG9mxPaw","stars":1,"date":"2016-08-04","text":"Terrible experience. I dropped a few things off to be dry cleaned because I live within walking distance and figured it would be convenient. When I picked up my clothes they smelled TERRIBLE, like B.O.- I should have gone back to say something but at this point I will never be going back!","useful":0,"funny":1,"cool":0},
{"review_id":"sYsmMkPDVEb-EGtisbg9Dw","user_id":"I1_0JCPvzBEKOr-C0tZeBg","business_id":"rJaZN1LR5SVBSdpXj4uA8A","stars":1,"date":"2016-10-24","text":"This is only my 2nd time writing a review on yelp but after our horrible experience at Modern Nissan of Lake Norman I felt the need to. \n\nTo start our bad experience, we called ahead to look at a car after work and they said they would have it ready for us when we got there. When we got there that was not the case. We had to wait for about 20-30 minutes for someone to even acknowledge us and then when they did they gave us the keys to test drive the car, alone- not telling us a single thing about the car. When we got back from the test drive we were met with a sales guy who finally told us a little about the car and agreed it had some quirks (Messed up leather seat, no backup camera, odd controls but this was a Volvo and they are a Nissan dealership so we didn't question him too much)\n\nAfter about 20 minutes of looking around in the car we decided to start the negotiation ( we had been looking for this particular car and so it didn't take much for us to decide). We headed inside to start the process. \n\nWe started our offer low- who doesn't at a car dealership and they were \"offended\" and didn't think they could make it work. After back and forth we decided to walk away from the car. They were rude and basically impossible to work with so we decided to leave and were ok with finding another car to avoid working with them. \n\nThe next day they sent me 2 texts and called me several times \"wanting to make things work\" so we offered 23,500 ALL CASH and we would pick up the car within a matter of hours (the car was listed at 23,339 + tag and fees which totaled 24,400). After getting no where with them because they didn't budge on price after calling me and wanting to make it work we offered 24,000 all cash (we are now 400 dollars apart) and they said no...\n\nI finally said forget it because they were so rude and disrespectful but they KEPT CALLING ME offering 24,300 and then 24,200- At this point I was so offended that they came down 100 dollars and I said heck no and walked away.\n\nIn summary, I would NEVER recommend this dealership to anyone. They are rude, disrespectful, condescending and not willing to work with the customer. It was not so much about the money for us and we found a better car and paid more for it in order to avoid working with Modern Nissan of Lake Norman.","useful":4,"funny":0,"cool":0},
{"review_id":"pCgMb4yJ0t86nO_tYFqWjA","user_id":"cLz6xBGen9Y4EEkQbcm5pg","business_id":"dTR5sE-J__Bw3-RjSf1r0Q","stars":5,"date":"2012-03-13","text":"We are so happy we found Dr. Bybee!  Him and his staff are wonderful and my kids love going to the dentist because they make it fun and special for them each time they go.  We highly recommend Dr. Bybee!","useful":0,"funny":0,"cool":0},
{"review_id":"FILpiZY5nMgQf4L-Rt_nkQ","user_id":"cLz6xBGen9Y4EEkQbcm5pg","business_id":"-_TSaVr53qiEGqMkwyEMaQ","stars":2,"date":"2017-02-18","text":"Today was my first time trying Parsley's.  I had a Groupon worth  $16 to spend.  I ordered the chicken plate, an appetizer of tabouli, and parsley fries.  When I got home I was very disappointed.  They gave me steak instead of chicken, and the appetizer of tabouli was about a 1\/4 cup worth with no pita (which they told me would be included).  Definately not worth the price of $3.99.  Everything was just ok tasting, except I really liked the rice.  Not sure I'll be back.","useful":0,"funny":0,"cool":0},
{"review_id":"JXiT_Dhy7KY_19_XAjQv0g","user_id":"4-yGC7mGp802SBC1wJm0Bw","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":2,"date":"2014-08-27","text":"Our experience at the Rio Hotel in Las Vegas\n\n(I sent this letter to their customer service - let's see if I'll get any response) \n\nOn Friday (8\/22\/2014) around noon I called the hotel to inform them that we are arriving late and requested for a baby crib to be ready in our room.\nThe representative was very kind and made the comments promising me that everything will be ready on time.\n\nWe arrived at the hotel around 10:30pm and expected to check in and go to sleep.\nThe check in counter was packed and we had to wait, when finally we were able to check in - we were told that there are no King size beds available and only queen beds rooms are available.\nEven though the reservation confirmation said: \"ROOM PREFERENCES\nWe will make every effort to fulfill your preference requests; however they are not guaranteed, as rooms are assigned at check-in. Additional charges may apply for some requests. For accommodation preferences for the physically challenged, please call us at 1-800-CAESARS.\"\n\nI had no choice but to except that - BUT I don't understand, if I'm booking a specific room I should get what I paid for.\nThen, I asked for the crib (which was obviously not ready in our room) and I was told I need to pay for it.\n***On the phone call that I made earlier no one told me about the rooms not being available nor that I have to pay for the crib!***\n\nI told the guy at the front desk, that if I am not getting the king size beds I should not pay for the crib. Eventually he said that he will not charge me for it.\n\nIn addition, he suggested that we will switch to a king size room the day after (Saturday), and to expect a voice mail from the registration desk.\nNo need to mention that no one called us or contact us in any way and we never got the king size beds.\nThe first night was quiet and calm.\nThe second night, 3am a cloud of cigarette smoke took over our room.\nA group of young people were partying in the next room. Doors were slamming, people were shouting and cursing all over.\nAnd then - my 17 months old baby woke up coughing! The smoke was so dense as if someone was standing next to our beds and smoking in our faces!\nTo remind you, we asked for a NON-SMOKING room, which I assume will be placed on a non-smoking floor, or am I wrong?\nIt is unacceptable to me that my baby will wake up coughing in the middle of the night because the room is full of smoke - after I paid for a non-smoking environment. \nIn addition, my parents were in the next room - experiencing that exact smoke experience. My mother just recovered from cancer, and this is a health hazard for her.\nI would recommend to change the air filters because when comparing this hotel to others (Cosmopolitan, Bellagio, Cesar's Palace, Wynn, New York New York, and many more) - this is the hotel with the worst cigarette smell in the lobby. \nThe only good experiences we had are the pool and the \"House Hash a Go Go\" restaurant.\nWe are extremely disappointed from this experience, and will make sure to share it with our family, friends, and colleagues.\n\n\nHere is their response:\n\n\nThank you for taking the time to write and for making us aware of your experience at Rio Las Vegas. Your comments are appreciated as it enables us to identify what we are doing correctly to satisfy our guests, as well as, discovering where adjustments can be made so we may continue providing the best products and service.\n\nI am truly sorry that you were faced with breakdowns during your visit. I hope you will accept my sincere apology. We are deeply concerned whenever our guests are faced with challenges during their stay with us. It's obvious by your email that we have some opportunity for improvement. There is certainly no excuse for you not to receive the best service we have to offer. Many of our customers consider Rio Las Vegas their home away from home, so I am disappointed that the same service and comfort was not what you experienced. It is never our intent to inconvenience or frustrate you, or any customer. You certainly deserve the very best we have to offer.\n\nThank you again, for sharing your experience and concerns with us. I hope you will take some comfort in knowing that all customer comments are taken seriously. Your business is truly appreciated. We hope you will give us another chance to serve you again in the near future. I am confident that your next experience visiting us will be enjoyable. \n\nYours truly, \n\n\nTara Galauska\nTotal Service Central Specialist\nCaesars Entertainment\n877-716-4500 \/ 702-369-5160","useful":0,"funny":0,"cool":0},
{"review_id":"JCZvqQTH6zolGkhoRWCfqQ","user_id":"grXVEsMh_EZqtZaEHWmf_A","business_id":"C_oejk3EzfsxP7-owQDkbQ","stars":1,"date":"2017-07-28","text":"Do I think Camp Bow Wow \"abuses\" dogs? Well, \"No\". Inadvertently, perhaps. Certinally the staff feel confident their handling of the dogs which they attend to are in excellent care. Again, perhaps. However, please see for yourself before dropping your loved ones off for a week or even a day. I encourage you to download Camp Bow Wows app before you decide. \nMy wife was going on vacation. Trying to consider my long hours at work she took it upon herself to book our two dogs at the Westlake Ohio location. Unfortunately , she failed to do her homework. So, I decided to watch the live feed to see if my dogs were okay. After two days of watching twenty plus dogs in a \"bull-pin\" type in closed area with a small outside area which didn't offer any real grass or enough room to run, excersise , or simply play. I also noticed there were no toys. As I continued to watch, there was no human interaction. Family pets obviously need human interaction. The dogs were not being walked nor were they being taken outside for bathroom breaks and probably because it is  easier to mop a tiled floor opposed to cleaning artificial grass carpet. Also, I noticed one of the male staff members was sitting on this small landing of sorts in the center of the room. As the dogs were coming over to him for attention he would bat them away. This recording was on 7 \/24\/17 in the small pet area. These dogs sit in this room within an open warehouse. The \"bull-pins\" are sectioned off into groups of size and or tempermant as far as I understood. These dogs sit in this room by the door waiting within an atmosphere of very loud constant barking. \nIn my opinion, this place isn't good. I felt sorry for the dogs there when I nearly sped as fast as I could to rescue my two boys. After two days of watching the live feed, it was all I could take. Ask yourself. \" How can you expect your bet to rest without nervousness amongst constant loud barking. Camp Bow Wow distracts the reality as they use \"Camp\" as well as their \"cute\" play on words relating to \"k9', pet, dog and puppy. Notice when the dogs are out of the \"bull-pins\". There will be a memo stating the dogs are asleep from a busy day. Really? Your dog doesn't need a \"Camp\". They need attention, human interaction, behavioral  enforcement, bathroom breaks, walks. Most of all, \"A family setting\". \nWatch for yourself on Camp Bow Wows live feed. In my opinion. It is sad.","useful":1,"funny":0,"cool":0},
{"review_id":"atNsZfQBZbLnJcHBv4t0nw","user_id":"kAD3Xna-o-F0__R77CP6_w","business_id":"fyJAqmweGm8VXnpU4CWGNw","stars":5,"date":"2014-10-10","text":"The best cinnamon rolls ever also great selection of wine and beer. I go here at least 2 -3 times a week for coffee and pastries and the occasional 6 pack of my favorite beer .i love this place Thank you Erin & husband for opening a great place in central Phoenix. .","useful":0,"funny":0,"cool":0},
{"review_id":"kVxMPiv-Q1XyTUbQhPJnoA","user_id":"kAD3Xna-o-F0__R77CP6_w","business_id":"UC2J3v00-n8WE34BGs2HEw","stars":5,"date":"2015-03-01","text":"love this place emily sasha and warren are great went in looking for great food better beer and phenomenal service ..totally got it we ordered the turkey burger it was juicy and i could tell fresh not frozen like alot of places serve turkey burgers ,emily suggested the coronado eightenth annivery ale .it was great warren suggested to my gf the greent tea ipa also amazing this staff knows there beer ,thank you emily warren and sasha .hopefully we will see you soon","useful":0,"funny":0,"cool":0},
{"review_id":"eSP684ZGfzDav5qrzUzSBA","user_id":"bAhDj1G-oQqFzLvbox3peA","business_id":"aqONNC5onqX6EqHHUO1CJA","stars":5,"date":"2014-01-02","text":"What an amazing experience, my family and friends visiting from San Diego, stumbled over this place called OREGANO, wow great food, and lots of it, I had the Diablo shrimp recommended by Tony it was the bomb, enjoyed it and we ordered the cookie deep dish it was worth the wait it came with 3 scoops of ice cream great dessert to share, FYI order the cookie in advance because it takes 12 minutes. we definitely will come back when we visit Arizona again or hopefully they will export Oregano to San Diego","useful":0,"funny":0,"cool":0},
{"review_id":"CansROmLiE0v87yXor2_Rw","user_id":"VvKDom_6BxbL-R8L_BBy0A","business_id":"KlLCJN_KUP9xFQBJYrhgVg","stars":1,"date":"2015-09-13","text":"This hospital has no clue. Poor staffing. My kid fell and hit his head, they kept him for observations yet didn't tell my wife or I anything that they found unless we cornered them. They didn't monitor him correctly either, after the ER, we got a room upstairs around 3:40, they did not monitor his heartbeat till an hour after he went to sleep for the night at 9:30. So at 10:30 they came in woke him up and hooked up the machine which made loud beeping noise when he moved. Still the nurse did not come in when the alarm sounded. From 3:40-10:30 they didn't monitor shit. So what was the point. They gave my kid sugar water without permission, which his pediatrician said not too do until 6months of age due to my wife being type 1 diabetes. The nurses would all came into our room like they were on some game show every time they showed up, even late at night. This kept my 5 month old up more than he should have been. Children's hospital indeed, they need to remember who their patient's are, kids who need sleep. We have seen the doctors for release hours ago yet are still here because the staff can't communicate well with each other. Held captive at the hospital we came to for help. Our nurse is now waiting for a call from the charge nurse on release. Been at least an hour. Phoenix children's hospital, get your shit together. Such a bad experience. Oh yeah and everything squeaked; doors, chairs, the crib, everything. Try putting a 5 month old to sleep with that.","useful":2,"funny":0,"cool":0},
{"review_id":"3GBu_VrbK7JtbGZk7VOomg","user_id":"fxIoQO2HXYIEBDLZQxgB3Q","business_id":"dlsTOxPYoYzSviQWSTpNAA","stars":5,"date":"2016-04-07","text":"Top notch service EXCELLENT pricing and very large selection - no need to go anywhere else in Phoenix !!!","useful":0,"funny":0,"cool":0},
{"review_id":"9Pxtr5qdS6-06FpiG3z5KA","user_id":"jROjNHY_EUaz0T5bC_06yg","business_id":"LwNZ1AR4_5iukgQYuhmTOg","stars":5,"date":"2015-05-27","text":"This is the 5th car I have purchased\/leased with BMW of Las Vegas. Each experience has been very positive and wonderful to say the least. Gonzalo and Eric have helped me for the last 3. They are very professional, very nice and they do what they say they will do which is the most important to me. I even enjoyed my time in the financing department with Joe. They made me feel valued as a client and they have earned my loyalty. I would recommend BMW of Las Vegas and in particular Gonzalo and Eric anytime.","useful":0,"funny":0,"cool":0},
{"review_id":"ri3U4JBFT7_ZvtE8b0PgXQ","user_id":"jROjNHY_EUaz0T5bC_06yg","business_id":"olwnQPTEz4uq23HUrJB77w","stars":1,"date":"2017-11-24","text":"I was truly disappointed today with  this store's policy. I have been a loyal shopper for at least 3 years, bought some items last night and came back to exchange jeans I purchased for my son as it was the wrong size. Cashier informed me that they are not doing exchanges or refunds today. I was very surprised and asked for the manager. \n\nShe reiterated the policy , I argued that I have not heard of that policy before and her comment was \"gave you been doing a lot of exchanges today\" I was pretty offended, in fact my only trip to the mall today was to exchange this one item from their store. She did do the exchange with a little attitude. \n\nLove their products but they are replaceable. I know I am only one client but they lost me as a customer today.","useful":0,"funny":0,"cool":0},
{"review_id":"dwbSO3zSI0sP9NAKVm6Q5g","user_id":"jROjNHY_EUaz0T5bC_06yg","business_id":"eLFfWcdb7VkqNyTONksHiQ","stars":5,"date":"2016-07-09","text":"Awesome food and excellent service. Jaenica was our server, she was awesome, very professional and made sure we were always take care of. I will definitely tell all my friends.","useful":2,"funny":2,"cool":2},
{"review_id":"w7ZHtXQ2igkIAAiEheENtw","user_id":"7hP1_socpUqgXwmrKVJw0Q","business_id":"SWhHaWFuijy_KDs0zVCJog","stars":1,"date":"2016-11-11","text":"good food, but if you order To Go, especially for kids, know that you don't any salad or bread for them and hardly any for regular meals. LAME. Their unlimited salad and chicken picata is yummy, but DINE IN for the unlimited salad and bread.","useful":0,"funny":0,"cool":0},
{"review_id":"z4Hei6s6rv8VidBFudNEoA","user_id":"gYiF39rWifTzehz8V5tpow","business_id":"O_6zhr9_r49cgw1r5nJIwA","stars":5,"date":"2016-02-17","text":"Had an amazing time the whole night! Amanda was our host she made sure we had drinks the whole time & made us wish the party bus ride was longer too turnt! Will be back soon!","useful":0,"funny":0,"cool":0},
{"review_id":"pEbtMSboU7hCmlFT2npg2w","user_id":"MKTBOaP7ikIQcmk89alVeg","business_id":"CDzk5ayt_e86MuNlLFvLDQ","stars":2,"date":"2013-08-22","text":"First off, this was the second time my party has been here because they have a large variety of foods. The place was not that great,surroundings wise. When we first came in we were surprised by the limited amount of food we were supposed to order. Before, we thought it was all you could eat but ow its three rounds and you get charged for a surplus. The red-haired assistant manager treated my party like dogs even though we had given an additional 15% tip. We come from the United States and we were charged for the surplus of vegetables! Vegetables?! I would understand if it were for meat but vegetables? Be weary of the red-haired assistant manager,he was very rude to my group and he was very unprofessional.","useful":1,"funny":0,"cool":0},
{"review_id":"CAwbg7TfuXXKO8RhhHzWxg","user_id":"8GImNNmXLfrlwPgFaWlAfw","business_id":"A_05gZ2QwayLb0YeQ_TItQ","stars":1,"date":"2016-06-11","text":"4 out of 5 times could not serve the Dosa. Also the quality and quantity has degraded over last few months. I will not be not going there anymore. They were actually good when they started. Any Indian restaurant in Montreal down the drain.","useful":0,"funny":0,"cool":2},
{"review_id":"O1xSKTJ4MBfd0Zvbf7Xxeg","user_id":"BqwrovBXMhkS7sXPY5TBng","business_id":"UAOm069sCFAHQoikZYQ-EA","stars":5,"date":"2011-05-31","text":"We had a great time. Would see it again. In some ways it was what I was expecting & in others it wasn't. My husband & I went to celebrate our 1 yr anniversary & we also met her after the show. She is wonderful. Would recommend for anyone to watch.","useful":0,"funny":0,"cool":0},
{"review_id":"--YjCE383csO5HyfrcnsdA","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"UBQRhqRMW4Sk7kSZvZ1iAQ","stars":5,"date":"2012-02-13","text":"Big fabulous tasting french macaroons. Very addictive.  \\ ^o^ \/","useful":0,"funny":0,"cool":0},
{"review_id":"-UHHfWUhyL-_Vizlx_tYGw","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"vUnmi0uI8p35RxYAEH4Nlw","stars":5,"date":"2016-01-05","text":"Lee Lee's is a fine store with a lot of variety. I mostly purchase produce and meat! Clean and well organized. My go-to in the East Valley.","useful":1,"funny":0,"cool":0},
{"review_id":"SxcDyoOQzyGS5JApYrU1sQ","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"ZXC9HaHWeHnKKtbqX74Q_A","stars":5,"date":"2012-01-30","text":"Rolled tacos = divine experience. So much bang for the buck too. Ashamed to be completely stuffed for $5 and their salsa is excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"71Il4ZD1y4taMGM-OpYZvg","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"URFhSrJPk7JM2pUtsuWsAg","stars":4,"date":"2011-12-22","text":"The food here is really good. They somehow make green beans and tofu delicious. Miracles never ends.  \nTheir orange chicken is the best I've ever had (no hint of that nasty ketchup flavor you get a some places) and the sizzling rice soup...there are no words.","useful":0,"funny":0,"cool":0},
{"review_id":"28Fz3XnCWUM-PxE1ar_BqQ","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"-QgX4QofONhh6XFZ4Zbnvw","stars":5,"date":"2012-01-30","text":"Yummy food! Great all day happy hour and the service was great.","useful":0,"funny":0,"cool":0},
{"review_id":"WfaiuVi9qSWs_bDaRzhOEg","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"2Yq-Y-tDroP7mdDfcWJLCQ","stars":5,"date":"2012-01-30","text":"Really awesome tacos. The Al Pastor is my #1.  I get some bad cravings for this food and I'm not ashamed to admit it. The guy running the register is super nice and funny.","useful":0,"funny":0,"cool":0},
{"review_id":"eedY56-auZSj7ysfm6tiRg","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"BQEA-YSLbE7CnRkwuX9J8g","stars":5,"date":"2012-04-14","text":"I miss you since we moved an hour away, but we still find an excuse to come your way when we can for my husbands haircut. \n\nNicest place and lady ever and not to bad with the scissors and clippers!  (^_-)","useful":1,"funny":0,"cool":0},
{"review_id":"cbfBwBh0svATC7kuPOrfuQ","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"qUPUCcBbn-ugXFSItXLmGw","stars":5,"date":"2011-09-07","text":"This is my favorite place for sushi! Heck,this is my ONLY place for sushi.  Japanese Dynamite Salad, Salmon Stack and Vegas Roll are must haves! Make sure to try one of their awesome desserts. Best Happy Hour prices ever. Friendly staff.  Their iced green tea is the best.","useful":0,"funny":0,"cool":0},
{"review_id":"Dp0pBfD3tqDg9toDoE8yVw","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"tV5PcOIFlB12dpcbCy78VA","stars":5,"date":"2012-04-26","text":"This place made me sick.\n\nNo, no, not like that! \n\nI just had the buffet and ate too much.  Now it's my fault for being a glutton, I admit, but the food was just too good.\n\nThe servers were very attentive and were quick to offer drink refills and replenish our supply of their amazing naan.\n\nThe food here is so good I'm almost afraid to go back and risk another food induced coma.","useful":3,"funny":8,"cool":2},
{"review_id":"p3tTRuYzriBoEUcO1w4FfQ","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"lCxtNddU4aDWMCgnzRYbsw","stars":5,"date":"2011-07-06","text":"This store is bright and clean, the prices are comparable to others with a just right selection. Their banchan are very good and well priced. \nLove that they always have some good kpop playing in the store as well.","useful":1,"funny":0,"cool":0},
{"review_id":"IKv2w4u3qZxTyAvMiBCbwQ","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"Clq09vq8uOjAbGY3BaQWDQ","stars":5,"date":"2014-08-22","text":"My favorite Korean place.  My ONLY Korean place. \n\nPersonally, I've always had good service, so no complaints on that from me. \n\nI've had a a fair amount of dishes but not nearly enough because I always want the Kalbi Dolsot Bibimbap because it's my favorite comfort food. \n\nThe banchan are good and plentiful, but my goodness Korean potato salad is my kryptonite. I would eat this by the gallon if I could.\n\nIf you want to treat yourself, order a bottle of Soju to make your meal more authentic.","useful":0,"funny":1,"cool":0},
{"review_id":"3xZqAjHh9ZWLj_vKLxcoZA","user_id":"IkqgXfEDidc9QV3fNiZVpg","business_id":"0Buxoc0cRqjpvkezo3bqog","stars":5,"date":"2012-04-14","text":"Get the pork belly buns. \nDid you get that?\nPORK BELLY BUNS.\n\nStop reading this and order them already.","useful":1,"funny":2,"cool":0}]