[{"review_id":"-uBwSwTBcPFcaV2RwEoLOw","user_id":"8WR9c335DNCpPKTTQG990g","business_id":"oXoVJ0xKv82cBo9U6oEjlQ","stars":5,"date":"2015-02-27","text":"This place was amazing.  Great food. Our server Christina went above and beyond.  So wonderful friendly and will definitely be back !","useful":0,"funny":0,"cool":0},
{"review_id":"B9KanCAqRX5uSFsNOJCTDQ","user_id":"t1PSb3L7Ky5N10b-YZdGbg","business_id":"VJ6tIudilSCgzIldXn23FA","stars":1,"date":"2016-09-08","text":"This company is straight garbage. We rented the 3 Rivers Party Bus for the Luke Bryan concert July 22nd. The problems were as follows:\n\n1. They showed up late to pick us up. Not just a couple minutes late, but 30 or so minutes, which then led them to be late for the two other stops.\n2. Half of the amenities that came with the bus, just weren't any good\/didn't work.\n   a. Speakers didn't work\n   b. TV didn't work\n   c. Poles in the middle were rusted\n   d. Bus in general was just dirty\n3. Driver wasn't pleasant at all. He was ignorant to some of the people on the bus. He also was talking poorly about our group because we weren't feeding him (We would have, if he wasn't ignorant to our group)\n4. On the way home, we were going so fast, that when the driver hit a bump on the road, we would fly out of our seats. This might be ok for some, but not us.\n5. Finally, they charged my friends Aunt an extra $400 just recently. \n\nIn conclusion, I would not recommend this company to my worst enemy. If you are looking for a good Limousine company stay clear of this one.","useful":2,"funny":0,"cool":0},
{"review_id":"DMczfya0ZZVabVVAMcbobw","user_id":"JNOLqaXf1lnaqp7BQWwNMg","business_id":"MvTH59b1KNCOY7vYTpYG4Q","stars":1,"date":"2012-08-10","text":"This store occasionally has some good items, but it is hit or miss. The owner is nasty and I really do not know one person who has dealt with her over time who has anything positive to say about her. She marks over keystone.","useful":1,"funny":0,"cool":0},
{"review_id":"x5RSLMQ5Lu-DfYoCFbzZZw","user_id":"2ML0xKfrGxSWbGXxMtzBew","business_id":"u7jiuYiz-zVwsh0TGRHUIg","stars":4,"date":"2017-01-31","text":"Love this place! Delicious mexican food for a cheap price. Must try to queso!","useful":0,"funny":0,"cool":0},
{"review_id":"Oty5ckJPff_XXe_hEsRNug","user_id":"2ML0xKfrGxSWbGXxMtzBew","business_id":"-fiUXzkxRfbHY9TKWwuptw","stars":4,"date":"2017-01-31","text":"I love this place! Everything on the menu is so good, its hard to chose what to get. My favorite thing is the nacho skillet. Definitely my favorite restaurant in downtown Champaign!","useful":0,"funny":0,"cool":0},
{"review_id":"3HLZTqQp4QU8HDR1xYB6Hw","user_id":"nbqxNtzZwZYDJhfmbcMe5w","business_id":"kF6uM_KKWvBMGFdxMe9k2A","stars":5,"date":"2013-01-20","text":"I have been to Udupi Madras Cafe multiple times and the variety of DOSA'S there is incredible. I love the mysore masala dosa, Chettinadu Masala Dosa, the delicious chili paneer masala dosa and the list goes on. The desserts are equally great. Dont forget to try the Udupi Special GADBAD Ice Cream, its one thing you cannot miss if you go to udupi. On saturday and sunday, it even has an awesome BREAKFAST BUFFET with variety of chutneys, south indian delicacies like vada, idli, Upma,Pongal, sheera etc.  The prices are very reasonable, the staff is friendly and overall ambiance is great. The decor allows the simplistic beauty of the food to really shine. It's one place that really reminds me of my native place and the culture of India.","useful":1,"funny":0,"cool":0},
{"review_id":"KwZ0pHzAZoDbrACDPi4aIA","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"qvVYYnapp7sdDChoLaa-uw","stars":3,"date":"2016-08-11","text":"Great bartenders. Decent food. My burger was so salty I couldn't eat it. Fries are good. Cheap drinks.","useful":0,"funny":0,"cool":0},
{"review_id":"Uu2336hfy3VLhn1-OapOTA","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"vyV6gX8EAzKHo_wk0z9kxw","stars":5,"date":"2016-06-01","text":"The owners are very courteous, the place is clean and I enjoy everything I order. I work at another local restaurant and I can say they do everything right. Sushi is fresh and on point. Although they don't do hibachi at the place you can sit down or take it to go. I suggest anyone who hasn't been there to check it out. Very well done. Kudos.","useful":0,"funny":0,"cool":0},
{"review_id":"nSkln1WMfPcYMlu9_U_2Rg","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"MQJxekA2SN8kmoo-kiq1dw","stars":4,"date":"2016-08-11","text":"Make sure you get her tomato salad now while its in season. Elegant in every part. Hurry! Ask about limoncello.","useful":0,"funny":0,"cool":0},
{"review_id":"vI218eZfSvsw0zX5QC-l-g","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"UefV-nqjYP3EUzubgtrIAw","stars":5,"date":"2016-08-11","text":"After growing pains have gone away I am always given the amazing sandwich that this place has always been capable of making in execution.  Great team of kids in there. Hard for them( employees) I'm sure to be friendly and excited to sell sandwiches for minimum wage, but they do and they are.","useful":1,"funny":0,"cool":1},
{"review_id":"y7L3g9JrkUbh07NnfUTX0Q","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"C3GUi1zAtJdDBWrPoPZjBQ","stars":4,"date":"2016-08-11","text":"I love their beer. I love it. I should have come sooner to support brewery. I spend money every other place I go on headhunter IPA( aka the best IPA in country). I wasn't expecting much as far as food. They did however serve me the best chicken wings I have ever had period. I enjoyed the cuban but I am docking the star from review bc I wish bartender told me how amazing they were.  I had to hear from the guy sitting next to me on the bar. He said I should have got wings for app and entree. They should pull the chicken off the wings and make a chicken melt or salad sandwich. I'm telling you they are the best!!!!!!!!!!!!!!!!( all the way to end exclamation marks)","useful":1,"funny":1,"cool":1},
{"review_id":"Y3doD-V1_HE5HqkkVzqwkw","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"hyyy_yFDI3CJJaG3uROGBA","stars":4,"date":"2016-08-11","text":"The most consistent place I've ever been to as far as normal traditional american fare. I love sitting at bar wi my wife. Great bartender. Lunch specials and soups are always good. Fresh homemade bread is a must there. Owner is there and smiling a lot. My father took me when I was a kid. Never fails. Pizza very good as well.","useful":0,"funny":0,"cool":0},
{"review_id":"Ct3tfJWvJbS2NpMO48ruig","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"OF19lUVQHj8pVaSACNewWg","stars":3,"date":"2016-08-11","text":"Been there a few times. I feel like I'm a bother at bar bc of barmaids. At least I did the couple times at bar. Good beer selection. Just not very exciting all around. Great music when chris hatton plays there though.","useful":0,"funny":0,"cool":0},
{"review_id":"QrTMDaQKgMZp97GTd3IfTQ","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"XBbuCmvFnfFd8JdQz4IvqQ","stars":5,"date":"2016-08-10","text":"Food and atmosphere is one of a kind. It has such fun and excitement in air everytime. The owner Jon is the most funny, kind and gracious man you'll ever meet. I suggest you shake his hand he will remember you. He is the son of whitey himself. Get a burger and you step back in time. Been the same since late sixties. Great staff. Willy will always make you smile and Amanda can write the order of entire party of twenty down in her head. No paper. Love this place. Sit next to any number of cavs fans and players.  See you there.","useful":0,"funny":0,"cool":0},
{"review_id":"ihkFnY4-zKqf4xcE9kieSA","user_id":"gqYegYGd-N4TLUile0CS8g","business_id":"OA5Li3ySzhrbG_WvD_QGYA","stars":5,"date":"2016-08-11","text":"Best tacos for price there are. They brought food trucks to my wedding. Ill always love this place. Good drinks too. Way laid back dining spot in area full of great fine dining.","useful":0,"funny":0,"cool":0},
{"review_id":"CwVWMpwErKClubafvtEsKg","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"_ax_jfISiBZ4JSTHrI4xJA","stars":4,"date":"2014-08-31","text":"Beer selection is on point, burgers are very impressive. Wife loves the cocktails here. Wait time is Short, I would recommend.","useful":0,"funny":0,"cool":1},
{"review_id":"LnjBL-Iammf1_wb3uYVb1w","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"7m1Oa1VYV98UUuo_6i0EZg","stars":5,"date":"2014-11-03","text":"Best burgers in town hands down. Presentation is an art form here. There service makes you feel at home. I love stopping by when I'm on this side of town. Very excellent experience all the way around every time.","useful":0,"funny":0,"cool":0},
{"review_id":"hHVBKv4nacYCphHhHt2KIA","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"53BSdnhzcCBfBH_6TgX63Q","stars":5,"date":"2014-08-31","text":"Very courteous service, very delicious cuisine, and a very phenomenal experience over all. I highly recommend if you're on this side of town and need pizza.","useful":1,"funny":0,"cool":0},
{"review_id":"Y5fIpwX9XULQyNxVlYVNTQ","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"p8H_WsH1SltPmo0-c67gFQ","stars":4,"date":"2014-09-08","text":"I love Smash Burger first off, so I came in with high expectations. They did a great job at this new location. Food tasted great as usual, presentation was also good. They were pretty busy but got to us very quickly. Great job all the way around.","useful":1,"funny":0,"cool":0},
{"review_id":"rdniJaQFTRXiKq8GM8XQjQ","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"sm0stXMEmnR4fjAAVbCYtw","stars":5,"date":"2014-08-10","text":"This place has amazing food, amazing service, and a real great vibe. I highly recommend going here, you will be blown away and are in for a real treat.","useful":1,"funny":0,"cool":0},
{"review_id":"0ZkpokXX9Rk-1efEMgJ6ug","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"oa52t2Nfb7sOCqJE5M5hzg","stars":5,"date":"2014-10-31","text":"Cuisine for both meals was very amazing. Turn around time was exceptional. Presentation was fabulous. Wait time was only a few minutes. Over all a very solid experience and we will be back.","useful":0,"funny":0,"cool":1},
{"review_id":"fpS7DeGecld3hJDVfLykEA","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"j2bx_ctb_ED3zbfSaqhQmQ","stars":5,"date":"2014-10-23","text":"Service was and always is amazing. Food here is exceptional. Happy hour here is non stop and always perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"Im25z-ocuKh6NVx9qP8qWA","user_id":"fdkfe69RTWTYws9oEcjRAQ","business_id":"ohEnmKpF7i2_ujme1p_vUQ","stars":4,"date":"2014-09-18","text":"Very chill atmosphere, beer us of usual trendy quality. Service is very relaxed and quick. Food is a very unique taste from the UK. Much like a meat pie but a pasty. I recommend to all in the mood for something new and fun.","useful":0,"funny":0,"cool":0},
{"review_id":"FXOLHP3MQNQ-aJf0zaV43A","user_id":"6NK6ObCr4rRQUDmQSRDiVA","business_id":"uanCi4OGc1mHLGl_AT4JhQ","stars":1,"date":"2012-05-15","text":"Very poor.\n\nNo exhaust in the bathroom. As you probably know Vegas gets really hot, so this can be a major discomfort when steam builds up from your shower.\n\nI broke out in rash (i thought it was bed bugs). I stay in hotels all the time, never had this experience before.\n\nI was told I would get call from GM, never did.\n\nSeveral staff members rude and unhelpful.\n\nThey wanted to charge me $17.99 per day for internet access. You could not get internet access in either of the 2 Starbucks on site. I strongly suspect that is because the hotel would not allow them. Even my 3G phone had very slow download.\n\nI had 2 small packages delivered to my hotel. They charged me $21 to accept delivery of them, in other hotels I have stayed in that was a free service. I really got the feeling they wanted to squeeze every last dime they could out of you.\n\nI would not recommend to anyone under any circumstances.","useful":3,"funny":1,"cool":0},
{"review_id":"HtbFQm0roZi36o00OmcuKQ","user_id":"R35GJRcuEDo0VClzMrFP-w","business_id":"JnjXnu6A9Xb-3wm5fUyL3A","stars":5,"date":"2016-08-30","text":"Freddy is a professional, up front with cost, and gave us a very fair price for the work that was done. He fixed our leak issue and did a great job at that and also with installing our new water heater!  Personable too!","useful":0,"funny":0,"cool":0},
{"review_id":"cPwbR0Ahus8GFoMTlTDW6g","user_id":"R35GJRcuEDo0VClzMrFP-w","business_id":"hb96ToDVKWQkAj5h-UB5Ow","stars":4,"date":"2016-07-17","text":"I got the vegetable pho and it was delicious!  My son ordered the shrimp pho which was also delicious. We got a pollo asado dish to try as well.  We liked it and will definitely be coming back soon!  I'm glad we found it.  The decor is nicer than I expected so that was a nice plus. (It is kind of hidden in its location, but towards the East end of that shopping center at 35 ave and Bethany Home N\/E corner.)","useful":8,"funny":0,"cool":4},
{"review_id":"moic_WVDxCkhBv5j5dDzzw","user_id":"R35GJRcuEDo0VClzMrFP-w","business_id":"KFAJsmQ6GnHxyfmv16s9VA","stars":1,"date":"2016-03-13","text":"We came for my nephew's recent marriage. The place was very packed as it's apparently the popular place during spring training. Hubby ordered steak. It seemed like a blackened piece of char but he tried it. He said it was hard to describe, but the absolute worst steak he's ever had. This place needs a new chef or something. The steak doesn't come with a baked potato, but it came with cut up carrots and corn on the cob. The carrots didn't look appetizing and I didn't see anyone who had finished them- what a waste. He ordered the baked potato at a charge but he shared it with me. They give you a huge salad that's drenched in a dressing- Italian maybe. Service was ok- our guy was nice. What I was very irritated by was the staff yelling Excuse Me! every time they needed to get by you. We were a group of 8 trying to make it to a point where we could grab a nice pic of the couple, and so as a group were trying to make our way thru this crowded place. I found it rude the way the girls usually would yell from behind us, Excuse me as they tried to get by. Of course, we moved aside after being yelled at. That is just poor taste from a service stand point. I don't get why this place could be so crowded, except for the view. It's overpriced and low quality. The guy did remove my hubby's steak dinner from the bill so that was good and we appreciated that. We did pay fifteen dollars for the baked potato and my side salad (our table had 18% gratuity added) but I was grateful to not have to pay for his entree.","useful":0,"funny":0,"cool":0},
{"review_id":"VL38auKCiOYInYF2rYAd-g","user_id":"L2XjX7843f9Jn09NTh0qvQ","business_id":"UO4HTFr0D_hEYvxrItx9vA","stars":1,"date":"2015-12-28","text":"It took almost an hour plus windows and floors where not cleaned as promised.  Would not recommend thus place","useful":0,"funny":0,"cool":0},
{"review_id":"FythAPmygojn-2R0X_Aciw","user_id":"GgHv0q5_ESVfsUOTA_O--Q","business_id":"ioY-a1TntpsAGJAG5_1Zyw","stars":1,"date":"2016-08-11","text":"Ok for starters..... My girlfriend and I have been eating at this pizza joint for a little while now, and we really did enjoy the food.\n\nHOWEVER; One night we order pizza for a party that we were having. Online it told us that we would receive our pizza at 1:15. We waited and waited until it finally hit 1:30. We then started to call the business to see where our order was. But to no avail, because no one ever answered the phone. BTW I was still charged for the food.\n\nSo the next day I called the store at 11AM (an hour after advertised opening time) and again, no one answered. I then called again that same day at 4PM and asked for a manager. The manager told me that \"They are short employees on Monday nights\" and that he saw my order in the morning and was going to void it out for me. \\\n\nNow me also working in the food business, I decided not to give the guy a hard time. \n\nBut today. (3 days later) I checked my account and found that the charge still went thru!\nSo again I called them today at 12AM and again NO ANSWER. I even went as far as to call the pluming store that is right next to Oliveos and they told me that no one was there and that I should waste my time coming down in person to complain.....\n\nSo here I am $20.88 Short, with no fricking pizza and no refund.\n\nHopefully the owner sees this and messages me so I can tell him how to run a business.\n\np.s. My father owns a pizza joint & the key to a successful business IS STICKING TO YOUR OPERATING HOURS!!!!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"sLn_fZKs2nHVGHp7XrKzHA","user_id":"GgHv0q5_ESVfsUOTA_O--Q","business_id":"sQvLJGGp1YeSkCn-KsasLg","stars":1,"date":"2016-01-19","text":"Oh gosh where do I start; First off, these people are good for nothing liars. I went in and talked to a woman named Susan. She was very nice and helpful, however when the negotiating started she totally shut down and acted more annoyed than interested in making a sale. Secondly we settled on a price until I noticed that my taxes for a Veloster were almost $4000!!!!! There is no way taxes should be that high!! They then said that the taxes were high because the ADDED the price for my trade-in AFTER they already SUBTRACTED the value of the car. Essentially, making my trade-in $0. After I confronted them about this, they said \"oh yeah thats weird\" and then changed the taxes to $2500, which would be fine...... If they didn't add the $1500 into a section titles \"OTHER FEES\"..... they are liars who try to jip you out of money. \n\n      After all that chaos we were able to settle on another total because of me knowing that they tried to rip me off. At this point i think, \"ok maybe all dealerships do this\" and I didn't respond to the red flags. I went to financing where I was told I could be financed. Signed all my paperwork and left with the title saying %8.99. \n\n     The next day I returned to the dealership to receive the detailing for the car because it was out in the rain. I give Susan the car and she runs into the car and proceeds to go get it cleaned. After 50 minutes or so, she comes running after me saying, \"WE DIDN'T DO ANYTHING!!!!!! HOW COULD YOU HIT SOMEONE!!\". I was bewildered at this point. She went in the back and ran into another dealership car and then tried to BLAME it on me. Simply pathetic. They got everything buffed out and it was not noticeable so I just wanted to leave. \n\n     After having the car for six days, they call me back one morning and say \"Oh, well, your rate has changed to 17%; pay it or bring the car back. No sympathy at all. These people are scammers, cheaters, and lairs.\n\n     It's been 2 weeks and Mark, in the financial department has YET to give me my down payment money back. I called after a week expecting it after telling them to mail it to my address to find that he 'forgot' about it.","useful":2,"funny":0,"cool":0},
{"review_id":"YLQt2zCcXd_iJhzFdBBh3w","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"NJ0RzuWd5xDqfJejYQZ65g","stars":5,"date":"2009-12-10","text":"Wonderful food and service. I got the beet salad and mixed fries. The salad was enormous. Easily good for two. I would have preferred less dressing is my only complaint. I've been here numerous times. Last time I got the veggie sandwich which was delicious. I'm a vegetarian but everyone else ordered burgers and enjoyed their meals. If you go you HAVE to order the sweet potato fries.","useful":0,"funny":0,"cool":0},
{"review_id":"qVgo17sCxgfAWytUr8WrHA","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"hvPPw19VdGRsOEkxgyD7tg","stars":5,"date":"2010-07-13","text":"I would have to say this place is hands down some of the best Thai food. It is family owned which is great and nice to support. The seating area isn't very large so it can get crowded. A large group of us from work go there and all enjoy it. I generally call ahead and they can accommodate is with no problem. I've only ordered the vegetarian pad dishes and the curries. My favorite is the green curry. The service is very friendly and the food is great, I highly recommend this place!","useful":5,"funny":1,"cool":1},
{"review_id":"hO2C3mGpK2lqZ2c2JltQSA","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"z50FVnW-Lcevj8z2KZQ_gw","stars":5,"date":"2011-06-06","text":"To premise my review I've been to Beri many times and with many different people. My friends and I are shocked by the low reviews this establishment receives. In my opinion here are the highlights of this place:\n\nDelicious (not overly sweet) Frozen Yogurt\nMany Toppings to choose\nFriendly Staff\n$1 small to satisfy the craving (cash only for the small)\nPunch cards\nFriendly Staff\nPoppings\n\nThe first topping that caught my eye that set this place apart from the rest are the \"poppings\". These are similar to tapioca \/ bubble tea balls \/ boba except they are flavored (mango, passion fruit, etc) juice surrounded with a thin coating. These things POP in your mouth. They are great, everyone should try them out. \n\nThey offer many different flavors of frozen yogurt (~roughly 5-6: green tea, pomegranate, plain, strawberry, taro, and some others)\n\nFinal note, everyone but one person that I've brought here enjoys this place.","useful":4,"funny":0,"cool":0},
{"review_id":"Joh4pM9wb0EseqEITdMnAQ","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"miMx3VNOW8qPJC5wEGaIOw","stars":5,"date":"2013-06-26","text":"Great food and people running it.  I highly recommend the vermicelli bowls as they are like nothing I've found elsewhere. Unfortunately I've moved from the area but whenever I'm back I always try to stop back.  \n\nAgain: get a Vermicelli bowl.","useful":1,"funny":0,"cool":0},
{"review_id":"qeC6SaRgH4U6MxW0jE6R7w","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"mlCDsdVFuZvRGrJTfQ6amw","stars":4,"date":"2013-06-24","text":"Definitely worth the detour off of 80 to get some food. They have a huge beer and grilled cheese selection. The main reason for visiting is that they have vegan options here. My friends loved the mushroom grilled cheese. I ordered the buffalo \"chicken\" grilled cheese and found that there was way too much blue cheese. I asked for more buffalo sauce to counter the overpowering blue cheese. Unfortunatlely I got charged ($0.50) for it. The sandwiches use incredibly thick bread and are quite greasy. Though the greasiness should be expected... Friendly service and good (greasy) food.","useful":0,"funny":0,"cool":0},
{"review_id":"AJKCDiBmqFD4KjpbfOUHVg","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"yLKoESPQ8BN7dn6ADzZicQ","stars":4,"date":"2013-06-26","text":"Definitely one of the better options along green street. The lunch special rolls are by far the best deal. You get a big piece of naan filled with whatever you choose rolled up and served with pakora. I usually eat about half and finish the rest later. If you're vegan sometimes they will accommodate by using Roti instead of Naan.\n\nThe menu is on eatcu's website.","useful":1,"funny":0,"cool":0},
{"review_id":"yqNykqUA2eJ92ARhPfg7Tw","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"t_yiQnxUDdPPCN2z4QyezA","stars":5,"date":"2010-07-13","text":"I can only comment on the vegetarian food. From other people in my party though they seemed to really enjoy the meat dishes. I found the food to be the best chinese food in this area. They cooked the eggplant perfectly. Most places I find it's either to chewy or too dry. They got it dead on. The cripsy tofu is delicious. I recommend ordering 2 dinner dishes for 3 people. That will be more than enough food. When eating here for dinner be sure to allow for 45 minutes for your food to come. Though, I went with a group for lunch and went at the beginning of the lunch hour and our food arrived within 20 minutes. Anyways I highly recommend this place.","useful":2,"funny":0,"cool":0},
{"review_id":"QfdQ1Q-bvB78V7QIEnl0fQ","user_id":"sNUD7INzDJYtuj6jAuIMRg","business_id":"29o-qEDIRpXmVmSPNsH4sA","stars":5,"date":"2010-07-13","text":"I went here for a friend's graduation dinner. The seating area was filled. We had reservations and they were right on time. The service and level of professionalism was great. The menu is vegan friendly with a few delicious options. I tried a friend's baked eggplant dish and it was by far the best eggplant course I've ever had. Many people in my party ordered the lasagna and loved it. I ordered the pesto and was disappointed. The homemade noodles were good but the pesto didn't have the pop of basil I was hoping for. Despite the pesto sauce, the experience as a whole was great. I would definitely recommend this establishment.","useful":1,"funny":0,"cool":1},
{"review_id":"S71KdLbqLFo-ic6fzsd75A","user_id":"sxsH0XsWFas6mhMX62x42A","business_id":"LVXi92VyDLTcm-edb8Pnvg","stars":5,"date":"2011-03-29","text":"I live in NYC and do yoga\/pilates religiously so when I took a week trip out to Phoenix to visit family, I was looking for a great studio to take classes. Well.... I stumbled across the Joyful Yoga Studio online and decided to take a pilates class.  It was great. The studio is clean and spacious, the owner is super friendly, and the instructor was amazing. After that, I ended up taking 6 classes over the course of 3 days. The prices are amazing -- especially coming from NYC. ALSO- in NYC, TRX is all the rage EVERYWHERE. It's the new pilates-- the results are AMAZING. It's awesome that this studio offers it. \n\nI highly recommend taking classes here!","useful":1,"funny":0,"cool":1},
{"review_id":"RhsBkpQpJn5wQnmcjo6HJA","user_id":"zL9ClwW6VnzJzsQVpMIXaQ","business_id":"xrtyYnxgx7bTM3AEiwjWiA","stars":5,"date":"2015-05-10","text":"The pantry was great came from a long trip had a great lunch will go there again great service and clean","useful":0,"funny":0,"cool":0},
{"review_id":"MdgbAedU24AL-2mXkbo_Jg","user_id":"zL9ClwW6VnzJzsQVpMIXaQ","business_id":"cQlmYFkJt1axuaKE3FiPxQ","stars":1,"date":"2015-05-10","text":"First time we stopped Monicals sat for eight minutes nobody came to the table no service so we left thank God for Pizza Hut  seated served and talk to within 30 seconds","useful":0,"funny":0,"cool":0},
{"review_id":"jf83QaKBX95vgqQ5s8NSqg","user_id":"waBwMhfoI65vRFP6Uti0qQ","business_id":"6t98--hqg8suYkm_37re8w","stars":1,"date":"2017-07-16","text":"This place advertises right on top of the menu that they can do vegan, but really don't bother if your looking for vegan ramen. There's a bunch of ramen options in the valley so save yourself this one. The Tofu isn't vegan (god knows how you screw that up), so you're basically left with broth, noodles and corn when they pull out all the animals. Unless you're me, then they leave the eggs in it and still charge you when you return it and ask not to have it remade. And that's $12 for water, noodles and some corn mind you. Probably do just as good for what you get going to the dollar store, but again, I got eggs in mine, so who knows what it tastes like. I'm guessing broth and noodles.","useful":0,"funny":1,"cool":0},
{"review_id":"nJEGtz11I0gE2yaaVloJiw","user_id":"waBwMhfoI65vRFP6Uti0qQ","business_id":"lUFBZiLloWXh_WN0TW9KjQ","stars":1,"date":"2013-06-15","text":"HORRIBLE place and experience. \n\nMike and his crew just got done screwing me over for a 90K mile check. I actually brought in the 90K schedule for my car, which stated very clearly what to do, as well as told him what to do, and all he managed was about half, but still charged for everything. He didn't even change the oil!\n\nNow I have to get another 90K service somewhere else just to make up for all the things he decided weren't worth his time. I USED to take both of my cars there, but never again. \n\nGO ANYWHERE ELSE.","useful":6,"funny":1,"cool":1},
{"review_id":"RtPv5knFXSHV-cfi8-2oiQ","user_id":"2N871FAlaP4FHQPcKS7_qA","business_id":"Yk8WiriuHOkAXufUqGZMyg","stars":1,"date":"2017-12-05","text":"Worst experience I have ever had at Culver's. In addition to being charged for my second item in my concrete mixer. I got to hear the staff talk back to the manager, telling them not to talk down to them, and that if there were things to do they would be doing it. \n\nThe employee taking the order (who was obviously a trainee) didn't mark my mixer as a \"later\" order as I asked. So my mixer arrived before my food. The employee said \"here's your custard\" slammed it on the table and walked away quickly. About two minutes later the rest of my order arrived. I explained to the trainee my custard was supposed to be later. He took it and said \"sorry, we'll throw it away and make a new one when you're ready.\" \n\nOnce I finished my order I went back to the counter with my receipt and asked for my custard. The manager gave me a new number and marked it on the receipt and told it would be right out. I heard her tell them it needed to be made. Sat waiting for 10 minutes before I walked back up to inquire where my order was. The employee behind the counter pawned it off on the employee working the custard area, \"he wants to know where his later custard is. He's been waiting for 10 mins.\" The trainee says \"no one told me.\" He looks at the receipt with the order and asked what kind it is again. Finally get my custard about three minutes later with a \"sorry, sir.\"\n\nOh and they are having a holiday sweepstakes that is not available to folks living in CA. Thanks for making me feel welcome! I don't need to eat here ever again.","useful":1,"funny":0,"cool":0},
{"review_id":"1w3829ox3-GSf9JBQOX9lg","user_id":"K72ZoRRcjMQOOsniIhM_8g","business_id":"pldfvm-zM2VU5m9a-j9cMQ","stars":5,"date":"2014-08-02","text":"Visited Charliotte and this place is in the lobby where my office was.  Amazing.,.best food I had while visiting.  I need to visit again just to try all the other options.  Staff is very friendly and crepes come out quick and fresh!","useful":0,"funny":0,"cool":0},
{"review_id":"cagy1pWBOCD2t6-EOGBm7g","user_id":"6kU66quEIS06wLZC7tLoHw","business_id":"nL8_8Icehnn07NSmkToNuA","stars":1,"date":"2016-12-27","text":"Hhgregg is the worst!  Where do I even start.  I purchased refrigerator, stove, and dishwasher in February...   Saving money was not worth it.  First, the delivery guys come in said the refrigerator will not fit.  Well i did the measurements and it would.  They spoke spanish to each other.  All of the sudden the refrigerator was damaged and the did not let me see it. Delivered another on Sunday.    Second, they got the stove in,  they supposively shut off the gas as my valve is in the basement.  They claimed it could not move the stove all the way back, that i need a gas company to move the line.  This was all done on Friday.   Monday, I go in my kitchen i smelled gas.  Called the gas company to find out HHGREGG did not use the shutoff valve but loosed a bolt.  I watched them, what did i know.   Then i got Mertz to come to move gas line.  $135 later to find out they can move the stove back.   Thirdly, they put my dishwasher in crookedly.  They had to come back.  They unscrewed one side and shoved it in.  Then the disposal kept backing up in my dishwasher. I called they said that was normal.  I said no it is not.  The same guy came, moved one piece said should be good.  Heck no, called again, they made service call again.  The,people never called for time range, i called they said it is scheduled and no time. That i cannot call until after 530 if they do not show. Then called nothing, called the next day. Finally they got someone there.  He said it was hooked up wrong a suppoively fixed it.  Guess what it was not fixed and seriously another repeat, no call for time just got off after an 1.5 hour time, mostly hold and transfers.  No time again.  They to call me and suppoively sending me 100 dollars, better not be a gift card.  Bc they cannot pay me a milloin dollars,to EVER shop at another HHGREGG again!","useful":0,"funny":0,"cool":0},
{"review_id":"8aX9VP1V0WVcuTN75mST6g","user_id":"LTvChiWwJ7Y2hjBExB0a0Q","business_id":"Kkpnsw5cuUwySbSKYUl7Iw","stars":5,"date":"2017-12-03","text":"I have been here a few times and found the staff fantastic. The doctors don't make you feel rushed during the walk-in hours.","useful":0,"funny":0,"cool":0},
{"review_id":"f2pcAAEDflAZzooadbZKKg","user_id":"X72tQyDHRehGs6rwgt4EmQ","business_id":"MMJIykCaADwesQsjOX6QWA","stars":5,"date":"2017-04-17","text":"Matt arrived when he said he would and gave us a quote before starting the job. He did clean a small amount of the tile and grout so we could see what the finished job would look like, which was very helpful. He cleaned everything up before he left and the quality of the work met our expectations and then some. I would highly recommend Excel Floor Care.","useful":0,"funny":0,"cool":0},
{"review_id":"NjqwmoLXu7tUXDK1fHnSEw","user_id":"X72tQyDHRehGs6rwgt4EmQ","business_id":"Jd779QKvzqUYfTHLp60g-Q","stars":5,"date":"2014-03-13","text":"Terry Hind arrived promptly at the stated time. Our issue was that the bathroom shower was not getting any cold water so was too hot to use.  He diagnosed the problem right away.  When he went to turn off the water at the outside shut-off valve, he found it was too corroded to shut off.  I had to call the city to have the main turned off and Terry was very accommodating to go buy the needed parts while we waited.  The repairs were made in good time and to our complete satisfaction.","useful":8,"funny":8,"cool":7},
{"review_id":"pHNPv6yShyRdURwY4rL2hA","user_id":"X72tQyDHRehGs6rwgt4EmQ","business_id":"ofFhVu7PcZZpP7VCqK12zg","stars":1,"date":"2016-02-15","text":"CUSTOMER DISSERVICE.  I have been going to Golden Apple for years.  Usually I wait 10-15 minutes at each appointment, which is bad enough, but this time was the worst.  For this last appointment, I was asked to come in 10-15 minutes early to complete new paperwork due to management or ownership change, I wasn't clear on the reason.  Anyway, I arrived early as requested, completed my paperwork and was shown to the procedure room on time.  I should say that the receptionist was unsmiling and bordering on rude.  In addition, the person who showed me to the room was not knowledgeable and evasive with my two or three questions, telling me to ask the doctor on each of them.  Thirty minutes later, no one had come to inform me of a reason for the delay, or an estimate of how much longer the wait would be.  In fact, I thought I was forgotten.  So I went to the receptionist, who informed me that the doctor was with a new patient and should be finished any minute.  No apology, or even acknowledgment of my inconvenience; in fact, her attitude was almost to the effect of feeling bothered.  After returning to the room and waiting another 5-8 minutes, I left after being at my appointment for more than 50 minutes.  I had rearranged my work day and simply did not have time for the procedure, especially since I had no idea how much longer I'd have to wait.  In my opinion, Dr. Figueroa and the staff at Golden Apple do not respect their patients' time, or at least that of their existing patients.  New patients, beware.  I certainly hope Golden Apple does not have a policy to charge for missed appointments.  That would be a joke considering the disrespect they show their existing patients through the complete lack of regard for their time.  I highly advise trying one of the many other medical spas in the West Valley.","useful":3,"funny":0,"cool":0},
{"review_id":"Cl129hSCUo-o41KjJQltcw","user_id":"X72tQyDHRehGs6rwgt4EmQ","business_id":"uD8SU0khj7Kn4BOrL-dwWw","stars":1,"date":"2015-02-16","text":"The line at the cutting table is ridiculous. They need to come up with a better system.  Like an express lane for people with 1-3 bolts vs 1-3 CARTS. I will be here all night.","useful":3,"funny":1,"cool":1},
{"review_id":"bpr5_1x3RS3Dv4wLUa8B6Q","user_id":"X72tQyDHRehGs6rwgt4EmQ","business_id":"RWuYX5v7m7giMDmmhP7sVA","stars":5,"date":"2016-06-16","text":"Lucas and his staff could not be more helpful or friendly. They filled a prescription for me same day when I had forgotten to call on it. Lucas is thorough and meticulous about dosages and I appreciate that.","useful":0,"funny":0,"cool":0},
{"review_id":"h7aA9ssM-CgQ4HYB8O6MxQ","user_id":"iRJehAcHH70iPmhnY45qPg","business_id":"_jjWYDq1dWjUJfU7ELTYpA","stars":5,"date":"2017-09-20","text":"A fast casual, yet high quality, great tasting BBQ restaurant is something you don't find too often, but this place is the real deal. Simple menu, yet had all of the classic BBQ staples you would expect. I did the two neat plate, ribs and brisket plus beans and Carolina cold slaw with some cornbread to top it off. All five items were delicious, and you can tell great care went into choosing the ingredients and cooking the food. Highly recommend, my only complaint is that they don't have one in the east valley where I live :)","useful":0,"funny":0,"cool":0},
{"review_id":"kb4uFSvshz9Z2s8PcpekyA","user_id":"gOKk2aeRj49wAVGxGhdLZQ","business_id":"QhJT2fro3Dp1AaIVY7pgzQ","stars":1,"date":"2017-06-25","text":"The service was good and the lady who works there is nice but the food was not good. And it was pretty pricy. I bought food for my brother and I and we couldn't even finish it because it tasted weird. The tacos were also very small.","useful":0,"funny":0,"cool":0},
{"review_id":"HIHW3l8tPHeXRo1QknK1rw","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"ITowfgmzdwsxdX1lKFYpEA","stars":3,"date":"2015-09-14","text":"This place was fun for the first 10 min and that was paying and filling out the waiver. I get the fact that there needs to be rules, but to a certain point it isn't fun anymore. Whenever one of my kids fell, he was yelled at and pointed out and told he has to stand up. He's not a professional at this. I was giving a parent pass for my 2 year old who's was cool because it was free and I could guide him most of the time. I was told over and over to stop stepping in the trampoline because I only has a free parent pass. How was I suppose to help my 2 year old when he fell or went on the wrong trampoline? The place seemed pretty clean and well staffed. This was our first time here and I was let down. My 2 kids wanted to leave after 40 min. I would definitely not have a party here in the filter considering the fact you can't rally have fun while jumping especially when I invite others here. They have a good selection of drinks and snacks and sitting area for the parents. Thanks for the free socks, but we won't be returning anytime soon","useful":1,"funny":0,"cool":0},
{"review_id":"NlQlYQ9yV-1iHdiR7nhO1w","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"w4zkRSTs9Xw-g7xNlezrSg","stars":5,"date":"2015-10-26","text":"This has to be the best (kids) dentist ever! My kids love coming here. They have so much for the kids to do here and it really distracts them from actually being at the dentist. It is always very clean and the staff are all really nice. We have never had to wait longer than 15 min in the waiting room which is probably the best part for the kids. They have a projector playing movies, iPads, a fish tank that covers the whole wall, a huge wave and also an arcade machine! The rooms that you are put in are also very nice and relaxing for the kids. The have tv on the ceiling and will put on whatever your kids want to watch while they are with the dentist. My kids leave here happy and aren't usually too scared to come because they know as well as I do that it will be a fun and good appointment.  Can't say that we have ever had a problem or complaint. I really recommend this dentist for all parents","useful":0,"funny":0,"cool":0},
{"review_id":"FP5UZpcITLU_cT-lx9WH6A","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"409qhf4RF0rlxcuaM576Qg","stars":1,"date":"2015-09-26","text":"I could give his place a long horrible review but instead, I'm just gonna give it 1 star and leave it at that. My kids quesadillas didn't have any cheese (as you can see in my pics) please do not eat here! This is gonna be one of my shorter reviews, my pics do the review","useful":0,"funny":0,"cool":0},
{"review_id":"vvaXFW4cDGSMRQqUCufK0Q","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"Xy8R4AnLP3LxwFIYoPfhJg","stars":1,"date":"2017-05-13","text":"Decided to try this place out finally (Friday 5\/12\/17) and was disappointed... Came here for some drinks and to play a little. Not too many people inside which was nice for a Friday night, we were able to get 2 machines next to each other. The inside was nice and had a good feel too it. I would live to try the food but I don't think I'll be coming back. The bartender gave us no attention at all. I waited almost 15 minutes to get my second beer, And I was playing too! Once we decided to cash out we were still charged for all of our drinks (2 beers and 1 cocktail) we both were playing too. We also noticed another couple come in and sit at a table and nobody walked up and helped them at all for at least 10-15 minutes. Pretty much the service here is horrible. I'm a bartender and my wife is a waitress so I understand how it is sometimes but when it's not busy there is no reason why anyone should be waiting for a beer especially when we are there to spend money","useful":0,"funny":0,"cool":0},
{"review_id":"jW8MNU43z6hH9sco_7BX0g","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"n8Zqqhff-2cxzWt_nwhU2Q","stars":2,"date":"2015-08-17","text":"My wife and I have been waiting to go here for a while, we finally made time to bring the family in. We went around 11:30, it was pretty busy, We were seated right away, which was good because we brought both kids. Our waitress approached us as soon as we were seated and let us know about the menu and how everything works. We ordered for our kids right away and orders drinks for ourselves. My wife ordered a bloody Mary and Our waitress recommended a beer for me, so I decided to go with it. When she returned she brought the Bloody Mary and the kids drinks, 20 min or so went by and still no beer for me.... My wife decides to ask the waitress and she said there must be a problem at the bar, I noticed she went to the computer and put my beer through because she must have forgot to put it in. got my beer another 10 minutes later (30 min after I ordered it). The kids got sliders, and we ordered the huntsman burger and calamari to share. we got the burger (no side plates) and kids sliders but no calamari. The burger was delicious! once we finished our burger we asked the waitress if the calamari was coming out still. She went to the kitchen and returned with no calamari and told us our order was bumped..... Not sure what that means or how that happened. We get the calamari 10 min later and ask to get it to go since we were already done with everything else.  The food was ok, the service wasn't so great.","useful":1,"funny":0,"cool":0},
{"review_id":"jtt_fy4_u1cdgIztDz_8WQ","user_id":"xCmoFHyhcYeKxiUz6w1lWQ","business_id":"eLFfWcdb7VkqNyTONksHiQ","stars":3,"date":"2015-10-23","text":"Took the family here since we loved the Gen in Torrance California. We Went on a Tuesday night and still found a long line. Hostess told us only a 20 minute wait, ended up taking 45 min, I love Korean BBQ so it was worth the wait. The crappy part of waiting was watching parties the same size or with 1 more than our party get seated first. I decided to ask and they said that a table of 5 had to be seated first because the table of 5 was ready (we he 4 in our party) not sure how that worked. Once we were seated we were greeted right away and I was ready to order. I asked for the premium steak, 2 orders of brisket and the marinated steak. They ended up bringing everything except for the second brisket. You are allowed to order 4 meats, every time we asked for more than 1 of a meat they wouldn't bring it. Service was really good at first, It went to a crap after the first 30 min (it's a 2 hour minimum) which is fine but me and the wife didn't leave full at all. Our waiter seemed to try and not make eye contact every time he walked by, we would have to ask the busser or anyone else that walked by for our next meat. Once we were ready to go, I looked over he check and they charged my 4 year old and 2 year old 10$ each for all you can eat. They both only had rice.... Not sure how that works. Definitely won't be returning here.","useful":0,"funny":0,"cool":0},
{"review_id":"Mmw4NiGB_os9vdwMtd7ErA","user_id":"cyR413IWtGe4VVuad4P-ow","business_id":"Ehy00JWQixgoXzisVKhvag","stars":2,"date":"2015-01-15","text":"This was probably one of the worst meals I've had in a long time. First of all we were seated in some tucked away corner were we couldn't even see the restaurant and it seemed like we were a little neglected because of it. Our food came out and we ordered calamari, margherita pizza, Italian sausage pizza and some raviolis. The calamari was the only thing that was good and warm. I really liked the pesto sauce that they came with! But the margherita pizza was cold and lacked flavor, other pizza was cold and the raviolis were rubbery. Worst of all with this meal were my drinks. The water that they gave us when we first got there had a funny taste like the glass hadn't been washed or the ice that was in it was really old and had sat in a freezer too long. I thought that when I got my coke that maybe the flavor wouldn't be in that drink but sure enough it was in that drink too. Because of this experience I probably won't go back to this restaurant.","useful":1,"funny":1,"cool":0},
{"review_id":"RMisEz2shYxuN_v_3nI2tw","user_id":"cyR413IWtGe4VVuad4P-ow","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":4,"date":"2015-01-15","text":"I came to this buffet because of the ratings it had on different sites. I liked the way the buffet was set up and most of the food tasted pretty good. However there was some food that was cold or that just didn't taste right. The price was okay. It was $41 for the dinner hours.","useful":0,"funny":0,"cool":0},
{"review_id":"Lv03BsWhcwkiRx3rDcmU1w","user_id":"cyR413IWtGe4VVuad4P-ow","business_id":"eoHdUeQDNgQ6WYEnP2aiRw","stars":2,"date":"2015-01-15","text":"My wife and I went just for one of their famous sundaes and it was pretty good but the service was HORRIBLE!! We ordered and the waiter acted put off that we only ordered a sundae probably thinking he wouldn't be tipped well because we were just getting desert. In the end we asked for our bill and he gave us an empty folder. No bill, no nothing. We tried to remember how much the sundae was and put in the amount of cash that we thought would cover it. When he came back there was still no receipt or anything just the change. When my wife and I talked about it afterwards we wondered if our waiter even put our money in the register or if he was just keeping it since there was no printed proof given to us that he did or not. Anyway we will probably be back because it is pretty good for deserts and we've been other times and the service has been okay.","useful":0,"funny":0,"cool":0},
{"review_id":"x_6xVjcOJL1OCcoQiEhF2g","user_id":"V2djoi-PqvPI1HcQUiy0lg","business_id":"A8UtlAQem2hPDe-UfsvndQ","stars":5,"date":"2017-08-06","text":"This is the best Cajun food in Phoenix. Best Etufee ever. Best wings called Lu Lu Wings.  Great Happy Hour.  Have been eating there for years. Yum","useful":0,"funny":0,"cool":0},
{"review_id":"xuZRXd7IQiEKpikgW43Aeg","user_id":"2LYKerXZLs0wSSw-vRnZcQ","business_id":"B32Ghxep_UhiscserSXMSA","stars":5,"date":"2015-05-30","text":"Seeing this show earlier tonight compelled me to sign up for Yelp, and I would give it 10 stars if I could. \n\nI sat close to the stage and a small part of the first act was partially obscured, but I literally can't think of anything else negative to say about it.\n\nI was beyond impressed, and I would highly recommend seeing this show.","useful":0,"funny":0,"cool":0},
{"review_id":"u2rpsq1QFr66OURcIL-2_g","user_id":"HLTht1eRoaRjnURKVnF31A","business_id":"UCKwaY8_cgYZ4U0hZYWIUA","stars":1,"date":"2014-01-28","text":"Do not use. Not reliable. Paid $1500 deposit in Oct 2013 and still cannot deliver.  Never responded to my phone or emails. Had to remind few times. Now he wrote an email that he has filed for bankruptcy.","useful":4,"funny":0,"cool":1},
{"review_id":"NqQOlZJialMXF9QfGG4RfQ","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"lXH-2--dUls3FSPsnJFbPQ","stars":1,"date":"2016-08-02","text":"Hard to find a good electronics store.  I went here to buy an all in one printer, scanner, etc. and a new more upgraded modem\/router.  Totally expecting to drop between $500 and $600.   I had many questions.  That's why i went to the store instead of online.  I picked out a modem\/router but the didn't have the brand i was looking for.  then i went over to the printers.  Lots of sales people but not one of them asked if I needed any assistance.  I put the modem\/router back and left.  i remember the guys from FyxIt telling me to go to Office Depot.  So that's where I went to purchase the modem\/router.  haven't decided on a printer.  lots of choices there.","useful":0,"funny":0,"cool":0},
{"review_id":"SkdEa34hoRbzRZRV9qXJng","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"vqEtZ7CtNB9G8WMzjwJA2g","stars":2,"date":"2012-12-01","text":"There were a lot of choices for tequila, however, maybe a total of 3 ounces in the very well Iced drink.   The chips were interesting but the dips we had were very good and flavorful.  I had the steak tacos with black beans, rice, and some kind of pickled medley.  The place was almost dark as there was no lighting at the tables nor above us and we had to use our iPhone flashlights to read the tiny writing on the menus.   My meal was cold.   The bill was wrong but we worked it out amongst ourselves to get it right.  For $40 I don't think I'll be going back.","useful":2,"funny":0,"cool":0},
{"review_id":"meScnpbhZuOcbmXGFv4Itw","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"HsLmtdGakdgPDT7a8674Gw","stars":5,"date":"2015-04-30","text":"While on my way through Wisconsin, I searched for quilt stores.  Mill House got rave reviews and 5 stars.  Totally worth my stop.  5 miles off the interstate.  I spent lots of $$ in this place.  Loved the building, supplies, patterns, quilts on the wall, and the fabric.  Absolutely, going back.","useful":2,"funny":0,"cool":1},
{"review_id":"YGJKmW0h-qQD79qZPEf7Lw","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"5jXwI9WpDxGDmzmkmE0RTg","stars":5,"date":"2010-11-06","text":"There were 5 of us who tried Oishi.  All of us loved our appetizers and dishes.  No wait.  Great service.  The wine was excellent as well.  The atmosphere was really nice.  Not very many people in the restaurant.  It might tend to be loud if there is a crowd.  But what restaurant isn't these days!!!","useful":1,"funny":0,"cool":0},
{"review_id":"-AJdGGEkvQetQjv6jsV4DA","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"xDVK90C8qTDH5mqVQfyyjg","stars":1,"date":"2016-12-07","text":"the technician didn't even know what an intake pipe was.  \n\ntold me the bacteria fighter, which they installed, had gone out of business so they don't make any bulbs for it anymore.  WRONG!  but of course i could purchase a new system, which was a better company, etc.  I'm sure they said the same kind of sales pitch when they installed the original one.  Anyways, my bulb is ordered from the out of business company.  LOL.  \n\nThen we discussed the outtake and how it was not code, which he didn't agree with me even though other furnace people and an inspector had stated so.  after many phone calls to the engineer, it finally came around to yes, it was against code.  the engineer had to be researching it as well.  with every phone call, he kept getting closer to what i had already determined.  but of course it was code back when they installed it.  I beg to differ.  but that's for another day.  \n\nthen they also said that cutting the intake pipe just above the ceiling is common practice.  allowing all the crap, dust, mice, etc. to fall into the intake pipe.  most furnace people tell me they have never seen it cut off above the ceiling.  ABSOLUTELY RIDICULOUS BULLCRAP.  \n\nNEVER USE THESE PEOPLE!","useful":4,"funny":0,"cool":0},
{"review_id":"Codot3PgejUX2Efqp7dD7A","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"6jsuYyjUM45WAX-6SxOQgQ","stars":1,"date":"2014-03-27","text":"I ordered sweet cream ice cream with pecans, raspberries, and fudge.  when I got to the car I had eaten most of the topping.  They only put the extras on the top.  Made it look like it was mixed in.  I think this is really, really bad business and makes it even more expensive.   Never again.","useful":1,"funny":0,"cool":0},
{"review_id":"gXmHGBSBBz2-uHdvGf4lZQ","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"u8C8pRvaHXg3PgDrsUHJHQ","stars":2,"date":"2016-08-08","text":"just went to a retirement party upstairs and the pizza was stone cold.  I guess there's no warming trays.  this was 40 minutes after party began.","useful":1,"funny":0,"cool":0},
{"review_id":"QbCLnBc3DoYalX1Ty2tCtg","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"f_CDR6H4QL1K3SeaBe7r3g","stars":1,"date":"2014-05-01","text":"food was good but when the owner started yelling at the waitress that's when I said i'm not coming back.  NEVER NEVER NEVER do that in front of your guests.  Actually, yelling rarely gets you anywhere with people.  She wasn't at fault.  sad sad place.  I've put this on here before but for some reason, my review was taken off.  wonder why or  how???","useful":8,"funny":0,"cool":1},
{"review_id":"8dD2z_3GufFoE3Nn-TKd5A","user_id":"tFa-r1pxZh04FjxNSEQgcQ","business_id":"ovApUucCKSb9k0lTP2JieQ","stars":5,"date":"2014-05-01","text":"We ate there last night.  Noticed the outside looks inviting.  Nice comfortable booths and tables inside.  It's small but that's what so charming about the place.  The option of 3 sauces with your chips is totally amazing.  I tried them all and ended up mixing them.  I just wonder what happens to them after people are done???  are they recycled???  The waiter was attentative and the food was very flavorful, too. Very large soft drinks.   Hand made items.  I think it cost a little over $20 for two adults.","useful":0,"funny":0,"cool":0},
{"review_id":"uuyB11QD06gVVhkVwdQokA","user_id":"UTzMpMc_OePUDXsCA-_fYQ","business_id":"BobahD-Pr-nsZLoUMiS02A","stars":5,"date":"2015-01-17","text":"Simply incredible. These guys have the latest gear in stock, the staff is polite, helpful and they know about the products they're selling. Another great thing is that all the items (At least all the ones I've seen) are MSRP. This is the best football gear store I have ever been to by a mile.","useful":0,"funny":0,"cool":0},
{"review_id":"snh5MuSHc1j9l5eEazgHJA","user_id":"otDVyX37h61WEbqPLEjCmQ","business_id":"DgHXVoAZ4XzbcQMahuJCbw","stars":5,"date":"2015-03-22","text":"Excellent place, great food and great presentation!\nFirst time in this restaurant and I love the breakfast. \nThey have excellent service too I fully recommend this place for a nice breakfast time and for great prices.","useful":1,"funny":0,"cool":0},
{"review_id":"u-zqCN_IXfypJIUzIVUuzw","user_id":"otDVyX37h61WEbqPLEjCmQ","business_id":"-9nai28tnoylwViuJVrYEQ","stars":5,"date":"2015-03-22","text":"Great restaurant and great atmosphere.\nI had an awesome great time with friends.\nI loved the tapas and the excellent paella.\nI can't wait to come back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"hMP96UneEHdfKL_eG3N4_Q","user_id":"NeUaj-b0YQSzWSaJAsWGlg","business_id":"c_a2KzQOrR-0SJfoPPGHXA","stars":5,"date":"2015-03-23","text":"Ralph was recommended to us by Mike at Storage West on Bell Road in Scottsdale.  We had a request for someone to unload our truck in short notice, he was able to accommodate us very quickly and efficiently.  Most professional and very careful.  Would definitely use them again.  Thank you","useful":1,"funny":0,"cool":0},
{"review_id":"aBH2DNU5LwIXV9PY0VRx-g","user_id":"91BAQVLO9EJgt3T6r1WxFg","business_id":"6nA-ysErC9N5-4oaY4HE3A","stars":1,"date":"2015-04-10","text":"Wow again..... Rob speaks of not knowing what he's getting in too in some people's vehicles(his words) I agree. He did make a complement of the rear DVD player and how good of quality it was before it broke tho. He claims he tested it after he broke it?. Lol. I had to buy a new one as the ribbon was ripped out and  unfixable.   As for the dash left loose on the friday....... Nicki robs wife and the installer odie who did the work sure were surprised when I went back in to tell them about it.... No mention of that.  My new installer said 3 out of 4 clips were missing no big deal. Why would you ever leave someone dash loose for a weekend ? Either stupid or lazy falls into this category.  But moving forward. Again not his fault, but it's His NOT GIVE A Sh@t attitude is what bugged me the Most. I understand things happen I'm a contractor,  things happen and it sucks when they do. but his (I'm the boss of this place and I don't care attitude)  should keep everyone away from there. I'm not unreasonable, bad things happen. I would have bought one hopefully at cost or something but no.  So that's the loose dash and broke rear DVD player covered. \nOn to the remote starter....... My new guy said the remote start was wired backwards or something (positive\/negative something or other) and that's probably why it wouldn't start with a key and when he took out the old remote start he wired it to something wrong and crossed something a rookie mistake as he put it. As for the marker lights again....... My hummer was brought up from the states just for me. I know rob wants to hide behind Nikki's Avalanche saying its the same wireing but I'm afraid he is wrong again. My buddy has a 07 hummer also and his lighting system works as it should with the turning knob on the dash to turn his lights on and off at leisure (day or night) but yes it has drl's but not it park.  My lighting switch was useless to me after my ROAR experience as it was impossible to turn my lighting system off at night( in park, emergency break on, tried everything). On is on and that's it. Never mind that little turn knob. That's just there for show as far as roar is concerned and I'm full of BS because Nikki's avalanche is the same way. In robs defence he did install the same remote start in it as is in my hummer so I could see why Nikki's Avalanche doesn't work too. Do they have anything in common ? don't know, Or was it his hack job talking out the old remote start ? Still didnt know. Thank goodness my new installer has figured out all of roars mistakes and hack job taking out the old remote and got me back on track.(at a cost of course)  \nSo that's the remote and lights out of the way now. Let's move on to the smoking in my ride. Like I said I'm a contractor... I know what cigarette smoke smells like and what soldering smells like. But I guess he has to defend him self by saying something. I think most people know now a days what cigarette smoke smell like. \nAs for guaranteeing there work. Yea as long as you don't come back. Lol. \nAs for the video ! Let's see it! Post it on YouTube. The last five minutes UNCUT ! From me walking back in and asking for my keys back, To me and my wife leaving. Lol Rob and myself both know, Nikki more than Rob but still Rob was freaking out yelling about how nothing is his fault and remember I was such a nice guy I even offered to buy the harness Rob was freaking out about he had to special order in and he wouldn't sell it to me because they were so mad and yelling ! In robs comment to my comment he said it was unprofessional of them not to sell it to me.( because they were freaking out) Makes you wonder now doesn't it.  Once they freaked out My wife did raise her voice for a minute over the alleged kill switch they lied about. I would love to see the video and audio. Show everyone how crazy mad they were and how calm I was.  We all know that he will never leave a YouTube address to it on Yelp or text it to me and I'll do it, because he's lying again.   But remember if you do UNCUT ! People like Rob at Roar like to say all sorts of things, but back it up with the video and audio ? Won't happen. \n\nAgain. Don't walk away from Roar Truck and Auto Accessories.....RUN. \n\nI don't expect a response this time. \n\nOne last thing, because I'm the honest one here, They did text me (real professional) to say the remote was in a week and a half later, after I bought another one. Unfortunately I could not be the one to pick it up and show roar my lights working. But you win some you loose some.","useful":3,"funny":1,"cool":2},
{"review_id":"Jef5U_XCGdyV71Q0ZW93sg","user_id":"RiQlTWOiOduoGSUcgJ4DhQ","business_id":"c5mnoNYWzsw_gJSZ0C4b6w","stars":3,"date":"2015-01-25","text":"The pizza was good except for the canned mushrooms. I can't stand canned mushrooms on my pizza. Did I say I can't stand canned mushrooms on my pizza. I didn't think anybody used canned mushrooms any more. I don't think it's fresh crust either even though it wasn't bad. Plenty of other pizza places around","useful":0,"funny":1,"cool":0},
{"review_id":"6Mv_I3h3Lz9sLEQz-8o-eg","user_id":"F-3G_vBR7PogewYRnRPDZA","business_id":"HbUGYn_IOzPIs4fCfm3MtA","stars":1,"date":"2017-11-30","text":"The landscapers at this community are totally disrespectful of the neighboring communities.  They blow dust over into our backyards every time they clean the PARKING LOT.  I mean bougainvillea flowers, pollen, dirt.  What the hell!  There is no number to call to take care of this.  Carescape I am looking for you.","useful":1,"funny":1,"cool":1},
{"review_id":"Fv_J6xMPOuFpPn0M19yZqw","user_id":"bSZZL5ppN3EouTxXne-5cQ","business_id":"KsNqDl6x8IHWYg_xB-HaCw","stars":5,"date":"2017-01-09","text":"Excellent job on cleaning a massive white couch that I have.  Could not be happier with the service, promptness, and professionalism.  I would gladly recommend Sunrise to my friends and colleagues.","useful":1,"funny":0,"cool":0},
{"review_id":"ydFDT5HuPzUGZuE-8jFRxg","user_id":"bSZZL5ppN3EouTxXne-5cQ","business_id":"_XN-GwzZwAyIqLKJsl2htg","stars":5,"date":"2016-10-23","text":"Best sushi mexican combo in town. If you like a good stmosphere and great food check Sumo Maya out.","useful":0,"funny":0,"cool":0},
{"review_id":"Oz-j10W1sICh6b7Xh6OA2w","user_id":"bSZZL5ppN3EouTxXne-5cQ","business_id":"I-Wdj0JxnvA4drpB_8Y3Hg","stars":5,"date":"2016-10-23","text":"We just used AZ Elite to go to the Cardinals game and had such a good experience i felt inclined to write this review immediatly. Our driver stopped for road drinks, pee breaks, and to yell at Seahawks fans. Long story short this company rocks. Check them out","useful":0,"funny":0,"cool":0},
{"review_id":"zvBNnKrEsU6eZ8NsEhQiug","user_id":"g_gsvkA4Qd1FxSAv2LF6ag","business_id":"NlymcSxDnjtCLyGvmMoyFg","stars":5,"date":"2012-09-26","text":"I've never been disappointed with Aloha Kitchen...well, other than showing up on a Monday ready for lunch and then remembering they are closed on Mondays. My personal favorite is the Mix 1 plate...lightly battered fried mild white fish, teriyaki chicken, rice and salad. Time to update the decor though, been the same for a couple decades now.","useful":0,"funny":0,"cool":0},
{"review_id":"8-N8VQN0e7W8aroJ8ywczg","user_id":"UE5sR2EScEusBQs3LEKOaA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2016-06-10","text":"I would've given this 5 stars if my steak didn't have to be sent back 4 times... I asked for medium to medium well, my first steak was pretty much jerky, and the next 2 were RAW. Completely raw. They made up for it with their amazing service, yummy food, friendly staff, beautiful view, and free dessert for the hassle with my steak. I can't wait to go back!","useful":0,"funny":0,"cool":0},
{"review_id":"0HszvTnOWnD7-4nNlVFVyw","user_id":"IvEPT2F0xASVzJ67W0Mj1A","business_id":"W_vry4AJBX69M46ftQ6KLg","stars":5,"date":"2017-01-17","text":"Outstanding move!  We've moved many, many times and the Dose Moving team is superior to others by far!  Move was scheduled professionally, and we received confirmation emails and texts.  Jim and his team arrived promptly when scheduled and were professional, friendly and thorough.\n\nWe will definitely use Dose in the future and highly recommend them to others.\n\nThanks to all!","useful":0,"funny":0,"cool":0},
{"review_id":"4BJigYes6ZYkiOoB3OgnOA","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"kOFDVcnj-8fd3doIpCQ06A","stars":3,"date":"2016-01-06","text":"I cane her a few friends expecting a fabulous meal. Sadly I don't get this.\n\nPros:\n\n-Server was great\n-Orange  juice was...Awesome!\n-Ambiance is wonderful (especially outdoors in the summer)\n-Option to make a reservation and they call or text when available\n\nCons:\n\n-Menu was pre-set \n-Food took along time\n-Food came COLD\n\nOverall, I will try again and hopefully get the same server and a better meal.","useful":0,"funny":0,"cool":0},
{"review_id":"Ezbznt9i4cxb0pJ0pFy54A","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"423vNxYGvBt_RXn_lI0aKA","stars":1,"date":"2016-01-12","text":"The ladies can barely speak English and this is annoying. Why have a business if you can't communicate properly with your customers?\n\nThe worse part is that they cleaned my boots and the fur was damaged  on one of the boots.\n\nThey tried to get out of fixing it but I insisted or they would have to replace them entirely.\n\nThey got fixed and had the nerve of asking me to pay for it..\n\nNice try! Never will I recommend or return!!","useful":0,"funny":0,"cool":0},
{"review_id":"7alOjffDq6UmM5j23ExJMw","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"KMWaFPLvtY-TCOoqMmkoyQ","stars":1,"date":"2016-02-11","text":"Yuck.\n\nThis place is disgusting. I came in and tried to stay for a drink but couldn't finish.\n\nThe place stinks, and is filthy. Look at the slobs who bartend!\n\n\nGross.","useful":1,"funny":1,"cool":0},
{"review_id":"OtyIDovYYp4uNVV1UpfOUQ","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"Zr3ztn_ulr3bFi1lbfDl1g","stars":4,"date":"2016-01-12","text":"The Asian lady who owns this place is a really nice person.\n\nShe has great prices and the work done is excellent!","useful":0,"funny":0,"cool":0},
{"review_id":"ouwpEhaR4PuR64xdQXgVNw","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"y7UUiljzZTO92IUkha39zA","stars":3,"date":"2016-01-06","text":"Melissa us a great instructor. \n\nI wish it was on the ground floor as there are at least 200 steps to get upstairs are they are steep!\n\nStaff (front desk girls) are borderline dummies and incompetent...\n\n\nPlace is also expensiveeeeeeeeee!!!","useful":0,"funny":0,"cool":0},
{"review_id":"fDPmuZUxdYBZpNtjiD9YXQ","user_id":"OsqB8jvW-JVvE55o3jYBbw","business_id":"StjUke9uj6T6qB4hpyzMMA","stars":3,"date":"2016-01-16","text":"I like a few items on the menu:\n\nSquash tacos\nFries\nDaily soups\n\nAnd the awesome green candy drink.\n\nI usually grab my \n\nI'm not a fan of the slow service and loud atmosphere but will eat here if I must.\n\nWhy does heathy food have to be sooooooo expensive??!!","useful":0,"funny":0,"cool":0},
{"review_id":"uILB0p8HU_59V-iLV8hB8Q","user_id":"15BIjWm5VDEBjLrJXs7EoA","business_id":"eMZCjoaksEf_sXrmCOB5uA","stars":5,"date":"2014-01-18","text":"Finding this place was one of my luckiest days.  I have had lower back problems since 2008.  After numerous chiropractor visits and shots my back would still be in pain after short walks and prolong standing.  After several weekly visits to Head Foot Spa my lower back pain has been noticeably less. I no longer feel pain on a daily basis, and it is all thanks to the great staff at Head Foot Spa.","useful":2,"funny":0,"cool":0},
{"review_id":"Ds6HZWiHnFZogunC45XCcQ","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"8mP0gQrTZa_FiUP706x2tg","stars":1,"date":"2015-06-11","text":"This place is pitiful.  Not sure if the people in the review have ever had good food, but this place isn't it. Got the sampler platter of perogie and they were clearly  made out of cheap and pre cooked materials. The meat was grey and I didn't risk trying it. Everything was over salted. We also got the kelbasa and the cabbage rolls. Also a huge mistake.  The only thing out of the wholemeal that was eatable were the fries. Totally disgusting.  Wish I could  give it a negative review.","useful":0,"funny":0,"cool":0},
{"review_id":"dz6GtNJoMposnxjwOBfF-w","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"Ip5IQLwjFzmr_X03pNH7pg","stars":4,"date":"2015-12-09","text":"Quiet little place with nice atmosphere and pleasant and knowledgeable staff. We came in for dinner and I had paneer in creamed spinach which was tasty. My husband had chicken Tikka  masala which was tender and well prepared. Portions were huge and we took most of our meals home. Although the flavor was good the sauce was too creamy and on the heavy side. \nWe would like to come back and try something else.","useful":0,"funny":0,"cool":0},
{"review_id":"Hs-RKXgXtnukSzumkezb3w","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"USleI8g1UVN9-9jm-b4uIg","stars":3,"date":"2015-12-09","text":"Celebrated my birthday here. Heard great things about the place and the reviews are great. At the end of the night we were a bit disappointed. Nothing spectacular for the money. We had the apple purse which I think would do well as a dessert, very sweet soaked in butter and heavy sauce.  Sweet breads had good flavor and were cooked well.  My husband had the elk that was well prepared but garnish was somewhat dry. The rabbit was again very heavy with cheese, cream sauce and bacon. Silk pie was our favorite,  although my cinnamon bun special was dry and tasteless. Not as good as we were expecting. Probably won't be back","useful":0,"funny":0,"cool":0},
{"review_id":"1fJlSMMFcgalj6TVg8pn7g","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"btA8NopfIYf7MAJ-KwhI3A","stars":4,"date":"2015-12-09","text":"Been here a few times. Sometimes the food is spot on and delicious and sometimes not so much. The apps are always good and so are the desserts. \nMain dishes especially the steak is always leather like and very hard to digest. Chicken, soups and breakfast items have always been tasty. We've been here a few times and enjoy most of our meals. As a non Spanish speaker we try different stuff and some of it might simply not be the flavor and preparation we're used to.","useful":1,"funny":0,"cool":0},
{"review_id":"fDlo0EWJqRHo-LhSJEjuEg","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"RAKSBqeNb-p_ZABwAWH_jA","stars":5,"date":"2015-07-10","text":"LOVE this place! The ingredients are always fresh and  all dishes have great balance in flavor. Sashimi salad is delicious and fried calamari app is airy and crispy. All of the sushi rolls I've had are yet to disappoint.  Will keep coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"Tbg3bygBhOFa1j0AlfTUfQ","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"88TyKo52CRajXHxWlS5eEQ","stars":5,"date":"2015-07-10","text":"BEST CREPES EVER! Had just about every crepe on the menu. The crepes are very thin and the ingredients are always fresh. Best part is that it's made to order and you can see your meal being prepared in front of you.  They also have amazing coffee and some of the best loose leaf tea I've ever had. The lattes will keep you coming back day after day, and I love their mago and peach tea which are also individually brewed and can be hot or over iced. I love mine iced especially on a hot day. Also the owner are some of the nicest people, always make you feel like fily. Thumbs uppppp all the way!","useful":0,"funny":0,"cool":0},
{"review_id":"MsNccewtFN_q8Dfpw344vQ","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"TTFbaLpIwrjFx7YIL2pbJA","stars":1,"date":"2015-06-11","text":"We moved from Michigan and were craving some Arabic food. My husband and I came to eat here but were beyond  disappointed. All the dishes were poorly seasoned and the portion size was tiny compared to the price. We would have gladly paid the price if the food was any good, but this wasn't the case. After a few months many friends have told us that the place had improved tremendously and we just had to give them a try again . So against our better judgment we went back. \nThe portions have improved but the food was still sub par. The vegetables that came with our entrees were boiled instead of being grilled and included celery.  Kinda tasteless and unappealing.  The variety meat platter was overcooked and all the meat except the chicken was dry as the bottom of a shoe. The only thing that was semi tasty was the salad, that came with the meal. Needless to say we will not be going back.","useful":1,"funny":0,"cool":0},
{"review_id":"m9m6D8Q4WS6DsMkI3-rDtA","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"qqIgj3vpc54Bab5xWfwONA","stars":5,"date":"2016-06-09","text":"AMAZING!  Best Lebanese food in Charlotte. The spices are right on ,and prices are fantastic!  Coming from Detroit, we've been missing authentic Arabic food. Trust me when I say that this is gonna be your favorite Mediterranean joint in the queen city. Keep up the good work.","useful":1,"funny":0,"cool":0},
{"review_id":"cHujgbV6H_9UUdPnEGkB0Q","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"aoI2PcLmH5586QJja1o1ww","stars":1,"date":"2015-06-11","text":"This is not a spa review but a review zof the Figure one studio. I was so excited when I found out that there was a new yoga studio so close to my house. Bought a trial one month package and was only able to attend a few times. First of all the studio itself is tiny. The bare walls and windows  create an echo, which is super irritating. Secondly, the infrared light smack in the middle of the room either roasts you to an uncomfortable temperature or you barely get any heat if you're  in the perifery  of the room. Thirdly, although there are a few scheduled  classes during a day they require you to sign up through mind and body to be able to attend, and make sure that there's a teacher there. So if you find a minute to come in without signing up ahead of time , there's a good chance they won't be open, unless some other student signed up already. Lastly, from the few classes that I actually got to attend, the teachers  seemed a bit disjointed.  There was no real \"flow\"from posee to pose. Bottom line, the studio is too new and needs to work out a LOT of kinks.","useful":1,"funny":0,"cool":0},
{"review_id":"N7DVga2oT-OwL0H412Xlgg","user_id":"TpFBwYXO1qFTzBkgpFqpAg","business_id":"diThW1PH8u7q6DY8dlFgJg","stars":4,"date":"2015-07-10","text":"Great little place in downtown Matthews.  The selection of Belgium and domestic beer is great. A bit on the pricey side , you can get some of the same stuff  at the wine store at about 20% less. Great place to relax although if you're coming after work you may not get a place to sit due to the size of this place.","useful":0,"funny":0,"cool":0},
{"review_id":"DaEqE75hB2au2zmjxvEeDg","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"7S_xPzT2mKDGddfY2oOxSw","stars":2,"date":"2017-12-05","text":"Ordered the salmon with asparagus, vegetable and baked potato. Could hear the microwave being worked hard and honestly believe that every part of the dish was microwaved. The salmon was dry and over cooked. The asparagus was stringy as if it was reheated. \n\nWe also ordered the chicken parmesan which was presented as a chicken filet covered with a slice of melted cheese and tomato sauce. Did they run out of breaded chicken or bread crumbs? If so, then the cook should have advised that grilled chicken would be used and charged accordingly. When you order chicken parm because you are in the mood for chicken parm, the camouflage does not work. Not very busy for a Monday night. So perhaps the cook was having an off night. Maybe it will be better on the weekend?","useful":1,"funny":0,"cool":0},
{"review_id":"kho3JK-tYHwrvQvO1P9GiA","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"CvOxwAhmwwy3sQRKYVAjGg","stars":3,"date":"2012-03-07","text":"Came by in mid-January  and the business has closed. Handwritten sign in window thanking customers after many years in business, they could not reach a new lease agreement.   They even wished the next restaurant that moves in good luck!\n\n***** This place has re-opened under new ownership.  One of its former employees re-opened the place. a couple months ago. update as of nov 2012","useful":1,"funny":0,"cool":0},
{"review_id":"M7Z5Amk2UlwXshhnsSKAFQ","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"3vhJVMVkWI49NpzeefFBfA","stars":3,"date":"2012-03-11","text":"Nice to find a traditional Scarborough establishment.  A place that has been around longer than me!  They still cook old school, like the way it was back in the 1950's with lots of butter to fry your egg.  My friend and I stopped by last Saturday in the late afternoon so there were no crowds. Decor from decades ago, but the place was clean.\n\nOrdered coffee $2.15 (got one top up) and \"Eggs\" which was 3 eggs with potatoes. The price after breakfast hours was $8.45  . The Eggs and Sausage was $10.45, comes with 4 links of sausage.  When the toast came out, it was glistening in good ole butter!  The way I used to butter my toast when i was a kid! \n\nFriendly service.  But like the other reviews said, fairly pricey for such a basic breakfast.  It is a place you want to try out at least once to say you've done it and then maybe come back after a few years for the novelty. . Although for nostalgia, I hope the place does stay open for many more years to come.","useful":1,"funny":0,"cool":0},
{"review_id":"MZx7g3z08zQag8ID3f_EMg","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"FjhxXDhiqUAkz2Bn8I6yRA","stars":4,"date":"2017-12-26","text":"This place inside Woodside mall has been here for years. Came here quite a few times 17 years ago but probably haven't been here in over 6+ years.\n\nHad the large noodle with rare beef and brisket. The noodles were nice and the broth was very tasty. The meat portion could have been a little more generous, but overall it was a very tasty and not too heavy meal. \n\nPrices were good. $7 for small $8 for large. Only accepts cash and debit. No credit cards","useful":0,"funny":0,"cool":0},
{"review_id":"lQ0nVSUvkvhuSOvEOjQEmw","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"PceXxh4TQC7w8TuWcPphmA","stars":1,"date":"2013-08-18","text":"Was there on a very hot Saturday in July.  Felt stifling as either the A\/C was not on or it was very low.  Ordered the eggs Benedict on steak. $13.99  It was not good at all.  The steak had no flavour and so tough and dry, I could not eat it at all.  Better to have just ordered it without the meat and save the 3 or 4 bucks.   One cup of strong coffee was $2.25, did not receive a re-fill.  I won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"zGx68_laSIEkWY3RlEdwHA","user_id":"wXdL__0_Vd53Q8U-tOKXEQ","business_id":"v-supbjeNBKNwomn3sLc8g","stars":2,"date":"2017-12-26","text":"Came here for dim sum yesterday, Christmas Eve. The place was packed but the line up wasn't overly huge at 1pm. \n\nAll I can say is the food looked and tasted \"bleh\".","useful":0,"funny":1,"cool":0},
{"review_id":"1S-gMxt9XV32iPqF9AhmPw","user_id":"XoS2zjvJi5a6Y3AMfMOXxw","business_id":"wQgrF0VjsOu-_zB58MPr-A","stars":1,"date":"2015-08-21","text":"Beware La-Z-Boy does not stand behind there products.  We purchased full living room set also the Ultra Shield protection plan. I had to make a claim to Ultra Shield they sent someone out to look at couch. Ultra Shield says its manufactures defect. Matt at the local La-Z-Boy says it is not. He can make this statement by only seeing pictures. Beware of buying La-Z-Boy. It is sad when you think you are buying quality and turns out not to be.","useful":1,"funny":0,"cool":0},
{"review_id":"RYpaaKfSynaz6xjLW63CnA","user_id":"XoS2zjvJi5a6Y3AMfMOXxw","business_id":"PcemwEbN_fxwV339rWEj9w","stars":1,"date":"2016-01-08","text":"I hired this company to help take care of my mom. They are unreliable caregiver was late more times than on time.  Scheduled one evening and caregiver never showed up.  When billing came was charged for time caregiver was late even when no one showed up.  Only hire them if you have a backup plan because you never know if they will show up and they have no backup.","useful":3,"funny":0,"cool":0},
{"review_id":"-VTdSa4feIXI1SYddE9Qqw","user_id":"OMMjXZuLVGBGoFI72_lvjQ","business_id":"bLhH9B7KbLJb_rvPzPauFw","stars":1,"date":"2014-03-06","text":"I used to really enjoy eating here until I found out what one of my friends said about this place. He was a former employee of this Jimmy Johns on Power Road and told me about all of the comments that are made behind the counter. Who would've known such a fine establishment could be filled with so much cynicism and racism towards employees. Basically authority will take the nicest employees and then find reasons to take them down verbally with repeated vile comments day in and day out. Nothing like sandwiches made by discriminatory top-level management what taste better than a prejudice filled sandwich I thought sandwiches were made with passion at this place.","useful":1,"funny":0,"cool":0},
{"review_id":"EUOvrYYLb2foXfCv4Y-OXA","user_id":"MPirgtwNGBD8U-R7p6wXyQ","business_id":"NY80DkkCfEl198JmwtO4pA","stars":1,"date":"2016-01-13","text":"It gives me no pleasure to write a bad review, but Harrah's deserves it. Today is the second day in a row with no housekeeping. Trash not picked up, no toilet paper, no clean towels, no bed made. My husband called management to tell them and management tried to blame us for \"leaving up the 'do not disturb' sign.\" Nice try, but no, the do not disturb sign was never up. Your housekeeping staff simply forgot us. Two days in a row. A better management response is to apologize profusely for the oversight and to assure us that housekeeping will be dispatched at our convenience. We are long-time Harrah's customers, but I feel that they no longer care about our business. This is supposed to be my vacation and here I am: angry, writing bad Yelp reviews, sitting in a dirty hotel room, waiting for Harrah's mythical housekeeping staff to show up.","useful":1,"funny":0,"cool":0},
{"review_id":"P-nyr8-wQxF_JeTiDjE0Yg","user_id":"7EN-ysxb7TWAbrrd7PT07w","business_id":"4v5ZLpmNn13Mze1w_XfWHw","stars":4,"date":"2015-12-10","text":"Great BBQ and service. Cool collection of Harleys as well.  Happy hour is nice and long. This is my 2nd visit this week.","useful":0,"funny":0,"cool":0},
{"review_id":"PnAb8TBABNjU9ZGk6mieLw","user_id":"7EN-ysxb7TWAbrrd7PT07w","business_id":"djbZ5uQPKw9N4Dq9QXhdNw","stars":2,"date":"2015-12-10","text":"Big Twin Peaks but very expensive beer- $9 for a Coors lite that would be no more than $6 at their other locations.","useful":0,"funny":0,"cool":0},
{"review_id":"9_fIsYJiSBkrxchGyJzMfA","user_id":"EQ3HihRx7sHg1dYhBY_p1g","business_id":"qwotyk_DR6rD7hNM0rtVIg","stars":5,"date":"2016-07-08","text":"Everything is excellent. Excellent tomato basil soup. Great peanut chocolate pie. Art upstairs is also very good.","useful":0,"funny":0,"cool":0},
{"review_id":"_wVs8EHmnSiwuKfREr2w_Q","user_id":"G0cndx0VxOSrMmrtuOqheg","business_id":"vyEetoXzGq9vBTWpOu85pQ","stars":1,"date":"2014-03-11","text":"Between the servers talking crap about patrons or the servers kids running around my table and honestly its about the homeliest staff ive ever seen i cant go back. The servers need to shut up and the person who hires needs to be fired","useful":0,"funny":0,"cool":0},
{"review_id":"y4JRZFmp-oO5pZDPzxQ3JA","user_id":"aVPsI_2b3FutGqg7q44NCg","business_id":"YauBkH-HEx148jC0pv4Hcg","stars":4,"date":"2014-01-31","text":"Happy Hour is AMAZING there - the calimari and roast beef sliders the best of the bunch.  I also enjoyed the fish, branzino, I think it was.  The siracha chicken sticks were not fully cooked, which was a bummer, because the sauce was good.  I could pass on the mashed potatoes, and side salad.  Also, it's valet parking only - so bring extra for the valet drivers.\n\nI probably wouldn't go here for dinner, but would be there in a second for Happy Hour.  :)","useful":0,"funny":0,"cool":0},
{"review_id":"XLlneTHF6ScpAcAcETsi1Q","user_id":"aVPsI_2b3FutGqg7q44NCg","business_id":"eVWUuhlsSd0EegXKaN1O4A","stars":2,"date":"2014-01-31","text":"Had 2 sweaters, 1 shirt, and 2 coats to be dry cleaned.  The coat was returned to me after 3 days, saying they can't service coats with plastic buttons.  Earlier notification would have been better.  The other items were cleaned satisfactorily, though I would have liked them starched a bit more.","useful":1,"funny":0,"cool":0},
{"review_id":"X9fM2NYCzCaaV2EO_oALgA","user_id":"MB17I9YMXJfxQXq40F_ZBA","business_id":"uk5SCIvcDNvZENSpuJjR8A","stars":5,"date":"2015-04-10","text":"Great staff, decent machines, great atmosphere! Excellent swimming staff! Overall great place to work out and practice. Five stars from my end","useful":2,"funny":0,"cool":0},
{"review_id":"UiGV5KWuHont-oyCkkQrFw","user_id":"FGDmWgUKbNu0fIWVRWnmiA","business_id":"S_JZst0IGCads_KhoueMCw","stars":5,"date":"2016-10-22","text":"Me and my sister has been looking for an autoshop to fix her car's dent., we've been to several autoshops but all them charge us way too expensive than it should be... then we saw this metropolitan auto center.. then a guy named jason assisted us... he patiently explained everything to my sister what has to be done.  And did everything he could to get my sister a huge discount... if you guys are looking for an autocenter you should visit this shop. And look for jason., actually all of them are nice.. (thumbsup!)","useful":0,"funny":0,"cool":0},
{"review_id":"0AzcQjYM0IECWirqeybCaQ","user_id":"ZYonmB_jBW5XcRMIes78KA","business_id":"ooEGT0bvsVkSafMnoU3LQw","stars":1,"date":"2016-02-06","text":"Since the Greek guy who owned this place sold it to the owners of Involtini next door the quality and taste has gone totally downhill. We use to order the baked spaghetti and lasagna all the time and the pizza occasionally, but the quality of the food and the attitude of the service has kept us away. We're done here.","useful":0,"funny":0,"cool":0},
{"review_id":"Ak6-Ja1q1xZVFiXu9sbO1A","user_id":"1iIrTFtShtNrZiKmRc_Nlg","business_id":"OfQE96Rry--Lu1WMjsJy3w","stars":5,"date":"2016-05-24","text":"He did a great job. After Nother company try to jack up my prize by $80 when they showed up he was there within one hour doing a job for the original bid. Work was beyond my expectations great man will use him again","useful":3,"funny":0,"cool":0},
{"review_id":"GEDrwDEiMo6zpA827O_Z1g","user_id":"1iIrTFtShtNrZiKmRc_Nlg","business_id":"ENzLJkb8eXP8fGBzG5aGXg","stars":1,"date":"2016-05-24","text":"These people came to my house and try to jack up my price by almost $80 from what we originally discussed on the phone do not call these people","useful":3,"funny":2,"cool":0},
{"review_id":"fMTWrNWZvcKYzNiGj2vfvA","user_id":"1iIrTFtShtNrZiKmRc_Nlg","business_id":"0NT3Hhu2RcAmFKBy2BiRmQ","stars":5,"date":"2017-11-12","text":"John A my server recommended the best chicken and waffles I have ever had.  The cajun backed fish and smothered chicken outstanding.  We will be be tomorrow.","useful":0,"funny":0,"cool":0},
{"review_id":"umIdYR7vMh7X1qIS2KM6sw","user_id":"8_2lo1CUkuRbEvWij73NRg","business_id":"ENzLJkb8eXP8fGBzG5aGXg","stars":5,"date":"2015-06-08","text":"The crew arrived on time, even though they called ahead to say they might be 10-minutes away. Their professionalism is outstanding and my carpets were spotless -- even though I had some stubborn dirty high-traffic areas. With so many carpet cleaning scam companies out there, J2 delivered on price and service and I would GLADLY use them again!","useful":0,"funny":0,"cool":0},
{"review_id":"M87W5Kz1dTku9HMsd8K3Dg","user_id":"qnc_q8MGp5utaPRsYx7gyA","business_id":"YPyzzWmKH49ZeAE5XhPjNw","stars":5,"date":"2017-02-01","text":"Awesome group of people. Very friendly and knowledgeable. The doctors treat you special.","useful":0,"funny":0,"cool":0},
{"review_id":"rR8pEBAsamdTqjeTm8uh3Q","user_id":"GzyYGbjQaDyEU5EXtF7tRg","business_id":"WYw3Uf56DT5IwpaLNnCH5Q","stars":1,"date":"2013-10-31","text":"Choose somewhere else to stay while in Vegas!  I do NOT recommend the Vdara.\nWhen I checked in, the gentleman was fantastic and very nice....THAT IS THE ONLY TIME ANYONE IN THE RESORT WAS NICE.  Most of my interactions with staff were very short and they were very rude.  The worst- is the amount of children roaming lobby, halls, strollers everywhere....I love kids and if you have them-this may be a fantastic place for you to stay...because it is a lot like one giant day care center.  On my floor....there were babies crying 24\/7 and kids literally bouncing off of the walls....all times of day!!  It was almost as if someone left their kids in the room next door to me for 3 full days...morning, noon and night.  If you are looking for a romantic time...or a fun get away...or rest and relaxation---DO NOT STAY HERE.  Now to the food- AWFUL, bad and AWFUL.  I would not waste a penny on food at this place- ordered room service breakfast---$40 and it was awful.  Had a grilled cheese sandwich- $13 at the caf and it was burnt and had one slice of store bought sliced cheese on it...AWFUL.  Do not waste any money on food here.  It is amazing to me that their little commercial on the TV in the rooms say....\"elevate your expectations\" at the Vdara.  The rooms were ok....but not anywhere near what they advertise...they try to advertise like it's the Ritz or 4 seasons and when you walk in---it is IKEA, AT BEST!  Another very annoying detail....if you are going to have security ask you for your room key each time you enter the elevator bank---EDUCATE them.  Let's see ---I was at a business conference in the Vdara, so in and out of the room several times a day.  If they see the same person 4 times in an afternoon---WITH A NAME BADGE ON AND A BUSINESS SUIT--one would think they would recognize me?!?  hmmmmm ....I sure could tell you who was standing there all the time.  So annoying and really just amusing that they need that much security?  Or what has happened there?  And why on earth when you see the same person 3 times within 3 hours you do not recognize them?  I find it amusing on some of the other reviews they mention 2 free bottles of water---??  Never saw them???  Also- no coffee maker in the room- NOTHING?!  I recently stayed in Vegas at the Golden Nugget downtown Vegas and they had a great little one cup coffee maker in each room.","useful":1,"funny":0,"cool":0},
{"review_id":"pXk_i4tbwFTWCKeMtF9obQ","user_id":"IPsjfvrvTMSvENSim1TBiQ","business_id":"1Vvxx-9AoINg8TJXOZgEHg","stars":5,"date":"2015-06-21","text":"Place is very nice and the bartender (niko) is amazing and very attentive and nice! Place is great for a snack and some drinks, will definitely come back.","useful":0,"funny":0,"cool":0},
{"review_id":"3Hi5k8rgvzxvAL9dm9zUTg","user_id":"QJ-FrreREnrFATd0pL4C_g","business_id":"zUDVw-7GkqjE6qhT-92XRA","stars":5,"date":"2011-01-19","text":"the best gas station in the world! they have Ruster buster light","useful":0,"funny":1,"cool":0},
{"review_id":"GfILNr9W5OF3dt3rxeA2MQ","user_id":"QJ-FrreREnrFATd0pL4C_g","business_id":"WfXBS8eJP4GGXVTCIIbnkQ","stars":3,"date":"2011-01-19","text":"well they do top notch work, the price is high end. but is totally worth it","useful":1,"funny":0,"cool":0},
{"review_id":"V_My6-kd9BTM8_7fnBzLMA","user_id":"QJ-FrreREnrFATd0pL4C_g","business_id":"ZzZO_FIzICDLxHs7ooYgbQ","stars":5,"date":"2010-12-30","text":"This guys are top notch! Both our cats love them . we will use them again. Thanks for all the help","useful":1,"funny":0,"cool":0},
{"review_id":"CqNqZ7kEkvQe5DSb7IUsaA","user_id":"QJ-FrreREnrFATd0pL4C_g","business_id":"dWdbL7bqOJHiVJ0cwJKDCw","stars":4,"date":"2011-01-18","text":"well is Ace Hardware, I love them all. i got to say this one is one of the good once\\. nice  job","useful":0,"funny":0,"cool":0},
{"review_id":"j_ifAsBpw_PBIbizkhCa3g","user_id":"TWzFr-J29ppdx9q8an6Ejg","business_id":"N2yxwWuCzVpjMJPEDr_YyA","stars":3,"date":"2012-07-01","text":"I've been here on several occasions. Some nights are good, others downright awful. It depends partially on the crowd. When there's plenty of people on the dance floor, its a good time. When there's less people the experience tends to be disappointing. The drinks are overpriced. And the bartenders aren't always attentive, but this is tolerable when the crowd is good. Rumor has it that this place is slowly become more of a \"str8 girl bar\" and it's sort of true. Last time I went there was more straight couples there. I'm no hetrophob but I come to a gay bar in hopes of meeting cute guys who are also gay. I'll still go to this place because its otherwise the only gay club in town.","useful":1,"funny":0,"cool":0},
{"review_id":"v0Lv6LgpYDY5u1LTqu752Q","user_id":"TWzFr-J29ppdx9q8an6Ejg","business_id":"IPUGrf2xuClfxfBIA020kw","stars":4,"date":"2013-01-31","text":"Good selection. Poor management. Wish it wasn't so far off. Get your shit and get out. It's still worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"Yg0FBJ_2S-_bQE_LbQGRWQ","user_id":"TWzFr-J29ppdx9q8an6Ejg","business_id":"-tUzC36oTD0C0a7v49PGOQ","stars":4,"date":"2013-02-28","text":"The people who work here are very approachable. My friend was looking for incense but they didn't have any, all they had was scented candles but they were able to recommend my friend a place where he could find some, I'm sure the candles would have been nice. At least they were friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"zsIAOmL2asHR369J90VrKQ","user_id":"TWzFr-J29ppdx9q8an6Ejg","business_id":"EOlHhLgp32dCdSlsMpiG6A","stars":3,"date":"2013-03-01","text":"Overrated. I can't imagine going out of my way to eat here again. And $10 is cheap but not that cheap.","useful":0,"funny":0,"cool":1},
{"review_id":"aSKNSN5Ub1KmDkIX1DLcrA","user_id":"TWzFr-J29ppdx9q8an6Ejg","business_id":"pYJtM8BaRUwNg3hkO3v2sQ","stars":4,"date":"2013-01-31","text":"As a poor college student I truly value a place that allows me to stock up on produce and reasonably priced red wine for under twenty dollars. I never had to wait more than 5 minutes to check out, even when I wouldn't mind waiting there's always someone who is ready to get you out. Though I might not grocery shop here regularly since they don't provide a lot of other items that other grocery stores offer but what they do offer makes me look forward to shopping here.","useful":0,"funny":0,"cool":0},
{"review_id":"t9kLDUYFSrbg6uiOu5edrQ","user_id":"8bsQtdXLJNC0Ew_evGabIQ","business_id":"xY5-o-fgK8zB_OUmLZU7XA","stars":5,"date":"2016-08-05","text":"I just renewed my lease after a year in a Gregg Shimanski property. The building I'm in is affordable, well-maintained and updated. Although there are several properties managed by this company, my experience has been consistently positive- staff are responsive and attentive. Even though they're a large company with many properties, I feel like I'm renting from someone who treats the property as if its their own home.","useful":0,"funny":0,"cool":1},
{"review_id":"0j9CmWXewAk7mHJP6te8Wg","user_id":"AIZw3a2aV7p7Hbc6uSWqag","business_id":"zkw-peCF6FDKuopAp8LBzw","stars":1,"date":"2014-05-17","text":"Why can'y I give zero stars??? Please read my review and don't be foolish enough to ever use these jack holes Unfortunately my review was deleted before I could finish posting. this dealership has inspired me to set up a YELP account. I have had positive experiences with many places based on YELP...however...this place...Camelback Toyota is filled with thieves. I have had several if not many experiences here that left me wondering why I would ever go back...today was more of the same...oversold items on the phone only to be told \"everything looks great\" upon picking up a vehicle that apparently needs $3500.00 of work to be road worthy. Be especially weary of the young thieves in training, Chris and Carl...they are trained delinquent thieves with no knowledge of auto mechanics. Several times I've called out (in person)the Camelback thieves to point out where the coolant \"was Pooling\" only to find a dry space that remained so for more than a year. These guys should be put out of business!!!\n\nBottom line...these guys are crooks!!!","useful":1,"funny":0,"cool":0},
{"review_id":"AJ4IM56faRINC0nMT6FJPQ","user_id":"3IAiislsO9IusQk9J5JD9A","business_id":"w55sCX7ZkLIJNhl_RhwjEg","stars":1,"date":"2014-10-30","text":"This place was not one that I would recommend to anybody. First off when you walk in to the restaurant the only lights they have are red lights and then rest was black. I've never been to a Mexican restaurant that make their customers pay for chips and salsa, and then they have the nerve to charge you 7$, the margaritas are over priced and not worth it AT ALL! They charge 2.50 for everything, an the worst part about this place... I brought the rest of my Taquitos  home when I went to eat one there was a long blond hair INSIDE!! Save your money and go somewhere else but not this place totally not worth it.","useful":0,"funny":0,"cool":1},
{"review_id":"CQS7uhM9Nwdr7jhMM5nC7g","user_id":"3IAiislsO9IusQk9J5JD9A","business_id":"4jAaIWKJxNVihbiQjNw5yQ","stars":5,"date":"2016-05-27","text":"Very fast, friendly and effective! Great customer service. Doug installed our new water heater within an hour, and also stayed after to make sure the water heater was working properly. Dms is a great plumbing service !","useful":0,"funny":0,"cool":0},
{"review_id":"DDQ45R6cJYQN4_9hytBVSw","user_id":"6X9MJ8QXFno6yhX4OsT_oA","business_id":"4LXNVWV_Yp8HbkikmRQ2gg","stars":5,"date":"2012-05-15","text":"Yuko was really friendly. She gave me the best haircut I've ever gotten (My hair is extremely thick and I always have problems getting it cut). The razor cut worked wonders!","useful":0,"funny":0,"cool":0},
{"review_id":"w9MtRtwsm8BK13tzb8j-wQ","user_id":"pLhBpEVQnzt1ibcvJeQ2BQ","business_id":"JTNdV6u3DK-wcqX7ZXl5hw","stars":1,"date":"2017-10-24","text":"This location used to be good.  It's gone down hill fast.  Last few times I've visited the service was extremely slow, the cashier's were rude and on my latest visit she charged me for a large plate when I ordered a small.  The manger was unfriendly when I tried to engage with him and why is it always freeeeezing in there.  Clearly Gambo hasn't been to this Pei Wei.  Never again.","useful":0,"funny":0,"cool":0},
{"review_id":"HZ9nLirlsjYOCyH4EDXVJQ","user_id":"AnxDFkAg3frpNJp8XlQq1Q","business_id":"z6puJBjp677RIcu8pQbjFA","stars":5,"date":"2012-05-02","text":"I went here with a friend to enjoy the spa.m we purchased a deal on travel zoo.  I would have payed full price!  The massage was awesome!  The facility was clean and everyone was helpful.  I plan on returning!","useful":0,"funny":0,"cool":0},
{"review_id":"eSFHnwojCf_aQ8Lmgx3Hng","user_id":"WF7JNlR2q9Rez0KQdUypyg","business_id":"a_EGJWEgvGAiPtuATh3Kow","stars":5,"date":"2013-02-04","text":"This place is AMAZING!  One of the best massages I have ever had... and only $48 for a 90 minute massage!  To me, this is the best type of massage:  sort of a mix of Thai, Reflexology, Foot massage, and Deep Tissue.\n\nWhat you should know (and probably why some people have given bad reviews):\nI'm assuming they have never had this type of massage before, so were totally out of their element.  No doubt, this is not the massage for everyone.  \nIf you are looking for a traditional European spa, or a gentle Swedish massage, GO SOMEWHERE ELSE.  \nIf you like a deep tissue or Thai massage, YOU WILL LOVE THIS PLACE!  \n\nThey stretch you, walk on you, slap your back and legs, and give an amazing deep tissue massage.  SO, if you have never done a yoga class, had a Thai massage, or have certain injuries, PLEASE just go to one of those traditional massage chain places.  You will like it better, and those of us enjoying our intense massages at Healing Touch Reflexology will not have to hear you say \"OUCH!\" every ten minutes.\n\nAs for me, I'm a fan!  I will definitely be back!  (and they have a card for buy 10, get one free!)","useful":7,"funny":3,"cool":1},
{"review_id":"1vUb05kQzsp3-OmSnHb-vQ","user_id":"bRtdIEaaZBfVdpbCi96nlg","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":2,"date":"2011-05-31","text":"My husband and I ate here on May 4th, 2011 and were both very disappointed in the quality of the food.  The sushi rice was hard, the calamari was tough and very overcooked, the sliced steak was almost raw.  The little clab craws and shrimp cocktail were good and the desert bar looked amazing but needed some healthy choices such as a fruit platter.  The little servings were cute but took up a lot of room on the plate.  \n\nWe will not recommend this place to anyone. We had read this was the best buffet in Las Vegas so we didn't dare try another!!","useful":0,"funny":0,"cool":0},
{"review_id":"_6Q41UCjW1DyMklsZjUPBg","user_id":"bRtdIEaaZBfVdpbCi96nlg","business_id":"mbOkgswPkYbbIUflogSC9A","stars":5,"date":"2011-06-02","text":"Coming back from red Rock Canyon on 5\/4\/11, we happened upon an all you can eat sushi restaurant that was exceptional, all you cared to eat for 19.95 a person, ordered off the menu and prepared fresh.  The waitress and manager were very friendly as well and came to the table often to see if we wanted more and make sure everthing was fine.  This was Nagoya, 5025 S. Fort Apache Rd #101, highly recommended, and we know good sushi!!","useful":0,"funny":0,"cool":0},
{"review_id":"80AGL0PBoLjvZxQnpewhrg","user_id":"bRtdIEaaZBfVdpbCi96nlg","business_id":"g8OnV26ywJlZpezdBnOWUQ","stars":5,"date":"2011-05-31","text":"Had an excellent breakfast here on May 6, but definitely could not finish it! The grilled mash potatoes were outrageous and the corned beef hash had huge pieces of corn beef in it.  I really liked the industrial feel to the decor, very cute.  Service was excellent too.  We had  a bit of a wait, but only about 20 minutes and it was worth it! Excellent quality and taste!","useful":0,"funny":0,"cool":0},
{"review_id":"9xvUd3e7d_12E-CwVyQSTw","user_id":"_ouYcn3z_1SlY-Nb0fbkWw","business_id":"Nzk07R8GUXtfzkmqikhCCA","stars":1,"date":"2016-08-29","text":"I've also been shopping at this Smiths for the past 10 years. It has completely went downhill to the point that I am debating going somewhere else. Unfortunately, it is the only grocery store in Southern Highlands otherwise I would be long gone. The shelves are always empty-not sure when they do inventory, but they never have anything. The place is a mess, complete filth and today I had to even bag my own groceries-I spent over $300 dollars so it was quite a bit of work. Every time I make comments to the cashiers and it's very sad when they agree that the place has gone downhill. The lady told me today the management is horrible and does not care. Also be careful when you park your car since nobody picks up the empty shopping carts. All in all this place is terrible. Please open a different chain of grocery store in Southern Highlands!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"Ba0pW6RhW2GJYDrLkmii-g","user_id":"-3lAYjj4QRSKCD5-4E0D0A","business_id":"urgjbqhtZD20G5h3XM76wQ","stars":5,"date":"2016-11-21","text":"This place is really good.  Open late, awesome food.  We got the lamb and chicken dish, and the falafel.  Will go back again if I am in town!","useful":0,"funny":0,"cool":0},
{"review_id":"QUEtX8YvHCbn2iHVBak5Wg","user_id":"7Eo4LlzoaFfu0lvebGyrvA","business_id":"fzRxHv7XnnDqTmX25tVbJg","stars":1,"date":"2014-06-26","text":"Average bar food, incompetent service.  This is my third visit and waited over 2 hours for food.  Finally gave up and went elsewhere.  There are too many other establishments in Charlotte with a great beer list and much better food.  I won't waste my time here again.","useful":3,"funny":0,"cool":0},
{"review_id":"LdunUaLhFbx9UElQKXnj9Q","user_id":"bdykraU6jqceaShgyY10iw","business_id":"UUllLmp4yhTp6KdT5TnewA","stars":5,"date":"2015-01-03","text":"We had Kathy of Tiers of Joy make our wedding cake, and additional cup cakes. We could not have been any more impressed. The cake was absolutely gorgeous and just as tasty as it looked. Kathy was very sweet and helpful.","useful":1,"funny":0,"cool":0},
{"review_id":"ncyaSDAcn5DSItKu3uwpqA","user_id":"bdykraU6jqceaShgyY10iw","business_id":"JW0563rcbzqvCVIoXOagQQ","stars":5,"date":"2015-01-03","text":"We were in a bit of a bind when our original wedding venue closed on us less than a month before our wedding date. We found Sunset Gardens, saw it had good reviews, and thought we would give them a try. We met with the owner and were immediately impressed with his experience and attentiveness. It was clear that he takes a lot of pride in Sunset Gardens, and only works with tried and true vendors. Within no time, we had arrangements for the officiant, the catering, the cake, the DJ, the flowers, etc. \n\nTo be honest, I feared that because the package we got was so reasonably priced, and because it including everything, I thought we were in for a mediocre and impersonal experience. I could not have been more wrong. \n\nOn the day of the event, SG greatly exceeded our expectations. The venue is quite beautiful and tasteful, and really did not require any additional decorating. The food was delicious, and there was something for everyone. Our wedding day coordinator, and all of the catering staff were professional, experienced, and very attentive. The DJ did a superb job of playing our requests, and building on them. Our wedding cake was another stand out; both delicious and beautiful. \n\nWe consider ourselves lucky to have found SG. They really did a stand-out job, and we would recommend them to anyone.","useful":1,"funny":0,"cool":0},
{"review_id":"xie0iyO3mx44m5-TTcL80Q","user_id":"3sEUceppeLQAw9e7Ph2IYQ","business_id":"P_ilOWgHj2DMSSZSDtvzbg","stars":2,"date":"2012-07-22","text":"Friday night they got a really bad JD, who plays the same music every time a few sons only and keep repeating it all night it gets boring. Some people call this a salsa club, but it is not, they don't play salsa. This place does not attract a lot of people; it is small and plays bad Latin music. Don't waste your night there!","useful":1,"funny":0,"cool":0},
{"review_id":"m5WP7kmh0Nxbxrs6LluqvQ","user_id":"Nkusp84RWR89e-M2eKruiQ","business_id":"_2Tbn21g_7ubYRAPjbGWlw","stars":1,"date":"2013-05-17","text":"This is by far the worst run apartment complex I've ever lived at or heard management doest care about you or your needs just your cash.Took three months to change a outside light bulb and a screen for my kitchen, not kidding.Id rather rent a cardboard box in el-paso then resign my lease. they shut off your water no notice by the way,tow your car if you have a flat tire you walk in the office very snobbish for people that make 8.00 hr to rent a living nightmare.If your looking the bus stop is a much better place to live.","useful":6,"funny":3,"cool":0},
{"review_id":"HXujJVc_OHJRL6GAyVSWkw","user_id":"Nkusp84RWR89e-M2eKruiQ","business_id":"1ZusRIDxNN0JKQtuGqq_xQ","stars":5,"date":"2013-04-30","text":"This place is great. Workers are pros and very honest take pride in thier work. I will never go anywhere else. employees are great not like the punks at jiffy lube etc....So go and you wont regret it.went 4\/29\/13 at 11 am","useful":0,"funny":0,"cool":0},
{"review_id":"l43WPtjRzsQfGQbajhOhkg","user_id":"Nkusp84RWR89e-M2eKruiQ","business_id":"ZhjU0FkCIaG43F83TwSN8w","stars":5,"date":"2016-05-05","text":"Not much for corporate places but come to the bar and the female bartender Dana is working she always has her a game . I'm I bar manager\/ bartender and she's one off the best.","useful":0,"funny":0,"cool":0},
{"review_id":"Zgo62CSe7EkxumRj0hRgSQ","user_id":"cMYlodcXPlIPYIQX49Bc1A","business_id":"cKIbCC5OVmrHIh8PawlI6g","stars":5,"date":"2013-12-22","text":"Delicious. Absolutely delicious. The bacon mac & cheese was absolutely to die for. Such a simple dish, cooked to perfection. Well done","useful":0,"funny":0,"cool":0},
{"review_id":"hRFpgrnoZOTLNqZ9CpOP3g","user_id":"l5I0LSUdHd5eIvQaJdMcuw","business_id":"Z2UO8mW7gHDpPNuvKfo1IA","stars":5,"date":"2017-06-02","text":"Phoenix Patio Systems put in our pergola and it looks fantastic.  They were efficient, timely and the workmanship was very good.  I cannot say enough about Daniel Hall who did the install.  He was very courteous and conscientious about his work and the end result looks beautiful.  I would highly recommend them.","useful":1,"funny":0,"cool":0},
{"review_id":"HqODSNaT8AFp1hWIZB019w","user_id":"3QTQPzaidGJqH6hW0XxoDA","business_id":"CcDdWX48wSLD5L9hGi7A8g","stars":5,"date":"2015-07-29","text":"We haven't been back to Champaign in years and this new (for us) hotel was a real treat!  It is centrally located near restaurants and downtown Champaign.  It was really clean and modern.  Every Hyatt employee that we interacted with was beyond friendly and helpful.  The free breakfast was a very pleasant surprise- a real spread with egg dishes, sausages, pancakes, waffles or french toast, oatmeal bar, fresh cut fruit and more.  I will DEFINITELY stay here again when we return to Champaign.","useful":0,"funny":0,"cool":0},
{"review_id":"eLgx96Qwqn-rRcIL_XQh2Q","user_id":"RblCK3H5KyHo699OezNQYw","business_id":"6oWlbIpFjGSXd_etc0Z00g","stars":5,"date":"2017-05-30","text":"I came in the other night hearing about the place from a friend. He said the food was good but they had a bit of a problem with their service.\n\nWhen I got there there I did have to wait a bit before I was seated, around 5-6 min. There weren't a lot of people so it was a bit annoying. After that things went smoothly.\n\nI didn't bowl as I just wanted to try out the drinks and bear and let me tell you, the food is amazing. I ordered the fish and chips as well as the tavern burger. The food took about 15 min to come out but when it did... MY GOD, WAS THAT BURGER GOOD. If you go def. get the tavern burger as is. By the time I finished it I was too full to eat the fish so I got it to go. It was good but man, that burger.\n\nI would say the service is 7 out of 10.\nThe mood is a 9 out of 10.\nThe drinks were fine 8 out of 10.\nFood (mainly just that burger) 10 out of 10.\n\nI think I have found my new fav. burger.","useful":0,"funny":0,"cool":0},
{"review_id":"kSXPIRWcQ-2d7XjTcq9YfA","user_id":"f7IOwkqH-och-NctdslhQA","business_id":"osu1j_Lg8R9brpuMMn3a3A","stars":5,"date":"2015-01-18","text":"Go HUNGRY! I've been here a few times and always had a great experience. Well worth The price. The salad bar is delish. Service is impeccable. The food is delicious, love the palenta! I will definitely go back. I had a great dinning experienced overall.","useful":0,"funny":0,"cool":0},
{"review_id":"3wEipAN5P7Mijyae1nZ4Mg","user_id":"_QS-sPX2SdribN7bvvN-xA","business_id":"RDQ_812x82H72J7C6jG36Q","stars":5,"date":"2016-09-27","text":"1st time here today and the food was fantastic! The passion fruit dressing was to die for. I had the Cubano Sandwich and wife had a fried plantain sandwich. The beef and veg soup was so good with the cilantro they put in. Coming back for sure!!","useful":0,"funny":0,"cool":1},
{"review_id":"R9SuR9YhprQu3rEhnNuTsQ","user_id":"NKHXhdd1dEGYC4Aszjs_EQ","business_id":"EpaQ5JtLVZTQ_Y6U35bmcw","stars":5,"date":"2017-05-20","text":"Hi there, my name is Nicolle Haver, and I have been going to canyon falls for about a year now for color and extensions by The fabulous Kat! My hair wasn't in the best shape when I started going to her, but since my hair has never been blonder or healthier!! She is so kind and passionate about what she does, and it really shows in her results! Absolutely recommend her, but make sure to pre book, because the girl gets busy!","useful":1,"funny":0,"cool":0},
{"review_id":"QHTfEPnsN1K2Swv3bzqrjQ","user_id":"1wZy2OUkhIp9XgFTOGSMqw","business_id":"4BBdDw5CUspCRjpwaU4lNA","stars":2,"date":"2012-03-24","text":"STAPLE in my dessert. what a way to end a dinner.\nThe bread pudding was excellent until I bite in something hard, which was a staple!\n\nI can't believe the waiter told me it was an accident and that it was a bad luck thing.\nWHAT?   There were no excuse or whatsoever.\nHe didn't even offer to have my dessert waived or anything.\nI had to ask him on receiving the check.\nSo, on a 49$ menu, he took off a HUGE 4$ after taxes..\nHe might as well keep it. ......\n\nI almost swallowed the f* staple !\n\n\nSo Food were ok. Degustation menu at 49$ is subpar for most of the dishes. \n\nThe dessert were good, the entrees were less.\npositive thing: Piglet were cooked perfectly. but at 49$ for one dish with extremely small portions is not worth it.\n\nMagret de canard is not cooked very well. It's supposed to be ros, but was served medium rare ..when i told the waiter that it was raw, he told me it was the way it's recommended. NO. it's ros (or pink)\n\n\n\" Duck meat is at its best when served pink \"\n\nhttp:\/\/www.canardsdulacbrome.com\/en\/produits\/4_poitrine_de_canard_desossee\/\n\n\nIt focuses on Quebec's food, we can identify quality products but it was poorly executed : magret de canard was undercooked, making it chewy.\nVeal was undercooked as demanded.\n\nService is just as bad.\n\nPricey for what it is.\n\nNot returning that's for sure.\n\nOh by the way. THANKS SACH (waiter).\n\n\nPlease, go somewhere else.","useful":3,"funny":0,"cool":0},
{"review_id":"gyeoUO_lJNJohODY5kdroQ","user_id":"6n4VCLtHN4SA1NHL_rmikA","business_id":"b2AFs7chrcENT4wkrpVlGQ","stars":5,"date":"2017-12-16","text":"Tirsa is an absolute artist! I've followed her for years because she makes you beautiful and natural. No one knows I've had anything done. They just say you never age!!! I highly recommend her for her talent, skills, professionalism and welcoming demeanor. She's the best!","useful":0,"funny":0,"cool":0},
{"review_id":"hw2p8WB3gepUBaNugMqBuA","user_id":"OFrbZts0_sQrs7CxpA_SjA","business_id":"ZhMTztc2PsoXb2jZZdQZfg","stars":5,"date":"2016-07-19","text":"Best treatment to help cure hangovers and ask for Maria she's the best with the needle and also very friendly! I will definitely be coming here again!","useful":0,"funny":0,"cool":0},
{"review_id":"1Gcdn2o8UPRazH4oPBFXeA","user_id":"oC0zf-hsjBD14BMaIhdtMQ","business_id":"15tpk1N3mU9iyjsFpbnlOQ","stars":5,"date":"2015-05-29","text":"The best $3 you'll ever spend!! My absolute preferred method to get to Pearson Airport. It's fast and cheap","useful":0,"funny":0,"cool":1},
{"review_id":"6yA8W36iD_izV-Z67dagGQ","user_id":"h-Y6M7_fGQ8GXgmZZdHrUw","business_id":"21G3_HqzfBh3gR1Eo-sojg","stars":5,"date":"2017-05-01","text":"My favorite vistas and trails near Cave Creek!  And Not as heavily traveled as Pinnacle Peak.","useful":0,"funny":0,"cool":0},
{"review_id":"oeHkpWOr0YjHYmtFfmSBgw","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"FuO6d7IR1ee-3Bfo-gu1HQ","stars":4,"date":"2015-03-26","text":"Had a team lunch there, we were a group of 12 people. Good food. Staff is very courteous.  They have ample variety in sea food and in desserts. Overall a good place. May visit again.","useful":1,"funny":2,"cool":0},
{"review_id":"I7bz9eSJaM5dSLxCEqpl5g","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"zm6sSH7im_fve9uVpiPWJw","stars":1,"date":"2015-07-03","text":"My outside faucet(the one used for garden hose) was damaged and had to be replaced. I did a mistake and called Mr. Rooter. The technician came in an hour as they had promised, which was good. But he was very rude and pushy. He said I had a huge problem and if I don't fix it, my basement would be flooded and estimated the cost for fixing the problem to be $806 before taxes. Obviously, I wasn't going to pay that much for a small problem, so I called another company called ANTA plumbing. Even their technician arrived in an hour and was extremely professional and estimated $465 before taxes for the same problem.  He was kind enough to break down the cost for me. I've attached both the estimates that I received. You can see how Mr. Rooter wanted to steal from me.  I finally ended up calling a smaller company and had it done in $160. If you ever need a plumber, I highly recommend 'Action Plumbing'. Paul, was extremely professional, when I explained him the problem over the phone he gave me an estimate and did not over charge me after the problem was solved.   \nSo to conclude, if you want:\n1. A rude and pushy technician\n2. To pay around 7 times more\n3. And want to hear an exaggerated version of the problem\n\nPLEASE CALL MR. ROOTER, all other times 'Action Plumbing'.","useful":1,"funny":0,"cool":0},
{"review_id":"UVA9hmfWsfIBmYpRsBUPZg","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"i0u5CzG81LrEwAI0X5OVkQ","stars":3,"date":"2015-05-28","text":"Went on a weekday evening with friends. Restaurant wasn't busy. \nFood was okay. Rates aren't high and the quantities are reasonable. Taste is nothing extraordinary, like any other Hakka Chinese restaurant.  Service needs to improve. Staff wasnt very professional either. You are not missing anything if you haven't been here.","useful":0,"funny":0,"cool":0},
{"review_id":"uTg9Sq4kcyxPv4I7mTSkAQ","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"eGP9T_kj0iM5h3MciSQjSw","stars":4,"date":"2015-02-17","text":"I visited Brar today for the first time with my family. We were told that we would have to wait for 40 mins but were given a table in around 25 mins which was impressive. The decor and ambience is appealing for an Indian buffet restaurant. \nI was pleasantly surprised when they clicked our picture and printed it for us as a family day gift.\nWe were served by 3 servers(as per name tags: Aman, Khushvir and Manpreet), all were quick and courteous. Would like if they interact more with the guests rather than just clearing plates. \nThe food was average, nothing exciting. Ample options available for a veggie person. \nWhat I liked:\n-Shahi Paneer: Was really delicious. Paneer was soft and fresh. \n-Fried rice: The fried rice had a nice schezuan flavor.  \n-Pani Puri: Was mouth watering. One if the best that I've had in GTA. \nThe dosa, chilli paneer and veg Manchurian could be a lot better. \n\nAnother suggestion I have is to keep the plates at multiple locations instead of having it only near the soup section. \n\nOverall was impressed. Would give 5 stars if the food quality improved. Everything else was perfect.","useful":2,"funny":0,"cool":0},
{"review_id":"AAL5FXBcUegs9lHr4FFHdQ","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"g4g8WoBCDwP5Qhy9gnbeiQ","stars":4,"date":"2015-05-29","text":"Visited the 401-Dixie location on a weekday for a team lunch. I'm glad we had a reservation, this place gets busy. We were a group of 11 people and we enjoyed our time there. After we were seated our server(Sarah), introduced herself and took the drinks order. The drinks were served quickly and then another server came and took our orders for the food. This guy seemed more experienced. He really handled all the crazy requests very well. The food took really long to come out, which wasn't a surprise as they got the food for the entire table, out at the same time instead of bringing it out in batches. On our table, I ordered a veggie burger, it was a bit expensive($14) but tasted good and was huge in size, someone else ordered a chorizo flatbread and he was happy with it too. Another friend got the SmokeHouse Wrap and said it was a steal for that price. He absolutely loved it. \n\nOverall, good place to hangout with friends. Staff is very welcoming and also very attentive. Will certainly go back.","useful":1,"funny":0,"cool":0},
{"review_id":"8aIpicDdayy_wze18UW6YA","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"wc1q2e5vSTAzDcfUOA70iw","stars":3,"date":"2015-05-04","text":"Visited on a sunday evening. Restaurant wasn't busy. Food was decent. Ambiance does not match with a south indian restaurant. Servers should probably get a uniform. Causal wear for the servers looks very unprofessional. It is hard to know if the person coming towards you is your  server or another customer. \nThe service was good though. Servers were patient and courteous. Food came out on time and was good. \n\nWill visit again. Would be happy if they work on the ambiance and the uniforms for the servers though.","useful":1,"funny":0,"cool":0},
{"review_id":"3bQNUfT_dOKNUrrRgMRAVw","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"GAvYE9bbVGnN6-uo1TM1XQ","stars":4,"date":"2015-06-11","text":"Have been visiting Velvet for few years now. If you decide to go for a haircut, make sure you book an  appointment with \"Lewis\". Very friendly, never in a rush and does an excellent job always. \n\nRemember to book an appointment before you go. Otherwise be ready to wait for a long time. Another thing to consider is, they don't accept Visa\/Debit. They only accept cash.  \n\nWould give 5 stars when they start accepting visa\/debit.","useful":2,"funny":0,"cool":0},
{"review_id":"h1G-Fmdq0b9aTj0AfuTyUQ","user_id":"QWPelHItKJgCfpNsejzK-w","business_id":"-izEGTGxwQUZWgjwjdqU1g","stars":5,"date":"2015-07-04","text":"If you want to have your dog groomed from a proffessional,  this is the place. Very friendly and accommodative staff. They are never in a rush to finish the grooming.  Always do more than what is expected. Overall a great place. Would recommend to all my friends.","useful":0,"funny":0,"cool":0},
{"review_id":"4PI8s_cTkAYr8twMMc0HHw","user_id":"lu7r_iqEX1DJWfXZ3MfZHg","business_id":"jyyk8qQ9Do9ITKsU3fqIdw","stars":5,"date":"2017-10-28","text":"If you want a dental office that seems more  like a spa, this is the place.","useful":0,"funny":0,"cool":0},
{"review_id":"23q5LdONV__p-yJ6vaMItg","user_id":"lu7r_iqEX1DJWfXZ3MfZHg","business_id":"eEnTbc-h59Q4okgMTBbXcw","stars":5,"date":"2017-11-10","text":"I asked for a deep tissue neck and shoulder massage, and that's exactly what I got.  Stephanie was wonderful.","useful":0,"funny":0,"cool":0},
{"review_id":"RRqShHV4aeaNKB85U8IEmQ","user_id":"28qbA5EOIG4Z30LIcwq2_A","business_id":"XKcRPqOo-TCMbeys0LOg6Q","stars":1,"date":"2014-10-02","text":"Worst mistake of my life. Not only did they promise me the degree I got would help me change careers, but they stated they had job placement help and do NOT! I am now in debt, with a degree I can't use for much of anything and can't make a career change because the classes I wanted to take the 3 Academic counselors I had (they kept changing almost as much as the seasons) kept changing my classes. On top of that, 3 classes before graduation, the new academic advisor stated I was missing 3 classes and I had to add those on or I would get no degree! So I paid for 3 more classes that did NOTHING for me. I tried to switch schools but couldn't because I had to few classes left. I also had issues with NEVER hearing back from my financial advisor. Plus, horrible teachers, which I filed a complaint again and AFTER the class was completed was told the complaint was founded but there wasn't anything they could do. Though I struggled through the classes not because the material was that hard for me, but because the teachers were that bad and didn't know what they were teaching and I pointed out their inconsistances! Me, the student! \n\nI have been complaining now for over a year since I graduated and they keep \"losing\" my complaints and state I don't follow through with the complaint which is crap! I finally escalated to the higher level within UoP and gave them 7 business days from yesterday to meet my demands (which isn't much but it is what I feel would be fair) or I will take it to the government agencies and let them audit their butts!","useful":5,"funny":2,"cool":1},
{"review_id":"NNJz-7_fR4-wXUomuHwlow","user_id":"IcfqIz7ZHlANbHUbKQvJFg","business_id":"WNKGOBQWvGtSlTZLTmmzSg","stars":5,"date":"2015-01-31","text":"Dr Martin receives 5 stars from me for bedside manner and overall expertise. I was in a mountain biking accident in Vail and suffered a broken left clavicle and extensive skin lacerations.  Upon my return, Dr Martin supervised my successful recovery. His entire staff was very knowledgable, friendly, and supportive (even when I may have been a little difficult to deal with). They were always available if I had an extra question or concern. Additionally, they were very flexible and were able to fit me in the schedule with very short notice. I would highly recommend Dr Martin and his staff's personalized medical care to help you in your recovery!","useful":5,"funny":0,"cool":0},
{"review_id":"_LZkMIO9MULRo1PobkskyQ","user_id":"IcfqIz7ZHlANbHUbKQvJFg","business_id":"6t1JH6tjZy5vaM8b4s-riw","stars":5,"date":"2015-02-23","text":"I took my second class on Sunday at Sweat Body Lounge. Not only are the instructors amazing, but the studio itself is the most beautiful studio I have ever been to. The staff is very friendly and accommodating. If you enjoy serene environments and exceptional yoga instructors, then you should go to Sweat. They also have separate men's and women's locker\/changing areas (these have more of a spa changing room feel than a gym feel). This works out well for me because I can rinse off and get ready for work. By far the BEST yoga studio I have ever been to (and I have been to several across the country).","useful":7,"funny":1,"cool":3},
{"review_id":"NRdDVYSZqyub8WeMxyaNkQ","user_id":"0lc4zufpXdTnDHepnE6m6A","business_id":"5Zc41a446gV3K_o7CDs69Q","stars":1,"date":"2014-07-12","text":"If you dont mind the pit boss changing the deck in the middle of a shoe than you will enjoy. Me personally I will never go back","useful":2,"funny":0,"cool":0},
{"review_id":"X3nBC1TjbqZ_TARfJHloCw","user_id":"9WNaG7iHR46mFGkzydbmRw","business_id":"1uAYx8wgiRXNB_I9g1n8eQ","stars":5,"date":"2015-08-08","text":"My family always enjoys coming here. They have the perfect menu and great service. I have four kids between the ages six and twelve and they all love it here! We're not from around here, but this is our favourite place to eat.","useful":0,"funny":0,"cool":0},
{"review_id":"ujIN64SO-aIzT-b3uq1UZg","user_id":"1FB1O42AHdV7KRd6Gc-2IA","business_id":"P7ZGgKVE_sW5UHA4aNgc7Q","stars":1,"date":"2014-12-12","text":"Beware:  I ordered a replacement glass for a side table. They said it would be ready in 2-5 days. 2 weeks later still nothing. The guy said he would travk it down and call me back. No return call. On my third call back he threatened me with violence and said to come down to see what a man I was. This was followed by extremely harsh language and more threats.  I'm a fairly calm guy and not easily offended but I have never in my life come across anything like this.   Give this place a very big miss.  Single most aggressive evil unhinged service ever'!!  Needless to say I never got the glass. Still trying to get the owner on the phone","useful":3,"funny":0,"cool":0},
{"review_id":"iHgJ2_YwFq23Xqvf92YDjw","user_id":"wbNYzziaGjfvNt-xD2qHoQ","business_id":"q0KxDI7FdA2TiBZo-4m14A","stars":5,"date":"2014-12-17","text":"Dr. Sadre is fantastic. She pays attention to detail, is professional, and caring. I moved from out of state and was worried about finding a good dentist, but the staff immediately made me feel at home. They have even been able to squeeze me in for some dental emergencies. I recommend her to all my friends and would never go anywhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"Bu79oSjxk7z1tbNSB3eOTQ","user_id":"wbNYzziaGjfvNt-xD2qHoQ","business_id":"QsJ6orXv_VB7xz-MpqHzSQ","stars":5,"date":"2014-11-23","text":"They have amazing food. Our favorite are the desserts, especially the raw cheesecake. It's not just for vegetarians\/ vegans - even my grandpa who eats meat everyday was loving the Philly melt......until we told him it wasn't beef :-)","useful":1,"funny":0,"cool":1},
{"review_id":"BjiHS_Z2dntZSC07gtBzFw","user_id":"JidlHcKIs4o7d8hm8W-0EA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2014-04-27","text":"Great breakfast. Good mimosas and bloody marys. The French toast and eggs Benedict with duck was delicious. The ambiance was good too. Sit on the pAtio.","useful":1,"funny":0,"cool":0},
{"review_id":"0P2mGw_ryqoD7BKZSqsh5Q","user_id":"JidlHcKIs4o7d8hm8W-0EA","business_id":"aLlREPOEtt3JzeDCagHytA","stars":5,"date":"2014-04-27","text":"Great club. Diverse crowd including age. Mature place where you don't have to worry about a shooting or \"hood\" crowd. Very sexy and sophisticated place. Free vodka drinks. Call early and put your name on the guest list to avoid lines. If you can spare a few hundred between friends get a table. It's so worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"4WcruGakXnHwyRRaQSUdPA","user_id":"yUw5oimjaLbE9LTnZNtdCw","business_id":"LnSjzFXh1GrOObsRP6LhBQ","stars":3,"date":"2014-04-14","text":"I go to Brioche 1-2 times weekly, it's pretty close to my work and offers up a pretty decent latte, and really good lunch options.  Their Beet and Goat Cheese salad is amazing and actually quite filling.\n3 stars because:\n-the customer service is quite poor, no one is particularly friendly or helpful, a lot of the time one will direct you to another staff member, who will just stare at you until you talk\n-the food is very pricey for the portion size\n-the line-up area is very confusing; if you just go in for a coffee and go right up to the till, there's a moment of awkward limbo between you and a someone who is waiting for their food to be plated, but is ready to pay.\nAfter visiting Paris last fall, it was neat to come home and see Brioche, as it is like 'the Starbucks of Paris'.  They do prepare the food almost in the exact same way, which was quite nostalgic.  Over all, very tasty, but could use a bit of work!","useful":0,"funny":0,"cool":0},
{"review_id":"9-WgQI-AyRv5JBcpgQx58A","user_id":"yUw5oimjaLbE9LTnZNtdCw","business_id":"SBA_VqJGXBoTjwZwoxzxIw","stars":5,"date":"2014-03-31","text":"My dog has been groomed at Spaw a few times now, and every time we leave, she struts out the doors because she knows she looks good!  The staff at the new retail store are always really nice and helpful, you can tell they really love dogs.  My little furry gal is very finnicky, and they were able to help me find a treat that she loves- she actually waits for one every time we come in from a walk!  \n\nShe can be a difficult little lady to groom, I've never been able to do much more than brush her, but the groomers at Spaw have never voiced a complaint.  When I called to book her fist groom, I was disappointed that they day I originally wanted was booked up, but I was offered a Sunday appointment instead, which actually worked better with my schedule (it's so hard to find a weekend groomer!).  When I brought her in, I was able to meet with the groomer and go over exactly the cut I was looking for.  Initially, the cut I had asked for was better suited for a different type of dog (I brought in a picture I found online), but the groomer explained to me a better-suited 'hairstyle', and the end result was fantastic.  The couple grooms I've had since then have been with a different groomer (I think her name is Megan?), but the cut has been consistently bang-on.","useful":1,"funny":0,"cool":0},
{"review_id":"zFR-rPBj1AJuPufBRCvMmg","user_id":"yUw5oimjaLbE9LTnZNtdCw","business_id":"DfCuDI8b6rZ4nXl9Zg-eSw","stars":5,"date":"2014-04-14","text":"I moved out of the Yonge and Eg area about 6 months ago, and have been itching to venture back, only to get a coffee from de Mello!  When I was living and working in the area, I would stop in several times a week, usually ordering a latte.  I tried a cappuccino once- best decision ever.  Perfectly made, perfect taste and texture.  When summer came, I tried their cold brew coffee- absolutely fantastic!  I love the lemon, a touch I would have never though of!  Anyone who is heading north, I always suggest they stop in.  There's nothing like it downtown!","useful":0,"funny":0,"cool":0},
{"review_id":"PZexJEPXFKRj1YniHO-ebg","user_id":"YlnPf2yNU6P3JMxys8DxIg","business_id":"NBMCSTtayMJJisWSZ6WuwA","stars":5,"date":"2011-11-05","text":"Fabulous food. The mozzarella as you might expect was excellent with our appetizer of tomatoes, pesto, basil and rustic bread. The basic tomato, basil and buffalo mozzarella was perfect.","useful":0,"funny":0,"cool":1},
{"review_id":"ESDeY-eT2ph-3zlLASCxhQ","user_id":"BBv8jmKpv1tr7298lAIldQ","business_id":"0ldxjei8v4q95fApIei3Lg","stars":5,"date":"2014-04-21","text":"My new favorite place. Everything is delicious. Do yourself a favor and eat here ASAP. Had the BBQ  tri tip and it was one of the best thing I ever had. Also the service is amazing, Justin was a great waiter. If I was a inmate on death row ,this would be my last meal for sure.","useful":1,"funny":0,"cool":0},
{"review_id":"NrEO4bvxMUVRfTUgYt6T4g","user_id":"BBv8jmKpv1tr7298lAIldQ","business_id":"OY--Bo-QFgxL4KFZYn0iSg","stars":5,"date":"2014-01-09","text":"Great shop and cool atmosphere . First time there, sure to be back. Good place for a classic cut and feel!","useful":0,"funny":0,"cool":0},
{"review_id":"oTXauzxkqcqEQIc4rto6cA","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"XMMLRvV4IMxIGyc4H37LxA","stars":5,"date":"2013-05-03","text":"I love to come back here for the refreshing drinks and for the pizza, so far I've been here often enough and their pizza doesn't bother my stomach even with the cheese. I am hooked on the cucumber juice and also their variety on desserts...will need to go back again, it's been almost a year.","useful":0,"funny":0,"cool":0},
{"review_id":"8vHgB3ocFTBWDdiQtjP-zg","user_id":"rcikVT72zTvu1oO3cTds8g","business_id":"HwEDsb1xtRBTuFwATTRjpA","stars":5,"date":"2013-05-03","text":"Love the busy and loud atmosphere, perfect for a weekend retreat. I always go for the chicken little, their veggie and salads are also great. The portions are enormous, you get what you pay for.","useful":0,"funny":0,"cool":0}]