[{"review_id":"n01y1_ycPG9GRInXL_TMWg","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"GjOZdW5YZDJ9fXPfqlo-YA","stars":4,"date":"2011-10-26","text":"Just ate in at this location, my first time there.  Not bad, fairly tasty but nothing amazing.  I would say it's a little better than your average Subway.  The bread is very good.  Prices are affordable too.  I will probably go back again some day.  Oh, and yes, they really are fast, by the time I paid, my sandwich was already done.","useful":0,"funny":0,"cool":0},
{"review_id":"xvboffIbDWNYYay_mVMJHw","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"iytPyg_lc_cBb3id1oaDGA","stars":5,"date":"2011-10-26","text":"Yumm. Just got back from there, thought we should give it a try.  We had the deep dish pizza.  Very tasty.  Everything tasted fresh.  They put lots of tomato sauce on it, I like that, usually pizza places are stingy with the tomato sauce.  It's not overly greasy either.  This is definitely above the average pizza place.  I would certainly recommend this.","useful":0,"funny":0,"cool":0},
{"review_id":"94k3Ez91-tSPS_nPxcQkUQ","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"OOaiDUh2zF3OmmzUeXKiGA","stars":2,"date":"2013-08-28","text":"Just went here for dinner.  I had been here many, many years ago and remembered it was quite good.  Unfortunately today's experience was not so.  The worse part about the experience was probably our waitress. She really couldn't care less if we were her guests or spent money at this restaurant.  She wasn't rude, but really short with us, and she wasn't busy and we are always extremely nice as we work in the same type of business.\nI got my more or less flat Coke and decided not to bother to complain.  My side salad looked a little sad, not the freshest lettuce.  We also had the French onion soup.  It was excellent but unfortunately loaded with pepper.  Now, I like spicy food, but this was really more of a pepper soup  with onions.  Shame that.  I had the sampler dish with lasagna, eggplant and veal parmesan.  The eggplant was absolutely great, the veal parmesan tasty and the lasagna pretty decent.  My wife had the chicken parmesan, she really liked it.\nAll in all, it was average.  Considering the price and the lousy service, I'm going to rate it two stars (I would rate it 2.5 if I could). It's a shame.  Like someone else said, this could be the perfect little place, but not with this staff and some food being below par.","useful":0,"funny":0,"cool":0},
{"review_id":"DOMH8j2-Qh5xMOieDW13SQ","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"wmGJWlimnBK909IEgKVIIA","stars":5,"date":"2011-06-02","text":"Fantastic place.  A nice change of pace from your your average supermarket.  Lots of healthy choices and the surprising thing is that Trader Joe's is actually just as expensive, if not a tad cheaper than our supermarkets.  If I lived closer I would shop there consistently, unfortunately it is just an occasional treat for us to shop there.","useful":1,"funny":0,"cool":0},
{"review_id":"OvC5EgObhAdDbCFTwubuew","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"qLUr-ZPGVJejkSXIUenw6w","stars":5,"date":"2013-02-26","text":"Went there for lunch.  Had a great Gyro and a special of the day.  It was very authentic and very tasty.  Young lady at the counter was very friendly and helpful. Will definitely go back.","useful":1,"funny":0,"cool":0},
{"review_id":"Hj0Z1txRlj78otQkzeJ9pg","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"yBbqFPuwFiaom435KOY4cg","stars":2,"date":"2012-01-19","text":"Like others have said, this is definitely a Asian Chipotle.  Same setup.  You go in and create your meal.  I have to give them one thing, there are lots of choices.  I had a noodle wrap with chicken.  It was ok.  I think one of the problems is that their food is a little dry.  If you go there, make sure you add extra sauce.  All in all, the flavor of the food is just average, kind of bland.  I expected a little better.  My wife had a bowl with noodles and chicken and didn't like it.  We also had the Yaki's which are their deep fried wontons.  They looked great but tasted average.  I really wanted to like this place, but to be honest, I don't think we will be going back there.  The staff there is friendly and they gave us a rundown of how things work when I told them it was our first visit.","useful":0,"funny":0,"cool":0},
{"review_id":"9OQz2frbF69-YqCNJ8Mpbg","user_id":"BH-doMjs8S2jB_yZG3SY9g","business_id":"GpDvfCYGPceUTNHiFU3ycg","stars":5,"date":"2011-06-03","text":"Best car repair I have run across so far.  Even though the lady at the front desk isn't always the friendliest, they do a great job.  It's the first place I have taken my car to where they didn't try to talk me into fixing ten other things.  They fix what is broken, and that's that.  They seem to have fair prices and work pretty fast.  I gladly drive quite a distance to have these guys fix my car.","useful":1,"funny":0,"cool":0},
{"review_id":"a1jzZRTZwee8NJSEiERbZw","user_id":"kvl44_FD2SUrLrkUjMFuQw","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":1,"date":"2017-08-27","text":"Ive been to Vegas buffets many time, but this was by far my most disappointing experience ever! All of us got sick!!!'The staff was lazy (wrong drinks and only 1 refill and dirty plates everywhere) ) and food was terrible ( meat was overcooked or raw and chewy and other food was flavorless and sloppy, sushi was spoiled, gelato was grainy and had ice in it from melting and refreezing, cookies were stale, salads were wilted) poor, substandard quality. It cost over $270 for 4 of us so we were expecting good food and service, I had a much better buffet experience at the Rio or Aria for less money...","useful":0,"funny":1,"cool":0},
{"review_id":"YXATmXpUPQd9E5q1b9i_7g","user_id":"kvl44_FD2SUrLrkUjMFuQw","business_id":"WpI5MZC3XzlTpcUOKXzCbA","stars":5,"date":"2017-09-22","text":"The food is very authentic gourmet mexican...pretty vast menu and we ordered the carnitas and the birria lamb stew\n\nThe mango cake and the mexican style donuts we absolutely amazing! \n\nIt was very busy busy the staff was very quick and were nice keeping our drinks coming! \n\nIt also has an amazing high valley view of the las vegas strip!   Its like going to Baja!","useful":0,"funny":0,"cool":0},
{"review_id":"I7HA3-781T7zEXmWjcfbwg","user_id":"qgGfXAY50hvYk4fjuggOGQ","business_id":"EEHMMiJUklGGiikqd55HwA","stars":5,"date":"2013-08-24","text":"I'm happy to report that I've even been to such a nice restaurant. It was so nice, I'm tempted to swear to emphasize how nice it was. I took pictures of the bathroom, if that tells you anything.\n\nThis place was top-notch. We ate an oyster appetizer, served with red vinegar. So fresh, so tasty. Next came deep-sea lobster, three pounds. I have never had lobster that tasted so fresh. And the last thing we ate was killer. Mediterranean sea bass, served with olive oil lemon sauce. Best fish I've ever tasted. \n\nBut really I'm writing this review for the service. They were amazing. I think our waiter is called \"Jerry,\" and he knew everything about everything. The waitstaff worked together on all the tables, and they seem really well-coordinated, and very concerned about not allowing us to keep our plates between courses. Once, someone even took our plates and exchanged them for new ones even though we hadn't used those ones for anything yet. Ha. I liked all of that a lot. \n\nThank you Milos!","useful":1,"funny":1,"cool":2},
{"review_id":"I0hWuAG13RJifNoAqnuY-g","user_id":"PJUIB97YoA6iF6-HHQMgOg","business_id":"WUq8HJHIZU4uteB154XN7w","stars":4,"date":"2012-01-25","text":"Just came here last weekend.  It was my second time and my experience was much improved from the first.  The first time I came here I had to wait over an hour in line to get in, and I got there early.  This time my boy talked to one of the promoters and let us in through the \"secret line.\"\n\nThis place is huge.  3 levels, the bottom level plays hip hop, the main level plays edm, and the top level is pretty much just a little lounge to chill.  I don't know why I can't give this place 5 stars.  It has so much potential.  Marquee books big name DJs to perform on the main stage.  The light wall behind the DJ is incredible.  If you don't like EDM you can go downstairs to get your groove on to some hip hop.  If you're a little tired you can go upstairs and take a break.  There's even access from the main floor to get outside by the pool for some fresh air.  And there's beautiful women everywhere. \n\nHere's where Marquee needs to rethink.  So you decide to make your club huge, 3 levels in fact, but there's a limited number of elevators you can access to get from floor to floor. No one wants to wait 20 minutes to get to from floor to floor.  Then you think it's okay there's stairs. The worst idea.  Nobody wants to walk a million flights of stairs either.  Invest in a ESCALATOR PLEASE!  Also, Marquee has to be breaking the capacity law because it's like sardines in the damn place.  I don't want other dudes rubbing up on me while they're trying to get pass me. \n\nOn a side note: if you get faded, most likely you won't even care about all these problems.  So just have a lot to drink, and enjoy all the potential Marquee has.","useful":1,"funny":1,"cool":0},
{"review_id":"Yflr8FAwE_btsbruXouRoA","user_id":"PJUIB97YoA6iF6-HHQMgOg","business_id":"MpmFFw0GE_2iRFPdsRpJbA","stars":5,"date":"2012-01-25","text":"XS has really changed since the last time I've been here, and that was only a year ago.  One huge change they made is the DJ stage they put up.  The dance floor used to have access to outside, but they put the stage there so you have to walk around the sides to get outside.  Another change they made is booking these big name DJ's to put on stage.  I also noticed the set-up for the line for XS has changed.  \n\nSo, I came here over the weekend for a friend's birthday, and we got bottle service for 12 people.  A little disappointed at the location and size of our table.  Our table could only seat 5 people, and the table was outside, so we couldn't see the DJ perform from our table.  You'd think we'd get a better table for spending a few racks.  Maybe it's because we reserved out table only a week ahead, probably should have done that a month before.  Other than that I had a great time; I was feeling myself.\n\nSebastian Ingrosso was spinning that night, and I have to say he tore it up.  The DJ stage is definitely an upgrade.  Actually feels like the dance floor is bigger.  I must have spent the first 2-3 hours at the table drinking because by the time I got out to the dance floor, I was on. And once I got to the dance floor I didn't leave.  The music was so on point.  It had me fist pumping and jumping for another 2-3 hours straight.  I didn't even mention the lights.  It was like an upscale mini rave in that piece.  Only qualm about the music was it was electronic all night.  I would have liked a little hip hop to bump and grind with the ladies.\n\nI would give XS 4 stars, but here's where they earned a bonus star.  The first time I had bottle service at XS was a couple years ago, and one of the people in our group was over and passed out at our table.  Security then proceeded to kick that person out of the club.  This week was completely different.  We had not one but TWO people that were completely faded and passed out at the table AND it was before midnight.  Security didn't approach to us once!  In fact, we took it upon ourselves to get them out of the club.","useful":1,"funny":1,"cool":1},
{"review_id":"iRKdjVvi96ilDiC34JUJ0g","user_id":"7A_6YT6SNBOd2XCIMfbKkA","business_id":"IWq35Pd1oVG4pQEbCsmcCw","stars":5,"date":"2014-02-04","text":"Jim is a real professional and has mastered the art of printing and providing stellar customer service. He provides on-time quality service and products to provide your business the utmost in excellence. You need to review his website, call him, and meet with him to realize that he offers the best and delivers the best. I have heard nothing but wonderful things about Spectrum and having worked with Jim I an attest to his professionalism and hard work to make sure his customers are happy and walk away with stellar products for their business, event, and or fundraiser.","useful":3,"funny":0,"cool":3},
{"review_id":"lZ5e_MU1Nbw6vOv6E_yvKA","user_id":"WnqDP4e6wrxIpiMvenS2hQ","business_id":"DaVnpKqjOaYNHQ1UYOpqow","stars":5,"date":"2016-02-23","text":"Andrea and Sarah are amazing!!! I just got married Saturday and these girls made me and my bridesmaids look absolutely AMAZING !! I'm so happy they were part of our day and would highly recommend them!!!","useful":0,"funny":0,"cool":0},
{"review_id":"-r0yB15FtzroKMvfz18dWg","user_id":"nyGhx2t9EcuMTcIYNL8WRg","business_id":"IzhuMNXqsglIYfCXt9OChw","stars":4,"date":"2013-01-25","text":"The only reason why I didn't give this 5 stars is because it's expensive. Otherwise, it was great. I wanted to try something new and I decided in getting a gel manicure. Mila was a great employee. She was gentle and informative. She deserves a 5. My nails came out great.","useful":0,"funny":0,"cool":0},
{"review_id":"7BUgjT2XvaoRUlAimvD70w","user_id":"nyGhx2t9EcuMTcIYNL8WRg","business_id":"rV1nkTx58v_q7YGDkGzfxQ","stars":5,"date":"2014-07-29","text":"I'm so glad I found this business to service my BMW. I needed a wheel alignment bad. They serviced my precious Pearl in 30 mins and now she drives perfect. Thank you.","useful":1,"funny":0,"cool":0},
{"review_id":"eu9UlcNbt-nBtnQOZSh8IA","user_id":"1Q56vt4pCsPIHcx9sMk44g","business_id":"8lPxiYChdJdTV24NJvOB3Q","stars":4,"date":"2017-07-03","text":"Found myself another soup spot. The small size is more than enough for anyone unless you're stature is similar to Shaq's.  The meat, noodle, and soup ratio is just right. It seems consistent as i creeped at other ppls bowls. Don't judge.  I suggest to get the regular size flat noodle.  I keeps it's al dentenest all the way through your meal. My hot date had the thin flat noodles.  it was good at first but then got sticky and soft.  Not the way to go if you want to get laid, however, the overall flavour and experience was enough to get me to homebase. Hand pulled noodles is the only way to go. Price is just right to afford a second date. ; )","useful":0,"funny":0,"cool":0},
{"review_id":"wN32y1mi-nNeSuZCL6lM8w","user_id":"kUaqcjPoj4i1-bCKszmUWQ","business_id":"Ggae0kbsWTzzTyDiTEwILw","stars":5,"date":"2017-12-08","text":"I had never met or even spoke to Nick before walking through the door at Higher Ground.  Upon waking in, I immediately knew that I was in the right place. The shop was creative, edgy, comfortable, engaging and most importantly it was badass ... which was exactly like Nick , himself! The craft of tattooing entails a creative mind, a steady hand and the ability to make magic happen through art!  Although my ink was simple this time ... I know Nick will be 'My Guy' for everything else moving forward.  Thanks Higher Ground for brining your vision to life so you can help us all bring ours to life too!","useful":0,"funny":0,"cool":0},
{"review_id":"-HXGqyOlFhDIXjGOsMS4xA","user_id":"NOnUj8c4qdRW4kFKnqsr1w","business_id":"-XLjdLpTLJ672EMN5Dfrhg","stars":5,"date":"2016-09-21","text":"I've been to Hakuna Matata for mani\/pedis at least four or five times now and it has always been a relaxing, pleasant experience. The staff is very friendly and accommodating and the nail technicians have always done great work. I've been to several nail salons in the Sun City area, but will continue to return to this one!","useful":2,"funny":0,"cool":0},
{"review_id":"yGOTS0yVE0_AjwKX-kOcIA","user_id":"NOnUj8c4qdRW4kFKnqsr1w","business_id":"utIA0LyQmwP-9DRyxUe6qQ","stars":5,"date":"2016-11-23","text":"I really loved this place. Decor was cute and the food was fantastic (I had two types of the various eggs benedict offerings...both amazing). I would just recommend to the owners to not have seating so close to the ping-pong table. Although I personally could handle the sound of the table, my mom became annoyed. Also, people were constantly asking us to pick up wayward ping-pong balls that had rolled underneath our table. Next time, I will make sure we ask for a table somewhere far away. But, that said, can't wait to go back. :-)","useful":0,"funny":0,"cool":0},
{"review_id":"0kH1F8EZKm-Heu4AQRJiIA","user_id":"COK8JfIzYfh6trd3Fm41ww","business_id":"nxCRx5_US4XLxufkF6-Tlw","stars":5,"date":"2015-09-02","text":"Thank you for both of my shuttle guys, you guys were great and went above and beyond to get to my destinations safely and in a timely manner. Thank you again, keep up the great work! ;)","useful":0,"funny":0,"cool":1},
{"review_id":"5pUM-mZKs91v0d6ZsAEjkg","user_id":"NEvV4Nw_39AHLJKHLxhusw","business_id":"zCYlhzVURHA6hWZzmpn4bg","stars":5,"date":"2017-08-14","text":"We use RP Gas Piping for all of our exterior gas components on our custom builds.","useful":0,"funny":0,"cool":0},
{"review_id":"WcmvQBkwtPl9ps1su07vwg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"XJRaNKBVyqLYwsKDufxLxQ","stars":3,"date":"2014-05-20","text":"This autozone got only two employees and it took me quite awhile just to buy a oil filter. Could use more employees to help with all the costumers. \n\nBut when it comes to your turn they are very helpful if you can't find something that you needed. And can call the other stores to check.","useful":2,"funny":0,"cool":0},
{"review_id":"e7ZP2qhWfUIkm74JDj3tFA","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"tdMGTA8KPubekgBM7BvMHw","stars":3,"date":"2014-05-23","text":"If you're driving down Grand ave from central Phoenix this will be the first Circle K you come across I believe. Their gas price are more expensive than other but I mean if you need gas you need gas. The place is fairly clean but the bathroom not so much but friendly staff.","useful":1,"funny":2,"cool":1},
{"review_id":"NmxXGY_ypr6C4EAMB9qLpQ","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"UzhyQFUsubSPnUO5Nhg9Xg","stars":4,"date":"2014-05-23","text":"what I love about Costco is their great price, even on gas. This particular Costco is more toward business rather than the normal Costco, they do not have a photo center but do have printing\/copying center. One other thing I keep forgetting whenever I come to Costco is that they don't not accept any other credit card beside amex. great place for wholesale and gas.","useful":2,"funny":0,"cool":1},
{"review_id":"iF9NXexG-r4old63LrNQvQ","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"FzFmLQPWEX6awEN8D_CLgw","stars":4,"date":"2014-05-30","text":"oh Zia good thing you are around, this is a amazing place to get use CDs, DVDs and video games that are no longer available in other stores. They also have collectible toys, cups, key chains, books, old records and many many more.. \n\nthe staff are pretty cool and the place are clean. sometime if you are lucky you can come across a amazing find that is worth more than you paid for... or priceless for some each individual. I don't personally know much people that listen to CDs nowadays but for me they're amazing which this is the place to get them at. \n\nkind of hard to leave without buying something..","useful":3,"funny":2,"cool":2},
{"review_id":"X-pY8OeD0Ajs8U8CYs2Zgw","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"MRznF7GUXd48Oiglk6EfLQ","stars":4,"date":"2014-05-15","text":"Very helpful and more than happy to answer any question you may have. And plus its 24 hours which allows you to pick up and drop off your proscriptions anytime which is awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"oxNGHQvtAo4XHOHADu7f1A","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"Jsfag1tWh3I408hDTcA7EQ","stars":4,"date":"2014-07-15","text":"So I finally got the chance to try out this place, drove by couple of times and had friends said it was really good and they been coming here since kid. It was a hot Sunday afternoon in Phoenix so me and a friend was thinking what's better things to do than get some ice cream.. \n\nThis place definitely be here awhile and you can tell, as we walking in we were greeted and was seated down. The place have a 60s look to it and it was quite unique, even the employees dress according to and compliment to the store. All I wanted was some ice cream and was the reason I came here, I got the 3 dip homemade waffle bowl with mint chocolate chip, cookie and cream, and caramel pecan. I got to say this was one of the best ice cream I have tasted in a long time. Plus I didn't know 3 dip and each dip was two scoop. It was very felling. \n\nThe employee was very attentive and nice. The price for ice cream was really good for the amount. I am very please with it. I am looking forward to come back and see what else they got. One thing that caught my eyes was like a bucket of ice cream that was over $100, sounded very interesting. But man who could eat that much ice cream anyways.. Anyone who haven't check out this place should give it a try, I mean I liked it. I haven't try anything other than their ice cream which was great.\n\nOne other thing that I really like is they close at 11 on Friday and Saturday which is awesome, now I have a place to stop by after work for ice cream.\n\nWILL BE BACK AGAIN.","useful":3,"funny":3,"cool":4},
{"review_id":"8th_8N7tLRlrr8jfkDo_xw","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"_N0FmkS2ab74z1NbGYTyeQ","stars":3,"date":"2014-05-02","text":"I stop here couple of time to get a quick car wash or just vacuum my car, the price for a wash is good and they also offer where you pay a month and you get unlimited car wash. Most of the vacuums either dont work or missing, but its free vacuum, which every other car wash have.","useful":1,"funny":3,"cool":0},
{"review_id":"1fRD-Y1OQwbrVPDI8-tAsg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"7MNBIoGznDHhC1AfxGWOFw","stars":2,"date":"2014-06-28","text":"We had been their costumer over 6 years now and we're finally moving on, their poor costumers service had exceed anything I ever come across. The last two month we paid the bill with cash in the store but they seem to have lost the records of any bill being paid and they are charging us fees over fees. I personally try to go in and show them the payment that was made but they give me a hard time. with 30 minutes of arguing and explaining they finally removed one fee, \n\nI got to say I am disappointed how much they have changed in costumers service. I really hope they will turn around and give more happy costumers their time and services that they want and deserve.","useful":13,"funny":1,"cool":2},
{"review_id":"Bin3ef2E5FY_Z8x2_NlYug","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"A_1pRhjq-KxnIbqzI6CKQA","stars":5,"date":"2014-05-20","text":"Amazing service, this is a fine example of costumer service. I was unhappy with the other branch so I came here and they help me fix all the mistakes fees and was able to get my situations resolved, recommended this branch to all the BoA members if need personal banker or just banking in general.","useful":3,"funny":0,"cool":3},
{"review_id":"qG01jN8N169miY8itxb3ew","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"7BhhApVhGkADy-SlwAikQw","stars":3,"date":"2014-05-04","text":"Yes they do have cheaper gas but they have different prices for those who uses cards than cash, they charge fee to use your card compare to you using cash. It's worth it if you wanted to put gas with cash but I personally think it's the same price if you are using credit\/debit in other gas station.","useful":1,"funny":0,"cool":0},
{"review_id":"UOeubxamYOoGNKheXPEhzQ","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"DkaPGavPjjw9DWUmrZ19IQ","stars":4,"date":"2014-05-23","text":"I always get coupons from them and it always bring me back to buy their chicken and the price are also good too. But they don't have a drive-thru like the one on baseline and I'm just being lazy..","useful":2,"funny":0,"cool":1},
{"review_id":"hgeX2CPX13heMClsnMCjeQ","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"vHbbjyYsk2e_hOM9ytlzfg","stars":4,"date":"2014-05-15","text":"What could I say? Well it's circle K just like any other but this one is clean well organize and employees are friendly too, they say hi when your walk in and thank you when walk out.","useful":1,"funny":0,"cool":1},
{"review_id":"yZxSxZ1inC8FWF3Z_iFXPA","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"ufKEWP_6GYUwkupXsybmNw","stars":4,"date":"2014-05-19","text":"Nice, clean and friendly gas station. The gas price is reasonable for which the station is located. This might be a minor thing but I like is they have free air, which other gas stations charge for $1 just to put in air for your car. They also got good choices of snacks and drinks.","useful":3,"funny":0,"cool":2},
{"review_id":"okJDE08zziuCq1-njW9Y-A","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"BWgXFbRqrPKci7C1__6BXg","stars":4,"date":"2014-05-01","text":"I came here on my way to school the other day and didn't get the chance to sit down and eat there but they are express so you can always do a take out which is pretty quick, i ordered teriyaki chicken with broccoli and can't wait to try what else they have to offer.","useful":0,"funny":0,"cool":1},
{"review_id":"S7M1tQYVm4PRWFqcC42lzg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"imB4DVyS7LV4iEZkUD3j1w","stars":5,"date":"2014-05-23","text":"Around the area this food city have some of the best fresh produce with a awesome price that is hard to beat. As a college student 6 roman noodles for a buck and 3 powerade also for a buck is great. Big money saving right there. Their prices are low and in a certain day there are special going on that you got to keep an eye out for. Recommend this for all your grocery needs.","useful":4,"funny":4,"cool":2},
{"review_id":"h1hw0W_gR7rsMYxwgabRig","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"O3swSW2vRXaPrfe0G00ngw","stars":1,"date":"2014-05-21","text":"Got to say the worst Denny's I ever had been to, we simply came in to grab some fries, the food was done and the only two worker who is working here took a break\/went outside at the same time while the food is siting cold. \n\nNot recommended, very disappointed at the night shift worker and my visit here. They also didn't care to clean to tables or even pick up the plates. I don't know about other shift but the night shift had a very poor costumer service","useful":4,"funny":1,"cool":2},
{"review_id":"McHPsNM69K-iO4oojTIL2Q","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"hAMB5-aCxrlqzF5u6NEhkQ","stars":4,"date":"2014-07-09","text":"well its my school, so I thought what would be better than writing a review for you own school... what could I say about Phoenix College?? The school is pretty small, smaller than the rest of the Maricopa colleges if I'm not mistaken. But there is a reason why I drive across the city to come to this institution, I love the staff and the instructors who are here at PC, they are very well knowledgable at what they are doing. \n\nI have been attending here for couple of years now and I just like it here, community colleges offer smaller class and get better interaction with the instructor which is the way I learn best, and they are more than happy to help you with anything you need. Plus is cheaper to get your core classes at a community college. \n\nThe parking is a little crazy from 9-12, and 4-7, one time I drove around for 40 minutes until I finally found a parking space. One thing I don't like about this school is the citation they give out, They give you a citation if you park reverse\/facing the wrong way without any warning or anything at all. Well I guess I learn the hard way. I love the fact that Phoenix College have a parking garage, to those of us who knows the heat well in the valley know that that's a life saver right there... keep your car nice and cool without having to worry about passing out trying to start your car, but you go there during the crazy hours you won't have a chance of finding a parking spot. \n\nOverall I am happy with the school and will recommend anyone who are in the area looking to farther their education or anyone who just graduate from high school..","useful":9,"funny":3,"cool":2},
{"review_id":"cUpmY3_bsJv2Pio2bfOlJw","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"9mgkQej4gqkB12657_xT7g","stars":4,"date":"2014-05-12","text":"Just another normal bank but the staff are friendly and will be more than happy to help with whatever you need. Mostly come here for the drive-trough ATM.","useful":0,"funny":0,"cool":0},
{"review_id":"b5-iIcWFNjbS7Hkz3NvqNg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"PrBOEDmZepfXns_ws4iKpQ","stars":4,"date":"2014-05-02","text":"One of my favorite things about thrift shop are you never know what you will find, its either you find a treasure or leave empty handed. Phoenix Christian is a neat little thrift store, very clean and organized, the store do have more housewares and furniture which is great. They also have a variety selection of vintage items. Price are good for what its for, the staff are friendly and more than happy to assist you with anything. Will check back again to see what else they have.","useful":8,"funny":1,"cool":4},
{"review_id":"zB6W3YTsHUDRjD98bEyhHQ","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"vjN9OONB8Yqf2COy7tIUNQ","stars":4,"date":"2014-06-08","text":"This 99 cents store is well kept and clean. You can't never go wrong with 99 cents stores, find things that are inexpensive and very useful for a good price. They have everything from produces, dry food, house and car products and my personal favorite is the awesome selection of candy that they have here. \n\nThe employees are friendly and willing to help if needed. This particular store is seem to be better than the rest maybe its closer PV thats why. But its always nice to shop here, they got fruits, vegetable, chips, sodas, camping gears, and many many more...\n\nworth checking out if never been here...","useful":3,"funny":0,"cool":1},
{"review_id":"xD57gc6VA6HHd2VYac4Nxg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"mBeZ3dQzUPV60Oa26k3qHw","stars":5,"date":"2014-05-20","text":"Godzilla was awesome, this Harkins Theaters was very busy, more than normal or maybe because its the weekend. Either way we enjoyed our movie and the staffs are friendly and theater was very clean and well taken care of. No trash on the floor and everything was just great.","useful":6,"funny":0,"cool":3},
{"review_id":"aY1W18Y8kxa6g-1cmOtLyg","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"p_xIP8gXFhAVCjftc3l9dA","stars":5,"date":"2014-05-21","text":"I just love the fact that they're open 24 hours everyday not just the drive-thru. No matter if you are a early bird or night owl you can always stop by anytime to get some donuts and coffee and be on your way. They have many variety of donuts you can choose from with good prices, but they don't just sell donuts. They also sells sandwiches, shave ice, teas, and many more. \n\nThe facility is well maintenance and employees are friendly. It's worth the time to check them out and will not be disappointed, We wasn't, and whenever we are in this side of town we will stop by here.\n\nWish there are more of this type of places in the valley.","useful":3,"funny":0,"cool":5},
{"review_id":"htkKDNZZ4KnJeXusPZtEFw","user_id":"p7HMe4REUwSHn9in8mUQMQ","business_id":"tSUjE80hfuwGrVOkVcjKIw","stars":3,"date":"2014-05-12","text":"Outlets malls are tented to have good verity of stores with good deal from the regular store but tanger is not much so, handful of the stores are not even outlet version of the main branch store, and it's a outdoor outlet which is fine but can be hot in the summer, but hey what else do you expect when you live in Arizona. It's just your typical outlet mall, worth checking out if you are in the area but not if you just going out of you way to come here.","useful":1,"funny":0,"cool":0},
{"review_id":"_haeg9wJ5sbD2A8SO9XYOA","user_id":"nXooGRaWmJNI-OWgRo1hOw","business_id":"xg559kd7cf1kWD8SgtfBrQ","stars":1,"date":"2014-11-27","text":"We first moved to Highlands in 9\/2011.  We loved living here until this past year when new management took over.  The office staff are rude and maintenance workers are lazy.  If I have to pay for water I want our leaky bathtub faucet fixed.  The response was to \"crank the knob really tight\".  I may not be a maintenance worker but am smart enough to know that is a short term fix and long term is going to cause a lot more damage..  \nDuring their deals we moved into a remodeled unit with new laminate flooring, cabinets and granite counters.  Unfortunately, just like our old apartment they still install cheapest carpet possible that is not tacked down.  Nothing like walking out of your bedroom in the morning and stepping on them.  They provided us with a brand new dryer and a moldy smelling gold washing machine from the 90's.  We asked them for a new washer and they pretty much notified us we will have to use it till it breaks.  About the smell?  They gave suggestions on eliminating it but of course none work.  \nThe Highlands thinks by renovating they will be able to compete with the local market.  Lets see here.......Regents has dual paned windows vs single pane at Highlands.  Pretty much every other complex in the area have fitness centers twice the size and have equipment that actually work.  There is definitely something wrong with the weight sets here.  \nI love the location and if they can bring back the caring staff and put residents first it may be a place worth staying when our lease is up.  I just don't see that happening, we are already looking to move.","useful":0,"funny":0,"cool":0},
{"review_id":"LF-bhsrCj80oZTjgurnh-g","user_id":"nXooGRaWmJNI-OWgRo1hOw","business_id":"5rHzI9-HxUwZo1bawKL_NA","stars":1,"date":"2016-10-22","text":"I have lived at Breckenridge since 2\/16. In the past 6 weeks there have been 4 gun incidents, 3 of them were shootings. I understand the complex can't promise a crime free environment but nothing is being done to make residents feel safer ad office pretends they know nothing about the incidents. Apartments have no insulation and thin windows let all the Phoenix heat in, no air flow in the apartments means no temperature relief even when it is in the 60's outside and fans are in the windows. Definitely will not be renewing the lease.","useful":4,"funny":0,"cool":0},
{"review_id":"1jYVoZIMFF-W3M8VLXZb3Q","user_id":"y5ECbcOmFkD36w-v3xecGA","business_id":"w4I7EXRzj-lUO1CWlUwCnA","stars":5,"date":"2017-04-01","text":"After 28 years of self-taught golf I decided it was finally time to get some help. My game had peaked a few years ago at a 6 handicap and I was on a downward slide towards double digits.\n\nI contacted Elite Golf Schools of AZ and signed up for the four-lesson pack after they started teaching out of the club I frequent. Tyler was my instructor and after the past two months I can say that he has helped me turn things around.\n\nAfter 28 years, I finally have a system to play better golf instead of just guessing on what I need to do. Tyler has helped me realize not only that I was swinging incorrectly, but that I need to be aware of why I'm making the mistakes I do.\n\nMore than just swing changes, he has shown me how to recognize why I hit a poor shot and how to correct it. He also helped me come up with checks and drills to continue to evolve my new swing.\n\nAfter the lessons, I've been able to shoot my lowest round in almost a year due to increased consistency and more confidence.\n\nI highly recommend Tyler and EGSA if you are interested in improving your golf game as a whole. Lots of people can read tips on the internet or get advice from people who play better golf then they do, but I now know that it takes someone spending time to explain these things to you and also evaluate how you are actually applying them.\n\nThank you EGSA and Tyler for your help and I look forward to working with you guys in the future when I inevitably start to stray from the path again!","useful":0,"funny":0,"cool":0},
{"review_id":"iIQyrh4zQBmZkWT2oEb5Vg","user_id":"pzKYZ1wX8EmGQNhali3gHA","business_id":"bsrj9_hFAql3dlSf244zpg","stars":4,"date":"2017-10-20","text":"I have not been to Las Vegas in over 25 years and just had to find the Trump Hotel on this visit. It was disappointing that it was just a hotel and not a casino. After taking a cab over to it, we did not know what to do while there. We therefore had a brunch breakfast which turned out to be quite a treat. The staff was very friendly and accommodating. They even offered to make  us fresh eggs from the kitchen instead of having us eat the ones that were on the buffet. The buffet was not very extensive, but it was very tasty. Of course we loved the touch of gold that Trump has in his decorations!","useful":0,"funny":0,"cool":0},
{"review_id":"2DcJ-uQKhWxIYxYALPCyIg","user_id":"Zmca0vPjFRg8PPKtlON6Ig","business_id":"VMcUG1dw4ldI_ldA2lGyEA","stars":1,"date":"2014-08-13","text":"The meal is ok but I am not happy about the staffs. When dj was playing,   we were dancing, I saw a guy who is recording the video while zooming on the legs and.... I called the waitress and asked her to tell him we are not comfortable that you record us. He doesn't stop and waitress told me that he is the manager and I can't do anything. I don't know where they will use those videos but be aware of it.","useful":1,"funny":0,"cool":0},
{"review_id":"dnUFf17pgHlj8mrkdT007A","user_id":"Zmca0vPjFRg8PPKtlON6Ig","business_id":"kmGXnOfkBldRQ_ECXytFUQ","stars":5,"date":"2015-03-03","text":"Food was Great. I order Lamb CousCous and my friend ordered Duck. It was rally good. Well cooked and delicious. The waiter was awesome. so friendly and kind","useful":0,"funny":0,"cool":0},
{"review_id":"javkaO0Y94JT974hJ8tupQ","user_id":"T9jX6lt-TzGMHFtBWl5Z_Q","business_id":"e0CTLPxTnFEQSqQ1FJUqog","stars":3,"date":"2016-05-05","text":"I'd say that if you are a cheapskate like me, it's worth dealing there. Gotta take a few shuttles to get there. The line was long, about 20 deep. Took about 45 mins to get to the counter. You'll get the typical upsale, just stick to what you have. Refill gas on your own before returning. Do a thorough inspection with person at gate, make sure they mark everything. Leaving car is easier, pull in lot, they will check car stuff, print a receipt and you are gone. Shuttle to main rental center, then switch to shuttle to airport. I'd do it again, but I like sketchy, kinda cheap, mystery. All in all it did what I needed!\/","useful":0,"funny":0,"cool":0},
{"review_id":"swJZVUwXbaecml822t4Iug","user_id":"lKLjBepx-N7hZ3lJWp_R6g","business_id":"N8B5PBiMe3fnYOS4XnH2Vw","stars":5,"date":"2017-12-17","text":"Very professional punctual and friendly. They really did great job with no scratches on the wall and furniture. I highly recommend These folks.","useful":0,"funny":0,"cool":0},
{"review_id":"ma_E3ID2HVn_PuXxCSul2w","user_id":"ErRfmymgjF0yF_2hFDQN4g","business_id":"EcOerZtVkq2AGudt9QmrCg","stars":1,"date":"2016-05-18","text":"Beware !!!!! We purchased a truck camper from Brad only to find out the guy we trusted was not upfront about alot of things. People .......do your home work and research the safety side when purchasing a camper. Also....review the numbers when dealing with any company and don't become a victim of the smooth talking salesman. Their new location has gone to their head. The lack of building lasting relationships with their clients is not a priority to this company.","useful":2,"funny":0,"cool":0},
{"review_id":"6-rVKTY89TDZhS8NrmE0KQ","user_id":"j5OFd6GA_zqJFbH_-iwJYg","business_id":"omwPSPE8j7jEP4mecQM8KA","stars":5,"date":"2014-05-24","text":"Amazing sushi! Really delicious. Not filled with rice and generous amounts of fish especially in the hand roll. Clean and friendly service!","useful":0,"funny":0,"cool":0},
{"review_id":"nAYbpOONWDp56J0cFmtAzA","user_id":"XlzD1y1n0ARjHtvvrde67w","business_id":"OVczZ1qHXc3bjDprNvCKBQ","stars":1,"date":"2014-04-12","text":"After years of repeat business I took a water damaged iphone 5 a screen damaged iphone5 c and another iphone 5 that i had damaged the screen they told me $250 for one phone and 350 to fix the others so paid a deposit and had a $40 balance when I came to pick up my phone they had fixed a compleat different phone  i left the other phones to be repaired. But the  store had not repaired the phone I had picked up correctly so I had to return to the store for the next 5 days for at least an hour a day before they finally just gave me a different phone I called today because this phone is broken as well and to pick up my other two phones to take else where to be told by the owner they sold my phones because it was over 30 days. Needless to say I will file a complaint in small claims .!def not how you expect a store to treat you I feel robbed almost.","useful":1,"funny":0,"cool":0},
{"review_id":"YB8QoML7c0bsCpAkkcR6Ag","user_id":"W2py9z7exsdhFZzOo2ylEw","business_id":"J2WGpC43MJDKxPRAcWx-tA","stars":1,"date":"2016-08-13","text":"I went to this school and managed to learn next to nothing. God, where do I begin? My classes always seemed to be at 7am, making them impossible to make half the time. I had literally the worst English 102 teacher (Ms. Landry or something) who was just out to fail me. The night I got my first MIC was an absolute nightmare. He confiscated my backpack full of nattys but managed to overlook the coke in the front pouch ;). I swear the cops on campus are bringing in so much revenue off of underage drinkers. Oh and the Dutch bros on campus is so crowded, you're sure to be late to your class if you require coffee like me. The mill scene is ok but I tell you, I'm not going to miss it. Dropping out to work at my dad's towing company has turned out to be the best decision of my life","useful":1,"funny":2,"cool":1},
{"review_id":"ebV6LLTpiIhfO4CEXH1UUw","user_id":"W2py9z7exsdhFZzOo2ylEw","business_id":"0BbRoMwVTZgYV1oqgtsHOw","stars":5,"date":"2016-08-13","text":"Moonshine is the best thing that has happened to me an my boys. It's my refuge from country music bashers where I can let loose and be myself. Did I mention they have excellent rum and cokes? When that liquid hits my veins, and I got my boots and boys with me, I'm sure to leave a crater the size of Texas on the dance floor. 5\/5. Cheers!","useful":0,"funny":0,"cool":0},
{"review_id":"8dGoluUr8m8UoJ6SoWFrSA","user_id":"RaCRU8M4Ii_0Mt58O4WnEw","business_id":"itdoCsqV1l-ksOoDViHiTA","stars":5,"date":"2017-06-01","text":"I have  searched several states for the right doctor to trust my life with.  I am blessed to have found Dr. Parson and his practice. All my anxieties and concerns were professionally and carefully answered with an extremely gifted and talented Doctor combined with a soft touch.","useful":1,"funny":0,"cool":0},
{"review_id":"AD8UWRhuU8MG0eyouLBIvQ","user_id":"hYnrILxn57KlV4iMeJbXWw","business_id":"ghsoVhOvDnKYot3Y72g51A","stars":5,"date":"2017-03-15","text":"Thankful I found them.  MUCH better than the traditional storage services I've used in the past!","useful":3,"funny":0,"cool":0},
{"review_id":"SjXE9ZzTcI4kW0qo6lnkJQ","user_id":"NOloKawYtz2abaqG8F0QNQ","business_id":"kIW8IeTV3W1tS_q_WAU4wQ","stars":1,"date":"2015-07-29","text":"This was the worst service experience I have had in my entire life. Stopped in mid afternoon on a hot summer day with my wife. We were hoping for a drink and a small snack. Before we were seated the manager informed us that they were only serving the tapas menu, which was fine, and we expressed our desire to order food. There was one other table occupied inside the restaurant and we had the patio to ourselves. Apparently our waiter had to cut his smoke break short to attend to us. He came and took cocktail orders and said he would give us more time with the tapas menu. At no time on this 30+ Celsius day were we offered or brought water. When our drinks arrived the waiter placed them on the table, turned around and disappeared back inside immediately and without a word. We assumed someone would return, but were ignored on the patio. We sipped our drinks and eventually finished them. After several more minutes of waiting my wife went inside to tell them we were leaving. The manager offered to send the bill out. The waiter brought it out with a charge for French Fries that we didn't order. He told us it was Quebec law that their liquor licence required a food order. We told him we intended to order food, but didn't have the opportunity as he never asked us. We also told him we had no intention of paying for food we didn't order. He told us we could wait for the fries or not, but we had to pay for them. He lied and said he asked twice if we wanted to order food. When we refused again to pay for what we had not ordered he told us we could pay or just be thieves. We asked to see a manager. When the manager arrived the waiter continued to lie and say that he had asked twice if we wanted to order food. When we told the manager that this wasn't true he grabbed the bill, crumpled it and told us to \"f$!& off\". The manager was extremely apologetic and very nice. He comped our full bill. However, I cannot recommend strongly enough to not go anywhere near this place unless you appreciate comically rude and terrible service. It was like something out of a contrived Food Network show.","useful":0,"funny":0,"cool":0},
{"review_id":"I0Pdb3scQAs4rMAELxptLA","user_id":"iP8QC4NSHjOWsWY5Re2T0w","business_id":"1dhPgc7E7IzzpxjHM2LphQ","stars":1,"date":"2012-11-14","text":"Rude staff and dirty facility.  We left.","useful":0,"funny":0,"cool":0},
{"review_id":"o9XUx3dTGkB3QYXV2-_6Pw","user_id":"iP8QC4NSHjOWsWY5Re2T0w","business_id":"TmGxQgFdiG585PCs_2hCew","stars":5,"date":"2012-11-14","text":"A Squirrel Hill destination - easy access up Forbes by bus or through the park by bike.  Watermelon and custard was a favorite.","useful":0,"funny":0,"cool":0},
{"review_id":"LQ5JNxhCo215jm4I8VM-Ag","user_id":"iP8QC4NSHjOWsWY5Re2T0w","business_id":"o__g2Q64FnNc_Q4O70EhbQ","stars":5,"date":"2012-11-14","text":"Decent beer by West Cost standards, excellent beer by East Coast standards.  Worth a return trip.","useful":0,"funny":0,"cool":0},
{"review_id":"k_P-YghIM0kjaHMpklBwSg","user_id":"iP8QC4NSHjOWsWY5Re2T0w","business_id":"Fozo0B-y42EhRMomR0K5vQ","stars":3,"date":"2012-11-14","text":"Nice waffles, but slightly mass produced.  Better than a chain but not as good as other options.","useful":0,"funny":0,"cool":0},
{"review_id":"8NJch1BI86yfSS-UdbA4nw","user_id":"ZQIlrwvw_QMX45cqALoJzA","business_id":"AIh3_sN0cwqqMeBbIOzbvA","stars":5,"date":"2016-12-14","text":"I'm a first time home buyer and my main concern was that my inspector wouldn't explain things or take the time to answer my possibly crazy questions.  Jeff Smith from Eagle Home Inspection,  LLC was very professional and patient with my home concerns.  I appreciate the time and thoroughness.  He took time explaining in detail concerns he found in this house.  I would definitely recommend Jeff Smith to anyone looking for a honest inspector.\nThank you Jeff!","useful":0,"funny":0,"cool":0},
{"review_id":"7770FB81j9LDtRLusJ6izQ","user_id":"RLemzLu1Vt5CeJxIPztv0A","business_id":"eUuKXhloFVHdQsLdodcLbw","stars":5,"date":"2014-08-21","text":"This place is amazing, the food was the best quick serve Mediterranean I have had. Cant wait to go back! :)","useful":0,"funny":0,"cool":0},
{"review_id":"-6GkTdRXGB8_XH2iIPWMuQ","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"yGZ2gRDgJRoBun5DrzGm8A","stars":5,"date":"2013-02-28","text":"After being in pain for years from an old back injury, I hobbled in to Rod's place and was able to walk out tall and proud! I recommend him to anyone who is in pain; mental, emotional and physical!","useful":0,"funny":1,"cool":0},
{"review_id":"7viRyxDY5tX_eZx3W5wtZg","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"66MT1BxbarD_0CzkwQ1--A","stars":3,"date":"2013-01-03","text":"Solid food, solid service, TVs are everywhere for you sports folks, good selection of adult beverages.\n\nEDIT: They don't allow firearms, even if you are not drinking.","useful":0,"funny":0,"cool":1},
{"review_id":"B-RFi2vmqskEba7ygCt4VQ","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"o3ndze48oWtD9FAsJiZSSw","stars":5,"date":"2014-05-27","text":"This is a great facility! Full security system, clean, friendly, great staff! Prices are very competitive too!","useful":2,"funny":0,"cool":0},
{"review_id":"a0QRX0hYXTxMGPtwPSVmHA","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"6nAr3xXYnZ_GzoY85Za6Jw","stars":4,"date":"2014-09-16","text":"My Arizona Burger was cooked perfectly, and my wife was impressed at the quality of food for what is essentially a small sports bar. The waitstaff was friendly and responsive. 10\/10 Would come again. Four stars because the menu is not too extensive but seems to be cooked well. My wife made a joke about a \"hidden gem\" so that comment goes in here too.","useful":3,"funny":0,"cool":1},
{"review_id":"XGo4F44bKJyvhzAbOGZQPA","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"g3w01guDiTLszguA3vUrSg","stars":5,"date":"2014-10-09","text":"We went to Shabu Fondu with a group and we had a great experience! The staff was friendly, accomodating, and helpful. The food was great and it was fun to cook it yourself. The menu is rather extensive and it would be easy to eat vegetarian here. They served there water with some cucumber and that was also tasty. The wife and I had the Curry and Shabu Beef, Broccoli, Bok Choy and Rice Noodles. It was a winning combo!","useful":3,"funny":1,"cool":1},
{"review_id":"P6VxMPVSq4QsjK4-s9EZew","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"gMN6VKmu4E1EmlMYzz9A3w","stars":5,"date":"2014-09-16","text":"As I was eating I was surprised at the relatively low star count. My food was delicious and promptly served and the wait staff was kind enough to answer all my questions. They also serve six beers on tap, coffees and desserts. I also would like to try some of their new breakfast menu! We will definitely be back!!","useful":1,"funny":0,"cool":0},
{"review_id":"HD1iZ7lkhC8XcSCuYy9KRw","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"DgZ-pZUo3drzpiCDlDr9IQ","stars":5,"date":"2013-01-03","text":"So far I have only had pho tai chin and it was fantastic. I am glad to have found a great pho joint so close to me! Looking forward to trying the rest of the menu!\n\nEdit: Awesome, absolutely great. I have gone many, many times for late breakfast or lunch and I am never disappointed. The waitstaff is very friendly and always on the spot for drink refills and advice on what to get! I cannot recommend enough!","useful":1,"funny":0,"cool":0},
{"review_id":"Kj-2fMH_7TA6ZvK8_PyzIw","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"j5f3oICQSYHaLEXHVhsXfA","stars":5,"date":"2013-08-25","text":"I have brought my bike in several more times to Mike and he has proven himself again and again as one of the most motorcycle knowledgeable guys that I know. \n\nHe has even diagnosed a problem a couple times over the phone for me based solely on my description of the problem and make and model of my bike.\n\nHe consistently charges much lower rates for his time, work and knowledge than other shops do.\n\nI am continually impressed with him, his shop and his work ethic and cannot recommend this shop enough.","useful":7,"funny":0,"cool":0},
{"review_id":"JApYpe1hTDM0xgpBYCZr8A","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"XvTBQotmJpVPjPNaMM7qLA","stars":5,"date":"2013-01-03","text":"Great food! I have been to one of the other locations on Southern and both are amazing! My favorites are the seared ahi with hummus and the grilled vegetable entre!","useful":0,"funny":0,"cool":0},
{"review_id":"v0zk16Rgi6xb7kfcvGsZxg","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"TcULtaVLDsbKunf3iW7RCQ","stars":5,"date":"2015-10-17","text":"I discovered this restaurant by searching for restaurants near me with grubhub. I ordered a salad, hotbowl, and panini at the same time. All were very good even though I did not eat them immediately. I have been to the physical location several times since, the staff is very friendly and they don't mind any substitutions that you make. I am in love with thier hotbowls. Salads are nice and fresh and the paninis are super. If you have not been I recommend you go check then out tonight!","useful":1,"funny":0,"cool":0},
{"review_id":"hPZBmokRJViGfxb4zGGXLQ","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"LvSGhtDi0U8lwQUBb4fASg","stars":1,"date":"2015-04-01","text":"This is an honest review, I am not just jumping on the \"screw the VA\" bandwagon. I showed up for a blood draw at 7:00AM, before the lab even opens and there was a gigantic line. First you have to draw a number to even be checked in  and then you have to wait until your number is called to go back and get your blood drawn. From 0700 to 0723, I waited to check in. Once that was done I waited from 0723 to 0952 to be called back for my blood draw. The blood draw itself took under 40 seconds total.\n\nOn February 17th, 2015 I called and wanted to schedule a Dr. appointment because I was not feeling well. They called me back and said that the next available appointment was today, April 1. I accepted this appointment, having no other choice. As I pulled in this morning and experienced a minor miracle, finding a parking space, I received another call that said that she had called in sick, no I could not see another doctor but her next available appointment was April 22. Having no other choice I accepted this new appointment. \n\nI receive prompt, good-quality mental healthcare at the VA from the OIF\/OEF\/OND clinic but the rest of the hospital is poorly organized, poorly run, and overwhelmed. If this was a civilian doctor, I would be finding another healthcare provider.","useful":15,"funny":0,"cool":0},
{"review_id":"rFH6kVBzTUSe4JeFXxtlBQ","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"GDWaUX_LwZ9o1TtZFmm2Lg","stars":2,"date":"2014-11-24","text":"Long time member of 24-hour Fitness here and this one is my home gym because it is a couple of minutes from my house. This gym is the worst I have encountered in terms of facility renovations needed. The light fixtures in the pool area have rusted completely over so you can't even tell what kind of metal it used to be and the glass covers do not stay on over the lights. All of the tiles in the pool area could use a thorough powerspray or replacement. The sauna has the glass brick window\/walls that are cracked and broken. The mens shower area is actually alright, showers work, lockers work and it does not smell like a gym sock (props to the cleaning staff, who are nice, btw). The walls in the actual gym area are scuffed, marked, and more holey than my daddy's bible. There are at least five spots that I know of that need a hole patched in them. The cardio equipment is in serious need of repair and replacement and some of the cables on the machines are dangerous. Last of all, the hours... I have insomnia so sometimes at 1 AM on a weekend I decide to go get my pump on and it is mildy irritating to have to drive to Mesa Riverview to do so, even if there equipment is better. The name of the place is 24-HOUR FITNESS! WHY IS MY GYM NOT OPEN FOR 24 HOURS??? On the plus side the staff I have talked are friendly and sociable! I hope they remodel because the building is nice it is just 30 years out of date.","useful":1,"funny":0,"cool":0},
{"review_id":"Z8srSj0xgB7Vzvra3Ydwug","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"fkfVkLnoPNgVddCy0A41yA","stars":3,"date":"2013-01-03","text":"Decent doughnuts, coffee is strong as hell! I drank one and a half cups and was up all of the following night! :-)","useful":1,"funny":0,"cool":0},
{"review_id":"OUPUAvv01lj8Lb1YuA9_uw","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"r8hVqm9DeasZ0Bf2KMhbeg","stars":5,"date":"2015-05-16","text":"We have been coming here on Saturday mornings for a couple of weeks and I just had to let you all know how great they are. Every bit of food that we have ordered has been top notch and every server has given absolutely exemplary service. I recommend any of their skillets and to start out with a cinnamon roll for the table. The servers remember us and events in our lives that we casually discussed with them and enquire about these events when we come in. This level of attention to detail and dedication to customer service is far above and beyond what is normal for the area. I absolutely love Crackers and Co. Cafe and cannot recommend them enough!","useful":0,"funny":0,"cool":0},
{"review_id":"GSIkMjBdkQXQrz4MXXLrHw","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"E4JyAzB5_2quptwtemyhYA","stars":5,"date":"2015-02-21","text":"The wife and I were in the area and decided on breakfast out for Saturday Morning. We saw the high rating and boy, do they deserve it! There were at least six parties in front of us but we were seated in under 10 minutes. The atmosphere of the place is busy, bustling, and loud. I ordered the Cajun Andouille Sausage and Chedder Scramble and the wife ordered the Chicken Apple Sausage Scramble. Our order was on the table in under 5 minutes. We both opted for the home fries upon the recomendation of our server and they were very good. Perfectly seasoned with a firm crust on the outside and soft and delicious on the inside. We also both opted for a biscuit and paid extra for the gravy. Soooo worth it. Thier gravy was made from real sausage, slighty sweet with a hint of warm spices, fantastic. The scrambles were mostly large chunks of delicious and succulent sausage, with just the right amount of cage-free eggs and cheese. The coffee was good, standard higher end restaurant fare and the service was amazing. The servers and staff were fast, polite, and accomadating. We will be coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"4Bfqu98j1OSxLQdYL5Y10A","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"pxRy9F0HwN7zJ7J89AwUpQ","stars":5,"date":"2014-07-13","text":"I have eaten here a couple of times and have always been satisfied with the quality and quantity of my food. The reason I felt compelled to write this review is amazing customer service.\n\nSo my wife is particular about the way her over-medium eggs are cooked and this morning she ordered them this way and recieved them between over-easy and over-medium. Being the awesome wife that she is she remarked on it and proceeded to cut them up to eat anyways. As she was doing so, our server (Hope M.) approached and asked if her eggs were undercooked. She explained that she also eats them over-medium and saw that they were not perfect and already put in an order for perfectly cooked eggs. My wife and I were both impressed that without any complaints, the server paid so much attention to us that she noticed a little dissatisfaction and acted to remedy the situation. One thing that will always earn my gratitude and repeat visits is customer service and The Good Egg does it right!! Oh, and my Lumberjack Skillet was also yummylicious!","useful":1,"funny":0,"cool":0},
{"review_id":"UNZ4XK990ggJ9VcL_Cjmxw","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"SWhHaWFuijy_KDs0zVCJog","stars":5,"date":"2014-06-12","text":"It had been a while since I had Italian food so the wife and I randomly picked RigaTony's and we are damn glad we did! The interior is tastefully decorated and charming and it has a cozy atmosphere without crowding the tables together. \n\nThe food starts with a sample of wine and an excellent salad and bread fresh from the oven, I had the Fettucini Alfredo with a meatball and it was just fantastic! The wife had the Fettucini Alfredo with Chicken Lemon and Artichoke which was delectable!\n\nOur service was prompt (we came at 4:30pm on a Wednesday) and our server was friendly, sociable, and helpful! \n\nGood Job RigaTony's!!!","useful":3,"funny":1,"cool":2},
{"review_id":"VDYBUAjbKBXSMuZaKG6hnA","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"3aKmNE2coy5YLBCIu676og","stars":5,"date":"2015-03-07","text":"Went here before catching a performance at GCU. Fabulous. There is one lady working staff so it is a nice place to sit and talk for a bit. The Jerk Chicken was fantastic, just spicy enough to break out in a light sweat but very delicious. The ladies had the Jerk Chicken Salad which they enjoyed as well. I will be returning and sampling more of the selections from the menu! P.S. The fried plantain is to die for!","useful":0,"funny":0,"cool":0},
{"review_id":"9FP9DKjx-aTsmpizOuKcGg","user_id":"dSnAEzrSgONh_NC9rUJusQ","business_id":"AZQKMMvX9m1-uTdLPMzK3g","stars":5,"date":"2014-05-27","text":"Good selection of beverages, and a damn good happy hour menu too! I enjoy the food a lot and the staff is always friendly, accommodating, and helpful!","useful":0,"funny":0,"cool":0},
{"review_id":"woj6bAeIMVB6nCrx77rCMA","user_id":"nv9oPbSS6CV54TfvMCsaZA","business_id":"eAc9Vd6loOgRQolMXQt6FA","stars":5,"date":"2015-03-25","text":"First time to Vegas and we were very satisfied with our decision to stay at Mandalay Bay. Upgraded strip view upon arrival. The room was really nice and housecleaning comes daily. She found my missing earring twice! They have good restaurants, bars, lounges, and i won $700 in the casino. Besides exploring other casinos etc, we hardly had to leave our hotel because there is so much to do. We will always choose Mandalay in future visits and cannot wait to return!","useful":0,"funny":0,"cool":0},
{"review_id":"xHBG4kUveYdk7H1WFICTvA","user_id":"sTfvB7j5bIf_6NFj8MpEYw","business_id":"YzqV61exMv__mjobBV2g7g","stars":4,"date":"2009-01-13","text":"First visit to Thai Cuisine (interesting name, no?) and first visit to Pittsburgh, so that should set up this review nicely. Context is, of course, that I expected very little from this town, yet I've been completely surprised. #1 - faux meat on a menu is a huge plus for me, I just love it, and I don't care to hear comments like \"if you are a vegetarian, why would you eat something that is meant to taste and look like meat?\" Shut up. I just like it. #2 - the prices are so cheap. I only looked at the vegetarian menu where every entree is about $10 for dinner, and while that's no steal nor does it compare to Thai food prices in Thailand, it's decent. #3 - cutest. waitress. ever. AND she mentioned that \"all of my cool friends have read that book\" which, by default, makes me a cool kid? Hmmm. Maybe. Then again, maybe not.","useful":2,"funny":0,"cool":2},
{"review_id":"DH5CJihfH-c2MujsQX7B8A","user_id":"sTfvB7j5bIf_6NFj8MpEYw","business_id":"5FIOXmUE3qMviX9GafGH-Q","stars":4,"date":"2008-07-29","text":"Just at there for the second time today, and decided to use my (overpriced) iPhone for some pictures - which I will add shortly. I really love this place, because they offer so many options, from pizza to noodles to salads. \n\nFirst time I ate here, maybe a month ago, I got the Apricot Miso dish with mock chicken, and it was very good. Today I had the Spicy Peanut Sauce with Tofu appetizer and I had to restrain myself from licking the plate, the sauce is THAT good! The Coconut Curry with mock beef served over noodles was next, and honestly, it was just ok. I prefer the mock chicken texture\/flavor. The curry was spicy but there wasn't enough of it in my dish - it was very dry.\n\nBut my favorite part of this place? The bathroom sink. It's totally cool, you just have to see it. Sorry, I didn't snap a photo in the bathroom for fear of being a total weirdo.","useful":1,"funny":0,"cool":0},
{"review_id":"lffbH4UycOQT52zSHSjYGA","user_id":"sTfvB7j5bIf_6NFj8MpEYw","business_id":"wzfQBvE_VAApYqvi_Zrt4g","stars":4,"date":"2008-07-30","text":"A great go-to option when in Scottsdale, if you want Italian. Everything on the menu is fresh and, as much as possible, local. I travel solo all of the time and I prefer Kimpton Hotels because they tend to have REAL restaurants in them, not hotel restaurants.\n\nThe ambiance is great and everyone is friendly (esp when you stay here in summer and the place is empty). But let's talk about the food......\n\nOn my first visit here a few months ago, I had the margherita pizza and the rucola salad. Either I was starving or it really was the best pizza I'd had in a long time. On my second trip here, I got the butternut squash ravioli in brown butter with fried sage - melt in your mouth pasta. It's made in house and it puts all dried pasta in my cupboard to shame.\n\nThis trip, I ate at Taggia twice because I am just too damn lazy to look for other places to eat when I have this place just across the pool. I returned to the margherita pizza again after starting with the asparagi antipasti. Both were delightful, but I wasn't the biggest fan of the trevigiana cheese in the asparagi dish, so now I know. The pizza wasn't quite as insanely delicious as it was the first time, but I still really enjoyed it. Great crust and great sauce.\n\nIn the spirit of being repetitive, I ordered the butternut squash ravioli again and started with the two gazpachos - on one side of the bowl, a summer melon gazpacho, and the other side, a tomato gazpacho. Both were fully pureed (no chunks of anything) and good; however, there was too much sugar in both. Still, I cleaned my plate, because under the sugar (or was it too much salt? something was too much) the fresh flavors popped.\n\nI'll be back. In like 2 weeks. I promise to try something different!","useful":1,"funny":0,"cool":0},
{"review_id":"9HcLjP8P_8ttfwMeQodd8g","user_id":"sTfvB7j5bIf_6NFj8MpEYw","business_id":"4cDWyZa6EqsY4XSWwLY7RA","stars":4,"date":"2008-03-27","text":"had dinner there - ordered the international sampler and thought it was good but i wish i just ordered one thing. i didn't love the hummus so much, but the italian (lasagna?) was quite delicious! i noticed on the smoothie\/juice menu that you can add honey or bee pollen, which isn't vegan. ok ok, i'm not vegan either, but i used to be and the mixed messages bother me! :) that said, it was good and probably the healthiest option in this crazy town of all you can eat fattening buffets.","useful":1,"funny":0,"cool":0},
{"review_id":"QqrYeEwhgCoHOHyxJh54yw","user_id":"sTfvB7j5bIf_6NFj8MpEYw","business_id":"6Pk9PJOD7EWd1tv3lk0ajA","stars":4,"date":"2008-07-24","text":"I have stayed here about 6 or 7 times now over the past year, and I love it. The first time, I totally got lost trying to find my room so if it's your first time, take the map :) it was late for me and sometimes I can be super-clueless.\n\nAt the check-in desk, they offer fireballs, which is awesome! The lounge is gorgeous and the pools\/poolside area? No competition. Happy hour of complimentary wine and beer from 5p-6p? Just what I need. I agree with a few fellow yelpers about the rooms - they seem a bit dated but I'm not a huge fan of the southwestern style. Still, very comfortable beds and pillows, and the robes are a bonus. Everyone is super friendly too. Taggia ROCKS. I've had the margherita pizza and the butternut squash ravioli - both great.\n\nI'll be back next week and I can't wait! I took a photo of the pool area and it's my desktop background. I dream of this place.","useful":2,"funny":2,"cool":2},
{"review_id":"pZtmzz4mhcy4S69QZie59g","user_id":"CE_3VTtuDOnfc4w6AafmwA","business_id":"JQmL65YrNVUmptU44SKLLA","stars":5,"date":"2008-11-03","text":"the grand canyon experience is my favorite place on the strip. why? because it isn't insanely expensive! in this city where you can bring beers with you anywhere, from anywhere, why not pay cheap prices for beer, and load up a back pack full of cheap beer to bring around with you wherever you go!\n\ni love this place!","useful":0,"funny":0,"cool":2},
{"review_id":"2xlM9f4qIfq1wxWFwWzNJA","user_id":"g7fUKo7yz-MBx-nzueJ80A","business_id":"X1za2NGiRInATrNnpRKLyA","stars":5,"date":"2017-07-25","text":"I just recently changed nail salons and boy am I glad I did! This place is awesome!!! Nini did my nails and she is AMAZING!!!! It's definitely worth the drive!","useful":0,"funny":0,"cool":0},
{"review_id":"GYVHKI6pHQJixgVPgA9wQg","user_id":"g7fUKo7yz-MBx-nzueJ80A","business_id":"jvFZDAtoQo31Y-vgO6bepA","stars":5,"date":"2017-09-19","text":"Yesterday I went to another shoe repair shop in the area bc Dean's was closed. The hardware on my purse would squeak every time the shoulder strap would move. They were afraid to attempt to fix it bc it was an expensive purse and he didn't want to possibly damage it. Although I appreciated his honesty, at that point, I didn't want him to touch my bag anyway If he was that uncertain in his own work. Fast forward to today...I went to Dean's, and without hesitation and uncertainty, he fixed it in less than 2 minutes! NO MORE SQUEAKS!!! He's the best and definitely knows his stuff!","useful":0,"funny":0,"cool":0},
{"review_id":"QH-yqNF_pOAD_TgDK7hwAA","user_id":"g7fUKo7yz-MBx-nzueJ80A","business_id":"eG4yXKPJRFDzkRWqyVUALg","stars":5,"date":"2017-07-22","text":"South Tryon \/ Whitehall is the best T-Mobile location I've been to. ALL of the representatives at this store are very knowledgeable, efficient and courteous...but the superstar is Micky!!!! He and Shenica are awesome!!!","useful":0,"funny":0,"cool":0},
{"review_id":"2gehGGas_MLNpXMu52mg7Q","user_id":"A5siLgWdMHpHjD8tbVzd8g","business_id":"oZUwUMRnz0hUpzmg0G7kLA","stars":2,"date":"2011-10-19","text":"Have been to Cantina Mexicana once. Enjoyed the food, very tasty. For the Kids meals, tacos were on the menu, Beef was chosen, but it was just ground beef, and runny at that. Chicken Mole was terriffic.\n\nOn our second visit, the rest was a little busier, although not full. We are a family of 5 (3 kids) and although there was enough room to seat us, and tables near each other the hsotess would not allow us to sit, and said we would have to wait 1\/2 hour untill another table of 5 were done. i offered to move and configure the tables myself, but was told \"NO\", there would be no room for me (hostess) to serve. Well, if they dont want my money, I'm sure someone else does!!!","useful":2,"funny":0,"cool":0},
{"review_id":"VETXTwMw6qxzOVDlXfe6Tg","user_id":"ymlnR8UeFvB4FZL56tCZsA","business_id":"--9e1ONYQuAa-CB_Rrw7Tw","stars":5,"date":"2017-02-14","text":"went for dinner tonight. Amazing my husband had lobster bisque and the T bone both were delish.I had the French onion soup and the pan seared duck. Cooked to perfection and I'm still raving about the flavor. If you are ever in Vegas this is a must try.","useful":0,"funny":0,"cool":0},
{"review_id":"kxZffovPVXarHgnZfbeuTw","user_id":"n2SqnnQO7hQzzGuXucerAA","business_id":"nzaquapFlE_67JIBdxV_ZQ","stars":4,"date":"2014-09-30","text":"The staff at the National Car Rental Charlotte International Airport location are friendly and helpful, particularly the shuttle drivers.  I always try to ensure I have adequate cash on hand to provide them with a tip as they consistently load\/unload my suitcase on the shuttle bus.  The pick up and drop off are efficient, I'm often dropping off in the early hours of the a.m. and the ease of the return makes the morning start off smoothly.  \nI would agree that the vehicles always seem to have dirty windshields, particularly on the inside.  That's not always something you see immediately when selecting a vehicle.  Please take more time to ensure the windshields are clean, inside and out and I'll be able to provide a higher rating.","useful":1,"funny":0,"cool":0},
{"review_id":"DC93v8eT01IOyX_M6pttpA","user_id":"n2SqnnQO7hQzzGuXucerAA","business_id":"Z0yBs-eGWJGFlGLJZzlCrg","stars":5,"date":"2016-06-01","text":"We recently leased our fifth BMW with Hendrick BMW on Independence Boulevard in Charlotte, NC.   Our sales person was Michael Dickerson who had been referred to us by our wonderful Hendrick BMW service manager Saad Mubarak.  We have consistently received superior service and attention in our years working with Hendrick BMW.   Our newest vehicle, a 2016 X1 is one of the best designed BMWs we have had so far.   Saad, Michael and the other staff members at Hendrick are supportive and are willing to take time to ensure we have a positive experience during the purchase process and service appointments.  I appreciate the commitment to customer service the Hendrick company exhibits including the quality of personnel they employ.  Thank you, Michael and Saad for your consideration and dedication to us as your customers, that is a large part of the reason we continue to return to Hendrick BMW.  Quality vehicles but as important caring and professional Hendrick team members.","useful":0,"funny":0,"cool":0},
{"review_id":"MKGr3aJaA0pePK_7_fDNjQ","user_id":"RgTxBRuvdKG9HqmSWOGYUg","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":1,"date":"2015-11-06","text":"You should be able to give this place negative stars!  What a terrible mismanaged establishment.  We arrived at 8:30and were seated promptly but did not receive our meal until after 10:00pm.  Apparently an 8 oz, well done burger takes awhile to cook.  This is what the waitress told us and then we were told by a manager they had a \"small\" kitchen problem. Upon receiving our meal half the orders had been sitting under the heat lamp so long they felt like they had been prepared yesterday.  We received some replacement \"chips\" for our Fish N' Chips which were warm but completely uncooked in the center.  The staff offered little assistance and was completely absent.  Seemed like they knew a situation was occurring but neglected to inform our party of 8 or even try to come by our section.  I will never be back here to dine.","useful":0,"funny":0,"cool":0},
{"review_id":"r0Bh892r55KszXLr0wXy5g","user_id":"hnPbtBPb-n0XlUulc-PJnA","business_id":"T5iVkzBXvG5cG6de_TMquw","stars":4,"date":"2011-09-06","text":"XLNT Food Fast Delivery always Tasty","useful":0,"funny":0,"cool":0},
{"review_id":"OHQ6_dPDNQM8-dq1UtyKIQ","user_id":"hnPbtBPb-n0XlUulc-PJnA","business_id":"bRR4gsjHv0F_RnRGjQBqlg","stars":5,"date":"2013-01-28","text":"Creamy Custard Outstanding Italian Ice what a COOL place on a hot summer day","useful":1,"funny":0,"cool":0},
{"review_id":"W4QSftF9cOlqKH_NZYu3oQ","user_id":"hnPbtBPb-n0XlUulc-PJnA","business_id":"1UmZSifNBsygSWzbfKiAew","stars":1,"date":"2011-09-02","text":"NO Taste,  NO Flavor, unacceptable imitation of Italian Food. Noodles were not cooked correctly Sauce is without spice. I would not recommend this eatery to anyone! In The ad it says there is waiter service this is not true you do serve yourself.","useful":2,"funny":1,"cool":0},
{"review_id":"kn-SxLzhDov3vUvA5itZJg","user_id":"nkoomz1RWdLiY_mK6vf_-A","business_id":"SuRxV4YkPsvyyqK57On0rQ","stars":3,"date":"2013-05-10","text":"I thought my meal was tasty.  But, it was french toast, so you can't really fuck that up. It's almost impossible.  \n\nMy companion said she didn't enjoy what she ordered.\n\nThey were also out of many things because they aren't \"seasonal.\"  \n\nThe wait was horrendous.  Definitely don't visit if you want to get in\/out w\/in an hour, because you'll be waiting that hour just to get your food.","useful":2,"funny":0,"cool":0},
{"review_id":"vdD9SuRqChJ3zCDiNZ09QA","user_id":"MUlbdEmGrTcPA3UvKKhNgw","business_id":"3XVAfJQdX327pqNZg5KV5g","stars":1,"date":"2013-08-11","text":"The food here is decent, however they have a completely false menu on their website which does not report the prices which they actually charge. They charged me more than double the price on their site, and I paid thinking I had misunderstood what I read. I checked when I got back home, but there was no mistaking it - they charged more than $20 for something which is only $9 on the menu. I have tried repeatedly to contact them, but they are unresponsive - and the menu has yet to change. So not only have they not fixed the mistake, but they aren't making good on it either. I used to be excited to bring people there, but never again. At least not until they make good on this issue - if they do, I will update this review.","useful":1,"funny":0,"cool":0},
{"review_id":"SkHa6bB67S62Lblev31Ixg","user_id":"MUlbdEmGrTcPA3UvKKhNgw","business_id":"PjZ6bHhUDjJuL-XPOPv3Yg","stars":5,"date":"2014-12-31","text":"I met Karen over a year ago, and in that year I've experience a massive shift in my lifestyle - everything is better as a result of the work we have done together!\n\nWhen we first met I was a hunched-over desk jockey with barely any muscle to my pudgy frame. I was never the type to go to the gym, feeling that it was a foreign place full of injury-inducing heavy things that I didn't know how to manipulate. I had headaches from the persistent neck pain that stemmed from my terrible posture, and I had terrible upper body mobility. I found her via BlogTO, and she sounded like she could provide the kind of help I needed. I don't think I could have found a better match!\n\nAfter developing a mobility program to address my issues, we gradually got into more complex weightlifting movements. Karen has a focus on quality of movement and proper form over quantity\/weight, and her approach was exactly what I needed in order to get over my gym-anxiety! Soon enough I was enjoying going to the gym, and now I can do all kinds of things that I never thought I'd be doing (let alone looking forward to doing - deadlifts, squats, etc!) \n\nBuilding up my strength and trimming my body fat had a tonne of great benefits, from feeling better about myself to just plain feeling better. I'm far more confident with my strength and looks, and the strain- and posture-related issues I had have all but gone away. And the best part about it is that now I can safely say that I've been armed with a tremendous arsenal of strength training strategies that, with ongoing maintenance, should serve me well for the rest of my life! Give her a call, work with her, listen to what she says, and there's little reason to think you won't have the same kind of success :)","useful":3,"funny":0,"cool":0},
{"review_id":"ZR9jwA_3xmc77kJ3fuDLYg","user_id":"MUlbdEmGrTcPA3UvKKhNgw","business_id":"e59uNE07Gf-yrIl4rX3KZw","stars":4,"date":"2015-01-29","text":"The food might be organic (and it's really, really tasty) but they really have to do something about the smell of the new furniture\/finishes. It's bad - incredibly bad. I had to wait about 10 minutes for a table last week and decided to wait outside, in the freezing cold, rather than continue to breathe in whatever it was. It's off-gassing something terrible.\n\nOtherwise, I had the elk burger and it was delicious. The fries were OK, the onion rings were pretty good, and the fried chicken was quite tasty. But there's no way I'm going back until all of the off-gassing is done.","useful":2,"funny":0,"cool":0},
{"review_id":"CcE4M_2LHWpjsaNmpLDdIw","user_id":"MUlbdEmGrTcPA3UvKKhNgw","business_id":"Zkw7LIIKJWHsdxkqU5VwXQ","stars":2,"date":"2017-05-22","text":"I was really excited when I saw that Ka Chi was opening up in the neighbourhood! It's definitely a type of food that is lacking in the area, and I used to love the one in the Annex \/ Christie Pits area. It was a long wait and I went as soon as I could.\n\nThat being said, this place is kind of a let down. The interior decor is sort of nice, but there are WAY too many TVs. They are everywhere - you'd think it's a sports bar. \n\nThe food is way better than the Dundas Ka Chi, but considering the price it's a big letdown compared to the old Annex spot. Simple Bi Bim Bap (with Bulgogi) was $18... and all you get with it is a tiny bit of pickled daikon and kimchi - none of the other little bowls of food you'd typically get (soy beans, glass noodles, etc). So, they're charging you way more than other spots (every other one charges $10.95 for the same) and giving you a lot less. The Annex Ka Chi used to give you a pitcher of tea, I hate to think what I'll get for the same price at this location.\n\nHonestly, this place feels like a moneygrab. I'll probably go back begrudgingly because it's the only spot nearby, but it would cost less to take transit to one of the cheaper locations. If they drop their prices by the 30% they ought to, I'll happily revise my rating and probably take a lot of friends and visitors there. As it stands now, no way.\n\nKa Chi - next time buy fewer TVs and keep your prices in line.","useful":1,"funny":1,"cool":0},
{"review_id":"U2QPHjgPDk1WZqDWO8AncQ","user_id":"MUlbdEmGrTcPA3UvKKhNgw","business_id":"29zc-Uw40X7LnH8jBMSWuw","stars":1,"date":"2013-11-27","text":"I would typically defend these guys, but I'm fed up. They have a sign stating they are open until 7pm, and because they're my neighbourhood butcher I try to give them all of my business - but it's getting impossible, because they never close at the posted time. Tonight, for example, they locked the doors around 6:30. Extremely unreliable, and very annoying.\n\nWhich might be OK if the quality was amazing, but it's only just passable. As others mentioned, it's so-so. And the service is barely passable on a really good day.\n\nThen there's the quality control. In the past we have gotten bone fragments in our ground beef, which rendered a pot of chili and a batch of burgers inedible. On another occasion, I got home and there was a cigarette between two chicken breasts that I bought. \n\nAs others have said - you get what you pay for...","useful":1,"funny":0,"cool":0},
{"review_id":"PDRp4J7BsZMeSfAeJLa1RA","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"hdQK1rfLEjwRlCppLFo10g","stars":4,"date":"2015-05-07","text":"Have to say: this is the BEST most authentic Indian food I've ever had! Both in Toronto and Calgary!\nI ordered mixed vegetable curry to go. Decent price.","useful":1,"funny":1,"cool":0},
{"review_id":"MpIWs6Tz9fBtJU9imia-lQ","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"XD0LjNuPPwJPsTAHecUh7A","stars":4,"date":"2014-06-27","text":"GREAT atmosphere! You will fall in love with this place before ordering any food! \nThe service is amazing as well! (Except in the end, we have to ask three different servers to get the bill)\nThe three of us ordered appetizer, salad, seafood pasta and pizza. To be honest, I had better pizza and pasta in other Italian restaurants, but the calamari appetizer is pretty great!","useful":1,"funny":0,"cool":0},
{"review_id":"lyaIftzMF2c3l-XXje3AqA","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"LKzDrKa0FRrRATi1gqPEiw","stars":4,"date":"2015-05-07","text":"Really nice atmosphere; Busy but great service.\nI ordered the tuna salad as recommended on yelp. But I don't really into that, but it's a healthy choice and the new source is amazing","useful":1,"funny":0,"cool":0},
{"review_id":"WmSwqB6kMYW1iuDxAH8TYA","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"D87tFO-R6U8f4-e0r4Zq_g","stars":3,"date":"2015-06-04","text":"It's a cute place.\nBut frankly the crepes are only ok... (There are better ones...much better ones)\nThe waitress was really nice though!","useful":0,"funny":0,"cool":0},
{"review_id":"ILzVIJz9ue0RFerm6T8roQ","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"wVc3g-YfyDvkOLDecpr4DA","stars":3,"date":"2014-06-07","text":"Well, I have to admit the food here is pretty great. We had the recommended ribs and pasta tonight. They were good. So did the avocado thingie. However, the cocktails were disappointing. They didn't taste good and were expensive","useful":0,"funny":0,"cool":0},
{"review_id":"b9TwXt8WQC9fmsQHZnOx8w","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"JOoblYsQjFT-47tkt6om0A","stars":4,"date":"2015-02-07","text":"Went here yesterday around 3pm for drinks. Well, the wine and margarita were all right~ the impressive dish has to be Nachos~it has to be the most healthy Nachos I've ever had LOL It took around 25mins, but it was good! Not oily at all! As a cheese-stretcher, I was happy","useful":0,"funny":0,"cool":0},
{"review_id":"_BuuIK3oXt9YYp7ISJtSrw","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"B9pMUND3peh4fFtGmqA4LA","stars":4,"date":"2014-06-27","text":"I just want to say that the pizza and pasta here are AMAZING!\nThe cocktails are okay, so does the service.","useful":3,"funny":0,"cool":0},
{"review_id":"q2-uW10bF1B4kaieRIacgA","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"0cpLF0LFQHHRFNlL0iy_Aw","stars":4,"date":"2014-05-31","text":"I went there last night with friends, as a party of three. I have to say that was a great experience in Union Social. We ordered the recommended steak, and wow! That was amazing! The candy salad was okay, not a must-have. But both the tuna slider(forgot the name, but it's an appetizer) and chicken quizonnal(don't know how to spell, but it's also an appetizer, with smoke chicken and cheese blended, and baked in a triangle shape)  are worth trying! In terms of drinks, I would say it's okay, but I had better ones. Then, we ordered Nachos with extra cheese and edamame. Both are GREAT! I especially love the Nachos(when it's hot--crispy and the melted cheese...)\nAnyway, a nice place. And a thank-you to our wonderful waitress--Rachel!","useful":0,"funny":2,"cool":0},
{"review_id":"nE-bQn_x39AyEOKy4UisuA","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"GLTLuTgZ8Pn5j4-aw2GCPQ","stars":4,"date":"2014-06-01","text":"Pretty good place. Love the salad! Went there too early today around 5:20. We were the only one sat upstairs. The downside is the window can't be open. Service is good as well. Worth to try!","useful":0,"funny":0,"cool":0},
{"review_id":"8QxScMZnJsg5fPfvd4Xt9Q","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"sCPNcNxYuTnTdlAZohMyQg","stars":4,"date":"2015-06-04","text":"They have the BEST, I mean the BEST Nachos EVER!!\nI love nachos especially the cheesy ones!! Here, the Nachos you order has only 8 pieces, BUT covered with melted cheese, guacamole and I think red bean paste!! AMAZING!\nThe salad we ordered was the third on the menu which is also GREAT (don't need extra dressing)","useful":0,"funny":0,"cool":0},
{"review_id":"QNJEMrqLf9NcPcof7QmOGg","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"LBHbyID7tcaGszznHtnCrw","stars":4,"date":"2014-12-14","text":"I think everyone has walked passed Joey before~ so I went here for lunch. Well, the environment is great, but the food is okay--not as good as I thought (already lost pics of the food and drinks we ordered)","useful":0,"funny":0,"cool":0},
{"review_id":"sQ20jQeEYBtm2AcbAgYbuQ","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"xaqW4NkmUCGRRjmLxiFJ6Q","stars":5,"date":"2015-07-18","text":"I have to say they have the BEST crepe EVER!! \nI ordered the Santa crepe;and my friend ordered the strawberry banana crepe. Both were AMAZING!!\nI was so full but kept eating\nThey always have the freshly squeezed juice!\nBTW, the staff are GREAT","useful":1,"funny":0,"cool":0},
{"review_id":"LdFvk9zDQG4_H5Yx-b6yqg","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"m-cg3stOStMAFEV9-8qnVw","stars":4,"date":"2014-11-15","text":"The first time I came here was 8 in the morning for Liverpool!\nThen, I came back yesterday for my friend's birthday~ they don't have a drink menu, but they can make ANYTHING you want~ We had a good time~ a lot of beers and shots!","useful":0,"funny":1,"cool":1},
{"review_id":"esjPTuErazLVQ_bBrTkR1g","user_id":"hDLtYgrYJAI-FAe4rTO_oQ","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":5,"date":"2014-12-14","text":"I have heard and read about this place so many times! And I called to make reservation once, well I have been told that they don't accept reservations (considering how popular this place is!) luckily, we came here around 5:30 on the Friday night, without waiting, we were seated. We ordered three different kinds of curry and the crispy rice salad~ I have to say my friends are right! They make the BEST Thai food!!","useful":0,"funny":0,"cool":0},
{"review_id":"xqm-4DUA2xxI-vG05iOMJg","user_id":"NzupvAZont2vgwUpg20qmg","business_id":"ZDE5QPR5Q9sL50bhK3qv1A","stars":2,"date":"2017-12-03","text":"Sides were good. Pickle had crunch and flavor. Tea was good. Place was clean. Music not too loud.\n\nSandwiches were not very impressive. On par with subway, so way overpriced for the lack of quality.","useful":0,"funny":0,"cool":0},
{"review_id":"k5O_cju6ltQw-AJ0cOcmVQ","user_id":"79Wy5uBAFXUplKq-rxfuFA","business_id":"3tJA6wUCG1nerLOH8EIcQw","stars":1,"date":"2014-01-02","text":"I came in for a pedicure with shellac on my feet. Right off the bat, the girl started ripping the shellac off with a cuticle cutter and filing down my nails with an electric filer making my nails bumpy and uneven. She continued with scrubbing my heels and I had to ask her to redo it 3 times because my feet were still extremely dry. (I still left with dry cracked heels.) she didn't file my nails correctly and they were bumpy and uneven. She went on to paint my toenails. As she was putting on the base coat she was getting it all over my feet and went on to paint my toenails and got it all over my cuticles. I asked her to fix where it was on my cuticles and she said she will clean it up later. After she finished painting them, she cleaner them up and they still looked horrible so I asked her to re do it. Again, she is rushing through it and gets the base coat all over my feet and cuticles and slaps more polish on and it still looks horrendous. She told me that that's how that color is.. So i asked if another girl can apply the polish on my nails. The other girl said that my nails were bumpy and I told her it was because the other girl had ripped off the shellac off my toenails and filed them like that. She applied polish on 2 nails and the job was already so messed up that I decided I didn't want any color and just asked her to file the tops more evenly. She did but they still looked horrible and I left with pinkish bumpy nails and dry heels. And they made me pay on top of all of this. Definitely the worst pedicure I have ever received and am never going back there again.","useful":1,"funny":0,"cool":0},
{"review_id":"5Tbmuu85Eiwxv-GZplLTow","user_id":"-_tS28rEYebaQ6ax34_uEQ","business_id":"Qj_8UgVzzBmClhQY-IFYQA","stars":5,"date":"2012-10-10","text":"Wonderful hostel. My sister and I stayed here for four nights. It's clean and comfortable. The staff are so lovely and helpful. Carl is the best! Highly recommend that you rest your weary travel legs in Le Gite du Plateau Mont-Royal!","useful":0,"funny":0,"cool":0},
{"review_id":"gu2vpSYu4QfTwrQVCjKOBw","user_id":"BpLc7kO0gGMyHVCx9CE3rA","business_id":"WQpIvFQoCfjye_z6j2uSYQ","stars":5,"date":"2017-06-13","text":"I was having pain and soreness in my hip due to sitting at a desk too much. It had been going on for well over a year before I started seeing Kim Kelley at Jefferson Therapy. After a few sessions and a couple months of exercises and stretches at home, my hip has loosened up dramatically and no longer hurts periodically. Great experience!","useful":0,"funny":0,"cool":1},
{"review_id":"xvJD-wW1e9uLVCUHmi3UTA","user_id":"sWRLjEMbH2WPSGd0_s95Dg","business_id":"9X-Z0IH4hxmVA6AzKQ3pEg","stars":5,"date":"2013-06-20","text":"A fantastic soup and sandwich place!  Craig, the owner, greeted us as we walked in with a sample of fried green tomatoes - awesome - probably testing for a future special.  I ordered the capresi panini and my friend had the jerk tuna salad, and both were outstanding.  I had clam chowder that was so rich and flavorful that my spoon could practically stand up in it. My friend loved the black bean soup.\n\nThe owner brought us a sample of a butternut jalapeo soup that was as good as the other two, and we talked to him about how he came to have the restaurant.  He lives next door and used to have such a great time entertaining friends with soup and same dick parties that when his \"real job\" pharmaceuticals had a layoff, he created a new career doing what he loves - and it shows!\n\nGo to Subway around the corner if you want bland and predictable.  Go to Karma if you want great taste that will surprise and delight you for about the same price.  I highly recommend this great independent shop!","useful":0,"funny":0,"cool":0},
{"review_id":"k9Y6o7E30P0-cCkgxrIqfg","user_id":"5UWRKSSInyVkJHVn-GfFcg","business_id":"uzsMilozioxCenzyXbVMmw","stars":1,"date":"2013-10-19","text":"I wish that I could take all the stars ever given to this restaurant away. We just spent 2 hours waiting for our food only to have our server say that they lost our order. 2 HOURS! Drew came out and wished that he could make it better, but had no solution. I will try it again if they decide to actually bring me my food this time.","useful":1,"funny":0,"cool":0},
{"review_id":"exMUmkC8KtC-J7KT4Ktv0Q","user_id":"5UWRKSSInyVkJHVn-GfFcg","business_id":"nWW6fBfBljiRFa4sG7TyxA","stars":5,"date":"2014-02-24","text":"Cool atmosphere. Smells delicious. We had reservations at 8:15pm and weren't seated until 8:30pm - most restaurants would just shrug this off, but chef\/owner Michael Nowak personally came out and greeted us and then comped our table the braised rabbit app (which melted in our mouths! so delicious) Great customer service and attention to detail. Our server (Leonor G) was amazing! The perfect balance between making sure everything was perfect, without hovering. The kind of service you might expect from a white linen, fine china type of establishment. We also had the gravy frites (poutine for those north of the border). Highly recommended. The beet root salad was light and refreshing. Tasted like it was freshly picked that day. The braised short rib could not have been more tender and juicy. We normally try a restaurant we haven't been to before when we go out, but The Black Pig left us wanting for more. We will definitely be back soon!","useful":0,"funny":0,"cool":0},
{"review_id":"NShcYE75X5lYR_MlwShVLA","user_id":"CXG39_iPxFjwQqKNQuLibA","business_id":"VRC7J-ahI4em9ddhihxq5w","stars":1,"date":"2010-01-08","text":"Just had their chicken special today -- chicken caprese.  It was served RAW.  I had one bite and took a look and almost fainted.  They made me a new one, however, I didn't have the stomach to eat.  Still charged me $15.95 for the raw chicken dish.  They did throw in a free dessert to go which I did not want.  Hope I pull thru.  Won't be back that is for sure.","useful":2,"funny":1,"cool":0},
{"review_id":"XhsF44KngjKwGeCpwzTmbQ","user_id":"5ZDPJ6ywchWdWcOUJfNZlQ","business_id":"RC7lOpPRVOcAq7tijy7Dwg","stars":5,"date":"2015-11-02","text":"Being from Illinois and in town to attend a Steelers game we needed beer.  Found out grocery stores only sell basically a 12 pack per person\/visit. Nothing like Illinois where the sky's the limit. So after that education we ended up here.  Good selection of beer when you need more quantities that 2 six packs.  We stocked up on IC light and was reasonably priced.  Friendly service.  Only con is parking is scarce but that seems to be par for the course in Pittsburgh.  I would visit again if in the area.","useful":1,"funny":0,"cool":0},
{"review_id":"7UTQk3f1J9w9a4dsIt-RuQ","user_id":"5ZDPJ6ywchWdWcOUJfNZlQ","business_id":"ReFz1RaR94UkpFTOinK-fA","stars":4,"date":"2015-11-07","text":"Stayed here last weekend while in town for the Steelers game and was pleased with the room and helpful staff.\nSuite was nice and spacious with 2 beds and a couch that doubled as a bed.  I like the idea of having the shower and toilet in separate rooms with them both having their own sink.  Nice size closet with ironing board and iron provided. Mini fridge and microwave were also on site.  Nice selection at the complimentary breakfast with plenty of helpings. Shopping within walking distance. Only con was the $16\/day parking which may be on par for the area? Overall very pleased and would stay here again .","useful":0,"funny":0,"cool":0},
{"review_id":"oFq-35tik8YqJxHVv1I4rg","user_id":"g4_bM240cKocAh0QYXpaRQ","business_id":"dkH_OxM2YZwmq9GziW28rQ","stars":2,"date":"2010-04-07","text":"Meh. I've experienced MUCH better. I'm originally from Toronto but moved to Montreal about 7 years ago. Well, two weeks ago I finally came back home for good. It was good to see certain stores still around and Le Richie was one of them. After spending a few minutes in the store I soon realised why I didn't like it 7 years ago!! Staff wasn't the greatest, one older lady there (owner I would assume) and she had a serious attitude problem... I was made to feel like I didn't know what I was talking about... but i've been a metal head since i'm 15 ( now 46). Someone else made things right while I was there, but this this is the last time I stop in there. Other places will get a crack at my money first...","useful":2,"funny":0,"cool":0},
{"review_id":"vdzHw-WioHAsl2z-ZvCuXw","user_id":"F5Dd5qovg3uIE1WlfkIpmQ","business_id":"WX7mCPdD97AbeG_LAwQOyQ","stars":5,"date":"2017-06-05","text":"The Ford Maverick is absolutely great to travel around when you are two people - we really enjoyed that.\nThe people at Las Vegas are very nice and easygoing. Great value for money. No issues with the van itself, traveled over 3000 mi without any problems. We would definitely pick them again the next time.\nThanks for everything!","useful":0,"funny":0,"cool":0},
{"review_id":"Ky5N_6MIvKbT4YZg8tXjTg","user_id":"hH2kvBr9_eMUxrWzpGupgQ","business_id":"mlCDsdVFuZvRGrJTfQ6amw","stars":5,"date":"2016-09-29","text":"Hands down one of the best places I have ate at in a very long time. Food was beyond amazing. Would drive from anywhere in the world for one of there sandwiches. People there were extremely nice and extremely helpful with choosing what to get.","useful":0,"funny":0,"cool":0},
{"review_id":"o3xds1G2-BOnnvitM_wCxw","user_id":"hH2kvBr9_eMUxrWzpGupgQ","business_id":"9rqcx3TaIo6Tkacr81JlYw","stars":1,"date":"2017-04-03","text":"WILL NEVER DINE AGAIN. My girlfriend and I had eaten there this evening. Within an hour of consuming they're food have not been able to quit puking. The sushi they had given us was warm. Worst experience, and the people working there seemed to have about careless of our experience.","useful":4,"funny":0,"cool":1},
{"review_id":"SwywRUoHOBrj33yoojikpA","user_id":"hH2kvBr9_eMUxrWzpGupgQ","business_id":"zRN6HzfkPS1REtGiZ60Pvg","stars":5,"date":"2016-07-25","text":"Amazing place. Was hesitant at first, but very happy I tried it. Great hospitality, great food. Would recommend to a friend.","useful":1,"funny":0,"cool":0},
{"review_id":"W5MZQ-jqDARYLytdh0YCrQ","user_id":"GP0AT6ZYB3zF6hK8AZjcjw","business_id":"PikCbVha3p7b34JeCn1mcg","stars":5,"date":"2012-08-04","text":"I had been noticing a burning odor whenever my AC turned on and needed to find the problem. Ace Air and George Brazil came out to troubleshoot and - surprise - both companies told me I should replace my entire AC unit. I was told totally different reasons from each one but they both stressed that I needed to replace the unit right away.  I was given quotes from $5,500 to $7,800.\nMy gut told me different. I saw that Definitive Air had 4-5 star ratings on many consumer sites so I gave them a call. I am glad I did. Mike came out right away and diagnosed my problem as a bad capacitor on the evap blower. 30 minutes and $128.00 later everything was fixed.\nThanks, Mike, for saving me thousands of dollars! Definitive Air is my HVAC company now.","useful":0,"funny":0,"cool":0},
{"review_id":"-d-rwllhEyq3Rc_12MzuOw","user_id":"GP0AT6ZYB3zF6hK8AZjcjw","business_id":"O4hJF5ULSOFzAV0bXhKTOg","stars":5,"date":"2017-09-25","text":"Jonathan does amazing work and is very professional. He's going to start selling some amazing holiday string lights soon on his website. I saw pictures of them and they are very unique. I'm planning on buying some to decorate my trees for Xmas.","useful":1,"funny":0,"cool":0},
{"review_id":"yC2W61KxlmXmubP6EtJ8eA","user_id":"n9pt5Vwm-Qj5UVDb9tf31w","business_id":"ZhMTztc2PsoXb2jZZdQZfg","stars":5,"date":"2016-12-16","text":"I should have gone several days ago. I had the worst flu that kicked my butt & I seriously thought I was near death. I went for the immunity boost IV this morning & now I'm feeling so much better. It is a bit pricey, but soo worth it & much cheaper than the hospital. Bryce W. took care of me & he was very knowledgable, professional & a friendly personality. He explained all my options while I relaxed in a massaging chair. It's about a 6$ Uber ride from most strip hotels.","useful":0,"funny":0,"cool":0},
{"review_id":"7wFLdBAvJDkUnhxql5qcwA","user_id":"6JF_BcxgbWoZVAiNVfI_dA","business_id":"58oVEzvF6EnOmvVkXYFkTg","stars":2,"date":"2009-09-13","text":"I just moved to Shadyside and have been looking for a good spot for asian take-out.  This will not be it.  After a long day running errands, I picked up some take-out at Thai place.  The pad thai was blah: consisting of noodles and chicken, with a meager sprinkling of peanuts, and the portion was small considering that it cost $13!  Given the poor performance on a staple dish, I won't be trying it again.","useful":0,"funny":0,"cool":0},
{"review_id":"ZoR4J1TKU6lWHPXAFOyVBQ","user_id":"ig81luET8u1RguaENkj-8Q","business_id":"hf761YTEXm0B1GdtGHGGYQ","stars":5,"date":"2017-03-04","text":"We took a trip to Hoover dam from Vegas, we thought to give a try on this restaurant, got to tell you this is an amazing Asian fusion restaurant. All of us loved the food and more than that we loved the waitress (Angel), she knows what we might order and she also made recommendations and they were are all awesome. Kimchi fried rice is a must try. If you are visiting Hoover dam and if you are looking for food options this place will never disappoint you. AMAZING FOOD and AMAZING SERVICE.","useful":0,"funny":0,"cool":0},
{"review_id":"Fn6OUYLh_nDcSa289A5y1A","user_id":"qSaQ9iQ3JfJIJaAuSoptVg","business_id":"YjEiw0r48dOoF4iGcBwx3A","stars":3,"date":"2015-03-20","text":"Little cotton woods is always stacked with cookies,\nAlso the manager Andrea is on the Angels list.","useful":1,"funny":2,"cool":0},
{"review_id":"7KWjARfsnrTwi7WLyPztnQ","user_id":"qSaQ9iQ3JfJIJaAuSoptVg","business_id":"SLDaxKfIJ-xQGWf6VUUqbg","stars":5,"date":"2014-08-07","text":"Pretty cool owner and staff.\nI had an emergency and I had drive to another state. I had to get an oil change ASAP, I went to yelp and looked up oil change, then called the the top rated shop near me. The owner picked up and I explained my situation, I was so glad they were able to take my car in such a short notice.  the staff performed all the required maintenance for my trip in about 30 minutes.","useful":2,"funny":0,"cool":0},
{"review_id":"GdBhcKD7VPu62OGdykf2rA","user_id":"qSaQ9iQ3JfJIJaAuSoptVg","business_id":"9Jf4z3FFseO2x8imivAgVQ","stars":5,"date":"2015-01-02","text":"Professional man who clearly has a solid knowledge about car mechanics. \n\nRobert is very resourceful, also he is fully equipped with best tools needed to resolve your car issues.\n\nI highly recommend this business to help you fix your vehicle !!!","useful":1,"funny":0,"cool":0},
{"review_id":"qdp90PqZRgpPo9qp51a6jA","user_id":"tX_wfI9MPGHkz-4m7_s_hw","business_id":"scAvBxHq65LO4yshRxDAxQ","stars":1,"date":"2015-05-31","text":"They say they're open 6 days a week Tuesday through Sunday call them 6 times on a Saturday at 5 o'clock says they're open 11 a.m. to 9:30 p.m. no answer call 4 times no pickup or no one answering the phone over there poor service for delivery","useful":0,"funny":0,"cool":0},
{"review_id":"QCxZjfdX1BkgcyXXHY-JFQ","user_id":"RtQoPuDXpnyvap40Dsa5hw","business_id":"TORYrU3gRwjncwQ0UOLGrg","stars":5,"date":"2014-08-22","text":"I absolutely love the Lash Lounge. Kim does an amazing job every time.  All the people there are so friendly.  Wouldn't go anywhere else! !","useful":0,"funny":0,"cool":1},
{"review_id":"bp-aFgxV_IT62p03heZHdA","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"kNaWgxtzLunwVCwfElMcJg","stars":5,"date":"2015-01-23","text":"I've been coming here since I moved to vegas, nearly 4 yrs now, and I can't believe I've yet to write a review! This barber shop is simply amazing and Elliot is hands down the best barber I have ever used to cut my hair. The care, quality, and attention to detail that he puts in EVERY cut is incredible. Don't hesitate to try this great establishment if you haven't already.","useful":1,"funny":1,"cool":1},
{"review_id":"s47zzQ6aSZDoFjERkzeKlg","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"8iZhbQ2kqml7kJbIhrAn6Q","stars":3,"date":"2016-01-18","text":"I used the Yelp deal $26 for $30 and I mentioned it to the guy that greeted me when I first drove up and we agreed to do the $40 diamond package they offer. After going through the wash I go inside to pay the difference of $10 and the guy says the voucher is only good for the $30 platinum package they offer. I explained the Yelp deal doesn't specify what package you have to purchase and he offered to check with whoever was in charge. He came back with the same answer and I informed him I already purchased the Yelp deal and then asked him to change the wash to a platinum if that's what has to be done so I don't end up paying double. The whole situation doesn't make sense because in the end the business lost money ($10) by not allowing me to purchase a more expensive package, either way the savings was $4 to the customer regardless if I bought the platinum or diamond so I don't know. Although it's small in the grand scheme of things, it will make me think twice about coming back.\n\nOverall the car wash itself was good and they would've received at least 4 stars from me if everything had worked out as anticipated.","useful":0,"funny":0,"cool":1},
{"review_id":"FkUJySde5HsB2IdcfdG92Q","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"V_TxEdzeEs8P5nGPANOY7A","stars":5,"date":"2015-02-09","text":"The high roller specialty pizza was excellent!! This was my first time there and I am already looking forward to my next!","useful":2,"funny":0,"cool":0},
{"review_id":"PumSUM1Lf1YwNeagITWzkg","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"NgDyxaeItFSInv7J5paGLQ","stars":5,"date":"2016-10-21","text":"Where to begin? \n\n        First, this place offers exceptional customer service. The bartender, Stephen, was on top of it all night and made sure I never sat with an empty beer! The servers Mikeal, Misty, Kelsey, and Jen were phenomenal!!! They were all sweet, helpful, and personable, which is something that is too often missed with businesses these days. The GM and owner were not only present, but also serving the clients and both came to talk to me individually and ensured everything was going well!\n\n         Second, the food and the beer they had on tap were excellent!! I requested recommendations from the employees and each item was great; (philly fries, fish and chips, Stone IPA and Raj)!!!! \n\n          I will be traveling to downtown Phoenix frequently for business and they have earned a loyal customer each and every time I return! \n\nP.S. They also have free wifi! \n\nThanks again, Kettle Black!","useful":2,"funny":0,"cool":1},
{"review_id":"vOUpkYFmT4l0ZH9UmeChiQ","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"35lDiS--Zx-8HLwv2EZBGQ","stars":5,"date":"2014-11-04","text":"Great service! First time here and my wife and I walked up to the door at 8:06 and didn't realize they closed at 8! We were bummed but out popped the owner and he came to the door and said he would be happy to make us whatever we would like! That is the first time impression that gains a customer for life! \n\nThe strawberry slush boba was great!!! Definitely coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"unNcEKijGdCD4Ycsb6j_IA","user_id":"9HP_Cc6BqtG4nzl5xwUdkA","business_id":"gh6__q2WXFuyN8gt6VAnWw","stars":5,"date":"2014-02-27","text":"Food is awesome! Service is great! Atmosphere is very nice! I am very glad I tried this place. I will definitely be back. The fish and chips were amazing, the flaming chorizo they bring to the table as a starter was wonderful and wow so was the beef espetada!!!","useful":47,"funny":0,"cool":0},
{"review_id":"kr9_qrGj--UV0BLiXf0eow","user_id":"1XNSu0BRvg9k5aPWIyew8Q","business_id":"1tsUXKaHQ20rnfXMAdLUmA","stars":4,"date":"2014-12-21","text":"They have great uni sushi in winter which is greeeaaaatttt!! I've been craving for it for a long time! Twin pieces of uni sushi is just about $9 which is quite impossible in Toronto. Uni is extremely fresh and sweet, and reminds me of the one I had in the seafood market in Japan. The service is also really nice. I also had the chirashi sushi, in which the sashimi are really fresh and yummy. I'll definitely go another time!","useful":0,"funny":0,"cool":0},
{"review_id":"GLdGPYTB8Z1sM80sSXt4Mg","user_id":"1XNSu0BRvg9k5aPWIyew8Q","business_id":"iQJ0IvKNbOh_6DSkUCv9dQ","stars":4,"date":"2015-02-07","text":"We went there for the winterlicious lunch and it's a great experience! We were supposed to be there around 1pm but due to the terrible traffic we arrived at about 2. We called in prior to inform our lateness and the person was so nice and told us we can come whatever time we can.\nFor appetizer, I ordered the chicken liver pate and my friends got the escargot and the salmon mousse crepe. The pate is really flavorful but the side salad tastes even better. The salmon mousse crepe is also really nice and refreshing, but the escargot is a bit too heavy for me. The main course is the best of all. All of us ordered the beef hanger steak, which is incredible! It's cooked in perfect medium rare and the seasoning is just fine. The red wine butter on the top is the best part! It highlights the texture of the steak in such a great way! For dessert, the rum cake is just so so, the crime caramel is also standard, but the warm crepe is way better. Btw, the portion is kind of big for girls which I'm a bit happy cuz I can eat a lot lol.\nThe service is really nice too. The waiter always walk around to see if we need anything, and I think he's really cute. The food is served in the perfect timing as well. The bistro is on the second floor which we had some hard time trying to locate the door lol but a gentlemen downstairs showed us the way in such a cold day. The environment inside is quite cozy, and I kind of like the paintings on the wall that gives a bit sense of France. \nThe overall experience is great and I really recommend others to pay a visit!","useful":0,"funny":0,"cool":0},
{"review_id":"kHYtPVADZW2ya12pKVyyzQ","user_id":"lQreqq93TydoNQuh7p55lA","business_id":"UpEVdq_euH-5mqCIgUAd2Q","stars":5,"date":"2014-01-25","text":"Came here on a Friday night, very few people in the restaurant. My friends and I had starter and the main course, didn't see the dessert on the menu. I had a daily soup which was tasted like some kind of mixture tomatoes and spice. I prefer my friend's onion soup, which is awesome. It has a lot of cheese on the surface of the soup. For the main course, we had duck confit, loin of the lamb, and beef tartare. All the main dishes were good, especially for duck. But be aware of that beef tartare was very small, it's not enough for a dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"CzFb9Z-oSeMoOmuHmrnD3g","user_id":"VTRgU8W5PE-qUFQYvgjjIw","business_id":"IRbgMt0cVuzK1KSppU16_Q","stars":5,"date":"2014-08-18","text":"I decided to go back to Andrea's this year as I was very impressed with the dinner experience I had last year and...My wife and I were not disappointed at all!!! Everything is top! We had the black code as well as the asparagus, dim sum and the rice with vegs and fried eggs!! The quality is good and the service very impressive, not to mention the incredible ambience experience...the only thing to not is that if you are looking for a red wine you will not find any bottle cheaper than 50$... Also they made us wait a bit but may be it was because of the very busy night. I would definitely recommend Andrea's!","useful":0,"funny":0,"cool":0},
{"review_id":"Q_-EUjw6bPHwXTv8vw0vHw","user_id":"V4M3lMoKUvW_gU_3BT1_5A","business_id":"YK4_gGOvx_SDt4OkvNlxnA","stars":5,"date":"2016-05-25","text":"The customer service at this location is great! I used to go to the location on Mt. Holly Huntersville Rd and they were very rude and not helpful. I decided to drive a littler further and give this location and try and am so happy I did. They were so kind when I called and when I was there. They didn't try to BS me and tell me my car needed all these things done. I highly recommend them!!!","useful":0,"funny":0,"cool":0},
{"review_id":"xQNfyH_RoyBEqAWTXhBUGQ","user_id":"V4M3lMoKUvW_gU_3BT1_5A","business_id":"l_kefVF1frmC0xRW2YkvUA","stars":3,"date":"2015-07-02","text":"We come here often and the food is great! For some reason they won't allow us to sit outside and eat which is weird, especially when they are slow.  We visited today and they told us we could order at the bar and sit outside. The bartender, Kelly, took our order and even graciously offered to bring our food outside for us. It was extremely kind of her. It was a slow afternoon and we witnessed other servers actually sitting outside because they had nothing to do. They should have had that server serve us outside rather than telling us to go to the bar. Food and atmosphere is great, just could improve the service aspect.","useful":0,"funny":0,"cool":0},
{"review_id":"SzrdDpoidXA7HhX-LunBiA","user_id":"5eI4CI8jJINBOGp5YaNy8Q","business_id":"7yMbjSUrF7dAmhSpZh5xZA","stars":1,"date":"2016-01-13","text":"Paid extra for better seats and received worse seating with an badly obstructed veiw than I would have got if I paid less..\n\nTickets not ready for collection and had to have woman at the center ring up and correct the mistake \n\nDisappointing all round will never use again","useful":0,"funny":0,"cool":0},
{"review_id":"v0bxT3by82JlBaMoSAscxA","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"LQ-gMAQLbPVxjrBYCJ1ApQ","stars":5,"date":"2013-02-20","text":"best place in phx. i been going here for 14-15 years now....","useful":2,"funny":1,"cool":2},
{"review_id":"b_8J1Na4bClS9STxNhOIxQ","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"TEaBolNAkOdRm2gvIYz4OQ","stars":3,"date":"2013-10-18","text":"Food was good. Was a lot of food too. I got the chimmi with beef and green chilli. \n\nSeating is very tight. So if ur really fat not the place to be. \n\nThe service was bla... Only saw the waitress 3times. (When she took our order, brought out our food and took our check) didn't get refills .","useful":1,"funny":1,"cool":0},
{"review_id":"a-jh0IE_MepDkY9KoAz2XA","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"4VPjBVJKcxDpr00OMwxSww","stars":5,"date":"2013-02-24","text":"i was looking for a place that sold real Mexican tacos. so i ask a friend and told me this was the best place in town. and i agree. the burritos where not that big but still good. now the tacos where amazing. best in flour tortia.","useful":0,"funny":0,"cool":0},
{"review_id":"qf0ffGiBlRSw24acRDtIyw","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"d2D09qs6bVs6Bjb9WnTIdA","stars":1,"date":"2013-06-05","text":"Im a huge applebees fan, only the happy hour tho lol. \nI have been to alot around the valley and i just moved to laveen, and this one is the best one i have ever been to. this place is 2.3 miles away from man that's just amazing....\n\n\nNot amazing anymore. Place has gone down hill","useful":0,"funny":0,"cool":0},
{"review_id":"7JhmRv-oZd2ErHMqDQsIEg","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"EB0vzUuimM2nRXND5VJkIw","stars":3,"date":"2014-01-05","text":"Now this place was ok. I only eat Vegas rolls and they make there's a bit different then all the other places I been to. They were a bit dry to me but still good. Now for the all u can eat deal they have there might not be the best deal u think. They have happy hour from open till they close Monday thru Thursday I think. ALL DAY......... so I did the math and it was cheap to just get the happy hour price then to pay 20 each person. Now on the weekends that deal makes more sense. Now if u don't eat what u order they will charge u what u didn't eat. That is if u left a whole roll.. I personally would not go again.","useful":0,"funny":0,"cool":0},
{"review_id":"ds2KWuquF_lFVxTGfgb6fg","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"18NP-qL3VIJEBJGpns7aTw","stars":5,"date":"2013-08-14","text":"So this place reminds me of this lil mom and pop place I used to go to. There wings are amazing but there pizza is ok.. now this place has the same mom and pop feel and taste but better. I love how there ranch is made not bought. So freash. I don't really like pizza but man there pizza is SOOOOO good.","useful":0,"funny":1,"cool":0},
{"review_id":"DsOSJ0ZYUIRVmt7h-2E5RA","user_id":"WyJem4y8g5ZpZ0umAHIicQ","business_id":"_n3w5BK4-k7iXCWifCjUZg","stars":2,"date":"2014-01-08","text":"So I came to this place when I seen it was on tv for having the best sandwiches in the usa... so I got the Sasquatch burger and it looks amazing really big... well after eating it, I realized it was nothing special. All it has is that its a big burger that's all. So I suggest u get something else cuz it was 16  bucks. Not worth it if u ask me since it was not that great. But if u want it too get some likes on ur Facebook or instagram then get.... \n\nThen my wife got the cowboy. It had chilli on it. And well it was a really dry burger. I don't get y but I didn't was not that good either...\n\nSo lessons learned. Not everything on tv is true.","useful":1,"funny":0,"cool":0},
{"review_id":"hwFA5rAkPtOZjvCxcpGsqA","user_id":"gnQWVkyt24Ame_8r7RY7HA","business_id":"q3SXDX-a-T_DMU2h2CJzcg","stars":5,"date":"2015-01-12","text":"This burger was cooked to perfection,  served on a delicious roll and the taste was fabulous!   I'll definitely be back!","useful":0,"funny":0,"cool":1},
{"review_id":"ycor28qUCJgQinvFwQchxA","user_id":"gnQWVkyt24Ame_8r7RY7HA","business_id":"H-05-lRUJDUNDgYgaw7bXA","stars":3,"date":"2015-01-31","text":"Best breakfast for the money!  Great staff, great service!!  Loved the blueberry pancakes.  ;)","useful":0,"funny":0,"cool":1},
{"review_id":"kaPlVCrSmYd7_gkOZnzEcA","user_id":"gnQWVkyt24Ame_8r7RY7HA","business_id":"k8BqCejnaMlw7aoVthvqyw","stars":5,"date":"2015-04-07","text":"Awesome meals...wonderfully entertaining!  Best Italian food in Nevada!  Kelly Clinton Holmes is an Awesome Emcee\/Hostess.  Love the local talent, the family feel of the place and the service, too!","useful":1,"funny":0,"cool":1},
{"review_id":"XovIY2JlYXKhnESUI5D6UA","user_id":"4o15uj38gbtyYo80y9MW0A","business_id":"BIBWGO_r_1znnlmLbp4Nxg","stars":4,"date":"2014-09-14","text":"Stayed here twice this summer in the Rush Tower - which is a newer built part of the hotel - which I heard is the best place to stay.  Rooms are great and both times we had a view. The rooms appear to be clean - but founds some debris under the couch as well as a light cheap perfume odor from the previous guest.  The bed is super comfy with high end sheets and bedding.  For the price - this place can not be beat.  The hotel offers several pretty good dining options - we always has a good meal.  Good table games and slots.  Two pools - the big shark tank - which was OVER RUN by tons of kids. They do have a small adult pool - but get this - you have to have a reservation for chaise lounge or cabana to use it before 5pm everyday - which is not cool.  The staff was amazing - always friendly, helpful and nice.  Forget the strip - this is our new Vegas spot.","useful":0,"funny":0,"cool":0},
{"review_id":"62vZhY9PB11CRzdj2_CAOw","user_id":"0lftXqosWrNyRVHk9TyPpQ","business_id":"PzGabP5jP7f6RcX5Scuing","stars":5,"date":"2017-09-10","text":"The donuts are so good and for a great price! I'd much rather get my donuts here than from Dunkin Donuts. They are fresh and made daily and have a great variety.","useful":0,"funny":0,"cool":0},
{"review_id":"uqB3s7NuLSoQnsEfbEDEBg","user_id":"0lftXqosWrNyRVHk9TyPpQ","business_id":"uxmL96QngoslrtMXaQ80nA","stars":4,"date":"2017-09-10","text":"Really good chicken pad tai! Been twice and loved the food. Great portions as well! The pot stickers are very yummy and so are the spring rolls with a side of peanut sauce and ragoons. Must try!","useful":0,"funny":0,"cool":0},
{"review_id":"-uoQ3GQjwHctSo9KmksE6g","user_id":"c6EHDgU1GU43UimjFMSU6w","business_id":"OwOMoh48nxjIgPkGU9RxGQ","stars":3,"date":"2015-07-12","text":"I hate to offer a poor review but the guacamole was bland, my entre was warm at best, and the kitchen made my son beef instead of the chicken tacos he ordered.  The waiter was kind enough to return the two meals, but my my entree came back microwaved and mushy.  Sadly, it was my husband's birthday.  While I appreciate the comped beer, it won't bring us back.","useful":0,"funny":0,"cool":0},
{"review_id":"0XapT3Lirgz9cs4hbJtbsw","user_id":"3F3G_1ItUJgSaAaoRDYyfg","business_id":"c7lAaz-pW58i1h1rSlyqcw","stars":5,"date":"2013-12-18","text":"I used to have the empanadas served here back when it was the owner selling them from a small mobile shop. The restaurant has grown but the food has remained uniformly excellent. Delicious, filling, inexpensive and a fun atmosphere. \n\nI just took my mother here, visiting from Michigan. She's says: \"minimal setting ad frills, and just really, really great food.\"","useful":0,"funny":0,"cool":0},
{"review_id":"EFfNKg6oPG5sUtKDRDNrqg","user_id":"7OITLK8tWP-rqUPIuFfZ5g","business_id":"q_lznPwJiprULcyYudWq1g","stars":1,"date":"2016-02-27","text":"we have been here 3 times and it has progressively gone downhill. the service sucks. if you want to be ignored in an empty bar, this is your place! the bartender was downright surly and rude and was as ungracious as he could be when he served a beer. the first time we came here we really enjoyed the whole experience. the second time things were getting a tad shaky. this last time IS the last time. we had to get up twice to ask (it is 5:10 pm, by the way, on a Thursday with 4 servers standing around) for beer and food. the food was barely acceptable and the burger I took home and ate later on actually made me seriously sick. the tuna salad is listed as 6 ounces, but in reality was only 2 ounces. the bathroom was like a walk-in freezer, and is dingy, like the rest of the place. low lights everywhere except in the \"kitchen\", if you drop something, kiss it goodbye, unless you have a flashlight. employees have a \"chain-gang\" ambience which really makes it a tempting place to be in the historical cleveland heights cavalcade of restaurants. we left 15 per cent because we respect working people but this is one bunch that really did not deserve a penny. our advice glance once and keep on driving!","useful":1,"funny":0,"cool":0},
{"review_id":"VkknwPFanboe9bJwtXWjjA","user_id":"uUU4BkXjYg-TJd9TYhA-PQ","business_id":"QAilTGs5JeHVkoCh769RHg","stars":5,"date":"2014-03-20","text":"I didn't think locking my keys in my car could actually be a fun experience.  It actually was with jack (I think that's his name).  In fact I have never posted a review before  and felt I owed it to this guy.  I had called another locksmith initially.  The dispatcher (I assume) said he called another guy and he was on his way.  I got a call 35 minutes later from the other guy asking for the address.  And he told me it would be another 40 minutes!!! I said forget it.  I called this locksmith and he said I will be there in 10 minutes!!! And he was.  Opened the car, made me a spare key, and we talked for 20 minutes about golf, music, family - what a great guy!!!  And inexpensive too!  Highly recommend this locksmith.","useful":1,"funny":1,"cool":0},
{"review_id":"O46BjsLzey5DI1-XaxSAig","user_id":"60HDWe-UxuxOXuk5XNNQIA","business_id":"BLvcA14BVJYSPjaVnNUKFg","stars":5,"date":"2017-02-23","text":"Happened to notice Scoop and Joy, when we had lunch at a nearby restaurant. What a pleasant find.  A large selection of flavors and personable service. The ice cream was favorable  and had the consistency of high butter content (Being from the midwest ice cream without high butter fat isn't ice cream) but like gelato it is apparently made with milk and not cream--\nThe ice cream is reasonably priced for the quality and portions. And to top off your diet, Scoop and Joy offers a selection of pastries including couissants and scones. Definitely two thumbs up.","useful":0,"funny":0,"cool":0},
{"review_id":"qJNVlZcp3WmzaohV0dbFGw","user_id":"8U8eAGCIEvqM6UuBBN-C9A","business_id":"gVLzkqIAHIWro_ZxkpjbFg","stars":1,"date":"2017-11-22","text":"Ordered the chicken teriyaki bowl. It literally had 3 small pieces of chicken in it. Mostly rice with overly salty teriyaki sauce. For 14 dollars it was underwhelming . I would never return .","useful":0,"funny":0,"cool":0},
{"review_id":"yohAroctqM7JHUhEz0ky6Q","user_id":"8U8eAGCIEvqM6UuBBN-C9A","business_id":"HOev_2CifUcfIm9xDL_uaw","stars":3,"date":"2016-06-27","text":"Eggs unfortunately had too much salt and pepper. I don't recall salt and pepper on the list of ingredients on the menu and all of us did not like them. My croissant was over cooked and service very slow. \n\nNo refill offered on my ice tea. Perhaps it explains why it was so empty. Sadly we won't return.,\n\nA shame. We always look for new places to eat . This won't be on our short list.","useful":0,"funny":0,"cool":0},
{"review_id":"FxbFMACnEXiehup_Q0ttoQ","user_id":"m-G5w4-MZbFXRl1S3vg8DQ","business_id":"UJb1PrUWDFfuzwUPc1pP4Q","stars":1,"date":"2014-04-28","text":"This place sucks. I wasn't let in because I had a temporary drivers license that I had got 2 days ago in Texas. I also had a had copy of my Texas security license, and my old i.d card from texas. All issued by the dmv, all with the same picture and DOB. Apparently the state of Arizona doesnt accept real licenses....it wouldnt be so bad, but the \"security\" were assholes.","useful":2,"funny":0,"cool":1},
{"review_id":"QAU6Uhx9VkFjrel61mXZnw","user_id":"m-G5w4-MZbFXRl1S3vg8DQ","business_id":"oO6J78pMW4s8OzSUm75SpQ","stars":5,"date":"2014-04-28","text":"I really liked this hooters. i am visiting, and the hooters from my town isn't that great. Hot girls and decent priced beer. I plan to go back before I leave.","useful":0,"funny":0,"cool":0},
{"review_id":"peOamCnf8KyKh7siAlBzlg","user_id":"m-G5w4-MZbFXRl1S3vg8DQ","business_id":"HjXI6lKGPVNQ8dYJPtaOCg","stars":5,"date":"2014-04-28","text":"I came on a Monday night. All beers were 3.79. I think they had a huge selection. I did not get the chance to try the pizza, so I cannot comment on that. It was a pretty cool spot to hang out in for a while.","useful":0,"funny":0,"cool":0},
{"review_id":"ofPALSMebLfOAQLrDHxhXw","user_id":"Anw1TlkRkmhu4ZTQMS4DdA","business_id":"uXKywXElB9gwI1thIochnA","stars":5,"date":"2015-11-30","text":"Adam Dalen is my trainer going on 8 years.  Adam is very personable, yet professional.  He is always ready when my 3 weekly appointments start and thankfully is always changing the workout so I'm not bored.  Most importantly, he keeps me motivated and keeps my whining down to a minimum.","useful":0,"funny":0,"cool":0},
{"review_id":"D3o4LB0ufWNLvQ9buDRGgg","user_id":"Anw1TlkRkmhu4ZTQMS4DdA","business_id":"r1lRy3epl2UexJDlC8fK3A","stars":5,"date":"2015-12-16","text":"When Menopause started, I needed a plan for my skin and I found it with Virginia.  I've been going to Virginia every month for facials and treatments since 2001 to help stave off the effects of aging.  I count on her products for my beauty routine and seriously count on Virginia's monthly treatments to keep my skin looking healthy and vibrant.   She is first-rate; you will be very impressed with the results.","useful":0,"funny":0,"cool":0},
{"review_id":"w7OmLUe8YlPlDSlOpg69PQ","user_id":"5XRtc_aSXspSdTaomouJWQ","business_id":"HRxCNChQNu7maK29qviS7A","stars":5,"date":"2016-10-15","text":"I did the five day Havasupai Falls trip in October. The guides (Tyler, Liz, Kevin, & Paul) were all incredibly knowledgeable, kind, patience, and most of all I felt safe with them. The ten mile hike into the canyon wasn't easy but well worth it when you see the falls. The best part about this trip was that AOA provided the food, tent, and air mattress. All I needed to bring were clothes, something to carry water, and any other essentials I needed. (I rented a sleeping bag, too).\n\nGreat for group of friends, couples, or solo travelers (like myself).\n\nHike tip:\nThe first 1.5miles is swithcback downhill, then about 8miles of \"flat\", but most of it is loose gravel, and then another 1.5miles of downhill. So be prepared for a workout.\n\nBe advised:\n-Outhouses at the campsite (but if nature calls during the 10mile hike, it's a shovel).\n\n-There are no fires down at the camp site... so you can't \"warm up\" by the fire. Check the weather before you go to pack appropriately. Also, there aren't any cabins... your shelter is your tent.\n\nI HIGHLY recommend using this company!","useful":3,"funny":0,"cool":0},
{"review_id":"QuR65_XThzX-1_YKpAlCiA","user_id":"B0xVhclyQLDuw0lACqaFcw","business_id":"O_UC_izJXcAmkm6HlEyGSA","stars":5,"date":"2015-07-04","text":"Great service and awesome food!!! The bar is also really nice, casual and relaxed yet trendy!! I am obsessed with their tacos! They got nice margaritas as well! It's certainly a great hangout for a couples night, or groups of friends! Make sure you reserve in advance. They are usually booked specially in the summer! The upstairs patio will be closed by 11 cuz of the neighbourhood!!","useful":0,"funny":0,"cool":0},
{"review_id":"ota1h4CRm47dgKGftoifNQ","user_id":"pED6fNbt3RNzeHtlewtPqg","business_id":"6TDdpon8LosFXvjL9QJdYg","stars":5,"date":"2014-01-31","text":"This place is the best! Allison rules. She gives the best head...massages. She listens to what you want and makes sure it looks good. I've never left not feeling satisfied. Come in once, and this will be your new salon for life!","useful":1,"funny":1,"cool":0},
{"review_id":"yBZ7Itb4s59g5ya_JqkNmA","user_id":"pED6fNbt3RNzeHtlewtPqg","business_id":"7wst00GRGs8qsuf2QtsnaA","stars":5,"date":"2012-07-13","text":"Love this joint. One of the best diamonds in the roughness of Sin City. Real people, real good drinks. Check it out if you haven't. Karaoke Friday and Saturday nights 10-2!!!","useful":1,"funny":1,"cool":0},
{"review_id":"iODa4W0Q4mGEAns15c9uVQ","user_id":"pED6fNbt3RNzeHtlewtPqg","business_id":"ItqPtxnayraXSlBS0EMOgg","stars":5,"date":"2015-07-26","text":"Love it here. My special lady friend and I come here usually around twice a month. I've never been disappointed by the food or the service. Hangover Burger is phenomenal!","useful":0,"funny":0,"cool":0},
{"review_id":"NC2_b959tswV4xjNVysFuw","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"042IHd5KjHiMuBtGtugO_g","stars":4,"date":"2016-03-17","text":"Glad to have this place in the neighborhood as there is little else around that offers the fun casual atmosphere. I have had the chicken  and waffles for breakfast a couple times. The first time it was excellent, the second time not so much. Other items have been more consistent. \n\nGripes? I love craft beer, but sometimes I like a simple light beer and I cant get one here. \nAlso, people need to keep an eye on their children. Too many parents come to OHSO and just release their kids like it's a daycare playground.","useful":0,"funny":0,"cool":0},
{"review_id":"AZTS5XgGh_aP6-qTZZ4YLQ","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"UNtyzcZySio-7DphgQu2cw","stars":4,"date":"2017-08-26","text":"Great little neighborhood bar with good basic food. Pool table is busy, but just challenge and join in the rotation. Lots of long time customers that are friendly and will welcome your participation.","useful":1,"funny":0,"cool":0},
{"review_id":"miRv2rBK--se4W7J_mCkGQ","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"wERcL1KznuTgfltSKQt_jg","stars":1,"date":"2013-11-22","text":"Frequent customer to this location. \nI was denied seating at the only available table, a six top, because my party of two was not large enough (they were full, but no waiting list). The hostess asked if I could \"get more people?\". She said I could sit in the bar which was overfilled or the patio instead. \nI said no to the patio and said I would be happy to sit at the bar if she could find seating for us (there was none). She stared at me blankly, confusion. I then asked if we should leave instead of being seated at the available table, response was silence. Just a blank stare. We turned and left.\nAs we drove off to find another sports bar I decided to call and let a manager know that I was displeased. I called and spoke to Jason. Jason said he heard the entire exchange and that it was my fault because I didn't give them a chance. \nI assume Jason is one of the owners children, no other explanation for someone that inept hanging on to a management position anywhere. My wife, son and I will no longer be seen at Zipp's. Way to go Jason!\n\nSide note-\nZipps- Please listen- your patio is a nasty smoke hole. No one that isn't smoking or with a smoker would sit out there. I would love to kick it on the patio when the weather is nice, but you've sold the entire space to smokers, so not very friendly to anyone else out there. (Not bashing on smokers, Zipps says it's a smoking section so no foul on you).","useful":2,"funny":1,"cool":2},
{"review_id":"8YQCshIIx-bJDyeIoAvPHQ","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"iUHz8jIWjkbx6pXsTUNIaw","stars":1,"date":"2016-03-17","text":"Entered the \"sports bar\" at noon today to catch some NCAA basketball tournament games. They were playing country music. I am not sure what they were thinking and I didn't wait around to find out. TV's don't make a sports bar, maybe they should take the word \"Sport\" out of their name?","useful":3,"funny":0,"cool":1},
{"review_id":"rbN4dxpSLvS_RLBRmmczbA","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"bftuYnG58kywe6FSmqMrZw","stars":2,"date":"2016-03-17","text":"The food is horrible, service still isn't much better (i did give 2 stars instead of 1). I am hoping this place closes so something better might come in. Location is great, such a waste of real estate.","useful":1,"funny":0,"cool":0},
{"review_id":"iEJ_srynfvuR9ZpYx8x7Cw","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"B_vbXmSOZcUFhrm1lXkVrQ","stars":1,"date":"2015-11-23","text":"Stay away from this guy. He seems really nice and honest, but that is the where the good ends. He completely screwed up my unit, took expensive parts out and rewired it to get it to run. My AC unit was only 3 years old and cost me another $1200 to have his work repaired. Also, he wouldn't return the expensive parts he removed from my unit and refused to come back t fix what he damaged.","useful":1,"funny":0,"cool":0},
{"review_id":"KMXd5-JsI-Ly8iL5zovqTw","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"kblFxfo_xnMUZF0U0aGXQw","stars":1,"date":"2012-08-18","text":"One star is too many for this place. We just went for the first time tonight. Our waitress was slow and lazy. We waited 15minutes before the server \"noticed\" us (she was busy talking to coworkers). We ordered some sushi and spring rolls. The sushi is cheap and skimpy, spring rolls were bland. We ate less than 1\/2 the sushi and sat waiting for our server to check on us (still busy talking to coworkers). With no more to drink and sitting, waiting to get help for 1\/2 hour, the server finally noticed us glaring at her and came over to see if we wanted anything else. We said \"no\" because nothing was good. She left saying nothing and after 10 minutes just dropped our check at the table. We were comped a good portion of the bill, but no manager came to see us and the waitress never mentioned it. Really all they needed to do is not ignore us and if they would have checked in shortly after we were served, we could have tried something else and maybe saved the meal. We will not be back. \nIn summation, the food was poor quality, the service was awful, management is mia. No idea how this place stays open.","useful":0,"funny":1,"cool":0},
{"review_id":"5sBwZv5pgwyL6i0yQ0TBfA","user_id":"zj6vWdksUX1F2-ojFoU4Mg","business_id":"r1CBp5xMWPqt2ii0hJIPPg","stars":2,"date":"2017-06-05","text":"These guys are taking a substantial commission for this service, it's costing you 10%-12% of your money to exchange here. You may want to only get a small amount of currency exchanged, just enough to get to your destination and get better rates there.","useful":6,"funny":0,"cool":1}]