[{"review_id":"Efe9J8kafodBKQGN_KexMw","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"uH2dNi5nKj31_Xf5dTfXdw","stars":2,"date":"2012-06-29","text":"I was excited to visit the PBC solely to experience their \"exotic\" types of burger meat. I chose the salad bar option, which was poorly stocked. The selection did not look all that appetizing.\n\nWhen ordering burgers, the first selections that we made were not available so I settled on a Bison Burger. It was not much to speak of from the bun to the toppings or even the meat itself. It wasn't memorable or particularly tasty. The french fries I tried seemed overdone and like they had been sitting out.\n\nFrankly. I would not recommend this place. My meal left me feeling disappointed and unsatisfied. The food was not that good and the service also left something to be desired. The restaurant was a little dark, uncomfortable booths, and didn't have a nice atmosphere.... If you're in the area, you'd be better off at Red Robin,","useful":0,"funny":0,"cool":0},
{"review_id":"8zM_xAspL-_fMXfUBDc1tg","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"5REYrZfsX3m4E3FTwovp5Q","stars":4,"date":"2011-05-03","text":"Seviche has a lively, colorful atmosphere that added to the dining experience. Our server was very attentive and knew the menu very well. She was able to offer many suggestions. The rest of the wait staff was also helpful when it came to seating us, turning the air down, everything.\n\nServed tapas style, the food is conducive to sharing and ordering lots of little things. We tried for all ranges of the menu and thought the dishes had interesting flavor profiles, were prepared well, and tasted great.\n\nThe seviche section allows you to choose a fish and a style of preparation -- they are delicious! The filet mignon was also a wonderful cut of meat.\n\nMojitos are a bit pricey at $9 a drink for the small glasses they are in, but are delicious all the same.","useful":0,"funny":0,"cool":0},
{"review_id":"K5MSSQTowhkmh_BwEMMTtg","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"wmCBxE0PfLZD8sxIwAY59Q","stars":3,"date":"2013-05-16","text":"Fun atmosphere. Good food. Big beers.\n\nI would suggest the appetizer sampler (the works). As many below me will agree, the sauerkraut balls are delicious. The bier cheese & pretzels were good too.\n\nI had the Bayerischer Schweinsbraten (pork with sauerkraut and a potato dumpling). It was different than I expected as I'm not too familiar with German food, but still pretty good. The pork was cooked well and had a good sauce. I wish I had substituted mashed potatoes instead of the dumpling.","useful":0,"funny":0,"cool":0},
{"review_id":"8ICcQMET5lYfYFRWskoR5Q","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"LQFmktF43j2NPncKdNd9mg","stars":4,"date":"2012-06-21","text":"A big menu selection with even bigger size portions (so big I took half of my sandwich home). I thought my meal was delicious and was impressed with the amount of sandwich\/burger options on the menu that I was torn between.\n\nDefinitely a place to check out in Southside.","useful":0,"funny":0,"cool":0},
{"review_id":"vedUdLAR02qnLcZmClfCqw","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"-HgbBv9Yjqv735F9fwCZNg","stars":4,"date":"2012-06-29","text":"The times I have been here I was impressed at the food and service in comparison to a Red Robin I had visited several years ago. We were seated quickly and taken care of by the wait staff.\n\nI had the Prime Chophouse Burger and the Burnin' Love Burger on two separate occasions. My food came out hot, fresh, and cooked to my liking. The fries were all newly made. \n\nBecause it is a chain, you know going in that you won't be gettin extravagant food, but for a burger & fries kind of meal there are a lot of choices, many of which are good.","useful":0,"funny":0,"cool":0},
{"review_id":"GUY9fYucroJvbpChuZnqWw","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"cmaPrML-0zCJOs8_1VYmaw","stars":4,"date":"2013-11-21","text":"Self-service frozen yogurt with tons of toppings to choose from. You pay by weight, although there are no prices listed.\n\nThey change out the flavors and have some seasonal type ones too. The frozen yogurt is really delicious and I would highly recommend coming here. Their toppings include fruit, gummy worms\/bears, sprinkles, chocolate, sauces, cereal, etc...","useful":0,"funny":0,"cool":0},
{"review_id":"nPatOrbMTZoe59hYgRHyww","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"juu7S1nP5eirbeJ8-rfguw","stars":4,"date":"2012-06-21","text":"On the multiple occasions that I have gone to this restaurant, I have always had a positive and very-filling experience. \n\nTheir bread is delicious and hot. The server always brings out tons for us. I would say most of the dishes are standard Italian fare. I have not been disappointed by the Pasta Bravo, Eggplant Parm, or the side salads.\n\nThe best thing I have tried here was the Chicken Scaloppini. The chicken is covered in melted cheese and has a great lemon sauce. I would highly, highly recommend this dish.\n\nFor dessert, try the apple turnover thing with ice cream. You won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"aLK9Zsevo1ddSvULAUjB-Q","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"gHngt6zpP683GKe1i23LUg","stars":4,"date":"2012-11-14","text":"I had a banquet event here and I was quite impressed with the service, as well as the atmosphere. The wait staff was very friendly and was able to keep everyone's order straight, despite the large group.\n\nI ordered a chicken dish that had a creamy sauce, some potatoes, and asparagus. It was a great dish, served hot. It had way more complex flavors than I was expecting. I also tried a bite of the pasta with vegetables.\n\nIn a catered, sit down dinner service, I usually don't expect the food to be great or hot, but the Grand Concourse is a nice exception.","useful":0,"funny":0,"cool":0},
{"review_id":"Vgcxw3ftUA7ZIGmacbqO2w","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"Hz1F5uruPe1kCsf5PIA6Sg","stars":4,"date":"2012-08-13","text":"Ice cream is made on the premises with a variety of traditional and very unique flavors. Walking past these place you can smell the waffle cones and sweet treats that are made behind their doors. Definitely a place to check out.\n\nNegatives: \n\nCash only. I think they have a machine where you can take out money through an atm-like transaction, but it does charge.\n\nAlthough delicious and I swear by it, I think their ice cream is a little over-priced.","useful":0,"funny":0,"cool":0},
{"review_id":"kNzmm_kUbs5--7MKfVpv3w","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"oCvxJBOs-Mbg-4oanPO7lQ","stars":4,"date":"2011-09-05","text":"Pita Pit is a more interesting version of Subway, to me. You can pick from a variety of meats, cheeses, veggies, and sauces. Its inexpensive and tasty.\n\nThe staff was friendly and made the experience even better.","useful":1,"funny":0,"cool":0},
{"review_id":"FfYXPbiBNqFBAEJiTVhHBw","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"stD-LTFFwlmBdzU-0aBntw","stars":4,"date":"2013-11-21","text":"I ordered take out from here and was happy with my order. \n\nI had a white pizza with spinach and it was really delicious and filling. The man who made the pizza was Italian, which adds an element of authenticity. The pizza was a far size, for a far price. \n\nIt's a nice change from the other pizza options in Oakland.","useful":0,"funny":0,"cool":0},
{"review_id":"CyizK6HHBNIe6vGXS2dN-Q","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"ehaoreB8IzKY8KvRGqxcUA","stars":4,"date":"2013-08-31","text":"Having eaten here several times, I was unsure between 3 and 4 stars as some visits\/meals were better than others. Pretty solid fare, bar food type. Not the best atmosphere inside - kind of dark, gets a bit loud, still enjoyable though.\n\nHighly Recommended:\nBuffalo Chicken Mac & Cheese \nSkinny Dip (Buffalo Chicken Dip with Chips)\nHog Heaven, especially because of the side horseradish sauce.\nRusset\/Sweet Potato Fry Mix\n\nAverage:\nRosemary's Breast\nBurger\nSalads (in general)\n\nThey are known for having great pizzas, but I've only ever had a bite here and there.\n\nHalf price after 11 is always super crowded.\nGood happy hour beer prices.\n\nWhen getting takeout, I do feel the portions are smaller.","useful":0,"funny":0,"cool":0},
{"review_id":"O93ruTPKds3NMvXdtuXNxA","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"pCwOCE-cycl6cMEa9O6bZQ","stars":4,"date":"2012-07-21","text":"I had the Bistro Burger with a side order of french fries. The burger was brought out to my table and I found it be simple, but delicious. The fries were hot and had a nice salt & pepper seasoning.\n\nAlthough I did not try the salad, it looked great -- a ton of options, friendly staff to help you with your selections. Once you pick everything, they chop it and give you dressing. The salad was what I thought to be a big portion, much bigger than Panera and customized to what you want.\n\nThis is a great concept. I'm sure the place will do well. I'm told at lunch the line is already out the door and its not even the school year yet...\n\nIts also nice how they have garage style doors at the front to keep a nice breeze coming through and leave the place feeling more open.","useful":0,"funny":0,"cool":0},
{"review_id":"XZ4TtMLDsMqpqAzWDqqWoA","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"w4u0y6NEPtV98SGG4wOKnQ","stars":5,"date":"2012-06-29","text":"Great subs, bottom line.\n\nFresh bread, a large variety of choices, hot or cold.\n\nYum, yum, yum.","useful":0,"funny":0,"cool":0},
{"review_id":"yX15Hskc_zVDhH6FQckWDQ","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"3BBkhChwKTEx9l83bIl1ng","stars":5,"date":"2013-05-16","text":"I've been to Dean of Shadyside on several occasions now. I have always had a pleasant experience and often recommend them to my friends. They have a great referral program where you can give people a certificate for a free haircut and in return you get $5 off of your next cut. The free haircut got me in and now its my regular place.\n\nI got my last haircut from Ken who was great. He gave me the type of haircut I wanted while also adding his expertise. I loved the way he dried and styled my hair too. \n\nThe staff are all professional and try to make your experience a pleasant one.","useful":0,"funny":0,"cool":0},
{"review_id":"7Z2LZNkD2q-xhhmxXjQIHQ","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"gpaJYV8IT-oT9wOt16BlSw","stars":4,"date":"2012-06-21","text":"I had the Chicken White Pizza that has spinach too. Its the best white pizza that I have had in Oakland so far.\n\nThis place may seem like a little hole in the wall, but the cooks seem to be authentically Italian and make great pizza.","useful":0,"funny":0,"cool":0},
{"review_id":"Y1rvGqVHk_wmmafuoW159Q","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"LdI-o0yH_vtqoFf_ageDpA","stars":5,"date":"2012-07-19","text":"I thought UPMC Urgent Care Shadyside offered great & quick service. Despite being walk-in only, I didn't wait more than 10 minutes to be seen. The staff was friendly, helpful, and ran the place efficiently.","useful":0,"funny":0,"cool":0},
{"review_id":"h6uJHpVqLlkJJCRxPNhKFg","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"LrnStcyN8cXs0RlyiVFTiQ","stars":5,"date":"2011-09-05","text":"The employees at the Genius Bar were extremely friendly and helpful. I spilled something on my laptop less than a month after I purchased it and they felt really bad.They didn't charge me the $755 that it was supposed to cost as a one time exception!","useful":1,"funny":0,"cool":0},
{"review_id":"Tzh-u5ueYxEx-k2RAXe7cQ","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"ejaUQ1hYo7Q7xCL1HdPINw","stars":2,"date":"2013-05-16","text":"I came here for lunch and was rather disappointed with both the service and the food.\n\nWe were a large party of 8, but the restaurant was not very busy and service was still slow. The waitress had to be asked multiple times to bring napkins, etc.. and didn't really check in. Even getting the check and getting out was slow.\n\nThe food took a long time to come out. I had the pulled pork tacos and was very disappointed. They were SO greasy and didn't have a ton of flavor. I got the \"bottom of the barrel\" fries, which did not impress either.\n\nI wanted to like this place, but would not recommend it based on my experience.","useful":0,"funny":0,"cool":0},
{"review_id":"sYjzwdQWAshVPtLV1JhwVw","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"mG5gV8OWUTp21vLQqmoFFQ","stars":4,"date":"2012-08-13","text":"I love these hot sandwiches. It is a big rtion that I can rarely finish in one sitting. If you eat in, you also get fries for free.\n\nThe service is pretty quick, although they do get quite busy at lunch time. The sandwiches come out hot and to order. I usually get the Pittsburgh Cheesesteak with L,T,M,O and always enjoy it. They also offer adding an egg, which can be yummy.\n\nHighly recommend for a delicious hot sandwich at lunch or dinner.\n\nNegatives:\n- The restaurant itself looks kinda run-down from the furniture, to the floors, to the poor lighting. Although they seem to be going for an \"old\" look, it could really use a facelift.\n\n- They only take CASH. They have a ATM-like machine to get cash, but it will charge you for the transaction.\n\n- Wish they were open late!","useful":0,"funny":0,"cool":0},
{"review_id":"6XBWY3acF8I9wj-AkymxNQ","user_id":"Gil-8h_ZPRx6DMaph5nMMw","business_id":"qNYLt8zizn--wEpT1KILfw","stars":5,"date":"2017-12-11","text":"Love this place! Especially our waitress! Ask for LuAnna every time! She always makes sure everything is perfect! Even special requests for our kids! Great food, great family atmosphere, and great service!","useful":0,"funny":0,"cool":0},
{"review_id":"9_psbS_onqVI55rg9jnUhw","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"z4K95Y4P5nMrtJiDtXWDYA","stars":4,"date":"2009-08-27","text":"My goodness me! It's a regular \"Dump on Los Sombreros Festival\" here in Yelpland. Hey, people -- it's a perfectly fine Mexican restaurant. Well, maybe it's not perfect, but my meals here over the past five years have always been good, and I consider Los Sombreros a great place to take out-of-town guests. If I were to grade it on a pretentiousness scale, it actually rates better and is more inviting than Barrio Cafe. So give the place a break -- try the guacamole, the chicken mole, the lamb adobo, any of the skirt steak entrees and any of the seafood dishes.","useful":2,"funny":1,"cool":1},
{"review_id":"Cpcq-VoLl6kYCHI4EkpwxA","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"XQYPc2728rjMjn56SkaWhw","stars":4,"date":"2008-05-04","text":"I am recommending this place on behalf of a relative, who was looking for an unusual flower arrangement for a special occasion and walked away with exactly what he wanted. Glad to know this little place exists in my neighborhood.","useful":1,"funny":0,"cool":1},
{"review_id":"heZ9UDQrPobXAO2Nz1IJQw","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"PQWE8a6Opjiuzt7DaX2R6Q","stars":4,"date":"2008-03-16","text":"My husband and I dined here twice within one week to seek solace after spending a lot of time in the Expo store down the way, where we were setting the wheels in motion for a huge kitchen remodel. Happy to report that our enchiladas and tacos provided sufficient comfort. The sauces are especially distinctive and good. There will be one more visit to Expo, after which I'm sure I'll head in the same direction -- and add a double margarita to my order.","useful":4,"funny":0,"cool":1},
{"review_id":"To7LDB_nCpi10qH1k0pTKg","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"URFhSrJPk7JM2pUtsuWsAg","stars":4,"date":"2008-02-17","text":"Giving four stars to China Chili doesn't necessarily mean I think the place is fantastic -- but the spicy garlic eggplant is fantastic, and I'm still pondering its fantasticness hours later. My husband and I also enjoyed the rest of our meal -- yiu-shan chicken and one of the house specialties, black pepper prawns and scallops. Yes, I concur with other reviewers that some of the dishes are not gonna be fantastic. Still, I look upon the place as reliable, clean, moderately priced and efficient. I don't need P.F. Chang's.","useful":0,"funny":0,"cool":1},
{"review_id":"sSC3rXCHNGt3XoMaOPQ1Ig","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"5FIOXmUE3qMviX9GafGH-Q","stars":4,"date":"2008-02-06","text":"Maybe the four stars is too generous after just one visit, but there's something about this place that's very comforting. Maybe it's the community seating, or the simple white bowls your veggies come in, or maybe it's the simple fact that you're eating your veggies and enjoying them too. I tried a yummy coconut curry with crispy tofu and appreciated that it was just the right portion for the price. I'm gonna try a vegan tsoynami with vegan tsoft tserve \"ice cream\" (spelling is correct) next time I go.","useful":2,"funny":0,"cool":2},
{"review_id":"LEue5VYkm0lz5dLdQ73C7w","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"x9HvTsA83c5r-muemxw_9A","stars":4,"date":"2010-01-01","text":"Through unusual circumstances, I ate at three Thai restaurants within 24 hours the other day -- Bejarong Thai in Mesa for dinner, Thai Lahna for lunch the next day, and Malee's Thai Bistro for dinner that evening. And the winner is ... good ol' dependable Thai Lahna. I realize, though, that I am in a bit of a rut as to what I order there and need to branch out to some of their seafood and vegetarian entrees before I can call myself a Thai food aficionado. Also, my Far Eastern journey led to the pleasant discovery of Bejarong, which comes in second. Malee's -- I appreciate your twists on Thai food, but my half-plate entree was not worth the $9 I paid for it.","useful":2,"funny":1,"cool":2},
{"review_id":"KRtCR7EZdvzJy165N2xHwA","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"9tKSEjLCJowSkxze0NiFig","stars":4,"date":"2008-05-12","text":"It was back in the '80s when Town and Country Shopping Center was a hoppin' place on weekend nights because of its great selection of trendy restaurants. Maybe those heydays are gone, but as someone from the neighborhood, I am glad to see a few small \"boutique\" restaurants going in, and Cyprus Pita Grill might well start drawing more crowds. The food is carefully prepared and presented, the atmosphere is cute faux Greek, and the service is pleasant. The lamb on my gyro plate was tender and scrumptious and I regret I didn't order any appetizers. A neighboring table was ordering all appetizers instead of entrees and they looked wonderful. Three of us sated ourselves for a mere $45 and resolved to stop by more often.","useful":0,"funny":0,"cool":1},
{"review_id":"vzF3nIpVwbNASmsOhtan5w","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"qdtfcYMROGZVvYcE9F23yg","stars":4,"date":"2008-03-16","text":"El Molino makes the chimichanga by which I rate all other chimichangas -- if another restaurant doesn't give it  just the right crispiness, with just the right accompaniments of cheese, guacamole and sour cream, then it just doesn't cut it. By the way, after almost 30 years in Phoenix I've eaten more chimichangas than I care to admit. Get El Molino's chicken or machaca chimi, which is often a nightly special for under $8, and you will be in sinus-clearing chimi heaven.","useful":4,"funny":1,"cool":1},
{"review_id":"pUbgWISyOHd61qpSra0QoQ","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"fT6Uwl6abRQfiNgxre_qbg","stars":3,"date":"2008-01-14","text":"Previous reviews make a lot of good points, but I disagree that the food is bland. Try the house specialties, the soups and the spring rolls. I had not been in for a few years and was pleasantly surprised on my visit last night as to how busy it was. This is good value and quality for an area of central Phoenix where good restaurants are scarce. And don't dis the desserts -- they're terrific.","useful":1,"funny":1,"cool":3},
{"review_id":"uuA49nD83C-Uo3kPJprOAA","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"rEvnqL_h1W1DXdKoujmrgQ","stars":3,"date":"2010-07-18","text":"Must echo Brian O. about the lack of circulation in the booth area. Not good when the temp is 113 degrees, no matter how many times the server refills your water. By the way, our service was good and efficient, and we liked the guacamole prepared tableside. Also, we liked the many vegetarian options and the way the shrimp tacos were prepared. I hardly ever venture out to Glendale, but at least now I know of a decent Mexican restaurant there.","useful":0,"funny":0,"cool":0},
{"review_id":"TX9FFKsImwxBTgeFD1wIKw","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"eS29S_06lvsDW04wVrIVxg","stars":4,"date":"2008-05-04","text":"I feel like part of the in-crowd whenever I dine at Barrio Cafe. This is good and bad: good, because I realize, as hordes of other people do, that this is some of the most innovative Mexican food in town; bad, because tonight I realized the in-crowd often is, in its lust for a good meal, downright rude. One set of patrons muscled its way to the front of the line as the restaurant geared up for its 5 p.m. Saturday opening. I mean, really, just get in line. Then, once we were dining, we noticed another set of patrons coming in the back door and just seating themselves at an empty table. The waitperson, to her credit, remained polite toward them. Sigh, I'm trying a week night next time ...","useful":1,"funny":0,"cool":1},
{"review_id":"FLDfPPwifbeFf4WUueMrVQ","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"D3dAx-QW_uuClz4MambeHA","stars":2,"date":"2009-06-30","text":"I would agree that the food and pastries here are above average, but when I walk into a small, crowded, noisy place and don't know where to go for a simple beverage and no employee seems to notice my perplexity or to care, I come away feeling the place is pretentious, snobby, confusing and out of my league. Which is too bad, because it's right in my neighborhood. I sense that if you're a regular here, then probably you feel welcome and the employees chat you up all time. But not all of us can afford to be regulars here. This is at least the third time that La Grande Orange's uppity ambience has annoyed me, so I don't feel guilty about the poor review.","useful":6,"funny":1,"cool":2},
{"review_id":"VmXe_b1kA-Fq-JAol6--7Q","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"yUAwR_aC6QtSyjuJUhOEKQ","stars":3,"date":"2008-06-18","text":"This is better than average mall food, and I love the cookies and muffins. There oughta be a yellow caution tape around the establishment, though, because its ultra-centralized location forces way too many cream cheese brownie breaks and those clothes I'm trying on are not gonna fit me after all. I do have to wonder if the portions for salads and sandwiches are getting smaller. A customer next to me griped about it to the cashier, and lo and behold, my tasty pasta salad was a little on the chintzy side.","useful":2,"funny":0,"cool":1},
{"review_id":"44SM6MM8LYuvC8-YUTYmMA","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"9mLpkJISzg5G1ImVqqe2QA","stars":4,"date":"2009-05-09","text":"Beware the ladies of Teavana! I say this good-naturedly, but also as a warning. Let me say first that as a tea freak I love that this place exists, and now I can go to either the Biltmore or Scottsdale Fashion Square location. But here's what happened to me, and I repeat it here as a warning: I walked by the store with no intention of going in. Thirsty, I sampled a tea by the door, then another tea. Then I thought, what the heck -- I walked a few feet into the store and sampled another tea. That's when a lady of Teavana snagged me, chatting quite knowledgeably about the tea I was tasting and inviting me, like a Siren, to get a whiff from a tea canister at the counter. Expertly, she fanned the lid of the canister over the leaves so that I could get the full effect. Oh my, that orange-pomegranate-whatever smelled good. Must I take some home? Oh yes, I must. That lovely 8-ounce canister of herbal tea will be $36, please. Yikes!","useful":3,"funny":3,"cool":1},
{"review_id":"-8nLvWne0z6tNoW56OD1Ig","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"vJvEKFtQ8Am95tWEkiwOGA","stars":4,"date":"2008-03-16","text":"I'm no seafood aficionado, but this place seemed pretty good to me, and I hope it sticks around because fresh seafood like this (and at these prices) is fairly unusual here in the desert. Our table tried the fish and chips, swordfish, seafood kebab and catfish -- and all were satisfied. As noted in other reviews, the staff is jovial and the atmosphere is pleasant. Whew -- saves me a trip to Boston!","useful":4,"funny":1,"cool":1},
{"review_id":"nQ3lsNgUAN84gcSCqG5X6A","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"LV9Stq-s3H4dqaTE1Z7rwA","stars":4,"date":"2008-07-15","text":"Seems like the menu has been overhauled since I last dined here a couple of years ago. But NBD. We skipped the appetizers, knowing that our entrees would be plenty filling. The tasty appetizer selection is worth considering, though, if you're at Flo's with a fairly big party. We liked all of our dishes -- the spicy bean curd, the shrimp and pan-fried noodles and the chicken vindaloo, with the latter being maybe the weakest of the bunch. With it being early and uncrowded on a hot and humid evening, the wait staff was friendly and very attentive. Try out this location before the snowbirds return.","useful":1,"funny":0,"cool":0},
{"review_id":"gWswIKI1qty3cN1rluzLsQ","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"IsN0qEzgAXBjbT3qn6lokA","stars":3,"date":"2009-03-15","text":"I'm trying to decide -- when it comes to pizza, am I a crust person or a topping person? If I am the latter, then I would say that the toppings we tried on three different pizzas were all good but could have been more plentiful. We especially liked the artichoke and olive pizza. Whatever exotic cheeses the chefs put on the pizzas are terrific but are just dotted on. I left the restaurant last night feeling crusty, which is to say I love the wood-fired, slightly burned, soft-on-the-inside crust. So much so that I almost finished off the crust left on my carb-watching daughter's plate. We'll see where things fall in the great crust\/topping dilemma next time I visit.","useful":1,"funny":0,"cool":1},
{"review_id":"2EcmxPM7tvWVD7teiRBwgQ","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"hAioxEk3WU-SzlqIM4TI7w","stars":3,"date":"2008-06-24","text":"Lovely decor, good location, celebrity tie-in ... and food that left me wishing I had ordered something different. Out of our party of four, two of us ordered mediocre dishes -- the vegetarian chile relleno and the chicken mole casserole. But the two other dishes were fine -- spinach and mango salad and chicken enchiladas suiza. The chunky salsa was also quite good, especially for those of us who've deprived ourselves of tomatoes recently. Let this be a lesson to you (and me): read reviews on Yelp for recommendations on a new restaurant's best dishes before you go. Also, a note to our server: when a customer says his dish is just OK, then DOH! -- follow up by asking how it could be better. This is especially necessary at a new place.","useful":2,"funny":0,"cool":0},
{"review_id":"AcqEzHvTgEIoijwzQPCzpg","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"hrhtWc8UcoZqYr2d7YPgEA","stars":3,"date":"2011-02-03","text":"When we found out we had to spend the night in Las Vegas because of a cancelled flight to Europe, we surely hadn't foreseen a night at the Tropicana. That old place? But it turned out fine, and I'm glad we were there AFTER the remodel, from the sounds of the BEFORE. We walked through the Excalibur and, boy, does that place need to be brought out of the Middle Ages. As for the Trop, I'd like to put in a good word for the buffet at Cafe Nikki. It was simple and almost elegant and not what we expected from a buffet on the Strip. The cafe has a beach theme, which keeps things light and modern. Everything we tried tasted good, or good enough, and the desserts were crazy good. I appreciated that the chefs were hovering behind the buffet table every time I went up -- it showed me they cared.","useful":0,"funny":0,"cool":0},
{"review_id":"N6O4676V0weTsGdsVuap-w","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"kzqx6Z2sse8PV3hVCVEw4g","stars":3,"date":"2009-02-10","text":"Have you ever had one of those experiences where you saunter out of a restaurant after your first visit there and you think, \"Gee, not bad ... I'll be back,\" and then the next day you mention the restaurant to friends and they shoot you down. Not such a great place after all, they convince you. Well, in hindsight I see that my friend was right about the food here being on the bland side. Yes, it does seem to be prepared with your arteries in mind. But what is Indian food without creamy richness and sweat-inducing spice? I give Bombay Spice kudos for the innovative plating and for allowing you to order two entrees for the price of one. The happy hour is a terrific idea, and I might be back just for the $4 appetizers and wine.","useful":2,"funny":1,"cool":3},
{"review_id":"iHfPcaTIAvdfOuScT1__vw","user_id":"0wvlpzuR4mnZfMcoG8N31Q","business_id":"Z4CA7jEArUT_D-1ZM4Bh1Q","stars":3,"date":"2008-06-03","text":"I get the feeling that little ol' Chop and Wok -- with its bar area, drink menu and kitschy tropical\/beach bum decor -- is gearing up to be a twentysomethings hangout at night, and that's just fine. But I'll keep going for the quieter hours and the lunch specials, when the traditional Chinese chicken and vegetable dishes are all I need. Two tips: \nTry the crab puffs, which have been a Chop and Wok specialty for years. And park in the back instead of trying to maneuver in and out of a space from the busy intersection of Scottsdale and Shea.","useful":3,"funny":0,"cool":1},
{"review_id":"0T1xa_tY4Yb-39uYA9tdGw","user_id":"-Opvc9hAWllZSSPDUsD7NA","business_id":"ExtP8z3SVyut_RICc9i_DA","stars":3,"date":"2016-09-10","text":"Ordered a Mediterranean salad. Expected green leafy lettuce. Received iceberg. Dressing was very salty. Very under-whelmed. The place was clean. And the gentlemen taking the orders was very nice","useful":0,"funny":0,"cool":0},
{"review_id":"kHN8zrGfWKu_2OjgmPgrKQ","user_id":"aacaN5RjxK6AFWwtL6AGpA","business_id":"EYOPM91BM039rYuAjgZbkg","stars":4,"date":"2012-08-17","text":"This musical isn't going to win any Tony awards, but if you are a fan of the Evil Dead movies you'll enjoy it BUT only if you get the splatter zone. \n\nLike the movies the musical is packed full of campy humor and gore which is exactly why you love the movies. The song's lyrics are at most times over powered by the music, but I would have to say my favorite one was \"WTF.\"\n\nThis reminded me of Community Theater with a few surprisingly good singers, terrible props and uncomfortable seats. I found it really funny that you could all ready see the tears and faded blood stains from past performances on their clothes from the very start. \n\nMy group did the splatter zone and we LOVED it. They get you from all sides, but mostly it came from the back right. With the spaltter zone you get VIP seating, 2 for 1 bar drinks and a white Evil Dead t-shirt.\n\nThe odd thing about the \"blood\" was it was warm. I never did get use to that.\n\nIf you've seen all 3 movies, you will have fun. However, it does take a moment to get into. \n\nHere are a few things to think about:\n-Don't go if you think this is going to be scary. It's not.\n-Don't go if you are offended by swearing. They do it A LOT.\n-Don't go if you hate campy movies with cult followings.\n-Don't go if you never seen any of the Evil Dead movies.\n-Don't go if you hate musicals.\n-Don't go if you don't want to get \"pinkish water\" coloring on your clothes. It can get on you EVEN IF you aren't in the spatter zone. Mainly the first and second row behind the VIP area.\n-Don't go because someone talked you into it. You won't like it. We saw a few couples\/groups not come back after the second act because someone was whining they wanted to go.\n\nDO GO-\n-If you love the Evil Dead movies.\n-If you have an open mind.\n-If you are willing to \"gamble\" $40-$70 dollars on something you may not like.\n-If you quoting the popular movie lines with the actors. The crowd was shouting these lines. It was a great vibe.\n\n***The key is to expect the worst. That's what I did and I had fun.***","useful":5,"funny":4,"cool":4},
{"review_id":"csA2vYbyo-byZrjermZsVw","user_id":"SJz7FSxrPGQbt0oqL7CMrQ","business_id":"PXN0l42g6IWp18NGJ7yn5w","stars":5,"date":"2014-03-02","text":"One of my favorite restaurants hamds down. The martinis are amazing (jolly rancher), the salads and antipesto are so tasty. I always love the cozy feeling in tge winter and the hot patio with ferry lights in the summer. Great staff and amazing location.","useful":0,"funny":0,"cool":0},
{"review_id":"VBKndA5tubsA8k4gQmKPJQ","user_id":"SJz7FSxrPGQbt0oqL7CMrQ","business_id":"l7RCvKqA61Jzm98gaqIhvw","stars":3,"date":"2014-03-02","text":"The food was pretty good.  Great atmosphere and crowd. But the waitress with the dark brown hair was rude and our food waited for her on the counter for 20minutes before givibg it to us so it was very cold. Her attitude was negative.  She rushed out orders and the orange juice is gross.","useful":0,"funny":0,"cool":0},
{"review_id":"GtEe-h_-s5Va_HXrwLYvrQ","user_id":"2dZjPtHGkxYW1-XhRgs3zw","business_id":"wIuy9xAWzZrurzNzpgN9ww","stars":3,"date":"2017-06-30","text":"Decent haircut, not so good shave. \n\nClassic barber chairs at big mirrors in gold painted wooden frames sitting on what look like antique-shop dressers (but they all match so probably not) plus photos of James Dean, The Rat Pack, and Laurel & Hardy (!) and classic rock on the radio. Nice enough surroundings.\n\nHad trouble communicating with my barber, whose English was limited. Simple questions were met with blank looks. We managed, but not without difficulty. The haircut was fine, not that I needed anything out of the ordinary. Oddly, the shampoo followed the cut, so he was working with somewhat dirty hair.\n\nThe hot towel shave was a real disappointment. First, the chairs do not recline at all, so there is no sense of relaxation. You either sit up straight and strain your neck to bend your head back, or slide forward in the chair and strain your back. The hot towel is perfunctory. The shave was unpleasant and sometimes painful, and my barber left three nicks on my neck. The cucumber gel afterward was a welcome finish.","useful":1,"funny":0,"cool":0},
{"review_id":"nzdrfYMfd1DrPvv54WeWgQ","user_id":"2dZjPtHGkxYW1-XhRgs3zw","business_id":"pDKITbL0no7HPHFodv9jTQ","stars":4,"date":"2017-11-05","text":"Let me get the one big negative out of the way: nowhere in the place are prices shown. Not anywhere. Not on the menu board, not on the counter or the display case or on any kind of sign. Sure, people who own homes in Baby Point can ignore such trivialities, but not the rest of us. More transparency, please!\n\nOtherwise, we love this spot. Bright, airy, and mostly comfortable (except for those metal stools), with exceptional coffee, fascinating and unusual beverages (I tried the tumeric latte most recently) and a great philosophy about environmental respect and quality product.\n\nLocation is a bit out of the way. But while not especially convenient for us, we go anyway. The video screen with updated bus information is a great idea--riders can grab a coffee without worrying about missing their ride. Wifi seems good, music is listenable, and faces are friendly.\n\nWe are looking forward to future visits. Just let us know the prices, okay?","useful":1,"funny":0,"cool":1},
{"review_id":"ON_NF7kkZRKo1hIwIL45zQ","user_id":"2dZjPtHGkxYW1-XhRgs3zw","business_id":"fH7ABat7FDq9Cfkqwac7dA","stars":1,"date":"2013-07-19","text":"They rarely answer their phone. In fact, most times you cannot even leave a voicemail. They responded to emails most of the time but we had to ask every question three times before their responses actually answered anything. Trying to schedule an appointment was nuts. When the day finally arrived nobody showed up. No notice of cancellation, no apology afterwards.","useful":3,"funny":0,"cool":0},
{"review_id":"NDZfcUiDMAgslZdiO0k1IA","user_id":"2dZjPtHGkxYW1-XhRgs3zw","business_id":"O3gEyz6HHR0JKmTYXxXGiQ","stars":3,"date":"2014-07-25","text":"The good: sparkling bathroom and some (but far from all) excellent cleaning elsewhere.\nThe not-so-good: Despite my emphasis on dusting, the tops of picture frames and other obvious surfaces were untouched. Despite my asking for a protective cover over the bed while dusting the ceiling fan above, they dusted right over the bedding. Other specific requests, which I wrote down for them, were forgotten or ignored. Even though a total time for cleaning was arranged, they managed the time badly, taking over an hour on one small room (wasting time on blinds and making the bed). I approved an extra hour but they went beyond that, too, without my approval--and of course charged me for it. Finally, sharing these and other concerns with the company resulted in \"Thanks for your thoughts.\" No adjustment, apology or explanation.","useful":6,"funny":0,"cool":0},
{"review_id":"pkZMvOBI_r5INxO9MqpVbw","user_id":"EyePDepQ3t3WHbwBw19wSw","business_id":"hZfOOdU6Iz4PKiPqx_FUdg","stars":5,"date":"2014-09-06","text":"Just visited this candy store. Excellent selection and very sweet employees. Thank you for an excellent experience.","useful":0,"funny":0,"cool":0},
{"review_id":"63JzFnnn9zhXrLltcB4udA","user_id":"92lje8KiIIzaopSBxOH9IQ","business_id":"aZOH5sJymogR-TXiGsISSg","stars":1,"date":"2010-04-19","text":"In the past I've found them to have a decent selection with fairly good quality, but have been annoyed at their unwillingness to sell smaller filets.  \n\nToday, however, I bought some cod which turned out to be absolutely foul when I got home (about 20 minutes after leaving the store).  I won't go back.","useful":2,"funny":0,"cool":0},
{"review_id":"QrngGCyikPc3y3w4lUcGNA","user_id":"92lje8KiIIzaopSBxOH9IQ","business_id":"8I5U8OQ06nSxX2y4PPOWzQ","stars":3,"date":"2011-02-13","text":"This is some of the better sushi in Toronto, but that's unfortunately not saying much.  I had take-out from Japango this evening, ordering only specials: yellowtail, uni, and horse mackerel.  The yellowtail was good, the uni excellent, but the horse mackerel was dried out and gave off the smell of too-old fish (and yes, I know that mackerel is an oily \"fishy\" fish even when fresh).  The ohitashi side dish featured spinach which hadn't been washed - plenty of crunchy dirt\/sand in there.   I'll wait 'til I go to Vancouver, NYC, Seattle, or Chicago to have sushi again.","useful":0,"funny":0,"cool":0},
{"review_id":"yGTiD0iifQmgUEvlElZTug","user_id":"YHP0BvreV8h3qcACn_VeiA","business_id":"Crisy-zNv58ItIwPEBb0Cw","stars":1,"date":"2015-07-09","text":"I rarely get sick and, when I do, I always get better rather quickly so me going to StatClinix on Tuesday, July 7, was a big deal. I had been having trouble swallowing due to a major sore throat. I kept getting the cold sweats and could not sleep at night due to a cough and would gasp for air. After 2 hours at the Clinic, Dr. Greg Reser said nothing was wrong and to keep taking over-the-counter meds. I told him nothing had been working and that I was headed out of town soon so wanted to treat this before it turned into anything big. To that he said \"come back in 3 days if you aren't better.\" I mentioned to him in 3 days I would be gone for 3 weeks, which he chose to blatantly ignore. So here we are 2 days later and I now have white spots on my tonsils - a major sign of strep which is common in my family. I just got off the phone with the Clinic and they said there is a different doctor I could go see today. I asked how much that would cost and they could not answer. Why would I return to a place that appears to be scamming people for their money? It shouldn't be this hard to receive meds that are desperately needed. If you are feeling ill, I beg you to go elsewhere rather than waste your money here.","useful":0,"funny":0,"cool":0},
{"review_id":"6w95rMg1d2PpPUZXy4rqSQ","user_id":"R-j9DerRXEFqaiTCW6ZSjA","business_id":"KMjpXsJFNiqE18orsi4stQ","stars":4,"date":"2016-11-11","text":"It's a decent airport. I travel mostly domestically so I don't have a large sample pool to pull from. They seem to have the proper amount of retail stores to meet the consumers needs and have helpful vendors once you have checked in.","useful":0,"funny":0,"cool":0},
{"review_id":"hxLcWgJ7etP9AWu46wXJlQ","user_id":"R-j9DerRXEFqaiTCW6ZSjA","business_id":"Dhe_ALaXgp5RY8aW9x5GTg","stars":2,"date":"2017-01-06","text":"Customer service is important so my advice to the girl that served me is to remove your headphones while at work. Sad.","useful":0,"funny":0,"cool":0},
{"review_id":"dm-rQtjVZ-ar6h-vt4Z4tg","user_id":"R-j9DerRXEFqaiTCW6ZSjA","business_id":"KFfETANLhkT_JTFoo4xdHA","stars":5,"date":"2017-07-16","text":"Great stay. Everyone that works there made an extra effort to say hello and ask how the stay is\/was. Food at the restaurant was amazing and the gentleman who served us (Jon) was amazing. Literally the best service I have had in years and I eat out a lot.","useful":0,"funny":0,"cool":0},
{"review_id":"vGTnS8XNif-CALN1U-52sg","user_id":"Ww7BLDwXeMC4Y07n-uaRVA","business_id":"YYWkJwfO1HApuHiW-8eq7Q","stars":1,"date":"2015-08-06","text":"Delivered wrong pizza.  When called, the guy on the phone didn't seem to care.\n\nI can order from any of the thousand other delivery places.  Thanks, Stevie's","useful":0,"funny":0,"cool":0},
{"review_id":"aoIgt2l0-Df1ADnrjdtQXw","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"vw6tHgvieuC2hR-Trmno4A","stars":5,"date":"2017-07-01","text":"Stop searching. Bill is going to be your home inspector. I rarely review but I had to find my login again just to put in this review for FYI Home Inspections.\n\nI did my research with a good number of home inspectors and it was just obvious when calling them they give you the marketing pitch trying to appease you. When I called Bill he was straight up, and the real deal.\n\nI am a buyer who was looking for a new home to live in. I had some unfortunate circumstances arise on my home inspections and Bill went above and beyond in his service to accommodate my situations because he really does care. \n\nHis inspections are thorough and accurate. He finds everything that can be a problem with the house. Trust me I did more than one inspection with him. It's pretty crazy if you join him in the inspection to see how good he is. \n\nI thank Bill for the professionalism and quality of service that he has provided me. I will definitely recommend him to everyone and use him again if I need to do a home inspection. Really I rarely do reviews, just this morning my dentist office asked me to do a quick review on their computer and I was like nah. The lady got mad! Bill was so excellent that it made me want to review him here.","useful":0,"funny":0,"cool":0},
{"review_id":"yR-eN8-u4FTHIaaZgccLtw","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"JgkfjCL1NfMBC_M_hax_3Q","stars":4,"date":"2016-10-24","text":"Extremely overpriced for the amount of food you get. I used to go here all the time. The food was delicious. \n\nWhat changed was the portion of food. Most places increase prices when they need to. Not this place. No, what they did here is a disgusting disservice to the customer. They instead lessened the portion of the food by more than twice it was. It's less than the kids portion compared to some places. Yes! So now if you want the similar portion that you had before, then you have to pay for it twice. I think it would still be less than what one portion was though. Which makes this restaurant now grossly overpriced. \n\nFor example, the last time I went here I had a combo plate that was the beef and chicken teriyaki with spam. I asked for no beef and replace with more spam. This is what I usually used to get. So you know what they gave me? 2 tiny pieces of spam! The chicken portion was also minuscule. And a tiny scoop of rice too, not even a whole scoop. \n\nI eat at many places in Vegas and around the country as I travel all the time. I mostly use yelp to give great reviews for amazing places that need more attention from customers. This place though, I logged in for the first time in a long time to give this one star review. It is that bad compared to what they used to be. It is way more expensive than every Manhattan non-waiter place I have been to, along with Chicago, Boston, Seattle, Miami, Toronto, etc. \n\nGuys, if this portion issue has changed please let me know. I will then try it again and see for myself and update my review accordingly. I used to love this place, but now it just still gets me mad when I think about what I paid for and then got.\n\nUPDATE: May 2017\nI want back again to see if they changed anything. I went back again to see if it was a fluke. It looks like they did raise the portions. Not as big as it used to be but this is much better then before where I gave a one star review. Food was still delicious!","useful":2,"funny":1,"cool":0},
{"review_id":"vLCqQ50Cucf0LcDzKtk4iA","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"BNubIia7rJAqSRxioUZGxg","stars":5,"date":"2013-07-08","text":"Great Lao\/Thai food. Curries are amazing, many of the other dishes are excellent as well.\n\nThe seats at the sides of the restaurant are pretty ripped up, they need to fix that.","useful":1,"funny":0,"cool":0},
{"review_id":"KgWry2oAWljXNnE26hE0jA","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"OOHDPE3tilNC4md8Lcx_4Q","stars":3,"date":"2014-07-19","text":"This place a a regular bland typical Thai restaurant now. Not nearly as good as it used to be with the previous owners.","useful":1,"funny":0,"cool":0},
{"review_id":"nISrNg37MlUFaa54-dQi9g","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"95CCHowiE0W_ovv5-9lQAQ","stars":5,"date":"2013-07-08","text":"Burgers better than In-n-Out, Fatburger, or any place I have ever been to. The burritos are good, and the pizza is really good. Try their mushroom pizza it is great!\n\nDon't listen to what these pansy weenies say, this area is not unsafe at all, even at night.","useful":0,"funny":0,"cool":0},
{"review_id":"O16km1usO6K52QKxZ48wIQ","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"EvxTD0ETbbFbFjUMWhHbIw","stars":5,"date":"2017-08-04","text":"This is great authentic Japanese curry! I have been going here for a while and it is delicious every time. I mainly eat the chicken cutlet or the curry udon. I went to Japan a few months ago and had curry several times while there, specifically Tokyo. Like around Shinjuku and Akihabara. I have eaten here before going to Japan and it was awesome but now that I have been to Japan I can say that it is authentic. It wasn't too far from how delicious the curry was in Japan. The owner is a cool guy too. I think I remember him saying he is from Akihabara.\n\nHere in Vegas you probably won't find a Japanese curry as good as here, so take advantage!","useful":0,"funny":1,"cool":0},
{"review_id":"GO3eSfGkvlEikgnGL4f0PA","user_id":"0M5eh7SDDq8sXQE3GpKGdA","business_id":"xjlMlnxWqMd3FGODA_z1NA","stars":5,"date":"2013-07-08","text":"Best Chinese food in this side of town. Almost everything is great. Their take-out and delivery is extremely fast. The only dish that is not great is the Pad Thai, it is pretty bad to be honest. Other than that though the quality of the food surpasses any other Chinese place around here. Price is more like 1 and a half $'s.","useful":0,"funny":0,"cool":0},
{"review_id":"CBS_895f1shcQyN7QuSHoA","user_id":"0K8nqZxNeyocDWOMtAK8Lw","business_id":"HHCn1akqIpl_BhdcJoYPbw","stars":5,"date":"2015-06-25","text":"Good food. Fresh ingredients, well prepared. The Pho has a wonderful broth, and the spring rolls were some of the best I've had. Comfortable environment. Friendly staff. Good value.","useful":0,"funny":0,"cool":0},
{"review_id":"WzhRF_zgUuzNWYFTBiPfww","user_id":"5Qfy8e5yFI7eIBbsInfA-A","business_id":"ulj7RLyX3hz2Imn23iSMRw","stars":5,"date":"2011-03-07","text":"I purchased a short sale property in Equestrian and needed a VERY reliable and thorough inspector to make sure I knew what I was getting into. I had used Tim O'Neall once before so I gave him a call. He was extremely professional (arrived on time, discussed rates and services up front) and then an absolutely amazing and thorough job inspecting my potential home. Armed with a book of information from the major (A\/C units) to the minor (cracked switch plates, bad doorbell) provided by Tim, I was able to negotiate a better price on my house, AND (more importantly) to know exactly what I was getting into. We've been here for over 2 years now, and I can honestly say that I probably would not have made the leap had I not been armed with the confidence that Tim's inspection and report provided me. I would (and have) recommend Tim to anyone in Phoenix who ever needs a home inspection.","useful":2,"funny":0,"cool":0},
{"review_id":"hiVRVStaE8GPEPnkTY2Pvg","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"vUDqNV3RhI3FmZRwS7039g","stars":5,"date":"2010-12-02","text":"Took the girl for our 3 year anniversary, and more after! Love it, great food and people. Excellent pricing.","useful":19,"funny":0,"cool":18},
{"review_id":"c9377k8OoSD12WSN4bSf5A","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"6--gCQ9zYrIMW-VsOM7XdQ","stars":5,"date":"2010-12-02","text":"mmmmmmmm, as close to NY pizza as I have found. excellent toppings, great pricing.","useful":1,"funny":0,"cool":0},
{"review_id":"ASK_WiFIvRqmbYApANd8yQ","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"-YR7K3rw6VAQ1-MjslvsoQ","stars":5,"date":"2010-12-02","text":"I have been eating here for years, people are great and I've never had a less-than-excellent plate! Great amount of food in the bento box!","useful":0,"funny":0,"cool":0},
{"review_id":"YrCN1ZrrNogVZkBaP5zqgg","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"SVMR0kRmdd-bbSNTTECJBA","stars":4,"date":"2010-12-02","text":"real chinese food, excellent price","useful":0,"funny":0,"cool":1},
{"review_id":"Me6szunYC7AXAhh88C7JHg","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"OwZM33ZI8LZVknaLICWIhw","stars":4,"date":"2010-12-02","text":"Zaytoon is dope! Love havin this in the area now.","useful":0,"funny":0,"cool":0},
{"review_id":"KLqksKiWNngsz1W29Re9tQ","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"2OkYkQRItlqbKw9Mz7flCA","stars":4,"date":"2010-12-02","text":"Burritooooooo lunch special!!!!! awesome, tons of chips and salsa","useful":0,"funny":0,"cool":0},
{"review_id":"l8PwYIAlGOR5MC4zpqsHug","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"YiuI4YHJnrl9898gE50_ow","stars":1,"date":"2010-12-02","text":"gross food, okay atmosphere.","useful":2,"funny":0,"cool":0},
{"review_id":"W-y4ngXm6PNThCy6Vmiq9Q","user_id":"GNg2UcS6fUBB9n7lZABpUQ","business_id":"xvrkd0c5E7sl9KuY-IMHIA","stars":1,"date":"2010-12-02","text":"When i used to get off at midnight I'd go here. almost every time the tacos were messed up and thrown together, order messed up multiple times.","useful":2,"funny":0,"cool":0},
{"review_id":"_9253AU645cMYO40B7G8ig","user_id":"jDl-B8C2ZMCyoT12RgXg4Q","business_id":"DN0b4Un8--Uf6SEWLeh0UA","stars":4,"date":"2014-01-31","text":"Let's be honest, with out Kitchen Nightmares I would have no idea ABC existed.  I had called ahead of time to book a table, Samy said to just stop in and would take care of us. A couple hours later we had shown up, and he knew it was me who called... Very personal! We had a table for 4. It was very quite, the music was at a good volume. I had the Chicken Alfredo and flat bread. It was excellent. 5 plates of food for around $70, I thought it was a good price! Go try it out!","useful":3,"funny":12,"cool":0},
{"review_id":"eX_AtaU9X5xcJ_oN32txqw","user_id":"2wnghwWajfhP1NPLarGQbg","business_id":"SxC7gGLEZ8B3ooj1Qtjz5w","stars":1,"date":"2015-06-22","text":"What a huge waste never ever again coming taste like world class garbage!! Customer service sucked!! Very dirty inside and undercooked pizza the by far the most despicable place on earth don't waste your valuable time going to this shit hole.","useful":0,"funny":0,"cool":0},
{"review_id":"2op8bXQtoZN193eQv7cEpg","user_id":"Wtch4BGa-gYbHkmamaBR-Q","business_id":"V6rzs-QgnuW1CdOn-23nNw","stars":5,"date":"2015-06-18","text":"Everything here was delicious.  Fish, shrimp, fries, potato salad, tartar sauce.  Everything.  Everytime I come to Vegas, this will be a definite stop.","useful":0,"funny":0,"cool":0},
{"review_id":"Hx0RiVudkDxHhVlmV8LDAg","user_id":"FuT1iF6Kqk_FXtoBG7p5WA","business_id":"FsCujpVh9Za2Dl5MIYLCxA","stars":5,"date":"2016-07-30","text":"Great food and excellent service. The Chirashi bowl was well presented and filling. Fish was bold colored and fresh tasting! The clam hot pot was more than enough food for one person with plenty of clams. The meatball and chicken skewers were crispy and tender. The pork was very good as well, but a little tougher than the chicken and meatballs. \n\nWarm and comfortable ambience, attentive and pleasant service, and very good food. Can't wait to come back and try other dishes!","useful":0,"funny":0,"cool":0},
{"review_id":"VDQ2N_bhpVohs6473DhYBQ","user_id":"FuT1iF6Kqk_FXtoBG7p5WA","business_id":"gQestnRT9AgSdDMsh83aDw","stars":5,"date":"2017-01-13","text":"I've gotten my haircut by Fatima for as long as I can remember. What's she's done with the salon has transformed the place into a relaxed yet professional atmosphere. She always makes sure you get exactly what you want and you leave looking beautiful and confident! She has years of experience doing both men and women's hair - I brought my boyfriend in and he loved his haircut also! Her prices are incredibly reasonable and she offers great deals on styling products. I've recommended her to my friends and family and no one has left disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"kT6oKXiD9PbXNV2YiqNgyA","user_id":"Pkpjl2LAFzZNcnN7xr0kyw","business_id":"bud7jZeGsrzv_3un3ov-mw","stars":1,"date":"2016-04-22","text":"Ive been going here for a while (regularly), but lately I haven't seen the owner and it seems like theyve endlessly been rotating deadbeat employees through there. They're screwing up a ton of orders, and they oftentimes dont know the specials or how to run the register....not to mention theyre unprofessional. This place is going downhill QUICK and it's a shame.","useful":1,"funny":0,"cool":1},
{"review_id":"qKAazjV3FO3GkKabrkEvFw","user_id":"Pkpjl2LAFzZNcnN7xr0kyw","business_id":"dTu69dJYUrxkJ4tg_48E-A","stars":1,"date":"2015-10-08","text":"Is it just me, or does the staff at Trax Farms have a terrible attitude? Dont get me wrong, its not EVERYONE there....but in general, everyone just seems so miserable. In my experience, the staff usually reflects the attitude of management\/ownership....so that cant be a good sign. Ive been going there since I was a toddler,  Ive been there more recently because we moved into the area. Im so disappointed. Not only is it expensive (which I was willing to deal with), but now I have to deal with a snooty staff that seems annoyed by every interaction or order. Maybe its because Trax is now out of the farming\/customer service business and more into the Gas\/Oil business? Oh well. Simmons and Bebout are right up the road and theyre definitely more welcoming.","useful":4,"funny":0,"cool":0},
{"review_id":"2wu0XQ8vzpsKyrEOwLkjdw","user_id":"Pkpjl2LAFzZNcnN7xr0kyw","business_id":"ENozGtAboCM-4OMjGqbWzg","stars":1,"date":"2015-01-26","text":"My wife recently took our puppy to Brush Run animal clinic and the Vet there told my wife to feed our puppy Milo \"any of the dog foods in the grocery store...the natural foods out there are just a scam\" Uhhh really?? Milo just went in for vaccinations and they gave him rabies, dap, and lepto all at once...then sent her on her way. No warnings, No \"what to look for\"...just collect their $$ and send you on your way. After observing Milo being lethargic and reading about what may becausing the discharge from his eyes (formaldehyde,mercury in the 5-8 vaccines that he received at once), Ive decided to research other Vets in the area and take our puppy elsewhere.","useful":8,"funny":0,"cool":0},
{"review_id":"ShOi4adb5lglrvqCTBrkZw","user_id":"QGMJBM1I7F4LTVpuXeCsBg","business_id":"1uPQTz5XZSWr0ti7kUpaDw","stars":4,"date":"2014-11-26","text":"Yep, it was pretty good. The dumplings were by far the best I've ever had. They also take credit\/debit as well as cash, which was really convenient. Right in the heart of Chinatown. We got a plate of pork dumplings each, and were pretty pleased with our last minute dinner decision. Would recommend to dumpling snobs.","useful":0,"funny":0,"cool":0},
{"review_id":"z1GtRyldAQn7i3VO0MU6vQ","user_id":"QGMJBM1I7F4LTVpuXeCsBg","business_id":"66LvqsvQ3niOFqJIPnT7iA","stars":5,"date":"2014-11-24","text":"Great ambience, great poutine. Couldn't have asked for more. Nice find in a fun area!","useful":0,"funny":0,"cool":0},
{"review_id":"NR6cAGxeL3TA2i3Vvmzc8A","user_id":"QGMJBM1I7F4LTVpuXeCsBg","business_id":"DmdtVBgXWk285nAUWXfvvw","stars":5,"date":"2014-11-26","text":"Awesome hotel. Super modern, very friendly bilingual staff, nice location. The parking situation in the city is not the best of course, but for just a few dollars more than public parking. They will valet park your car- totally worth it. Oh, and good, speedy free wifi. We probably won't visit Montreal again, but if we did, we would go back to this hotel. Great experience!","useful":0,"funny":0,"cool":0},
{"review_id":"UHalz6MvqToEapEPvYWO9A","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"N4PfU2vuSULaQej5fEiJfQ","stars":5,"date":"2016-09-22","text":"I still love this sushi house.  We visit a couple times a month over the last three-ish years and it's still awesome.  I can't believe we're lucky enough to have great sushi in our neighbourhood.","useful":0,"funny":0,"cool":0},
{"review_id":"lzRT-zi_nI5ip2OfPV184g","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"_3okFFTRYFAWppgIWHO55g","stars":5,"date":"2016-01-27","text":"Excellent Brazilian Steakhouse.  13 different kinds of meat, hot & cold buffet items that are fantastic and dessert buffet my hubby squeezed in at the end.  I was too stuffed to partake in dessert but it looked very yummy.   I've been to the other Brazilian places in town and this one shot to the top for us.  We considered keeping this place secret but we just can't...it's that good.  Great service and wonderful ambiance rounded out this visit.  We will be back.  Highly recommend!","useful":1,"funny":1,"cool":2},
{"review_id":"kd-nw5djwARVtQqV9GADJw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"3cNQbAHw-cjad0iDFWyckw","stars":4,"date":"2013-11-09","text":"You never know what kind of beer will be on top. If you love trying beers you don't see on a regular basis, go to Beer Revolution!  The beer list changes right before you eyes.  Food is a good complement (pizza is awesome) but you really go here for the beer experience.","useful":0,"funny":0,"cool":0},
{"review_id":"ltOfDDhp8Yio3tfd1X2aAQ","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"L8RL98g2U9SNQAG8zo-AeQ","stars":4,"date":"2013-11-09","text":"Went for Hubby's birthday and had a wonderful experience.  \n\nWe had the Cold Smoked Elk Carpaccio, Pickled Blueberries, First Pressed Canola & Foie Gras Parfait, Apple Bourbon Gele, Compressed Apple to start.  Excellent choices!  I'm not a pate fan but the Foie Gras was fabulous.  \n\nFor dinner, Hubby had the Seared Halibut, White Bean and Chorizo Ragout, Clams, Blistered Cherry Tomato Sauce Vierge and I had the Birch Smoked Duck Breast, Steel Cut Oat and Mushroom Risotto, Braised Red Cabbage, Natural Duck Jus.  Absolutely delicious!  \n\nAnd we ended with Brie Cheesecake, Poppy Seed Honey, Raspberry Fluid Gel - yeah, not so much. I love Brie and I love cheesecake but together, not so fabulous.  Just not my taste I guess.\n\nAll in all, a great experience I would definitely repeat.","useful":0,"funny":0,"cool":0},
{"review_id":"5NWbVjklItWjKYaIbq1Vaw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"ok9aqOA69H4XbF18ekAm7w","stars":4,"date":"2014-05-15","text":"Great pho, awesome spring rolls.  Hubby loved the Thai Satay Chicken soup.  Service was fantastic!  Definitely will be going back often.","useful":0,"funny":0,"cool":0},
{"review_id":"6MWtJqYZV2imBJ9FBM-rfA","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"2v2i723WVjWAvkxmGpCWZA","stars":1,"date":"2014-07-20","text":"Not pleased with the sneaky upsale.  I haven't had nails for years and I wanted to treat myself. I wanted acrylic but apparently \"acrylic\" sounds like UV gel with shellac.  They started with acrylic tips and I'd never had gel before so I didn't know what they were doing until it was too late.  Wasn't pleased with the gel nails either - super thick and they were totally skimpy with the nail colour.  I will never again get gel nails and I certainly won't be back where I don't get what I asked for in the first place.  They completely ignored what I asked for and put the most expensive nail service they have on me.  It wasn't until I paid that I knew exactly what service I had received.  Not impressed!","useful":7,"funny":2,"cool":0},
{"review_id":"CKbSbz5EHZQVNN0N13OLVw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"GpfShLAU12CS5f2Tnt79qQ","stars":5,"date":"2014-04-26","text":"YUM!!  I've been searching for a Pho spot for awhile now.  Nothing compares to this place. I had the #2-Rare Beef Pho and hubby had A-Sate Chicken.  Broth was excellent and flavourful. Hubby said it's the best Sate he's ever had and the shredded chicken just melted in his mouth.  He loved it so much, it brought tears to his eyes.  Service was wonderful as well.  If you love Pho, you need to come here!  Do it!","useful":0,"funny":0,"cool":0},
{"review_id":"4It-13zVL9fNhh8cdRVSXw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"y29RQhchhzuCYeh6o9STJw","stars":5,"date":"2014-03-03","text":"O-M-G!  I used to go for brunch with my mother at the Inn at Lake Bonavista.  Lets just say, I've come home again!  I wanted the brunch at The Lake House to take me back to all those years of wonderful brunch in a spectacular environment.  I was definitely not disappointed.  The two different kinds of eggs benny had me giddy - I chose one and my Mother chose the other - both are fantabulous!  My hubby and stepfather chose the brisket which both spoke very highly of.  The blood orange mimosas were fantastic and the sticky toffee pudding was divine.  We will definitely be back sooner rather than later.  I can't wait to have dinner!","useful":0,"funny":1,"cool":0},
{"review_id":"hojz-_qNzSCCDq-suZaSXw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"NqPwsLBzXeSKpn_ofotLMA","stars":5,"date":"2013-10-27","text":"I love this place!  When I have a hankering for the best burrito in town, Mucho Burrito is the only place I go.  I usually have a regular barbacoa (shredded beef) burrito with brown rice, black beans, sauted veggies and lots of extra cilantro on a whole wheat tortilla...YUM!  I've been here several times and I'm never disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"zHSziMhlhlfn-V1zRdHYzA","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"3XmeCcAHdQwdEUh71SFMTQ","stars":3,"date":"2013-10-23","text":"After desperately searching for good pho and reading these reviews, I thought I'd give this little place a try.  Staff was awesome but the pho and spring rolls...not so much.  I always order the rare beef pho wherever I go. I'm not a big fan of fatty beef but I had to order the one with the fatty brisket to get my rare beef.  Broth was different than I've had before and pretty good - had a nutmeg like taste to it.  Little disappointed there were no basil leaves to add though.  The spring rolls were meh and the shrimp salad rolls were empty - three shrimp, some noodles and a sprig of lettuce (I mean sprig too).  All in all, wasn't horrible, just meh.","useful":0,"funny":0,"cool":0},
{"review_id":"TwDpbDMOE8ByK0lnm_-bLQ","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"QtwLIj50i-BwvpjfDU-p9g","stars":5,"date":"2016-09-22","text":"Kildare's is our go-to pub.  It's not even in our neighborhood but worth the drive.  Food is great, beer is awesome, staff is fabulous.  We sit at the bar so our service is always fantastic.  I have not experienced the inattentive staff issues mentioned in other reviews.  My food is never cold, which was also mentioned in other reviews.  If it was, I would send it back and give them a chance to correct before mentioning it in a review.  Never had a problem with the service or food.  I highly recommend this pub to everyone I meet.","useful":0,"funny":0,"cool":0},
{"review_id":"pmj_oSfRGZarltVQABWmyQ","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"BwsCT0lTopCrTDB3zMw8_w","stars":5,"date":"2017-06-09","text":"I've been going to Bolsa for a few years now and I just realized I've never written a review for it.  I love Bolsa. I usually get beef pho with a side of spring rolls.  Yum!  But recently, I've branched out and tried other things on the menu. My favourite so far has to be Happy's Coconut Rice - phenomenal.  And the homemade hoisin sauce is outstanding - I don't like sweet very much and the sauce has just enough sweet without going overboard.  I introduced some friends to Bolsa and now it seems Bolsa gets picked whenever someone celebrates a birthday.  Highly recommend Bolsa!","useful":0,"funny":0,"cool":0},
{"review_id":"nEnrnpqxRREnlt2f87OEyw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"Xc9g9DgNti4UnBNYvIPFZA","stars":4,"date":"2013-10-14","text":"Not my favourite Pho house but more than adequate.  Helps it's also in one of my favourite shopping areas.  My usual is spring rolls and rare beef pho.  I never leave unsatisfied and it's definitely good value for my money.  Definitely recommend if good, decent pho is what you're craving.","useful":0,"funny":0,"cool":0},
{"review_id":"6YbiVH7H8gmHT3UHzs7yWA","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"-ccmPDvaDFx5TbdKB1rgCA","stars":5,"date":"2013-11-09","text":"This is my local Joe's and I love coming here.  I've had various menu items and I have never been disappointed.  When I'm looking for some comfort food and a good beer, this is one of my first choices.  Staff is always friendly and fast.  Never had a bad or meh experience.","useful":0,"funny":0,"cool":0},
{"review_id":"Wx8_XUtoyyeaVwbfgVssBg","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"QiRWdm4GkmtEMO_npOyBjA","stars":5,"date":"2016-09-16","text":"Excellent Chinese restaurant.  Food was fast, hot and delicious.  We had ginger fried beef, moo goo gai pan and mushroom fried rice.  Everything was fantastic.  Service was great and the bill was decent.  Lots of pickups while we were eating so the food is definitely popular.  I think we've found our new \"local\" Chinese restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"fhhHsaEO-TEkVyojvXJueA","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"SYhiOIAvxBNHt5QEQpu8dg","stars":5,"date":"2013-10-14","text":"We went to Avec Bistro for our anniversary in June 2013 and it was beyond our expectations. The food was fabulous and the service was exceptional.  I had the duck and my husband had the lamb. Both were outstanding - I really dislike lamb but this was so good, even I would order the lamb.  We had some questions about wine pairings and suggestions given by our waitress were bang on. Everything about Avec Bistro gave us such a fantastic meal experience that we will definitely be back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"QJfA_0kBNbtxIRsfp6jINQ","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"jg37O7ANF7hqggS6bxUpcQ","stars":4,"date":"2013-10-14","text":"We've had Pho at different places all over the city.  When I want Pho, this is where I want to go. I don't know their secret but I love the spring rolls and rare beef pho made here. Nothing else seems to compare for me.  We will drive across the city to go here for inexpensive, fantastic Pho!","useful":1,"funny":0,"cool":0},
{"review_id":"3Dg6ScfD4LyHNStypoUGbw","user_id":"_O1ALDAM8lMoLxISeTdrfA","business_id":"vsTNApse_Wsw61Od9YOZqQ","stars":4,"date":"2014-03-03","text":"I've been searching for some decent Pho in the south part of Calgary.  Out of all the places I've tried, this one is the best by far (although, still not my favourite).  When I get a hankering for rare beef pho with a side of spring rolls, this is where I'll be going...at least until I find that elusive favourite.  Still, will worth it and the staff is very friendly.","useful":1,"funny":0,"cool":0},
{"review_id":"dArMOJ0zXmYJM3Of445PcA","user_id":"AghsuAk_wAJdMpaVMG_g2g","business_id":"AwcBjh66yGOnao4SUHCW9g","stars":4,"date":"2016-09-02","text":"Ate the Thursday special,  Philly cheese Steak and it was good.  Really liked the entertainment by Chuck DeFloria.  He had several musicians join him. It was fun!","useful":0,"funny":0,"cool":0},
{"review_id":"kIe-KtyjSM_l6xuVVE_3pQ","user_id":"r7y3_l5gqKPLvmbSTzAiUw","business_id":"uU1VdmqO6UTCiRgbhQrbsg","stars":5,"date":"2013-03-07","text":"Le restaurant Le Nil Bleu est non seulement trs bien dcor, mais il possde galement un service impeccable, rapide et des plats savoureux qui font de cette premire rencontre avec la cuisine thiopienne, une exprience formidable.\n\nBravo et a trs bientt","useful":1,"funny":0,"cool":0},
{"review_id":"zsBGrBpKejl2Y_r0qbvZHA","user_id":"qI9WTIXOi2OTSG4bsc55fw","business_id":"B6xVgae6x4Xm5wVNrxaHiw","stars":5,"date":"2016-09-14","text":"We came tonight and was immediately greeted warmly by the manager that took us to our table. Good was amazing and we look forward to every visit","useful":0,"funny":0,"cool":0},
{"review_id":"_91fcH_RNLDfNVF8HHPOJA","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"0NhylBPrcpXUXZmqZL4T7w","stars":5,"date":"2011-06-21","text":"I get my 4 yr old \"chocolate meatballs\" aka munchkins every 2 weeks or so, and we've always had nothing but fast, friendly service!","useful":0,"funny":0,"cool":0},
{"review_id":"OqWTtSaJreN26dMbS8gjVQ","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"Z5refCiM2cM1FIOAwFpiOA","stars":1,"date":"2011-06-21","text":"Went in on a friday night, we were seated in a far corner away from everyone else, our waitress kept forgetting about us, didn't want to get us refills, my husbands limeade was nasty, and we could see our food sitting in window for the longest time, with so many other restaurants in the area, we won't go back","useful":2,"funny":0,"cool":0},
{"review_id":"u24TWNv9v2GURgTuWs_eZw","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"SIVi2UQp1UT0lMIoqHP0QA","stars":1,"date":"2011-12-18","text":"This was our 4th rainforest cafe we have visited. My son picked it for his 5th birthday dinner, worst rainforest expierence ever! Our waitress was very rude, our order was incorrect twice, and she kept making it worse, by screwing it up more, I didn't realize a plain cheeseburger was so hard! For a $200 bill I didn't realize we would have to beg so much for re-fills and correct food. My son enjoyed it, and at the end of the day that was what was important, however next year I'll talk him into something else!!","useful":3,"funny":1,"cool":1},
{"review_id":"wDDPNOfHd7PNt1NJSvhWAw","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"Z80FU36I1zaY5Dhk0IzKSQ","stars":5,"date":"2012-03-15","text":"I've had a po box here since August 2011, the owner has always been super friendly, always pulls my packages before I even get to my box! Great service!","useful":0,"funny":0,"cool":0},
{"review_id":"9VWrWdzdx2GITrTaOiGMrA","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"aAIKXfz-86Vki8ValH94JA","stars":1,"date":"2011-12-18","text":"The manager is rude, my order is never correct, it really isn't hard to leave ice out of a drink people, the machine does it for you if you ring it up correct! 2 out of 3 times my kids food is wrong. I now avoid this location!","useful":0,"funny":0,"cool":0},
{"review_id":"jp0dRTDMjFTcLuT4UjezQw","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"cySdzchfe6fIJE84JeoeEw","stars":5,"date":"2011-06-29","text":"Went in for our 2nd visit, more people working, fast service, much better this time around!","useful":0,"funny":0,"cool":1},
{"review_id":"RR3DMYTGYJZjtMl0bY1qaA","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"0W_pPAiTXgazY2mtX6o0_w","stars":1,"date":"2015-08-02","text":"We haven't been to one in years, we were sadly disappointed. Our burgers were still pretty pink in the middle, and with 4 children, that was not a good thing. Fries were cold, our food sat in the window for the longest time because they couldn't figure out if our order was ready or not. Not impressed with the place at all.","useful":0,"funny":1,"cool":0},
{"review_id":"q97bXo1OQSBdxV7jxQnFag","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"AtraBpfwzuom-yBGPTQeMg","stars":2,"date":"2011-06-21","text":"Food was just okay, no employees were monitoring the games or rides, kids were climbing on and spinning on a ride that was broken and a teenage girl ran into my 4 yr old while running around in a circle to spin the broken ride, by this time I was extrememly angry and dragged a manager out to tape it up with caution signs, we will not go back.","useful":1,"funny":0,"cool":0},
{"review_id":"x-R2dKw7T9oD8KSf-JjN0g","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"MBekdd_f7S1ezEzZb3o_ZA","stars":5,"date":"2016-04-07","text":"One of our favorite cupcake shops! My kids and I love them, and we are cupcake snobs!","useful":1,"funny":0,"cool":0},
{"review_id":"uZummx7_bdkLGFJrUQU_FQ","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"E_wLJ3w5QTMN_Bz3O99ZYQ","stars":1,"date":"2011-06-25","text":"We went in on a Wed night hoping theyd be like a steak and shake. After sitting in our booth for 15 minutes being ignored, we sent one of the kids to the counter asking where to order at. another 5 minutes passes and a waiter comes to the table, service was slow, we had to beg for drink refills, 1 of the kids meals was made wrong, and my 15 yr old brother ordered bbq wings from the appetizer section and they brought him chicken strips and fries, he ate that because he didn't want to wait even longer then we had. We won't go back. Tried it once, and that was enough,  a shame the food sucks because my husband really liked his shake!","useful":0,"funny":0,"cool":0},
{"review_id":"AkxFYgrEaLodF8MwMn4h9Q","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"7o61DDMJ1noIlDbjY-McEA","stars":5,"date":"2011-12-18","text":"my son loves the splash pad! His dad or uncles stay with him at the playground while I can run in the store or two that I need to! There are quite a few empty retail spots, hopefully they can get some new stores in there as well,","useful":0,"funny":0,"cool":0},
{"review_id":"irTY1eLOYtqymQXDGDYNFg","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"BX7wQ6k0oamZToox6mAzHw","stars":5,"date":"2011-12-18","text":"Very wide variety of products, staff is very helpful and friendly!! I was there picking up a present for my kids and the staff was very helpful with showing me everything I would need for the cotton candy machine!","useful":0,"funny":0,"cool":0},
{"review_id":"I5qgJXvtOP90mGxW-9pEnw","user_id":"pai0Ky1_xNGZebw0VzyJVw","business_id":"BJLhJdmhUxV95BHAxZluzA","stars":1,"date":"2011-06-20","text":"Went last week, and ordered a dozen variety. I didn't care for any of them, very dry, the frosting wasn't very good,even my 9 yr old daughter spit her cupcake out!","useful":0,"funny":1,"cool":0},
{"review_id":"kSGa7LDrJ1XoAIl0V3vWNA","user_id":"gENP-H3lLEfQ_7vHgswGjg","business_id":"6NwkKX8VvN3Nnn-ANISBrQ","stars":5,"date":"2015-04-16","text":"Amy H. was great. She was very accommodating and willing to give input while keeping your preferences at the forefront of the appointment. I received a cut and partial highlights and found the prices extremely reasonable. I would definitely be a regular if I didn't live on the East Coast!","useful":1,"funny":0,"cool":0},
{"review_id":"6_l7pMuTfLJQFCLNfkdw1A","user_id":"lB8oFp7FSd2Ni-86AJ4puw","business_id":"09hXjMwfHxWpiOqYj08zwQ","stars":4,"date":"2011-12-12","text":"They do a great job for kids birthday parties.  We had the girls party there this weekend at 10am.  Kids wore pajamas and had a blast.  Tons of art projects followed by sprinkle donuts.  Good value and super easy!","useful":0,"funny":0,"cool":0},
{"review_id":"HfbkGOv16SF4XGrYQWENdA","user_id":"lB8oFp7FSd2Ni-86AJ4puw","business_id":"37XExTruLjOLqnTERYy8aw","stars":4,"date":"2011-06-25","text":"Big fan.  Rarely in town enough to get by as regularly as I used to but I stick the soup for lunch.  #1 extra spicy!  The level of spice is all in the technique of the person serving the soup.  My wife loves the hibachi and you can't beat the price.  Quick service.","useful":1,"funny":0,"cool":1},
{"review_id":"mgn68vlcCaY7-_g4l3wQig","user_id":"lB8oFp7FSd2Ni-86AJ4puw","business_id":"01fuY2NNscttoTxOYbuZXw","stars":3,"date":"2011-06-25","text":"Fried pickles and pimiento cheese fries to start for the table.  May have been overkill but they were pretty good.  Burgers were the main entree and hit the spot.  Small parking lot, but service was good.","useful":1,"funny":1,"cool":1},
{"review_id":"GkCug02cOIGmv9EHFsi4lA","user_id":"lB8oFp7FSd2Ni-86AJ4puw","business_id":"1HgcjCu6GRG8K64ZBpiIlQ","stars":5,"date":"2014-03-11","text":"My man does it again.  Have taken 5 jackets to him now to tailor.  He has advised me on brands to buy that fit my build, told me to pass on tailoring pieces that will never fit me correctly, and repeatedly deliver quality work.  Highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"SoNJHJCgCQOO4zvE_GKUow","user_id":"AUklKv72Mk8UuBRZposRoQ","business_id":"SSCH4Z2gw-hh2KZy7aH4qw","stars":5,"date":"2016-05-23","text":"Tried WORTH on a whim after seeing other Yelp reviews.  Had the Chicken Veggie Hash for lunch, which was *amazing*!  It comes with \"roasted seasonal vegetables\" which happened to be sweet potatoes and asparagus.  DELICIOUS!  \n\nAnother bonus is that they offer GLUTEN FREE options for the sandwiches.  Any sandwich can be served without bread over a bed of greens and sweet potatoes (excluding grilled cheese).  \n\nGive it a try, it's WORTH it!","useful":1,"funny":0,"cool":0},
{"review_id":"TlXaxbTi_1H59YYKQ24KmA","user_id":"-vb35fHnGBBTsLgNkPaMYQ","business_id":"SrMFEb6ZjJ-E6xL8RDkC8Q","stars":5,"date":"2016-09-07","text":"Great place! Chris (the owner) was rock solid. The store is relatively small, but what it lacks in size it makes up for in product quality and excellent customer service. The mattresses and adjustable frames are top notch and the prices are affordable. My fiance and I looked pretty much everywhere before stepping foot in Mattress 360. I'm glad we waited. Sleeping like a log!","useful":0,"funny":0,"cool":0},
{"review_id":"DSdwAr9iE5dMhMj3bQwaAQ","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"SzcCJJmreMlWCsNjupdVAA","stars":2,"date":"2013-07-23","text":"Service was great, and the food was tasty, but I had an experience that left a bad taste in my mouth. My bill came out to $23 and some change, and I paid cash with two $20 bills. When the server came to take my payment, he asked if I wanted change.... really. Sorry, bud, it was good, but not tipping 75% good. Then, when he brings me my change, he kept the coins for himself and gave me only the bills. If this is customary at upscale restaurants (or those that are trying to be) then I'm not \"A-OK\" with that, and that's why I'm giving L'Albatros a 2-star rating. I wasn't going to make a scene over 70 cents in front of my party, but I needed to share this experience so others are aware.","useful":0,"funny":0,"cool":0},
{"review_id":"t8jcwiMS3u0e7V6sf4k_Cw","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"Xny0n0s98TpP82sQxfgIMQ","stars":4,"date":"2011-07-16","text":"Delicious food and comfortable atmosphere. The cafeteria-style line is different but it made the experience unique. The piano player was a nice touch. My only complaint is the price tag - they have no servers but the final cost is a bit high for what you get, almost as if they've added in a gratuity anyway. 15% cheaper fare would get 5-stars from me.","useful":0,"funny":0,"cool":0},
{"review_id":"bki9-sFKr7zL9VAfJBYb-w","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"G_0sCzrx1lorflpihImUag","stars":5,"date":"2011-07-16","text":"Old Man Bar is the best. Perhaps it's not for everyone but there is no better weekday bar than OMB. Weekends can be a different story - during the summers the clientele tends to be 30-to-40-something \"guidos\" on Friday and Saturday night - but for the rest of the week it's a great place to drink. Mike and Keith are funny, friendly, and generous. Best bartenders ever!","useful":0,"funny":0,"cool":0},
{"review_id":"pe3CdngIPi5Yj3wD-V7vqw","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"wzj2cMpiDJW0HB3iCvCOYA","stars":4,"date":"2011-11-28","text":"Lots of choices on tap for beers for good prices.. they also change out their selections pretty regularly. Food is iffy (the corned beef hash is the diamond in the rough) and a strange smell emanates from this place. Bartenders are pretty friendly.","useful":0,"funny":0,"cool":1},
{"review_id":"2M8BmNI744o33z-EHsGveQ","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"IPrtHNKwLERUKvYJGDOHtg","stars":1,"date":"2011-07-16","text":"Party of two, but didn't get noticed until over 20 minutes after we got seated and the food took well over an hour to reach us. The food was good, but not worth the wait or the price tag. The problem is the management - only one waitress worked the entire floor on a weekend evening! She had a couple bussers to help but it wasn't enough. Unless I hear that things have changed, I'll never go back.","useful":2,"funny":0,"cool":0},
{"review_id":"sVcerwmoBFgwXpB0KRhBqA","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"p9wsRYjSo4yIb14ijaNEnA","stars":4,"date":"2011-03-02","text":"I've been to Falafel at various times and days but the service remains consistently good. It usually takes just over 5 minutes for me to get my meal and never more than 10. The cost for a full meal - e.g. a bowl of soup, a sandwich, and a drink - is pretty good (~$10), and they have daily specials which are even cheaper. I've not had a bad experience here.\n\nMy only complaints, albeit minor, are a) that the sandwich wraps tend to be a little juicy\/greasy for my liking; b) they generally won't bring you refills unless you go to the front counter or ask them as they walk through the dining room.","useful":0,"funny":0,"cool":0},
{"review_id":"nPYZRvOFxoN3xcg3jEPeOA","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"mTcPc9rE43XrG05RQOjnWw","stars":4,"date":"2012-02-10","text":"Many good things to say about Zanzibar. My exposure to their entire menu is limited, but what I had was delicious. You have to get the walleye cakes! Their chicken and cornbread is also very good. The kool-aid is overpriced but it is delicious.\n\nThe waitstaff was professional and the atmosphere is very relaxed.\n\nPrice tag is pretty good considering the amount and quality of the food you get.\n\nMy only complaint is the speed of service, but I haven't been there enough times to really deduct points because of it (may have been isolated incidences).\n\nedit: I've been a few more times, and the speed or service hasn't really changed. They dining room temperature is also a little too toasty for my liking. Food is still delicious, though.","useful":0,"funny":0,"cool":0},
{"review_id":"Sn2kBsxL3LMyfPNdOdkQoQ","user_id":"csqqdxHvaMJCTXc_2QscqA","business_id":"XBRCMc3rcvcRXrB3p-o9yA","stars":3,"date":"2011-07-17","text":"I had the Weiner schnitzel and my girlfriend had the Gypsy's cutlet. It was good, not great. I have to deduct points for inattentive servers and expensive fare ($43 for two people - just too much). Also they feel the need to remind you several times via their menu that it costs them money to accept credit cards - come on. They also automatically threw on a 15% gratuity. OK experience but I probably won't be returning.","useful":2,"funny":1,"cool":1},
{"review_id":"FrbgYH9yL3g8GaIkNefLDg","user_id":"xAM4wCIVwH2k7_y8eayNYA","business_id":"FcJ7DkL-UKj8RLUi08lyfg","stars":1,"date":"2010-02-13","text":"NOT child-friendly in child-friendly Leslieville.  After walking 1 hour to get our baby to sleep, looking forward to a quiet lunch & a pint at the completely empty Roy, their bartender watched as I struggled to get my stroller through TWO heavy doors before informing me that \"actually, we don't allow strollers in the restaurant\" (i.e., We hate children.).   \n\nStill hungry, thirsty, and well-deserving of a baby-break, we backtracked to longstanding Leslieville institution Velvet, and were warmly received.    \n\nBTW, I parked my baby stroller next to the owner's scooter by the back booth.","useful":3,"funny":16,"cool":0},
{"review_id":"XG9vnDa1BejZSXlP327qRA","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"4hG2j_ibsNblDgqei05U_g","stars":2,"date":"2011-01-11","text":"So I really don't want to give this place two stars b\/c this really doesn't reflect the food, but I have to b\/c the service is sooooo slow! \n\nWe had made a reservation for 9 and got there around 8:30 and they were able to seat us after about 10 minutes. Our waitress came over pretty quickly after we sat down but then it just went downhill from there. We had ordered drinks and the waitress brought my friend the wrong beer. We then ordered edamame and a bunch of sushi cut rolls, We were really hungry b\/c we had just traveled to Vegas and went straight to dinner from the airport. We ordered the spicy tuna, salmon avocado, shrimp tempura and spicy scallop rolls. It then took about 45 mins. to get our rolls and we were starving! We ate those rolls pretty fast once they got to the table. We were still hungry, so for some reason we thought it would be a good idea to get some more rolls. Bad idea. The next set of sushi rolls took another hour. We almost wanted to cancel the order b\/c it was taking so long. We were hungry but also tired and just wanted to get out of there. \n\nAfter we finally got the second set of sushi rolls, we immediately asked for our bill b\/c we knew that would take a while, which we were right about. \n\nAfter about another 20 minutes, we were able to pay our bill and leave. \n\nAs far as the sushi goes, it was really good. Our favorite was the shrimp tempura. Our least favorites were the spicy scallop and tuna b\/c they were not spicy. \n\nThe whole meal lasted almost 2.5 hours, which is pretty ridiculous. Not sure if I would go back b\/c I don't think I have the patience.","useful":0,"funny":0,"cool":0},
{"review_id":"gRGhMFih4nw1QxrowdDXHg","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"b3eOIxo0RKZBCuKUmVytKg","stars":5,"date":"2017-04-07","text":"We wanted to get married by an \"Elvis\" for our Vegas wedding and we were referred to Roland by where we were getting married (Denny's) and he was great!!  He was very nice and took the time to incorporate some things he had just learned about us into the ceremony.  His Elvis impersonation was great and his singing was really good!!  I would definitely recommend him!!","useful":0,"funny":0,"cool":0},
{"review_id":"9gsBL6yd_SYX4qZVYpHSwA","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"QJR4qBUHegWEozSQrGmBPw","stars":4,"date":"2016-06-27","text":"I made a reservation for a friend's birthday and went through the Bellagio concierge.  I had tried to make my reservation on the restaurant website but it said I had to call.  I should have done it through OpenTable b\/c I never have problems with them.  The concierge had told me the dress was business casual and men cannot wear shorts, but when we were seated, I saw plenty of men wearing shorts, so that was a little irritating. \n\nOur dinner was great though!!!  I had ordered a dirty martin, but there was barely any olive juice in it, so I asked for more on the side.  For our appetizer, we got the charcuterie board, which was so good!!  The pickles were the best part!! They also give you really good bread and olive tapenade which was excellent.\n\nFor my entree, I had the seafood risotto, which was so good.  I probably shouldn't have eaten all the bread because I was getting really full, but I managed to eat almost all of my entree.  I also tried the tenderloin which was excellent!!  My friends also ordered the scallops for their meal, which they say was really good as well!!\n\nWe were really full for dessert, but we were celebrating a birthday, so we somehow ordered 3 desserts for 5 people!!  They did put a candle on one of the desserts, so that was nice.  \nWe tried the banana tiramisu, the chocolate peanut butter lava cake and the cookie butter creme brulee.  All of which were wonderful!!!!  We couldn't stop eating even though we were so stuffed!!!!  \n\nOverall, the dinner was great and I definitely recommend this place!","useful":2,"funny":0,"cool":1},
{"review_id":"rFBdmWyNsQ9la9C8T5Fl4A","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"8b5ll2kjXfjgFIqWsjkr8Q","stars":2,"date":"2016-06-27","text":"We wanted something somewhat quick and thought this cafe would be good.  There was about a 5-10 min wait for a table and we were seated with a really good view of the pool area.  Then it went downhill from there.  \n\nIt took forever to put in a drink order and then once we got it, the drinks weren't even right.  We ordered 3 mimosas and one bloody mary and she brought 2 bloody marys and 2 mimosas, except the mimosas were just champagne.  \n\nOnce we ordered our food, it took forever to get the food!!!  Then when she did bring it, she gave some of our things to another table and then we had to wait for her to bring out new stuff!!  Even through all of that, the food was just ok.  I would just avoid this place and go somewhere else.","useful":4,"funny":2,"cool":2},
{"review_id":"2ZS-43y5za6-ksXtk5jiPg","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"d_L-rfS1vT3JMzgCUGtiow","stars":5,"date":"2016-06-27","text":"Our friends who live in Las Vegas recommend we go here to meet them for brunch on Sunday.  I was able to make a quick and easy reservation on Opentable and even changed it a few times without any problems.\nWe were seated really quickly and had the best waitress named Darlene.  Were waiting for 3 people in our group and while we waited, Darlene brought us complimentary pigs in a blanket.  We also wanted mimosas and she suggested the bottomless so we can try different kinds and kept bringing us different varieties.\n\nThe lunch menu did look good but the brunch menu looked so good, we had to go with that.  It's basically small plates and you all share.  There's so much to choose from that Darlene said she will take control and bring us almost everything.  And she wasn't lying!!  We had so much food, we felt bad wasting stuff when we were getting so full!!!!  Everything was fantastic!!  The one thing that we thought would be good was the churro tots.  They were a bit underwhelming, but still good.  \n\nWe were celebrating two birthdays and Darlene even \"sang\" to our table!!  She was so funny and attentive and everyone should have her as their waiter!!  \n\nI will tell everyone that goes to Vegas to go here because it was great!!!","useful":1,"funny":0,"cool":0},
{"review_id":"q7C9MbAr7xZfX6huP1ic7w","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"owLXnEhlMLsFpemYoOxNkg","stars":2,"date":"2012-05-29","text":"My friend was getting married in Las Vegas over the Memorial Day holiday and instead of having everyone spend a fortune at the fancy strip hotels, she picked the Tuscany, so everyone was able to get a good rate.\n\nI was traveling with another one of my friend's and her husband and we got to the hotel around 2 p.m.  We waited in line to check in and asked if we could check in early.  We were told that the room that they held for us were given to people that stayed longer and that our rooms were not guaranteed, even though we booked them about a year in advance.  That makes no sense whatsoever.  We told her we were part of a wedding party that had blocked a bunch of rooms, but they still didn't care.  When they said they had 2 rooms available, the rooms were in 2 separate buildings away from where the bride had wanted us to stay.  We told the lady where we wanted to stay and she said come back in a hour and they should be ready.\n\nWe came back exactly an hour later, only to be told they weren't ready yet.  The lady had us sit and wait 20 more minutes while she waited on a call back to make sure the rooms were clean.  They also had one room with a King bed and one room with 2 doubles, even though my friend and I had both booked rooms with King beds.  I let her have the King room, but once again, what's the point of reserving a room, if you aren't going to get what you asked for.\n\nMy room was okay.  I didn't have problems like my friend had with the sink and safe.  I did not like that you could hear people above you walking or running.  That was really loud.  Also, even though there are shades to keep the light out, it was still bright once the sun started to rise and that made me wake up way earlier than I wanted to.\n\nAfter the first day, my room was not cleaned by 3:00 p.m.  When I was getting ready to meet my friends, the cleaning lady came back around 3:30 p.m. and I told her I will be leaving soon and to come back.  On the day I was leaving, she knocked on my door at 9:00 a.m. to see when she could clean my room and I told her I was leaving today.  Shouldn't she know that?\n\nThe food at the Mexican restaurant and Marilyn's Cafe was just so-so.  We only ate there b\/c there was noting else, but it wasn't that great.  I would have gone somewhere else, if there was something else close by.\n\nThe bar in the lobby would have been okay if it wasn't for the jazz music.  I'm not a fan of jazz and did not want to hear it.  Also, the prices for drinks in that bar are ridiculous!!!  My friend and I ordered Shirley Temple's, which consist of Sprite and cherry flavor and they cost $4 each!!!!!!!!  What the heck!?  Also, a small bottle of water, about half the size of a regular bottle, was $4!!!  That is so ridiculous!\n\nThe pool was probably the only thing that wasn't that bad.  We were able to get lounge chairs both times we went to the pool.  I know people I was with were annoyed with the one waitress that was going around getting drink and food orders.  She was taking forever on some things and even gave food to the wrong people.  \n\nOn my last day, I had checked out and wanted to spend a few hours at the pool.  I went into the bathroom to change and I came out and put my stuff on the counter.  The cleaning lady was in there staring at me with an annoyed look, so I asked her if I was in her way.  She rudely said yes and I asked her if I should move to one side or something and she huffed out saying, something about coming back.  So uncalled for!!\n\nWhen it was time to leave, we asked the bellman to get us a cab and he waited about 10-15 mins until he called for one, which of course made us late to get to the airport.\n\nI definitely won't be staying at this hotel again.  I appreciate that my friend picked a  place to help all the wedding guests save money, but it was an awful experience.","useful":1,"funny":0,"cool":0},
{"review_id":"3t6FzObtPNi1-uendgdGog","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"dCUuzw3R2rPqKyN2Zl9zRw","stars":4,"date":"2011-01-11","text":"We ate at Fiamma before going to see Cirque de Soleil's Ka at MGM.  We made reservations for 6:45 p.m. and they were able to seat us right away.\n\nThe table was right by the entrance and my seat was right behind the menu where people walking by could check it out.  I didn't really like that table b\/c a lot of people were walking by and then they were right next to the table looking at the menu.\n\nOther than, that the food was excellent!  They gave us bread and olive oil, which was so good b\/c we had two basket-fulls.  I ordered the sea bass and a side of potatoes and was completely stuffed.  I also had a glass of wine, which was great!  \n\nThe restaurant is definitely pricey and it would have been nice if it was a bit cheaper.","useful":0,"funny":0,"cool":0},
{"review_id":"bXpV7gJjmvBNttndovoifQ","user_id":"WQbJUmnkVpbbOaWMQloHDg","business_id":"xDvl_i1g1HCJ4EmIRmwfqg","stars":4,"date":"2017-04-07","text":"My review is for the wedding services they provide.  When my now-husband and I found out that we could get married at Denny's we decided that we had to do it.  I received excellent service once I was put in touch with Sheila, the manager.  She explained to me what I options I could choose from and we went from there.  In the beginning, we had chosen the cheapest option, but we were upgraded because we had a special guest musician perform for us.  The upgrades were great!  The flower bouquet and boutonniere was so pretty!!!  The cake pops were delicious and the set up looked great!  We had also wanted an Elvis minister, so they put us in touch with one and he was fantastic!!  I would definitely recommend getting married at Denny's if you are thinking about getting married in Vegas!","useful":2,"funny":1,"cool":1},
{"review_id":"V-vZapSAXUj7ZKhdmuILcA","user_id":"zZrjk37UFwEr_m0jB7075A","business_id":"kX0br64oB3_o4TY1F5NXkQ","stars":5,"date":"2017-05-30","text":"Love the atmosphere here, great place to hang out before dinner. We were pleasantly surprised to find out there is a brand new delicious food menu! Will be returning soon!","useful":1,"funny":0,"cool":0},
{"review_id":"HIA38j_7e8Ahj7R9HLUEXg","user_id":"_DyBO8or8oqWA9DMuFNG5A","business_id":"Yf-2OMa58Pdxv-Jc9kXiVA","stars":4,"date":"2016-05-17","text":"Great service although I HD add to go through a couple of stylists before finding one that got my hair cut how I wanted","useful":0,"funny":0,"cool":0},
{"review_id":"fGxBVW04PM1HhdRBKixH1w","user_id":"_DyBO8or8oqWA9DMuFNG5A","business_id":"Oq_NXf50o4U-cTFWlVkyGQ","stars":4,"date":"2017-01-14","text":"I'm not a big coffee drinker but their breakfast bagels are amazing. I always go with the farmhouse, plain bagel and maple smear. It's like a home made breakfast in a sandwich. The staff are always nice and when they makes the occasional mistake, they get out fixed within a minute or two. Highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"_1OnA8k88AjEaqStHIQphA","user_id":"_DyBO8or8oqWA9DMuFNG5A","business_id":"wHVWfC_a6koeiJXAu78e1g","stars":5,"date":"2017-02-12","text":"You always know what you're getting at Rudy's. Great service, great food and a really laid back atmosphere. There always something on the TV and great music playing at just the right volume.","useful":1,"funny":0,"cool":0},
{"review_id":"VnKBt_4E6dbqkGdeHVbz9g","user_id":"_DyBO8or8oqWA9DMuFNG5A","business_id":"DocFwzxQdU4ic62TpERCzw","stars":5,"date":"2016-04-16","text":"Even though we went in not long before closing, they were very helpful and took the time to answer all our questions. The return policy is great. We bought a greens supplement that tasted like horse pellets smell and they gave us a complete refund. Very friendly and very knowledgeable.","useful":0,"funny":0,"cool":0},
{"review_id":"7cAPWuKt9g3DmQ_L1cE_TA","user_id":"_DyBO8or8oqWA9DMuFNG5A","business_id":"kwEBCIp18Xi9ETDn_WIQaA","stars":5,"date":"2017-02-02","text":"Was in the area doing some shopping and decided I needed to eat. Was going to hit one of the old standbys in the immediate area and noticed this place. Was up for something new so gave it a try. Dan was behind the counter and I told him I had never been here. He gladly have me a quick but informative rundown of the menu and a couple recommendations. I ended up going with the kalua pork rice bowl and couldn't have been more pleased. A mostly sweet dish with just the right amount of savory. Place was very clean and the menu was very simple to navigate. They have a selection of hot and soy sauces to add to your dish but I didn't find them necessary. In the plethora of Asian style places these days, this is a definite standout.","useful":1,"funny":0,"cool":1},
{"review_id":"__vzxaNMRj1p2PH2dJgjAQ","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"bVuPp6xuI4UPXlAEkEd2bA","stars":4,"date":"2010-01-31","text":"Went last week during the Happening Gourmand.  \n\nFrom the fixed menu I chose the Garlic Escargot, Angus beef bavette, and Crme brle.  \n\nGiven Narcisse was the least expensive of the Happening Gourmand restaurants I was pleasantly satisfied with the meal.   \n\nIn fact out of the 3 HG restaurants we tried Narcisse was my favorite.  \n\nThe standouts for me were -\n\nThe escargots  - nice twist on traditional escargots with cheese melted.\nThe beef bavette - inexpensive but well prepared piece of meat.\nThe french fries - savory and lots of them.\n\nThe service was a tad on the slow side but i think it was more to do with our waitress than systemic of the restaurant.","useful":1,"funny":0,"cool":1},
{"review_id":"9U-sJBLtm1USA9uqnJV6sw","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"806kkDGaRCJ4lZLRcEf-iw","stars":4,"date":"2010-01-25","text":"I've eaten here several times now.  \n\nReally enjoyed the ramen.  Large bowls brimming with tasty goodness.   Note, some bowls have more meat and toppings than others.\n\nGyozas are also very good and appear to be made in restaurant as opposed to the frozen bought variety.  \n\nChicken wings were also very good however last time they came undercooked.  \n\nI'll give that a pass as until that dish everything has been great.  \n\nVery attentive service.\n\nWill be back again.","useful":0,"funny":0,"cool":0},
{"review_id":"O5aYyci-fHtpyIenJf2-rQ","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"Jhz_aUT4i84Wt8KAZVGXVA","stars":2,"date":"2010-02-01","text":"If you're looking for the cliched Mexican restaurant with the Mariachis and frozen cocktails\/margaritas then this place is for you.\n\nPersonally I prefer contemporary Mexican cuisine with good premium margaritas (not that Jose Cuervo\/Sauza stuff).\n\nUnfortunately, the food and service at Casa De Mateo were unremarkable as was the margarita.  \n\nI don't know if we have much choice locally (would love to hear any suggestions), but I still think you need to head down south below the 49th parallel to find really good margaritas and Mexican food.","useful":1,"funny":0,"cool":0},
{"review_id":"dXlpsSdtmZD9GYcgwoHC3w","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"Y1Yprra4ZSyAIMW9Zm75dA","stars":2,"date":"2010-01-22","text":"Bleh.  Uninspired.  \n\nWent to dine at Mechant Boeuf yesterday during the Happening Gourmand.  \nChose the goat cheese appy, Mechant Burger, and chocolate mousse for dessert.  \n\nNothing particularly good or bad.  \nI would rate the food comparable to typical bar food.  \n\nThe bar is clearly the draw here ... might return for beverages but not to dine again.","useful":2,"funny":0,"cool":0},
{"review_id":"Cgt3a27ECIw8xA34IcF5nw","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"vgLC4k9st5Gc2RiZaSw8EA","stars":4,"date":"2010-01-31","text":"The Faubourg has seen better days but the Bagel Place continues to be one of my favorites.  \n\nMy favorite are the smoked salmon bagels.  \n\nLarge serving of smoked salmon and cream cheese on top of a delicious bagel.   \n\nCan't beat that.","useful":2,"funny":0,"cool":1},
{"review_id":"3aU1Pr205Und16qh1AlXdw","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"XtE1r4_JMBSV_YBXlo8RbQ","stars":2,"date":"2010-01-23","text":"I don't know what the last reviewer is talking about.\n\nI'm Asian and lived in Vancouver most of my life so I would like to think I know a little about authentic Asian cuisine and this place is certainly not that.\n\n\"General Tao\" and \"authentic\" don't belong in the same sentence together.  :P\n\nCame here for lunch and tried the Pad Thai (not Chinese) and some fried beef dish.  \nFood was edible, service thorough, but menu caters to a Western crowd.","useful":2,"funny":1,"cool":0},
{"review_id":"fIjEOZM4lTjqomJ1zUk4bQ","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"8laPibALNSasJtKjE3u4vg","stars":4,"date":"2010-01-10","text":"Decent prices if you wait for a special, buy in bulk,  or print out the online coupons.","useful":1,"funny":0,"cool":0},
{"review_id":"qmtwPg7JXcBg1qW1PqYHSQ","user_id":"h2zLiqDXdA_sOdPFRGmM5w","business_id":"8nFcofQcOdXf9dG6YF8RGg","stars":2,"date":"2010-02-05","text":"Ate here last week during the Happening Gourmand.\n\nThe food came out very quickly ... maybe too quickly you know what i mean?\n\nIt's a funny thing when it comes to quick service .... there's a fine line between an efficient waiter and feeling like they're trying to rush you out the door and get their tip.\n\nUnfortunately it felt like the latter.\n\nThe meal was affordable and decent however nothing outstanding.","useful":0,"funny":0,"cool":0},
{"review_id":"fk3ot9c2aPv9cazuzlxKpg","user_id":"gPLWEcjlyCEswV5w6mcgzQ","business_id":"31kmRcQS6SDKI_P0Ycv-VQ","stars":1,"date":"2016-07-15","text":"I paid $48 for a gel manicure as well as a $14 tip for my technician, Simone. Unfortunately, my manicure fell apart within the first couple hours of getting it done. I decided to add gems, but they fell off my nails same day. Now my nails look tacky. I called back to ask if they can redo it. I was able to rebook with another technician. I also asked if it would cost anything, but the girl over the phone didn't know if I'd have to pay since it was a different technician. Also, I can see through some on the polish. Clearly, my gel manicure was not done properly. I decided to call back to cancel the reschedule appointment being that I do not have the time, and I don't want to pay for a mistake that is not mine.  I'm very disappointed. Your service is not even close to being worth $48.","useful":0,"funny":0,"cool":0},
{"review_id":"ZMYFKlEGVO_H1wwM_REd3w","user_id":"q_rBenfYfxg5RdlcqRlzZg","business_id":"KTon9_ClD6O6eOLqA-tIUA","stars":5,"date":"2014-10-20","text":"I've eaten gyros pretty much everywhere in AZ and this place is up there for one of the best!","useful":0,"funny":0,"cool":0},
{"review_id":"gRNqaG-rUXs9PvGIAJvrLQ","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"H0xrqDnQuei14LAkjEeInA","stars":4,"date":"2014-09-17","text":"I stayed here after seeing rooms for $6.00 on Expedia, I really was thinking the worst. I have to say I cant wait to go back, the rooms are small but they are perfect for one or two people. The air condition works great, yes you need that in Vegas. All the staff was always nice , the valet people were always very friendly too. My room had a good bath tub, old school. Only complaint and its not a complaint the water in the shower must come from a volcano, dam its hot, guess to wash off the germs from the night. Late at night there was some working girls out on Fremont street if that's what your looking for, must have been the Tuesday night special because there were tons of them. Overall I will be back, good experience at the Golden Gate. Try the Dolly Parton Slots they are fun!","useful":0,"funny":0,"cool":0},
{"review_id":"IlPJ37B04TDn5ckZmqSyGA","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"itNoMqRVItV-1gR8zS-uaQ","stars":3,"date":"2016-09-04","text":"Just being honest I think this place is overrated. Mac Donalds fish sandwich or it reminded me of Mrs Paul's frozen fish. Was not earth shattering. Would I eat here again maybe, I wouldn't go out of my way. Lived in Phoenix 3 years and always saw it but first time trying it.","useful":0,"funny":0,"cool":0},
{"review_id":"KI_8gQBEmb-_1FtwlJRo3w","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"D5aSQhj3uyX4Fj1B31EYRQ","stars":2,"date":"2014-09-17","text":"I recently filed bankruptcy and received a letter that they could finance me!. In fact I think they was the first out of like 75 I received. I called them and they said come out. What a joke. The first day I went we rode a golf cart to the back where all the dirty cars are and they kinda teased me showed me a really nice about a 2003 Camry with leather. I asked to drive it and I could only drive it down what looked like a residential neighborhood because he said the shop hadn't checked it out. They said they would work on the deal and they next day well they couldn't do it. They showed me a 2006 Civic that would be perfect, keep in mind 99k mile car, and the air condition was working but they would fix it, what a joke. Like $375 a month for 60 months and you can trade it in a year, yea right. Thank God I didn't buy here, Please shop around when you receive these letters. Try Camel back Ford they was the best and I wasn't treated like I have bad credit. The sales man was pretty cute in the Fast Loans Department but other than that what  a joke.","useful":2,"funny":0,"cool":1},
{"review_id":"5OJpHMfLZzg1NddQMkvDwA","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"QuYAh94UZzHuy9McaeovKg","stars":3,"date":"2014-09-17","text":"I recently filed Bankruptcy and received at least 50 flyers in the mail from Larry Miller Dealerships wanting to finance me. What a joke. I signed up online filling out application, I was called from a salesman at Larry Miller Fiat, come on down we can get you in a car, we own the bank, Prestige Financial, what a joke!. He looked online at all there dealerships looking for the RIGHT car, he found one. 2010 Chevrolet Cobalt, I have never been in jail but I have seen jail cell movies that the jail cell looked cleaner, yea it had new tires and low 60k miles but  it was nasty inside. Like $366 for 66months and you can trade it after making 12 payments, yea right who wants a 2010 Cobalt you still owe 10k on lol. Please do yourself a favor when you receive these flyers and look around. Camel back Ford was the best place I went to and didn't treat me like I had bad credit.","useful":0,"funny":0,"cool":0},
{"review_id":"bx7RESfb4e-7lKPJgI12OA","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"cHdJXLlKNWixBXpDwEGb_A","stars":3,"date":"2014-09-17","text":"I ate there with a friend, it was just OK. I order the jade chicken and jerk chicken. My friend ordered same thing. The jade chicken was so tough like leather me and him both returned it. The jerk chicken was good but would set your mouth on fire. The watermelon Ice Tea they had was pretty good. I will go back but for my first time I wasn't really impressed but all business have there bad days.","useful":0,"funny":0,"cool":0},
{"review_id":"AdDJgUZtTJQ6w_mGKAW0Ww","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"7nNtjlWDnj0YI80I8gjbdQ","stars":5,"date":"2016-08-21","text":"I am still fighting my nightmare aka case. I been very blessed and Victor was one of the biggest blessings of all bonding me out of jail. My family member is out of state she called at least 10 bail bonds places that was rude, wouldn't help her or wanted her to bring a vehicle and leave it for collateral. Keep in mind she's 2000 miles away. Victor from the start worked with her, was honest about the hole process. Victor sent his amazing coworker Katrina to have my paperwork filled out. Boom I was out of jail hell, first time in my life in jail scared to death, still scared. I go check in with Victor on Fridays it's more than a check in usually. He gives me hope when sometimes I don't have it. He helps me to believe everything is going to work out. He treats you like a friend not a criminal, yes if you mess up he's gonna get you like Ru Paul says dont fuck it up, you treat him like he treats you, you get the awesome blessed Dignity Bail Bonds experience. I truly recommend him to anyone and not just because he got me out of jail because he's fair, has a awesome energy about him, overall great business. Go Dignity Bail Bonds!!! Go Victor!!!","useful":1,"funny":0,"cool":0},
{"review_id":"1MNSRPRvglv4GXUGZwjURw","user_id":"0J5Zw0mU-U51MtT9IjGB-Q","business_id":"cTZmf7B-4yciMc1WKiCVOA","stars":3,"date":"2014-09-17","text":"I ate here after reading the reviews on yelp. It was just OK, I got the big Jim. What aburger has gravy and biscuits that's just as good.  Looked like a bunch of goth skater cooks trying to serve some home style food. My friend ate with me and he wasn't very impressed either. I had a QT cup because QT ice tea is bomb and one of the skater workers said because of the liqueur license I had to throw it away. It was ok, I went, I probably wouldn't go back.","useful":2,"funny":3,"cool":1},
{"review_id":"ipsSLb3F6sAsZZvSdcddBA","user_id":"bhpl4CYM2C1S_hEwZOqAfA","business_id":"kICgNgVRkIh4doz0atyMMA","stars":5,"date":"2016-06-26","text":"Best meal I've had in a long time! We started with the dim sum platter which was just incredible, especially the duck dumpling. We then had the spicy prawn, black truffle duck and Asian greens with ginger. The flavour in each dish was just amazing. The banana peanut dessert was the perfect ending to the delicious meal. The Hakka cocktail is not to be missed.","useful":2,"funny":0,"cool":1},
{"review_id":"Gt0lL_LUDX28SNw41jm3bw","user_id":"bhpl4CYM2C1S_hEwZOqAfA","business_id":"SeNOJ2zYHziptxLuiRINLg","stars":4,"date":"2016-06-25","text":"Ate here based on a suggestion. Waitress was friendly but when asked what she recommends, she spoke really quickly and we didn't understand any of what she recommended. \n\nFood was very yummy but very small servings - I guess that's tapas for you! \n\nCucumber Mist cocktail was great. \n\nFantastic view. Best to request a window seat or even a table on the patio. Sat by the window and we weren't disappointed.","useful":2,"funny":0,"cool":0},
{"review_id":"HMy2pxGibZLt8uy1HmhOyw","user_id":"XXhCZbEKpEdzoOiUskpSkg","business_id":"bZUbsROklEz4bWSN3ej4dA","stars":1,"date":"2017-04-28","text":"Posted some photos from the experience my wife and I had yesterday at Paramount - Heartland location, you be the judge. We were there at 5pm, it wasn't busy at all. The food served to us wasn't fresh, I am so disappointed and I felt cheated when I saw the condition of the food which was served to us. I am not a difficult customer and I don't create a scene either but since yesterday I can't forget the worst experience I have had and the upset stomach. There were pieces of chicken skin fat in my shawarma platter and the salad was stale, the fattoush salad we order didn't have the crispy chunks of fried pita it comes with. Small portions with lots of stale fries , is this what you call fine foods?! The service was extremely slow, we had to look for someone to give us more pita bread. The restaurant wasn't busy at all, we clearly mentioned our table number to the server and she ended up serving the bread at another table. I spent most of time time scavenge through our order and left with plates full of old food which seemed microwaved. $45 for two platters and fattoush salad.","useful":0,"funny":0,"cool":0},
{"review_id":"7TD8uKS9QCviDGRKu_JnNQ","user_id":"fSMs__mxql5INrVMWc3I4Q","business_id":"2ZU3ujOk7cDnIOIRGmBgjg","stars":5,"date":"2015-08-28","text":"Great moroccan \/ tunisian food, served in small 'tapas' like portions or as full meal.  Great setting for a drink \/ coffee. See my earlier description.","useful":0,"funny":0,"cool":0},
{"review_id":"uVVDPvO4GDniT_QvfUxgSg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"WWqdy9PKOSyhLgHIGaNFrA","stars":1,"date":"2013-10-06","text":"Do not order to-go from this place. I was told it would take 35-45 minutes for delivery, but after an hour I called to check on my order and was given a \"sorry, he just headed out.\" Another half hour later I had to call and cancel my order because I could not wait anymore. I was out on hold 3 times. Poor service and it sounded as if the employees were clueless on what to do. I got no explanation as to why it took so long. Disappointed.","useful":0,"funny":1,"cool":0},
{"review_id":"wu_YhmB6SURbwXuMgbkQwA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"akkum1t8rGOZz8gT2wAXyA","stars":5,"date":"2015-09-18","text":"My boyfriend first started coming here when he injured himself during a workout and has been coming for months! He absolutely loves Dr. Reed! Reed has truly helped his back and he's far better than from before. (He used to sleep on a tennis ball due to discomfort) \n\nHe then referred my roommate who works an office job. The slouching and being hunched over quite often has taken a toll on him so he came in and loved Reed as well! (He had gone to a different chiro prior and made the switch). \n\nI caved and stopped in myself. I am a server and carry heavy items and trays so my lower and mid back are always aching. I'm still just 20 but ever since coming here I've felt a huge difference in my whole body! I'm definitely happy with where these sessions are going. I'm aware of my posture at all times and that has helped me breathe better and digest better. Reed is very attentive to how your body works and since he's suggested better sleeping positions for me, my nights have gotten significantly better. \n\nGrace up front is a gem I can't forget about! She's very sweet and kind, always picking up on conversations, and just brightens up my afternoons! \n\nEveryone is great so even if you stop in just to check it out or ask questions, totally worth it!","useful":2,"funny":0,"cool":1},
{"review_id":"ihbi3UhHWNQqaZlcLF0XKQ","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"4TPm-Y9mdYs984ui60cqCA","stars":5,"date":"2015-12-26","text":"I've been to two other Enterprises and I have to say, this location has been the best! Everyone here is very friendly, especially Tyler. Exceptional service, made renting a car super easy for me, and was able to go through all the paper work and whatnot in no time! I work in customer service myself, dealing with people everyday, so I really appreciate workers like him who not only make your experience better, but remember you and pick up conversations from where you left off. \n\nDefinitely recommend this location if you're in Tempe \/ Mesa! All of the associates are wonderful, but if you can, speak to Tyler, he will take care of you no problem!","useful":0,"funny":0,"cool":0},
{"review_id":"fUgM3J9GStlAKAury3XSjQ","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"yvwK4MO2qnSZE5ggYGyk1A","stars":5,"date":"2016-02-05","text":"I love this place! Great flavor in all the dishes I've tried, my all time fave is the Chinese Lettuce Wraps! Lunch is definitely the best time to go, excellent portions and affordable prices. I plan on working my way down the entire lunch menu! Walking in, the lighting is beautiful and natural because of the big windows, it's super open space, high ceilings, cute decor, this place is modern and lovely. All the servers have been genuine and kind also! \n\nHighly recommend for a quick bite, or even a nice family friends dinner :)","useful":0,"funny":0,"cool":0},
{"review_id":"bqQigyuhpjooodiP3D0szw","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"ti7UmThnMV34Juvib64FhA","stars":5,"date":"2016-12-10","text":"I've struggled with mild-severe acne since high school and finally at 22, I've found peace. I had been seeing another dermatologist and esthetician in ahwatukee, but needed to search for a more natural and friendly office. I love how cozy the space is when you walk in and how family-oriented the workers are. \n\nMy first visit was just a quick exam with suggestions of switching out chemical-filled products. I was even gifted a sample for my inflamed cystic acne. The Green Tea Gel Cleanser, I believe. I like it for when I don't wear make up and just need a quick clean at the end of the night. \n\nOn my second visit, I had the pleasure of getting a personalized facial from Diana, who I adore! She's super informative and really taught me a lot about how my diet would affect my break outs. I kid you not, after cutting down on gluten (was hard since I work at a brewery) and dairy like Diana recommended, my skin smoothed out almost instantly. Anyways, after my rejuvenating, relaxing, and gentle facial, I was gifted another sample. The Clove Gel! Immediately after using this gel, my redness calmed down, my oils weren't as crazy, and I definitely saw improvements on my face. It makes my face feel super smooth and cool. \n\nI just went in for my third visit, only to purchase that Clove Gel she gave me a sample of. I can't wait to see Diana again so I can ask her about what products I should use next since my acne is almost gone and I only have scars and hyper-pigmentation. \n\nI truly appreciate how friendly the team is and how helpful they are with the products they carry. They have a line exclusive to them I think, and it's mostly natural\/organic, which I love! I'm actually bringing three of my friends in for facials\/check-ups because I like this practice so much!","useful":1,"funny":0,"cool":0},
{"review_id":"OB-uqVOwSC5RnHr4rM9Hdg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"1SLJKRYPRifERga33AjK7Q","stars":5,"date":"2013-06-01","text":"I love this salon, it will be my new go-to for touch ups, if i need a special do, or just a regular trim! Bree, was so helpful since I hadn't gone to a salon in such a long time. She was able to quickly see what it was that my hair needed and how to frame my face correctly, which I had trouble with. She was able to transform my thick and broken hair into a chic and cute look with flexible layers and volume! \nHIGHLY recommend this place!","useful":2,"funny":0,"cool":1},
{"review_id":"M_atZ-oOahKjxcZXvnZqJQ","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"KW3EG4v65QeNqXh4O6tUAg","stars":5,"date":"2014-11-20","text":"I love this place! Front desk is always friendly and never hesitate to start up a nice conversation. Rachel is an absolute saint! She's helped me so much by ridding bad make up in my collection, recommending better regimens and routines for my mild acne, and teaching me new things about my own skin! It's a bonus that they remember you and your concerns from the last visits!","useful":1,"funny":0,"cool":0},
{"review_id":"dL4Vto2ysU4FIGj0D1G7yg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"WAWWO9PCDTDiXwkKdkw5yA","stars":5,"date":"2017-10-28","text":"My absolute favorite spot for ramen, fried appetizers, and even sushi rolls. I love that they offer a little bit of everything because sometimes that's what I want. Its such a clean and neat place with the friendliest servers and chefs. Alan, who is a chef there is personable and knows how to take care of his guests. Every visit is like I'm seeing a friend while enjoying his creations. \n\nMy boyfriend loves the tonkatsu ramen there and I can't get enough of their chicken or pork katsu. So thin and crispy, paired with fluffy white rice is heaven. Try the croquettes for a solid snack or  octopus appetizer if you dare! Go with friends to order a bit of everything and eat family style or go on your lunch break for a quick and heart meal. It's great for all!","useful":3,"funny":0,"cool":0},
{"review_id":"XOwYAzj-M407wzM81PgSTA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"DgZ-pZUo3drzpiCDlDr9IQ","stars":5,"date":"2016-05-25","text":"This is my go-to for any meal honestly. I love how quick and easy everything is. The service can be strange to those who aren't used to Asian owned establishments. But I enjoy that there's no forced conversations and unnecessary check ups on us while we eat. So, service is straight to the point and quick! \nThe food though, is never disappointing for me. I choose to eat here for hang overs, for a quick lunch, and sometimes even just a quick spring roll snack. \nI highly recommend! It's just delicious food with good service and the owner will always remember your face :)","useful":0,"funny":0,"cool":0},
{"review_id":"ynf4UDB9GraAZQA3l9lJSA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"rkf-2DNMGOLPSOk6Tqps8g","stars":5,"date":"2017-07-28","text":"I just want to start off by saying, this store is my favorite place to grocery shop. All the cashiers are friendly and always give cold water bottles when it's extra hot out and sometimes even little yogurt treats. I come here for 90% of my groceries. Amazing!!\n\nThey sell basic produce and in an environmentally friendly fashion. Nothing is ever overstocked (which goes to waste) to look glamorous like at big grocery stores, but there's just enough fresh goods for daily shoppers. \n\nI can find the best meats here! I only come here for my Korean BBQ meats, stew meats, and anything else I need for soups or broths. It's always looking fresh and for items that are about to go bad, instead of throwing it out, they put them out at a discounted price. \n\nI also love the packaged lunches they make everyday. There's beef or fish cake kimbap, kimchi stew, pan-fried fish, eel, a bunch of side dishes by the check-out station, and even fresh sweets like mochi and pastries.","useful":1,"funny":0,"cool":0},
{"review_id":"mL0DHFxiEZQcozieuKO6AA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"4uZkUUbl6dr_bjmS2QNnbA","stars":5,"date":"2017-05-24","text":"My girl friend and I went in around 1pm for two pedicures and two gel manicures and were out of there by 2:10pm! I was greeted right away and directed to the nail polishes and massage chair immediately after. Everything was amazing! The prices are reasonable and I felt that that service matched, if not more. The deluxe pedicure was excellent. Hot stones, towels, and sugar scrub!! Super relaxing. The best part was I never felt awkward and the workers were extremely friendly. \n\nWill be back again!","useful":1,"funny":0,"cool":0},
{"review_id":"zjiNzPYeLFRzHe0BB1wLhw","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"pApEPv1-ApXee4GYYMB5AQ","stars":5,"date":"2016-03-10","text":"I just wanna say, THANK YOU KEVIN. This beautiful human being showed me the difference between amazing and not so amazing piercers. I made the mistake of falling for a $30 deal at Next Level Piercing & Tattoos and was stuck with a giant retainer that literally hit my upper lip when I talked. \n\nKevin was able to swiftly and painlessly switch out the jewelry for me. It wasn't a big process for him or anything but I just really appreciate how gentle he was with my bruised septum. I didn't even feel him take out the old retainer to put in the new jewelry! \n\nFor future piercings, I will be back. Also, if you are thinking of getting anything done, do it here. You get a gorgeous selection of jewelry as well as skilled hands doing the job.","useful":0,"funny":0,"cool":0},
{"review_id":"pnppYmVEihLKQ-XJ3fNMGg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"puPY7gVy7RCz8bK1zkzdoQ","stars":5,"date":"2016-09-21","text":"Love, love, love this place. Everything from how family oriented it is to the quick and easy combos they offer. Nothing makes it feel more authentic than the homey atmosphere and friendly workers that have been around forever. Tom, the owner, always remembers everyone's names and picks up conversations right where you left off. \n\nPricing is extremely affordable and the food is delicious! I love the Dan Dan noodles the most. Such wonderful flavors and always have enough for the next day. \n\nThe only con I've experienced is the lack of service sometimes. However, keep in mind, traditional Asian food service is extremely casual and they try not to bother you while you eat. \n\nIf you're looking for a quick, inexpensive bite of Chinese, I'd stop by!","useful":2,"funny":1,"cool":3},
{"review_id":"nQPUQuE49VxYGvtgKwrkYg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"W9NUdpRX7gLXHLM2-NeKeA","stars":5,"date":"2013-09-28","text":"Hands down, best sushi place I've ever been to. Customer service is always a must have with me and this place is all about it! Have had every server (been there that much) and they are all friendly, know the menu, and recommend the best specials! The sushi is amazing, don't be afraid to ask what's good that day because the chefs know what's up!! Atmosphere is never a let down. You find yourself conversing with the boss in no time, which makes you feel really welcome :)","useful":0,"funny":0,"cool":0},
{"review_id":"Z3SGRxmg-QYRhVg-xd9hxA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"D4BWyStFZzA7k8hqDmnyFw","stars":5,"date":"2016-05-19","text":"Been here with different friends more than twice now and will be returning. Service is always great, Kevin is our favorite server! He's kind and attentive, but most importantly, he's able to help me decide on which dish I want to try :) \n\nKimchi fried rice is a must try classic!\nSpicy rice cakes with ramen and meats is a little bland but I can tell the flavors are there :) \nSpicy squid salad is delicious as well as the bulgogi rice! \n\nGet it all!!","useful":4,"funny":0,"cool":1},
{"review_id":"oCLeJYyuFDtZnqP40XuHqA","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"nJoohOsIiZMgtPV0ttvPxA","stars":5,"date":"2017-11-03","text":"I forgot all about Lee's sandwiches after coming here. I especially love their baguettes and affordable prices. There's not much to say other than amazing banh mi and great for if you need a quick but filling bite. Try their omelette banh mi!","useful":0,"funny":0,"cool":0},
{"review_id":"xDFA2ymsJcO0lS_VtSY8bg","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"ivAe-BA1y3DOyRUKHdPnQA","stars":5,"date":"2015-06-14","text":"Nothing that I don't like about this place! Love that the establishment is clean (tables, booths, utensils, glassware), and the interior is decorated to give a nice, soothing atmosphere. Perfect lunch portions for an affordable price. Service is quick and usually at lunch they don't talk\/bother you much, which I enjoy. Sushi rolls are outstanding, love the way they're held together and the texture of the rice! I always come here for an easy meal :)","useful":0,"funny":0,"cool":0},
{"review_id":"mMAxhDC2bZrch_VHGIpW9w","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"5qgJJn6r_GjE1-tGbqoYyQ","stars":4,"date":"2015-06-16","text":"I love coming here because it's convenient and I know it's clean! They're always so kind, energetic, and pick up on conversations wherever you left off. \n\nService is fantastic, but they often struggle with timing and getting their appointments in along with walk-ins. Ive had to wait a few times regardless of calling to set a time up.","useful":0,"funny":0,"cool":0},
{"review_id":"Tts1xFazswk5eTlA1vjYDQ","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"noJoyfO5YgAX1swUdtTcug","stars":5,"date":"2017-01-12","text":"Despite being 22, I've got quite a long history with dentists. I grew up without proper dental visits, resulting in 4 decayed molars. \n\nAt 18, I took myself to one of those chain dental offices and paid over $1500 for two root canals. I was never given an explanation as to what a root canal was or that I'd need to pay for crowns separately. So, I got the roots taken care of but due to insufficient funds (because I'm 18!) I couldn't afford crowns to keep them secure. \n\nFrom 19-21, I hopped from local dentists to dental schools, and even Mexico to save money on the treatments (crowns, bone grafts). I couldn't pull through with most places because they were discomforting and too business-like. \n\nFinally I found this place on yelp and after the consultation with Dr. Walker, I knew I could trust his work. He thoroughly went over my teeth, proposed a treatment plan, and even broke it down into separate operations to help lessen the financial stress. Most dental places feel fancy and the work they suggest never seems necessary (like they just want my money), but here, I understood the importance of each extraction and surgery because Dr. Walker took the time to explain things. \n\nIn the past few months we extracted a tooth, did a bone graft, and a root canal retreatment. All were extremely terrifying at first, but I trusted him. Everything went smoothly and even when the retreatment got complicated Dr. Walker comforted me by staying positive and updating me throughout the procedure. (The scariest thing is hearing someone say \"oh no\" without a follow-up) To be honest, I was trying to stay awake so I could keep my mouth open; it was that easy-going in the room. \n\nI genuinely appreciate the work he's done and can't say enough about how great my endo experience was. \n\n*the receptionists and assistants are always a pleasure as well. It's pretty family-oriented in there so they tend to remember you!","useful":1,"funny":0,"cool":0},
{"review_id":"KFWmGw4NL-u1ePcrqJ3iww","user_id":"6JscRaLwzOTKFDE2wfImcg","business_id":"z3ZFXtKGfDXevTtqLTFhHw","stars":5,"date":"2014-05-25","text":"Love this place! It's pretty far out for me but I don't mind making the drive to eat here. A place that offers a mix of Korean and Japanese foods is all I need in life. The staff is super friendly and I love how they can remember my order! The beer selection is fantastic, the edamame is Better than most, and the spicy soondubus are amazing! \n\nUpdate: they recently changed their name to K Sushi!!","useful":1,"funny":0,"cool":1},
{"review_id":"lQV_dfFqsgJEjZDK5QR-qQ","user_id":"VuaIKtBtVlqOXHx6BLbJ7g","business_id":"z7kss2S8ijIG3uyaeXX-Og","stars":5,"date":"2016-09-17","text":"I took my car in for service today. The service manager, Leanne, who helped me was fantastic. Great customer service skills, professional and a nice overall person. Thank you for going the extra mile to help me.","useful":0,"funny":0,"cool":0},
{"review_id":"U9N2WZdBoVpq6Fc4XFPQRg","user_id":"VuaIKtBtVlqOXHx6BLbJ7g","business_id":"j2uIPTtof6r1Bl5W0WCnuw","stars":5,"date":"2016-12-07","text":"Great experience all around ... from the minute you walk in and interact with Rebecca and Samantha, to the interaction with Dr. Marshall and Michelle. Nice competent friendly professional people.","useful":1,"funny":0,"cool":0},
{"review_id":"Wi4urFm5C5QBVC__wP4AjA","user_id":"VuaIKtBtVlqOXHx6BLbJ7g","business_id":"Oln6PsWGnqEtZIoCQ5Mu_g","stars":1,"date":"2015-06-11","text":"Terrible customer service. Terrible. I took my Honda truck to this location for an oil change. When I said to Carlos, the manager on duty, that the $79 he quoted me seemed much higher than the dealer, he went to tell me in a rude way that \"we make our money changing oil and the dealer makes their money selling cars\". He then walked away. \n\nAs rude as it gets. No clue how to treat a customer. \n\nI ended up getting my truck serviced at a local Honda dealership. Oil change plus tires rotated in 45 minutes for $66 including tax. \n\nStay away from this jiffy lube location.","useful":1,"funny":0,"cool":0},
{"review_id":"hOswhfIqmd9bZrJIXR08Lw","user_id":"X3H-L_e7oQx6wLSYiBA8Uw","business_id":"FSjtWNPi1D1TklbwpM0ajQ","stars":2,"date":"2017-03-06","text":"Good chicken. Horrible service. Drive through attendant was rude and obnoxious. And our order couldn't have been more wrong . Will never return to this over hyped place with my family again.","useful":0,"funny":0,"cool":0},
{"review_id":"txWSOrVlNJCVtf9iVi-qYA","user_id":"X3H-L_e7oQx6wLSYiBA8Uw","business_id":"ugw8RtuqcDMLrCI_GzqwuA","stars":5,"date":"2017-03-03","text":"I'm moving back to Nova Scotia next week and this pizza will be missed dearly. There's nothing like it. Simply amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"exAFZ38qPcqEcxKexk3zAA","user_id":"FiRCRJYOOHN6IZZpO-B1gQ","business_id":"glkEaoxbewiSMBiXs945JA","stars":3,"date":"2015-06-08","text":"Surprisingly good pie! Fast friendly service, location location location...and great value- especially for the strip.","useful":0,"funny":0,"cool":0},
{"review_id":"vhkVOmVMsmEdjhGku8bi-A","user_id":"FiRCRJYOOHN6IZZpO-B1gQ","business_id":"CCRgGKhzxSpl38w7yhqKUw","stars":4,"date":"2015-06-07","text":"Delicious food, excellent friendly service, pleasing dcor...what more to ask for? Also most reasonable prices, especially given this is within the Bellagio.","useful":0,"funny":0,"cool":0},
{"review_id":"Nfogt-3toxt6thBKK-5k0Q","user_id":"FiRCRJYOOHN6IZZpO-B1gQ","business_id":"Mn6PbumS7GL2v3jPilTaeg","stars":4,"date":"2015-06-06","text":"Great hidden gem! Delicious, fresh, most reasonable pricing ($15 for buffet). Enjoyed their lunch buffet (jack fruit curry!), friendly and prompt service. Greeted by the owner. \nVast majority of diners were Indian...a good indicator.","useful":0,"funny":0,"cool":0},
{"review_id":"-hndYoKp06XMJe3EQGqtHA","user_id":"X3nYQKm_zLsPB2-l8ntf2g","business_id":"_sh6mIBWZis66mAjkjN8Qg","stars":5,"date":"2016-12-08","text":"The service & food is always phenomenal. Thank you so much! I love coming here with my friends for a good meal.","useful":0,"funny":0,"cool":0}]