[{"review_id":"SEmHlQn5aUwKKZw59wjIKw","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"4JguZ4BzTQaGHm6Aed4SNg","stars":4,"date":"2012-12-03","text":"I always get great service from this store. It's been open since I think around 2003, maybe 2004. I've never had bad food from here. It is a chain, so the food is what you'd expect from a Chick-fil-a. It deffinitely costs more than a chicken sandwich from McDonald's, but I find the spicy chicken sandwiches from Chick-fil-a to be the best fast food sandwich you can get. Just make sure to pick your sauce separately. I had a friend who always complained about them being dry because he didn't know they don't put sauce on there, you get it on the side. After he knew that, he started eating there regularly.\n\nIt is fast food though, so don't expect a life changing experience.","useful":0,"funny":0,"cool":0},
{"review_id":"EPCrFOv8TD2YBEPX-XWsyQ","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"1-EjdZhVZFuNG6ReBS0rvQ","stars":5,"date":"2012-12-03","text":"My family has been going to Popo's on Indian School Road since the 80's, so it was great to find out that one opened up closer to El Mirage.\n\nThis is probably my favorite Mexican Restaurant. The prices are decent, the service is good, and the food is consistently tasty. It's sad that I have to leave El Mirage, a city that got its start as migrant farm worker's housing, just to get great Mexican food, but at least it's only 15 minutes away. I highly recommend the bean dip with fried flour tortilla chips. Can't comment on the bar (I don't drink) but I've never had bad food.","useful":0,"funny":0,"cool":0},
{"review_id":"xY5lpz-dWwotaju8iUKjhg","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"-PARO4rKPyOBgra18yANYQ","stars":4,"date":"2012-12-04","text":"I don't understand all the negative reviews for this place. I've eaten both in the restaurant and had stuff brought over while I'm bowling, and it's always been good. The prices are a bit high, but it's definitely a step up from usual bowling alley food.\n\nI can't comment on the bar, as I don't drink. The food I've had has always been good. They have 1\/2 appetizers happy hour on weekdays until 6pm, and most will come in at $5, which for the quality of food is quite decent. I've had a couple of their pizza's, and they're probably the bets pizza in Surprise (which I know, isn't hard to do.)\n\nThey do have a bit of a clash as they apear to be trying for a bar and upscale restaurant feel, but they're in a bowling alley \/ laser tag \/ arcade establishment .... It can get noisy, and it doesn't really work for kids; though I usually don't see them in there.","useful":0,"funny":0,"cool":0},
{"review_id":"Wqn2lx8MGqx2ohSn9zFkyQ","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"nnB9aw5tLaYZHgAvwzpPOg","stars":1,"date":"2012-12-03","text":"I don't drink so this is a review of the food only.\n\nService was OK, but it was pretty dead, so the waitress's attention wasn't exactly split. I ordered the corned beef and cabbage .... and it was bland and the cabbage was overcooked. Seriously, if you're going for an Irish pub, and you can't get corned beef and cabbage right, what are you selling? The person I was with does drink, and she didn't mind the beer; had the same complaint about the food though ... bland.","useful":0,"funny":0,"cool":0},
{"review_id":"wNIpjCdg0vb0Q6UP7o2gJA","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"Fvd8qeJCXFbMYQk45S7iBQ","stars":4,"date":"2012-12-03","text":"This place is decent, and I'd definitely recommend it over one of the Rio Mirages. The food is a bit on the pricy side for what they offer, and I prefer Popo's in Glendale. If I just need some quick Mexican food though, this place has always been satisfying.","useful":0,"funny":0,"cool":1},
{"review_id":"kfVrKz_8q7Kp2mFsOtYJVg","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"zDQZZZhb8VOk8EaoN3HeTA","stars":1,"date":"2012-12-03","text":"This place used to be amazing. I started eating here in late 2007, and they had by far the best General Tso's chicken I've ever had, and very good egg fried rice. Sometime around 2010 it all changed drastically. I've gone back several times since then, and it has not been great, but this last time I went it was just horrible. I ordered the same chicken, but some of the pieces were not cooked through, I had shell in my egg fried rice, and they were both very bland.\n\nIt makes me very sad because there really aren't any good Chinese restaurants on the west side, and to say that I'll never go here again is not something I easily do, but this place is just not worth it anymore.","useful":7,"funny":3,"cool":0},
{"review_id":"275zkS7-UwIJCK0o9GVCeg","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"-1VaIJza42Hjev6ukacCNg","stars":2,"date":"2012-12-03","text":"The food and service aren't terrible, but like so many unfortunate restaurants this one suffers from being bland. I'm about as white as you can get, and I'm not into food that's so spicy you can't eat it, but at least throw in some spices to your food.","useful":0,"funny":0,"cool":0},
{"review_id":"t_UxC--fFahR2Gm6FdBubg","user_id":"zbuG_wbjhyHRjlu5_YJKtg","business_id":"dXoeLzpG72P7F2Lwa01riQ","stars":2,"date":"2012-12-12","text":"I don't get the big deal with Chipotle. They give you huge burritos, but it's all rice. And for over $6, it's not that worth it. I can go to taco bell and get 2 x 5 layer burrito and have just as much food, and it's mostly meat, not rice. The fact that it's under $3 really makes it hard for me to go to Chipotle and pay twice as much for food that's not much better. If you're wanting good Mexican style food, spend the extra to go to a restaurant. Just be careful in El Mirage, despite having a large Hispanic community, our choices in authentic Mexican food sucks.","useful":0,"funny":0,"cool":0},
{"review_id":"TlUVLk8Wj9tkh1YhTMxk0g","user_id":"yLjpLvkMEcSpurF8WXdF3A","business_id":"hQKUU4z1HYMuFwgR2BmluA","stars":4,"date":"2011-06-08","text":"I was hesitant to go into here after reading a review of another location...however, now that I have been in 2x for 2 different laptops, I can say I was pleased with their service. They were nice and honest.  \n\nThe first issue I had turned out to be a corruption on my hard drive - they told me an estimate of what it would cost and I decided to purchase a new one...so no charge there.  My new laptop received an error so that I could not log on...so took it there for help.  Jeremy gave it a look and took about 15 minutes to determine the problem (created a new profile, deleted the old one), fixed it for me with no charge....hopefully I won't need them anytime soon, but appreciated the fix very much!!","useful":1,"funny":0,"cool":0},
{"review_id":"dbfav3svHzO5zr6eIL_u_A","user_id":"7w_JKxlwUn81qh7HpQQZoA","business_id":"QVETku6NLsSYdTlvy7qiow","stars":5,"date":"2016-02-15","text":"Seriously frickn phenomenal!! Margaret was incredible.  She helped me find exactly what I needed and instead of buying the basic boxspring (what I came in for), I am buying more-than, with her help. Customer service is everything and she was spot on! She guided me through all my questions and then navigated me towards better options. She was not pushy or anything like a salesman. 100% coming back when I'm ready to upgrade anything else. Thank you,  Margaret! You were a doll!","useful":0,"funny":0,"cool":0},
{"review_id":"1qT8bHiQBlVS8urr6K8FjQ","user_id":"Mnu970zwGrSSWZoodxrqyw","business_id":"UXDoc76N59G6p3RUH5S--w","stars":1,"date":"2016-07-13","text":"Looked this place up on here hoping to find a diner worth coming to. I give it a low rating because from the start it wasn't good. The young boy & woman servers were rude & had a vibe that we didn't appreciate. When I go somewhere I want to feel welcomed. \n\nOur server had an attitude as if she didn't want to be there waiting on us. I had the Philly cheese steak & my mother had the American Burger. My sandwich had more onion and peppers then meat. When I want a Philly Cheese Steak I want to to have some steak, not a bun overstuffed with onions & peppers. My plate was messy, as soon as he put it down everything started falling off onto the table. \n\nMy mother was not even a bite into her sandwich when it all started falling apart. The bread seemed to be old and dried out, it kept crumbling up and everything fell out. She stopped eating after that, and when she asked to get it taken off the bill since she barely had anything to eat, our server gave off that negative vibe again. \n\nFinally as we were leaving, we were getting ready to pay and our server told the young boy to check us out, she told him to take off my moms food and he just gave us this look and rolled his eyes. We asked for military discount which was nice that they had since places never seem to do it anymore. I still don't understand how my philly steak & an ice tea came out to $22. By then we were just over this place and wanted to leave. This place was dirty & just a negative vibe from the start. Never coming here again.  \n\nPlease don't waste your time.","useful":0,"funny":0,"cool":0},
{"review_id":"UQR5KZCXzOxtvh35YZKrbg","user_id":"Mnu970zwGrSSWZoodxrqyw","business_id":"70umoFq_Wa24Nr78UOsilQ","stars":1,"date":"2016-06-08","text":"This place was always our favorites, but lately the service and environment has been terrible. This used to be a nice environment that made us feel home with the food we grew up eating. The last few times we've been there the food was  not satisfying at all & there's a weird sewage smell that won't go away \n\nThe service was normally good but the young cashier with glasses always has a rude attitude when we get there. I don't know what the problem is but it's always something with my family. \n\nI wouldn't recommend this place, it was a good place to eat but now overall the service & food is not authentic Hawaiian. I would give no stars if I could.","useful":0,"funny":0,"cool":0},
{"review_id":"QveP99Rf0zs1hWqgcio8LQ","user_id":"Mnu970zwGrSSWZoodxrqyw","business_id":"togzltbV52oGR-a0jddqZw","stars":1,"date":"2016-05-02","text":"My roommates & I came here just to relieve from finals week. I wanted to treat my friend out because she was having a bad day. When we were choosing our colors, it felt like they were rushing us. My friend didn't know what color she wanted, so they basically picked one out for her & she just went with it because they wouldn't stop rushing her. \n\nI went in for a color change & the lady wouldn't stop rushing me to pick a color. She took off the nail polish I already had on which was black, and she left my fingers looking black and dirty. I asked for a matte finish & thinking it would be $5 more, she said $20. When she was finished, she told me to come sit where my nails would dry, she didn't even turn on the machine & just left me there. Did not speak one word to me & just took off. \n\nMy other roommate was getting a pedicure & the guy was being so rude towards her. He was complaining to her that  she picked a color that was too liquidy & clear. She asked to pick a different color and he just ignored her and started painting them anyways. She asked again & then finally he said yes with an irritated look on his face. His body language & attitude towards her was terrible customer service. \n\nI wouldn't recommend this place. Overall the pedicures were nice & the prices weren't bad. Just the feeling of the negative energy is what made this a no for me.","useful":0,"funny":0,"cool":0},
{"review_id":"z2aa_l0vX6rz7WK7t214eQ","user_id":"3DZiRIDk8qSdPUDFV4VLhg","business_id":"4iB4J5fxd8tbYklDAnaD5g","stars":2,"date":"2014-07-09","text":"Pros: Nice rooms, big pool, great working AC\nCons: Room far away from the entrance, water in shower barely got warm, unsafe elevator doors, parking, This is going to be mean, INCOMPETENT STAFF\n\n   My overall experience with the hotel was below mediocre, as indicated by my score. First, I arrived at the hotel and parking for check in was a NIGHTMARE. Granted, it was 4th of July weekend, but you would think they'd have adequate parking for the amount of people they'd anticipate for the holidays. \n  Second, the room they gave me was already taken even though they allegedly checked to see it was free. Apparently, there was a mix up and the room they were supposed to give me was not ready yet. How is that possible? I arrived at 4:30 pm when check in was at 3:00 pm. Plus, not only was check out NOT at noon it was at 10 AM! Five, COUNT THAT, 5 hours to clean a room. I even gave them an extra hour and a half before I checked in and it STILL wasn't flipping ready!? Ridiculous.\n   Third, the damn shower. No hot water, at all. It was a measly lukewarm. Might as well have been cold.\n   Fourth, parking made me want to cry.\n   Fifth, and this one's a doozy, the elevator doors are dangerous. DANGEROUS! A hazard! Why were the doors closing on me even as I was stepping in the middle of them! Where are the fucking motion sensors!To top it all off, those horrendous doors closed on my elderly grandmother and it made her fall on her face. Did the doors open up? NO! She was squished between them and they continued closing! They had to be pried open by not 1 but 2 people. Disgusting.\n    And the staff at the front desk? They need a lot of training. Or basic reading skills. If my room is booked or if you gave away my room, mark it off as taken! My family shouldn't have to show you which rooms are available so you give me the right one. Why are they doing your job for you?\n   Never will I stay here again. EVER. You want to experience Vegas? Stay somewhere else.","useful":5,"funny":0,"cool":0},
{"review_id":"hwnX55-OW2AASgklLFekag","user_id":"3DZiRIDk8qSdPUDFV4VLhg","business_id":"fW8XnRboAmGZOZVPoOGWcw","stars":4,"date":"2014-07-09","text":"My only con about the pub crawl was the disorganization and the corralling of everyone from bus to club and club to bus.\n\nOther than that, this was a great buy. Three clubs for $49 with the Yelp code? Loved it.\n\nTheir bus drinks were kinda sketchy but they had the desired effect so who cares?  \n\nOne thing I think they could improve upon is the availability of coupons or deals for drinks in each club. $32 for two cranberry vodkas? No gracias señor. \n\nHappy Pub Crawling!","useful":1,"funny":0,"cool":0},
{"review_id":"PfmyNXIOoV-ef7RTmh7tKQ","user_id":"QtTq8bzXfTw8bn0dqYveVA","business_id":"wcLX8aToZJF4AR-qkpI2Ag","stars":5,"date":"2017-04-08","text":"The service was amazing, and we loved Scotty! He definitely made our night out on the town fantastic. Would highly recommend","useful":1,"funny":1,"cool":1},
{"review_id":"FMzPrbJaYVj-aXc6_XTDOQ","user_id":"kPjC3OAjggJm5mVttuKuxQ","business_id":"FyucbcsZwdDs5RQ7Tk9z9w","stars":2,"date":"2015-11-17","text":"West Side Story was absolutely fantastic last eve.  Michael our server was excellent.  However the chef should be totally embarrassed for serving pork chops that were so overcooked they were impossible to cut  even after trying with a steak knife.  What a disappointment.","useful":3,"funny":0,"cool":0},
{"review_id":"PsQkqgzbpvxYX_3AAz0Xkw","user_id":"fVmP8_eW4LaV1N-qJTHWFA","business_id":"L9H00Q0uHqrQ42MSp2k_4A","stars":5,"date":"2016-10-18","text":"We discovered this place just recently and were excited to try it out. So happy we did -- enjoyed all three dishes so much:  roasted beet risotto, spring halibut, and Korean braised beef. I like that the ingredients are organic, locally sourced, and that I had plenty of options that met my dietary restrictions of no dairy or wheat.  Having it all fresh and affordable is awesome. I also picked up a large jar of glutenfree BBQ sauce - another hard to find item. This is a new \"fast food\" option for us that's miles above typical grab & go fare.","useful":0,"funny":0,"cool":0},
{"review_id":"uQMka5JPF0x73PhF5DvqAA","user_id":"fVmP8_eW4LaV1N-qJTHWFA","business_id":"8tMQzsHpaviwkVUoaaUywQ","stars":5,"date":"2016-06-16","text":"I love Kijiji, but at times it can be a crapshoot; that's why I like to tell people when I find a business that is everything they purport to be and more. Six Tree Removal is definitely the real deal. Tony was very quick to respond to our call and came back with a highly competitive quote. He was exceedingly professional and competent, and exceptionally careful. A number of the sick trees we had removed were taller than 30 feet and Tony managed to fell all of them without hitting our house, our deck, or our shed - something I secretly thought impossible.\n \nWe unreservedly recommend Six Tree Removal.","useful":2,"funny":0,"cool":0},
{"review_id":"Q4nHk0XP_pzLZgQyLm7fPg","user_id":"fVmP8_eW4LaV1N-qJTHWFA","business_id":"_U98Pe-cOBRbHO7nuZ4JFA","stars":4,"date":"2016-10-26","text":"My husband and I stopped in midweek for lunch and are so happy we did. It's such a treat to find tasty food with gluten-free options for those of us who need them. I love the atmosphere:  laid back, comfortable, sports but not too loud at all. The staff was friendly and prompt and the prices are reasonable. I think we've just found our weekly meet-up spot.","useful":1,"funny":0,"cool":0},
{"review_id":"C_-uiwn1WA9x9yG24XG6YQ","user_id":"fVmP8_eW4LaV1N-qJTHWFA","business_id":"z5PLqgcjJeuLw4dMEj6Vyg","stars":5,"date":"2013-02-14","text":"This review is geared more toward anyone with curly hair.  And there's a lot of us out there.\n\nHave you ever gone in to a salon that has promised you that they \"totally know how to cut curly hair\" and walked out looking scarily like Krusty the Klown?  Yeah, me too.  It's SO frustrating.  Everyone will TELL you they can do it and some make a really good attempt at it but they've clearly not been trained in the technique.\n\nEnter Gillian at Get Banged Salon.  She confidently assured me she had many years experience with curly, wavy (and every other) hair so I booked my appointment, hoping she was the Real Deal, and whaddya know she really is.  This girl knows how to cut curly hair.  Dry cut.  With shape ... and style ... that suits your face and your lifestyle!  Go figure!  In no time at all she had transformed my much-loved curls into more loved curls.  No frizz -- no inappropriate products -- no nonsense.  She's a blast to spend time with and I'm glad I found her.  I almost wish I could keep her a secret but jewels like her are WAY too good not to share.  Phone.  Do it.  You'll thank me.","useful":8,"funny":1,"cool":2},
{"review_id":"fLbFXJzotajtEtdW4Js8mw","user_id":"-_iULENf28RbqL2k0ja5Xw","business_id":"-1xuC540Nycht_iWFeJ-dw","stars":4,"date":"2010-06-05","text":"I got really lost looking for this place! Directionally challenged I know. But my excuse is that I'm an international traveler in your fine city!\n\nAnyway, I was starving and was determined to find this joint after reading all these great reviews. I had the 1\/4 chicken leg combo, which was translated to me by a really nice couple (the menu is in French FYI). I watched in amazement as the cook chopped up the meat and piled it with a TON of fries!!! The meal could easily feed a family of four! It also comes with rice and a salad. But honestly you can't see what's underneath the giant pile of fries!\n\nThe chicken had a lovely taste to it. The spicy sauce wasn't as spicy as I'd like it to be. And everything was a teensy bit too salty. If I had a friend to share it with, it would have been more manageable!  All in all a great neighborhood restaurant. Seems to be hugely popular with the locals. The line was almost out the door!","useful":1,"funny":0,"cool":0},
{"review_id":"vg2nu6_k-eHRMiD-SxMR1Q","user_id":"-_iULENf28RbqL2k0ja5Xw","business_id":"RZk_PE-H9SygqwSQd88cWQ","stars":4,"date":"2010-06-05","text":"I was searching for French food that doesn't cost more than my entire wardrobe. I'm so glad I found Le Grand Comptoir on yelp! It's exactly how the entire 2 reviewers described it. It's not intimidating, the prices are reasonable, the waiters are friendly, the portions are substantial. I ordered the pork tenderloin and it's soooo tender!!! It came with a creamy mustard sauce. Mmm mmm! I ate every morsel on my plate, the fries, the salad, the pork! It's a good thing Montreal is a walkable city because I can't stop eating the amazing food!","useful":0,"funny":0,"cool":0},
{"review_id":"CEwDR_xZ9Uib5mUl-3y-5w","user_id":"-_iULENf28RbqL2k0ja5Xw","business_id":"487ZwV1pjttfx_kdqtIl3Q","stars":5,"date":"2010-06-06","text":"I went to ChuChai with a vegan friend as it was highly recommended on Yelp. It really didn't disappoint!  I eat meat but love vegetables too and the dishes at ChuCai were delicious!!  We ordered pad thai, vegetarian green curry, and the \"love bag\" (deep fried little \"bags\" of vegetables). Everything tasted really good and authentic, especially the pad thai. I'm a noodle snob and I swear by it! \n\nIt's not healthy to eat meat all the time anyway, so all you meat lovers who want to try a vegetarian restaurant, this is the place to go to!","useful":0,"funny":0,"cool":0},
{"review_id":"xFaGtgM6YsBOTfu-DQ960Q","user_id":"-_iULENf28RbqL2k0ja5Xw","business_id":"jXJ2ccZTuYrMhrzG2mzfEg","stars":5,"date":"2010-06-05","text":"I want to write the review for the entire city of Montreal but unfortunately I can't do that. Instead I'll just have to write about each location I went to. \n\nLet's just say this is one of my favorites! The sphere is beautiful and I really loved learning about the environment and biodiversity.  The little park across from it is peaceful and beautiful too. \n\nMontreal is the best city i've ever been to!!!!","useful":0,"funny":0,"cool":1},
{"review_id":"z6guYbdGTmvkZQcQwpzpyA","user_id":"-_iULENf28RbqL2k0ja5Xw","business_id":"Y5-Gphj7DNIav1ZADUip-A","stars":5,"date":"2010-06-06","text":"What a wonderful place!!! \n\nMy only gripe is that there was no sign coming out of the Jean Talon metro station to point you the right way to the market. Easy for locals but a little confusing for visitors like me.  Thankfully nice folks pointed me the right direction. It was about a 10 minute walk to the market and I didn't expect it to be so huge!  Love the fruits and vegetables selection, everything looked beautiful and even laid out perfectly!  The flowers were gorgeous too.  There were all these little cafes for a leisurely lunch. \n\nI was really impressed with the \"rent a bicycle\" station next to the market.  There's no such thing in California, at least not a do-it-yourself type of thing. \n\nMontreal keeps impressing me over and over again!","useful":4,"funny":1,"cool":4},
{"review_id":"8hROogFJtmfE8UQmv4cfpA","user_id":"ooPCYnwFETrc0PAK3zuNtw","business_id":"cs0FZDhSmWirLXNoRa3S0Q","stars":5,"date":"2016-07-06","text":"Hector was friendly, he had everything that was needed and he took the time to complete the job right, and now my AC is better than before. Thanks The AC Guys! \n\nTony also came back to check up on the AC since the unit started to not blow out cool air. Tony was very efficient, friendly and had everything he needed to complete the job. The AC Guys are awesome at what they do. I will definitely recommend them!","useful":1,"funny":0,"cool":1},
{"review_id":"M4L27ityXNT1TdN8XTeikg","user_id":"hKsw8u1Uj3H9DrX_9oFqng","business_id":"l4xgNR5D5Ebk0a57NWX19w","stars":1,"date":"2015-08-11","text":"Do not take your photos there. It is way too expensive. They charged us $30 for only 2 set of 2 passport photos for my wife and myself (4 photos in total). The owners of this place are very greedy and take advantage of the newly opened Canada Passport Office located above their store. Do yourself a big favor and go somewhere else where you can get passport photos for $10 or less. Also, the rest of their merchandize in the store is just ridiculous in terms of quality. Stay away.","useful":1,"funny":0,"cool":0},
{"review_id":"9Xp253O1ACAU2wyPC1p8jg","user_id":"CQytq9KzvoO_X6xhbCcxoA","business_id":"nBFGsYyd7OL45zcumb5Yag","stars":5,"date":"2017-11-13","text":"I brought my 5 yr old grandaughter here for an exam they got me in the same day. Dr. Fetchel is a great doctor he was very patient and gentle with her. The staff made the visit fun they helped her pick out the perfect pair of glasses. She is so excited to wear them. 5 star service . I will definitely  be bringing the rest of my family here.","useful":0,"funny":0,"cool":0},
{"review_id":"-9ZsaDDHKj3rQCKaVn0MqQ","user_id":"CQytq9KzvoO_X6xhbCcxoA","business_id":"npDvIbSKhJPh1vUJ6mjDNA","stars":5,"date":"2017-11-11","text":"I had a root canal done at another dentist office less than a year ago and had continuing problems with them so I called and spike with vickie the office manager she was very nice and empathetic and got me in the same day with Dr. Wandershafer they did a full exam and I had to have the tooth pulled.The staff was amazing very friendly and understanding my fears. The Dr. Was very gentle and has a very calming presence. I have finally found a dentist I like and trust. I would highly recommend  this office to everyone.. 5 star treatment","useful":0,"funny":0,"cool":0},
{"review_id":"MrFnif8ImyAN0QQcUPsJZw","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"bm_PGQMGMjylitqkNIEzTw","stars":3,"date":"2014-09-14","text":"Went for a friend's birthday dinner on a Thursday night. There were others in the restaurant, but it wasn't packed. The food was okay, but our group wasn't wowed. We were seated upstairs and had some delayed service as our server seemed to also be working the bar. I'll give it another shot to try other dishes. I really liked the decor, just expected more from the rest of the experience.","useful":0,"funny":0,"cool":0},
{"review_id":"XtpN8Tga-YOqsCSyyw8P4w","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"B-TSE6634L4aTilMlhHstA","stars":5,"date":"2013-07-14","text":"I found this yoga studio through a deal site and fell in love in my first two visits. The studio is small, but provides a great community of yogis. The instructors are awesome, providing guidance throughout the class and correcting postures or  encouraging us to take our practice deeper when they see the opportunity. Both Jillian and Megan have been able to guide me into postures that I've always struggled with and had a lot of self doubt. In a single session they each were able to provide the right instruction for me to feel comfortable and find success in those new postures.","useful":1,"funny":0,"cool":0},
{"review_id":"BRVBdYBRHkI7ybqeptp41w","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"1WtUgLhdBdQ39aBvEUbsnw","stars":1,"date":"2014-09-14","text":"Tried this place again for a friend's celebratory dinner. We had another server on her 'first day'. She seemed sincere and I believe her, but I've also gotten this excuse before.  Tonight one order didn't come out at all and one came out with an incorrect mix of rolls. The story was another server grabbed the plates, but it took another 30 minutes after acknowledging the mistake to be served our original order. Very disappointing!","useful":0,"funny":0,"cool":0},
{"review_id":"PNcLXN_OIjl485JEs-o7aA","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"sH3UsolKjik01u0HlQ9_0Q","stars":3,"date":"2014-08-25","text":"Good food, but service was slow. We arrived as a bunch if tables were turning over, so I thinks tickets got mixed up in the kitchen. At least two groups who were seated after us were served & finished eating before we got our meals. Our server was attentive in keeping our chips, salsa, and drinks refreshed. She apologized for the delay and noted the manager was in the kitchen cooking to help catch up the backlog. I will return for the food, but hope for a better orchestrated service.","useful":0,"funny":0,"cool":0},
{"review_id":"_cWGmk9CLQh6r0vAxeNaSQ","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"InnQkf4j02mnQUXJOtqqJw","stars":2,"date":"2013-07-14","text":"After searching a number of jewelers years ago, I stumbled upon Malak Jewelers with a good selection of watches - just the item I was shopping for. They provided good service for a number of purchases my family made, but it seems things have changed recently. After receiving a ring for Christmas I took it in to be resized and was warned by the lady that I should keep a little extra room as your fingers may measure small in the winter. I had to pay to have the ring resized even when though it was a gift from their store, which seems like a service they should offer along with the purchase. When I got it back it did still seem too large and could spin around my finger, but they gave the same guidance. I waited a few months for the weather to warm up and the ring is still too large. When I returned to the store, they wanted to charge me another resizing fee to 'fix' it, even though it was upon their guidance that I accepted the 'roomier' fit in the first place. I'm really disappointed in their service and the general manner in which they now seem to be doing business. They've lost me and my family as clientelle.","useful":7,"funny":1,"cool":0},
{"review_id":"qHEaJOlKXFzNxoq5ADoGYg","user_id":"tS-5qhPTfoDx9azVYrmUeQ","business_id":"vhDnsz7Tzopg9WkN0shtZQ","stars":2,"date":"2012-11-04","text":"I bought one of the Arrichion deals last winter and attended my first few classes with the mad rush of others who jumped at the discounted classes. It is not the gym for me. While I have tried my fair share of hot yoga studios, this one felt very impersonal. The routines were just that. . . the same thing every class. I like yoga because it is generally a more personal practice where the instructors lead everyone to find a personal level accomplishment and each class varies in the flow. I didn't get the same sense of trust or guidance since the Arrichion instructors did not provide any one-on-one correction or clarification. I know I need help finding some of the postures. I'll have to look elsewhere.","useful":5,"funny":0,"cool":0},
{"review_id":"R3Dve65P1TleF3hGmrkUqw","user_id":"7J1PWww6PgARxPxglC77ng","business_id":"sB1lPLICz4nrOuuqgLv50A","stars":4,"date":"2014-07-01","text":"It was my first time here and the food was amazing. The service was great. I ordered a 12 oz filet mignon and although pricey I have to say it was worth it. Would I come back again? No, because once is enough and I'd rather save money to try other things. But I would like to recommend this restaurant to anyone who wants to try some good steaks.","useful":0,"funny":0,"cool":0},
{"review_id":"ARN0Yy_cFNyK_P-WO9HXxw","user_id":"WigGKNt_Vj8GKSDFHUOMew","business_id":"Dv0OHpQSL4hOGl2KAEVvlA","stars":1,"date":"2016-08-26","text":"They compute your tax after they add an automatic 18% service fee. \n\nThe server brought me a wrong dish the first time. The meat in the burger is over-cooked. It tastes really bad.","useful":1,"funny":0,"cool":0},
{"review_id":"G74agNJWwXacLrN9t-nXrA","user_id":"kZfxVjx5TCn2TtpUhbuj8w","business_id":"952sPfTt0huZfUqsnkaDsw","stars":1,"date":"2011-12-03","text":"Went on a Friday night at 6:45 and they said they were closed because they ran out of food! If they mismanage the kitchen like this, makes me wonder about the entire operation. Too bad too, because we just moved into the area and love Ethiopian.","useful":12,"funny":1,"cool":1},
{"review_id":"Mi687brioDXg78lt_toxrw","user_id":"RGQoQQ35edvYORvohb07Ow","business_id":"JLbgvGM4FXh9zNP4O5ZWjQ","stars":5,"date":"2015-07-04","text":"This place is fantastic. Been here twice now and have tried most of the apps and small plates. So I'll just say the curried mussels are crazy good. We lap up the broth until there is nothing left. Huge portion too. The pork belly tacos are smoked wings are the newest favs fir me. Atmosphere is great too. Always lively and not too many jerks present. Go go go yo!!!","useful":1,"funny":0,"cool":0},
{"review_id":"cd3xQzSnzVvMGp9cygO8nw","user_id":"RGQoQQ35edvYORvohb07Ow","business_id":"v2UYBFxtaB14OnoKQOuwjA","stars":5,"date":"2014-03-09","text":"Great little spot. I stopped in for some wine and eats and was pleasantly surprised. The atmosphere is spot on and has a laid back feeling. The particular wine I ordered was fantastic but the food was what impressed me. Even the simple bread board was awesome. Some olive oil on the side with some sunken balsamic .... yum. The lardon bruschetta board was unreal. The homemade mayo spread was creamy and dilish. The owner Jim introduced himself and was super friendly. I'm really diggin this joint and plan on returning soon. Clev Hts needed a non Lee Rd'ish spot like this.","useful":0,"funny":0,"cool":1},
{"review_id":"Q4D0AflBHC0N0S2CVAaRdg","user_id":"j7Le0pPYFs69NjUzmHS97g","business_id":"2ep5qQUYL0mTx5CanTAL2w","stars":1,"date":"2014-08-11","text":"Worst experience I have ever had getting my hair done just minutes ago by a male hairdresser!  He made me feel so horrible I wanted to cry!","useful":3,"funny":2,"cool":1},
{"review_id":"sP5y4p1m-t5zYPeZ6_qRcA","user_id":"CnhPN2j5hsM2gJ7UPmllFA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":3,"date":"2017-07-23","text":"Coming here for many years and this is my first bad experience. The food was still great, but the service and the new policy of not allowing you to have a sample tasting of wine before ordering , spoiled my excitement about eating here again. We like to try different wines and the server interaction and suggestions about wine was always a highlight of the meal.","useful":0,"funny":0,"cool":0},
{"review_id":"zaTyqDPcCFaW-vp_l64AcA","user_id":"CnhPN2j5hsM2gJ7UPmllFA","business_id":"_w5hBpkjHs5_Hv3pLeHtIw","stars":5,"date":"2017-07-20","text":"Came with friends to celebrate wedding anniversary, we liked the food and the wine (great selection), but what made us give a 5 stars was the service from our waiter Pedro. He helped us get started with the tapas menu, great suggestions and the way he handled the wine made the meal complete. Would for sure visit again and we hope Pedro still there.","useful":0,"funny":0,"cool":0},
{"review_id":"2zQCorN2Jm3IIotlomucEw","user_id":"LOhIr29fn7JWPECaBp36Uw","business_id":"9nlQLMA8W08dFAkXFSQOyA","stars":4,"date":"2014-09-19","text":"The Habit Burger Grill is such a great place to go out to enjoy a burger! It's a grill with quality service and quality food. Its a small casual place where you can sit with a group of friends, laugh and enjoy your food. The place is welcoming and friendly, the employees are great workers by showing pride in their job. You can walk in and right away fall in love with the place. \n\nAdding to it is the food ! The burgers are juicy and well made, they aren't like the other fast food where the burger has bad presentation. They have everything a buyer needs and you can even adjust it to your pleasure.The wait is a little long but its worth it. The fries are the best I've tried, they are crispy and have great flavor. The place its self is also great ! its clean, and the style is nice. Its not too loud and its family friendly. My brother took me and my nephews had a great time enjoying our burger at Habit Burger Grill.","useful":0,"funny":0,"cool":0},
{"review_id":"pXg2oT-q-kNVGFCvJKbmgA","user_id":"ZMRnBrFToWCBxixkhGeMXA","business_id":"AWaxaKm_YgTkxbW8kjsmdg","stars":5,"date":"2017-03-08","text":"First time in the Charlotte area so I wanted to try something local instead of a chain. The hostess walked us through the menu and was very helpful and welcoming. I picked the pulled pork platter with sides of sweet potato casserole and collard greens. My daughter had a side to spare so I had her select the banana pudding. All I can say is Wow! Everything tasted delicious! Not a big collard greens fan but heard these were to die for. Yep. They were. Sweet potato casserole was fresh out of the oven (hot!). Pork was tender and juicy although a might warm, not hot. Corn bread was awesome as well even though I prefer mine a little bit sweeter. Topped off with banana puddin' that was just like my moms used to make with a 'Nilla wafer on top. Sweet tea of course to wash it all down. I will definitely be going back there next time I cime around. Yum.","useful":0,"funny":0,"cool":0},
{"review_id":"391092sGv_8vhAGJsx5dpw","user_id":"cp8i_9XxsDG-6VtO7azTAA","business_id":"9wM6SK5Q_syHE1P89kyUzQ","stars":5,"date":"2016-11-08","text":"This place is amazing, very friendly and professional. Cindy is great, gentle and right on spot, feel so relaxed after the massage. And the pricing is so reasonable. Definitely will recommend to friends!","useful":0,"funny":0,"cool":0},
{"review_id":"OHzNgc4TfmLjs50V9ztH7g","user_id":"uEWr-uNAq3VAWOL9VaMLLQ","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":4,"date":"2014-02-25","text":"We came here for a good inexpensive breakfast & that is exactly what we got. They have big portions. So sharing is good if u don't want to be stuffed. We had the cheese omelette w\/hash browns & a pancake. It was all great, the hash browns are outstanding, taste homemade. The pancake is enormous, light & fluffy but thick @ the same time. All in all a good breakfast @ a great price.","useful":1,"funny":0,"cool":0},
{"review_id":"deyzwokI6t76SKkxi8-heA","user_id":"uEWr-uNAq3VAWOL9VaMLLQ","business_id":"Rd11Bosr8JkfoUhZLzpuxg","stars":5,"date":"2014-02-25","text":"Excellent service. Perfect burger! Great salad & had nice dessert options, but I was too stuffed to try any of them. Will leave room next time:) will definitely be back!","useful":0,"funny":1,"cool":1},
{"review_id":"G_TQ_49VWAL5ztEYNcIfSQ","user_id":"jTTNhlwSieYK3EhbzK0pyg","business_id":"nrwKiDMr4odCkjx78e5IfQ","stars":5,"date":"2016-04-24","text":"We were staying at the Boulders resort which is only about 2 miles away from the restaurant. We found the restaurant on Yelp after having tried the restaurants at the hotel (which were overpriced and the food was just ok). Forgot our waitress' name (I think it was Corina) but she was super friendly, offered suggestions and explained the dishes to us- we weren't too familiar with Brazilian food. We tried the Feijoada and the Picanha, both dishes were delicious! Service was fast and friendly! Would highly recommend this place!","useful":0,"funny":0,"cool":0},
{"review_id":"m7KTejLSER1bPfc-rAdMLw","user_id":"_yadf4P-73VlRWYkVN4sbA","business_id":"LycxY2dXOBcCP_1pc_dIsw","stars":5,"date":"2017-01-15","text":"I've been seeing Dr. Phan for almost 5 years.  The office staff is very nice.  My family and I love Ashley, one of the dental hygienist.  I highly recommend this dental office.","useful":1,"funny":3,"cool":0},
{"review_id":"0mT9JGktyRWbzkUVfoG-KQ","user_id":"5PJMSp0-6pex-iR-nRLdoA","business_id":"QyK4roe68JzIxsSwVWKcdA","stars":1,"date":"2016-11-29","text":"Went in for the first time today for the awesome price on the smog check.  The workers were pleasant but condescending.  After about a 10 minute wait, the technician informed me that it failed due to the gas cap seal starting to crack with age, but everything else was fine.  He then handed me the invoice with all of the other \"recommended services\" to the tune of $1105.00. The guy at the counter then told me that once I bought a new gas cap and came back he would charge me the $10 again and redo the whole thing.  After buying a new gas cap, I took my business to another inspection center.  The gentleman there was incredulous they would charge me twice when it was only the gas cap.  In short, go elsewhere to people who care about their customers and not just the money.","useful":2,"funny":1,"cool":0},
{"review_id":"-sOGgPe99UNpJZbyak6CWw","user_id":"5PJMSp0-6pex-iR-nRLdoA","business_id":"0CNebFRZI-YGffclhN0dXw","stars":5,"date":"2016-11-29","text":"Efficient and almost never crowded.  Have been going here with my vehicles for two years now and am always impressed with his fairness and courtesy.  His base price is a little expensive at $25 but he accepts competitor coupons within reason.  Thank you for making an annual and odious task a lot more bearable!","useful":0,"funny":0,"cool":0},
{"review_id":"mQEH3y2Vbk33ICvk7azMPg","user_id":"MSP8Ej3br9191YZUK-Zd8A","business_id":"mDoLWEOFmxcQ5TAPqxoJLg","stars":4,"date":"2015-06-11","text":"I have sought out a good time countless times with Sagos many times over the years. It is a great place to hang out and throw a few back. They have a decent happy hour with appetizers and sliders for 5.00. The food started off awesome and then took a down turn. That kitchen crew has since been replaced and the food is back on par. I love the spicy pickles and the mac  and cheese bites. The drinks prices are decent but best during happy hour. The staff remembers your name and your drink. The owner will also show up and just sit and chat with you.  The bathrooms are always clean which o can appreciate. There is always a good time to be had at Sagos. You have to check it out at least once.","useful":0,"funny":0,"cool":2},
{"review_id":"rAwtwLwNH6Po3aSxxvCQ_w","user_id":"MSP8Ej3br9191YZUK-Zd8A","business_id":"afMwlotE4c2nBLilhaOxhw","stars":5,"date":"2014-05-26","text":"This place is amazing. The crust is thin and crisp like a cracker. The flour used is from Naples,the water used to make the dough is flown in from Boston. That to me says quality and care. The sauce used has no added sugars or salt. The tomatoes actaully come from Modesto Cal. This place is AMAZING. The fact that they use high quality ingrediants is important. It is very much worth trying.","useful":0,"funny":0,"cool":0},
{"review_id":"pfUKYZQNnfL6hnZKiXxRsA","user_id":"MSP8Ej3br9191YZUK-Zd8A","business_id":"OIc8vVH1MTmObFeeoc0LFA","stars":1,"date":"2014-05-27","text":"If I could give it zero stars I would. I am not going waste any more of my time with this establishment. They just suck.","useful":2,"funny":3,"cool":0},
{"review_id":"BC-pTqCmB5jM5AGLaUUb-w","user_id":"MSP8Ej3br9191YZUK-Zd8A","business_id":"RKBxoTrfQaJPn3U5oGn51w","stars":1,"date":"2014-05-26","text":"Dillard's is utterly disgusting and trashy. The employees are unhelpful and not trained for their department. Even worse they pressure you into getting the in store charge card. I repeatedly told the sales associate that I did not want the in house charge card. I had to tell her no at least five times. I later found out that associates have to open at least one charge card per day they work or they receive a write up. I also found out that if they do not sell enough in a quarterly period they receive a 10% pay cut. How despicable! !!!","useful":4,"funny":2,"cool":0},
{"review_id":"Xe-z7AMVnOHPaLu7_zci7A","user_id":"WzMVLgTo3-w0Jxghl_xoDQ","business_id":"QJR4qBUHegWEozSQrGmBPw","stars":3,"date":"2016-05-20","text":"Finally tried Olives at the Bellagio.  My husband and I love Mediterranean food and we love hummus and butternut squash ravioli.  We were seated right away and the service was great. We were brought a yummy assortment of olives and a basket of olive bread and crusty parmesan crisps (both very tasty).\n\nThis afternoon we ordered the Greek salad and Hummus to start off. The Greek salad was one of the best that I have ever had and I order it a lot at various restaurants. The hummus, however, looked delicious but had way too much Cumin in it (I'm pretty positive it was Cumin)... it ruined what should have been a delicious beginning. \n\nWe ordered the Butternut squash Tortelli and the Scallops, which came on a bed of Risotto. The scallops were good but the risotto was just acceptable and nothing to write home about. The Tortelli, on the other hand, was definitely forgettable. The sauce tasted like a beef gravy and you would never know there was butternut squash in the pasta... it was disappointing.\n\nBecause the Greek Salad and breads were so incredible, I would give Olives another chance and hope that other menu selections are better.","useful":0,"funny":0,"cool":0},
{"review_id":"t31jxzOdXqSQtyup84p1FA","user_id":"WzMVLgTo3-w0Jxghl_xoDQ","business_id":"ZcTl-DflTJXmxd29xgh11g","stars":5,"date":"2015-07-28","text":"First time to Calgary and not sure where to eat. Asked the front desk and they gave us two or three suggestions. We decided to try this one and i sure did not regret it. Don't let the run down building fool you. This was one of the best breakfasts I've had in a long time. Coffee was good and the toast is great along with  the sausage and eggs. Also had a fruit cup and it was yummy and the fruit ripe... even the blackberries.","useful":1,"funny":0,"cool":0},
{"review_id":"h4MvqYPTLaXWLmKJWOmcoQ","user_id":"i4Ui4VlmND7ui7CMol0ifw","business_id":"He5snolA_enC5_7JjurQ3A","stars":2,"date":"2014-02-22","text":"To get to the point of why I gave a well deserved 2 stars, it is because when they gave us the bill, the waiter wrote in his own gratuity and gave himself a 20% tip.  I could tell right away they treat groupon holders different from other customers.  \n\nThey told us twice ( once when we made a reservation , and when we came in) that you have to tip on the total cost, all before they let us order.  They ask if you are a groupon holder, then they flag your name on the reservation .  \n\nGratuity is supposed to be my discretion , I know I could of made them remove it and tipped what I wanted, but I decided not to ruin my dinner .  They think it's their God given right to do that?  It was not written as a suggested tip, but as the total.   Can you believe it?  They are giving groupon holders a bad name.  \n\nThe food?  Better than their boldness","useful":1,"funny":6,"cool":1},
{"review_id":"xhWfoJC-W80p2yDDhDUSBg","user_id":"CyzXeE6dTerrHgUpLBvQDg","business_id":"U0eUwTGWDBVdE67qVHYEjQ","stars":2,"date":"2017-12-10","text":"The flavor of the noodles were definitely good, however not only is the fried chicken bowl impossible to eat, the chicken we had was not edible to say the least. It comes as a drumstick on top of a bowl of noodles and soup, how are you supposed to cut it off the bone with no plate, unless you slosh your soup everywhere? Picking it up and eating it isn't exactly useful because then you're eating a chicken leg and then some noodles afterward? It should be a cohesive dish, not a challenge. \nRegarding the fact that it was inedible, let's just say it was cut into and we felt uneasy eating it....\nShortly after we overheard a woman asking for a refund due to her chicken.. so definitely don't get it lol.","useful":1,"funny":0,"cool":0},
{"review_id":"UYkfC4JAkT0BZ324lipDeg","user_id":"dlfHwrLCzleDjqg3ETFhDQ","business_id":"4twpbw7n4DmsLxAm6-sMkg","stars":5,"date":"2014-05-11","text":"One of my go to Korean Food Restaurants downtown! I'm never disappointed when I go there, and the food always hits the spot.","useful":0,"funny":0,"cool":0},
{"review_id":"fxoqPyaubw8myegqj4gSMA","user_id":"dlfHwrLCzleDjqg3ETFhDQ","business_id":"RtUvSWO_UZ8V3Wpj0n077w","stars":5,"date":"2014-02-05","text":"I decided to take my brother here for his birthday dinner since I couldn't make it to our scheduled family dinner. Even though it was only the two of us, we had to wait half an hour to get seated - but they did text you 10mins before a table cleared for you so you don't have to wait outside the establishment in the cold. \n\nIt was worth the wait! \n\nI had the blackfish cod (best fish I've ever eaten) and the tofu which was nice. My brother had the bbq pork and bibbimap (I spelt this wrong, didn't I?) Both of which tasted great! For dessert I had the lovely green tea creme brulee and to drink the bamboo cocktail (I loved how they garnished it).","useful":0,"funny":0,"cool":0},
{"review_id":"DKyGi2hMazwTZXIYjw2OrA","user_id":"dlfHwrLCzleDjqg3ETFhDQ","business_id":"WxK3BaPcmJ4X-8UeuJ9LBA","stars":4,"date":"2014-02-04","text":"Ended up in Mississauga a bit early for an appointment so we decided to stop in here for a quick bite. \n\nWe only ordered Japanese dishes, and the tempura was done perfectly and the sushi tasted great. Service was very attentive, though we did get confused because there was a service call button and we didn't get service when we used the call button, but we got great when we weren't using it. \n\nThe space itself it cozy and intimate, I like that they had enclosed spaces for larger groups, but even as a group of two it felt comfortably partitioned. \n\nWould definitely go again!","useful":1,"funny":0,"cool":0},
{"review_id":"aeQ8px_HasclrQkBn2PJIQ","user_id":"7Zqlf6ke5gfdc83rtdnt-w","business_id":"2vYRUAonMg9HBUDs30NL8g","stars":4,"date":"2015-12-17","text":"Went in a group n honestly better than expected good jobbbb m a fan now... They did do some improvements it used to be shityy","useful":0,"funny":0,"cool":0},
{"review_id":"lUerX7tXMiDR8XgSRqudhQ","user_id":"7Zqlf6ke5gfdc83rtdnt-w","business_id":"Wh_-S_tJvma15bxjSJjrWw","stars":5,"date":"2015-12-17","text":"Now this is goood stufff it better then any I've had in a long time time.... Good for groups n itss 5starrrrrr","useful":0,"funny":0,"cool":0},
{"review_id":"H2OFSRj4gK2ko1qxmzbJtQ","user_id":"7Zqlf6ke5gfdc83rtdnt-w","business_id":"oTyTT9LkR7VQIjw_ISoMLQ","stars":1,"date":"2015-12-17","text":"Good place pood food zombies looking waiters no offence!!! Dead service Sana 10X better!()(","useful":0,"funny":0,"cool":0},
{"review_id":"XvP3efx2dHF9YkxpIgxnzw","user_id":"7Zqlf6ke5gfdc83rtdnt-w","business_id":"HSrbuWbiBnkujnfCJPtRHg","stars":5,"date":"2015-12-17","text":"Oh my Olive I this this place oufffffffffffffffffffff gives me chillllz, they got the goood stufff here!!! must try special of the day","useful":0,"funny":0,"cool":0},
{"review_id":"iF5UQm3DXwBsWlXktA1WnA","user_id":"7Zqlf6ke5gfdc83rtdnt-w","business_id":"QCoeVqhEKg_LGAUyojKe7g","stars":3,"date":"2015-12-18","text":"Used to be nicer it's good now too but they lost the touch..... But it is is always open when you gooo","useful":1,"funny":0,"cool":0},
{"review_id":"M2o6xJGRjx_Q-_Hzyd_qIA","user_id":"wmtXYDaPzAnlytlQsYtxAw","business_id":"Cy5VGp4Qhq6AI3Y9ukR2sA","stars":2,"date":"2015-07-05","text":"Everytime I come here, the service is friendly but today, I ordered Takoyaki, and I had asked if it was ok for me to get wasabi and mayo on them instead of choosing mild OR spicy. Unfortunately our server said no, which is when I asked her if she could just charge me extra for the mayo if i ordered spicy which she said no again. I dont understand why she couldn't have just charged me for the mayo, all she advised me to do was tell me to buy 1 spicy and 1 mild takoyaki. Unbelievable!!","useful":0,"funny":0,"cool":0},
{"review_id":"J2SaduU5q9goMj_o20MClQ","user_id":"wmtXYDaPzAnlytlQsYtxAw","business_id":"PZaKEA_Q8JB0lzpqkuyV1A","stars":5,"date":"2016-09-15","text":"This place has a good environment, it seems cleanlier than the other pho restaurants. The food is really good for the price and it tastes authentic to asian cuisine. The pho bowls and the vermicelli dishes are to die for. All the servers here are really nice, and have amazing service. They're really cool and have an amazing aura to them. Overall, I have an amazing dining experience every visit here and would definitely recommend to anyone looking for a good hearty bowl of pho.","useful":0,"funny":0,"cool":0},
{"review_id":"3VGtBms8CX5Wpf54Es6TKw","user_id":"wmtXYDaPzAnlytlQsYtxAw","business_id":"B-avwjcj8opRFibz6FP_lw","stars":3,"date":"2015-07-08","text":"Been here countless times, limited options during the lunch hrs, the store looks fairly brand new, service sometimes is really fast, sometimes uber slow. The ipad ordering is cool. The food is pretty mediocre though, ive definitely had better but this place is better than the one down the street called Kagonei's! Be sure to taste the cheese wontons, its the best thing on that menu!","useful":0,"funny":0,"cool":0},
{"review_id":"QAh3TxGk50KLn2drmUpMEQ","user_id":"wmtXYDaPzAnlytlQsYtxAw","business_id":"LhpaVbk9MEIlcaZCDgTIbA","stars":2,"date":"2015-07-08","text":"Not sure if I had come here at a bad time,  but came here back in february with my family almost around closing and didnt notice at first, but as we sat there longer, we noticed that there was a bit too many little fruit flies flying around us for comfort as we ate. Dont remember what the food tasted like because i was too concentrated on swatting away flies from my face.","useful":0,"funny":0,"cool":0},
{"review_id":"frd6E7E9lsLcw6AgvfBrSw","user_id":"SJCPCWZJTlIVw8xFhTPCtw","business_id":"k1KVK8RnjZ2FJKMO3EcxQQ","stars":5,"date":"2017-07-26","text":"This is one of my favourite salons in this city. Each visit has been a warm experience, the entire staff is super welcoming and professional. I mainly visit Felicia, an exceptional colourist who has been supportive of my hair journey bringing me from virgin hair to a natural golden balayage. Since I had not coloured my hair in ten years, I was (and am) truly terrified of colour processing my hair. Felicia is always informative and communicates each step to ease my tension. She is attentive to fine details, as a professional colourist she is considerate of the demands of my hair type and knows the tools and science behind processing without tremendous damage. Her technique leaves my hair looking natural and polished, I am always pleased with the outcome. \nSince she's been working on my colour I have received a lot attention and compliments on the colour tone and balayage style, and recommend anyone looking for an experienced colour technician to visit her.","useful":2,"funny":0,"cool":0},
{"review_id":"Cmh7262CWQlXneaBvIcvsw","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"ZdqiRrUik1GWAcMWb2iBdw","stars":4,"date":"2017-12-15","text":"Sometimes I come here to read a book, and it's especially cozy when you get a window seat and have the sun shining on your back while it's cold outside. It's pretty quiet here during the day so I like coming when I feel like  taking a walk and a break from the office.\n\nAll their drinks are pretty overpriced, but their ambience is on point. How can I describe it? The wooden paneling give it a rustic vibe, but it kind of also has a modern vintage twist. Littered throughout the store are also offerings of vintage-type goods (they were\/are selling a typewriter) as well as cards (think birthday cards) and they use barrel as display tables. The staff are really nice, and they don't kick me out if I want to just stop by and sit down to absorb the ambience. \nThe only menu item I've tried so far is their mint tea which they brew using tea leaves and not a tea bag. But that also justifies a price hike, about $5 for a normal cup of tea. I might as well order the leaves online. I have yet to get the expensive coffee here, but when I do, I'll give an update.","useful":0,"funny":0,"cool":0},
{"review_id":"6Dy8c5JTFt5AoQQSC_SR-Q","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"jGe5sKmpIStORtVbsd9yyQ","stars":1,"date":"2014-07-28","text":"I am so disappointed with this hospital. This was the second time I came here, and each time was a HUGE disappointment. I am never returning. EVER. The vet's name is Melissa Schupp. \n\n First, I arrived around 2:35 on a Sunday afternoon. I called two hours ahead of time to schedule an appointment because I knew Sundays would be busy; this is because many other animal hospitals are not open on Sundays. My dog was suffering from unknown allergic reactions with skin rashes left and right. I had just adopted him, and his skin had recently become infected and rotten-smelling.\n I called ahead of time, gave my details , a $77 quote and they reserved a room for me. When I arrived  the room was already reserved and I was led straight in. I initially thought I was going to have a great experience because of the quick room preparation but BOY was I wrong. When I was led into the room that was \"prepared,\" there was water all over the floor and the front desk lady hastily used paper towels to clean it up. I waited the standard 30 minutes in the smelly room until the nurse came into to check details, run temperature and give my dog a general physical. Then she left for AN HOUR. By this time it  was already 3:35, and my dog was whining from pain and discomfort in a closed off room. When the nurse returned and began to write down symptoms, my dog actually started peeing on floor. I didn't know what to do because I had no cleaning materials with me, so the nurse stepped into action and dropped a few paper towels on the ground. She didn't manage to soak up all the urine, so when she moved around, my dog was pushed into it and it ended all over my clothes when she asked for my to carry my dog onto the checkup table.\n\nTo make things worse, she left again for another hour, and checked in after the 40 minute mark to tell me the veterinarian would be with me after 1 minute. Ten more minutes passed and no one came. My dog was whimpering more and more at this point. Finally at 4:30, the vet comes in, smiling and kind, and asking me for doggie symptoms. I ask her about fleas, but I swear, this place was so profit driven that the VET DID NOT EVEN CHECK MY DOG FOR FLEAS BEFORE GIVING ME A PRESCRIPTION ON MY FLEA MEDICATION. The mere mention of \"I think my dog might have fleas but I don't know how to check for them\" initiated a conditioned response \"I'll prescribe flea medication\" WITHOUT LOOKING AT THE DOG. I asked kindly to hint to her that my dog might not have fleas because the itchiness could be a symptom of allergies. She then shows me how to check for fleas, but doesn't find any as she shows me. She continued to write down a prescription for fleas on my bill without my knowing. Is this a professional business? How can they cheat people like this!\nAs I continued to ask questions to make sure what my dog had, the nurse seemed to reply with more things to run up my medical bill. She gave my dog a unnecessary skin scrape for mites TWICE even though SHE SAID that it didn't seem like my dog had mites, she performed and charged me for the scrape all the same. Because I had never needed to have these operations performed, I did not know that it was an extra $30 to have skin scraped. She went to look at the scrapes under the microscope, and returned another hour later. By this time, it was 5:30 and my patience was running low. For three hours, I sat in a stuffy room, covered in urine and staring at my miserable dog scratching his skin to bloody scabby bits as the doctors and nurses neglected the both of us. Honestly, I was so frustrated, I didn't even know what to do.  I had never experienced such a horrible medical visit. \n\nAround 5:35 when she returned, she apologized for being gone for an hour, and she said she had to look over a pet with a \"real emergency.\" I'm not here to disqualify her statement, because I understand that this is a real animal hospital and that other people may have pets who are dying. But I also understand that this is a FOR-PROFIT animal hospital, and if they don't even have enough vets to go around that I have to wait three hours for something that takes less than 50 minutes, I truly will never EVER recommend this place or ever set foot near this place again.\n After she came back, she confirmed my dog had no mites, and gave me a pet \"cone of shame\" that I had asked for earlier. She told me it was $15 cone, and gave me flea medication and antibiotics for the infection. She hardly looked at my pet. The only part of the visit that was clear to my mind was that she kept saying \"ow\" when my dog nibbled at her fingers.\nI excitedly hurried out and paid my bill. EXCEPT IT WAS $207. I let the vet CUT MY DOG for $32, the flimsy cone was $30 in addition to the $29 un-needed flea meds. I cried.\nI think my only mistake was coming to this hospital. Be wary of coming here as the more questions you ask to get a better idea of your dog's condition, the more services and products they try to shove down your throat to earn revenue.","useful":10,"funny":4,"cool":0},
{"review_id":"VaRgNn5ae9oCjSaS7ngXxQ","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"tNxGH0dYx_JinTxnwwjZUA","stars":4,"date":"2017-09-17","text":"I haven't been to many Charlotte breweries, but I can see why Sycamore has a cult following. In addition to having a super memorable and cute logo, they have a lot of space for large events and a minimalist venue making it a versatile brewery for holding events. Today for the Panther's tailgate, they had Tin kitchen's food truck in the back for hungry folk to annihilate. I'm new to the idea of bars without food offerings inside but I find this model genius; Sycamore itself doesn't have a kitchen, instead has partnerships with local food trucks so that the menu changes every time you come. What is special about them is that they do have a wide array of special brews to choose from, so for the adventurous beer drinker, this is the perfect place for people who get bored of beer that taste just like beer. They have special brunch beer cocktails which seem to change weekly. I haven't tried them personally but they look and sound pretty interesting! Bloody Mary beer cocktail anyone?\n\n In particular for fall, I enjoyed their Cinnabun Brown Ale, Sweet Potato Wheat, Pumpkin Latte Blonde, and Gourd Have Mercy Pumpkin Amber. A pint of gourd Have Mercy Pumpkin Amber on a Sunday ran me $6, -not bad. While we watched the Panthers game inside, live music was running outside which was enjoyable once the game ended. I can imagine it being packed for weekly tailgates on days with home games, but when it is not busy, it is a very nice brewery to just sit and relax in. I haven't been here after work yet, but I always see it lit up and populated on the ride home from the light rail. We didn't see any typical backyard games like horseshoe, corn hole or giant Jenga, so I think it's a good place to go for a chill night of hanging out. But when there are special promotions or events going on, you can count on me that I'll be back.","useful":0,"funny":0,"cool":0},
{"review_id":"PPR5uFweCWAlnv-LP-wteg","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"ooQZTGrJhI5H5dW7kGsipw","stars":5,"date":"2017-12-22","text":"Great beer selection, even for an amateur like me. There was a line out the door on a Wednesday evening. It was cozy, almost like having a large house party. The beer on tap is the greatest since sliced bread. Allow your customers to serve themselves, and you'll surpass records of beer sold during your first weekend of operations. You can try and be loyal to one beer, but It's quite inexpensive to get a sampling of each (and there are dozens of beers on the wall) - beers range from 30cents an ounce to a few dollars. The wristband is convenient, just scan your band on the little hop engraving under each tap, and it will activate. Angle your glass before you press the nozzle (this is how you avoid a glass full of foam) and pour away. This place is cozy in the winter but would also be great during the summer as well. Bring a date, or bring a crowd and have a pizza party here- it's a place you have to check out if you're in the area. Restaurants around Hoppin are also pretty good so if you don't eat here, you can always hop across the street to Seoul kitchen.","useful":0,"funny":0,"cool":0},
{"review_id":"dc49FHGMcd2fYJ70lr8FSQ","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"uejutOD4_-IUaY5cKkpezg","stars":5,"date":"2015-12-21","text":"Came here in pursuit of a local small coffee shop that ain't Starbucks! It's very homey- the table tops are made out of wood grain and the atmosphere is very relaxed. The cashier is all smiles.  You think there are only three tables but you look to your left and there's a whole other seating space to take advantage of. I came here right before the said happy hour and got a medium cappuccino sprinkled with hot chocolate powder for $3.75 (with tax). I saw that they also offered breakfast items that are similar to Bluestone Lane in NYC, like the avocado smash bagels and avocado eggs Benedict.  The drinks are all under $4, but the price of the menu items seem to make up for the difference. A fruit cup will set you back $5. However, my friend ordered a bagel and it was served on a nice platter. Good service and good environment. Bring a friend and have a coffee chat! It's quiet in the afternoon.","useful":0,"funny":0,"cool":0},
{"review_id":"eEYM8NKhF1Uq_O1zepTXnw","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"osSwv6CJy5hDKQdOKeyTow","stars":5,"date":"2017-09-18","text":"Sushi was great and inexpensive. Yes, they are famous for their sushi lunch buffet, but I have never been there for that! I declare that as the next frontier to conquer...\n\nI had read on some Charlotte email newsletters that Oku sushi was great and had won some kind of Charlotte sushi award, but I don't think you can compare Rusan's to Oku. Sure, they both serve the same thing, but the indoor ambiance really makes a difference on the dining experience. Oku sushi is more of a hipster sushi place that you'd go on a first date on, and dress up a little more to, while Rusan's really focuses on value of their sushi while exuding classic characteristics of Asian restaurant by having sticky tables and crumbs on booth seats. I wouldn't be scared to come here donned in athleisure-wear and tennis shoes. But hey, I like where their priorities are at (sushi crafting). I guess since I mentioned it with Oku, I have to say by no means would I not take someone on a first date to Rusan's- if I knew anyone who shares the same passion for fish as I do, this would be my go-to date night restaurant. It's not hipster, but it's definitely not trashy. Your chopsticks might be disposable, but the flavor variety and sushi-eating experience is everlasting.\n\n For $10, you can get anywhere from 2-4 rolls at Rusan's, while you barely can get an appetizer at Oku. Service is fast, and their fried iced cream dessert is absolutely delicious. They have so many rolls to try, so it will be awhile before I get tired of coming here. With two medium sized adult asian females, we downed five rolls and a fried iced cream and the bill came out to be $20 each.\n\n I'd take a huge group of friends here, or just eat and catch up with one friend. Either way, I can't wait to go back for the buffet, but since my office is just out of range from here, I guess I'll have to wait for a holiday.","useful":2,"funny":1,"cool":1},
{"review_id":"BhS4uMJlC3l-lo3qnXCLCw","user_id":"0Q5EIFIxISWttluPPHh2ag","business_id":"zr8Ojsm-yNhvfTzBzcKU9w","stars":4,"date":"2017-12-10","text":"Had a casual lunch here. The savory crepe was delicious, but the cheese became too much after awhile. It's a bit hidden in an office building but it's a great place to take people \/coworkers for lunch. It's different from what I usually have (sandwiches, bowls) so every once in awhile I like coming here to change things up. Anything on the savory menu is good. Personally the pesto is great, but definitely try the curry as well! (There's a good kick of spice in it)","useful":0,"funny":0,"cool":0},
{"review_id":"KWNdOhY16ZEJiw4TNAHxIA","user_id":"qcXfYIc_fCA0KjfGFTkuGQ","business_id":"8MSzI-4KJHpGBLiILkrtVg","stars":5,"date":"2017-01-19","text":"I love this place the staff are always so welcoming and friendly you get a lot of food for your money","useful":0,"funny":0,"cool":0},
{"review_id":"x37DwAnsCambhVb529lwNA","user_id":"EmLSHnNmge833K98Gm1zMg","business_id":"-95mbLJsa0CxXhpaNL4LvA","stars":2,"date":"2016-04-02","text":"I love this little ice cream shop and enjoy their ice cream immensely.  I've visited their shop at least 10 times over the last 7 months.  Their peanut butter - chocolate ice cream is probably the best ice cream I've ever had. Truthfully I would visit more often but their service is awful.  Allow me to explain -\n\nEVERY SINGLE TIME I visit they are out of something.  If I want to order a banana split they are out of bananas.  If I order a sundae that comes with strawberries, they are out of strawberries.  They always have the same excuse, Oh my manager just went to the store to get some more (insert missing item), is it okay without?  One time I was told, we are out of bananas, I suggested a discount for a banana split without bananas and suddenly out of nowhere, a banana was found.\n\nAnother thing I've noticed is, I never see the same ice cream makers in the store, always a new fresh face.  As a result, what I order is NEVER consistent.  One visit I will get a generous serving of whipped cream, the next visit hardly any.  Next visit I will get an entire sliced banana, the next 6 thin slices.  Obviously there are issues with the management and ownership of this cute and yummy little ice cream shop as this can all be traced back to them.    I wish they would get their act together and provide consistent customer service instead of excuses.","useful":2,"funny":0,"cool":0},
{"review_id":"1aXrhLqtAu06LppGMlnG7g","user_id":"EmLSHnNmge833K98Gm1zMg","business_id":"zRqi6L1u-YmmVAHjeUbGMQ","stars":3,"date":"2016-08-07","text":"Hello, today I visited SkinnyFATS for the first time.  I rated it 3 stars, parts of my visit were impressive, others were not.  Allow me to divulge.  The menu and food selection are great.  Wide variety of offerings, prices in-line with what you get.  I was impressed and excited to get on with my meal.  I ordered from the Things in Bowls section of the menu, and opted for the Smoke in a Bowl.  The meal was good, I would have it again, filled me up, plenty of chicken, plenty of vegetables, nice flavor.  It was good, nothing to write home about, but good.  One thing I noticed, not sure exactly what black bean salsa is at SkinnyFATS, but I didn't see a single black bean in my bowl.  It was very dark where I was sitting in the restaurant so maybe I just couldn't see it.\n\nThe customer service left a lot to be desired.  It's all about training your employees, some owners\/ managers take it seriously, others don't.  The person that took my order was great, friendly, helpful, nice smile.  I should mention I was asked to provide ID as I was using my debit card.  I assume SkinnyFATS has been burned repeatedly by their customers using debit\/ credit cards that don't belong to them, hence they card you, doesn't say much about their clientele overall.  Also, I ordered a Coke, I was truly surprised when I got to the soft drink fountain and Coke wasn't an option.  Seems that should have been mentioned to me.  The person that brought me my food, didn't say a word to me, not one.  I offered a Hello and a Thank You as my food was delivered... my words were completely ignored.  Very common courtesy dictates, especially in a retail\/ business type of establishment that when offered a Hello or a Thank You by a customer, a simple reply is good business.  I assumed the person that delivered my food was having a bad day at work.  As I was enjoying my Smoke in a Bowl one of the staff was busy clearing and cleaning the table next to me.  As this person started to vigorously sweep the floor beneath and around the table next to me, I lost my appetite.  Sweeping the floor stirs up dust and whatever else is on the floor.  In my head I was imagining all sorts of debris floating around in the air and landing on my table and on top of my Smoke in a Bowl and in my off-brand Coke.  I was disgusted and soon stopped eating.\n\nSkinnyFATS and another restaurant I consider to be very similar in concept, Greens and Proteins, are welcome additions to the Las Vegas restaurant scene in my opinion.  Next time I'll probably head to G&P where I always get top notch food AND service.","useful":0,"funny":0,"cool":0},
{"review_id":"Aa1dhFtcFyO0zc4k89V7qA","user_id":"O9c4P42hb-iSgx7tovndog","business_id":"_ZfjpSEO5ntk-1hbnwCR4g","stars":4,"date":"2016-09-28","text":"Late post. I stayed here from August 23 to the 26th for a Birthday trip. I loved this place it was exactly what i seen online. My room was clean, nice and quiet. I wanted a view of the city and i got an amazing view on the 50th floor. My room was non smoking once i got out of the room the hall smelled like smoke. I was never bothered by the staff and they were nice and friendly. My check in and check out process was very fast. Only thing i was bummed about was the pool it was nice but small and closed early. Wish it was open late everything else seemed to be open. I would stay here again.","useful":0,"funny":0,"cool":0},
{"review_id":"jUQun3eMRJlCVR_QBKttQw","user_id":"O9c4P42hb-iSgx7tovndog","business_id":"I1gRYCt2exnOMsTr-lEJVA","stars":5,"date":"2016-08-25","text":"I took yelps advice and it didnt do me wrong . When i arrived i was greeted by some very friendly staff. I felt very welcomed. Means alot when your traveling alone. First thing i noticed about this place was the cute decor different but i liked it. Especially the use of different kind of chairs. They gave me time to figure out what i wanted and made great suggestions. I ordered food was good and i was full. Only thing that wasnt my favorite was the water but i think thats a city problem . I checked in with yelp to get a free mimosa. Mmmmm. Kinda strong but they dont play in Vegas. My bill was very affordable. The mananger was even nice enough to seat down and give me suggestions on what i can do here. Very nice and sweet of him. Go check them out.","useful":2,"funny":0,"cool":1},
{"review_id":"6DW0IGM9EycLiF13NPGcPw","user_id":"xEgrCPpsHKojYVAlpyqOXg","business_id":"HaWU8ICNtjIkCN_ZNrx1hw","stars":5,"date":"2016-07-23","text":"BAM!!! This is the spot!!! Ever since my first visit it's been great each time!!! The food and the drinks!!! And the fraps are bomb!!! The gals behind the counter that work at Illumilate are totally down to earth and are real real cool!! BAM!!!","useful":0,"funny":0,"cool":0},
{"review_id":"HNzUdCOUeNumhrjVqtaN3g","user_id":"u1yV4xRUwNxv150qyZKTxQ","business_id":"s_7T0ET8svmbLklIucYeHg","stars":4,"date":"2011-01-31","text":"After a rough morning a good lunch was in order and that I found at Blue Sky. Me, my wife, and my cousin\n I was blowin away at how delicious the food was, I ordered a Philly Cheese Steak Supreme and so did my cousin and OMG is had me wanting more even though I was full. My cousin (who is pregnant atm) said that she was full and said she couldn't help herself it was good she had to keep eating. She said it must be the baby telling me he likes blue sky lol.\n  So if your in the area I highly recommond stopping thru, dont know about the latenights but great during the day, and dont be fooled like I was by the look, the food is good.","useful":2,"funny":2,"cool":2},
{"review_id":"sMxR_56zAR7Jkkne40QFKA","user_id":"u1yV4xRUwNxv150qyZKTxQ","business_id":"MdnYGOVa3goIGfKjrOCXqQ","stars":4,"date":"2011-01-29","text":"I have passed this place a few times and the great smells had snatched me by the nose and smackec my tasted buds for me to turn around. So finally with sometime on my hands me and my wife stopped in. The menu was full of things I wanted to try all at once but I finally went with the Souvlaki Platter and my wife ordered the Baked Ziti, the prices were very reasonable and I was greatly impressed for how small the resturant is. My greek salad was fresh even for it being late at night and my marinated pork was so delicious that my tongue smacked my brains for not stopping before. My wife's ziti was obviously good cause she was giving it praises like no other lol, no to mention the portions were very hefty. The experience wouldnt have been excellent if it wouldn't have been for the ever forgetful waitress. Highly recommonded.","useful":2,"funny":2,"cool":2},
{"review_id":"E3odDjdSoFAU-_m1FvXSRA","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"yqYtY3-Po4OVPafA9Z-Xyw","stars":2,"date":"2015-03-29","text":"Went here and was somewhat disappointed.  Food was mediocre and service was very slow.  Was basically run of the mill americanized asian food (not that there's anything wrong with americanized asian food but there's nothing good about run of the mill).","useful":0,"funny":0,"cool":0},
{"review_id":"Iuoy0o4yfYBLLvypTCOS6Q","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"gDjHnPJDx9ZVse0i9mp5hQ","stars":4,"date":"2015-03-29","text":"Eat here fairly often and food is always consistently good. Casual dining room and also great for takeout.","useful":0,"funny":0,"cool":0},
{"review_id":"mXI51rbrwwBp6V-wACzhew","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"VuCrxI61nT30OndMcrPgkA","stars":5,"date":"2015-03-29","text":"Pros:\n- Very cool vibe\n- Great coffee and beer\n- Live music Wed, Fri eve and Sat noon\n- Beards\n\nCons:\n- Makes other places look bad","useful":0,"funny":0,"cool":0},
{"review_id":"4nXHhR3T_hb5KhQKgSU14Q","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"vQq_sX0kSAUdT3yLW06q5A","stars":3,"date":"2015-03-29","text":"I've eaten here many times and in general it's fairly good but all the food pretty much end up having the same taste. Everything is OK (really I haven't had anything bad there) but I haven't had any kind of food that stands out either. \n\nIt's a good place for lunch with colleagues but there's definitely much better Mexican food around.","useful":1,"funny":0,"cool":0},
{"review_id":"yzfP3rMTfJvnwrsX8IXm1Q","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"mm0qwYzOilFNVV2us5_8Rg","stars":5,"date":"2014-07-15","text":"Very nice independent coffee shop with good coffee (especially their single origin) and very good in-house baked goods.  Nice place to work from for a few hours as well.","useful":0,"funny":0,"cool":0},
{"review_id":"EFTDgRRHMaQftj-96koitA","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"hxUxeY8DG9lhyjCVo_s-pw","stars":2,"date":"2015-10-04","text":"This review is based on 3 separate visits to Fate. The beer was decent (not great but good enough) but the food is just very, very poor. Over 3 visits (ate at each one) one experience was mediocre (pizza came out OK, appetizers mediocre) and the other 2 the food was really just awful. I think they might need to be on Kitchen Nightmares.","useful":1,"funny":0,"cool":0},
{"review_id":"MRdfuLcp88OJbPuNoaJqiQ","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"tnG4_L5bZiffTbaFru9EBg","stars":5,"date":"2015-06-01","text":"I have to say that this is our favorite arabic (lebanese style) restaurant in the scottsdale\/tempe area.  Food is consistently good - in the several times we've eaten here were were only ever disappointed by a single lentil soup that we ordered and they took it back with no questions.\n\nAll of the grilled meat is good as is the baba ganoush and hummus. Falafel is also really excellent.","useful":2,"funny":0,"cool":1},
{"review_id":"Xhui7DP2nNmIG98LILudsA","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"PCiyAPyWO9_6IUWgw7Pwog","stars":5,"date":"2014-07-15","text":"This is a great independent cafe with very good food.  For breakfast everything is good but the Waffle Cristo has a special place in my heart.","useful":0,"funny":1,"cool":0},
{"review_id":"5T1VyHvIMvA0sQfNemzfVg","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"pHpU8lnnxMuPWRHOysuMIQ","stars":2,"date":"2015-06-01","text":"Went here for brunch and was quite disappointed. I got chorizo benedict and my wife got farmhouse omelet.  My eggs whites were somewhat underdone, which doesn't bother me too much but even these were really on the undercooked side, my wife's omelet was good but somewhat small, however, our potatoes were terrible... over salted deep fried hash brown pieces.\n\nWaiter looked and acted like he's just been dragged out of bed and wanted to be just about anywhere else but there - and ambiance\/music was kind of noisy too.","useful":2,"funny":0,"cool":0},
{"review_id":"jLn79oA51JjBylgBNfrCdg","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"9RHaeLIbJ3NFzrJI8RaZqQ","stars":5,"date":"2015-03-29","text":"We've been training with Ian here for over 6 months so far and highly recommend both the gym and Ian. Don't expect anything like a big-box gym experience - this is a performance training facility focussed on results!\n\nIdeal for athletes or former athletes but also is accessible with top-quality training for desk jockeys too.","useful":0,"funny":1,"cool":0},
{"review_id":"xxLE-h6gSTRWaAcL68-4Og","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"eN8mkjt_q686hGKi-A9ceg","stars":5,"date":"2015-06-06","text":"Excellent Lebanese food! Everything was fresh and very well made. Has the authentic taste of Lebanon that is hard to find outside of Lebanon or high concentrations of Lebanese population. Very, very good and authentic!","useful":0,"funny":0,"cool":0},
{"review_id":"oSQfsJ9ibfYUGeohvEYx7w","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"Ly2ShApiomYZwKehwb7eRA","stars":5,"date":"2017-09-24","text":"My wife and I absolutely love this place. We lived in Japan for many years and it's very rare to find a restaurant with authentic Japanese taste in the US. Hire Sushi definitely has it though.\n\nTip: try sitting at the sushi bar (walk in only) and listen to the chefs banter in Japanese. Even if you don't understand it it will be fun.","useful":2,"funny":1,"cool":2},
{"review_id":"3QizazhkPMvt3KugTt86UA","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"RtnTbhWYw4QjKhoTBV37OA","stars":4,"date":"2012-01-22","text":"Not a quiet atmosphere but a good one none the less.  Highly recommend the Mac and Cheese and Jumbalaya.","useful":0,"funny":0,"cool":0},
{"review_id":"SM14MD2oNDj5crTfeZX4Dg","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"BtucUO30pD01YHNmLNs2Zg","stars":5,"date":"2014-07-15","text":"This is a very good hookah bar.  There's a lot out there that really don't know how to make a proper hookah, this place, however, doesn't have that problem.  Nice couches and music (not live) make for a cool laid back atmosphere.  Frequented by real arabs too.","useful":1,"funny":1,"cool":1},
{"review_id":"ZvN-NRU2D5n7sMzxBm5ziw","user_id":"KLLBg8pTzjiD1nWUHsjMAA","business_id":"83WxQY0j17oZBleXUIBeAQ","stars":5,"date":"2014-07-15","text":"Very nice independent coffee shop near old town Scottsdale.  Usually some great jazz playing on the radio (they have live music too) and it a nice quiet and open feeling space.  Friendly staff - definitely recommend.  It's 'attached' to a church but don't worry - it's independent and nobody has attempted convert me ;)","useful":0,"funny":0,"cool":0},
{"review_id":"fsg3SawzV7g-uSBoJOGzww","user_id":"5PpaqrtrU-firmGnaO43iw","business_id":"0EgYXYjt2XJL4hlsKnzrcw","stars":1,"date":"2016-01-21","text":"Ridiculously overrated hipster food. Crappy coffee, that they sweeten for you. we asked for sweetener and were told they would do it for us.  Apparently they dont trust us to sweeten our own coffee with their \"craft\" ingredients.  One plate came out cold and 5 min before our other plate.\n\nThe bathrooms are hidden behind a partition with ZERO indication that they are bathrooms. I never got a coffee refill, strange for a \"coffee bar.\"\n\nAltogether $30 for two people to have crappy coffee. We sent one back in exchange for an espresso. It was better tasting.  The food tasted ok, not great and definitely not worth $12-$14 a plate. The coffee SUCKED.  \n\nI will be going back to The Egg and I.  Fuckin Denny's beats this place.  But, it's trendy.  Great place if you care about being trendy.","useful":2,"funny":1,"cool":0},
{"review_id":"HJLLq_rAvnwSO49XOQaMrA","user_id":"28c2DanLfYtuNU5rNHziPg","business_id":"P2epFHigkHzKhggZqb4hOg","stars":5,"date":"2016-05-09","text":"My mom and I had such wonderful experiences at Ave 22! I first discovered them when I walked by and saw all of their veils in the front window. I popped in without an appointment and they were very welcoming and accommodating. After I showed them a photo of my dress and told them about my wedding and what I was looking for, the consultant said she had the perfect veil for me. It was gorgeous! Simple and elegant, but very dramatic. Their prices were also incredibly reasonable. I wasn't able to make a decision at that time, but they created a file for me and kept the veil on record. When it came time for my mom to look for her dress I recalled how many absolutely gorgeous mother of the bride and bridesmaid dresses I walked by on my way to look the veils. After going to several bridal stores in Vancouver, I suggested that my mom take a look at Ave 22. She had a really good idea of what she wanted, but couldn't find it anywhere and was having a hard time describing it to her consultants. We met with Cara at Ave 22. She was an excellent listener and has the patience of a saint! We went through a lot of dresses, and Cara was always kind and caring, and helped us with eliminating what wasn't working. Their assortment was so wonderful that we ended up finding two amazing dresses for my mom. She couldn't decide between the two, but their prices were so excellent that she ended up buying both. I also came back to try on the veil I had originally looked at. When I saw it on with my dress it was absolutely gorgeous and exactly what I was looking for. I had previously gone to Kleinfeld for look at veils and accessories, and found that I liked Ave 22's selection far more than Kleinfeld's. Thank you to Shirley, the owner, and Cara for such  wonderful and stress free experiences. I would highly recommend them to all of my girlfriends. My only regret is not finding them before I bought my wedding dress.","useful":3,"funny":0,"cool":0},
{"review_id":"BynHabqBtmdxRozYFZV8mw","user_id":"0pVhvSq4lAJhLzZ5GBIojQ","business_id":"sByhyN_S2FgNnPl5pqY0Ow","stars":4,"date":"2015-09-29","text":"I hate to have to give, only 4 stares. All in all, the pizza was great. Wings, really really good, but..... , they were very small wings. Size does matter. Plus it was a one hour wait, for the delivery. That came from, just up the street. Time wise, a little excessive. But after all, it was still a great meal. And it was worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"bp270CGLua8CFXDkddgoaA","user_id":"Z1AeKHoc3qkymg5b1eP7iw","business_id":"3GEEy7RP6e4bT4LAiWFMFQ","stars":5,"date":"2015-08-27","text":"Atmosphere awesome\nPizza perfection\nDraft delicious\nService spectacular\nGreat explanation of the menu \nOrdered the Romana #1 then the margherita and now on to the Italian pear and prosciutto \n\nThank you Vegas downtown your Pizza rocks!","useful":0,"funny":0,"cool":0},
{"review_id":"fpHPFPejh1ol6UyWSL4L_Q","user_id":"t4ett1XjI-H6_2yDsSy4FQ","business_id":"N4-cdkXF1uDFH_Kfok6yEA","stars":5,"date":"2016-09-23","text":"I have been coming here for about a year and I love it. The staff is really friendly and take great care of their patients. I got Invisalign and it's the best thing ever!","useful":0,"funny":0,"cool":0},
{"review_id":"WolzKnrGmYXgd7_VRgXUlA","user_id":"t4ett1XjI-H6_2yDsSy4FQ","business_id":"h72AsjSTT3dPzYejT57mdQ","stars":5,"date":"2016-04-12","text":"I have been going here for 2 months now and I love it! If you want to lose\/gain weight and get in shape, come here! Sid changes up your workout every day and motivates you to do things you didn't even know you could do. I feel better and stronger every time I leave. Plus, you can come in any time during business hours and train for as long as you want! It's amazing. After my first week, I was hooked. You can see and feel a difference and it's addicting. I love coming here!","useful":0,"funny":0,"cool":0},
{"review_id":"OEg2vtoqydCKWu7P5YpRdg","user_id":"t4ett1XjI-H6_2yDsSy4FQ","business_id":"M8a5DRdXl8KMu4bMFLPgQg","stars":1,"date":"2015-12-07","text":"Awful. The owners are so rude and the nail specialist are very unprofessional. DO NOT COME HERE\n\nI came here because of the great reviews on Yelp but I am extremely disappointed with the customer service and the way my nails came out by Ani. I will never come back here. \n\nI would recommend luxury nails or creative nails, they are both nearby.","useful":3,"funny":0,"cool":0},
{"review_id":"MuckZH8IjBm7wMe8PQfRRQ","user_id":"t4ett1XjI-H6_2yDsSy4FQ","business_id":"KkmPDIWzvwbBpyqOHT6pcQ","stars":5,"date":"2017-05-23","text":"I come here all the time. I live in Las Vegas and this is my go to Italian restaurant. \n\nThey have a great happy hour at the bar and have a great view of the pool and a cute room with tons of old pictures. The ambiance is amazing and the service is top notch.","useful":0,"funny":0,"cool":0},
{"review_id":"oCQSRUnATvWTVL5nXpqF2A","user_id":"Cjnph0Wn7jH7fd-Mqha5Lw","business_id":"dQ4pxV6AxBaD3X4gssg5zg","stars":5,"date":"2013-11-20","text":"Ok, so  this is my second time here in 3 weeks, and my husband and I are quite judgmental when it comes to Italian food.  We have our local favorites and were excited to try Giuseppe's as we love the venue for its outdoor dining patio.  So charming with the gas heaters and trellis and mood lighting and music.  What more could you ask for?  Well, yes, the amazing food!  We tend to judge our dining experience on the bread and salad to start.  If they are great, we know we are to expect great entrees, and they do not disappoint.  Fresh, hot bread with delicious olive oil and balsamic for dipping.  The salads included with the entree (rare these days) are crispy fresh and include many toppings, even cheese!! Not just some lettuce on a plate with some dressing.  Between the two of us we have now had four different entrees, and ALL delicious.  I cannot wait to try the next time something new. They have a great happy hour wine and appetizer selection, and if you get past that, the entrees are enough to bring home for lunch the next day, LOVE that!  You MUST try, you will be happy you did!","useful":2,"funny":0,"cool":0},
{"review_id":"khZ13x-d5xqWN2J020x24w","user_id":"Cjnph0Wn7jH7fd-Mqha5Lw","business_id":"Qoe164vOYpdcWNMvIgXaRA","stars":1,"date":"2015-07-31","text":"Beware!  My son just came from this dentist office with an appointment for full mouth xrays, a dental exam, and a cleaning, all covered by insurance.  After all the xrays and exam and one hour later, he was told he needed a deep scale cleaning for an extra $171!!!!  He has never missed a 6mos. cleaning in his life and when he declined the extra deep cleaning, they refused to give him a regular teeth cleaning!!!!!  They sent him away!!!!  Is it not a patients choice whether they would like to spend more money on their teeth?  What the heck is going on here????? I think this practice is trying to line their pockets with cash.  They were plain mad that their scheming did not work!  Please go elsewhere!","useful":6,"funny":1,"cool":0},
{"review_id":"6BhuZELnbL9e82yUpFTxXQ","user_id":"zHW6b4thIf0UsYVROW0ZPg","business_id":"CqVdLcbyZzfAjeCD1qEBZQ","stars":5,"date":"2014-02-20","text":"Wowsers is all I can say! Great food friendly service. And the most affordable meal you'll eat in town. The owners are welcoming right when you walk in this tiny unassuming restaurant. I would call this a must stop and only 15 minutes from the airport!","useful":0,"funny":0,"cool":0},
{"review_id":"q0EZhiPCerv3H5YdCMlpKw","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"3MUP4WhkJcw9YPdhQ3Ma5g","stars":1,"date":"2012-07-02","text":"$100 bucks to fix my scuba pro dive computer... batteries for life I find out from Scuba Pro of AZ... and their shop is under contruction... Only paid to mail it in! Not good to over charge people.\n\nThen $75 for a 7 foot regulator hose, on line $29 milfex no less... Not good folks.  I'm willing to pay more to have a shop open here and for the face time but your way too expencive!","useful":1,"funny":0,"cool":0},
{"review_id":"qlZoCsrmNZiYUI3c5E8g0g","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"mnwRtuVQEsIUomBchu0gwg","stars":2,"date":"2011-11-18","text":"I was not happy with the bad service and then asked what beer might match my favorite beer and i got a very wrong choice by the staff, then asked to try another beer for $1, wow that's wrong.  Then my friend ordered a simple Sam Adams and it was either bad beer or tapped to a wrong keg (either way still tasted bad).  Not a good showing and wished it could have been better.  I will try back in 6 months and see if they have oiled the process out to be better.  A word of advice, if you have 40 some taps of beer your staff better know them, go look at yard house....","useful":5,"funny":1,"cool":1},
{"review_id":"Te8VhRTXPlxbNjGuoMx9pQ","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"QttAkRKo07zC162Ghpeffw","stars":5,"date":"2013-10-21","text":"I've been with Dr Apio for 10 years and It's been great.  Her care is better than anyone in the valley... if you are willing, if not you'll wine about anyone!  A busy doc is a good one in my opinion...","useful":1,"funny":0,"cool":1},
{"review_id":"1Pn5AQhDrq5VKqezC_THHw","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"10cbzitPG_MXwUdMfSN2gw","stars":5,"date":"2015-08-21","text":"Did an excellent job for my new bumper, winch and rails!","useful":1,"funny":0,"cool":0},
{"review_id":"UyI-jJvPd0iQ_scspbr9wQ","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"d3ygrIfiL3Ysn1tHWPh1hg","stars":5,"date":"2013-10-21","text":"I've been to many sports doc's in town and he is the best.  and his treatments have consistently keep me away from a knife!  Thanks Doc!","useful":2,"funny":0,"cool":0},
{"review_id":"9ZcbOB2FZnUYOlxuMH1wdg","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"2-SIryQTQ-3y4sYzNoal8g","stars":5,"date":"2013-03-27","text":"The new owner of a year or so has done what is proper and just!  My ski jackets and paint for lost and his dealing with the problem was perfect. He was professional and prompt and always keep me in the loop.  Never did I think he would screw me and he just stood up and did the right thing.  Refreshing to see someone makes a problem go away instead of get bigger.  By making the fix to the problem right he showed me that this is a good company to deal with. The norm would not have done me right and I'd still have a problem or I'd have to compromise on some way. Thanks for being upstanding and honest, values our world need more of!","useful":3,"funny":0,"cool":0},
{"review_id":"4oxw3mHqdIEWmjIx4j89tw","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"Frp9q9UFqr1PlUOk9mgmvg","stars":1,"date":"2012-07-02","text":"No AC!  90 deg in the range is just bad!","useful":3,"funny":0,"cool":0},
{"review_id":"7qn0xbh1wI9YvZJ6L98TqQ","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"l6dEjWeflhFlPoocCTEXqA","stars":5,"date":"2011-12-02","text":"Best group of Ob\/Gyn's out there! (say's the husband! but they do really care!!)","useful":2,"funny":1,"cool":1},
{"review_id":"QiS0mb-vr03eeo08hn3ltQ","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"lbYpsLbIXxU86KPNj8AOgQ","stars":5,"date":"2013-03-02","text":"Found you today!  Outstanding, it's about time we had a good bagel in central phoenix.","useful":0,"funny":0,"cool":0},
{"review_id":"5Ynr5WwRTOVJ_3FJ6emsoA","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"CUivTcULsu5MJIYYNVm1zw","stars":2,"date":"2012-09-05","text":"Sushi was good but the other stuff we eat was not, over priced for what we had, nice service.","useful":2,"funny":0,"cool":0},
{"review_id":"oDOcqIFG2EHYADgDVBf2gA","user_id":"2UneBeHU5ChphZYs7KcuLQ","business_id":"1z-CbRwYt6a5k3xQLa2SFw","stars":5,"date":"2013-07-08","text":"Simple is the key, no crap, just fix-it.  Thanks... I'll be back... Everyone should use these guys! Honest and simple is working for me!  Thanks for doing it right.","useful":0,"funny":0,"cool":1},
{"review_id":"1IWmpUTH0ePGIAwLw7x7mg","user_id":"_htQl0vDgYY62dOVAp1YpA","business_id":"dUffgo9Lh_Vk9TLuFR5ywg","stars":1,"date":"2015-07-13","text":"HORRIBLE experience so far and we haven't even been sat down yet... Longest hour of my life so far!","useful":0,"funny":0,"cool":0},
{"review_id":"kAVO-PNdPOfxhm-pbmCYhQ","user_id":"_htQl0vDgYY62dOVAp1YpA","business_id":"YlwJYpBWa-oL0byTVPNKRQ","stars":5,"date":"2017-11-14","text":"Great place to hang out - great food and drinks. Shout out to Mary who is the best waitress there!","useful":3,"funny":0,"cool":1},
{"review_id":"KcgUrN3aTNAjXJFfMngruw","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"osReO-Gng40ZKYBMyvM2jA","stars":5,"date":"2015-12-15","text":"VERY SATISIFIED! I took my recently restored 1968 Cutlass to Allstate to fix a transmission leak. Apparently the trans is an odd one - a 2 speed  automatic.  Mitch looked at it and gave tne option of repairing the leak or upgrading to a Turbo 350 3 speed.  Decided to do the up grade and I am so happy.  Price was very fair and it was done on time.  Car runs and shifts like new!  Lots more get up and go too!  They did a great job and even pointed out a couple of issues my restorers missed.  I highly recommend Allstate Transmission.","useful":2,"funny":0,"cool":1},
{"review_id":"GcQ2BE62wWFwh8puzOeWIQ","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"t_J_ykCkOkZPlmlJuDnkzg","stars":5,"date":"2014-08-25","text":"I have been coming here for a long time - before it became CC's it was Chuy's, one of my favorite places for a casual meal. When Chuy's closed I was pretty bummed out.  I am so glad that Angela and Joyce took over and kept the place going - with pretty much the same recipes!  The food is as good as ever!  Great food, fair prices and a self serve chips and salsa bar.  How can you go wrong?  Highly recommend the 1\/2 or 1\/4 chicken, although the salad is really goo too.","useful":0,"funny":0,"cool":0},
{"review_id":"jTM1k2dcBpDPwdjMvCHjCw","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"UIYfXTdOEXfMIlBzERuFVQ","stars":5,"date":"2014-07-08","text":"Not sure why my 12\/2013  review was removed. I have had no experience with the after-school or summer program but PVSK is a great school to study karate.  My kids and I went there for years, had fun and enjoyed a lot of success.  Sensei Wall and his staff are all very knowledgeable.  The facilities are good and the atmosphere is friendly.  If MMA is what you want this may not be the school for you.  Sensei Wall teaches traditional karate and all the values that come from learning a martial art. We really had a great experience here.","useful":1,"funny":0,"cool":0},
{"review_id":"bTttH83v7bZiRLGqjxwcNg","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"aEs7Qle2Ah49dwaf3QNU1w","stars":5,"date":"2014-12-05","text":"My brother and I make the trek from N Scottsdale to The Drummer almost every weekend.   Jesse makes the HOTTEST suicide grilled wings on the planet - we love 'em!  Service is great and the \"regulars\" are pretty friendly too.  Drink prices are good and there are plenty of TV's.  One of the better \"dive bars\" in the area.","useful":0,"funny":0,"cool":0},
{"review_id":"KQApR5QxQOuoWg8G-wGIVg","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"Nc7cqq5k0WZsVhu25QrmNQ","stars":5,"date":"2015-12-15","text":"I took my recently restored 1968 Cutlass to Sun Valley Stereo.  Ryan and his team did a beautiful job installing an \"old school\" looking Retrosound radio, speakers, alarm and power antenna.  The system sounds GREAT.  I highly recommend Sun Valley Stereo!","useful":0,"funny":0,"cool":0},
{"review_id":"fZmTmJzAlXVVaNJ-xKy12A","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"pxkIhzA-XCLz1mtxITbs0Q","stars":5,"date":"2013-04-05","text":"Michael Dennis and his team have always been extremely helpful and professionl when I have pool problems I can't solve myself.  I can always count on X-Pools to go the extra mile to get things done!","useful":0,"funny":0,"cool":0},
{"review_id":"-qsp3-SHzYNFkj8ezQKpbw","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"v078BH3cCAeZyKOTe0ogtQ","stars":5,"date":"2013-04-05","text":"I needed a key for my 350Z and the dealership wanted over $200!!  I met Todd at his home on a Saturday and he fixed me up for a whole lot less.  He also copied my safe key that was almost bent in half  Got it home and it worked great!  He did a great job and I highly recommend him for any locksmith work you may have.","useful":0,"funny":1,"cool":0},
{"review_id":"3p7RZ0ETKUBz1gDiRHpJ_Q","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"NQtf94_0pNCBvcNTQESpOw","stars":5,"date":"2015-12-23","text":"10 year old unit stopped working right before Christmas - YIKES!  Jim from Hays came out and did a thorough inspection and gave me a few options.  He is a real professional!  Bob and Dan came out today and installed the new unit. They were excellent - cleaned up the mess and were done in record time.  Bob spent time making sure I was completely satisified, which I am!  Hays Cooling is excellent and I will call them when the other system on my house need to be replaced.\nUPDATE - 1\/1\/16 - Manny came out to check the installation of the new unit.  He was great!  He hooked up our load controller on the new unit Hays installed as well as to the old one that was on the house when we bought it.  I will be calling Hays when the old unit dies!","useful":0,"funny":0,"cool":0},
{"review_id":"dC6u4vsqMeoLrxqAs-MiQA","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"RGGOEmgtKXXZI91IXHEuIA","stars":2,"date":"2015-04-13","text":"I SHOULD HAVE LISTENED TO EVERYONE! \n\nMy wife and I went to Bonefish Grill Saturday night.  It was busy but not packed.  Had a reservation anyway.  Here is the positive - seated quickly, Rochelle (Awesome server!) took drink & dinner order and returned quickly with drinks.  Appetizer - Coconut Shrimp - came quickly and was delicious!  Now the night goes to hell!  We, and several other patrons, waited almost an hour for our entrees!  In fact ours was delivered to the wrong table and when this was discovered, picked up and brought to us. Not good!  If not for the fact we had waited so long I would have sent it back. Pasta was overcooked and came in one big clump.  Veggies were OK but very oily.  Fish was good.  MOD came to apologize and really had no excuse for the slow kitchen.  Offered a \"free\" desert for our inconvience ($5 homemade donuts).  I know they we $5 because they charged us for them!  In fairness they did take them off when I brought this to their attention.\n\nPretty unlikely we will ever go back.  Kind of spendy and there are lots of choices in our neighborhood.","useful":4,"funny":2,"cool":2},
{"review_id":"P5Wno3v-bV07dU_EiSVkuQ","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"MDLajW6yCfUJPDJRmhlobg","stars":4,"date":"2014-07-08","text":"Whenever my back starts to act up I give Maynard Wellness a call.  I have been seeing Dr. Turley for a while and he takes good care of me.  He is very friendly and professional. I am a pretty big guy and since he takes care of the ASU football team I figured he could handle me.  Nice clean facility and easy yo get an appointment.  Highly recommend.","useful":1,"funny":0,"cool":0},
{"review_id":"guRn3UtWYWo3t6EKQWNi2A","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"1RKS8f8p2vwFDoEPz8q5fQ","stars":5,"date":"2014-07-30","text":"I have been using C&R Tire for all my cars - 6 - for many years.  I usually go to the Tatum & Bell location.  Ralph and his team are very professional and have always done exceptional work at a very fair price.  I highly recommend them!","useful":0,"funny":1,"cool":0},
{"review_id":"VWZalxR-HU5fnq18wiBh_w","user_id":"nj9vFayHV1E5y5IDlfhtsQ","business_id":"Xv9kCl04nTNxny8xy9BOHw","stars":5,"date":"2013-04-05","text":"I am an aging martial artist and the years of abuse have finally caught up with me.  My back and hips have been causing me some painful problems.  I have visited several chiropractors in the valley seeking help.  Dr. Burnett is the only one who has been able to give me long lasting relief.  Her approach is refreshing and effective.  She spends time looking at my whole body and addresses the issues she finds.  And I really like the massage therapy after the chiro session!  She has an excellent and caring staff and I highly recommend Four Peaks Chiropractic.","useful":0,"funny":0,"cool":0},
{"review_id":"5fITAjHsK8jaepq2GZ1v-g","user_id":"N-9l4vFIGYM_FGZzA6CiCA","business_id":"En02RzaPS_5Exp8_LbJOdA","stars":1,"date":"2016-08-11","text":"The food is OK the idea is great but I'm not going to go there anymore with my friends because the cashier is a total bitch. I don't think it is normal for someone to tell a customer \"that's the way it works in Qc \" followed by \"the tip ain't included to the bill \" after adding taxes to everything. I was suppose to pay 15 per person. We ended up paying 20 each with taxes then she forced us to separately tip her 4 dollars with HUGE attitude. So we payed 24 dollars. That's a nine dollar difference. Taxes and tip shouldn't be nine dollars extra per person. \n\nIn conclusion, you should pay for the food, not her attitude.","useful":8,"funny":1,"cool":0},
{"review_id":"vsoJHRnE0BCF5uOWrXwU-w","user_id":"N-9l4vFIGYM_FGZzA6CiCA","business_id":"HLym8LvjIfaYzRqv3eqMwQ","stars":1,"date":"2016-12-22","text":"Avoid the bubble tea booth in the food court at all cost. The employees are rude and have screwed up my order every time yet they have refused to fix it. I ordered a Piña Colada bubble tea with bubbles. She makes it hot. The only Piña Colada article in the menu is a slush yet she kept denying it even when I tried to explain to her what a Piña Colada is. It's always a slush. She just gave me some lip and ignored me showing a sign that they don't refund or remake drinks. The bubbles were semi rough and my bf has gotten a very bad stomach ache after drinking my drink instead of me. Customers are always right, as specially when you make a stupid mistake. Never going back there and I would advise you to go to the cocobun in the joint mall. It's cheaper and the employees aren't dumbasses as far as I`m concerned.","useful":0,"funny":0,"cool":0},
{"review_id":"AIRyS5wrLriv4zLBD_PSQg","user_id":"HvhUkLwwofCX-usv1_055w","business_id":"vuHzLZ7nAeT-EiecOkS5Og","stars":1,"date":"2016-08-23","text":"If your home warranty company refers you to Aaron Pools for service do yourself a huge favor and ask for someone else for service. \n\nSomeone things that were working just fine all of a sudden don't when they leave. His response \"bad luck\". When the technician calls back he is rude and talks over you while raising his voice and acts like he was doing us a favor by fixing what he was contracted to do through the warranty company.","useful":2,"funny":1,"cool":1},
{"review_id":"NhMpY59QBdnc3N7rh4GhMA","user_id":"HvhUkLwwofCX-usv1_055w","business_id":"z0NImASe6DNDREiIt8NF-Q","stars":1,"date":"2016-10-31","text":"I wish there was a negative star option. I call in an order, nothing super crazy, 3 lbs of boneless, 24 bone in, and a few apps and was told 15 min. Mind you the world series was on as was a Cowboys game. I show up 20 min later and it's not ready. She says oh they are just getting it together for you. It was another 30 min of standing in the lobby until I got my order. All they said was \"she should have quoted you a longer time\". Um, ya think?\n\nDon't waste your time here as they don't value your time.","useful":0,"funny":0,"cool":0},
{"review_id":"lRcEWcAAxI678m4sD9aGPg","user_id":"HvhUkLwwofCX-usv1_055w","business_id":"9Bg2JLQdyf97KlNuRQ56HA","stars":1,"date":"2016-11-13","text":"It would be helpful if they had staff who listened...\nI clearly said NO guacamole on my order and it was smothered everywhere \nI call them back and she tells me there was no guacamole added to which I asked her to explain the green stufff all over. She says bring them back and they will remake them but won't won't start making them until I give the old ones back. Keep I mind I waited nearly 20 min the first time I was there. \nWhile waiting for the remake they messed up several other orders. \nShe gives me the remade order and the cheese was just thrown on there and not melted at all. I ask her to melt the cheese and she throws the styrofoam container in the microwave. \n\nOther Los Favs locations I'd recommend all day \nThe one on Cooper and Warner never again \n\nAnd to think they'll be making $10 an hour soon\n'Murica","useful":0,"funny":1,"cool":0},
{"review_id":"xUkmMmJW7g5U_t_g0_qD5g","user_id":"cvoio9O1bGVp9yTsE39eMw","business_id":"V90fC_aF-_DNYzQvUtbLww","stars":1,"date":"2016-09-15","text":"We are locals and decided to try Jayde since we love the M Hotel so much and thought for sure it would be great. We were less then impressed. We all started off with the cucumber salad that had been made early in the morning or possible left over from the night before. It was horrible and dried out and bitter.We all remained optimistic about the food we were about to receive but, looking back we should have just left. The tuna was horrible and none of us could eat it. The waiter acted like he had heard that a time or two. Some of us tried more rolls and some of us decided to go the Jadye Specialties. The fried rice at Panda Express is much better, the only item we could all eat was the dumplings. There was 5 of us and we all vowed we would never ever go back. Also, the staff could care less if you enjoyed the food or not.","useful":3,"funny":2,"cool":1},
{"review_id":"bmturDqxpwwxquknDMwUQQ","user_id":"RCAS_398Zs_OlT5njyey2g","business_id":"K-tKnqhblGR7K4R3roKmqA","stars":2,"date":"2015-07-20","text":"The sad thing about this place isn't that I could grab the same types of pies for like a dollar back home and that the place is a rip off (seriously you can get this crap on any street corner dairy), but that the guys that work there put on a hardout aussie accent when no one fricken talks like that in Oz...","useful":2,"funny":1,"cool":1},
{"review_id":"0rPeTBYD7Tx76zRgHiQq8Q","user_id":"RCAS_398Zs_OlT5njyey2g","business_id":"-juOL0eJC6kvf5RLEjoPvA","stars":4,"date":"2016-12-24","text":"It was definitely good food. But the price was really off putting. Rather expensive compared to other dim sum places I have been too.","useful":0,"funny":0,"cool":0},
{"review_id":"-p6LkvzktEv2ABKLtC7VMQ","user_id":"RCAS_398Zs_OlT5njyey2g","business_id":"isYj0rlYyUv3bUd4ZChxlQ","stars":1,"date":"2015-03-19","text":"I went here with 4 other friends. We all got FOOD POISONING the next day. I highly do NOT recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"mhOue5qeFukMhR0qNhR2tw","user_id":"RCAS_398Zs_OlT5njyey2g","business_id":"VM1xX5RizwVJ_TJ3ZUD8oA","stars":1,"date":"2017-12-12","text":"They have forgotten items for delivery 5 times in the past few months. One time I ordered a pizza and they forgot to bring the pizza! It was the main part of the order and they somehow managed to forget... This happens far too often. What upset me the most was that one time the delivery man said he would come back with the item that was left out, but he never came back.","useful":0,"funny":0,"cool":0},
{"review_id":"Fl2CrXmbjJ2foCdzZEG0Ww","user_id":"rc23Eq68aeCsEdYaK1OMiA","business_id":"FlgHwy8TwjK8e684ZNN-LQ","stars":5,"date":"2014-04-20","text":"Worked with Nate on the purchase of my new 2014 Ridgeline SE. \n\nWe were able to agree on a price on the new car and my trade quickly and completed the process in record time. No sales games and I think I got a fair price. Can't ask for much more.","useful":1,"funny":0,"cool":0},
{"review_id":"Mr9exFZb-iacnysa4NoF1w","user_id":"rc23Eq68aeCsEdYaK1OMiA","business_id":"k_HDSmO_GX3ZBdMHtgrKCA","stars":5,"date":"2012-05-26","text":"My wife and I go to Quince regularly. All food is prepared from scratch and is always excellent. \nMy wife has a gluten allergy and they adapt many items to address that. The menu changes seasonally and the presentation is excellent. All menu items are originals and creative. \n\nThe service is best in class and prices are reasonable for the quality and quantity served. \n\nStop in and you won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"_XMBQ92B_UDFAL8IHwdrjg","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"csRGmT0UZtcUDD3jHLygsw","stars":5,"date":"2017-08-09","text":"Sam is great. He listens to what you want, makes recommendations and installs quality products.  He is very professional and courteous and just a genuinely nice guy. He explains everything he is going to do and then makes sure you are satisfied.  The lights he installed look great and came out exactly as he described. He is truly the best!","useful":0,"funny":0,"cool":0},
{"review_id":"OM7vBcIKYNIuOy1ER-b5IQ","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"iH3mI3QpCX_-QylL4dVKIg","stars":5,"date":"2014-10-09","text":"Great work and very nice guy.  Ryan takes his job seriously and has a great attention to detail.  My rim looks like new!","useful":0,"funny":0,"cool":0},
{"review_id":"RFkQdlVbHPd7BhwgdnY89g","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"oVFRqhwQQ3zD3geTtRYZTA","stars":5,"date":"2016-07-13","text":"Bryan is fantastic. He is polite, responsible and on time. He takes the time to explain things and his prices are reasonable. I found him recently on Yelp and will continue to use him for all of my electrical needs.","useful":0,"funny":0,"cool":0},
{"review_id":"qnU_E_rwcM6Qz46EvwPLBw","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"x1Fg-pxoCq-BDhklj0GnRw","stars":5,"date":"2017-01-31","text":"These guys are fantastic.  Very professional and very courteous. They were able to troubleshoot an issue in our security system in a timely manner.  I appreciate their hard work and reasonable prices.","useful":0,"funny":0,"cool":0},
{"review_id":"y0GMmE5x1kcaBbeVDxj2xA","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"toBMu3SXZn-dpdmVrPe4aQ","stars":5,"date":"2016-07-22","text":"Great service! Gabriel responded to me quickly and had my issue resolved promptly. I had a particularly difficult deadbolt install that he did and he did it well. Definitely recommend.","useful":1,"funny":0,"cool":0},
{"review_id":"F0cgwY2dF9Z2THmQbIT9vg","user_id":"IDzgDcxbQcoJHau9NfMQBQ","business_id":"loze9bM2c5NgXhQLG54YDQ","stars":5,"date":"2016-07-13","text":"I have used Harper's for several roof repairs. They are awesome. Great customer service and stand behind their work. Had an issue that they fixed but then leaked again. They came back out right away and fixed it at no charge. Never had any issues with them and they are super people.","useful":1,"funny":0,"cool":0},
{"review_id":"Txviop71rAsRKl0Div9sew","user_id":"8QxEkytfVLIgkmnnEXVw0Q","business_id":"EyPDvFnc8Jh1kAZZMHoApQ","stars":1,"date":"2016-02-14","text":"I didn't apparently get the entire \"MOD Experience\" (that I've seen people on here complain of) as, I had to leave. I called ahead to ensure that this location had gluten-free pizza. We entered MOD & were not even greeted. We had to engage the employees in a greeting, etc. We then attempted to order 1 regular pizza & 1 gluten-free pizza. The girl who was reluctantly assisting us asked if the g-free pizza was a preference or an allergy. We stated (allergy) at which point she reached in the cooler\/freezer to pull out a pre-made g-free crust (she did not change her gloves, & actually took a regular crust off an aluminum pan & put the g-free crust directly on the contaminated aluminum pan). I will NEVER eat @ this establishment & I would recommend that anyone who has to eat g-free to avoid this place.","useful":0,"funny":0,"cool":0},
{"review_id":"RW2XOS_8cnFqF3tN0bNWGA","user_id":"72VoUg93k9anjC7pq3I6iA","business_id":"YQ0h5NTYgrBgOXf2VRYKVg","stars":4,"date":"2015-12-01","text":"Delicious pizza! The huge size reminds me of New York style pieces where the only way to eat it is folded in half. The thin crust was yummy and they fill the slices with toppings. Not bad for the price, definitely have had more expensive pizza. Nice new place in Medina. Staff was friendly too.","useful":0,"funny":0,"cool":0},
{"review_id":"0Yem7vh-a4w1vZmaZIdhgw","user_id":"bATKt-rgNSmj1rPadEgQHQ","business_id":"tniQZd6UFm46cu4pyN9HcQ","stars":1,"date":"2015-04-10","text":"This is the worst car rental place ever.  The way they do business is terrible.  They lure you in with the lowest price on the travel websites, but once you get to the counter to get your car, it's all about add ons.  The agent tried repeatedly to hard sell us on an upgrade, tacked on a $200 deposit, even though we told him we had insurance to cover the car he still put it on the bill and it was until I pointed it out that he took it off.  So frustrating.  \n\nI should have read these reviews before hand.  In the future, I guarantee I will never use this company again.","useful":3,"funny":0,"cool":0},
{"review_id":"sepMvHnE7Vmm6U6DMX1VWg","user_id":"bATKt-rgNSmj1rPadEgQHQ","business_id":"n-Muw3wnU-INyXkgPtZVVg","stars":2,"date":"2017-11-09","text":"We stopped at Peachtree for a glass of wine and appetizers. The place was comfortable. Unfortunately though not only was the bartender cranky but he made us feel like we were a bother to him. Then we order sweet potato chips which were $9. The chips were burnt and was about one cup total. So overpriced and bad quality.  Couldn't recommend this place to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"3oNi_kaC7vwbp18-Lgbr5Q","user_id":"QEEhwHgUQ5pqN9CauP4vkw","business_id":"qx_ZlGhgCrJ4-8FUj9LWKg","stars":5,"date":"2016-09-15","text":"Tae Kim is superb!\nHe worked professionally, took care of all of our coumputer issues. Highly recommended.","useful":4,"funny":0,"cool":1},
{"review_id":"EAQPFJV7lOLXHKnt_C29OA","user_id":"QEEhwHgUQ5pqN9CauP4vkw","business_id":"Ay34xZOFax3X23zaA3nwdg","stars":5,"date":"2016-09-15","text":"Great Italian menue, clean, great service. Very reasonable prices. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"XEj80YiMZKP0HUPDZcEYow","user_id":"QEEhwHgUQ5pqN9CauP4vkw","business_id":"G54fcIaoI89tc6X285suRA","stars":1,"date":"2016-10-12","text":"It is so sad that after loosing their cook, their floor manager, and their customers they are struggling to keep it open. I am predicting that soon they will close it down for good. They cannot survive with substandard food.","useful":0,"funny":0,"cool":0},
{"review_id":"89M55dH94FuIqHnFuAuS0g","user_id":"QEEhwHgUQ5pqN9CauP4vkw","business_id":"pcA3DcjbkkQERU1dbsiSow","stars":5,"date":"2017-05-08","text":"Excellent resturant. Great variety of tasty and healthy dishes.\nI have been in Chickpeas restaurant in the past 7 months many times both for lunch and dinner. Some times with friends and relatives. We will go back whenever we have the opportunity. The restaurant is clean, very friendly atmosphere, excellent food and prices are very reasonable. Recently, they revised their menu. Excellent selection of tasty foods.\nWe have been there with freinds and relatives, they love to go back there too; they really have enjoyed it.\nThis resturant has a great menu, Pizzas, Mediterranean, and Persian dishes, as well as fresh pastries and bread that they bake every few hours. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"qhUfN0DdNczcYIVcnMMYYQ","user_id":"9MG5edBAw_EGvYJ5v3g_8g","business_id":"A39hz1DwMkofh4lyBKJNmw","stars":1,"date":"2014-06-12","text":"This has been the worst experience ever I went in for a nose piercing and a couple days later the hole was closing because they put in the wrong size and didn't account for the swelling. So I asked if they could replace it they told me to take an advil and see if that helps......really? So I tell them that I want a bigger stud so that my hole wouldn't close back up. So one of the tatoo artist clearly annoyed said they would do it. I should have walked out then. I watched as they went into a tub of studs, then he began to file it down, during that time the jewlery fell on the ground a couple times. When he put the piercing in he was rough and very rude. He put a very long bar that stick out my nose. It has been 3 week and it is still very sore and not very nice to look at. I am going to a different shop tomorrow so that they can hopefully correct the issue. Please please do not go to this place.","useful":1,"funny":1,"cool":1},
{"review_id":"O-9hpdMLWH7-LIVG9k4i2w","user_id":"QmvxAq4mZysB5g3GDmVyUg","business_id":"arrewA1d56joAKoKwSjV6g","stars":1,"date":"2012-09-15","text":"Clean and spacious arrangement, however, customer service is VERY poor here. Was promised pant alternations would be done by certain time but when called they were still working on them. Was leaving on extended trip and wanted to have the pants so rushed in a few hours later to pick up. Since this was now very close to my departure, I was in a huge hurry. Had already paid so literally just needed to be handed my pants and on my way. However, with two guys working both were busy and did not even acknowledge my presence as  I stood there and circled around for 10 minutes. Not a peep. No \"will be right with you\" or anything. Finally grabbed one guy off of phone and got my pants and was out of there. But after this experience I would NEVER shop at Jos A Bank's again. I'm used to \"Nordstrom\" (and independent clothier) customer service. And this was far, far from it. Very unprofessional!","useful":2,"funny":0,"cool":0},
{"review_id":"XQDyWUiqCxgq_VQ8hMcoIw","user_id":"ApiuFCJYiAa4zQHdMMImsg","business_id":"ejdBoVvEdn5fdycuJRen8Q","stars":5,"date":"2011-08-16","text":"BEST FOOD EVER!!!! Their chicken w\/ broccoli is to die for. A bit of a hole in the wall tho...","useful":1,"funny":0,"cool":0},
{"review_id":"M-iP_aw06PnU2gI7joeucA","user_id":"XxrqfYMaPzp7IDcy8lSQMQ","business_id":"QIn3nMX3ywY8a2bCpyQcRA","stars":5,"date":"2016-09-04","text":"Never fails to disappoint!\nBest sushi in Richmond Hill \/ Vaughan area.\n\nGenerous helpings of amazingly delicious fish. Maki rolls are simply so fantastic that it seems impossible to ever have better","useful":0,"funny":0,"cool":0},
{"review_id":"Qab4SxNc7SnBJ5owSp88xg","user_id":"XxrqfYMaPzp7IDcy8lSQMQ","business_id":"F-bdXFkJwwENiNpMTG2ntQ","stars":2,"date":"2017-05-28","text":"Food with no taste. My suggestion to the chef: at least use a little salt next time!\n\nAll the dishes I sampled (from other family members) were really very bland. I think they may be counting on the fact you are drunk by the time your meal arrives. Nice beer though... if you are planning to go, just drink as much as you can and try to get drunk before your meal arrives... that way you wont notice","useful":0,"funny":0,"cool":0},
{"review_id":"ZiCcjNouE1hpD-lIqN44Gw","user_id":"XxrqfYMaPzp7IDcy8lSQMQ","business_id":"dw2ST-AHUbu2xq0QNfngBA","stars":5,"date":"2017-05-28","text":"Had the Gyoza to start. Excellent.\nNew York steak was very good and was served with amazingly done potatoes!\nHit the spot!","useful":0,"funny":0,"cool":0},
{"review_id":"Rk_RcYSKGFt1qaYtcOFESw","user_id":"XxrqfYMaPzp7IDcy8lSQMQ","business_id":"BvhpngYfuUBbNgXIlHTZNw","stars":1,"date":"2017-05-28","text":"These are by far the worst repairs I have ever had. First, they damaged my handbrake on my first encounter. When I brought it in the \"repair\" that they attempted lasted about a day or so. On bringing in my car for the third time, they replaced the whole handbrake mechanism (charged be $600+) and now while I drive my car there is a loud banging noise on each revolution of my wheels and high resistance to any acceleration I apply. I stopped going here! I dont even need a free repair from these guys any more","useful":1,"funny":0,"cool":0},
{"review_id":"eVSD94MWlN4tNb8aXNjaUA","user_id":"iLdjvT0KvcxX51falNI6hA","business_id":"aBLx9JlAMq_AuW6VAImSwg","stars":4,"date":"2013-02-27","text":"Went for brunch on a sunday at 11am.  The place was pretty busy, but our group of 4 only had to wait about 10 minutes and we were given a spot at the bar.  Love the decor and the fact that none of their coffee mugs match.  Our food was good, service was great and we had a good time.  I don't understand the complaints about parking- we found a spot down the street.  Heaven forbid you have to walk an extra 50 feet.  We loved it and will be back!","useful":0,"funny":0,"cool":1},
{"review_id":"TSQjAMCxZCYYFJn8OkEwgg","user_id":"iLdjvT0KvcxX51falNI6hA","business_id":"y1eeVRfJa22CCpUCeNfrSw","stars":4,"date":"2013-02-27","text":"The food is delicious.  Service... eh.  My parents had made a reservation for us (on a Wednesday night) and we were sat at a high-top bar table?  The dining area was wide open, so my mom wasn't exactly ecstatic about it. The staff can be a bit rude (stuck up).  \n\nAt our table we had basil rolls, fried wontons, red curry duck, basil chicken, volcano shrimp and the Pad Thai.  The Pad Thai was by far my favorite, we will come back simply for that dish.  We also had a pear martini which was delicious and unique.  Overall our dinner was great, but the \"experience\" not so much.","useful":1,"funny":0,"cool":0},
{"review_id":"3AJzkRq_bdkgYCZZwtBFkQ","user_id":"iLdjvT0KvcxX51falNI6hA","business_id":"RVQE2Z2uky4c0-njFQO66g","stars":5,"date":"2013-02-27","text":"We went last night finally after craving some barbeque for weeks.  Overall, our experience was awesome.  We had an awesome server, Cliff, who gave us his suggestions and was pretty entertaining.  We took Cliff's suggestion and got the Combo platter since we were newbs.  We ordered the brisket, ribs and doubled up on the pork bbq.  For our sides we got mac n cheese and fries.  Everything was really great.  The ribs were probably our least favorite, but they still tasted great.. just not as tender as we were hoping!  Pretty good beer selection and great service.  We'll be back!","useful":1,"funny":1,"cool":1},
{"review_id":"BERC3JpJYb8vWGRDS__xfA","user_id":"iLdjvT0KvcxX51falNI6hA","business_id":"V_VQ9BgbLEzL9mPLQQlc6g","stars":4,"date":"2013-03-15","text":"Salsa was delicious. Cheese dip was really good too. I had the shredded chicken tacos which were pretty tasty and my boyfriend had the chicken quesadilla which he gobbled up (it was also massive).  Only negative is that it is a bit pricy for mexican food-but it was delicious with large portions (and fresh food) so it didn't bother us too much!","useful":0,"funny":0,"cool":0},
{"review_id":"_C9MHU8ltqMR-zDQaddU2Q","user_id":"e07tXxT9ZUrTtM2BbvXkHw","business_id":"cTkya76AXsXylIyl5bFn4w","stars":4,"date":"2016-08-02","text":"This place is really good, great prices and food I've ordered from here at least 15 times and the only thing in my experience that is lacking is the beef it's ok but it could be better besides that everything else is great","useful":2,"funny":0,"cool":1},
{"review_id":"jaehHHAJBHpb0WqWRhHKqg","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"thLX_k20SPJ0KyusGTBIHw","stars":3,"date":"2016-02-15","text":"I came here yesterday for my first time after wanting to try it out for months. The decor is too die for, so adorable! \n\nWe got seated right away, I would of preferred the patio, but since it was Valentines Day I was happy we got seated at all without a wait. Our cute and bubbly comes in to greet us and we immediately ask to order the guacamole and she apologizes and says they are out and she should mention they're also out of flour tortillas?! Um, what? Mexican restaurant that doesn't have guac... you would think that would be simple to remake. But, of course maybe they didn't think they'd as busy this weekend being Valentines day and all. \n\nThe great thing is they have happy hour all day on Sundays and the drinks were amazing and delicious and pretty and anything else you can think of. The food on the other hand was nothing spectacular. I will definitely be back to give them another try when they might be more prepared and not so busy. The place was too cute and I've heard too many great things to not try them out again.","useful":0,"funny":0,"cool":0},
{"review_id":"WSZMPlQwQ_bW_rKpG8e6EA","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"UrMkd_SYKznavQT2HMHLXQ","stars":5,"date":"2015-12-07","text":"As I was pulling out of my drive way I noticed my passenger rear tire was flat. After stopping by QT to put air in, I noticed a massive nail... sure enough just my luck. This was the third time the same tire has had a nail in. So I look it to Discount and to my surprise there was no wait, they helped me right away. Quick and easy process and the best part it was free. They gave me a whole brand new tire since the hole wasn't repairable. I don't know why it was free, I never bought any warranty. I am assuming the tires themselves have a warranty (the tire was less than a year old). I will never buy my tires from anywhere else ever again. I am a customer for life!","useful":1,"funny":0,"cool":0},
{"review_id":"2p_sM_qaANqE1t6GblSxvQ","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"ezrNxiPJUYLJpDtTQyj9eA","stars":3,"date":"2015-11-18","text":"I came right when they opened at 11am. There was 2 people already in line in front of me. The sweetest lady ever greeted me and asked if I came in from the news (I guess they had a segment earlier this morning). I explained I work close by and had been wanting to try the place out. I ordered my food, which took way too long for my liking. I could definitely tell Ms.Dee normally doesn't do the ordering\/ringing up. Then sit and wait, and wait, and wait, and wait for my food. 45 minutes later I receive my food, and they are missing 1 item... so I wait some more. At last, my order is ready! Then I go to pay after I get my food (which is the strangest thing) they would of let me walk out if I hadn't mentioned I never paid yet. Great food, great people, but they need a lot more help in the back. 1 person to cook and 1 person to take orders obviously isn't cutting it. The people ahead of me actually walked out without getting their food. I mean a 45 minute wait when I was the 3rd person in line for a baked potato seems a little strange to me.","useful":0,"funny":0,"cool":0},
{"review_id":"PNc5DzgX95drqnm-7TCIeQ","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"gKXsFVhWyK7MLQhSKG5_mA","stars":1,"date":"2016-04-16","text":"Worst calzone I've ever had. The crust was thin, soggy and no cheese inside. All the other food was terrible. Keeping this short and simple. Definitely will never be back.","useful":4,"funny":0,"cool":0},
{"review_id":"hbRaNJdNEgVQOpaGfkMZhg","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"4iFYsHDzkuf3JjSzhaNd2g","stars":4,"date":"2017-08-21","text":"So I am now engaged and my ring is absolutely gorgeous! The only reason for 4 stars is that my boyfriend mentioned he had a bit of a mix up while dealing with Shane Co. \n\nWe went in together to pick out the ring and at that time he put a deposit down to hold the diamond that we were looking at (I was not aware of this as he went back at a later time). At that point it was explained to him that the ring would be ready in about a month. Well he said a month went by and still no word from Shane Co. He decided to call them to get a status on the ring. He spoke with them and they said they hadn't even started making it yet and that he needs to pay in full before the make the ring. He immediately is a little irritated as a whole month was wasted and he put a deposit down. I would assume he would of gotten some communication or follow up in regards to the deposit and when he would like the ring. My fiance paid in full for the remaining balance and at this point we are another month out before he gets the ring.\n\n I'm not sure if it was misunderstanding or if my fiance was told wrong information. Either way, it was not an ideal situation to be in.","useful":1,"funny":0,"cool":0},
{"review_id":"ThGtFpdPGkPuWxjuy5fCaw","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"oBfO4DExDajd95S5dEl2bQ","stars":3,"date":"2015-10-19","text":"This is my usual nail spot. For the most part they are decent. I go every 2 weeks to get a gel mani and never complained before. I went this past Sunday and some young guy who I always see there did my nails. Horrible, he did not get close to the cuticle at all. He was literally on his cell phone the entire time checking the football games because he said he was gambling on the games. Maybe you should of paid more attention to your client and how crappy of a job you did. If I go back and that's a big if, I will wait for someone else before I let this kid do my nails again.","useful":0,"funny":0,"cool":0},
{"review_id":"5tSF6_CAbLrdxZYQ-eUU_Q","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"q0EI-79cGy9zl8l4ddEaHg","stars":5,"date":"2016-02-26","text":"I used to come here all the time years ago, then I moved and found another salon that did not compare. Recently I have been making the drive to this place. They have great color selections for gel, place is pretty outdated. The employees and owners are very nice and remember me from all those years ago. They do great work and put the Polish close to the cuticle, which is rare to find.","useful":0,"funny":0,"cool":0},
{"review_id":"4CBuchBC7S1gZD8QfnGlvQ","user_id":"2A9ox9p8iodBVx20Dhr-fg","business_id":"IMb5BpDLlSbr7yn19HhltA","stars":1,"date":"2016-02-24","text":"The Arriba Mexican Grill off Bell Road is fantasic, but this location is closer to home so I tried it out.\n\nWe sat in the bar area and weren't greeted for about 15-20mins. No big deal, we order our drinks and that takes about another 15 mins to arrive. The server brings drinks to the table next to us and drops the entire tray of drinks and the lady behind me... I'm not talking a little water. The poor lady is covered in drinks. The server immediately apologies and runs off leaving the spilled drinks all over the floor and table. I kid you not that spilled mess sat on the floor for 30 mins before ANYONE came over. No manager came to apologize to the lady right away and all the did was give her a free appetizer! Terrible customer service, the manager addressed the lady as \"the one who got drinks spilled on\". How about you learn some manners, sir! \n\nAnyways, after 50 minutes of sitting there we finally see our server again to take our order. The food came and what do you... it's super crappy tasting! I'll take my $50 for 2 people and go else where... like the Bell Rd location. This place sucks, so bad.","useful":1,"funny":0,"cool":0},
{"review_id":"oVscu97L1Bjixw3XriyH7A","user_id":"faUI8x5Z5GikJPKHJiyfgA","business_id":"kAinDviytvKNHItIQEPhdw","stars":1,"date":"2015-11-09","text":"Worst experience and customer service ever......\n \nWatch carefully bill, there were several surcharge I needed to talk and claim 2 times to fix it....","useful":1,"funny":0,"cool":0},
{"review_id":"pI1CBIReavH5gS8nJX9Tgg","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"pUTzKKblaEAmqowYMHLXBg","stars":4,"date":"2013-10-24","text":"This place is clean and the customers servies you get is really good. the last time i was there i was going to share my sandwhich and fries, they heard this and offerd to spit it for us.","useful":0,"funny":0,"cool":0},
{"review_id":"eiLw0A0oEikyMvcbLu-khA","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"A9MJ0MDkFXvMYPzJk_Jp9w","stars":3,"date":"2013-09-19","text":"The mall is ok, nothing that will blow your mind. There really isnt a variety of stores unless your a teenage girl (or you think you are still one). they need a movie\/music store like they once had and for the love of god get rid of the people with clipboards asking if you have a few minutes (the answer is always no).","useful":0,"funny":0,"cool":0},
{"review_id":"yVAMq8h5BSepDk_uXlSxug","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"jLY-uypZzVIDA8Hu0GRKgA","stars":5,"date":"2013-09-12","text":"I love this place. I was a person that only went every once in a while to buy trades and free comic book day (always spent money). As of march I have been going every Wednesday when the new books come out, I sometimes go a second time in a week.  I can say when I wasn't a regular I was always treated as if I was one.  I know people love Kenmore comics, but I will stick with this as my shop of choice.","useful":1,"funny":0,"cool":1},
{"review_id":"yqNv36Cv8wmQ9dY59RQUYQ","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"hxedolqDRVlKA_iOoI09Ng","stars":2,"date":"2015-11-20","text":"Went there for lunch for my birthday and i was not impressed at all.  I ordered a beer & they were out off it and i. Ordered  a vodka & tonic which wasn't bad but i saw our drinks just sitting at the bar for way to long. I ordered the prime rib dip.. The waitress then came over and said they were out of the bread for the sandwich and ask if  they could put it on a hamburger bun; the food was good. But how do you run out of stuff in the middle of the week? My brother ordered another beer and that like our drinks before just sat at the bar. After we said we didn't want desert they just brought the bill didn't even ask if I wanted another drink. The all around service needs  major improvement","useful":1,"funny":0,"cool":0},
{"review_id":"FLdrohMOLbdcKeYXl9B_XQ","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"cuAU6-hpfrL5H1vJkusZqA","stars":2,"date":"2013-09-12","text":"The may have changed the name, but when you walk it makes you think you are in a Borders.  I have shopped there a few times, the price is about the same as it competitors.  I would not go there if you are looking to purchase movies or TV shows, they are one of the highest price retailers. Customer Service needs some improvement, I should not get an attitude when I can't find an item and I ask to see if it can be ordered. The only way I will stop in this store is if I need something and I'm on that side of town.","useful":1,"funny":0,"cool":0},
{"review_id":"h10jqJGyub4vBGA0Ea3mqg","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"XwwjDG5z91z4fxxUYW-yxw","stars":3,"date":"2013-09-29","text":"I have only ever done takeout. with the size of there menu  there is nothing that i can say i will go here and no where else. The sauce for the Gyro is liquidity. For Middle eastern type food i would suggest going to Aladdin's","useful":0,"funny":0,"cool":0},
{"review_id":"kY2Nar91vv_XfsYlJht-cA","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"6-bPt4WNc5nB0C_SAV5Zgg","stars":3,"date":"2013-09-29","text":"I love Bricco downtown and i was excited when i say there was one in fairlawn and the price are supposed to be lower. I first went for lunch the food and the cost was good, the service on the other had needed major improvement. I saw they had breakfast, so i decided to stop one morning, the food was average nothing out of this world. The Service at breakfast was HORRIBLE, the server offered more coffee to those who had it, but had to ask for more water a few times before i got it.  told the manager and he did not seem to care. I have not been back for a while so maybe the service has improved, i sure hope it has","useful":1,"funny":0,"cool":0},
{"review_id":"S9Q6gIGjxIim0qDonO9Zig","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"K-sgr6Bcc1-Ly8iPIAWDOA","stars":4,"date":"2013-09-19","text":"I enjoyed this place, they have a good variety of flavors and toppings. I liked that they had mutiple size cups for the yogurt, this is really nice since its by the ounce, that is something menchie's does not have.  I liked how they had the toppings laid out, it seemed cleaner. over all it seem cleaner then menchies","useful":0,"funny":0,"cool":0},
{"review_id":"EtoLrwrourUIawY1doPhGw","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"wH6hivXJebodb327MaKKww","stars":2,"date":"2013-09-29","text":"A few years ago, i would have told people this is the place to go for repairs or anything for you computer. but after the last time i was there they could for get it. i went to take my computer over there to be fixed, then when i went to pick it up, i saw the were charging me an extra $30.00. I asked what this was for and he told me the last time i was in the payment got returned ( i had not been there in over a year). I asked if i could see proof, i was told no. But suddenly after i said i would call the BBB, they showed me the proof. it was not one of my payment and it was not for a computer. the gave me a hard time again to take off the $30.00 charge.\n\n\nSKIP THIS PLACE AND GO TO CERTIFIED NERDS IN THE VALLEY","useful":0,"funny":1,"cool":0},
{"review_id":"i67RrBhAfCgE6_Yaefmirg","user_id":"8HUexMOhmkqbnt86YrifTQ","business_id":"rPL_DU1Ya9KPR0B3lQrwlw","stars":3,"date":"2013-09-29","text":"I had not been to a max and Erma's since i was a kid. I went to lunch on a Saturday, the were not busy. The service was horrible and if i order a burger med. rare and it comes med to med well, that is a problem. don't say your can do something and you cant. I doubt i will go back","useful":0,"funny":0,"cool":0},
{"review_id":"Mo-veeXRZMixL-i5GvV5AA","user_id":"GgZTSQk0xG6C_KhpI47jiA","business_id":"BaVtTt9pBoI8rrN35tsj_g","stars":2,"date":"2015-02-05","text":"I am with my basketball team and we go to this Olive Garden. The waitress Melissa sits us down and tells us our meal plan. She follows that up with \"my manager was nice enough to let you guys have soft drinks, so don't suck them down because I will not be refilling them quickly.\" I ordered Peach Bellini Tea and didn't receive a gosh darn peach. Salad was good though. 2 stars and that's generous.","useful":1,"funny":0,"cool":0},
{"review_id":"RwKf5zjqr40v94MdaKUuZQ","user_id":"GgZTSQk0xG6C_KhpI47jiA","business_id":"l0aaLW6ZdDXWjUegUECSxg","stars":5,"date":"2015-12-15","text":"I came here with my basketball team. Stellar service! Lots of refills and breadsticks. 10\/10 would come back","useful":0,"funny":0,"cool":0},
{"review_id":"IUdgMq2mKs0kfhoio9CuQw","user_id":"ZxbpPtR2uazKwg5LY3BbIA","business_id":"TmddzXM17nF25IbIfbTbjQ","stars":2,"date":"2016-08-10","text":"I paid 40% and gave them 5 months lead time to completely remodel my only bathroom, which is 5' by 12'. Completion was to be in 2 1\/2 weeks max. After initial demolition, work stopped for 7 work days. 2 days of work and then another stop. Completion after 5 1\/2 weeks. Promised lock box was a rock next to the front door. Follow up took over one year. My bathroom is lovely, but not worth the money, time, inconvenience and anxiety over security. Go elsewhere.","useful":3,"funny":0,"cool":0}]