[{"review_id":"F9JsjbapNlsX7wz4cq1vvg","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"wSw-l2m7oCQ_Hn5hHTqmGw","stars":5,"date":"2015-06-17","text":"I really like Vista nails.  It is a very good value for the money. They take their time and do a good job.","useful":0,"funny":0,"cool":0},
{"review_id":"C8ijOwRPWVEHD6bTtoVtqQ","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"KmsaDVRln9HpsK5vJxFLKA","stars":1,"date":"2017-05-28","text":"We waited 30 minutes with no one taking our drink or food order. We left. Very disappointing. There weren't very many people there either. If they're going to make it they need to get their act together.","useful":1,"funny":1,"cool":0},
{"review_id":"yy47BSKa-u526Z5c_Y_q1w","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"bsFZnc2mYyGy5cFf5EWTWg","stars":4,"date":"2015-07-02","text":"Went for AYCE lunch and was not disappointed. Menu is fairly large and at $14 is definitely good value. Place is always clean and the service was pretty decent for a busy lunch period. One of the regular places I frequent for AYCE sushi, the only drawback is that the portions are rarely the same sometimes there will be too little and sometimes there will be too much.","useful":0,"funny":0,"cool":0},
{"review_id":"oS4bYT9iymeQdzbBj_wjFQ","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"bEEkF_uur6TA7tW_7-9XEQ","stars":2,"date":"2015-07-02","text":"The Gull and Firkin is very hit or miss. It's a okay place to grab a drink and their fish and chips is pretty decent but the service and some of the other things off the menu is a gamble. I've given it a try several times and there have been times when everything has been good and times when everything has been bad. So unfortunately on my last experience is what will be cited most. We ended up with 3 different waitresses taking orders from us (weird) and NEVER  order the crunchy chicken sandwich. The first one came our and I took a bite which was just bread I then opened it up to find that I had scared the chicken into the furthest corner of the bun. It was literally the size of 2 quarters and that's generous. The good news was they apologized and had another one ordered right away. The fries were good though.","useful":0,"funny":0,"cool":0},
{"review_id":"a8TTfSJLbbUJ9UAMv-freg","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"2xw-Ksu9b2jDYlZaApXcBA","stars":4,"date":"2015-07-02","text":"Came with a few friends who were craving butter chicken so thought of this place. We all ordered the butter chicken roti and we were all definitely satisfied. The place is a little run down but the food was excellent. Large portions, tasty food the only complaint was the long wait. We must have just ordered right after a massive take out order as we waited approx 30 mins while people kept coming and going after us with their orders in hand. Other than that no complaints!","useful":0,"funny":0,"cool":0},
{"review_id":"rn49y5dm_3sRZ5_LrODFLA","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"-eIvRc3aEvufstBumpBTPQ","stars":5,"date":"2015-07-02","text":"After going to several physio clinics over the years with no success i finally found a home. I have bad knees and shoulders and according to the staff I shouldn't be able to walk upright lol. But with sessions from the staff I've already gotten back into all the sports I was used to playing before life took its toll on me. Paul (owner and therapist) is a truly caring individual and does his best to accommodate your schedule. The RMT's are also magnificent and I definitely recommend throwing in a massage session as well.","useful":0,"funny":0,"cool":0},
{"review_id":"HvrrNVuufmEaVShNWwYBEA","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"pP36B7aQh39jwBzHBs40ww","stars":3,"date":"2017-07-05","text":"Food here is pretty decent and a good portion. The only downside is that is quite costly for fish and chips. You're looking at $15-$20 for a single meal","useful":0,"funny":0,"cool":0},
{"review_id":"HqaK0ggH-27qFtARjEzSHQ","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"xI4IId1ZXfSflFvfbAtTVQ","stars":5,"date":"2015-07-02","text":"One of the greatest Hakka places in the GTA and surrounding areas. A real find of good food at great prices. Lunch special $6.20 + tax includes a soup and soda.\n\nMust try the hot garlic fish my absolute favorite! Words cannot describe how delicious this dish is. Pepper Chicken and even the chilli veggie balls are great. \n\nI now live downtown and have trekked through snowstorms to get here... ITS THAT GOOD. Don't let the decor scare you.","useful":4,"funny":0,"cool":0},
{"review_id":"RzAEvc2hRsnKBludG2IBAQ","user_id":"uK0LdXjF93PuPzVgo-Jsgg","business_id":"8HAsNLoSr3xi5rwQretp3w","stars":5,"date":"2015-10-21","text":"Fantastic place for some island eats. Patty's, Jerk Pork lunch highly recommend. Even have lamb and stew chicken and all around $6-7. What a deal, cheap but delicious eats.","useful":0,"funny":0,"cool":0},
{"review_id":"0n53UJaLoZ0E558ZF85N3g","user_id":"pibm8xKWF7LZgKf12iqSLQ","business_id":"EgemRE83Qe_ZbGnFcrPsng","stars":1,"date":"2016-06-01","text":"Not happy management is horrible the staff r rude.  I was late in my rent I told the manager I was gonna do the payment last night  on the web I did it they charge me 300 extra in Fees I paid it since it was my fault. She lock me out today after I made the payment last night. She didn't even bother to check the account to see if I made the payment. When I call her cause my daughter and my granddaughter were outside in the heat she didn't believe me and told\nMe I had to send her prove that I paid it. I ask her U can't verify in ur account ? She reply no I don't see anything how can she not see I made the payment.  And when i send it to her she didn't even apologize for her mistake. Amazing. I don't recommend this place to anyone.","useful":16,"funny":0,"cool":0},
{"review_id":"K2QJsw2IovlGYS9ypKkECQ","user_id":"pibm8xKWF7LZgKf12iqSLQ","business_id":"6cYgq6_kSOa2SgXrjyaLZg","stars":1,"date":"2016-06-17","text":"The worst place been there twice same nasty service  how can this place be open with this kind of rude Spanish people and I am Spanish is embarrassing","useful":1,"funny":0,"cool":0},
{"review_id":"9vEk6nrlA8fcej0SsbD3gA","user_id":"ZcgHNMGUKp-J9hRqgoDx6A","business_id":"1ForN8iXqYZ_dZZcOkvVeA","stars":5,"date":"2014-03-29","text":"This was the cutest little diner I have ever been too . The waitress was the nicest lady ever . The food was insanely cheap but still amazing. I loved everything about it !!","useful":1,"funny":0,"cool":0},
{"review_id":"CfHwbKOWVN6UGax8NwnWmQ","user_id":"ZcgHNMGUKp-J9hRqgoDx6A","business_id":"DFeEJf8h04q3KwRVWUsoMQ","stars":1,"date":"2016-03-27","text":"Worst service ever and all of our food was either cold or not what we ordered. Waited over a hour for our food as well. Our service was awful as well. Bathrooms were so disgusting and un-kept. I don't think I have one good thing to say about this place.","useful":2,"funny":0,"cool":0},
{"review_id":"ZzW2LuJuy8tQ7I55XxZT0A","user_id":"VyU-WzVX08qURyoRSrj07A","business_id":"hihud--QRriCYZw1zZvW4g","stars":5,"date":"2015-07-07","text":"I had Harami Miso. Korean Prime Kalbi. Bulgogi. Pork belly. and mushroom medley. They're tasty and fresh. Service is good as well.","useful":0,"funny":0,"cool":0},
{"review_id":"zTXm38Ylqm64XqHxUo3URA","user_id":"f3xz_pDipLsM4Zx4cPr8YA","business_id":"NnLOlAlFp5NvjnwP0T6Dcg","stars":5,"date":"2015-04-11","text":"The Devine Law Firm is terrific.  They are extremely response to requests.  As well, during a consultation, no question is considered to be of little value.  I was extremely pleased with the service provided by this law firm.  I highly recommend this practice!","useful":1,"funny":0,"cool":0},
{"review_id":"_T3R5PfocxbpZoebvdYu3w","user_id":"f3xz_pDipLsM4Zx4cPr8YA","business_id":"zVD7auicbF8eZGjgjT77Cg","stars":5,"date":"2017-03-15","text":"Today Mat of Ideal Services came to fix a bedroom plug in and the master bathroom fan. He was courteous, quick, and efficient. All was good to go in a short time, working correctly once again, thanks to Mat!","useful":0,"funny":0,"cool":0},
{"review_id":"H13YM2TLEwYotrWvrgInfQ","user_id":"f3xz_pDipLsM4Zx4cPr8YA","business_id":"DqCz4pb6smEwsOTanhyycg","stars":5,"date":"2017-03-25","text":"I travel to Moon Valley Plant World Nursery because their selection of plants and trees is top notch. Even greater is their great customer service. Recently I worked with Nursery Professional, David Rountree (yes, that really is his last name!). He helped me with my selections, held them for my landscaper to pick up, and called me when the awaited gardenias arrived for purchase. Friendly, efficiency service was provided by David each time I was at the business as well as over the phone. Another bonus...he is a Neil Young fan, as am I!","useful":0,"funny":0,"cool":0},
{"review_id":"0w4Rk6nNfNyG8SuqBHuc2A","user_id":"CyAaaWvMv19X-YknX-UcQA","business_id":"WAvBDsUGa_nzmcwfc42Qng","stars":5,"date":"2012-06-21","text":"This place was so much fun! My sister and I were in town for just 3 days we ended up here every night. I danced and danced the crowd was friendly and attractive.","useful":0,"funny":0,"cool":0},
{"review_id":"9L6_b5Fu1a7ymunsHrK-zg","user_id":"qHhP0GsDzb5Wa0GEP5Yl0g","business_id":"2zBCxn7_jHcfxoSjBdHJ3A","stars":5,"date":"2013-11-29","text":"The most amazing Southern Pecan Pie! This Thanksgiving my family embraced the not too sweet but perfectly moist and delicious  pecan pie from Breadcrafters Bakery. We all loved it! Even those non-pecan fans...  If you're looking for wholesome goodnees and unique flavor, you must visit Breadcrafters Bakery and experience all they have to offer. You will never be disappointed. Enjoy!\n\nThank you Monica!","useful":0,"funny":0,"cool":0},
{"review_id":"OGNe-DH1vYSVePt-NTQI8Q","user_id":"qHhP0GsDzb5Wa0GEP5Yl0g","business_id":"HWjqW5ZFJ8eZRQuHcpySQA","stars":5,"date":"2012-08-17","text":"My family's favorite!  Can't say enough about the service, everyone including the owners are so gracious, friendly and fast.  Every time we visit, we feel like family.  The food is AMAZING!  I'm very picky when it comes to mexican food and Caldero is Tops!  The portions are more than what you would expect and are beautifully presented.  My partner and I especially love the happy hour specials, the barbacoa street tacos are to die for.  \n\nIf you love true authentic mexican food at a great price you must visit Caldero - you will NOT be disapointed.","useful":0,"funny":0,"cool":0},
{"review_id":"bJzYO7SGjEvkULYoaua9Xg","user_id":"V-GUjhPyg8e166qHlBX11A","business_id":"-sF3fgPC6ETJz0hzB3gFgA","stars":1,"date":"2014-01-10","text":"I came here once and will never come back. \n\nThe food was not just terrible, it made me sick. I ordered the oven baked antojitos, and all I could taste was cheap, squishy cheese. I spent the next morning throwing up because of the two antojitos I did eat. \n\nWe also ordered the spinich dip, which was okay, but the waitress mixed up our order and gave us cheesy bread first. She wouldn't admit her mistake and made it out to be our fault. Overall the service was cold and unfriendly. \n\nFood was terrible, service was terrible. Not much else to say.","useful":0,"funny":1,"cool":0},
{"review_id":"nDDzquWMZQyOBCsUln4hlQ","user_id":"xalYrMlbmh0idu8rtNih1g","business_id":"uuGlYAIvYAX1q1KhpY6dtA","stars":4,"date":"2010-02-25","text":"I was looking for a Steakhouse for my bachelor party last weekend. We had a group of ten who were all on mixed budgets but I still wanted a good steak. With a group of ten guys in their mid twenties I wanted a restaurant that was more trendy and less romantic. This worked out nicely with it's ambient lighting, good music and easy going staff. \n\nI'm surprised of the complaints about service. We received excellent service especially considering we had a few guys who had been drinking since noon and were not the easiest to deal with. They were friendly and we received prompt service.\n\nThe food was great. The only thing to beware of is that they cook their steaks a little more on the well done side. So since I wanted a medium-rare, I ordered rare and it came out perfect for my taste. A couple guys ordered the sea bass and were very impressed. Only the two who ordered chicken were less than impressed, but who orders chicken at a steakhouse anyways. \n\nMake sure you get the 2 for 1 drink coupons from the girls handing them out in the casino. They were more than willing to take the coupons for our large group which knocked 100 dollars off of our total. Well worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"_UroM924kdHCPc2kkVaPsQ","user_id":"pu7XUw0XJFwU3grP2OMFlQ","business_id":"-IWsoxH7mLJTTpU5MmWY4w","stars":1,"date":"2013-12-26","text":"I'm gonna keep this short and sweet. Or bitter, in this case.\n\nKinh Do, if you wanted people to leave in disgust, having a restaurant full of roaches and rodents would be a quicker alternative than having the sorry excuse of a wait staff you have. Your cashier, a stiff and bored looking high school student, wanders aimlessly through the mass of waiting customers, while the managers find it amusing to tell people that tables are \"not available\"..and they sure aren't, not with the piles of food scraps and dirty dishes that are begging to be swept away. \n\nFast-forward 45 min, and we're finally seated. Fast-forward 30 more minutes, and we're finally given some water in this dry Nevada heat. Oh, did I forget to mention that we grabbed our own napkins and menus after asking half a million times? Yuppers. Another 30 min of twiddling our thumbs and our orders arrive, and surprise surprise! Y'all guessed it. The order comes out wrong. \n\nI'm usually not one to be sarcastic, but at that moment, it was looking to be prettttty darn funny. And not like ha-ha funny, but I'm-about-to-give-you-a-penny-tip kinda funny.","useful":0,"funny":0,"cool":0},
{"review_id":"PcxGGswMFiG1I2TNp-DRzA","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"phEpLAtmM4_8u1M7uGU43A","stars":3,"date":"2011-06-06","text":"The search for the best burger - 2011 Review #2.\nA lot of fanfare goes with this joint. Mostly from the US. I got the banquet burger. One patty with bacon. It was thin and overdone. The buns are toasted. YEAH. The Cajun fries are horrible and the regular fries are ok. Will somebody please educate burger joints on double frying. The only consolation is free refills, unless you order take out. I won't be going back. Look for review #3. Still searching.","useful":2,"funny":1,"cool":1},
{"review_id":"wwOZws1G07ddCS_qGZKZEw","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"lO5sV5_wbUq31jlZkGAyXQ","stars":2,"date":"2011-12-07","text":"Lunchtime 12:00 - appetizer (Charcuterie Board) showed up 40 minutes later and it was only a cold platter. I realize lunch time can be busy, but you are running a restaurant, deal with it. Not impressed. Table side service and the staff are great, the kitchen is the issue here. \nEntre - Seared Scallops and Spicy Merquez Sausage. More like braised scallops, there was zero caramelizing on them and they were buried underneath, instead of showcasing them. The sausage is quite spicy and dominates the dish. Pasta undercooked. Come on now. This price level on an entre and the pasta is under cooked. I am glad this was an invite, because I won't eat here on my own nickel.","useful":0,"funny":0,"cool":0},
{"review_id":"0L9Md5VRQJxXoUV-EXPs7w","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"G81XguoS1NucTWioh6XG8w","stars":5,"date":"2012-02-13","text":"First time there for the XC loop. Well worth the visit. 1.5 hours later my winter legs are toast. Great way to stay in shape during the off season. Sunday was super busy. There must have been 100 people riding in various areas. Love this place.","useful":3,"funny":1,"cool":1},
{"review_id":"SW3EVviD7WpDjJ14Ag4c6Q","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"q8MUVVuQpfR6v0HBHmAFxw","stars":4,"date":"2011-08-06","text":"Two glasses of Malbec and a plate of lobster fritters, to get things started. Wow. Finally, great food. Crispy on the outside, light and fluffy on the inside. Great taste and texture. These could become my new food group.\n\nEntrees. For me fish tacos (fried) with house side; for her Combine meatloaf with garlic mash and slaw. Three choices of hot sauce at the ready. I am impressed with this place. Very impressed. My mustard vinagrette was perfect and everything was fresh. Great balance of flavour in the tacos and did I say fresh; as in homemade tortillas fresh. My significant other could not finish her meal, so I rose to the occasion. Amazing meatloaf. If you have never experimented with blending ground meat, you need to try this. Now. Meatloaf, burgers....etc. It adds another level of flavour to the plate and helps maintain moisture. The wrapping of double smoked bacon, just melts in your mouth. \n\nIn a world of poor mega portion platings, (1 kebab and 4 cups of rice) this was spot on and is just what this area needs. Close to transit and great food. It would have been a 5 star if it wasn't for the inquisitive wasp and the noise. We were only 1 of three seatings in the place at the tme and it was LOUD. Some may like that kind of environment, not me.\n\nGrab some friends, go here. Everybody order something different and sample. The service is top notch and very friendly. It doesn't get much better than this. Enjoy.","useful":2,"funny":0,"cool":2},
{"review_id":"86q5HLYNyzVdVdlCrGo-Qg","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"2AWznkiQwU7kEJ-fQtSvGA","stars":5,"date":"2011-02-23","text":"I have recived chiro and masasge therapy at this centre. The staff here are among the nicest people you will meet. I have seen Lucy and Maggie for massage therapy and I will continue to keep going back. It is a very convenient location, right in the heart of downtown.","useful":1,"funny":0,"cool":1},
{"review_id":"gGt6nvmidMRufo1-W9cOxg","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"K-tKnqhblGR7K4R3roKmqA","stars":4,"date":"2014-08-31","text":"4 stars, because I have only been here once. Consistency is key. The quality here is top notch. $7 for a quality product is not over the top. Really good food has a cerebral quality to it for me. The flakiness of the pastry, the butter, the savoury flavours and texture. Stop staring out the window during lunch and truly feel the flavours you are experiencing. If you want more food, then but another pie. If you are complaining about the prices, then go spend $13 at a mega fast food joint where the packaging has more nutrition and flavour then the food.","useful":0,"funny":0,"cool":0},
{"review_id":"JASpAb-zxOP2ufjAVlXXCA","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"HRvl9-kHkm6LcH40kpCMzQ","stars":5,"date":"2015-04-15","text":"Wow. I just had my first appointment for physiotherapy. I am very impressed with everything.","useful":2,"funny":0,"cool":0},
{"review_id":"9PoyhJirDRi_KR_6htym3Q","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"zz3CqZhNx2rQ_Yp6zHze-A","stars":4,"date":"2011-03-31","text":"Release the neanderthal in you. I ordered the Wild Boar and rings. Both a bit overdone (cooking game meat is tricky), but very satisfying. If you have a penchant for game meat and fresh ingredients, you can't go wrong. My colleague had the regular burger and fries and he loved it. We both complimented our indulgence with the Mill house Organic on tap. Good times were had by both and short nap afterwards would have been nice. Wait staff were prompt and pleasant. I'll be going back for the 8oz Bison burger next.","useful":0,"funny":0,"cool":0},
{"review_id":"Y3Aq-h2GsHTrHbCzaOM1ww","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"aadG1TzULt-ezzUJZUSSJQ","stars":5,"date":"2012-02-08","text":"Outstanding!! Winterlicious menu.\nAppetizer: Fried Calamari \nEntree: Chicken Marsala w fingerling potatoe and veg.\nDesert: Chocolate Mousse\nWine: Malbec\n\nThis outing was a welcome surprise and our best Winterlicious experience. We were thrilled they had Malbec on the list.\n\nMore than enough Calamari for one, could even be shared.\n\nThe chicken was fantastic. It was butterflied, but seemed like two breasts. Juicy and very tender. Veg included peppers, green beans, zucchini and turnip. They use seasonal items when available. Everything was cooked perfectly. Nice and tender with just the right amount of crunch on the veg. I can be a fairly big eater, but I was getting full.\n\nDesert was spot on. I wanted to hoover it up but held back. Not too sweet, light and airy.\n\nThis eatery is a gem on the Danforth. We will be back.","useful":6,"funny":0,"cool":1},
{"review_id":"3OzfrngvGihcBbUn6xKhZg","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"0J_NiF5Lb0bFM5v6ZY-uGw","stars":4,"date":"2011-03-13","text":"I am not a typical diner client, but this place rocks. Got the Zets burger and I had no problem hoovering that up. Fresh made patties on a kaiser. Best burger I have ever had. If I am in the area again, it will be a no brainer to stop in.","useful":0,"funny":0,"cool":1},
{"review_id":"RhYhZ4ectuMapt6B_MpYtg","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"Zwg2TWwdm7y5ORK3yN6nDw","stars":4,"date":"2012-01-31","text":"I am back again. Happy to say the new location is even better than the last. The level of service is great. I will be back on a monthly basis. I had forgotten how good these massages are.","useful":4,"funny":0,"cool":0},
{"review_id":"hB-vJuQO43vlhXu9mQt4Pw","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"FcNtrDGaWmkDzlHaq9F1UQ","stars":4,"date":"2011-06-06","text":"I eat lunch here at least once a week and the quality is top notch. Always. No rubbery chicken or beef in the form of leather snipets. Just the right level of spice.","useful":0,"funny":0,"cool":0},
{"review_id":"fU3hdXpHNvFN9MLHJt0ZZw","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"9VBn6MsdNri2At1VxORHeA","stars":5,"date":"2011-03-18","text":"Don't let the trek up the stairs deter you. Think of it as an ascension onto another plane of existence.:)  The paper work was emailed to me and I filled it out before going in. Excellent. The staff is very friendly. If you want a spa experience, go to a spa. If you want great service and a great massage, go here. Ada was my RMT for this day. No other RMT has nailed my back problem on a first visit and she did it. I slept so well last night. I will be back many times.","useful":2,"funny":2,"cool":2},
{"review_id":"UPd2JnyHY4yuBBjBhLG7wA","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"4MfcvMRmRCyndMrQ-vgPvg","stars":5,"date":"2014-12-01","text":"Went there to have some links removed from my watch and buy some earrings. (for me). Nancy was super helpful. I left the watch, went back 20 minutes later. Watch was till too big and they worked on it while I was there, other customers were coming and going while I was there and all the staff were very attentive. This is a great little spot in the core for jewellery repair, without the high cost of a more upscale storefront like Birks.","useful":4,"funny":0,"cool":1},
{"review_id":"LTNHILWC1w1PoPNaitBooQ","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"KrIt8-qeaIvub9KJ9vqlWg","stars":5,"date":"2011-03-13","text":"I've done some tough things in my life (multi-pitch rock climbing. Sport class MTB racing...etc) I seriously underestimated my first experience with Bikram yoga and I am happy to say, I deserved it. This is very tough work, but you feel completely cleansed afterward. Do yourself a favour and attend a class. You will not regret it.","useful":2,"funny":0,"cool":2},
{"review_id":"fTpuZr3zwp9OERM7uOayrw","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"oXMvjbVKKr629a2FTxXtJA","stars":2,"date":"2011-09-23","text":"Eating in. Bring a parka. No seriously. This place is freezing. The food mediocre. The service, not so good. Coffee was not even made when we arrived at 6:15 PM. Salt, pepper, sauce.....etc are available at the courtesy area. Are you kidding me. It should be on the tables. They apologized for the service, because it 'got kind of busy'. What!!! Welcome to the restaurant business, you WANT to be busy. Two couples left while we were waiting and they were ordering take out. If there is a way to order ahead of time and pick it up, do that. I sincerely hope the other locations are managed better. My last time visiting this location.","useful":0,"funny":1,"cool":0},
{"review_id":"ApwhhhrGPDmaF_31YWHx7A","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"oWTn2IzrprsRkPfULtjZtQ","stars":3,"date":"2011-05-17","text":"This is review #1 in my Summer of 2011 Search for the Best Burger. It's Saturday and at 12:01 PM, we are already lined up at the Priest. It's cozy, nuff said. The smell is great, just enough to start the salivation process. The fresh meat is nicely formed into balls up, as each serving awaits it's transformation. I chat with some other patrons, it must be my good looks, because others are asking me what this is and what that is. I reply quickly, I am a Burger Priest virgin. I order a double-double for my significant other and 'The Priest\" for myself. Somehow this seems wrong, given my strict catholic upbringing and years as an alter boy. Then my world is shattered. The mushroom fryer is broken. OH THE HUMANITY. So I opt for the double-double and an order of fries. I go for tomatoe, onion and mayo. Let the burger sing it's own song people. It's juicy, the meat flavour is there. Nice crisp on the patty and a minimal bun. It's good, but where are the angels, the path to the white light? Still waiting. Could you and I make these burgers at home? Of course. Is this the holy trinity of meat, bun and add ons, as others have stated? Not in my opnion, or at least not yet. Are they good, absolutely. Eating out is not just about convenience, we are after all, social creatures. It's partially the experience and the thought that an individual at the stove will take our taste buds and our spirit to another level. I will be back at \"The Priest\" someday and am looking forward to giving them 5 stars. God willing. Namaste.","useful":0,"funny":1,"cool":1},
{"review_id":"Gr5S5O_heebsED2mk62o-w","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"XmgdFa3G_CZVfjtQEJMZfQ","stars":2,"date":"2014-08-31","text":"Lunch time with a friend on Saturday. Brisket on a bun was greasy. Friends smoked turkey was dry as a bone and stringy. The service was godd, hence the 2 stars. IMO the menu is too large. If you want to serve great deli, focus on that. I won't be back. It might appeal to 95% of the people. The rest of us are not picky or perfectionists, we have a standards when it comes to dining out. If you are going to run a food establishment, show us your passion.","useful":2,"funny":0,"cool":0},
{"review_id":"PZtwnuJ9toQaMH50Thn1Jg","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"UNlHO5PyA--hSM4SvbPGyg","stars":2,"date":"2012-09-28","text":"Take out order. Batter soggy when it got home. Never pack two orders of fish in the same box. Counter person couldn't tell me the difference between halibut and haddock. You are running a restaurant. It is your job to know all about it and the food you serve. \"Halibut is a big fish\", yeah that helps :( Fish over cooked. Fries nothing to write home about it. Sorry, but I don't see the attraction here. I'll go back to Duckworth's in a heart beat for their Sole, but I will try British F&C first.","useful":0,"funny":0,"cool":0},
{"review_id":"0AvzP3AZpl8HyhQR3I50fA","user_id":"M1vcFzCYRS2WGcIaJ5U0_w","business_id":"X-jY75pXPS-qFp8gRBPaqw","stars":5,"date":"2011-11-03","text":"What's a sultan burger ? I quote \" The Sultan burger consists of the 8oz burger, plus tandoori chicken samosas, butter chicken vegetables, provolone cheese and a lime pickle and jalapeno relish.\" Now I know what you're thinking, way too much going on there. Not so. The patty is perfectly cooked, juicy, full of flavour. The samosa has great crunch and there is just the right amount of spice. On paper it doesn't work, in your mouth it works wonderfully. The catch; these specialty burgers change on a weekly basis. The quantity of the food is substantial. Go here hungry, but go here. I will be a return customer with my eye on the Mac and Cheese and Veal meatloaf.","useful":2,"funny":0,"cool":3},
{"review_id":"XWwdangI6XPbms3iH1WbNQ","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"50pDd3dmJCb6m9JxBUq7KA","stars":5,"date":"2011-07-18","text":"After living in Germany for three years sometimes I'm in the mood for a beer garden. This place is pretty close. Good biergarten food and great beer! Check hours before you go because they're not open every day!","useful":0,"funny":0,"cool":0},
{"review_id":"Vc36dHMmi8uuTkwaHXyDTQ","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"E0TK141YMBP0LBknhVKEqw","stars":5,"date":"2011-07-18","text":"Love this place. Everyone is friendly. The food is good. I like the savory crepes. Came here for brunch one Sunday and the coffee was great too!","useful":0,"funny":0,"cool":0},
{"review_id":"ku38Yjnu4PnyPh6PdGg7BQ","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"jrwRDE-QhvDGHLXaTMSJyA","stars":1,"date":"2011-07-18","text":"I created a yelp account just so i could comment on this restaurant because I w disgusted by the experience.  The waitstaff was horrible. The restaurant was not even busy. As people arrived, they made them wait 30 mins and then seated them at tables that had been open the entire time. The food was good but I will never go back given the horrible experience.","useful":3,"funny":0,"cool":0},
{"review_id":"10GNCe8Tk9w-XOzj1yrosw","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"9_onoqwv9ZdItxc8OlUKAg","stars":4,"date":"2011-07-18","text":"The service was great! I liked the cheese and meat platter we ordered. The main courses were fairly good but pricey.","useful":2,"funny":0,"cool":0},
{"review_id":"KHty5kwfNc-1gfyOpe1Yww","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"D2ojX9bvE0_-aIj9BhdZZA","stars":5,"date":"2011-07-18","text":"This is one of my favorite restaurants. Everyone is friendly. I like the atmosphere. I love going there for brunch!","useful":1,"funny":1,"cool":1},
{"review_id":"ovM3tVWopVytprnmEbC0JQ","user_id":"x3E1GV6QcF13pyi_g0oG1A","business_id":"FB2iUwS4-LMLBQVyLZmZfQ","stars":2,"date":"2015-10-12","text":"I used to come here quite a bit but it's been a while and I have to say it will be a while if ever that I come back. \n\nWe orders the fajitas for two. At least half of it was onions. There was definitely not enough meat for two people for the $26. \n\nWe also ordered the pitcher of margaritas. And it basically tasted like sweet and sour mix on ice. There was little to no tequila. \n\nThe service was not great either.","useful":3,"funny":0,"cool":0},
{"review_id":"_mBJhneWhsLPOXgR_8LMNA","user_id":"qH0si26vbUppMtC2PPeiUg","business_id":"6iP8XodmOHZIlx2GF2C6OA","stars":5,"date":"2013-09-01","text":"Mike the owner is unbelievable. He is a rare breed that truly cares and isn't all about the money. He volunteered to do more just our of the kindness of his heart for my 19 year old daughter who was at fault. His staff is very friendly and helpful. Shocking and refreshing to meet a shop like this! Roy Ritner Phx","useful":0,"funny":2,"cool":0},
{"review_id":"4Hlj1jnjp_tGdbht21ouZw","user_id":"WBhn6b-r2D7p-Z4XjgsImg","business_id":"cYwJA2A6I12KNkm2rtXd5g","stars":5,"date":"2014-10-06","text":"One of my favorite \"strip\" places. Love their burgers. Also their jalapeño margarita is good. Go with Truffle fries.","useful":0,"funny":0,"cool":0},
{"review_id":"WbiGd0KGk6dVhtv97svePg","user_id":"WBhn6b-r2D7p-Z4XjgsImg","business_id":"z1pd3t6d5GfGmFNRuWGyXQ","stars":5,"date":"2014-10-06","text":"I now have 3 great floral displays in my house from here. They all look and smell great. Limelight candle is good. And chocolates are very good especially the mint cookie truffle.","useful":0,"funny":0,"cool":0},
{"review_id":"BBXIto7IZaP6d9RV6VDPQA","user_id":"WBhn6b-r2D7p-Z4XjgsImg","business_id":"zRqi6L1u-YmmVAHjeUbGMQ","stars":5,"date":"2014-10-06","text":"So happy there is finally a SkinnyFats closer to home. And this one seems like much more space. My go to is the Slow boat to China. Mr Green is a good drink as well. Customer service was good.","useful":0,"funny":0,"cool":0},
{"review_id":"ZBGzyBe_6Y8BBTweZ7sM9w","user_id":"kdOap1GBeRuviBfOx3f_8g","business_id":"Tp07u-0AOFRfQhtNpAXaQA","stars":4,"date":"2011-11-07","text":"It was so hot on the day I went to this place, they were baking the pizzas on the roof! hehe!  I was pleasantly surprised with the quality of the pizza, pretty damm good. I have 2 slices and one of Sicilian; all were just like NYC. The service was good too, unlike in NYC. :)","useful":1,"funny":0,"cool":1},
{"review_id":"6YL9OsbV_FmUxLzDNRsSEA","user_id":"kdOap1GBeRuviBfOx3f_8g","business_id":"XCxu7JetC-rJz59QnwRVaA","stars":2,"date":"2012-02-10","text":"I was driving through on a long trip to California and had some handling problems. They replaced the rear shocks but that was not the problem. When I got to LA, still with the same problem, I went to another place and they replaced the front struts: no more problem. When I called AAA, the guy told me they would make things right, but never heard back from him or his boss after 2-3 calls and a letter by mail.","useful":8,"funny":1,"cool":0},
{"review_id":"cxNPDFG7alvLPLufgvJOAA","user_id":"b4ujuUXsAsdKV-VAJeNzmA","business_id":"dRib7YK9Mtqgvfqsf-PKrw","stars":2,"date":"2017-03-03","text":"BAD CUSTOMER SERVICE!!!!  STAFF RUDE! \n\nSunday night (02\/26\/2017 6:14 pm) at your store.\n\n\nOrder a 6 inch pizza; after seeing customers who came in after me. Leave out with their order; ask cashier what happen to me order. The responds, \" I don't know.\"  Oh, your pizza was dropped.  Ok, when were they going to tell me????  WOW!!!!  Then you think they would have made my pizza first, right???  NO!!! WOOW.......and still was not making my order.  Well, I sat down thinking they would make make my order.  After another person left out; I just ask for my money back.  When trying to get the money back; the person who was taking the pizza out of the oven....................did not have a clue what was going on with the order!!!! Guess what....still have not make my pizza!!!  WORST CUSTOMER SERVICE!!!!     That was a big fail with your staff on customer service; may be if the pizza maker was not joking around and laughing he would not have dropped the pizza.\n\nServed with Love......NOT AT THIS LOCATION!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"B04dQcnXWneNdy-u5obT0Q","user_id":"b4ujuUXsAsdKV-VAJeNzmA","business_id":"_MNNGWXqkXCPiKQxCHsiuQ","stars":1,"date":"2017-06-07","text":"THE WORST BREAKFAST EVER!!!!!! Dry and chunky grits!!!!  Powder eggs or what looks and taste like powder eggs.  If I did not work so far away; I would had taking it back.  I could pick up the grits with a fork!!!!!   WASTE OF MY MONEY!!!!","useful":0,"funny":1,"cool":0},
{"review_id":"QBW9WJbAFHfOnJMrX45wNw","user_id":"E1tdgFl62lhL9QseMbTHPQ","business_id":"F44RugAixD4yauHlTGXGug","stars":3,"date":"2010-02-04","text":"Das Primanti Bros. ist u.a. für seine Pitts-Burger bekannt. Es begann als Trucker-Kneipe in den 30ern und hat sich mittlerweile zu einer ganzen Kette entwickelt. \nWie mir Einheimische erzählten war das Ziel, ein ganzes Mittagessen komplett zwischen zwei Scheiben Toast unterzubringen. \nDas ist ja schon sehr praktisch, wenn man Steak, Salat und Fritten direkt auf einmal in sich reinschieben kann und es einem nichts ausmacht, wenn man von einem Ohr bis zum anderen mit dem halben Belag dekoriert ist.\nIch hab mich dann für die Variante 'Tuna' (6.50$) entschieden, was sich allerdings nicht gerade als sinnvoll erwiesen hat. Vielleicht wars der Jetlag oder das leckere Sam Adams, bei Tuna hatte ich an ein Thunfisch gedacht. Nun ja, es war eher eine Thunfischpaste oder sowas, mit Krautsalat, Fritten, Gurken und was weiß ich nicht alles.\nHat eigentlich nur noch die Apfeltorte obendrauf gefehlt.\nOK, es war ein sehr lustiger Abend. Das junge Personal hatte auch seinen Spass, als wir das ganze auf Bildern festgehalten hatten.\nRestaurant würde ich es nicht nennen. Mit der ganzen Baseball\/Basketball Dekoration und den zahllosen TVs an den Wänden, Spielautomatem (und passenderweise gleich dem Geldautomaten daneben) läuft es bei mir eher unter Schnellimbiss.\nAuch war man mit der Tischreservierung für 12 Personen schon etwas überfordert.\nEs gibt auch eine reichhaltige Auswahl an Vorpseisen (4-5$; gefüllte Jalepenos, Nachos, Hühnchenstreifen, Champignons, ..., natürlich alles schön frittiert). Die Preise sind für diese Art Schnellimbiss durchaus OK.","useful":0,"funny":0,"cool":0},
{"review_id":"nq_-8lZPUVGomDEP5OOj1Q","user_id":"Jf1EXieUV7F7s-HGA4EsdA","business_id":"RESDUcs7fIiihp38-d6_6g","stars":1,"date":"2012-11-19","text":"After hearing all the buzz about this place, I decided to check out what the hype is all about.  It was Sunday Brunch and we arrived around 1pm.  The line was loooooong but that was expected.  Once seated at the table, my husband and daughter decided to tackle the ONCE AGAIN LONG LINE at the meat carving station while I decided to tackle the shorter line at the seafood station since I was already starving at this point.   While chowing down on the SUPER SALTY crab legs, I wondered where my husband and daughter were since they still haven't sat down to eat with me.   It nearly took them 30 minutes standing in line at the meat carving station!!  By the time they joined me at the table, I was ready to sample the rest of the food.  I then walked all the way towards the back to the Asian section (by the way the flow of the buffet just doesn't make sense!) to maybe try some sushi or sashimi.   There weren't that many good sushi selections either that's all they has or they just don't replenish fast enough.   I decided to skip the Asian section and walk my way towards the front.  I wanted some cured meats and cheese, but yet again the Parmesan cheese was a whole big block -no shavings or pieces one would have easy access to.  I was looking around for a knife maybe I thought one had to shave the cheese off himself, but no tool was around!  I was really getting frustrated at this point, but I still decided not to give up and try the meat carving station.  I had wishful thinking that the line was going to be shorter this time than when my husband and daughter were here.  Needless to say, the line was not any faster but at this point this was my last resort the last station i want to try since they have Prime Rib - my favorite, so I patiently wait for my turn.  Finally I get Prime Rib with Au Jus on my plate and  FINALLY join my family at the table, to only find out they are ALREADY DONE EATING!  I don't blame them since I was gone for almost 30 minutes!!!   To top it all off, the Au Jus that soaked my Prime Rib was sooo salty that I could only eat 3 bites out of that meat!  I was enraged at this point that I didn't even care to try their desserts!    Not being able to eat at the same time with my family because of the ridiculously long lines at the food stations and to be fed salty dishes is just absurd!   All in all, Bachannal Buffet DOES NOT live up to the hype!   The food is so much better elsewhere!  You're better off going to The Wicked Spoon at The Cosmo or The Studio B Buffet at The M Resort.","useful":2,"funny":0,"cool":0},
{"review_id":"u9-rHNb0bS0cwkiuL1Uwtg","user_id":"33UWOj-2K4cJBVsFWRaX3Q","business_id":"awI4hHMfa7H0Xf0-ChU5hg","stars":5,"date":"2013-11-24","text":"Heaven!!! The pan roast is nothing I have ever tasted before.  So delicious.  Waited about an hour to try this place.  There are probably about 15 seats or so.  Expect a long wait but it is worth it.  Best oysters I have ever had.  They were plump and delicious.  This is a place we will be going to when we are Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"196XZTzd3W-c83MOZc-F4Q","user_id":"xm8UKfp7LTNKVNQ7PS3ADg","business_id":"5KsvP10z9InBcI6hhqjjKg","stars":1,"date":"2008-08-25","text":"I could not have a more different opinion of this place from the other 2 reviews. It literally put me off of Indian food for long time. I did not find the food to be terribly fresh, as though it had been sitting in those chafing dishes for hours. It looked completely unappetizing, and tasted oily and bland. After a few bites I stopped eating.... they certainly got their money's worth out of me considering I ate pennies worth of nan bread and a few bites of food! \n\nI tried to keep my dining partner good company... he happily ate for 2 and didn't share my sentiments, but I've since spoken with several Montrealers who reassured me that Buffet Maharaja pales in comparison to other Indian restos in the city, upscale (Le Taj, Bombay Palace) and bargain (Bombay Mahal- excellent) alike. On the bright side, the service was good and the atmosphere comfortable.","useful":1,"funny":0,"cool":1},
{"review_id":"cDbRs5u1iWZbNj_-z1EJAA","user_id":"c2KfJJmH3rNb9Oui7ypVQw","business_id":"Vt4RPq1nkUI5GI4G8JXyQw","stars":1,"date":"2012-05-22","text":"Over pressed a shirt coller (wrecked it) and they refused to take any responsibility. I think there are better srevice oriented companies out there.","useful":9,"funny":0,"cool":0},
{"review_id":"iyp5HP8c--bHg6go6xKm0g","user_id":"c2KfJJmH3rNb9Oui7ypVQw","business_id":"5Bdw4A46VnTCr61gDkuw0g","stars":2,"date":"2012-12-16","text":"We had to give this a 2, because, as others have posted, the service was pretty slow and something less than friendly. We were there on a Saturday, so it wasn't super busy. The food was fine, so if you want Korean and aren't fussy on the service, it could work for you. The larger question we discussed was should ethnic restaurants honour their culture when it comes to customer service or should they reach to be more consistent with their customer base? Also, we were left wondering if Koreana BBQ's preferred customer base was indeed Koreans as opposed to a wider and more diverse customer base. Just food for thought.","useful":0,"funny":0,"cool":0},
{"review_id":"uS_0qETniDQC1RS_cB6ubA","user_id":"Bm-ybn_5ibNaYGn8cjaQkw","business_id":"qIRqFlmvHDRe7kWBAsuVnQ","stars":4,"date":"2017-11-24","text":"wow I was just craving for spicy noodle then I found this Korean Chinese restraunt! we ordered Jajangmyun and seafood Jambbong. They could be little spicy if you couldn't usually have spicy things. But they were really good for me cuz they tasted like grilled somethings right before the fire.","useful":0,"funny":0,"cool":0},
{"review_id":"kbPxQHwz5Nb4rty-DEtjzw","user_id":"xXz5_03m8Q6ARLA4fq_f1w","business_id":"CGPulfOy0zhvrFM8cunP-w","stars":1,"date":"2014-07-26","text":"I recently ( a few  weeks ago) experienced horrendous service from FFSI in closing my loan.  It was extremely frustrating being asked multiple times for the same docs and having my closing date delayed at least twice due delays on their part ( they actually contacted my seller and explained that they were the reason for the closing delay).  The final mixup was on the day of closing when they included impounds in my final payment when a i had clearly requested and  signed documents saying I did not.  They acknowledged the error and  told me the docs would have to go back to underwriting again, thus causing another delay in closing. I knew that my seller would not go for a 3rd delay and I knew I had a good deal on the table.  I was told that the  impounds could possibly be removed during the servicing process, so I accepted the current situation and closed the loan with the mpounds to eliminate my risk.  I was not happy.  I  am still waiting to see if they will actially remove the i mpounds, but am not hopeful.  .  I am very disappointed and would not recommend FFS to anyone.","useful":2,"funny":0,"cool":0},
{"review_id":"PX76g9QsUrr0pmwS1q2U4Q","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"Ybxl-MdPl4BUQ7Fc4xaj7A","stars":5,"date":"2015-11-15","text":"I love love love the tacos de camaron empanizando  great food great service and I also love the tostadas de ceviche mmm definitely  recommend","useful":0,"funny":0,"cool":0},
{"review_id":"lhvPuJ3np6Yk6i7PT0uqcA","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"R1k-z3Mauqk4v-7ZeEVsHQ","stars":4,"date":"2015-06-13","text":"Loved the food had the Plato tipico, gives you a little of everything. To drink I had an ensalada it's a must try yummy. Definitely recommend. Very busy had to wait a while to be waited on. Other then that it's was great.","useful":0,"funny":0,"cool":0},
{"review_id":"Q09hPC5-pDWjBEyCzkYxSA","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"eS29S_06lvsDW04wVrIVxg","stars":4,"date":"2016-10-30","text":"Had a great dinner with my girls on a Saturday night. Enjoyed the food, drinks, and live music.","useful":0,"funny":0,"cool":0},
{"review_id":"h6215eXxqF97D0KR3QYCCA","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"E9IPxXY6pS2gTW2FBkAJmg","stars":5,"date":"2015-06-13","text":"Had an outing with the girl's, and it was great first time here and I'll definitely be going back. Great food!!!! The Duce  itself is quite different,  but food. I recommend it","useful":0,"funny":0,"cool":0},
{"review_id":"2wujGfXyNVpbXbOEvOYLOQ","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"3l54GTr8-E3XPbIxnF_sAA","stars":4,"date":"2016-03-16","text":"A friend  recommended this new place to try. I got the famous PBJ burger,it wasn't what I expected  it to be it was just that PBJ sandwich  with meat I don't know what all the fuss  was about. Let's talk about the waiter  it took him 10 min. before  he evan asked what we would like to  drink  and even longer to ask about our order. I guess  since this location  was in Scottsdale  he thought it would be better to attend the older ladies that were there alone rather than a  family. The service  for me means a lot about a place, but the food was ok. I would not be going there again.","useful":0,"funny":2,"cool":0},
{"review_id":"2c1qE-ZPCUU5qVtZqOhzBg","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"D4BWyStFZzA7k8hqDmnyFw","stars":5,"date":"2016-04-25","text":"This restaurant  just open a few months ago so I decided to  try it out. OMG first time  trying  Korean  Food and let me just say it was sooooo gooooddd. Can't wait to go again. We tried the spicy pork hot stone, shrimp fried rice, Korean  ribs and oax tail soup everything  I must say was so delicious. It a must try for everyone","useful":1,"funny":0,"cool":1},
{"review_id":"WwMiaxISRM3o5BoA0UcjDA","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"mss-LiOfL1vtoNo3WoEoJw","stars":5,"date":"2017-02-27","text":"Food was great. Service was wonderful.  Since it was our 1st time there they gave us a sample taco.","useful":1,"funny":1,"cool":1},
{"review_id":"Hy3BKsQOSioOWUOKOljPXQ","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"PRbIMseOwPCCRv5C4SfTDQ","stars":4,"date":"2015-09-26","text":"First time here. The food was great loved the ribs the best I have ever tasted. Also the strawberry  lemonade delish. The only thing I did not like was it seemed that  our waiter was rushing us to hurry up. We were all still eating  he came over and asked if we wanted a box for leftover whhhat  is that!!! Then after we said in a bit,he came over again and asked if we wanted dessert while we were still eating :( other then that the food was great","useful":0,"funny":0,"cool":0},
{"review_id":"cvjA8v5roxnMD224h2Hx1g","user_id":"9OkrwOlsvtxVnaLj-hZGhQ","business_id":"J8GuDrqeLH1xMpSpeEixYA","stars":4,"date":"2015-06-13","text":"Mmm good food. I had the eggs benidict for breakfast. The egg was to over done, but it was good. Great service","useful":1,"funny":0,"cool":0},
{"review_id":"v8SpROGbK8_IVzCaF7N6XQ","user_id":"Je5jRuaSdeO5Vw9dNfupZA","business_id":"NT9oIw3TTDLXo_x6nKUkBA","stars":5,"date":"2016-05-16","text":"Delores has saved hundreds of dogs. That is what she does. She takes every step possible to ensure these rescues go to good responsible homes. Period.\nAs a fellow rescuer I understand how hard it is save and care for these animals. She has dedicated her life to them which makes her INCREDIBLE. keep it up Delores the dogs need a heart like yours.","useful":1,"funny":0,"cool":0},
{"review_id":"iFns7nIum_aaOROPMasA-Q","user_id":"r0IDJnZMAABZYrg_5XaQyg","business_id":"8njSaIveQDfTFnEgYWm3Fg","stars":5,"date":"2011-07-08","text":"We purchased Temahome product via 2b mod.  \nExperienced great follow up.  Speedy delivery.  \nAnd also very accommodating.\nThanks Marcel for all your help!","useful":0,"funny":0,"cool":0},
{"review_id":"O0niwv8dypyLhvuWSdi_pA","user_id":"hSiSTNrRfQADO6HlwXS7gA","business_id":"78EajV1gUEC9tx_83eO51Q","stars":5,"date":"2014-02-06","text":"We ordered with Foodie Call today at work for the first time.  Ordering was really easy as it's all done online!  i realized after i placed the order, that i had forgotten to add something, so i called them and they added it for me, no problem!  \nAll 5 of our orders were exactly right and it was delivered with in the specified delivery time and still warm when it got to us.  We will definitely use Foodie Call again!","useful":0,"funny":0,"cool":0},
{"review_id":"lK9Y_2PzvYkwZs1n4wP7gg","user_id":"zUi5JLpFE7TZ0FAATuV6sg","business_id":"vsoEZauF4lrADIqCYXySFQ","stars":5,"date":"2016-10-14","text":"We always order Li mein noodle !and fried rice you can ask to make it ,1--5 stars spicy !great tasting !and the teriyaki chicken on steak !we love it !their eggplant good eating with white rice !yammmy !","useful":0,"funny":0,"cool":0},
{"review_id":"cmRGAidUbW9aHs3Jm7dE5Q","user_id":"W1Nde0RcP1-eoEpesZjb_g","business_id":"3PekkCkOZD7Pe3Q4owP3Pg","stars":1,"date":"2013-09-24","text":"I asked to get the sleeves of my nice wool coat taken out.  I paid $30, which is not that cheap for this kind of work. The work was so sloppy that the hemming started falling apart as soon as I got home and I also noticed a hole in the pocket that wasn't there when I had dropped my coat off. Honestly, the work was a hack-job. If you have any really nice\/expensive items of clothing, do NOT take it here or you risk having to get the work re-done elsewhere. Really disappointed with the services after having read such positive reviews.","useful":4,"funny":1,"cool":0},
{"review_id":"QBKiEawGPymC4tWeUi1FDA","user_id":"W1Nde0RcP1-eoEpesZjb_g","business_id":"Cp3YRVZojrCGeQS41Hf1pw","stars":2,"date":"2013-08-14","text":"I love the seafood pho here. It tastes fresh and has a good portion of toppings other than just noodles. The service here is very poor. I have seen them take orders for larger parties before the smaller ones who had been waiting longer. Also, the servers quite frequently forget your orders and you will have to flag and repeat your orders numerous times. I also find it very odd that they seat \"Canadian-looking\" people on one side and Asian ones on the other.","useful":0,"funny":0,"cool":0},
{"review_id":"Zypce38XRiiJfbqRxn6Khw","user_id":"W1Nde0RcP1-eoEpesZjb_g","business_id":"Dkx_UjNhbXB-P0oyKqbTPA","stars":5,"date":"2013-10-16","text":"The food is original and tasty. My favorite sandwich was the pork one but so are the beef and chicken. The soup and fries are also delicious. I would highly recommend this place to everyone. The owner is also very hands on and pays attention to service. This place is a must-try!","useful":0,"funny":0,"cool":0},
{"review_id":"jwNqqrdKNY-Pp_kXnH6SOw","user_id":"W1Nde0RcP1-eoEpesZjb_g","business_id":"ww_MXl-qDLeYdYTZZ9KWbA","stars":4,"date":"2013-08-14","text":"The Bánh cuon  and chicken pho are my go-to staples here. The Bánh cuon is fresh and the portion is good but could use a little more filling however. The chicken pho broth is clean and not-oily unlike some other places. Sometimes, however, when ordering the pho, they cut the chicken pieces a little too think, and these pieces are also very dry. On a more positive note, there are no weird chicken pieces, they are all breast\/white meat. I would highly recommend this restaurant if you haven't tried it yet.","useful":0,"funny":0,"cool":0},
{"review_id":"kva2cZEr_s3LwyLjPzDrfQ","user_id":"W1Nde0RcP1-eoEpesZjb_g","business_id":"a-Mo7Ipu_c5y21mmg0-F7g","stars":5,"date":"2014-07-24","text":"Ate at Agio tonight and was pleasantly surprised at how delicious the food was! I was also taken aback that a Korean chef would be cooking Italian cuisine. This was very judgmental and offensive on my part and I learned my lesson. Having been trained in Italy, Chef Marino may appear to be Korean but he speaks fluent Italian and cooks some of the best and authentic food I have ever had in my life. My SO and I had the bruschetta and the frutti de mare pasta. He also served us a complimentary melon and prosciutto appetizer as well as a delicious tiramisu dessert. It was our first time here and will certainly not be the last. Many thanks to the other Yelpers for this recommendation and I would highly recommend this spot to anyone who loves authentic Italian cuisine!","useful":0,"funny":0,"cool":2},
{"review_id":"-HD1J6QDUhRhQTMEmWvWWg","user_id":"DL7QMpYNa8pC_FpD0kxxOA","business_id":"0iRxPFQuX3V6xh8qGVZ23Q","stars":5,"date":"2017-03-24","text":"Andrew had painted a couple houses for my brother. When we moved last year, he recommended Happy Homes. Andrew painted all of the interior walls, not the trim work. He did a masterful job. All the lines are crisp and the walls smooth. I recommend Andrew.","useful":0,"funny":0,"cool":0},
{"review_id":"HfdZMdhKRLMITL1KYxR92A","user_id":"UvKvJZJYaMv7WPGUP9XrMg","business_id":"CoyeXg8FBsS_d20QzNIy-A","stars":4,"date":"2015-07-26","text":"I came here the other day with some friends. I'm not one to go to these little coffee shops, but I'm so glad I did! I ordered an iced chai tea latte, delicious! I loved everything about it. The food wasn't the best in my opinion, but I can't complain about anything else!","useful":0,"funny":0,"cool":0},
{"review_id":"PMFKWBsHByWjKwRgE7EAzA","user_id":"UvKvJZJYaMv7WPGUP9XrMg","business_id":"0B9znrfIopFrzOIW_MM_Qg","stars":5,"date":"2015-08-12","text":"Love Cathy! My mom and I have been going to her for years now, and we wouldn't trust anyone else with our brows or facials! We recommend her to everyone!","useful":0,"funny":0,"cool":0},
{"review_id":"S87iaAMqsx0Blp5WfRhKsA","user_id":"UvKvJZJYaMv7WPGUP9XrMg","business_id":"5rEKjXLslSp58R2ygAZh6w","stars":5,"date":"2015-07-20","text":"It was my mom and I's first time coming here. After reading the great reviews, and having friends that come here- we thought we should give it a try! My nails were severely damaged after having acrylics on, and Nessie recommended I do a hard gel manicure to give my nails some strength, and ultimately, make them grow again. The manicure came out perfect! Plus, her and I had great conversation. She's such a sweetheart! My mom went to Jimmy for a gel fill, although he didn't talk much, my mom is more than pleased with his work! It turned out fabulous. Needless to say, we have found our nail salon to go to! We can't wait to come back to Nessie and Jimmy. :)","useful":1,"funny":1,"cool":2},
{"review_id":"4KlQTIPn4gLkaCWwk2ZURA","user_id":"nza_57QyRMqfVl3zjmTp_g","business_id":"2weQS-RnoOBhb1KsHKyoSQ","stars":3,"date":"2011-11-27","text":"I have heard a lot of good things that about Wynn Buffet being one of the best in Las Vegas since they open.  However, I haven't gotten a chance to try it until this time at 2011.  \n\nI struggle over 30 min on what rating I should grade the Buffet at Wynn Hotel,  I don't know I should put 3 or 4 starts, for sure not 5 stars perfect rating.  Then, I settle with 3-star.  I'd like clarify, it is a 3-star within all the 5-stars hotels competition around in Las Vegas.   If you take about \"general\" rating, it may be 4-star, mainly due to atmosphere and service.    3-star is FOOD only, if good food and variety is what you are looking for.  Not to mention, I have to pay $46 per person to go in.  \n\nWhy 3-stars?  I think it failed in 5 main dishes.  1.)  The prime rib and honey-baked ham is too dry.   It almost has no juice in the meat.   2.) Seafood selection is poor, and the sea bass was over cooked.  It was too dry too.   Oyster was so small, and the spinach on top was only at room temperature.  other seafood selection is kind of limited.  I only see King-crab, sea bass, smoked salmon, and oyster.  3.) Asian and Japanese food is SUPER limited too, and doesn't taste very good.   4.) Italian food, so-so.    5.) the juice are not 100% flesh, they are from concentrated formula mixed with a flesh juice.  \n\nGood thing the \"Black pepper backed ham\"  save the day, it was cooked carefully, and the meat was carefully selected.  It has a well balance of meat and a little fat to make it juice and smooth.     King crab is not bad.  They pre-cut them in half, making it a lot easier for us to eat.  Good job.  \n\nOne thing may worth mention about the choice of drinks.   You have a choice of buffet or buffet with Champagne.   What we didn't know, and our waiter didn't inform us, is that there are actually 3 different type of alcoholic blended drinks are offered with the standard buffet.  So, you have choices not only to soda, juice and coffee (Tea), you have at least 3 other choices (more expensive)... I forgot the name.  I will try to get them next time.\n\nI feel very fortunate that I have tried a lot other 5-stars type of buffet around the world.  before, like Hyatt, Shangri-la, Four Season, Hillton,  Mandalay Bay at LV, Bellagio at LV, Mirage (back in the early 90s) ... etc    So, after having many of experience I had, I think a 3-star for food taste and choice is fair..    \n\nI tried a 2 times in the week.  one for Breakfast \/ bunch.  One for dinner.  \n\nOn the side note, comparing to Wicked Spoon which I tried a few months ago.  I think Wicked Spoon offers more choices on the desert and and salad section..\n\nGood luck on your choice and enjoy your meals.  :-)","useful":0,"funny":0,"cool":0},
{"review_id":"cFMC8dtz0w6C9XhUyKi1MQ","user_id":"Xh85vxx-pO8QOO67Vq7Q2w","business_id":"1l-6sFjSKgQ7zIlvlX8uiw","stars":1,"date":"2017-07-31","text":"This is the most disgusting place ever not only are they thieves by stealing my deposit there are nothing but drug addicts there while we were there three different men approached my daughter asking her if she wanted drugs then asked if she wanted to make some money the rooms are awful there are cigerette burns all over the place there was blood on the ceiling and there are bed bugs my advice is to pay a couple more dollars and stay at the motel6 across the street this place should be condemned","useful":0,"funny":0,"cool":0},
{"review_id":"YF2VpjPQngBPP6Gmwjowiw","user_id":"Xh85vxx-pO8QOO67Vq7Q2w","business_id":"MyX8MqLZDsv63oWHb-X7Uw","stars":5,"date":"2017-03-10","text":"Phil is a man of his word if he says he's going to do it it will get done he is an exceptional business man who cares about his community I would highly recommend him for any problems with yourheating and cooling problems","useful":1,"funny":0,"cool":1},
{"review_id":"anVkVWg9Jk1CHHV6PAE7vA","user_id":"Tw0l4fJtukjeJ30r25wffg","business_id":"ADmJgVJ82zdLzffdaH1gVw","stars":2,"date":"2015-12-26","text":"I have given this store so many chances because I live close by and it is convenient for me to shop for my gluten free products.  I have given up. Service is so slow, cashing out takes forever. Rarely is there more than one cashier working, even on busy Saturday's! Occasionally when a second cashier does open she just takes cash or she just takes the last person in line while the people who have been in the line waiting get ignored. One time when this happened I walked over to the cashier and politely told her I was next in line and her comment was 'whatever' and a roll of her eyes. Absolutely no customer service skills. Also, selection is not what I am able to find at other comparable organic stores despite the distance I have to drive to get there. Lastly, the prices here are higher than other places. For example a local nonorganic supermarket down the road has some same products but a few dollars less. Planet organic hikes up their prices probably because they can get away with it I due to the higher end clientele they serve in port credit. I am giving this place no  more 'chances'.  I will take my business elsewhere even if u have to drive to central Mississauga.","useful":5,"funny":0,"cool":0},
{"review_id":"2R09lxDcHFovasBeXR_CXQ","user_id":"Tw0l4fJtukjeJ30r25wffg","business_id":"iitV_44p3NfpbFv-Mt4VaA","stars":2,"date":"2017-09-02","text":"I am very undecided about his place. Yes - it's convenient as I live close by - BUT the prices are ridiculous. I compared a couple of items from the local Fresh Co and Metro and Cousin's adds a couple of dollars to their canned\/dry goods. Also their produce is overpriced such as their asparagus which is always a couple of dollars per pound more expensive then the other grocery stores close by. Their roast chicken, made on location, is ruined as it is slathered with horrible bbq sauce. In fact, most of their hot meat items are slathered in this sauce. Their customer service is simply deplorable. Their cashiers look miserable and pained even when they have to say the total price of your order. The parking is a mess. Very dangerous. Lastly, and certainly not least, the male employees noticeably come out and circle any good looking girl, woman, lady etc... that walks in to the store. I know this because it happens to me and makes me uncomfortable. They will slowly yet obviously start coming out of the back and the aisles and circle\/pass by you a couple of times. I swear sometimes they are notified through walkie talkies or something that a 'female has entered the store' and they start coming out like vultures.","useful":3,"funny":0,"cool":0},
{"review_id":"kv-vx0lz7dLId4qNVZA42A","user_id":"Tw0l4fJtukjeJ30r25wffg","business_id":"75gUQWJM6KksjJW7aHPsBQ","stars":4,"date":"2015-11-26","text":"I have only tried their chocolate and vanilla gluten free cupcakes and both are great. I have only seen them in store on Satrudays but you can preorder gluten free cupcakes of your liking. A great place. Customer service is so-so. I asked the girl if their macarons were gluten free and she said \" no they are made with pumpkin seeds.\" I made her clarify that she did indeed say pumpkin seeds (which are gluten free). I told her \"You mean ground almonds\" and she said \"no pumpkin seeds.\" Anyway, left the store confused about their macarons and if they are gluten free.","useful":2,"funny":1,"cool":0},
{"review_id":"TObpjBzKEyOoZ4H8RwFJMA","user_id":"Tw0l4fJtukjeJ30r25wffg","business_id":"w8qMUDsJbd4A30DeYMYXZQ","stars":5,"date":"2017-09-02","text":"Can't say enough about this place! Almost as soon as I walk in the people who work there ask if I need help. I can always find my vitamins\/minerals\/natural products. The back room has stevia, MCT oil, hemp hearts, Himalayan salt etc.....The only downfall is the parking - you have to pay for it but the good news is that it's about 50 cents for 20 mins and I usually don't need that much time for parking especially because of the great customer service. Sometimes there is 20% off so take advantage of this. Often the Loran Vanderhauge products are on sale too so take advantage of this as well.....Love this place!","useful":2,"funny":0,"cool":0},
{"review_id":"NpxRUWaYLUQ6ZsWf2jIqqA","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"bhoJYB0ArSqRe-Q82BI4vA","stars":4,"date":"2016-07-15","text":"I popped in here on a whim and went back every day for a week! \nSo well done. \nOnly four star because they didn't have gluten free, that may have changed but otherwise it a 5 star review for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"hbzBJcPffK8F5APx2pye7Q","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"R-DCYO_bEIPskFvhNLfeAw","stars":5,"date":"2016-07-15","text":"Very knowledgeable staff and management. They go above and beyond to offer their expertise, advice and recommendations. Have shopped here for cigars and accessories many times and happily travel from the east end to this store in order to get the best quality and service.","useful":0,"funny":0,"cool":0},
{"review_id":"MULrzc0rr6GWtI1HYvW4DA","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"Ow9LZC3YZs9O6OSDa1-HGw","stars":5,"date":"2016-07-15","text":"I probably eat here more than my house! \nNice, simple, easy, fresh and good. \nThis has been the go to brunch in The Beach for many years and it's easy to see why. \nLunch is also well done and good choices with daily specials changing things up here and there. \nNo disappointments here!","useful":1,"funny":0,"cool":0},
{"review_id":"DKs-iRJnKQJO8tYrf2yM_g","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"7oEKIG7d1ttPRejppZ3WIA","stars":4,"date":"2016-07-15","text":"Really liked it, cool decor, good food, it was busy but that the curse of being great. \nProbably would have loved it but the hype was so huge from everyone who talked about it, living up to the expectation was going to be tough.","useful":0,"funny":0,"cool":0},
{"review_id":"zKXTkHXaWb6_BsEEX7cNcg","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"XdY36-Qh_DxnCaFpTPfYMg","stars":5,"date":"2016-07-15","text":"Everything tastes like the baker was having a wonderful day when it was made. \nComfortable, bright and happy. I love this place, \nAlso, so many gluten free options!","useful":1,"funny":0,"cool":0},
{"review_id":"DS6Yu9OB0_d0b7UJf3ENrg","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"28adZ4lsuUeVB2aWzohK9g","stars":5,"date":"2016-07-15","text":"Everyone was raving about Prohibition and I finally had a chance to find out why! \nLoved the food, atmosphere was very cool, service was flawless! \nThis place is a little out of my way but so worth the drive. \nSee you there!","useful":0,"funny":0,"cool":0},
{"review_id":"9RwaSrYTX8QNqHx4nw-uAA","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"onCx6Ye5IwD07emyj-VLrg","stars":4,"date":"2016-07-15","text":"Says what it does on the box! If a Smokey, heavy, tasty and fully loaded traditional BBQ is what you crave then this is the place. Very welcoming staff, great food. \nIf I were a bigger BBQ fan in general this would be a 5 star review for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"l0b16WIR9xEAMCBiVN8HvA","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"zIyqiWYKrCvAdGeWXXBxFw","stars":5,"date":"2016-07-15","text":"Just ate here about 2 hours ago and I'm already planning my next visit! I had the salmon tartar which was perfect, pasta was excellent. The wine choices went well and were nothing I had ever had the opportunity to try before. The chef came out to ask each table how everything was..... Twice! \nWaiters were on top of their game and the setting is classy, comfortable and welcoming. \nGo here, try it, enjoy!","useful":4,"funny":0,"cool":0},
{"review_id":"rfdt_O1Ig1Fw0HIbmBENbw","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"D5cyvit3V5vEFzRXOc1Y4Q","stars":5,"date":"2016-07-15","text":"Simply the best coffee around. It's better coffee to the point that we have it in our office coffee maker and when I'm travelling and go for a coffee I miss it. \nWe are so lucky to have these boutique businesses in our area serving up this kind of quality. \nThis place IS The Beach!","useful":1,"funny":0,"cool":0},
{"review_id":"Pb_C4EG1fC_ZJ4ysVPTdIA","user_id":"nJ5P4LXcjlefJOP3HWDR2w","business_id":"nnjcCyP9Z8fpLWBEf87sUg","stars":5,"date":"2016-07-15","text":"Quickly became a staple and the go to place for half of my office. \nSimple, fast, flavourful and Good for you! \nIf this was the standard for fast food the world would be a better place.","useful":0,"funny":0,"cool":0},
{"review_id":"yLKMQNn8VE3CEDX-TF5CfA","user_id":"XolMSMha689jzWJgFJrekg","business_id":"iyyWYpWm8X-6i7kBR3JHuw","stars":1,"date":"2014-01-27","text":"Tried to attend a recent basketball game. Purchased General Admission tickets several weeks before the event for two elderly grandparents, two parents and two kids. Arrived 45 min early. Parking was a nightmare. Took 25 min to get from campus entrance to arena entrance. After getting to second floor of arena to access General Admission seating found all seats occupied and no standing room left! Clearly arean had been over sold by 500 to 1000 seats. Not only didn't we get to see the game people were crammed in the aisles and all around the back. Phoenix Fire Dept should have shut them down! Worse experience in many years. Guess the almighty dollar is more important than fair value for money rendered!","useful":1,"funny":0,"cool":0},
{"review_id":"FtTHpd5AzliAbuAUyqgXzw","user_id":"XolMSMha689jzWJgFJrekg","business_id":"COfxspS349gh-g1OMftquQ","stars":5,"date":"2017-01-27","text":"We ordered a new range hood and needed it installed for us.  Erik Dent installed it for us.  We told him when it would arrive and he was here the same day to install it.  He was very easy to work with regarding scheduling.  He came on time and worked fast and efficiently. He quoted a reasonable price on the phone and stuck to it, even though he did a few extra things because the wiring was old and needed updating.  Couldn't  be more please.  Had hired him several years ago which is why we chose him again. He did excellent work then and he still does.  Couldn't be more pleased!","useful":0,"funny":0,"cool":0},
{"review_id":"SoVB15wwXsJjaCJkAHHEDQ","user_id":"yeEE_GqZFtlD77_99P7xXA","business_id":"iD93WrT2Rn0sfm8aIHXkuQ","stars":5,"date":"2017-04-23","text":"The pharmacy is just amazing, the customer service is fantastic \nWe get a big prescription there so nice to get friends and helpful staff \nThanks so much.","useful":0,"funny":0,"cool":0},
{"review_id":"XMkb4ebQ1mnKE-cv2u6EYw","user_id":"yeEE_GqZFtlD77_99P7xXA","business_id":"A2pJexRMOpkSE8Tq68ZVbQ","stars":5,"date":"2017-06-30","text":"Sonny did my color today it was amazing never been s\n happy leaving a hairdresser my hair looked perfect will be back.\nand get a cut the next time so happy thank you Sonny.","useful":0,"funny":0,"cool":0},
{"review_id":"2lwqXP_iF2J29oDl_RqkNg","user_id":"yeEE_GqZFtlD77_99P7xXA","business_id":"x8Ia_x5_AUy_3hRUE5O8Gw","stars":5,"date":"2014-11-15","text":"Had my hair done by Katrina  today,I would recommend her so good.","useful":1,"funny":0,"cool":0},
{"review_id":"NfVpuGMz3oGQF2lJCzZqLQ","user_id":"4xYGmV2wEyagcpS7clUFbg","business_id":"OkGl2r39FMmK_ephOvcxvg","stars":1,"date":"2015-08-29","text":"Went to buy pastries and was treated very rudely by the woman owner...the other bad reviews are no joke ...I'll never go back to that bakery again....number 10 for sure...","useful":0,"funny":0,"cool":0},
{"review_id":"Mk__IwAfrKF4kr7shNZPtw","user_id":"s3XHL7uasUNnq5fyLIOMpw","business_id":"ZyEjstbyzJkc1bHec_4xhA","stars":5,"date":"2017-04-22","text":"Purchased a new F150 from Thomas Parker. He is very knowledgeable and puts the customer first. Thomas is not like most car salesman, he listens to the customer and makes sure they are getting what they want. He would be an asset to any dealership.","useful":0,"funny":0,"cool":0},
{"review_id":"FkPhIoHjwh1_LCrSxYKzmA","user_id":"Ml31kq4CmdxJGSvux_ch9w","business_id":"2Z5Shzs1Hn2WpbjguLyHHg","stars":5,"date":"2014-06-30","text":"DC Elite Fitness provides options for either one-on-one training or group Bootcamp training. Daniel the owner and head trainer is  very patient and knowledgable and a great motivator. \n\nI participate in the Bootcamp class between 4 to 5 days a week and it is a very motivational\/fun environment with great people. I would highly recommend anyone to check DC Elite fitness out if you are looking for a fun place to workout while working toward your desired results.","useful":1,"funny":0,"cool":0},
{"review_id":"qU76jmE5OzK9asFfZVpWTQ","user_id":"alxAvlMaOTYnr4KqWD3raQ","business_id":"bchksAMD4CtI98_s_kJNpg","stars":3,"date":"2014-05-02","text":"The food is good. The atmosphere is good but pretty loud. The have somebody playing the piano. BUT THE SERVICE IS HORRIBLE!!!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"CwSpgQT_PzoGb0vo5FX__Q","user_id":"Q7KAsXblnS5rWGAeHzLmJw","business_id":"Dy99p5bWfr6g0UtlmPjDqg","stars":5,"date":"2017-11-03","text":"I was so surprised to see a 3.5\/5 stars on Yelp for this place, so I feel compelled to do a review. I've dined here several times and I have had nothing but great experiences. The food is always spot on. I guess you could say it's pricey, but I really don't take that into consideration unless the food is bad, and in this case it isn't. $60 per person is a solid average price, I think. More if you want a lot of drinks.\n\nWine list is really great. Go for the bottle rather than the glass.\n\nThe cake is out of this world. Always. Get. The. Cake.\n\nThis is one of the best spots in Madison for a dinner or even a small snack after work during the week. As far as Tory Miller restaurants go, this one is probably second or third best after L'etoile and possibly Graze (maybe a tie).","useful":2,"funny":0,"cool":0},
{"review_id":"UVO_X4hssszf67h4UgEgPQ","user_id":"Q7KAsXblnS5rWGAeHzLmJw","business_id":"HVpwpXneaCWMeEBF7H8jpQ","stars":4,"date":"2017-12-31","text":"Decent prices for street food. The seating area is somewhat limited during peak dining times. It really irks me when groups of people come in and snag a table before ordering despite the long line. The seating issue would probably be better if they had a rule to order before sitting. \n\nPork bowl was really good. Coffin toast is cute, but I was expecting a more robust flavor. Squid balls are a nice side.","useful":0,"funny":0,"cool":0},
{"review_id":"rb4jxeI6EuiVQg2pYfgXEQ","user_id":"Q7KAsXblnS5rWGAeHzLmJw","business_id":"iIok1p4qnpGAa07xoaXRQA","stars":4,"date":"2017-12-31","text":"On a good day, I give this place a 4. I really like the Cobb salad and their pastries. Service can be poor depending on who you get. When you're being attended to by a manager at the bar, it's great. But I've gone in several times and essentially been ignored for 10 minutes before getting a water or hello. \n\nI've also tried buying coffee beans here a couple of times and every time they've been out. \n\nOk spot on the square if you're into light lunch fare. Don't expect to be blown away by service.","useful":1,"funny":0,"cool":0},
{"review_id":"vanqyI_zmYCYxjskShtJwQ","user_id":"lP0w3wr-BL2I2KZ5UMFoIw","business_id":"GLgL8e9QvHPvy39UIbX-cA","stars":1,"date":"2016-05-08","text":"I had a reservation Las Vegas to LAX. When I went to the window they told me they needed two utility bills and proof of insurance. Nowhere in my online reservation did it say they needed such ridiculous additional documents. My rate was $36.00 for the day. I had to purchase a plane ticket for $233.","useful":3,"funny":0,"cool":0},
{"review_id":"J0FHkh1JnW7w7CdsZBFXVw","user_id":"lP0w3wr-BL2I2KZ5UMFoIw","business_id":"vciJf1nGkI0eO-WGWQIFUQ","stars":5,"date":"2014-06-10","text":"I had a great experience with Americas Choice Realty. Mia D'Alexis was my realtor. She did an amazing job helping me find the house I was looking for. She was prompt to reply to all my emails and phone calls. Also negotiated a good deal for me. Highly recommend!","useful":1,"funny":0,"cool":2},
{"review_id":"qnvJsSa2dD5K8Dp7hkeocw","user_id":"3JpQJY_wU_KkUpskykl21A","business_id":"6Z6IyosSMciZtwk8hRLRag","stars":1,"date":"2015-12-27","text":"terrible service. dont go there?we have been there for about 10mins. and no one come to seated us with half place empty.","useful":1,"funny":0,"cool":0},
{"review_id":"aeyk5z_x7DZbp7KllgjIIw","user_id":"o40GNTpHdXFLCh5J34wQ6A","business_id":"xUYZzyhyJLdeiHk30cJQRw","stars":2,"date":"2016-07-23","text":"I went to the salon in person to discuss my needs and to schedule an appointment.  I spent a lot of time with the person at the front desk, making sure that I was matched with someone who would take the time to get to know me and the hair style that I wanted to achieve.  I was booked the following week with 2 different stylists.  One for hair color and another for a cut.  I showed up ON TIME.  I waited 15 minutes for the the colorist (Lauren) to greet me and start services.  I asked to speak to the lady who was going to cut my hair.  Everyone was rushed and no-one wanted to take the time to get to know me.  The colorist starting applying the color to my hair and informed me that there was not enough time for my hair cut. If I wanted to get my hair cut, I could come back another day or she could cut my hair.  The rudeness was unbelievable.  I was really looking forward to trying a new salon and stylist.  After much discussion, the manager came over and apologized.  I explained that the cut was the most important part of the day. Because there was not enough time for both, I opted to have the color washed out of my hair and have my hair cut with the person (leah) who I was scheduled with for the cut.  I waited 45 minutes for her, which meant I could have continued with the hair color and been fine with timing.  I came back the next day for Leah to color my hair. She barely said 5 words to me.  I paid $20 more for her to color my hair for a total of $85 for a root touch up.  There was NO offer by the salon for compensation for that fact that I had to come back to the salon TWICE.  The manager was nice and apologetic, but the attitude of the stylists was appalling.","useful":4,"funny":0,"cool":0},
{"review_id":"TNj9j0ZJeyDRefD2i-tkuQ","user_id":"o40GNTpHdXFLCh5J34wQ6A","business_id":"rjQDqMUZMigAVHmyb_5nRg","stars":2,"date":"2014-10-06","text":"My husband and I were celebrating our 23rd wedding anniversary weekend, and I suggested Blackthorne, as I have eaten there with friends, but he as never been to the restaurant.  We arrived a little after 6:30pm, and there was no one at the hostess stand to greet us.  We waited a few minutes, and then I popped my head around to the bar area, and caught the bartender's attention.  She looked at me and continued talking to two people at the bar.  She didn't bother to acknowledge our presence or to go and get someone to seat us.  The bar area, as well as the restaurant was fairly empty, with just a few tables of customers.  My husband and I continued to wait at the hostess stand, and then we were approached by a customer who wanted to know where the nearest gas station was located, so that he could go get some cigarettes.  Yes, we were standing there that long. I finally walked over to the bar and asked the bartender if we could be seated.  She told me to \"wait a minute\", to which one of the customers told me to relax and wait.  The customer then proceeded to spill a beer all over himself and the bar.  At that point the bartender reluctantly took us to a table.  I asked her to send a manager over to speak to us.  The manager came out and cleaned a table,  glanced our direction, and walked away.  When our server finally came to our table, I asked to speak to the manager.  He came to our table a few minutes later.  I asked if the bartender had let him know that we needed to speak with him,  His response, \"she said that you all had been waiting a while, but didn't tell me that you wanted to talk to me.\"  SERIOUSLY.  What manager would not immediately go apologize to customers who had to wait in an empty restaurant to be seated at a table???  He gave a mild apology.  This is the worst service that I have ever received in a restaurant, and never mind that we spent $100 for dinner.","useful":3,"funny":0,"cool":0},
{"review_id":"YqVSmu_QLronidbupFLthw","user_id":"dOsSS5r_YXViQznl6EvXlg","business_id":"OLceT-xSok7HlL5F6ZZKKA","stars":1,"date":"2015-05-11","text":"Very good decor!\nServer was nice!\nPlace was busy do to Mother's Day \nI had the fish and chips shore the fish was not fresh fried looked frozen tasted frozen.\nMy wife had the beef brisket tasted ok but looked like mush on a plate not Good.\nThey forgot my vinegar. They forgot the Mac cheese. The cole slaw was way to wet I almost choked on it gggggaggggg\nHad three people that were involved in my table not good.\nWay to much money for the quality of food 1-10 I give the place a 1 you guys need a lot of work sorry but true. How do I know because I've been a chef for the past 30 years.","useful":0,"funny":1,"cool":1},
{"review_id":"ed8to80UuSExhgfJOyWphQ","user_id":"dOsSS5r_YXViQznl6EvXlg","business_id":"0dFOy1BeJWuYTyIsi-gAqw","stars":1,"date":"2015-05-10","text":"Well I had to give a star because required. This place is a star minus. Land scraping does not exist and the up keep is just a grade above a bed bug infested super 8 hotel so what does that tell you.","useful":1,"funny":1,"cool":0},
{"review_id":"60AKjXlX36FeZRqQGokyew","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"MVHGmZEwtKrXH11ySGweEw","stars":4,"date":"2015-04-19","text":"First time checking out this place tonight and it was very cool! Tonight we did an appetizer medley because we went early with our young son and just felt the need to explore the menu a bit. First of all we ordered our son's \"fish sticks\" to come first... Wow!! They were huge! He actually didn't eat them because he is not used to such fresh and delicious fish for his meal (18 months old) but we loved them! \nWe also had the calamari, crab cake, lobster mac and cheese and a Caesar salad (for just 2 of us?! What were we thinking!) I would say the crab cake was the best! Lobster mac n cheese was really good but didn't live up to the hype I've seen on other reviews. Calamari and Caesar salad were good too. \nThe service was amazing. We had a very attentive waitress and several other people delivering food, checking on us and clearing plates away! I love that kind of attention- they really want to make sure you are enjoying yourself. We ended with the creme Brûlée and it was delicious!! We ordered way too much food and have our left overs for tomorrow!! We will be going back for sure to try the pots! And maybe even the fried chicken!","useful":1,"funny":0,"cool":0},
{"review_id":"SP0yp8GlS0UiWqmmlEaVkw","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"3xIqAv3XFV1Zw7JE9agv6w","stars":5,"date":"2016-08-19","text":"Monica is the perfect fit hair stylist for me!! I give her complete control of my hair and she has never let me down. Recently, we did a Brazilian Blowout to help tame my crazy hair, and it worked out great! It made managing my hair so easy when I traveled to hot and humid NY. And even my Mom complimented my hair!!  That has NEVER happened. I send all my friends to Monica! We have so much fun at every visit!","useful":0,"funny":0,"cool":1},
{"review_id":"5Y3Fp_v-1tqol4pkbvFoMw","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"xdorpy--tfsaiNey9tvJdA","stars":5,"date":"2014-10-14","text":"I was lucky to be referred to Urban Wellness when I was pregnant over a year ago. I had, and continue to have regular massage visits with Alexis. She is very knowledgeable about all things woman! It is wonderful to have someone who understands your body and knows how to help you on a regular basis. I look forward to my regular visits, and I always feel like my needs have been met after each visit!! I highly recommend the many services available at Urban Wellness!","useful":1,"funny":0,"cool":0},
{"review_id":"ZO0B1EPhKdOGt-94wJYd3Q","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"XGMpMJ94OyHmAYRVMdEnGQ","stars":5,"date":"2014-09-17","text":"Dr. Steve was my final stop on my hunt to find a chiropractor in the valley. I moved to AZ several years ago and had to try many chiropractors until I finally found the right one!! Dr. Steve has helped to relieve my chronic back and neck pain, and he has also been very educating when it comes to health advice. Dr. Steve and staff are friendly and welcoming and I always enjoy my time there.","useful":1,"funny":0,"cool":1},
{"review_id":"Jaz4yU78USK7qBTggREGdg","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"SPrOEdbcxGQSvVLDJk2O_g","stars":5,"date":"2015-11-21","text":"Zoey and LO looked great! What a great place. Highly, highly recommended. Thank you Jen!!","useful":0,"funny":0,"cool":0},
{"review_id":"JTprkR0XZ3NDgG3xLttwtw","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"FmraE2CWt65VRnEqCAqNEg","stars":4,"date":"2015-04-25","text":"New to the area and have been trying some different places each weekend. We had one of their yummy burgers and a flat bread and they were both delicious.  Brought left over flat bread home and enjoyed again the next day. Loved the different choices on the menu, had a fun waiter and waiter in training and it was an enjoyable experience. We will return for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"dLpvtlONhLEisoXf4eKlHg","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"itJ5Amsr2XeGwGd90l3I8w","stars":5,"date":"2016-01-03","text":"This place is crazy fun! No need to battle the parking lots and big stores like Total wine... This place has so many beers and liquors to choose from and growlers to fill as well!! Yummy!!","useful":0,"funny":0,"cool":0},
{"review_id":"5pOaskqgVyzDxYiKNHbGrQ","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"thXrmzpNMW5W_b22M2JicQ","stars":5,"date":"2016-04-04","text":"We had a great visit today! My two year old was nervous at first, but quickly settled in to his Lightning MCQueen car and watched a little Paw Patrol. Yolanda, our stylist was very nice, happy and friendly! The place was very clean and accommodating. This will be our new regular haircut place!","useful":0,"funny":0,"cool":0},
{"review_id":"Zbrch8XUvKFrp_68jiHBOQ","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"nXtgMIF5aZND4LD8um-8cw","stars":5,"date":"2017-07-29","text":"Just finished the big move with Will, Tyler, Chris and Matt. These guys were amazing!! On time, efficient, no hidden fees, careful with my belongings, and great about communicating with me. They worked well together and really amazed me with how fast and efficient they were. I highly recommend them!","useful":2,"funny":0,"cool":2},
{"review_id":"WZB5rDgrIc3AnGlTXL3AsQ","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"IKrhAx9KpUgDiUq2KUeQQA","stars":4,"date":"2015-10-04","text":"It was the perfect little outing for our family. $10 for a child to get in, $3 for an adult. With the child admission you get a small pumpkin to decorate and a bag of stickers for decorating it. As well as access to a bouncy house, corn maze, and viewing animals. My 2 year old son loved running around and walking along with chickens\/turkeys. He enjoyed climbing the massive dirt pile and investigating all of the pumpkins. He was in and out of the bounce house and had a fun time seeing the animals. We didn't spend our time decorating our pumpkin there because there was a lot of fun wandering around to do! It was a nice two hour morning outing to get him tired and hungry for lunch and a nap! We will be sure to return!","useful":5,"funny":0,"cool":0},
{"review_id":"YSEF4zUlh7mrlW3fqEzDaQ","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"dxvsOCvRPnHB6P3IN-KDuw","stars":4,"date":"2015-04-13","text":"Just tried this place for the first time! Yummy! I am stuffed. Loved the garlic knots as mentioned before, also the antipasto was great! Good sized pieces of the yummy Italian meats you want in an antipasto. Pizza was great too and I am a picky Ny'er when it comes to pizza. Would have liked the crust to be a bit crispier, but it was still delicious! My son is still eating his kid's spaghetti as well! Tons of pasta for $5!! Did I mention I loved the garlic knots!","useful":0,"funny":0,"cool":0},
{"review_id":"zZRKD8P6hmhMKiWprDPB4w","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"qAY__Yna8ULkVj9OX_ZX3g","stars":5,"date":"2017-06-21","text":"Stopped here randomly today and had the best service. Staff was kind and friendly. They didn't try to up sell me on anything, and didn't make me feel bad about having terrible cuticles and short toenails!!I had a pedicure and manicure together. You know the kind where they make you feel like a rock star by doing it at the same time! It has the small town shop kind of feel and I would return here for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"fRZr6q-a2GOuu3jl-de-bg","user_id":"Vzm4fJnIxmgSKTgR1-0uzA","business_id":"zUgDrRtGvK5ZTFlHCsTHwA","stars":4,"date":"2014-09-17","text":"The best pizza I have found in the valley that tastes like authentic small town NY pizza. We have only tried the basic cheese and sausage (like 5 times since I tried it 6 weeks ago) but we plan to explore more soon! Also, love their Cesar salad dressing!! Yummy!","useful":0,"funny":0,"cool":0},
{"review_id":"L7Y32aCyu1j3wk9yolLEkg","user_id":"3ZAUnSCVa7VhsJobdImCow","business_id":"N7hY5ZMttt730xl2BUCYCA","stars":1,"date":"2015-03-17","text":"Since we've moved in our ceiling has been leaking and they've \"fixed\" it every other month. Not worth the price. Two pools but they're small.  I would look somewhere else!","useful":5,"funny":0,"cool":0},
{"review_id":"Sn9W33hx9dZ4NHC995uV0w","user_id":"deO7Y8lgoABSe8PmNe6ung","business_id":"DblaHOPFkdqKNMXlSOzw7Q","stars":1,"date":"2015-04-08","text":"We have been going here since last year, June and usually they do a good job with our dog (long-haired dachshund). Today, he came back as a no-haired dachshund! (I think it was new staff working today) They made a mistake and shaved my little boy. My husband said the girl at the front was very rude (even if they made a mistake) plus insisting him to pay because they did what we asked for.(even if it was not what we wanted) I can't believe they shaved my dog and not even try to say sorry first. we called the owner of the shop and explained what happened. The owner apologized but, Honestly, we do not want to go to this store anymore and do not want to recommend to anybody we know. It is common sense that you apologize when you make a mistake. It seems like they don't even care for your dogs. Also, he is long-haired dachshund... Why the heck would we ask them to shave him completely off?!?!","useful":3,"funny":1,"cool":1},
{"review_id":"_Ti11ImhYFsfMkS6xnMVDQ","user_id":"Di8uJuWvFmJI7Fdy1LQoog","business_id":"CVRTly4ag_q5ua0R3iqrVw","stars":5,"date":"2014-10-20","text":"Decided to check out this place with friends during our stay at SLS. The food was delicious. The noodles are made from scratch and you can taste the quality. My favorites were the Crispy Bao Bun and the Hakka Fried Rice Pot. It's a great place to have a family style kind of meal. Our server Alex was helpful in food recommendations and just amazing overall. Would definitely recommend this place to anyone staying in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"qiIXNI57hkK4M7UkrCiHig","user_id":"OmoWAaQzenHlde3FqKLB4w","business_id":"etFoNPRkScrQvuAQCFV4Hg","stars":5,"date":"2017-11-12","text":"Greg is AWESOME.  He has explained the whole process, immediately got into the property and inspect it and created a 71 page report!, with explanation and pictures.  He is efficient and very thorough with a very reasonable fee. Purchasing from out of state can be a nightmare, but Greg made us feel great and now we know everything about this property. I highly recommend him. Thanks Greg.","useful":0,"funny":0,"cool":0},
{"review_id":"ZgBbAAqYIT4vJnb41zBmrg","user_id":"Fpy6MlIcTVTS3jTluhNxgA","business_id":"0LU8TLoYmMf6_ujYMPFGJg","stars":4,"date":"2015-01-03","text":"It's not like King Spa in Chicago- it's small and cozy. For 20 bucks, you cannot complain. I would choose here any night if I needed a cheap place to stay! Well, I am used to sleeping on hard floors. \n\nWarning for overnighters: people do snore. Do not fall asleep in the hot sauna rooms. You can die or wake up very shriveled. The outside jjimjil room does get cold at night. I slept for about thirty minutes but my body told me to go into the toasty room that connects you to the sauna rooms. You should bring a wet towel, which will act as a humidifier in the hot room.\n\nThere are only two baths, but at the time I went, this was not a problem. There are enough showers and the steam room is big enough, in my opinion. I can't imagine what it would be like if a lot of people came to the sauna. I'd feel a bit cramped for sure .\n\nTake a long, nice bath. Scrub out your anxieties, fears, and stress. Detox in the many sauna rooms! It's like Korean therapy. \nBeing physically clean really correlates to feeling mentally clean. \n\nFor 20 dollars, not bad at all!!","useful":14,"funny":4,"cool":6},
{"review_id":"WARNXEum0VJTjltjTA0ryQ","user_id":"Fpy6MlIcTVTS3jTluhNxgA","business_id":"l07ctcrDMV--TYwe3uzebQ","stars":4,"date":"2015-01-03","text":"The restaurant is clean and accommodating for large groups of people. Servers are pretty Korean, as in they are more comfortable speaking Korean. Regardless, everything on the menu has an english translation. \n\nThey offer a large variety of Korean food. Mainly hot soups, and traditional favorites like bibimbap and ddukbokki. \n\nPretty good side dishes~ \nI recommend the mackerel dish. \nBulgogi jungol is very delicious. So is the soondae guk. \nRice is purple and yummy.\nMore than good enough for the price!\n\nCome with someone who knows Korean so you can flag the waitresses down for refills.","useful":0,"funny":0,"cool":0},
{"review_id":"XbRq4GRuGmk6owSq4PlANw","user_id":"fUax-EYu7F9UpJ7BXXrhmg","business_id":"w1fJzm0ladnhvT7Jc0MJ6w","stars":1,"date":"2016-07-02","text":"If I could give no stars I would. I went to get a cut today and it seems to me the consistency for the dedication to quality is not across the board. As a business owner Tony your employees are a direct reflection of you and exuberate your persona. A customer looks for consistency not only in the barber but in the barber shop as well. I asked the employee who cut my hair today to \"read the shape of my head. It appears this was a difficult task due to the fact that when I got home and looked at the work she had done nearly half of the top portion of my head was cut down to a one!!! The rest of it top portion had some length to it making my head look like it was completely butchered! A cut is suppose to be faded as it moves up to the crown of the head and from there should be well blended. The top of my head looks like a deformity because this person was not paying attention and did not take the time to provide great customer service. A barber should take pride in their work and take their time and know with out a doubt what they are going to do and communicate with the customer so that both parties are on the Same fucking page. How hard is that?! I will no longer be coming here as my confidence is shot in this place after today. I would recommend that you save yourself the trouble of coming here and do the same!!","useful":0,"funny":0,"cool":0},
{"review_id":"DuavOpFlwGpb8vd0sizixQ","user_id":"iTBvaPuS-Ea9SXjsfS_y-g","business_id":"zHzV2hmXsRYxDNAxvPOVKw","stars":5,"date":"2016-05-14","text":"I first discovered Mitsuki when they were a little hole in the wall in Longueuil.  I am very glad they've grown and expanded to different locations. Love the all you can eat concept.  Food is delicious, the place is very clean and the service is quick and courteous as always.","useful":0,"funny":0,"cool":0},
{"review_id":"mjINe8TahAa8GqgHacGlZQ","user_id":"25L-grqw8r5VqnXYrYxUdQ","business_id":"NwXtHmIsmMlQ2KY_BGaL8w","stars":5,"date":"2017-04-25","text":"AN ABSOLUTE MUST DO IF YOU TRULY LOVE YOUR DOG!\n\nMy boyfriend and I have a 5-month old German Shepherd puppy who has been and currently attends training, playtime, and grooming sessions here. \n\nTraining: Matt, the owner of Romp, instructs all the training classes and we could not be happier with his \"training with kindness\" method. There are many ideas about what German Shepherds should be and do act like, but both my boyfriend and I found it truly important to make him the sweetest dog possible. We do not want a robot dog that loses all personality because of training via \"being broken\". Romp exceeds our expectations every time with this regard as, while learning to be obedient for safety and fun, our puppy grows his personality each and every week! It is amazingly spectacular! \n\nPlaytime: Matt's highly professional and super caring staff always make our puppy feel loved and missed every week. It is almost like its his second home here, where all his friends live too. We absolutely love receiving his report cards at the end of each playtime, telling us what his \"paw\"sonality, what his favorite activity, who his best friend, and any room of imp\"ruff\"ment was that day. FYI...he's a straight A student so never any room for imp\"ruff\"ment here, but the staff will let you know if you need to work on something with your dog. Our puppy adores these play sessions and comes back exhausted from his long day of fun. I do have to say that I always speak to Savanna and she is the best! \n\nGrooming: Amanda always makes him look so cute! She really does a terrific job and has over 20 years of experience! What more can you ask for than that? Our German Shepherd puppy is extremely unique that loves being clean and looking his best, but tends to oppose being brushed and groomed at home. Somehow, I still do not know how!, Amanda gets him to not only tolerate these activities, but to want to be brushed and groomed all day long! It is so strange, but I am super grateful to her for her sixth sense!\n\nEvery where we go and everyone who interacts with our puppy always says how well behaved and what an outstanding temperament he has and it is in huge part due to Matt and his A team at Romp!\n\nAll in all, if you have a dog and have not taken him or her to Romp, you are doing a tremendous disservice to yourself and your pup. In other words, you would be crazy not to try this place! I can go on and on. \n\nThank you Romp!","useful":3,"funny":0,"cool":0},
{"review_id":"WiFIXfYIo2zE5jkwfeu6tQ","user_id":"25L-grqw8r5VqnXYrYxUdQ","business_id":"GL7nUcdrk2PwFk0tAoCVyg","stars":5,"date":"2016-07-30","text":"USE THIS COMPANY!\n\nI recently had a last-minute move that was uncertain until the very last day. After calling numerous moving companies that all did not have availability for 2 weeks, I received a light at the end of the tunnel by putting faith in One Price Moving. Jeff, the owner, answered all my questions extremely professionally (and, I had many!) and assured me that I would be in good hands. He was completely right! He came to see my possessions that same day so that he could give me a realistic quote to move them. He 100% stuck to the quote given as well as sent over a contract to nail everything down in stone.\n\nFor all the little details, from giving me a ton of boxes, arranging for a storage facility just in case, sending over four super impressive movers, and granting all my wishes for the move, it grew to an extraordinary experience. There was not one phone call not answered, question not addressed, and complication not resolved instantly. Additionally, if I was not thrilled enough with Jeff, his skilled movers tipped the scale to having absolutely no doubt that I made the right decision to use One Price Moving. They not only moved, installed, built, hung, and addressed absolutely every item that needed it until all was perfectly in place, but did everything with a smile on their faces and great work ethic. It was an absolute pleasure dealing with this company and I hope that you have the honor of working with them sometime soon too!\n\nTRUST THIS COMPANY! YOU WILL NOT BE DISAPPOINTED, BUT RATHER ABSOLUTELY ECSTATIC!!!","useful":1,"funny":0,"cool":0},
{"review_id":"9zmKekuaxcWyQuASYUm4Dw","user_id":"25L-grqw8r5VqnXYrYxUdQ","business_id":"hM3TwxTe_XWvdXZUiFkZ9g","stars":5,"date":"2012-05-20","text":"Okay, so remember when I said Epic couldn't get the job done the first time they tried in my apartment complex? Well...Brett, the owner, called me the next day and refused to accept that and talked out multiple ways we could approach the carpet cleaning. You know how people say when there's a will, there's a way? Brett truly makes that quote a reality! So he send over one of his guys again and guess what? My carpets now look like brand new because EPIC DID GET IT DONE! \n\nI am SO happy! Brett, thank you for not giving up!","useful":0,"funny":0,"cool":0},
{"review_id":"w0ZCpOt4EcXI3kpjvrckIQ","user_id":"25L-grqw8r5VqnXYrYxUdQ","business_id":"fbVFJNbdVPjVq_pCwh8PFQ","stars":5,"date":"2014-01-21","text":"Annie, the owner of the salon portion, is ABSOLUTELY...THE BEST! She really knows her stuff about hair and is a color correction specialist. Before I moved out to Arizona (originally grew up in NY), my hair was bleach blonde and I never liked it. My hair dresser back in NY LOVED blonde and so kept making my hair lighter with each visit. I did not have the heart to yell at her and say \"stop coloring my hair the color YOU want it to be\". When I met Annie, the experience was ENTIRELY different!!! The first thing she asked me was what I envisioned for my hair color, what I did not like about it, and how I thought it would be perfect. Another thing she said was that anytime I was bored with my hair to feel free to tell her and she would revolutionize it again. She stayed true to her promise in the now two years that I have been seeing her. I also LOVE that if I want something new done to my hair and it is not fashion forward, she will work with the idea until it is. It always comes out even better than the original thought!!! I keep telling her that she needs to start her own product line too so hopefully that is to come soon!!! :D\n\nAs far as the vintage portion...Miles runs that. It always has intriguing items that are not what you would expect to find just anywhere. I have personally not made a purchase yet, but my colleague and I went to 3rd Thursday and she bought a door for $5!!! There is not even where to have lunch for that price! Miles gave her helpful suggestions as to how to recreate the door into a unique piece of art with either using pictures and turning it into a giant frame or using it as a room divider. Pretty cool!!! I am excited to see what my first purchased item will be someday! \n\nAnnie and Miles are an unstoppable team! Go visit!","useful":0,"funny":0,"cool":0},
{"review_id":"9sahCZaL51u_bsDtQ3G7sA","user_id":"25L-grqw8r5VqnXYrYxUdQ","business_id":"Y5CTA3S9TVkpr3Yvwaki-A","stars":1,"date":"2014-03-26","text":"I will absolutely NEVER go to iPic again!!!\n\nI had been SO excited to go to this theatre with my boyfriend. I had been telling him for 8 months that we had to go to this theatre because I took the tour, knew about it through work, and just loved the whole idea. My boyfriend is a very \"let's do everything last-minute\" type guy, and so it literally took us that much time to finally get into this theatre for a movie. If you want to go, reserve your spot at least a few days in advance. \n\nAnyway, we finally got in and saw Jack Ryan. The tickets were NOT worth the money to sit in this \"exclusive\" theatre. We decided to make a full date of the experience and also have dinner at the theatre. My boyfriend's food and soda came about 30 minutes before the movie ended (around 9:00pm) and I was not so lucky, my food and water never arrived!!! My boyfriend and I both asked the waiter several times when my food and water would arrive, when we could find him that is, and nothing! I asked the waiter to at least bring me some water (I was super dehydrated already) and...NOTHING!!! Finally, at the end of the movie, we complained to the waiter and he said he would get a manager. Guess what? A manager NEVER CAME!!! As I told my boyfriend that night, the difference in the comfort of the seats versus a Harkins or AMC is not large enough for me to overlook the extreme disappointment of having to wonder where the waiter is at every moment. I do not even know what happened in the movie!!! That is how preoccupied I got with where the waiter was, where the food was, and if I was even going to have water to drink!!! \n\nAll in all, the seats are comfortable, of course, if not the theatre would not bring in any business, but I strongly recommend that you just invest in a recliner for your home instead. It is way less frustrating!","useful":0,"funny":0,"cool":0},
{"review_id":"huEWPEWPxnN2D28iBcFz7w","user_id":"IievWqVeMgFy_GPGtSYjZg","business_id":"mO8ukT3f5BRQ29pC_WoAtg","stars":5,"date":"2015-01-05","text":"I would like to say that this place is very clean and professional. My nail tech was Lynn and she really took her time for my gel mani and I'm going on 3 weeks now and\n no chipping! I can't wait to visit again.","useful":0,"funny":0,"cool":0},
{"review_id":"SKCgkIvj7-HbtB5kVrhPug","user_id":"IievWqVeMgFy_GPGtSYjZg","business_id":"2CabGE-ZFsKrw5Ke_mNsaw","stars":5,"date":"2015-12-17","text":"Mike does exactly what you want & beyond. Very talented and friendly has a lot of patience and really listens!","useful":0,"funny":0,"cool":0},
{"review_id":"CeMcl8JKdTCNSd6xy1iyog","user_id":"gRZunXUG9QSD7SSPLAK0Hw","business_id":"fkjlGmamIYQHgnrE18X1LQ","stars":5,"date":"2015-10-03","text":"Moved to AZ from NY almost a year ago now; when I first got here, I went to FOUR different nail salons asking for the \"pink and white\" (basic french tip manicure) with LIQUID gel.  (Not just regular gel polish).  NONE of the other salons knew what they were doing!\n  \nI finally wised up and found Angel nails where I met John...He is AMAZING and so is the rest of the staff.  If you are looking for someone who REALLY knows how to do \"liquid gel\" nails, John is your guy!  Not only is John nice, but it's a family business.  Angela (the receptionist is a sweetheart and is always very helpful.)\n\nAs far as the rest of the team - the pedicures are AMAZING!  I love the Coconut pedi, Lavender pedi and Cucumber pedi.  All are amazing!  The place is immaculate and very sanitary. \n\nI moved from Surprise and now live in Scottsdale, but I still go to see John and his team every two weeks - I won't go anywhere else to get my nails done.  \n\nI highly recommend them to anyone; in fact quite a few women from my office have started to go see John and his team as well.","useful":6,"funny":0,"cool":0},
{"review_id":"sLrmxw0ijtIfJvdwTGqfUw","user_id":"gRZunXUG9QSD7SSPLAK0Hw","business_id":"Iq7NqQD-sESu3vr9iEGuTA","stars":5,"date":"2015-10-18","text":"All I can say is I have NEVER had a bad breakfast at Butters (everything on the menu is amazing!)  I love their fresh ground coffee\/espresso\/lattes.  \n\nDo not let the \"wait\" time scare you off; they are so super fast and efficient.  \n\nThe weekend staff is amazing, especially Danny who really takes the time to get to know all the regulars.  I highly recommend Butters to anyone in the area.","useful":4,"funny":2,"cool":2},
{"review_id":"xDrDrKkfzfwGecGHesTOGg","user_id":"gRZunXUG9QSD7SSPLAK0Hw","business_id":"ZFB7DqpYHk9DUVS34iGTLQ","stars":5,"date":"2015-10-18","text":"I found Ramon Bacaui Hair salon almost a year ago before moving from NY to Arizona.  I had SoCap hair extensions before I moved, and did some research and found Ramon's salon.  \n\nI have NOT been disappointed in the least!  He is a master at what he does and is well worth the money.  He just doesn't \"do hair\" --- he creates masterpieces.  I've had two more sets of hair extensions done by Ramon and NO ONE even knew I had extensions, they looked THAT good and THAT natural.\n\nI had the extensions removed for the summer, and continue to go and get my hair cut and colored by Ruby (Ramon's sister).  She is fabulous as well!  They certainly know what they are doing and they are just simply amazing and so sweet and kind.  \n\nI would highly recommend this salon if you are considering extensions, if you have damaged hair or just need a new look.","useful":3,"funny":0,"cool":1},
{"review_id":"vD0HaT-6CTYVl0NiXpejPw","user_id":"gRZunXUG9QSD7SSPLAK0Hw","business_id":"ZYUCffa5zsT1HPnKxeKQrQ","stars":1,"date":"2015-10-03","text":"Went to Estrella ONCE for Liquid Gel nails.  The girl did not have a CLUE as how to do REAL liquid gel nails.  Not even 24 hours after getting my pink and white \"liquid gel\" nails done, they were cracking and chipping.  \n\nWent here once and ONLY once.  Never will return.  Found a MUCH better nail salon.","useful":5,"funny":0,"cool":0},
{"review_id":"hmUvqu9CgpxVAJ97DRRsfw","user_id":"gRZunXUG9QSD7SSPLAK0Hw","business_id":"6ZjHmQYWCaJuF4QffmlspQ","stars":5,"date":"2017-11-01","text":"The customer service here is beyond exceptional!  Everyone is super friendly and accommodating.  I've never had a bad experience here and even if on the off chance I were to, I know that they would make it right.  The salon\/spa itself is exceptional!  It's beautiful!  The quality and QUANTITY of SNS they have is amazing and the skills their technicians possess are superior to any others that I have tried.  Also the attention to detail is superb! I highly recommend stopping in and checking out VIP BN Nail & Spa.","useful":0,"funny":0,"cool":0},
{"review_id":"Gw4pTbZRTAqDFIXRRgZIxw","user_id":"xXHypXYkq17DWQ49lprc0Q","business_id":"ZJ0gQp0fcnIDiZv0m9--Gg","stars":5,"date":"2015-11-26","text":"5 STARS . Excellent Service  It is a very GOOD place, Nicely Decorated. I tried the indian food for the first time and it was very delicious. Service was excellent and the waiter was Awesome with complete knowledge of food and spice levels. Astush (if I spelled it right) was our Server and was Super friendly. He recommended me the Chicken Tikka Masala for Medium Spicy and Lamb Vindaloo for my husband who wanted to eat spicy. Food was great and the Service made our night awesome. I would Recommend this place to everybody I know.","useful":1,"funny":0,"cool":1},
{"review_id":"UttZ4Bl-qjsXzw3G5BZHIg","user_id":"xXHypXYkq17DWQ49lprc0Q","business_id":"jCNBZnkIFv_0omLVTgNR6Q","stars":5,"date":"2016-02-14","text":"This place is too good.there was lots of buffet and different type of food .food is soo tasty.prepration is soo good specially chicken tikka ,saag and dal makhni was too good .if anyone try to eat indian food I suggested this place .service was good it's very good Resturant","useful":1,"funny":0,"cool":0},
{"review_id":"6gAphA1D4YFZPmjZqrYQ6g","user_id":"R78sBQUQEyJx3mPef3xWpQ","business_id":"JRUPe8_nRv5en42S4tOx7A","stars":5,"date":"2014-02-28","text":"Friendly associates and great prices! The store is always organized so I can shop with ease. I go out of my way to drive to this store. I was in recently and heard they are getting a store remodel next month! I spoke with the new store manager, and he is very personable as well! Thanks Kohl's for being a GREAT place to shop!","useful":0,"funny":0,"cool":0},
{"review_id":"czc54SukbKYC1A43DGGbBQ","user_id":"R78sBQUQEyJx3mPef3xWpQ","business_id":"jUqCRsuGqwePkDKQ1fM6TA","stars":5,"date":"2014-08-30","text":"We love this place! A great little bakery for us to walk to. Fresh food and friendly service.","useful":0,"funny":0,"cool":0},
{"review_id":"RjfExIZoaKY0wlSYQSmSjg","user_id":"R78sBQUQEyJx3mPef3xWpQ","business_id":"BKbh-45X41-ZDMsOEawR9A","stars":1,"date":"2015-01-20","text":"Set up an \"appointment\" and still waiting an hour and a half after that time. Staff was nice but got different reasons for running late including emergencies and lots of people walking in.","useful":0,"funny":0,"cool":0},
{"review_id":"ZSGuHTWV7dD-1pC9HcOk5Q","user_id":"R78sBQUQEyJx3mPef3xWpQ","business_id":"fpq8H7tPv8gK3me02NASfg","stars":1,"date":"2014-08-25","text":"Slowest service ever. Three people at the cash register and only one person making the actual orders.","useful":0,"funny":0,"cool":0},
{"review_id":"tAqsy5Kq-6VESe9YJUsOKg","user_id":"plZ58vScKsk2oNXxX1eFWQ","business_id":"9t_8diw5-AlHwpRdZAP22w","stars":5,"date":"2016-06-26","text":"I recently got my car full detailed and they did a good job on it for a reasonable price too. the staff are nice and friendly. I highly recommend this place. Will come back for sure","useful":0,"funny":0,"cool":0},
{"review_id":"rkbLdlVl4FsryiHdG7QP7g","user_id":"_ZdqEG92TfBmJtfrdLB89g","business_id":"i_K9elBRuVJsKEl8nsu5Yg","stars":3,"date":"2012-07-29","text":"If you're into dive bars and just normal guys sitting around drinking, this is your place. Being from out of town I obviously didn't know anyone, however, the regulars seemed to be having a good time. The bartender was friendly and poured me a nice stiff drink. A bit off the strip, but a good place to check out if you have time.","useful":1,"funny":0,"cool":1},
{"review_id":"ZsoSfKuLYe97xwO2rEZdnw","user_id":"33P2Q9AfJP8yMEhAqkAFjw","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":4,"date":"2012-03-18","text":"Food was excellent, especially the roasted pork with sweet potato tamale.  Top notch.  Wine list was fair.  Service was good.","useful":0,"funny":0,"cool":0},
{"review_id":"7DWaZne3sZSop4pH7djhTg","user_id":"33P2Q9AfJP8yMEhAqkAFjw","business_id":"DESv2ys6SjBKA4SyDtJvxw","stars":5,"date":"2012-03-18","text":"One of the best places in Vegas, and off the strip.  Food is always superb, and service is always very attentive.  Wine list and sommelier are top notch, and good value can be found.  Lobster ravioli makes the trip worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"c9t6gxuQrzwIx44Vz_9ZDw","user_id":"33P2Q9AfJP8yMEhAqkAFjw","business_id":"6xgcHeLad-VaoTIQewK84A","stars":3,"date":"2012-03-18","text":"Cool atmosphere, good scene.  Food is very good, but not off the charts.  Our server was only fair, and didn't seem terribly interested in serving us right from the start.  Wine list is impressive, but the wine is grossly overpriced.","useful":0,"funny":0,"cool":0},
{"review_id":"5pOKVqCvSpOAq9So6naXPw","user_id":"33P2Q9AfJP8yMEhAqkAFjw","business_id":"ejaUQ1hYo7Q7xCL1HdPINw","stars":4,"date":"2012-11-14","text":"Solid joint.  Beer is better than expected and almost as good as advertised.  Food is up to par, but most everything revolves around the beer, as it should.  Everyone owes this place at least one visit.   Hope to be back.","useful":0,"funny":0,"cool":0},
{"review_id":"zH6_pHCCIkxCvrG2m35U2g","user_id":"fSt-bIa8Mv8PqCShRRl38A","business_id":"t5nyOtnEv455rShOS_g3RA","stars":5,"date":"2016-06-18","text":"Soooooo good.\n\nThey need to open one at Bell Rd. & Loop 303.  Check it out.","useful":1,"funny":0,"cool":0},
{"review_id":"nYzuO7ZcdJ38YMpJpWjrfQ","user_id":"FyUGyg0r_uSPdgIwJpcQMg","business_id":"HBVzTJlmv1rD2SBL1OAOTg","stars":4,"date":"2013-09-07","text":"The owner is fantastic! Food is great everytime I order from them. It's always a hit when I bring the food to potlucks.","useful":0,"funny":0,"cool":0},
{"review_id":"8mId3IuV3gVI6wNnmFKMqA","user_id":"2AMC42JF_ia8QE20AAEECQ","business_id":"G6WGIx0y85tCI8wCxTFGXQ","stars":5,"date":"2012-07-21","text":"Great food and great atmosphere for a family.\n\nVery good value!","useful":0,"funny":0,"cool":0},
{"review_id":"WIoq4Z6VtnAcLDGOXvfy4A","user_id":"zpQ76JRDkleW-RQ-U__83g","business_id":"EFq1p7Nm1SkCqT2RQWI67A","stars":5,"date":"2013-09-29","text":"This is my favorite place to get takeout from! \n\nThey do a red dinner that comes with potatoes that's phenomenal! \n\nPepperoni rolls are rad! \n\nThen there Chicago style pizza is the best thing in the world! Comes with ricotta cheese on it!","useful":0,"funny":0,"cool":0},
{"review_id":"DDTB4u2sb3l2psWa7poLBQ","user_id":"Ee-LuZbCAbuB74V8w18hrg","business_id":"M-caugKzJ9qLOmCBfD9Nyg","stars":1,"date":"2009-04-22","text":"La Brioche is beautiful inside.  The food is good, borderline great.  The baked goods and cakes look better.  However, I will NEVER be able to get over how HORRIBLE the service is.  I have given La Brioche my \" 3 strikes\" policy, hoping that the bad service might be a fluke, but by reading the other reviews and by my own experiences, it seems like a trend.  The servers look like they are on a fast sinking ship, they are totally unaccommodating, totally rude and need to study up on what they are serving.   I feel like if the service is bad, why bother trying to make everything else great.\nI give La Brioche one star and I think I am being very generous.\nI feel like no matter how good an establishments food is, if the service is not up to par, it doesn't matter.","useful":3,"funny":0,"cool":0},
{"review_id":"EKJxsELERxMgD7jepl5i-w","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"PPfDGRXA4DXqejytd41umw","stars":4,"date":"2012-06-15","text":"I love Artigiano. Although, the service isn't that friendly or personable, they do they job properly and efficiently. \n\nI absolutely SWEAR by the Spanish Latte. One of the cashiers was the first to recommend me to a Spanish Latte and now I am addicted. \n\nBeautiful cafe inside too.","useful":0,"funny":0,"cool":0},
{"review_id":"YNOOuHk3tI20sQKSLUyBJQ","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"RoFaaILAVJsJeTCw39DHJQ","stars":4,"date":"2013-03-26","text":"I have bought every piece of camera equipment I own from The Camera Store. I literally walked into the store with absolutely no idea of what I wanted, or what anything was or how anything worked at all. I explained my situation (wanting an affordable, reliable DSLR, etc.) and the assosiate was able to help me pick the perfect set up. Even 3 years later I have never had a problem with the product. \nThey have a great rental option - which has helped me throughout the years. I have rented mics and lenses for great prices.\nI guarentee they have the best prices in town - I always end up having to ask other stores if they can match the prices.\n\nGreat staff, amazing selection of product, and great service.","useful":2,"funny":0,"cool":0},
{"review_id":"h07-ERxhbRX3GBtlIfGnCQ","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"PhN6PToHePTKbEgdedUlyQ","stars":4,"date":"2012-06-15","text":"I love The House. I always have as long as I can remember. Firstly, their products are very high quality. The coffee is delicious, espresso is perfect, they offer all different types of milk, and the food is just as great. Not to mention - they also have tasty smoothies.\n\nThey are definitely a little disorganized these days. I know that the shop is run by the Alliance Church and that they try to hire younger people who are involved with faith\/community. However - sometimes I find the volunteers\/employees to be very disorganized. And though they are always very friendly - sometimes they really just don't have it together. \n\nThe shop puts on various different events every day of the week - which keeps it interesting. They have open mics on Thursdays for all ages, shows on Fridays\/Saturdays, film viewings, AA meetings, different speakers, playtimes for Moms\/Kids. They are a truly fantastic organization with great products. Maybe a little weak in organization but generally 4\/5.","useful":2,"funny":0,"cool":0},
{"review_id":"OTLK_MmMEoGbQ5-yYH0JSg","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"6qmCO3di-FKWLdRn2LuF6g","stars":4,"date":"2013-03-26","text":"I love The Ship. It is an ugly place full of beautiful people. The food is great, they play great music - and even the Saturday afternoon open mic is nothing short of amusing. The patio gets busy in the summer, and the bar gets busiest on Saturday night. But hey, we can't hate on a place for being popular. Cheers to the Ship!","useful":1,"funny":1,"cool":1},
{"review_id":"TN0rFGauY9uXos15Q6iDIg","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"LMa0x4S5-5XYZegwB7jPug","stars":5,"date":"2012-06-15","text":"There is no better shawarma in the city. They add the perfect ingredients - nothing too obscure, but still enough flavour. It doesn't take much to order - they just grab your name and off you go. It's not too greasy, full of flavour, and though it's a little messy - it is quite the satisfying meal. \n\nI crave Jimmy's. I tell everyone to go there, it's simply fantastic.","useful":2,"funny":0,"cool":0},
{"review_id":"0xrjnVO42v8nva-kIseE3g","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"PlcZM0TyPw8JSRQqGjTdBA","stars":4,"date":"2013-03-26","text":"I'm such a fan of this pub. Firstly, it's adorable. Nothing feels more like home than walking into a tiny little character house for a pint. I like that they serve relatively local brews. \n\nIt's kind of a mixed crowd. I like it mostly when it's empty. You can sit on the deck upstairs - or play some pool. Very relaxed atmosphere. \n\nAlso - the nachos are SUPER great. Add chicken on top of them and they are DELICIOUS.","useful":0,"funny":0,"cool":0},
{"review_id":"QmOYv8iITN9W2Qpo_uappw","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"1-phG1_n-aycybl1r3_spA","stars":4,"date":"2012-06-15","text":"I love all the different varieties of tea that are available here. And every single tin I have purchased has been fantastic. The baristas are all extremely helpful when you need help finding something you would like, as well. \n\nIt's not too expensive - considering the quality. I tend to avoid the food though, since it seems quite over priced for what they are offering. Something like $8.00 for a grilled cheese? I've had them and they're great, but maybe not $8.00 kind of great. \n\nThe tea is great though. The matcha is the best in the neighbourhood and the staff is exceptional. Always a pleasant time here.","useful":0,"funny":0,"cool":0},
{"review_id":"NshsBbtcLde5VzTITOqfpw","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"5aK167zvZhGs_i7Vf4A1NQ","stars":5,"date":"2013-03-26","text":"I love this place. \n\nI will get the bad out of the way first... There isn't a good day to go where you won't have to wait in line for a good 15-20 minutes at least. But Saturday\/Sunday are definitely the worst - and don't even bother going on holidays. \n\nHowever, it's completely worth the wait. The food is amazing. Everything is fried in duck fat - which only after eating here did I realize how much better I felt after eating it. I love that I can stuff my face with this beautiful food and not feel like I drank a bucket of grease after. You leave feeling full, without having to fear the food baby you are carrying around all afternoon. \n\nMy favourite thing is the French Toast. I get it almost every single time I'm there. It's quite light. It's sweet - but not too sweet. It has a nice orangey zest to it, and served with warm maple syrup. Delicious.\n\nI could eat here every day. You get your money's worth completely.","useful":0,"funny":0,"cool":0},
{"review_id":"QxZbf0ZlIWD50COlS-Wyrg","user_id":"SL7flTbdIekoh9_1iHhxyA","business_id":"Lm6L1iLVooEfzViOxpp00Q","stars":3,"date":"2013-03-26","text":"Honestly, I'm quite the sugar tooth. So, though I rated this place a 3\/5 - there is a reason. \n\nI like to get the bad out of the way first. One particular visit last summer, I was selecting my usual 12 dollar assortment of candy, and there were about 7 or 8 wasps\/bees flyer around in the bins I was going through. \n\nI mentioned it, without freaking out obviously - because of course insects are attracted to sugar, but I just thought the staff didn't know. All they did was glare at me and say \"yeah it happens all the time\". UH WELL MAYBE DO SOMETHING TO MAKE IT NOT HAPPEN ALL THE TIME. I don't want no fricken wasp candy man, I'm scared of that shit!\n\nOtherwise - I love it here. It's not too crazy of a selection, but it's good as far as Calgary and even Canada go for unique sugar selection. A little expensive though for things that are widely available. I understand the mark up on things like vanilla coke\/other imported products. But I'm pretty sure I pay 0.73 cents for pop rocks and the Shell across the street. Rethink that one guys!\n\nAlso, the staff always look so miserable...","useful":1,"funny":1,"cool":0},
{"review_id":"nj1CZ2av4Cx4I3yXA3lwCw","user_id":"6J-wew58pMP_aR5ZIk0ZNw","business_id":"qK7UmGs6EgUB8K84p0SIDQ","stars":1,"date":"2017-11-14","text":"Don't waste your money or time. If you miss a visit, they will still charge you. She has new expensive tests she keeps coming up with and new ways to charge you. Truth is, I went back to my OBGyN and he gets me the same medication as she did.  Felt like I was scammed.","useful":0,"funny":0,"cool":0},
{"review_id":"IUOfr9d6Hau1Dstz-7W6yw","user_id":"6J-wew58pMP_aR5ZIk0ZNw","business_id":"1RtRziIlUQ905ghqfWALYw","stars":1,"date":"2015-09-05","text":"It's as if this company can't treat me badly enough. First they got the order wrong, Then they got the second order wrong that was supposed to correct it. I've spent numerous hours on the phone with customer service, been disconnected several times, and now they scheduled a delivery and never showed up. Worst customer service experience ever!","useful":2,"funny":1,"cool":1},
{"review_id":"_m9LLS8_xbAxBOYmEBUjcw","user_id":"6J-wew58pMP_aR5ZIk0ZNw","business_id":"qNYLt8zizn--wEpT1KILfw","stars":4,"date":"2014-03-24","text":"This place serves some of the best breakfast in Las Vegas and our server Candace was amazing as usual--fast, helpful and good attitude.","useful":0,"funny":0,"cool":0},
{"review_id":"zW8pBqdnMGoXRtbQ3US9yA","user_id":"DDSpcEmwjUd12NxVlw5p4g","business_id":"pvPAE1Vjeo6_XbnflGo9xw","stars":1,"date":"2012-12-19","text":"One of the worst customer services experiences ever. Not only was the woman rude to me but she charged my credit card twice for the same poor service. Anywhere is better than here","useful":2,"funny":1,"cool":0},
{"review_id":"EmN-7r8We4oTe8KM-FGQHw","user_id":"hzkmJrNK8bBUmXkPXV8Fkw","business_id":"x3KmMr1qSFaxUZ24K-YpbQ","stars":4,"date":"2016-07-27","text":"This place is really one of the few I would splurge on for a lunch this summer! The service was very fast and friendly and I felt welcomed when coming here alone for lunch. I ordered the Citrus Asian Salad and paired it with the Italian Sandwich and it cured my coffee shakes! I also ordered a lemonade and a freshly baked cookie, and I honestly never splurge like this on a lonely lunch. Great ambiance whether you want to sit outside or inside :)","useful":0,"funny":0,"cool":0},
{"review_id":"n_4hrM4B9MlnzNj_QgpYfA","user_id":"q6lDjsWakVROjMxVIc0ZfA","business_id":"RStEBQAR_k4Xb5KbplQQ_A","stars":1,"date":"2017-09-17","text":"My first time coming to this nail salon since we just moved to the area from a couple miles away.  I requested a gel manicure and spa pedicure with callous remover. I was very disappointed with my experience. I was there for over 2 hours. My manicurist didn't dry my feet or legs before putting lotion on and didn't provide the full service. The lady next to me had got stones and a nice leg massage... needless to say I did not revive that and my callous is still very visible. My manicure was a complete disaster. My nails were not fully painted and the manager just told me to come back whenever I want to get it fixed. He didn't bother to really take a look or apologize. I will not be refunding. I should have known it was not going to be a great experience when I walked in and there're was only one customer. Usually Saturday's at my original salon are packed. I do not recommend.","useful":3,"funny":1,"cool":0},
{"review_id":"hWGz_BvHm7y-5C8Xk_cGPg","user_id":"uhnM9xSAlh_G87HYyJSgVw","business_id":"wbghhhmnre5U1_qQHm33Cg","stars":5,"date":"2016-04-04","text":"We can't thank both Willie and Lisa for everything they have done for our rescue dog Chance. They went above and beyond making sure he was completely ready before sending him home after the board and train program. I truly enjoy taking him in the car and for walks now. This is what having a pet is all about. I feel so fortunate to have found Willie and Lisa and will forever be thankful! It's honestly worth every penny to invest in training your dog properly. They love what they do and it shows. Thank you again Off Leash K9! Keep up the amazing work! \nRonnie, Parisa & Chance","useful":1,"funny":0,"cool":0},
{"review_id":"2RBZjO4aSKlOHg8j1SZSCg","user_id":"uhnM9xSAlh_G87HYyJSgVw","business_id":"3JgHBYltzNEHwpA6h9ekTg","stars":5,"date":"2015-06-29","text":"Wonderful service! Chloe is very attentive and creative. Everyone is very friendly and welcoming.","useful":0,"funny":0,"cool":0},
{"review_id":"VCqQl7786gh6brLeuAI6DA","user_id":"uhnM9xSAlh_G87HYyJSgVw","business_id":"wcYcF_C7GTm6Q888V7ePDg","stars":5,"date":"2015-07-25","text":"Hannah listens to what look you are trying to achieve with your extensions. They last as well. Great service and she takes her time with you.","useful":0,"funny":0,"cool":0},
{"review_id":"m1v1-DbFLQo-gb1HjHkZqQ","user_id":"P7Nr7xHCo1iOiVNOWs5MVw","business_id":"Ir4zL3MF7LX7b46qXn5WWQ","stars":1,"date":"2015-03-19","text":"Very bad service. They have machines to spray water but don't know how to dry it. When you go back home, you will find ugly dried water traces that ruin the whole purpose of cleaning.\n\nVery bad customer handling and ignorance.","useful":7,"funny":10,"cool":0},
{"review_id":"nMmZt-m-l9Hml-MVoX4tXw","user_id":"ZS60rrKqtI63UX_nW_gqUQ","business_id":"usCGyfoTxOYOqygtI9orUA","stars":3,"date":"2016-06-26","text":"Love that they are keeping Leenas going.  Oakland misses it.  Got a gyro platter and it was great.  Two pitas, gyro and fries mixed, salad, and tahini.  Fantastic.","useful":0,"funny":0,"cool":1},
{"review_id":"nsB9JAeghk0zOaSulSm9Yw","user_id":"jEjc8HxeCeI22M4di0Y1aw","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":5,"date":"2016-05-22","text":"This place is truly a secret!  Its so hidden that there are no signs in the directory of the restaurant itself except for the line of people waiting to enjoy a slice of the best pizza they ever had.  It is thin crust pizza, crispy crust and delicious toppings!  If you can go for lunch there is less of a line.\nTheir pepperoni was nice and oily just the way i like it","useful":0,"funny":0,"cool":0},
{"review_id":"KWunEPdd749Gr5m6uBDloA","user_id":"jEjc8HxeCeI22M4di0Y1aw","business_id":"na4Th5DrNauOv-c43QQFvA","stars":4,"date":"2016-05-22","text":"I wouldnt call this a 5 star hotel, it is definitely nicer than the lower end hotels like the Linq.  But its a HUGE hotel, rather noisy because we can hear our neighbors phone conversation.  Its a standard nice, but nothing really wow'd me about the hotel itself.  I do like how it doesnt smell like cigarette smoke like other hotels.","useful":0,"funny":0,"cool":0},
{"review_id":"j2aePU5WeWUJsoiTWiz3Yg","user_id":"jEjc8HxeCeI22M4di0Y1aw","business_id":"BH9z7IJ4zydAqgwsbqoVZQ","stars":4,"date":"2016-05-22","text":"A very entertaining show.  Pretty pricey compared to a few other shows available.  I was surprised that the show lasted 90 minutes, you really get your money's worth.  Some incredible acts.","useful":0,"funny":0,"cool":0},
{"review_id":"jfMYvMekifozuGK6vTLRsA","user_id":"FJ0FIrj5rUdOnR2TRP6rUw","business_id":"tTzQZTrwBgwxMch77nCJfQ","stars":2,"date":"2017-04-16","text":"Was craving a salad and came here because of the great reviews. Shared a salad and crepe with a friend -- salad was ok. Lots of ingredients but somehow they didn't go together very well, not flavorful. Crepe was pretty tasteless. Place is very cute but food and service not that great.","useful":0,"funny":0,"cool":0},
{"review_id":"cQC9IVrxZ2UwgBtR7NOopA","user_id":"FJ0FIrj5rUdOnR2TRP6rUw","business_id":"m2hz26KM3kLN_AS5CcEjPg","stars":2,"date":"2017-04-16","text":"Not the place to go for a nice dinner. Cocktails were pretty good ( st Germain recommended, the pineapple one not so much). The food was not the best. One vegetable dish we ordered was delicious, the fries were underwhelming, and the meat was overpriced and not that good. I'd recommend this place for drinks but not food. Also bf and I were having stomach problems the next day, dunno if related ...","useful":0,"funny":0,"cool":0},
{"review_id":"si5_JDMSISpxSvr4Ck0fXQ","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"C8pQz67ragXUlee19tCivA","stars":3,"date":"2016-10-04","text":"I'm giving three stars mostly because I'm a big fan of Starbucks drinks, but this experience is certainly not the best. I wanted to order a latte macchiato, and I don't think the lady at the cashier knew they even have this drink at first. She first put cafe latte on the machine, and I saw it and corrected it. Then I was trying to personalize my drink a bit with less ice and almond milk. After I finished my request, the lady asked me again whether I was ordering a caramel macchiato. I corrected her again that I wanted a latte macchiato. Okay, then it finally showed the right drink on the cashier. I thought this was the end of the story but NO. The guy who was making my drink held a manual with his left hand the entire time while he was making my drink with only his right hand. I even saw him made a mistake at first and started over for my drink. Finally, I got my drink, but the taste was not good as it should taste since I had the same drink several times from another Starbucks store at CU. I understand this is a new Starbucks store, and they are obviously new hires who need a lot of practice. But they clearly need more training before serving real customers. How can employees not even remember the drinks on the menu (I'm definitely not ordering a very wired customized drink)? I hope the manager can pay more attention to the training standards of the employees.","useful":0,"funny":0,"cool":0},
{"review_id":"ZAG0mHSVp7rzE3MTJYiAZg","user_id":"fT5JZrpDTc4_j9MW5h6jPQ","business_id":"w2xwgqHM7dJlHfyu4ouhBg","stars":5,"date":"2016-10-17","text":"Love this place! To be honest, usually pizza is not among the top options when I eat out with friends, but I'm glad we went to this place. Customized pizza, OMG, never thought about we could do this at CU, particularly after so many times of those regular pizzas. Also, I in general prefer thin crust, so this place is perfect for me. The only small problem I have with this place is because they have the oven out, so I think there was a bit of smoke, esp during the rush hour, which made my eyes somehow uncomfortable after seating inside for a while. So I may think about taking out next time.","useful":0,"funny":0,"cool":0}]