[{"review_id":"wGAhroeCxvWkdrJoUqWhyA","user_id":"N6sfO7TuhizgfrbUzWi_GA","business_id":"lAFsdMYRksUqlhM4_8vRuA","stars":5,"date":"2014-04-10","text":"Love Dennis. He is experienced and gives a great cut every time. Free bang trims. Was skeptical bc everyone gave 5 stars but it's legit.","useful":0,"funny":0,"cool":0},
{"review_id":"wKIEXEBfxPPBmeo8msWOiQ","user_id":"AsulwzgMGFotfyUiIjdqgw","business_id":"RqguZhXHTpBD2_SEAdzO_w","stars":5,"date":"2016-01-14","text":"Much better than I expected for $36. I arrived around 11:30 PM and it included a solid full body massage and in addition to the foot massage I went in for.","useful":0,"funny":0,"cool":0},
{"review_id":"iM79XyJlzgdhk7QyLqXk3Q","user_id":"AsulwzgMGFotfyUiIjdqgw","business_id":"hihud--QRriCYZw1zZvW4g","stars":5,"date":"2016-04-28","text":"I really enjoyed my time at gangnam bbq,they have a great happy hour special that I recommend to my friends.","useful":0,"funny":0,"cool":0},
{"review_id":"ddxVccx4hq4IpmEf-Cdy5Q","user_id":"AsulwzgMGFotfyUiIjdqgw","business_id":"WUz36C42pEljqIJuy7dvIg","stars":1,"date":"2013-09-02","text":"Definitely the worst vape shop I have ever been to, possibly one of the worst shops I have ever been to as well. I recently purchased a new cartomizer and needed some liquid for the e-cigarette. I brought in my coils and was hoping to find a suitable replacement but they didn't have the selection, and was being helped whom I believe the manager, one guy with a sleeveless shirt, and an older man who could not find the appropriate cartomizer, so far so good. They did not have the cartomizer I was looking for so I purchased one with non-replaceable coils. After which, the manager left and then tried to use the liquid I purchased with the cartomizer to test out the cartomizer . The cartomizer leaked some liquid on the glass counter top and the sleeveless shirt guy started insulting me that I must live with my mother because of the leaking cartomizer. I didnt really bother to answer him because he appeared to be tweaking and frankly I didnt really feel like talking about my income with him because he probably would not have understood. Anyways, the product was defective and I wanted to exchange it for a functioning cartomizer at which case he said all sales are final and I should buy another one.I dont think that is going to happen.\n\n\n------------\n\nMessage that I received from the owner:\n\nI am writing to let you know that I will be posting the video of you in my shop to show the truth.  We tried to make you happy for about 30 minutes.  We had three people helping you including the older man was hearing impaired and disabled.  He's not even an employee.  He was just trying to help.  Also at the 15:51 mark you deliberately dump the e-juice on the counter as you look back at my employee can see you.  I recommend you put up a true review or I will post the video here and on youtube.  Have a nice day.  From the owner who was there in the red shirt.  If you want to talk to me or my manager Billy at 702-227-3021.\n\n\n------------------------------\n\nMy final update:\n\n\nI didnt have a problem with the older man and he seemed like he wanted to be helpful and bare no grudge against him for not understanding the nuances of e cigarette technology. Apparently, you are the problem because your service is bad and so are your hiring decisions, so I would urge you to go to Vape Square 4001 S Decatur Blvd Suite 27 to learn how to effectively compete as a business. I dont live in Las Vegas, but I felt compelled to write a review because I hate bad businesses that don't honor their word,sell defective products and hide behind \"all sales final.\" I'm done with this place and this review.","useful":1,"funny":2,"cool":0},
{"review_id":"YZO4km573ZUP33m1rnOdAg","user_id":"AsulwzgMGFotfyUiIjdqgw","business_id":"cCgNSYqTz255xMomh_jCnw","stars":5,"date":"2016-04-03","text":"Elizabeth did a great job with my hair, and the gf liked it too.","useful":0,"funny":0,"cool":0},
{"review_id":"CeKEI5ONbys89vpFY288XA","user_id":"YsoLU_o3j6lo1mF9IcuOGQ","business_id":"pGLI8cMlay44bxYYjb4yIQ","stars":2,"date":"2017-12-29","text":"Although the Japanese Friendship Garden is very beautiful and serene, i am disappointed in the ironic unfriendliness that my family and i were treated with. I suggested that we come here, bc i wanted to show my cousin who was visiting from out of town the few spots in Phoenix that promote diversity and culture appreciation. The first surprise was that there was a fee to enter the park; i would think that such a small public area would be free entry. You can not spend more than 10 minutes walking around this garden so i think charging $7 per person is ridiculous. Secondly, my family had brought a picnic and our dog to enjoy lunch at the garden (before leaving we called to ask if dogs were allowed, and we got no response). However, upon entering we were greeted with the sign that says no dogs or food. This is an outdoor space, why can't dogs be there as well?? Anyways, our visit was cut short because we were told that our dog was not allowed in the garden. All-in-all, i will not be returning to this institution.","useful":0,"funny":0,"cool":0},
{"review_id":"pdXG7f9IoMXoGyJpymJ5ww","user_id":"T7lw2fGtuUkhjEXbKlZP4Q","business_id":"P1IGEXgZNkTt3hxsY2fU9g","stars":5,"date":"2015-12-14","text":"The best shop for electronics repair!! Had a cracked screen on my iPhone 6 and had it repaired here in no time! The owner has been in doing this business for a long time so he knows what he's doing! Definitely recommend this shop to anyone !","useful":0,"funny":0,"cool":0},
{"review_id":"qkCIMSO4V_eYGyiAc5bMnQ","user_id":"7oQTDUAkB_3sfq9mxZ5-xQ","business_id":"siPgQHftKLiKP0Uyd0phSA","stars":1,"date":"2014-01-16","text":"I ordered a pair of shoes online in the same size, make and model as my current shoes but when they arrived they were actually an inch longer, a size bigger and didn't fit. \n\nI drove all the way to the store to inquire about exchanging them for a smaller size, or even another pair of the same size, assuming they'd been mislabelled. The owner\/manager refused to listen to my request. He repeated rudely that there were no exchanges or refunds-- no exceptions. When I asked other employees if there was anything I could do they gave me a look like they'd like to speak up but didn't want to risk the wrath of the boss. \n\nI called Asics and they immediately offered to ship me another pair, admitting that mislabelling shoes can and does occur. \n\nI went out of my way to support Brown's when I could have ordered the same shoes for the same price on Amazon. I believe in small businesses. But I will never go back to this store and will make certain to tell all my cycling\/running friends to take their business elsewhere. The owner has less concern for his customers than any business owner I've ever encountered in any part of the world.","useful":1,"funny":0,"cool":0},
{"review_id":"0JFrELrgquY4CvcDsfLGMQ","user_id":"7oQTDUAkB_3sfq9mxZ5-xQ","business_id":"dqKm_dW9srG26tgPCgVbzg","stars":1,"date":"2012-09-24","text":"The single worst hair experience I've ever had. \n\nMartin, the owner, is smug, arrogant and untalented. My sympathies to the poor stylists who think they've been well trained.\n\nTake my advice and go anywhere else in the area before this place.","useful":0,"funny":2,"cool":0},
{"review_id":"9I9V1LJytEuBRCOg63oKNQ","user_id":"81tGj4OV-3JlQwkLXuKl4Q","business_id":"Mv7N0bU56dhtoDP-m2JOow","stars":4,"date":"2012-07-07","text":"Sonoma Grille is one of the better spots that I've dined at in Pittsburgh. I should start by saying that I have dined here about 5 times, but only at dinner. Overall, I really like the place, but there are a few refinements that they could take on that would make the place a little better. Overall, the atmosphere and service are pretty good. The atmosphere isn't on the casual side, but not too stuffy either. I have experienced the occasionally inconsistent service experience, though. I loved Emily, at the bar--great attitude and excellent service. \n\nThe restaurant offers an extensive wine list, with many by the glass, but their markup seemed little higher that many places. They also have a small selection (about 5) of microbrews on draft (with other selections in the bottle) that are appealing--not extensive in that regard, but enough to keep a craft beer drinker from going thirsty. \n\nOverall, I'd say the food is pretty good. Certainly a cut above, but not top of the line. One of the things that the restaurant boasts is that it uses local and sustainable growers and suppliers for its ingredients. A definite plus in my book. In everything that I have had here, the ingredients were definitely fresh and flavorful. \n\nI have had a few different items here and they have all been pretty good. My first time in I had the filet mignon, which was very good--mashed potatoes were great with that as well. I have also had the chicken and the salmon here, and all were pretty good. My one complaint about the food would be that they tend to overcook the meats a little--med-rare steak comes out more like medium; well-done does not need to mean cooked dry; that sort of thing. The service staff and management always strove to make it right, though, which is something you don't always find anymore. I have also had the stirfried vegetables on their mixed grill plate several times and they have always come out great--not too firm or too soft with great fresh flavor. \n\nDespite its few inconsistancies, overall Sonoma Grille offers a pretty solid dining experience. I definitely recommend a pop-in if you are travelling through Pittsburgh and are looking for a a pretty good bite paired with a great wine.","useful":0,"funny":0,"cool":0},
{"review_id":"qL0znKsT0m1TNPzNJP0O7w","user_id":"81tGj4OV-3JlQwkLXuKl4Q","business_id":"w_UCGMgok7N9p0XdYBx1VQ","stars":2,"date":"2012-07-07","text":"Primanti Brothers is definitely a Pittsburgh institution. If you are traveling through, you definitely have stop here, at least for the novelty factor. Overall, food is good for a... well, for a sandwich shop... But in the end, I didn't leave with a sense that I really had to come back. \n\nThe real novelty at Primanti Brothers is that all of there sandwiches include french fries and cole slaw inside that sandwich. And to that I say... \"who cares\".  I personally didn't care for the fries and slaw inside my sandwich, but I am also not a huge french fry or cole slaw fan. (I like the good ones, but I can easily pass on average,) I will say that their cole slaw, which was vinegar rather than mayonnaise based, was quite good. And there fries were above average, but not as good as somewhere like say, Five Guys. \n\nThe ingredients in the sandwich were all pretty good. I had the Pastrami and my friend had the Angus steak. The bread, meat, cheese, etc., were all good quality and were distinct when tasted individually. The sandwiches also seemed to work OK as a package, but for some reason for me--aside from the novelty factor--they didn't stand out. I think that maybe with the fries and slaw in there, there is just too much going on and those two tend to dominate the whole sandwich. It really takes over and you hardly taste the quality of the other ingredients. \n\nOn the plus side, the sandwiches average about $7 each, and for that price, your get a pretty decent sandwich. In the end, Primanti Brothers is a definite must try if you are passing through, but I don't see myself craving these babies any time soon.","useful":2,"funny":0,"cool":0},
{"review_id":"bwHDD26B7IF7eruEVWxopg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"aQUo8irLBywAZN26ln_Q1w","stars":5,"date":"2014-01-18","text":"I am not a vegan or a health food guru I am however a foodie and when I am enticed to try a new venue I answer the challenge!\n\nWildLV is not pretentious by any means. It has a feel like I'm a little different then your normal restaurant and your going to like eating here\n\nIt was lunch time and the place was busy (good sign) I got seated at what I call the chefs counter. I was reading over the menu and my waiter who was obviously the only one taking orders was very busy  Here is where the magic began \n\nA voice across the glass separating the counter from the kitchen asks me What looks good to you? I said to the chef Tatiana what do you recommend?\n\nShe asked if I liked spicy\"love it\" and suggested  The spicy red pepper prosciutto pizza .It was great and healthy and it really was pretty big for an individual pizza. She asked me If I like carrot cake I said kinda She told me I would love hers.. I did. It was possible the freshest tasting carrot cake I ever tasted.\n\nThe menu is really diverse and caters to all tastes \nIts also in a hip location The ground floor of the Ogden ..Check it out!  \n\nSay HI to Elyse the manager she's very personable and cares a great deal if the customers are having a great experience","useful":0,"funny":0,"cool":1},
{"review_id":"wFHoZvee51NFBCcbM0Ca1w","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"OPSNdO3LNPMt7qz1MNb42g","stars":4,"date":"2016-03-14","text":"Very Fresh and  Perfect levels of Curry  The Nan Bread hot and fresh. Carlos our server always had our plates cleared and beverages refilled. Great lunch buffet","useful":0,"funny":0,"cool":2},
{"review_id":"BJKGJltummoC6b8zT-sBlg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"Z5eukYH32_nFljOTC2DJ0g","stars":5,"date":"2011-05-11","text":"Love this kind of pizza I forget how good it is until I remember when I have that first slice again. The crust is very NYC and adding the special touch of baking it in a coal burning oven really adds to the flavor.\n\nI like my pizza topping simple pepperoni and sausage and they use very special pepperoni not the cheap kind and the mozzarella they use is very creamy not stringy. \n\nIf you like a lot of stuff on your pie this may not be your kind of pizza but if you like great NYC style pizza without the grease then give this place a try","useful":1,"funny":0,"cool":0},
{"review_id":"o7GZgcvA0teAFWkwCJl6kg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"rS3KdecMS-EF4H3VtmkxBw","stars":3,"date":"2015-11-15","text":"Good food. Delivery was right on time. Food was hot and the baked ziti had a really nice crust on the cheese ! \n\nWill order again I also loved they put extra honey mustard dressing I requested online and didn't charge me for it!","useful":0,"funny":0,"cool":1},
{"review_id":"tdYKamPj7TWau2XuVrJX6g","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"6ifzvhFI3Lgv3CNeHV2hsA","stars":5,"date":"2016-10-24","text":"One of my best stays in a hotel ! Great breakfast Great beds! quite rooms  and very clean!\n\n  The best part was the evening front desk agent Bennie! You can tell this guy really loves what he does and was such a joy to talk you could tell he wanted to make for sure the guests at this hotel were happy ! You don't find that in smaller venues  He was great. If I ever come back to Phoenix I will stay at this location .. Give Bennie a raise !","useful":0,"funny":0,"cool":0},
{"review_id":"XFtT8F80atF2xpHBjDJAKQ","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"_tdW1CRiHJKJf-nWn7j0eA","stars":4,"date":"2015-02-14","text":"I was having a mardi gras party  in my home on Sunday and realized I didn't have anytime to really do a deep cleaning on the home. I was a bit leary as this was short notice and read a few reviews but I decided on pristine simply because they could take care of me short notice.\n\nI now will use them because they exceeded my expectations  My house never looked better. Everything shines and looks clean. I dont like chemical smells like pine sol or bleach so that was an added plus when I didnt smell those\n\nThanks for getting me in on short notice and next time I will be using your company again","useful":6,"funny":0,"cool":0},
{"review_id":"TwYbKtxOe0NM0hPxB4B_eg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"lIDgEB1HnKAq03H1fpjzLQ","stars":4,"date":"2016-08-04","text":"My fav place for 2 reasons \n\n1 Butter Brew!\n2 Luke!  one of the nicest baristas I have encountered","useful":0,"funny":0,"cool":0},
{"review_id":"M0pBjpnGIuD6oyHC4DOqcA","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"IQWL4BxXwD-HJ7CMLzbHCQ","stars":5,"date":"2013-12-17","text":"I have been taking  my animals to this clinic for quite a few years  My pets have seen all the vets on staff at one time or another. Dr Michelle  is my vet of choice She truly has the compassion and the persistence to look for the ailments that effects my pets.\n\nJackie and the rest of the staff are outstanding  They have seen me and my pets go through some rough times and are a constant reliable source for care for my kids \n\nI encourage everyone who has pets to please invest in pet insurance  Trupanion has saved me thousands .Its not cheap but when you are faced with an expensive procedure and your only option to save your pet is to have a life saving surgery \n\nYou can't put a price tag on your pet or the peace of mind Pet Insurance will give you\n\nWarm Springs Animal Hospital The best in Las Vegas!","useful":3,"funny":0,"cool":1},
{"review_id":"GCaU3BJLTE442DlCriJo5Q","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"aqwn3jdQLCWnb59gHK4nAw","stars":5,"date":"2012-04-17","text":"Forget all the chains ,Forget the Bars, Forget Canes They can't compare to the chicken shack.They have a top quality product and they deliver the goods every single time.\n\nYou have read the reviews and they are all true. If you order 5 fingers and fries you better be hungry there is nothing frozen here and the quality of the chicken is amazing!\n\nThe fries are like shoestring fries seasoned lightly and you get a big portion of them with your combo.\n\nThe wings are just as large I ordered the 3 fingers and 3wings a great way to try them both.\n\nBetter choices of types of sauce too but the best way is plain with sauce on the side\n\nCome Hungry and Enjoy!","useful":0,"funny":0,"cool":0},
{"review_id":"z3xph58ok_Ox67jnxNHsOg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"S1Gpj_cqlEzitBCGAXj5aA","stars":1,"date":"2015-03-22","text":"When we pulled up to this place for our 5 pm reservation I thought maybe it went out of business. There were a group of  5 guys smoking in front of a door that perhaps at one time was an entrance.Then there was another door where dresses and clothing was being  taken out of the building by the droves. I walked in through that door  and waited to be seated in side the resturant   The TV was blareing and after waiting 5 minnutes we finnaly were seated in an empty resturant with the exception of a large group of men sitting in a corner table staring at us.. There were dirty tables that had not be bussed and when the waiter came over with water to pour inside a dirty glass I stoped him and said..Thanks but No Thanks we are leaving..He asked if the prices are too high I replied I didnt even bother to look at the menu sorry and got up and left.y","useful":0,"funny":1,"cool":2},
{"review_id":"tkQ472INeKu_GaoWrmlA4w","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"U00_w-9WRddd5R_RGdzA0A","stars":5,"date":"2017-07-02","text":"Really good pizza  The deep dish reminds me of Round Table  I ordered the  chicken alfredo pizza  A medium will feed 2 very well  Hope this place sticks around !","useful":0,"funny":0,"cool":0},
{"review_id":"MgvKf87194eqYzLvkynQLQ","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"kbTAyySlUZrTAr0nJOjiUw","stars":1,"date":"2012-04-13","text":"Ugg! We ate here these evening  only because We had a coupon Warning Sign 1 6pm and not busy The chips were good ,the salsa ok and they gave us bean dip. \n\nThey are way over priced 13.99 for a SMALL chicken enchilada and a soggy taco Nothing had any flavor,Warning Sign 2  The waiter never came back to ask us about the food. My partner had the same thing and when the bill came it was almost25.00 with the coupon!\n\nThe worst was we had to wait 15 minutes for the bill and the waiter never came back to charge my card This is a neighborhood bar and restaurant and they must have a great happy hour cause it ain't the food or the service\n\nWon't be back!","useful":3,"funny":0,"cool":1},
{"review_id":"WxPRP6BXlDeokANbqFi4Ng","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"UV2Jt8slktGu14gLZeNCjA","stars":5,"date":"2015-03-15","text":"This place really does it right Clean,Friendly and Awesome Food!  We got the vegetarian platter for 2 and it was awesome!  We walked out of another Indian Restaurant that was voted best in Las Vegas 2004! So glad we found this place for our first Indian Cuisine experience","useful":0,"funny":0,"cool":0},
{"review_id":"BKPTLoTBvnomOlBhwL_zkw","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"OTcBXjDkViDPds4Lxy8KIQ","stars":4,"date":"2011-02-15","text":"Wanted something different  and I got it  not your everyday run of the mill burrito I ordered the double meat  pork verde burrito and it was spiced right and I didn't want to stop eating it! Full of flavor and a little sweat to go with it. I ordered rice and beans and the rice was interesting it had carrots in it.The refried beans were not runny and had a good flavor\n\nMake a run to this boarder!","useful":0,"funny":0,"cool":0},
{"review_id":"lDUX-J0kplKbk8thr__nWg","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"Qb4sJ4ssSX1clY2wEAOmsA","stars":5,"date":"2011-02-16","text":"I'm a regular at TJ The tasting table is the best I baked like a pastry chef from one of their recommendations this evening. Get the crescent rolls roll them out add 4-8  of there semi sweet chocolate chips roll them and bake for 13 mins. Top with their amazing  peanut butter cream cheese and call 911 cause you can't eat just one!\n\nThe staff is truly amazing and always goes out of their way to help .The pre made food is really good,Chicken Lasagna ,Turkey Meat Balls,and Panko breaded Tilapia  are always in my freezer.\n\nDon't forget the sweet tooth JoJos Ice Cream and these wicked peanut butter goodies will pick ya right up\n\nDollar for Dollar you can't go wrong and if anything I save more money shopping there then any place else\n\nGreen Valley location is the best of them all!","useful":1,"funny":2,"cool":1},
{"review_id":"DDz7JdPOicJ5kriNGWA3NQ","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"L877pDtfa3FyN0fcNeCdlA","stars":3,"date":"2011-05-11","text":"It's ok for a burger place I'm not overly fond of eating out of a brown bag.it's way to loud and between the loud music and the yelling it makes for eating with someone difficult .The burger it's self was good but Smash Burger is by far a better burger and dining experience","useful":0,"funny":0,"cool":0},
{"review_id":"xw5ykM5N4h9lhhmcPPaCkw","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"c_VcdG84KcGRRQ23x-EpPA","stars":4,"date":"2011-08-06","text":"One day a co worker came into my office and asked if I wanted half of his sandwich.I asked him what it was he said egg salad with a kick . For the record I am a bit of a snob when it comes to sandwich salads and egg salad is one I am most critical of! I was hungry so I took it \n\nThat was six months ago and the beginning of my love affair with the Hells Kitchen. Spicy Meets Creamy with avacado to balance the flavors out with a crispy bacon crunch  to stimulate the palate. Have it on Marble Rye made fresh daily and you have a unique sandwich experience \n\nFor 5 bucks you get a made fresh sandwich your choice of sides ,pickle home baked cookie and a drink!\n\nThanks Hedi for adding 5 lbs for 5 bucks!","useful":0,"funny":1,"cool":0},
{"review_id":"HFb7SLfkTLr4ZowRREPi5w","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"1Df5WnLX3DqN6ymlhqznaQ","stars":5,"date":"2015-07-02","text":"Roy's is Ohana with some pretty fancy plating! The food is light and flavorful but the service is outstanding!  My husband and I were celebrating our 12 year anniversary of meeting and he gave me a card at the table.\n\nOur server Todd noticed the card and asked if we were celebrating so I told him \n\nAt dessert He brings out this pineapple upside down cake and written in Carmel sauce was Happy 12th anniversary and took our picture and made a copy and put it in a nice frame...Now That's service with Ohana!\n\nMahalo Roy's and Todd for a memorable evening!","useful":0,"funny":0,"cool":0},
{"review_id":"g6salPqYfJllkLgBsVJt-w","user_id":"Q8uTqwmv2XA2ojDyE9uNXw","business_id":"4k3RlMAMd46DZ_JyZU0lMg","stars":5,"date":"2013-09-25","text":"Tasted like Tokyo To Me !Really Really good Ramen! Get the Spicy Soyu! So much flavor and a very nice burn","useful":0,"funny":0,"cool":0},
{"review_id":"AeExVXP_7C0ppsGt3q8kpw","user_id":"0qjURfaw6l4ZH50sh2LsZw","business_id":"OFnDWBP8iXxgeBrfHA5fRA","stars":2,"date":"2012-05-19","text":"Stayed here for the first time and wasn't very impressed.  The room was small and the first night we had lukewarm water even if we turned it up until it was supposed to be hot.  The next morning there was no hot water - only cold.  The walls are very thin as I could hear everything going on in the room next to us.  The only good thing about the room was the new carpet.","useful":0,"funny":0,"cool":0},
{"review_id":"4ixj8rrBurs9ampTII4DiA","user_id":"0VMuCPgwZliInxGWfJnxKQ","business_id":"6KtYYZ4ARIVa2Zj2tOcp9g","stars":5,"date":"2016-10-29","text":"My favorite cocktail lounge in Vegas, great drinks and atmosphere also he best bar nuts ( complimentary) with drinks","useful":0,"funny":0,"cool":1},
{"review_id":"vuT0TrogEIy_JwMKjS5wSQ","user_id":"0VMuCPgwZliInxGWfJnxKQ","business_id":"rbcfYmJtqwIkk17IeOI5Kw","stars":5,"date":"2017-11-10","text":"As expected from a fine dining establishment everything was amazing - the Mac and cheese is a must try","useful":0,"funny":0,"cool":0},
{"review_id":"OlzxmjQA8hfRK6lOy1ht7Q","user_id":"hQLvWQ5fUeVWrZb3WoXFJg","business_id":"UK6lqzQCyIRkjotcvS8_dQ","stars":5,"date":"2016-03-04","text":"Joel is an independent agent representing many companies. His loyalty is to the client not to a company or a product.  I love his professionalism and knowledge.  He shopped many companies for me.  I highly recommend him.","useful":2,"funny":0,"cool":0},
{"review_id":"kGgGjuHdlKYsoU2br3CsRw","user_id":"lX9kQZgTHYf9Er8g_hVxQQ","business_id":"JLWd6yDyt9oEp70_4KqYeg","stars":3,"date":"2013-11-20","text":"I have to say that I have been impressed with the freshness of the breakfast food and the tasty coffee.  Their bacon is perfectly cooked, the toast and homemade jellies are awesome.\nBut, something keeps me from becoming a regular.  Maybe it's the prices? A little high for the type of place.  Part of the problem is the decor.  I don't understand the theme.  Industrial bare concrete floor, matched with fake brick half walls, and patio furniture.  Huh?","useful":0,"funny":0,"cool":0},
{"review_id":"ZEYWqdAeXmVTWvfGoBFszQ","user_id":"lX9kQZgTHYf9Er8g_hVxQQ","business_id":"Arox2o0zyinAFrsE_HDtHg","stars":3,"date":"2013-06-13","text":"I think the reason for the low ratings is because, like all LA Fitness clubs, the focus is on sales.\nThe facilities are fantastic: amazing number of cardio machines, awesome free weights area, plenty of room in the aisles, excellent cycle class area!\nWhere they fail (big time) is customer service: \ntry to get someones attention at the counter-difficult\nreport a broken machine-will take weeks to get fixed\nAnd, omg, stay out of the way of the personal trainers!  They take over machines, stretching areas, racquetball courts to take care of their paying clients.  They leave machines covered in sweat and leave equipment laying around instead of putting it back.\nThe top insult came recently when they suddenly cordoned off the stretching area and kicked everyone out because it was going to be reserved only for their clients.  What?? I guess that would be ok if they had another stretching area that didn't look like an after thought of throwing down a small mat in a corner.\nThis gym could be excellent given the great space and amount of equipment.  But the poor customer service and sole focus on selling and maintaining personal training at the expensive of everyone else drags their rating down to a 2.5 or a 3.","useful":3,"funny":2,"cool":0},
{"review_id":"rfEmx0JMxJE8KgOOL20wow","user_id":"lX9kQZgTHYf9Er8g_hVxQQ","business_id":"utIA0LyQmwP-9DRyxUe6qQ","stars":3,"date":"2016-06-28","text":"The food is fresh and tasty.  I'm having second thoughts about whether it's worth the wait or not.  It's typically chaos by the door when trying to check in and the staff has no idea who is next.","useful":0,"funny":0,"cool":0},
{"review_id":"8R-JOpm51eeWa0g1x-AQOQ","user_id":"50DDbqPKZJ7hxHOxhUKNCg","business_id":"idVScFm7ER-RWwiitSlDRQ","stars":5,"date":"2015-05-21","text":"We usually stay at Holiday Inns when we travel and have no complaints for this one. \n\nVery clean, friendly front desk (Christine), and a good continental breakfast as usual. \n\nThanks Holiday Inn!","useful":0,"funny":0,"cool":0},
{"review_id":"HV_izNZgJFl8msgOBJwRMw","user_id":"50DDbqPKZJ7hxHOxhUKNCg","business_id":"tovUJgSCxi2JfUtP9eNQcA","stars":4,"date":"2015-05-21","text":"We were just traveling through town for the night and Yelped pizza reviews... And picked Barros.\n\nWe ordered delivery to our hotel and they arrived very quickly and our Meaty pizza was great. My only suggestion is order small. Our pizza was very doughy and filling-we couldn't finish it all!","useful":0,"funny":0,"cool":0},
{"review_id":"7PBbdDaOViu9MpUjM-DQwg","user_id":"vstECjRbLUETvVnEmIE4Rg","business_id":"FLxSHWJ2EWBQ5ghsDHfGPQ","stars":5,"date":"2014-07-09","text":"Every time I've gone to discount tire I've gotten really great customer service. But today especially just totally made my day. I got there at 6:15pm. didn't realize they closed at 6 because there still were people inside. Walked in and told the guy my tire pressure light was on.. I asked him when they close and he then informed me they already technically were closed. I told him a couple times I'd be happy to come back the next day but he insisted I stay and get it figured out. Turned out they stayed open over an hour after close to help me along with several others. He gave me my keys and told me they don't charge for patching up tires. I was blown away they would stay so late to help me when they're doing a service they aren't getting paid for (except tip). They may not want me shouting out to the world that they stay open late, but just saying- they really do have great service, and on top of that are always super friendly and attentive.","useful":0,"funny":0,"cool":0},
{"review_id":"2XtCqTRJ3H4TRfBxF5wSaw","user_id":"628jE8k7jYyUttEq803_7A","business_id":"rQWP8rhGBmYtETifD3tTig","stars":5,"date":"2016-08-07","text":"Wanted to do another laminate flooring project in the house we just moved to. Wanted to explore products other than than what Lowe's or Home Depot carry. Found exactly what we were looking for at a great price. Great service and technical assistance thru Justin was a bonus. Highly recommend them.","useful":4,"funny":1,"cool":1},
{"review_id":"qZCjT-mniVgjNku6JqWXXQ","user_id":"wdvMogqG3x2VfHiLfiRx8Q","business_id":"f9ERQpAPOAMv5Ay0kyD3Yw","stars":5,"date":"2013-09-04","text":"I come to this place often, the foods are really good. The only problem that I am having is that there is this skinny tall busboy or server always with a kind of a beanie on he is never friendly and when he deliver food to us he just kinda slam it on the table. The other night I was there and I heard he got into an argument with the owner as the owner was asking him to do something and he refused. He was yelling and being very rude. Overall I will definitely come back to dine in.","useful":0,"funny":0,"cool":0},
{"review_id":"Cf0lD_V8nPS24seEi6V0GA","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"EveFgxNoHkrs8ncSjkoINA","stars":2,"date":"2017-10-09","text":"We went back week later and food was good. Last time they charge for my 10 year old daughter $9.99. And following week they charge adult price. I don't think that is right thing to do. Never going back.","useful":1,"funny":0,"cool":0},
{"review_id":"fiL-cM32T7Z3990rLb48KQ","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"7vFTldKs-b-wS5J56PGGew","stars":4,"date":"2017-11-17","text":"We usually go there on week days taste everything is good but we went back on Weeknd. It's taste different it was so so.I guess go there on week days better.","useful":0,"funny":0,"cool":0},
{"review_id":"4k-vl092O04hOSCMDpIvrQ","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"rNqSjfRM09T-VOjRTAF66g","stars":5,"date":"2017-11-17","text":"I always get the dim sum to go. There food is good. And friendly service. Almost everything we get is pretty good and there pricing is great. Shu mai is yummy.","useful":0,"funny":0,"cool":0},
{"review_id":"Y4aBQQewB1gDU-oHEeQF1Q","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"PhMfnMldVKXo7HqHw6DSrg","stars":5,"date":"2017-10-30","text":"Best boba tea in Arizona. The workers are super friendly. We just moved from LA like a year ago. And we just love this place.","useful":0,"funny":0,"cool":0},
{"review_id":"yNJ9Z7ilu4RbuA5HTCzJwA","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"KXGkJy-s9W1re2sXqSqoiA","stars":3,"date":"2017-11-17","text":"I went there and I got 5 of there cakes. There cakes were so so. My wife didn't like it. Just stick with Arai bakery near by they have very good stuff.","useful":0,"funny":0,"cool":0},
{"review_id":"T9wxF9UBDcD0_xbcp4wLdQ","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"h1Dol2zEw3YtXmRMWfljyA","stars":3,"date":"2017-12-14","text":"The food was just ok. I lived in the Korean town in LA for long time I am very picky with my Korean food it just not too much of taste.","useful":0,"funny":0,"cool":0},
{"review_id":"2WQYftdx0SWNfjrcI1fDYg","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"taXKuFldSoerm9SXrckh_w","stars":5,"date":"2017-11-17","text":"They have very good food and one of my favorite place  to go. I love there crispy pan fried noodle the best..","useful":0,"funny":0,"cool":0},
{"review_id":"Mp9JtOXZJ80AJZ0_VU5dEg","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"qm7diuwiwwCWdL5V9s9hsA","stars":3,"date":"2017-11-17","text":"We went there couple weeks ago and the food was ok and workers was nice. But hot pot was not too good and everything was over priced. I don't think we will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"HwpmgAtmnj_mLZvt2vDHLA","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"H0nIjiZNBTIwrNf4_DwNLQ","stars":5,"date":"2017-12-12","text":"We just finished eating here with our friends and everything was great. The meat was good. Steam egg and Korean miso paste soup was good and service was very good. I think out of all the all you can eat places this is the best Korean BBQ place in Arizona.","useful":0,"funny":0,"cool":0},
{"review_id":"xV9-f_m3pacBTtQjFl6a_w","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"Cdywb13_07M1_g3U85VKTA","stars":1,"date":"2017-11-17","text":"The food was ok and waitress there was not too friendly. And when she served us we felt very uncomfortable. It's first time and last time.","useful":3,"funny":0,"cool":0},
{"review_id":"uXP40vyhI1aQkqPgFCMuLQ","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"tnvZOd2vNCLPQS1KEZxqog","stars":3,"date":"2017-10-10","text":"Shu mai and pork juicy dumplings. Was good but not the best. For the food you get it's over pricey. There's lots of places much better.","useful":0,"funny":0,"cool":0},
{"review_id":"MECeBySkXvoHkmfQ3iieIg","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"cPEo3-TmIqCwHLFGKZgwGg","stars":4,"date":"2017-11-17","text":"They have very good food. I like the pig ear and beef noodle soup. And We went to other locations in Tempe that one not so good. The Chandler locations are the best.","useful":0,"funny":0,"cool":0},
{"review_id":"IJSI9BWnNe8yzn3Eyd9uDw","user_id":"QQn9JYZkBBBESCnB2Y8keA","business_id":"mRazvR_U11rLacnSM6vDBw","stars":4,"date":"2017-12-08","text":"I was there on week day it was very good and good meat good service almost good as the one in Los Angeles. But I wish they have kids price because my 10 year old daughter don't eat that much they charge adult price. Over all it's good but if you have kids it's very hard to go. I don't think we'll be coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"ymiw4ciFfBNuJOSMwvB7NA","user_id":"kda0XIb4Ks1w8fHB540Gzg","business_id":"6EaMfMztDQq0yQUqXoYN7A","stars":5,"date":"2014-07-01","text":"This place is great. I always get my nails done here! Try usually have great discount too.","useful":0,"funny":0,"cool":0},
{"review_id":"Gykk1F7oBkwU60N6ZSuycw","user_id":"RAdlcJ09eFKZaZ_Nl2Po5A","business_id":"Ip5IQLwjFzmr_X03pNH7pg","stars":1,"date":"2016-07-27","text":"Arrived at 8:53 pm for dinner on Tuesday. Although closing time is 10pm we were turned away.","useful":1,"funny":0,"cool":0},
{"review_id":"XWYLh-DgyRMkZaUuyr2Gsg","user_id":"qPmDGQxuCiZoDONVC44fDA","business_id":"qn6fPEI5nhHJOqazA6WUbw","stars":5,"date":"2015-01-08","text":"I was very selective in choosing the pre-school our daughter would be attending.  After many interviews with a number of pre-schools, I was immediately comfortable and impressed with Westbrook Montessori.  The educational program provided our daughter with a solid foundation, the warmth, and attentive, caring staff from the owner - teachers - assistances was evident.  Thank you to all staff at WBM for not only helping my daughter adjust to a new experience but providing me with the comfort in knowing she was in a safe, fun environment.  I would recommend WBM without hesitation!","useful":0,"funny":0,"cool":0},
{"review_id":"JL7Zrk4BLHn7VHlwRyvMkA","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"6u-x45q0ETB7SQTAAuKSHw","stars":5,"date":"2016-07-11","text":"Great \"vegetarian plate\". If I want Greek food, I always go there. \n\nFriendly service, lots of seating, outdoor patio.","useful":0,"funny":0,"cool":0},
{"review_id":"SCLJe3bfRY6ifRB4ng6QRQ","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"YlVgpTsLGrzZNJ039psmIA","stars":1,"date":"2014-01-23","text":"I've never had a bad red curry, until today. The flavour was gross, the appearance was blah and the vegetable selection was limited. The peanut sauce for the (bland) cold roll was too thick and lacked flavour.","useful":0,"funny":0,"cool":0},
{"review_id":"QCQDsuYjXE9lEAPXI0_RVg","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"9TyF1tZC-wqVMU2-tZGTiA","stars":5,"date":"2017-09-09","text":"Delicious pastries at a great price. Nice, simple patio too. Not sure what else to say!","useful":0,"funny":0,"cool":0},
{"review_id":"oEu_DLs2Eb5W4eed1WOt-g","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"cmdi74TvO7ASV9NBfMmkbg","stars":5,"date":"2013-11-03","text":"Delicious food. The chickpea curry is amazing. So is the vegetarian pizza. And the desserts are great too.","useful":0,"funny":0,"cool":0},
{"review_id":"oNZblEhraN9ricMWQsXHJw","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"ZAu2dg-4mwCy20biGgmV1A","stars":5,"date":"2016-07-11","text":"I would go back for the \"fish\" - very tasty. \n\nClean, nice space. No patio but big front window.","useful":0,"funny":0,"cool":0},
{"review_id":"qkvcyru_QIJSDci3jx3_hg","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"fWeCh-xYQxo8VSemQrqYDQ","stars":5,"date":"2017-09-09","text":"There was a problem with my order but they brought me a new one and didn't charge me. Sometimes mistakes are made but it's how the restaurant reacts that makes the difference. Tasty food too.","useful":0,"funny":0,"cool":0},
{"review_id":"IdEHjdMiCkHuHsBxrk32eQ","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"LXUZjAAMEBKszZLL2ORISg","stars":5,"date":"2014-01-23","text":"Great selection of fresh sandwiches. \n\nI bought a danish, thinking that it would just be bready like most are, however, it was incredible. It had the fluffiness and moistness of a delicious croissant. The creamy coleslaw is the best I've had at a restaurant.\n\nAlso, it offers an incredibly cozy environment and the staff are really nice. \n\nNot too expensive.","useful":0,"funny":0,"cool":0},
{"review_id":"RELUZQuIaebVumBaEMfOpw","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"FhgAHo-8--equM8w5UZ41Q","stars":5,"date":"2013-11-03","text":"Whenever I go to or pass through Montreal, I have to stop here for their BLT on chipati. Smoked coconut, lettuce, tomato and (vegan?) mayonnaise. It's incredible. My one regret the last time I was there (last Sunday), that I didn't buy a BLT to go.","useful":0,"funny":0,"cool":0},
{"review_id":"PkN-2WIe7YSzS7Q0kZt-Ag","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"NLaK58WvlNQdUunSIkt-jA","stars":5,"date":"2017-12-04","text":"I checked out Zav Coffee Shop today. Beautiful place. They had classical music playing which was a nice change from the normal hip coffee shop. They have Sloan tea, which is a nice brand. I would definitely go back.","useful":0,"funny":0,"cool":0},
{"review_id":"Tx0tDj6qaAwGkmY1CNpeEA","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"eQCYur0033RkZdh5VjbF8A","stars":5,"date":"2013-11-06","text":"My boyfriend and I went there last night with his father. My boyfriend and I are both vegetarian, and surprisingly, there were veggie options AND they were great! \n\nI had the mac and cheese. When I asked to have it without chicken, the server also asked if I wanted it made without chicken broth. My boyfriend had a fancy tofu dish that was delicious (although he wasn't full), and his dad had the jerk pizza, which he really enjoyed. \n\nThe prices are reasonable considering the quality of food that you get and the ambiance. \n\nThe desserts were great too. They have \"bite sized\" versions if you just want a little bit.","useful":0,"funny":0,"cool":0},
{"review_id":"SJS7HjEn1cna_h9Lj4gOUQ","user_id":"iYQB7Ds8m9jYTdmeeytqhw","business_id":"CboINhcX-R1PGNtESJwQPQ","stars":5,"date":"2016-07-11","text":"Delicious vegetarian roti! The best one that I've had in Toronto.","useful":0,"funny":0,"cool":0},
{"review_id":"YtajuJ6s9aE1sUDmFx7Nog","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"J3iWlSa27BmyvX2XwJt3Yw","stars":1,"date":"2015-10-30","text":"Well I never even realized that they served pizza and from the reviews I wouldn't order that or the pie. I've had the pot roast and turkey and roasted chicken and it good and the portions are big. The salad bar is OK but they need to allow a second trip or get bigger plates because it's  just a saucer!  Too small for anything!  The bread and honey butter is good. They are over priced and the decor needs to be redone. I'm not sure why I go back because I always feel I've spent to much. Well tried to go in tonight at nine the sign says that they are open till ten the open sign was on and the bitch couldn't run fast enough to turn off the sign so screw them I changed the score to a 1 and went Dennys! :they gave me a five star turkey dinner","useful":1,"funny":0,"cool":0},
{"review_id":"WTiSefotoGkWkHh3Gw9aUA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"VqutAZTwEgFj7FNoTjk3CA","stars":1,"date":"2015-12-05","text":"I am mad they sell you 20 mc nuggets meal and limit you on the amount of sauce!  What a rip off I recommend Wendy s better price and taste!  Shame on them and if you insist on more sauce they charge hope they go broke","useful":0,"funny":0,"cool":0},
{"review_id":"5eJoTogH4BuV604qE1tVPQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"0--QaJYOvhNMJEWM9udk2w","stars":1,"date":"2015-10-20","text":"I would like to give them zero stars they are screwing me still! I went there because my insurance company sent me for a cleaning after a million x-rays  more than I've ever had before they tell me the cleaning will be 125.00 more than my insurance!  And they want to do all this work over 4000.00 and one crown  is brand new and I know is fine!  So I left now I'm being billed for a 125.00 for something that they never did and now this month they are bastards and added a ten dollar late fee they can eat rocks I'm not paying! And just so you know they have no customer service and the better business Bureau says that they don't settle disputes!","useful":2,"funny":0,"cool":0},
{"review_id":"zOeOZ9BcEXOxF3u8q5cO0Q","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"rkRYZq3ztIc1IEJ_FzpZsg","stars":5,"date":"2015-10-09","text":"I had my gastric by pass here in may they were great! Clean  caring and comfortable!  I don't know what the food is like because I was on liquids for a week but my experience was great and I'm down 69 pounds!","useful":0,"funny":0,"cool":0},
{"review_id":"ebrlYsDF0Lhk1lJuXUE5rQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"yvJqxVTO_qwRGLMtUrqzQw","stars":4,"date":"2015-09-23","text":"This a great place!  The wings and pizza are really good and at a fair price.  It's great for the family and it's close to home and they do a lot of fund raising  for the school.","useful":1,"funny":0,"cool":0},
{"review_id":"HQuAMVpAvforgLnqRZf5rw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"358UeNvBBE03JKX3u2FtLQ","stars":1,"date":"2015-09-21","text":"It's a great place to eat but they took my favorite sandwich off the menu and I really  don't like the others and the last time I had the salad bar it was very disappointing  so I haven't been back and I used to go a lot","useful":2,"funny":0,"cool":0},
{"review_id":"09Z8D3B_3JEc8Ntsmy-lxQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"WpzRURptZ2FIxBmJMl4MXA","stars":5,"date":"2015-09-24","text":"Kevin and debra are the best. I've  had the patia bowl and a lot of the Hawaiian ice flavors and iced coffee is my favorite!  I can't go enough I know  they need Sunday off but I'd go if they were open.  My favorite flavor is melon it tastes like honey dew","useful":0,"funny":0,"cool":0},
{"review_id":"5tnRM3BgMFz29omLXY6vfg","user_id":"e818sW7lovrFipt0XTFYUw","business_id":"bKjX4lsUn2nt1Ai_Nk4dtQ","stars":4,"date":"2013-11-02","text":"For the price, it was a good pedicure and manicure.  Very nice woman and gentle with my sensitive feet.","useful":0,"funny":0,"cool":0},
{"review_id":"Wd9qVOEMpdy_LIAc-YWrIw","user_id":"qgrb0u1gWp7xzBZkW_Y4iA","business_id":"bf5sNwoZu9npMi-Ij6AFAQ","stars":1,"date":"2016-04-23","text":"First and foremost, I'm not wring this review due to Ernie's workmanship, shop or product. I give Ernie an (A) on that level. Based on what I saw. This has to do with lack of communication with customers in regards to work being done on your Concession trailer. Ernie and I spent 45mins on phone going over every appliance, equipment and materials that was going to be installed in my trailer. Ernie quoted me a price and I continued shopping around because I FELT it was a little HIGH. A couple of days later I got a call from a co-worker asking me what happen because I never called back and I explain to co-worker how I felt about price,that it was high. I explained to co-worker I had a complete layout of trailer with everything I wanted installed on my trailer and for Ernie to look over it to see if he could give me a better price. Few hours passed, I got a call back, we agreed on a lower price of about 6000.00 dollars. I agreed to take my trailer to his shop on his new estimate. Ernie claimed my trailer would be worth 60k when he's done for a 40k job. I said Thank You! I live in California which is 377 miles away one way. I ask about a contract, Ernie claims he would have contract ready for me when I dropped trailer off. I agreed. Big MISTAKE. Next day I left for Arizona around 1:00pm, I explained to Ernie I wouldn't arrive until around 8:00pm, Ernie said no problem, he only lives 2 miles from shop and he would meet me there. I said cool, that's nice of him. On my way up I called Ernie when I was 30mins away, that I will be arriving soon, he explained to me he was still at shop, that he was leaving and to just drop trailer off in front of roll up door by his office. I felt very uncomfortable doing that and I ask Ernie if he would just wait at shop until I got there so I could meet him and pick up contract. I ask Ernie about contract, if it was ready, Ernie said no, Ernie ask me if tomorrow was ok, that he would send it to me via email, I said I will talk to you when I get there. I arrived about 8:15pm, we talked and he showed me around shop. Ernie showed me a trailer in which he posted on Facebook and sent to me via text showing me his workmanship and what I was getting in my trailer. While there looking at trailer he was completing, I ask about generator location on trailer, I ask if that's were he was putting my generator, Ernie's response was, you don't have a generator for your trailer, I said what, I sent you a complete layout with a generator in wish Ernie claims was (optional), I explained to Ernie optional met brand of generator, not with or without one like Ernie's theory, I mention to Ernie I couldn't operate a trailer without a generator, plus we talked about it on the phone in our first conversation, before I sent layout that I emailed to you. Plus if it was a concern, why didn't Ernie ask me about it before giving me a price, I know why, he knew we talked about it already over phone. That's when the fun begins and price skyrockets like the shuttle going to mars. That would be an additional 5-7k on price quote. I was like wtf happening here, I started asking Ernie questions about trailer he sent me via text, about the inside of trailer because I was very concern by now where this was heading, I ask Ernie if my trailer was going to looked like the inside of this trailer, he said no way, I said what, Ernie claims this is a 63-65k job, your only paying 40k, so I ask, what I'm I getting? He showed me a food truck with a 3 bay sink just standing, with plumbing and pipes showing, I said to myself, hell no, I'm not paying 40k for that shit.Ernie stated my trailer will not come with cabinets nowhere in my trailer, I'm thinking in my head, why would he send me a video with cabinets and all this fancy appliances in it and then claim he was installing equipment like the food truck he just showed me. If Ernie would of showed me that food truck from the beginning and appliances, I would of never ever driven to his place for that price. I ask how much to have cabinets installed in my trailer,10k more. I was like f that, now I'm looking at 55-57k, in which my very first estimate was 46k before dropping it down to 40k. I mentioned to Ernie I needed to talk to my wife about new price, we both decided not do the job with Ernie, so I hooked my trailer back up and drove back to California that night. What a lonely drive back with a very pissed off wife because I didn't get a contract before I went to Arizona. There's NO such thing about Meaning of the Minds anymore. What a waste of time, money and mileage on my new truck. So the THEORY of my review is, GET EVERYTHING IN WRITING & ON CONTRACT, COMPLETE DETAIL OF JOB and A COMPLETE ITEMIZED LIST of Parts and Appliances. Good Luck! BTW ERNIE....SHAME ON YOU!!!!! REMEMBER KARMA!","useful":5,"funny":0,"cool":0},
{"review_id":"zOumVW8SSWTFadWA_x_Bmg","user_id":"4e5LpYZjWDsSLQiMXPfoTw","business_id":"8U6EmwNaeTnhKbhBgIZPGQ","stars":4,"date":"2011-12-30","text":"A good place. The bar is always clean and they have entertainment regularly. The owner clearly has pride in his establishment. Bartenders can be distant; they don't project an inviting atmosphere.\n\nThe music is either from the jukebox or, on weekend nights, the Dj. Song selection is common club mixes. Dance floor is not heavily populated because it is in a separate part not viewable from the main bar. \n\nThe crowd is mostly thirty plus guys. People are dressed well in the sense that they are attempting to project status. Definitely more trendy types but it is possible to find friendly people.","useful":2,"funny":0,"cool":1},
{"review_id":"elWqnfr7s8TSzQ-aCBlQvg","user_id":"AhhtjILtsTh8FzqlO1tECQ","business_id":"Qm9KW5IjbhmlZVrfwpIjAQ","stars":5,"date":"2012-06-25","text":"Super fast and super friendly! did a great job on fixing our stove. definitely will get repeat business if anything else were to break down!!","useful":0,"funny":0,"cool":0},
{"review_id":"LVkYiW9cDeydr71r74HMew","user_id":"CzxYWxiggiYfwwBiqcX9cg","business_id":"kGELuv1JCftHk2MBK9Mn-w","stars":1,"date":"2015-12-21","text":"I was very disappointed with my service. I bought a pair of pants and went to another store and tried on the pants with a new shirt. I realized the zipper was broken and went right back to the store to return them. I didn't realize the pants were a final sale item and the girl at the register didn't mention that to me when making my purchase. Maybe 20 minutes went by from the time I purchased them and brought them back. They would not refund my money. I have shopped there many times, but they lost a customer today and will also let my friends and family know about the experience.","useful":0,"funny":0,"cool":0},
{"review_id":"Rz6JlNYdMpYHrr6x_V7YpQ","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"ydYaEuoB-6XX__XFrny0Uw","stars":5,"date":"2010-10-04","text":"Absolutely beautiful bakery.  Must've cost a pretty penny-- every inch of this space has been thought of.. gorgeous floor-to-ceiling cabinetry in dark wood... \n\nLive in the building above, so at the end of a walk with dog, stopped by and bought a slice of marble cheesecake.  Pure decadence- moist and ooh, so dense.   \n\nHas charming patio furniture, very European feel.  \n\nSo happy to have a great bakery in the neighbourhood.  No more second rate cakes from Sobey's-- Hurray!!","useful":1,"funny":0,"cool":1},
{"review_id":"ZwLHUMYsmYaEEn-PCP6k_Q","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"Q4orLuzDAB9TnucYXksgLQ","stars":5,"date":"2014-09-13","text":"Okay I had a major hangover.\nOkay I was also hungry.\nOkay I'm no hamburger connoisseur.\n\nBut I thought the burger I had here today was THE BEST EVERRR.\nPatty was thick and SO juicy.  And the bread was super soft with a hint of crusty edges that just killed it.\n\nEVERRR.","useful":0,"funny":1,"cool":0},
{"review_id":"NbhBe3qNXPJq3RJba8hJdg","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"vcxvQyAggPqxcHwvJXvjGg","stars":5,"date":"2014-08-12","text":"The interior is dressed up like an expensive French shabby chic furniture store.  I saw lovely ladies doing the lovely tea social thing here.  It could be a bit pretentious, but in laid-back Leslieville, it's somehow not.\n\nGet pretty baked goods here; a perfect grown up gift to take anywhere.  Pre-order for blinged out customized creations.","useful":1,"funny":0,"cool":0},
{"review_id":"2vV2O3z65fLkPFxSDuwm7Q","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"rsFSi647zo8JAvrFoOqPmg","stars":5,"date":"2012-09-09","text":"5 Stars: This place is fantastic!  I love it, think you'll love it, hope all my friends love it, wish I could eat here all the time and hope I'll own a place just like it in my retirement.\n\nor\n\n5 Stars:  As in, it meets the expectations it sets for itself perfectly well.\n\nThis falls into the latter category.\n\nThis is a place in my area I go when I'm craving Pad Thai now now NOW.\nIt's cheap.  They give you lots.  It's pretty fast.\nDone.\n\nI've had shrimp pad thai--  found the amount of noodles soak up all the sauce-- I ask for extra.. sauce that is, not noodles- it's obscene, the lid barely shuts.  Hey, value for money.  Their green curry's also quite good.\n\nIt seems like they did the interior decor recently.  However, although quite nice-- they did try to bring a bit of Thailand with the wooden furniture I suppose, I wouldn't describe the atmosphere to be all that wonderful.  Also a little fancy to drop in just for lunch imo- cloth napkins and all.  Tries too hard, you know?","useful":0,"funny":0,"cool":0},
{"review_id":"h_WXynEB95FONgH15VXbxA","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"qNFHmH-qo7Ia2vv0IK72ug","stars":5,"date":"2014-07-14","text":"Solid place to go on crazy Queen W. for a quick or slow drink.  I think this is one of those places that won't give you the bill as a thinly veiled threat to hurry up and leave.\n\nThe brussels sprouts were burnt.  But I still ate 'em.  They were quite yummy.  What's a little carcinogen on the side with your bar snack?\n\nAs mentioned in other reviews:  The staff here are some very nice eye candy.  And I mean that not in a creepy way.    It adds a certain je ne sais quoi to the drinking experience.\n\nThey seem to have a patio upstairs, which should be nice in the summer.  Will return to confirm.","useful":2,"funny":1,"cool":0},
{"review_id":"-sUHYTNUYCJLqjywHUpFlA","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"ZuA9e5nSrCj2R97x2K2yOQ","stars":5,"date":"2012-09-13","text":"This is a bar I can get excited about!\nIn Kensington, through some non-descript doors, down a hallway that seems to lead nowhere, through another door that looks like a fire exit... then you see an asian woman dressed in a waiter uniform selling dim sum?  The bar has an extensive choice of hard liquor? Smoking allowed in patio? \n\nWhat.  Am I in Toronto.\n\nIt's casual and oh-so-deliciously different.\nLove.","useful":0,"funny":0,"cool":0},
{"review_id":"-EQIC0MIt1Vt5owwVL-tWA","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"72_6srKAdZPSHCGNwK2Hfg","stars":3,"date":"2010-10-04","text":"I live in the building above this restaurant.  I've been there twice.  Both times, for the location.\n\nThe pasta here is so devastatingly mediocre, I almost cried.  The first time, I was just happy to have a restaurant in my neighbourhood.  I didn't even expect much, so when the food turned out so disappointing, I was crushed.  But location can't be beat, especially in the summer, when the area is bustling with activity and you can sit in the sun.\n\nSo, the food is bleh, whatever, it happens.\nThe reason I'm posting a review at all, is because I went into the *most charming* bakery that opened next door today and found that they are having to petition to keep their patio open because Eden put in a complaint to the condo board.  \n\nNow, having lived in the area for 2 years, I've been waiting to see some shops flourish here-- pet stores and convenience stores have come and gone.  There is construction for 2 more condos and am sure there will be more in the future.  There will be more businesses - yes, restaurants too- that will come here, so they better get used to it.\n\nI just don't get that kind of pettiness.  They could be supportive, after all Eden serves full meals and Cocoa is a bakery\/cafe.  And the patios outside make for such good ambiance. \n\nVariety and competition never hurt businesses.  Maybe Eden will work a little harder to serve some decent food.\n\n1 star for location.  1 star for patio.  Minus 3 stars for food that doesn't do the restaurant justice and poor sportsmanship.\n\n--------------------------\n\nMay 18, 2011\nReceived email from Mark the manager.  Says they're not to blame for the bakery's patio troubles.  I've moved to Vancouver and don't know what's going on there now, but thought it's really nice of him to address it.  Also says Eden can't please everyone's palate.  That's true, although I am definitely no food critic ... Their food's isn't awful, it's just okay.  Anyway, it's nice that they care.  Added a star for people who care!","useful":2,"funny":1,"cool":2},
{"review_id":"Pdu2Wm27eSVH0RrZj1MzPQ","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"MWvfffAggIKAV8pBfi-Gyw","stars":5,"date":"2014-08-12","text":"Lobster with Black Bean Sauce.\nLobster with Ginger and Green Onion.\nWatercress.\nFried rice.\nHot sauce, please.\n\nThat is all.","useful":0,"funny":1,"cool":0},
{"review_id":"H-EKKoRy_DtJlAZuny_PnA","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"KDiVhKB9UneT548hThK8hw","stars":5,"date":"2014-07-11","text":"Great filling salads!\nThe atmosphere on the inside is very charming with casual mismatched furniture and the prevalence of unfinished wood.  The outdoor patio is a little biermrkt but they do serve beer, so.\n\nI got the arugula & beet with added tempeh and found the salad a bit too salty.  Don't get me wrong, it was delicious, and I guess I can't complain about stinginess with the dressing... but maybe ask for it on the side.  \n\nAlso got the farmers market to go and it was great.  Cilantro dressing highly recommended.\n\nCoffee was also surprisingly tasty.  Or maybe I just really needed it ..","useful":2,"funny":0,"cool":0},
{"review_id":"xauW5RIwE0EXbr2RoxitoA","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"VA3ZZAjRGXOYoo7FkhSt7w","stars":5,"date":"2014-08-17","text":"This is the flower shop of my dreams.  You know, the dream where I walk in and ask to have a bouquet made for my mum and they'll make an exquisitely unique one (and they won't arrange it like stiff soldiers on parade or suffocate it in ugly paper and plastic after)? I've been looking for this place all my life. Style is very artlessly elegant, which is difficult to find!\n\nThey also sell candles poured into teacups and vintage cans.  The lemon smells incredible.  It has a very unassuming storefront- A few doors down from Glory Hole.\n\nLove, love, love, love, love.","useful":3,"funny":0,"cool":1},
{"review_id":"C8AS6zW0U3pPdi3MNRAEvg","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"Amowa4wwqNzwxA39XHw1tQ","stars":5,"date":"2012-09-09","text":"Still on the fence about the Ossington strip.  This neighbourhood is going through major changes (revitalized CAMH, new condos galore+Gentrification) and there seems to be a bit of an identity crisis.  Intimidatingly slick and posh retail and restaurants I can't afford, rubbing shoulders with tired looking convenience-cum-takeout joints I feel uninclined to go buy gum.  Should the future be more places like this, I may have to move closer.\n\nCrooked star straddles this divide well.  A cozy (you know this is code for small), no-frills (beauty's in simplicity), relatively new (read: clean), UNpretentious, affordable yet full of character... where everybody knows your name~  ... actually I don't know, but feels like it could definitely happen.\n\nIt's nice.  It's comfortable.  Which is so v. important when you're having a shit day and just wanna have a damn drink.  \n\nI believe they have a limited menu.  No real cooking going on but it's more than fine to go with a drink.  I go for beer and liquor- straight up.  I wouldn't say this is a cocktail kinda place.  Smoking patio.  \n\nDo go.  It's lovely.","useful":2,"funny":0,"cool":0},
{"review_id":"-mdWoRkhVRF93g_SW0aKqw","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"zgQHtqX0gqMw1nlBZl2VnQ","stars":4,"date":"2014-08-12","text":"Ooh this is so hard!  I have been twice and both times I have been severely underwhelmed with the food.  The restaurant, on the other hand, makes me so very happy.  Next to Shangri-la, it's an absolutely gorgeous space.  The blocks of wooden community tables and bar, the square uniformity of the stools and space layout.  The open kitchen with assembly line methodology.  It's a delight.\n\nDo I expect too much from the humble ramen?  (I love you KINTON) I just don't know.  I did have the ssam as well and thought it too gussied up as well.  \n\nWhat did I enjoy the most.  Beer selection.  And the pickles were yummy.   But for all my bemoaning, I did go back for another visit, so what does that say about me.  \n\nThey won't seat you if your entire party is not present, but I was able to wait for my sister at the bar when I asked to order a drink rightawaaaay.   :D","useful":0,"funny":0,"cool":0},
{"review_id":"pCEX1EzO4RlL9M_CYLWJOw","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"IFXL6wMLBgBSGSiLBjtViA","stars":4,"date":"2015-12-26","text":"\"It's not perfect, you know what I mean?\"\n-Dining Companion-\n\nIn reference to the fact that \n1) service is rather slow (if you know what you want, just order it all at once)\n2) amount ordered is not always what's delivered \n3) service is rather slow\n\nBut!\nIt's fun, and it fills you up!\nA perfectly reasonable option downtown when only hotpot will do.  \nAs mentioned, around $25 per person.","useful":0,"funny":0,"cool":0},
{"review_id":"SDGtEOPd1qWLJ5RH1K6sYg","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"tTzQZTrwBgwxMch77nCJfQ","stars":5,"date":"2014-07-28","text":"This restaurant opened my mind to the whole vegan\/gluten-free thing as a dining option.\nI mean, I want to be healthy, but I don't want it to be... unpleasant.  Especially when I'm paying for it.  \n\nI got the Soup & Salad Combo of Amazingness that everyone here raves about.  And it was.  It was amazingness.  The soup was hearty and rich.  The salad, deceptively filling.  And so well dressed!  Delicious.  Delicious.  I recommend it v. much.","useful":2,"funny":0,"cool":0},
{"review_id":"vWNzHCnEUiU6464CTEGNUg","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"ghaj1MZzPW1qXYCZWfoTTw","stars":5,"date":"2014-07-05","text":"Very pretty restaurant!\n\nJudging from the Paleo Bowl, it is possible to be well satiated here.  Pick wisely-- Look out for ingredients like avocado, sweet potato, tofu and tempeh.  I found the Detox Salad to be on the small side.  Also on the salty side.  But then I did dump the entire contents of the dressing container.  Note: Don't do this.\n\nThey have a deceptively large and gorgeous shaded patio out back.","useful":0,"funny":0,"cool":0},
{"review_id":"6nJQvcSYu_jRkVqIvrb97g","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"KBUjHejDR4Ttsx8TcqWENQ","stars":5,"date":"2014-07-19","text":"Do you want Korean food?\nDo you like nice service?\nDo you appreciate side dishes?\n\nRecently renovated and very welcoming with all the English on their menu.\n\nI wouldn't necessarily go for pork bone soup (Why not go to Owl where it's their specialty? ).  Try something else!  I had their kalbi and it was sooo good.  The marinade is something else.  The cold soybean noodle thing was yummy too.  I think their kalgooksoo is what they're known for, but it's just not my thing.  I would try being adventurous here though, they make tasty food.\n\nLook in at lunchtime and you'll see mostly Korean workers in the area stopping in and c'mon you know that's a good sign.\n\nOh, and when I asked for a refill of all the side dishes, I was given a limit of 4.  Which was totally fine, but just ask for the ones you really like and don't be a greedy cow like me-- we didn't even end up finishing the second round, hence the limit I guess.  My bad.","useful":0,"funny":0,"cool":0},
{"review_id":"djm0ebbf5-JxQ9R3oF5O6Q","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"3-i1qd64K-WLo0fJ5wrbbw","stars":5,"date":"2014-08-22","text":"24 hours.\nThis North York location has an extensive menu.\nMost everything is reliably tasty.\n\nBUT YOU MUST GO BBQ OUTSIDE.  Out back. It opens after 5pm.  You. Must.\nOh, btw, there's free parking out back as well..\n\nThat is all.","useful":0,"funny":0,"cool":0},
{"review_id":"lwKOu5qHzCieui87LGrdRg","user_id":"2BbJnmvp55TYYjGuoG-S6w","business_id":"SJ2-dfgQt5cOky4jWNZEPA","stars":5,"date":"2014-07-30","text":"This is really charming movie theatre !\n\nEnter, tickets to the right, piano to the left, concession to the back.  Simple.\n\nI went for $5 Tuesday, and I suggest you go at least half an hour before your movie starts to snag seats, especially if you're a group-- it fills up!\n\nSome tips?\n*You can purchase tickets where they sell popcorn.\n*They serve liquor.  Bahahaha.\n*Street parking right in front of the theatre allowed after 6:30pm at $3 every hour.  (I did not know this and parked at Bay and College for a flat rate of $6, which is not bad either for downtown.)","useful":2,"funny":0,"cool":1},
{"review_id":"-FaykWRJSGia64SkV74f5A","user_id":"QQyfns7yfVObimB8pp1_AQ","business_id":"3rj1qpgFvkRWtAka17mhEQ","stars":1,"date":"2015-05-17","text":"I was in love with this place. Until I found a green like bug in my oysters! Made me sick... I still lose my lunch when they send me emails.","useful":1,"funny":0,"cool":0},
{"review_id":"TJhVHZTjt0irg9nerKx83A","user_id":"QQyfns7yfVObimB8pp1_AQ","business_id":"w55IYhyLHUdsRlo_EvMmNQ","stars":1,"date":"2015-05-16","text":"The place is beautiful but the food does not add up. I will not be eating there again! Hopefully the menu will be rethought.","useful":0,"funny":0,"cool":0},
{"review_id":"Ct0S_GWCaOt1iNKxZYuSwA","user_id":"QQyfns7yfVObimB8pp1_AQ","business_id":"ILPp2_e6_PcKsHgv2FkuKA","stars":1,"date":"2016-07-16","text":"I would rethink using this location Justin or Dustin is very disrespectful. Hopefully Jiffy smog will send a trainer to that location and help him remembered what customer service is suppose to be.","useful":1,"funny":0,"cool":0},
{"review_id":"2lObjf387f4xWK4Ncv0bzQ","user_id":"QQyfns7yfVObimB8pp1_AQ","business_id":"HbN0Qx_4QnzPcVNZy9PUVA","stars":1,"date":"2015-05-16","text":"Around 4:20 p.m. On Saturday, May 16. I received the worst customer service. I have had my share of bad experience with service but never to the point of writing a review. The young lady in the establishment was snippy. There is extensive room for improvement!","useful":0,"funny":0,"cool":0},
{"review_id":"NMQzFAis4DyMA7J1vn9Feg","user_id":"u07se6br8-Sad8OItUvoUQ","business_id":"eJpy41i5KpwQ5kcG9i66mg","stars":5,"date":"2015-10-14","text":"I had a really great experience at this dealership!  I've gone through a bunch of cars in the last 10 years in Vegas, and this dealership was the easiest to work with and the least pushy of them all.  I'm really happy with my Prius, and I'm also happy with the trade value I was offered.  I found these guys to be honest and straightforward.  Highly recommend.","useful":2,"funny":0,"cool":0},
{"review_id":"CBC9FXXnv9YuznrVywp6qw","user_id":"u07se6br8-Sad8OItUvoUQ","business_id":"56d3dE1LoZZMxA-kTQvqew","stars":5,"date":"2010-04-27","text":"This is what all tattoo shops should strive to be.  Stylish, clean, great ambiance, mesmerizing art on the walls, super talented artists (all of them), and no pressure.  These guys want you to walk away with a great tattoo, and they will take their time to work with you on realizing your dream piece.  No attitude.  Incredible quality.  The best.  I highly recommend Studio 21!!!","useful":1,"funny":0,"cool":1},
{"review_id":"wCq3INSBHZJiv33jq3rgXQ","user_id":"zdRy3QGs6voWQ_z9UYLgpA","business_id":"6SwdqYrQSASONmrgG4mBjA","stars":5,"date":"2016-04-16","text":"Love this bar. Great chill place for a great cocktail. Bobby and Rosemary are an amazing bartending team!","useful":1,"funny":1,"cool":1},
{"review_id":"CtFjbxzlNhWzzBh-A1BuTQ","user_id":"zdRy3QGs6voWQ_z9UYLgpA","business_id":"ToFm2DhhTdr0Kv0A7Sdj6g","stars":5,"date":"2016-06-25","text":"Can't believe we haven't checked out such a great place yet! Jaclyn was phenomenal! Really sweet, perfect timing and great knowledge of the menu!","useful":2,"funny":0,"cool":0},
{"review_id":"JTtzapGlEeUrNHFLosg65g","user_id":"zdRy3QGs6voWQ_z9UYLgpA","business_id":"ghpFh6XpH1TYZhjAGdx-xw","stars":5,"date":"2014-01-06","text":"Wow, crazy good pizza! I loved the pizza place that was here before but this place is wwwaayy better. Great service, great pizza, great salads and all in your control to make your own perfect pizza or salad.","useful":0,"funny":0,"cool":0},
{"review_id":"7fjtVLtpjlrWn4jyI-Rg-Q","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"cp0F3ayzAFOBKc16oMbBKw","stars":5,"date":"2015-06-11","text":"Certainly something for everyone here! I had the burger and fries and my husband had the Bolognese. Both were delicious. The owner made us a desert by using liquid nitrogen to freeze a cocktail.... It was like a yummy sorbet but smoother. Husband also had an old fashioned that was one of the best we've had. So happy to have this place local. For the quality it is very affordable!","useful":0,"funny":0,"cool":0},
{"review_id":"dd3kQarI2tBQVm30EP1r7Q","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"senuARIGwzEUl6qFm9abNw","stars":5,"date":"2014-08-15","text":"If you are looking for a quality pet food, this place has most of them available! The owners are super nice. They gave my dog some treats while she was in there. They also made some suggestions for me based on my budget, which was helpful. We are getting a second dog, so have to consider the cost. They were happy to help me out with that and suggest a food that both of my dogs could (they are different breeds). Also, I always prefer supporting a local business over a chain : )","useful":1,"funny":0,"cool":1},
{"review_id":"bTKgrOooaaJq43OAOItPNQ","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"WlpXw_fd1EQWJgyhVPj1ZA","stars":5,"date":"2014-06-11","text":"I moved here from Portland, OR last year and I had been unable to find someone who compared to my stylist there until I found Megan! She asked me what I wanted and when I told her I needed help deciding she was glad to make suggestions, but ultimately left it up to me. The color is very natural (but better than MY natural) and she does a good job complementing your look with your hair instead of you having to complement your hair with your look. I love the cut as well. I showed her a pic and she knew exactly how to give me something similar while also catering to my unique face shape. All of this and their prices are relatively affordable for their services.\n\nBottom line: I will definitely go back and will for sure suggest this place to my friends.","useful":3,"funny":0,"cool":0},
{"review_id":"VqXdTpxLC0xhtggfClNblA","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"cN0DHOTO1VPBMwDow8OzCw","stars":3,"date":"2015-03-15","text":"This review is mostly about the wine club that they offer. I don't think their wine picks are exceptionally good and the price per bottle didn't seem discounted. If I'm committing to buying wine every month I would expect to get a better deal. We used to live in wine country in Oregon and all of the wine clubs discounted the bottles that were included in the shipments. Also, they could offer memberships that were quarterly so that you can get nicer bottles instead of having to buy cheaper bottles monthly.\n\nWe have also been here for drinks a few times. I like that it is local and there is such a good selection of wines. There is a corking fee if you don't choose off of the menu (which is sad because they have such a huge and awesome selection that is not on the menu), and it seems a little high. The service seems hit or miss.\n\nWould like to try the food but haven't yet.","useful":2,"funny":0,"cool":0},
{"review_id":"t7lF8xz2fL3l4fyaXwv3PQ","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"0i95sgY7pzYW9k88SOVJ8A","stars":4,"date":"2015-03-15","text":"Good food, great service. Husband and I ordered the chicken with mac and cheese and the gyro gnocchi dish. They were both very good. I thought the mac and cheese could have been creamier and needed a little salt, but husband thought I was crazy. Also thought the lamb in the gnocchi dish was a little dry... husband also thought I was crazy about this. We polished off our gluttony with the deep fried brownie. It was good, but I wish we had gotten then brie ice cream with apple fritters. Wine and beer selection was good. We don't get to eat out often and I'm glad we chose this place!","useful":0,"funny":0,"cool":0},
{"review_id":"fH9IvueQK4cbW3nW8EAHCQ","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"OF19lUVQHj8pVaSACNewWg","stars":3,"date":"2013-11-14","text":"The food was ok. I got the California chicken sandwich. My fries were cold which is a little annoying because I love fries. My husband got the Sicilian flatbread and it was a bit better than mine. \n\nIt is a pretty cool place to hang out because there is a nice restaurant area and also a bar area with TVs. We were able to get some decent food and also watch a football game. However, the food was just mediocre. For the price I would expect a little bit better.\n\nOh and the bathrooms were really dirty. Like I was tempted to give 2 stars dirty...","useful":1,"funny":0,"cool":0},
{"review_id":"ZN4760B585gKRmpfXUvbHQ","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"T0YcBnoOLijA5YPR8rjtYw","stars":5,"date":"2014-06-14","text":"I took the Sea Kayaking 101 class. Super rad. The class size is small, so you get a lot of one on one time if you aren't getting something down or want to be able to do something better. They were great at helping us with our strokes so that we could maneuver the boats better, showed us how to do entry and exits using a variety of methods, and showed us some rescue techniques. There was a lunchtime game about this year's coast guard safety facts. They had great equipment and even brought some pullovers for us since it was a little cold.\n\nTo summarize, I balked at spending $95 on a kayaking class, but I am so glad that I did. I will definitely be back to take more classes and I will suggest them to my friends and family.","useful":0,"funny":0,"cool":0},
{"review_id":"MIQey5KusaTWOr5GMD-rbg","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"9qqdaSdeMV8tY4LBMZXvhg","stars":5,"date":"2014-07-02","text":"This place is called Castillo Mexicano now. It has new management and is really great. Hands down the best Mexican food in the Cleveland metro and the back patio view is spectacular.\n\nWe got there late and the food was still fresh. I got the fajita taco salad with chicken and my husband got the chicken flautas. The chicken was very moist and seasoned very well. I suggest if you have a choice of meat, get the chicken... I digress.\n\nThey also served fresh guac with both of our meals that was super yum and it did not cost extra!\n\nOverall, the food was great as was the service. Even though we live in brecksville we might drive the hour again for this place : )","useful":3,"funny":0,"cool":1},
{"review_id":"2BKP0_YDNbEOueOfboeHCA","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"uLdJrH2rJwULKLopi0XH4Q","stars":5,"date":"2014-03-13","text":"We got stranded in the Vulcan snow storm on the way to the airport and lucky for us we were close to this place! I have eaten in little italy a few times, and it was not nearly as good as Conte. The service was fantastic, the prices are fair, and the food is superb. The margharita pizza was super yum. The pasta arabiatta was really good too.","useful":1,"funny":1,"cool":0},
{"review_id":"UvxiTjV4__LeCk7nxqVISg","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"nWW6fBfBljiRFa4sG7TyxA","stars":5,"date":"2013-10-12","text":"Pretty pricey, but pretty darn good too. Staff was friendly and the atmosphere was pretty chill for the tier of cuisine offered.","useful":0,"funny":0,"cool":0},
{"review_id":"yyQyE66C-fEMwNC52NEPTA","user_id":"Rdk7bA5zu-7_2ssBLWk_Sw","business_id":"LbyCngxEveE7G6w2mqeueg","stars":3,"date":"2013-10-12","text":"Summary: ok pizza, may not get delivery\n\nWe have used this place twice. The pizza deserves 3 stars. It is ok. Not bad, not that great. The delivery service the first time was ok as well. However, the second time they didn't have anyone to deliver my pizza for 3 hours, so I had to go pick it up.","useful":0,"funny":0,"cool":0},
{"review_id":"8H9KcqammDF7jwrJP5gCVQ","user_id":"eIwCHjMDuuOJ3_utLLDQ5Q","business_id":"lDp4MbyQEj4-5kSM-4zRFA","stars":5,"date":"2013-06-21","text":"O-M-G!! These cupcakes are absolutely amazzzzing!!  My twin sister had been eyeing this place for some time. Since I no longer live in the area I hadn't realized that they had built this cupcakery here.  When I say we have visited this cupcake place twice in 1-week....SMH...just thinking about going back is making me put on 5-lbs!! Lol...\n\nThe mango-passion fruit cupcake was probably the best cupcake I have EVER had! I love my cupcakes, but I hate icing. The first thing I usually do is throw the icing away.  Not these ones! They were so light and airy...I actually ate the whole thing.  Also the Strawberry cupcake was delicious as well. The icing actually tasted like a strawberry milkshake to me.\n\nMmmmhh!!  Addicting is all I can say! Hopefully I won't have to work out for 2-hours to rid myself of the calorie guilt from eating 2 in 5-minutes. :-) Will definitely come back when I'm in town again. If I could give this place 10-stars I would.","useful":2,"funny":0,"cool":0},
{"review_id":"hUjEx2y5aZFy5vB871DflQ","user_id":"9dxowFF7kSQrKxRkZyfaxg","business_id":"4j0kUhi2rglsDf6dIiK5fQ","stars":1,"date":"2015-11-19","text":"BIG RIP-OFF  JUNK  TRASH MATTRESS JUNK! RIPOFF \nI have bought a set of  mattress for over $1250  and i call for the warranty because mattress is sinking \/sagging junk Mattress  and they told me that it was normal wear wish is not true they're telling me that in order for them to warranty mattress it needs to have more then 1.5\" SAGGING *******\n i learn my lesson by trying to save money you all way's get what you pay for i was better off buying $100 mattress","useful":7,"funny":0,"cool":0},
{"review_id":"K33RYQbFNynv5eS9z0Vp7Q","user_id":"9dxowFF7kSQrKxRkZyfaxg","business_id":"068SDTbi41-7CkR-r2guiA","stars":1,"date":"2016-10-19","text":"I recently had the misfortune of purchasing a 2016 Cadillac CTS Luxury Collection from this dealership. I will say that I had a positive experience when first engaging with them, but I recently decided to trade in my car (4 months after fact) for something else. I was shocked to find out that Mr. Skoko was unwilling to take my car back because of what it was \"worth\" now. I paid nearly 60k for a vehicle and to be told that after 4 months and 5,000 miles its worth 50% of the value. I understand that vehicles depreciate in value, but 50%!? And the fact that they were not willing to assist\/accommodate with getting me into another vehicle is upsetting, I will never be purchasing a vehicle from them again and will go to a dealership that wants to retain potential long term clients.","useful":2,"funny":0,"cool":0},
{"review_id":"Ak01FCThrfQRjg-zrbzN4A","user_id":"uOJOu8gEZByrG-77JTttCQ","business_id":"4HoCAPiFH2BFznYxGR7sjQ","stars":5,"date":"2013-05-26","text":"I use to go to Lovely Nails before the new management ordeal. I can truly say it is now way better than before.  It is very organized, has great costumer service, and gives great results. I will be going to Lovely Nails every time I want to get pampered.  I got a pedicure, full acrylic set, and my eyebrows waxed...they can do anything.  Their work has an excellent quality. I recommend going to Lovely Nails for their services.","useful":0,"funny":0,"cool":0},
{"review_id":"fBmzsecertPp7GZtTrcnFQ","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"dn51F67VLgPuqy_8SFk9oA","stars":3,"date":"2015-01-08","text":"food ordered: $13.99 prime rib, baked potato, steamed green beans & soup + beer\n\nfood:  prime rib was nicely flavored, big cut, lots of fatty parts tho. portion was huge, enough for two people to share.  ordered the hef beer but not sure if the waitress brought out the wrong beer, but the hef was very very light, see through even!\n\nmisc: cafe is located inside the Ellis Island casino.  This is an older casino that allows smoking inside.  the smell of smoke was very strong. walked out smelling like an ash tray! \n\nParking: some parking spaces in front of the casino. Parking structure located in the back of the casino.","useful":0,"funny":1,"cool":0},
{"review_id":"RRc5DJNQjao9INB8KTdlzA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"1i9T1uoG_J3aRfprALvNGQ","stars":2,"date":"2014-10-24","text":"food ordered: toasted almond iced coffee, raspberry iced coffee\n\nfood: the coffee here tastes very watered down... had gone to a different dunkin earlier in the morning and their coffee tastes much richer and better...  \n\nParking: private lot, lots of parking available.  They share the lot with an Albertsons and some other food concepts","useful":0,"funny":0,"cool":0},
{"review_id":"wt1hs0YSs4rlM8GY-lJi3A","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":5,"date":"2014-10-24","text":"Food Ordered: Mr Ho's burger, Garlic Parmesan fries, bachi pickles, pineapple ketchup\n\nfood:  mr ho's burger was served on a taro bun!  this was very unique and different. there was a slight sweetness to the bun, and a hint of taro to it. very good, I like!  Bachi pickles were kinda interesting... it  was like a mix plate of different types of pickled radishes and cucumber. Fun when they were added to the burger.  Garlic Parm fries were delicious.  the pineapple ketchup was delicious! pineapple sweetness and flavor infused in the ketchup - very tasty\n\nService: our waitress was very informative and patient, as it was our first time visiting Bachi burger.  Gave us some great suggestions. \n\nParking: plenty of parking spaces in a small strip mall.  \n\nmisc:  came here early on a Saturday morning ~11:30am and didn't have problems getting a table.  When we left at about 12:30pm, there were lots of people waiting outside for a table.  Bachi Burger and shoku? ramen are right next door to each other, they share the same entrance door, and you can order both burger and ramen at the same time.","useful":0,"funny":0,"cool":0},
{"review_id":"g0U8DwMnmj9GXC6lAkXoFA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"cOJ1uIVIHCiefUyWG2wDfw","stars":1,"date":"2016-03-27","text":"The menu as changed!  Sadly, I can here based on yelps pictures of lobster Mac & cheese and the fried pork bites, but the menu has changed and these dishes are no longer offered.... So sad... Nothing on their new menu looked appetizing nor uniquely appealing.  7:42 pm on a Friday evening and the place is empty.","useful":2,"funny":0,"cool":0},
{"review_id":"PVKXhd7O_TU2OOJt5sZGvA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"RESDUcs7fIiihp38-d6_6g","stars":5,"date":"2014-10-24","text":"still the best new buffet on the strip!  Came here on a Friday night at about 5pm.  No wait, paid and was seated within minutes. Starkly different from our first time there a year ago when the wait was 1.5hrs long... I think the dinner price increase by about $5... used to be $50, now was $55 for dinner.\n\nThey serve: snow crab legs, king crab legs, raw oysters on the shell, jumbo shrimp cocktail, prime rib, rack of lamb, turkey, sausage, dimsum, pho, ramen, tacos... desserts were delicious too!  Surprisingly their pho and ramen were pretty good...","useful":0,"funny":0,"cool":0},
{"review_id":"H-oc1nHRlAG8m6FTEgg8yA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"odyYR1Bg2bqmp1kVlm8OYw","stars":4,"date":"2014-10-24","text":"First time here at Red Rock Canyon, and the views were nice.  Quick drive from Vegas - approx 20 - 25min.  The scenic drive goes in one big loop, so you end up where you started off at, which is nice because you don't have to back track on routes.  It was a pretty warm day, so didn't go very far into the hiking trails.  Great scenic drive.  There is more red colored rocks at the beginning of the drive than the end... If comparing the views of Red Rock Canyon vs. Valley of Fire, Valley of Fire has the prettier of formations, but Red Rock is the more convenient of the two.","useful":1,"funny":0,"cool":0},
{"review_id":"1ALV8sH3haRZTyfMOiNDEQ","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"NY80DkkCfEl198JmwtO4pA","stars":2,"date":"2014-10-24","text":"Ehh... first time staying at Harrah's and their Carnival Tower room was just ok... checked in at 3pm and the attendant told us that they did not have any more king-bed rooms, they only had king-bed handicap rooms.  We ended up opting for that.  The room was handicap accessible, wider walkways, but interestingly enough... the shower\/bath tub arrangement looked like a regular tub with extra bars in there.  The room floor had some sort of dirt\/pebbles in one corner of the room... didn't look like they vacuumed the area. The light switches\/knobs were old and loose.  I think if you turned them a little harder, you could accidentally pull them off...\n\nThe coffee shop that used to be next to the escalators are now renovated into a food court\/restaurant hall area... there was a burger shop, bar, gelato\/coffee station, and some other fast casual style dining concepts there.  They are unfortunately NOT open past midnight!  If you come back from a night of gambling\/clubbing, you will not be able to find any food here... had to go next door - Linq area to find late night food...","useful":0,"funny":0,"cool":0},
{"review_id":"ZegJ3czeUb6LYE0WA0h4jA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"SMPbvZLSMMb7KU76YNYMGg","stars":5,"date":"2015-04-08","text":"Great hotel, always clean and friendly staff. Large soaking bath tub and separate shower configuration.","useful":1,"funny":0,"cool":0},
{"review_id":"qm8eC-KATwgUwz1DhwyEAw","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"r3kFRJuy7CTxamZycndqGw","stars":5,"date":"2014-10-24","text":"food ordered: blueberry iced coffee; coconut iced coffee, sausage cheese & egg croissant, smoked sausage egg mcmuffin, pumpkin donut, bavarian cream donut, maple donut\n\nfood: blueberry iced coffee tastes very refreshing! coconut iced coffee is another excellent flavor!  iced coffee's are un sweetened which is nice.  love the rich flavors in the coffee.  donuts are best i've had, not too sweet, light and fluffy.  the sausage cheese and egg croissant is always my go to breakfast sandwich here.\n\nParking:  located outside the outlets, lots of parking.  there is also a drive thru window.\n\nmisc:  I always go to this location because after some other locations, this has the best coffee flavors","useful":0,"funny":0,"cool":0},
{"review_id":"wLlXStYg1MtXEiovcGn2LA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"DfgZlNgKwBvCpA_0alumXw","stars":3,"date":"2014-10-24","text":"This was a pretty nice property. They did a great job with their interior landscaping and interior decorating.  rooms felt clean, sheets were crisp, white and clean.  Bed was fluffy with a pillow top.\n\nDid a late night check in at about 1am... the gal that checked us in looked like she was half asleep... very little conversation came out of her... so little that she never asked us if we wanted one king or two doubles!  checked into our room, and ended up with two doubles... we were so tired that we didn't even bother going back to the desk to change rooms... \n\nValet parked the car, they allow you to call the valet desk to have your car pulled up to the front in 10-15min.  Pretty nice, no waiting needed.","useful":0,"funny":0,"cool":0},
{"review_id":"rM8WdY9yzET2IUFNPu2O7A","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":2,"date":"2014-10-25","text":"took a free shuttle that connected Harrah's to Rio.  Shuttles run every 30min, and is about a 10 minute ride. Shuttles were very punctual earlier in the day. Evening\/late night shuttles did not arrive for about 45min, so we ended up taking a taxi back to Harrahs","useful":1,"funny":0,"cool":0},
{"review_id":"W7F4paKJMfRNd8w-T_QfJQ","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"QJatAcxYgK1Zp9BRZMAx7g","stars":3,"date":"2015-01-08","text":"food ordered: shackburger, chicken dog, strawberry shake, fries\n\nfood: Well.... wanted to order their smokestack burger, but they ran out of bacon. wanted to order the shackmeister dog, but they ran out of cheese sauce. wanted the cheese fries, they ran out of cheese. sense a pattern going on...?  we ended up with a shackburger, chicken dog and regular fries.... They just opened on Mon 12\/29 and we were there on Fri 1\/2.  Whoever does their inventory ordering should have done some damage control and gotten a rush shipment cuz it looked like they ran out of half their menu items!  from the food that we DID end up getting... the burger was tasty, a little on the smaller side. I could have eaten two!  fries were nicely flavored and crispy.  chicken dog was a bit dry, the chicken sausage was slit down the middle then grilled so lost a lot of it's juices and flavors. it was getting close to being chicken jerky...  the winner winner for me was probably the strawberry shake. very rich in flavor.\n\nmisc: located outside of the newly renovated NY NY bridge area. plenty of seating inside the restaurant, but the restaurant gets very busy, so finding somewhere to sit is a little difficult sometimes.","useful":0,"funny":0,"cool":0},
{"review_id":"SfFavhZbqTxjQkw0VLp-og","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"6H8xfhoZ2IGa3eNiY5FqLA","stars":2,"date":"2015-01-08","text":"food ordered: miso pasta\n\nfood: this is like a japanese\/italian fusion restaurant.  waitress said that the japanese influence gives the pastas a broth-ier base. flavor of the pasta was ok... more of a creamy miso.  unfortunately my food came out a bit on the warm to cool side, the rest of the food orders came out looking like they were pipping hot. \n\nservice: waitress was sweet and informative, gave us plenty of time to decide what we wanted.","useful":0,"funny":0,"cool":0},
{"review_id":"chDQ2tIBYeRaakECYcXqCA","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"qjnJFZtsY_nfRzoL3J_UWQ","stars":3,"date":"2015-01-08","text":"checked in here for 2 nights. rooms were clean and updated.  entertainment unit used for closet space and for the flat screen tv.  No mini frig located inside the room. ordered room service for late night eating. 18' one topping pizza approx $25 and order of chicken wings.  ~$10 room service delivery charge.  Pizza and wings were delicious.  Great late night food.  Food fed 5 people. \n\nself parking in the garage was pretty easy to get in\/out of. there is currently a lot of construction around the NYNY & Monte Carlo back area, evening traffic can become a standstill if you get caught in the rush. Better to hoof it or call a taxi.","useful":0,"funny":0,"cool":0},
{"review_id":"a1hhz2KZMEAZpNUFfvO0_A","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"WYw3Uf56DT5IwpaLNnCH5Q","stars":5,"date":"2015-01-08","text":"Always love staying at this hotel. air is clean, rooms are very clean as well.   No self parking available which is not an issue because their valet services are very good.  Their valet parking garage is right next to the hotel, so retrieving your car is lickity split fast. Non smoking hotel and no casino located on premise. \n\nrooms are very spacious and nicely laid out, there is a small kitchen area that includes table seating for 4, sink area, kitchen cabinet space and a mini frig.  Flat screen tv and sofa seating for at least 2.  Bathrooms are very spacious with separate shower and large soaking tub. \n\nroom service food is always delicious.  jumbo shrimp cocktail comes with 6 on a plate, chicken wings were flavorful and crispy, only downside was their minestrone soup... tasted more like tomato sauce.  overall, great room service experience.","useful":0,"funny":0,"cool":0},
{"review_id":"2gbdfkU3ilrdVIEQdSp1qg","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"3BCsAgo_1i4xMuTyLKMLRQ","stars":4,"date":"2015-01-08","text":"food ordered: BLT sandwich w\/ fries & liquid defense juice\n\nfood: BLT sandwich was nicely made, good portion of bacon in the sandwich.  Liquid defense juice tasted good. \n\nmisc: location is a tad bit small... seating for more than 4 people might be a little difficult.  come early and seating wouldn't be too bad, but come later and it's a tight squeeze in the room. restaurant is located off the strip in an industrial strip mall looking area facing the fwy.","useful":0,"funny":0,"cool":0},
{"review_id":"kvgM5PMGHDw40DQBg5SyMQ","user_id":"i8A2gJfUIJPGFvzbFhg6Tw","business_id":"RwMLuOkImBIqqYj4SSKSPg","stars":5,"date":"2014-10-24","text":"Adobado Tacos are THE BEST tacos they have here!!!  i'll go through 6 of them easy... \n\nthe area here late at night is kinda sketchy... while lining up for tacos, the drunk people behind me got into a heated argument and nearly started a slug fest... too bad it didn't get ugly or else I would have lost my spot in line...","useful":0,"funny":0,"cool":0},
{"review_id":"P8Npjv7wubJMZWpXE7iFMw","user_id":"i6U_AQu775Kesbf_5nDPxw","business_id":"BFHT_QKVr92x_WGyES3UKA","stars":5,"date":"2017-08-15","text":"Great escape room! My friends and I have done a couple different escape rooms, and this is by far one of our favorites.  The staff and props are amazing, and it's a great atmosphere.  Definitely felt the suspense when doing it.  Difficulty was up there and encourage people to check\nit out if you're in the area.","useful":1,"funny":0,"cool":1},
{"review_id":"wPvrm82oyz4DxTvA2y9KJQ","user_id":"oD5iqt74k0TwCVRwYZ9ERg","business_id":"p2RjZF7OWxZn0ZXxFpUbZg","stars":5,"date":"2015-05-17","text":"Best place ever for a pedicure. Ask for Holly she is so good. Very friendly place. Very clean. And best prices out there!","useful":0,"funny":0,"cool":0},
{"review_id":"gniHQSlowD-e3hT98Lrgzg","user_id":"s6PK8o6u1URDzHyaodhIhw","business_id":"KskYqH1Bi7Z_61pH6Om8pg","stars":5,"date":"2013-04-15","text":"Attended an academic conference down the street from here and a friend managed to get us a reservation. Some of the best Thai food I've ever had (and that's saying a lot!). Curry was just amazingly sweet, salty, and hot; veggies were fresh and crisp; the rice was perfect! Word of this place spread like wildfire through the conference, and everyone who went raved about it. Hated Vegas. Hated it. But I'd go back in a heartbeat just to eat at Lotus of Siam again!","useful":1,"funny":0,"cool":0},
{"review_id":"vKUk8PDIX8nMgdSTZCX0HA","user_id":"ZdWZi8oPfC96pynrqz6paA","business_id":"d2CmpwYwHLKvgSiCei7vig","stars":4,"date":"2012-06-12","text":"One of the greatest sushi place I've been to.  Great service as well, the server was very helpful as my girlfriend is a beginner in sushi, he was on par with everything. \n\nThe food was delicious, clean, fresh and had great presentation.   It is on the pricey side of the sushi life but it's worth it if your going to fine dine for the night.","useful":0,"funny":0,"cool":0},
{"review_id":"kJhtqpznD_ai6QXJT8chcA","user_id":"ZdWZi8oPfC96pynrqz6paA","business_id":"8K5fQnv3YZIIhERyU82UBg","stars":4,"date":"2012-08-31","text":"This place.... \n\nLooks like a hole in the wall when you walking by and nothing big when you walk in either.\n\nBUT and i mean a BIG BUT, you order the Shawarma, potatoes with garlic sauce on'em and your in heaven.  I've had the grape leaves and they are delicious.\n\nFor a quick meal or wanting something good and consistent to eat this is a the place, because they're open late, the is great, and you know you wont be disappointed.","useful":3,"funny":1,"cool":0},
{"review_id":"F43NHpHFaLlhDjXUG5wifQ","user_id":"ZdWZi8oPfC96pynrqz6paA","business_id":"0ejSp30s8AHL9xswgk-CIQ","stars":2,"date":"2012-08-31","text":"So I felt like Thai and decided to check out this place. \n\nI'm giving two stars because of the chunky peanut sauce which was delicious. \n\nWe order pad thai and fresh veggie spring rolls.  Now I've never had tofu in the rolls so I was surprised for a minute but didn't phase me when I was examining it.... then I took a bite and there was this taste that I couldn't not shake.\n\nI started taking out all the tofu because it was unbearable and I'm not a huge fussy guy but I couldn't take it at all, like the taste was just bad.... real bad! \n\nThe pad thai came and I could smell the tofu, THAT tofu before to taste it and I was like 'maybe I'm imagining things'. So I took a bite and there it was BAM in my mouth. \n\nI literally took 2 bites and asked for the bill because 'that taste was all up in there'.  Never tasted tofu like that before and I actually thought tofu was tasteless... Guess not*\n\nService was good and fast and the chunky peanut sauce was great.  Hope others have a better experience.","useful":1,"funny":2,"cool":0},
{"review_id":"R3fCrlLi0hqdUyWCTzQJ3g","user_id":"xRwgS-7HYuV94rfZLsRh2A","business_id":"X2f2s37_cFKo4xpzGFqk1w","stars":3,"date":"2015-09-26","text":"Food was overall decent. Lots of selection. Seemed to be fresh. $18.59 per adult and BEWARE: they charge for drinks AND each refill separately including the hot tea!! I've never seen anyone do that until now. I'm not sure we will be back...","useful":4,"funny":0,"cool":0},
{"review_id":"q5NKciPr_YShxMix-vQEJw","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"BKLWat64KRYzsT2DgY6Xxg","stars":5,"date":"2011-06-03","text":"Good custard.  They can make about anything.  Service is fast although it's a popular place so there is usually a line.","useful":0,"funny":0,"cool":0},
{"review_id":"KguAtlNrJAv5qasQ-aMGCg","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"iLPBZ_ic0LyiviqfXbkjwg","stars":3,"date":"2011-08-19","text":"Saw this on internet as Champaign's best bar, which, after being there, is very surprising.  \n\nFood is fine and typical.  Beer is reasonably priced and typical.  Service was good.  Lots of small TVs, tuned to Cubs\/Cards game.  We walked in as first timers and didn't feel like everyone was gawking at the new people, but we also felt like the only two under 50 (or 60).\n\nPlenty of parking & seating which we didn't know until we found a spot crammed in between many others... there is another room full of seating.\n\nEverything about this place is \"fine\".  Nothing will stand out as unusual or great, but we would definitely go back if in the neighborhood again.","useful":2,"funny":0,"cool":0},
{"review_id":"0koT5-dHBsgGVlKfpye5-Q","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"aLdMqYoHqc77JjOybdPX-A","stars":3,"date":"2011-06-03","text":"Food is hit or miss, as is the staff in the downstairs part of the restaurant.  Once they recognize you, they are friendlier.  Staff upstairs at the bar is helpful and friendly.  Best \"bar\" in Mahomet.","useful":3,"funny":2,"cool":0},
{"review_id":"hKUmmQfOR-DOA2xcb_9ZEQ","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"SiJ8eALRBJvrLnY5PDj9bA","stars":1,"date":"2011-05-11","text":"I called this company.  They were friendly & scheduled an assessment with us.  I took the day off of work to meet them only to have them not show up.  When I called to find out where they were, they said their corporate office was down so they \"lost\" all their appointments.  We rescheduled and my husband took the day off only to have a 2nd no show.  They then sent us an email thanking us for our business.  The experience was very disorganized, and I wouldn't rely on them to actually show up!  No thanks....","useful":6,"funny":1,"cool":0},
{"review_id":"dnnGUAxTys0pdhVV0kdAJw","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"lWmDrnqgU6w3gFaJyn_1Uw","stars":4,"date":"2011-06-20","text":"Service was a little slow but great food and an interesting atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"5ka6dGO7f2epllQXo3YGvg","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"4zW4FCsIk-84Yq49iXVuxA","stars":4,"date":"2011-07-09","text":"I've had various procedures done here.  Staff & Dr Kurley are professional and knowledgeable.  I definitely recommend them.","useful":2,"funny":0,"cool":0},
{"review_id":"hggQtvBbYOceg9rZ2S1VUQ","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"kNtToQSP_Y5U8tznLXuCaw","stars":4,"date":"2011-06-03","text":"Hard to find unless you know where it is (mysterious sounding, I know).  Staff is friendly.  Large selection of alcoholic beverages.  Good food.  Good prices.  Stop by if you get the chance.","useful":0,"funny":0,"cool":0},
{"review_id":"VxXdbAtUTKwqpkb5mCcioQ","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"Z7lIfcYVn1Ia5exVoSiNIw","stars":4,"date":"2011-07-23","text":"I've had 2 tattoos done and a nose piercing.   \n\nWhat I like:  the music isn't heavy metal screaming, the staff isn't scary looking as in many tattoo studios, Jason Shanks does excellent tattoos & the nose piercing was uneventful & fast. The place is clean with a small but well done waiting area. \n\nWhat I didn't like: the tattoo tables are not private at all, so the general public can walk in & watch, the staff won't remember you if you do repeat business, and they take awhile to warm up.  Jason isnt in a hurry to draw up pictures and get back with you, and you do have to push him to do his best work. \n\nHaving said that, a tattoo is a big deal, he does excellent work, we had a great time once we agreed on a design, and I would definitely go back.  Price is reasonable for the quality of work, parking can be difficult, and they tend to be busy but they are within walking distance of many restaurants & bars.  I suggest making an appointment.  Overall a very good experience!","useful":3,"funny":0,"cool":0},
{"review_id":"VjCJMNPujT6QVyENyyt2sQ","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"M8G8S2takaE_NOVutGzEkg","stars":4,"date":"2011-08-07","text":"I've been attending summer concerts here for a few years.  They are generally pretty good with a low cover charge.  They have a small dance stage too.  There is plenty of seating if you arrive 20-30 minutes early.  Otherwise bring your own lawn chair or blanket.  Definitely bring bug spray.\n\nThey have a good selection of whites, reds, blush, and dessert wines as well as beer and snack foods.  If you buy wine glasses, you can bring them back on future visits to save a few bucks.\n\nThe only negative for me, and it's really not their fault, but a lot of people bring their kids like it's free child-care.  If you can get past that, you'll have a good experience.","useful":2,"funny":0,"cool":0},
{"review_id":"9evemYPPdmfQg5W-5Tsz-w","user_id":"bXDevfvrY8rvCnJhFuL4LA","business_id":"mN-TD6HoQMqT1PhXkBLj1g","stars":4,"date":"2011-08-07","text":"Pretty 18-hole course with many trees, ponds, flowers, and occasional deer.\n\nTypically a beverage cart, but inquire before you head to the course because they have beverage coolers to loan if not.  Small snack selection but hot dogs are good.\n\nRestrooms on the course are better than most.  I don't love the pro shop.  It smells old but is adequate for the amount of time spent there.\n\nStaff is generally friendly enough, and we don't usually get backed up.","useful":1,"funny":0,"cool":0},
{"review_id":"8stih3wUw0w_gJQH0n3A-Q","user_id":"afxk7-m8asGx-VMtbQkvhw","business_id":"Y-hmtitiRfg7vmc3N-lTww","stars":5,"date":"2016-05-13","text":"I've been on a quest to find real pizza in the Phoenix\/Scottsdale area after relocating from Chicago where there are real Italians making real pizza (mostly Naples-style - Nella, Eataly, Spaca Napoli). After visiting 10-15 pizzerie in Arizona, purporting to make Italian-style pizza, I began to think that nobody understands that more ingredients does not mean a better pizza. Finally, I stumble upon Sapori D'Italia.  I ordered the margherita (the standard by which I rate all pizza), and it was made correctly (not slices of tomato or multiple cheeses).  Everything is made fresh in house. The tomato sauce was simple, not sugary.  The dough was simple and fresh. Likewise, the mozzarella was fresh (I was told it's made in house). I can't count the number of places I've gone that insist they use fresh mozzarella, only to see shredded goo appear on my pizza.  Sapori d'Italia makes a solid pizza.\n\nThe wine list is simple, but will do the job.  Service is great - everyone was very kind and appropriately attentive.  If you sit outside, there's a gorgeous view.  The location is not convenient unless you live in Fountain Hills, but if you care about pizza and quality ingredients, this is well worth the trek. To top it off, the prices are very reasonable.  I'm really happy to have found Sapori d'Italia.  I highly recommend it!","useful":0,"funny":0,"cool":0},
{"review_id":"G4jZUzC5DntjSEX0qs6UvQ","user_id":"yW39UP7RhTKEDrkzIz93Mg","business_id":"cX5rhKVzGFkFMMPWrFBmjQ","stars":5,"date":"2017-11-09","text":"We have been using Davenport Diesel for a couple of years now, and we have been happy with them. I am surprised by some of the reviews posted here. Steve has always been professional to us, and he is knowledgeable too. We have multiple trucks in our fleet and I have an invoice on my desk I am getting ready to pay right now. I would recommend Steve at Davenport. \nMike Riggs General Manager Progressive Hardscapes.","useful":0,"funny":0,"cool":0},
{"review_id":"dh797dUxVNDCx9YH5Z0O6A","user_id":"c4oMZX8buOpr5xTOT5QrEA","business_id":"lSjT5OtSWm0IwOcFwHQR4g","stars":5,"date":"2017-10-07","text":"Normally no one in my family likes going to the dentist. That has changed since we've started coming to Smile Shop Dental. Dr. Grace & her staff are awesome!","useful":5,"funny":0,"cool":0},
{"review_id":"gQ-w5S6Ag0zkY40amBCyAg","user_id":"c4oMZX8buOpr5xTOT5QrEA","business_id":"tWjFg2E9ztJt_LuLUDOJKQ","stars":5,"date":"2017-10-07","text":"So glad we found Dunham Jiu Jitsu for our 2 boys! They have been coming here for 5 months now & absolutely love it. Evan & the coaches are awesome! It's a great positive environment to train & learn. The coaches & team mates are always helpful & encouraging.","useful":0,"funny":0,"cool":0},
{"review_id":"JYsyUkbWAwoPZg4xigDJ7A","user_id":"c4oMZX8buOpr5xTOT5QrEA","business_id":"Rl6NhS6S-Vv-HuGlQUVvRQ","stars":5,"date":"2017-10-07","text":"I've been having a hard time finding someone that can really do my hair right after I moved here to Las Vegas. I'm so glad I gave it a try here & found Jacquie! She is amazing! She did wonders to my hair & I LOVE it! My hair is beautiful again!","useful":0,"funny":0,"cool":0},
{"review_id":"UsnZveUaiA5MjU9_ewHcvw","user_id":"36f-SO89NLLEeNU-gUA_UQ","business_id":"5KheTjYPu1HcQzQFtm4_vw","stars":5,"date":"2014-04-12","text":"If you love spicy food this is the place for you. I always feel like a get great service everytime I come. I bring my family often because We always enjoys the food, spirits, and service.","useful":0,"funny":0,"cool":0},
{"review_id":"mggecIqSuPR6CXx26TtV8w","user_id":"36f-SO89NLLEeNU-gUA_UQ","business_id":"k1QpHAkzKTrFYfk6u--VgQ","stars":2,"date":"2014-04-12","text":"Honestly this place is over rated. It has a atmosphere but the pizza is not a good as everyone says it it. The pizza looks cool, and have cool options to choose from, but the pizza it self is just OKAY. I might go back if I get invited but I would not suggest this place.","useful":0,"funny":0,"cool":0},
{"review_id":"ydTiJvh1efePUjmXPCAikg","user_id":"IcYZsQfZJa2gJ-QhNSKkug","business_id":"YohEZMYpKrf-3fyPASKLew","stars":1,"date":"2016-03-11","text":"Tonight I went to Texas Roadhouse for dinner, I was extremely excited because this is one of my favorite places to eat. Unfortunately the experience wasn't great. When we were seated we were told they would bring us bread when it was ready, they didn't. My salad came out at least 10 minutes before our appetizer. When our food came out (we still haven't received  our bread)  and the plate did not look appetizing. My pulled pork looked like it was the scraps and there was zero bbq sauce on it. It was so dry. Not once did they ask how the food was or bus the table. When we left out table had every single plate from appetizer to salad bowl. I was very disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"mVrlS6EyJ61k4Fbxv0FWQQ","user_id":"IcYZsQfZJa2gJ-QhNSKkug","business_id":"HNDvt2Q3dRod2Ea12B1FIQ","stars":5,"date":"2016-07-07","text":"The staff is so friendly and I am always pleased when I leave. Tracy has done my nails the last 3 times, remembered my name and where I work. Their hard work  definitely  doesn't go unnoticed!","useful":0,"funny":0,"cool":1},
{"review_id":"tn7DLzyVrU06NYRghbdglA","user_id":"aJtHf7TD4RMVYtGDET-mUA","business_id":"caoxjCw1qg2zoT3LHU9-hw","stars":5,"date":"2017-06-18","text":"The Spa's absolutely awesome I had a Swedish massage today by Carl. It was probably one of the best massages I have ever had! The front desk is incredible with customer service and Friendly Smiles.  From Dominique, Julie, Malayet, and Lucia.  Must to visit.  They also have a steam room and a Jacuzzi","useful":0,"funny":0,"cool":0},
{"review_id":"o502H4mRmqwxOL_9mYiaiw","user_id":"aJtHf7TD4RMVYtGDET-mUA","business_id":"YRiQtFNteLUUEiGkdQ23vg","stars":5,"date":"2017-06-18","text":"I love this restaurant! It's probably the best restaurant in the hotel! Incredible ribs.  The service was off the chart. We sat at the bar and we were served by Cooper. He made sure we received top customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"c9YWTbOxQ7Ag3JWImy33qg","user_id":"aJtHf7TD4RMVYtGDET-mUA","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":2,"date":"2017-06-18","text":"I really wish I could give this hotel a higher rating. But I can't. The hotel itself definitely needs to be renovated!! When you walk in you can feel the casino is Rundown! The carpets are old the decor is old. When you get to your room it's also very disappointing because the carpets are old and the smell of the room is dirty and stingy. The paint is chipping the walls are dirty the floors are stained. As for the customer service it is hit or miss!! I called earlier to ensure I got a room close to the elevator due to my last experience here! The casino host on duty at first was not very friendly and had told me that the hotel was booked and that he could do nothing except put in a request. I was pleasantly surprised when I arrived that I had a room close to the elevator. As far as getting beverage service while you're gambling the casino is completely dead on one side and a completely active on the other. The dead side which has a lot of good slot machines has absolutely no beverage service and if you ask for it they'll tell you there's only one person on duty on a Saturday. The beverage server Katie started off really slow but once I complained she was kind enough to provide excellent service.  There aren't many places to eat in the hotel and they all close really early so does room service so good luck trying to find food in a town that supposed to be up 24 hours","useful":1,"funny":1,"cool":0},
{"review_id":"EmDLPNJ1ncMwJBiaqxjaVA","user_id":"h6tR9uEx2GGBXAjr5krGLA","business_id":"eMZCjoaksEf_sXrmCOB5uA","stars":5,"date":"2016-04-10","text":"I like it, gray often good, let us enjoy a comfortable treatment. The most authentic massage!","useful":0,"funny":0,"cool":0},
{"review_id":"j-7MfxMtqm6JlLTGU29XMA","user_id":"nvRxRsiyCGn2wfWQukqv0A","business_id":"PyyX75wUFofw0aBTzavPUw","stars":1,"date":"2011-04-07","text":"Make sure if you bring your car to them that you leave with the old parts and know about car repairs. I brought my car in for front brakes and after $179.00 later my brakes were never touched. I had to bring my car in to another mechanic who says they were never replaced and showed me the parts (which I kept). Don't get ripped off!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"sMfyR8szRmz5ubX4Vi34uQ","user_id":"e4CgDwJdqRowpoaUBmKjGA","business_id":"O-uIEuv7JLUHajkemx_sVw","stars":5,"date":"2013-08-05","text":"Damn good beer and the food is top notch as well.  Our bartender, I think his name was David, was phenomenal.  Next time I'm in Tdot I'm there.","useful":0,"funny":0,"cool":0},
{"review_id":"LG_2ssn_2MEjQGiTZFcsMg","user_id":"VmXH_K-NolJHUKaFtC9fKA","business_id":"u1mTfh7D4hh4V6fIhiQRWw","stars":5,"date":"2017-01-11","text":"London is absolutely amazing and super talented. She always does an excellent job with my eyebrows and they come out perfectly! \nVery nice and clean salon environment.","useful":2,"funny":0,"cool":0},
{"review_id":"2BRkl6wVAdI1n5-wijuQsA","user_id":"VmXH_K-NolJHUKaFtC9fKA","business_id":"-EmzCq1b_diV2e8HJilTlQ","stars":5,"date":"2017-01-11","text":"Abby is a wizard! She is talented, knowledgeable and loving. She truly cares about your skin and wants to help improve it. She did an amazing job with my skin so far and I am so grateful. I highly recommend anyone seeking improvement in their skin to go to her. She will educate you and do wonders on your skin.","useful":0,"funny":0,"cool":0},
{"review_id":"MCa70C1tzfBe2bhT76mOfA","user_id":"VmXH_K-NolJHUKaFtC9fKA","business_id":"RK2BzLXCIRLsIblJEK6R1w","stars":5,"date":"2016-01-10","text":"Abby is absolutely AMAAAAZINGGGG!!!!!!!! I am speechless when it comes to her and how much of a difference she has caused in my skin, but I will try my best to put it into words. So of course I tried a million things and had been struggling to get clear radiant glowing skin. And let's just say Abby was the answer to my prayers. She is a wizard! When I went to her she immediately began to educate me and tell me all about her process. She explained everything thoroughly and clearly and I was on the road to having awesome skin. She really truly cares and gives me so much of her time. I love her. I Have had three treatments so far and will be continuing to have more. She got me started on Oxygenetix which has been a total game changer in my life. I had been looking for a good foundation that doesn't clog my pores and is good for my skin. And Oxygenetix is the BEST thing EVER! I went to visit my family after having only two treatments and they all noticed a huge difference in my skin. I was so thrilled by their reaction ( it was a huge boost to my self-esteem) and I am ever so grateful to have Abby's services. My husband is also loving the results I recommend Abby to anyone who is not happy in their skin and wants to have healthy glowing skin. She is an incredible person and really knows how to get good lasting results. She shares a lot of information and spends a lot of time with my skin. She's all about helping from inside out and figuring out what the root cause is of the problem. Anyone having problems with their skin should go see Abby immediately because she will definitely help you!  I'm so happy in my skin it's unbelievable.","useful":1,"funny":0,"cool":1},
{"review_id":"iOPcNzHbsx_SzeG2VhnPDA","user_id":"BXLA2bTNirM-xZBbg6GI8Q","business_id":"XvrweCwu7SurjLMw-ZoIOg","stars":5,"date":"2015-12-04","text":"Best Fresh fish in Richmond Hill.  Do yourself a favor and buy your fish here and not a grocery store.  \nI've had organic salmon, Arctic char, local trout...never been disappointed. \n\nRyan is great and you can see he understands customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"V8zoE1AoyGkHo8GEaIq-oA","user_id":"BXLA2bTNirM-xZBbg6GI8Q","business_id":"nBl_4gw5ecGzNkHyzfii8g","stars":4,"date":"2016-11-24","text":"Still one of the best places for pizza. Consistent quality and service.  I don't usually order pasta because I'm extra picky, but they know how to cook pasta.  Al dente and delicious. \nThey are always busy for a reason.","useful":0,"funny":0,"cool":0},
{"review_id":"dxGyfzxo0-BnDisY4yUmIQ","user_id":"BXLA2bTNirM-xZBbg6GI8Q","business_id":"OiE0TLzbEATzIW8CbGWigA","stars":2,"date":"2016-11-29","text":"Well let's just say I'm not crazy about places that make me write my own order.  So didn't start off right. \nDuck was alright, bones were not removed. Chicken dish was also full of bones on every mouthful.  The small little bones that are very annoying. Broccoli was good and shrimp very tasty. \nService almost non existent. \nWon't return.","useful":0,"funny":0,"cool":0},
{"review_id":"LLIGq1nVHlSy-MOinBZ08w","user_id":"BXLA2bTNirM-xZBbg6GI8Q","business_id":"rqcywYqnyBoe_0NkgkqhYw","stars":5,"date":"2015-08-06","text":"Ate here two times now and food has been excellent.  I've tried the roti and the jerk chicken.  Both were very good and tasted authentic. \nOwner was playing some nice tunes the day I was there which created a nice Caribbean atmosphere. This place would be even better if it had a patio to enjoy the beautiful summer weather. \nCan't wait to come back and try rest of menu!","useful":0,"funny":0,"cool":1},
{"review_id":"_3Qf2Axm3dEATtHvnP1y2w","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"nK0oLUifkOkzuzwHO364fQ","stars":4,"date":"2014-04-02","text":"Simple unassuming and great! Been here four times an it's always the simple sushi fresh and served with a smile. And it's very well priced. One note crunchy roles = special Kay cereal sprinkled on top.","useful":0,"funny":0,"cool":0},
{"review_id":"bumk530Nnb0SlgdX7ufzRQ","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"bLKfQ1j99Qt2NpNyD3Fy1g","stars":4,"date":"2014-04-02","text":"The lunch special is always a winner. I frequent this place monthly. It's small so come early. The service is unique and appropriate. Don't expect a whole lot but smiles and the basics and you'll be pleasantly surprised with your experience. Recommend for lunch and a unique experience with great food.","useful":0,"funny":0,"cool":0},
{"review_id":"3aV_GkMadBa145so2NSAjA","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"mr-w96_vgHpfLmQtfFkkXw","stars":5,"date":"2014-06-09","text":"Absolutely the best Vietnamese food in DT Calgary. Always friendly, consistent and quick. We love #19 as the pork is amazing and the spring roles are always fresh. We also enjoy the salad roles as a starter. I would highly recommend this place and it's other locations. Great for a staff team or for two. You won't be disappointed.","useful":2,"funny":0,"cool":0},
{"review_id":"hzhwgFHDwZT82x9j5k2wfg","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"8E_EuXDOFmwGLbDVwkO21g","stars":4,"date":"2014-07-30","text":"Had a wonderful lunch sitting on the patio on a hot July day. The interior and patio decor are appropriate and fun. The patio has an out of this city feel. You do not know your sitting in a parking lot next to MEC. I had the tuna and it was served very quickly. The meal was very nice and for some maybe perfect but I am more picky and would give it an 8 out of 10. I would have use a bit more flavour in the side veggies. The tuna was very nice although I have had better. Maybe a little over cooked or not as fresh. Hey your in Calgary how fresh can it be. The service was top notch and our server was informed, happy and attentive. The price was as I would have expected for DT Calgary. I would come again and next time for dinner. I recommend you give it a try and bring a date. Even a first date would be nice.","useful":0,"funny":0,"cool":0},
{"review_id":"wGVZ-Vw4vFTaddvxbIZ8UA","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"_3V2JcCf2yVM_ygKJ0gIAQ","stars":1,"date":"2014-06-13","text":"We frequented this place in the early 2000's but got away from it as we moved away from the downtown. Seems everyone stopped going. We went on a Saturday night at 5:30 and was one of two tables there. Should have walked out when we had the chance. The place has the same decor and it's suffering from a need of a make over. The food was fine but you make your own so you can only blame yourself. I will note that the pineapple had no flavour so there is one product they could get fresher. I will note that my food had a funny after taste and I can't place blame as I am not am sure of the cause? The grill? The cook? A sauce that was odd? Don't know. I will say we won't be back.  I would not waste your time either it's not the same place we loved 12 years ago. Head to the great Thai place 2 blocks west on 11th. It's worth the walk over.","useful":0,"funny":0,"cool":1},
{"review_id":"nfrPve0Q3yqd30Hft5roww","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"mgQGkdI-qpj7ugWD0Q2LpA","stars":4,"date":"2014-08-04","text":"Always a pleasure to dine at Tango. Tonight we had everything with goat cheese and even asked the kitchen to create a new dish   for us. Well we just added goat cheese to a flat bread. Everything was delicious especially the beet fries. They were extra tasty tonight. Our server Kelly was very attentive and lovely. Tango is a great choice for first dates and an evening out with friends . The meal share program is a wonderful idea. Buy a meal for you and a meal is donated. The decor is kind of modern in the bar area and kind of rustic in the dinning area. Either way it works and you feel good eating there. Give a try you won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"kAcMnIHFvaGOwVPtkhnFgg","user_id":"2QKrkvb7NKqek2yg2K-5Xw","business_id":"OjhbiFVBhdQTgdGCLWGTDg","stars":2,"date":"2014-04-01","text":"Yep it's a neighbour hood pub. The day we were in they had no staff on one cook\/manager and one bartender\/waitress\/slot machine attendant. The food was typical for this establishment. Your not going here unless your buddies are meeting for drinks. Not a place for a good meal.","useful":1,"funny":0,"cool":0},
{"review_id":"QnAkxSOnCRgEWJVjp7TmmQ","user_id":"30bL_4wHVWmC38KvXOFQ1Q","business_id":"eNQHcdSomzl4KyIlgN2zTg","stars":1,"date":"2011-06-03","text":"I've been coming here sporadically since I turned 21 4 years ago and can't say I've ever been completely impressed with the place, but the early (9PM) drag shows on Friday and Saturday are a nice alternative if you want to go out for a few drinks and entertainment but have to be up early the next day.\n\nThe past few times we've been there have just been terrible.  I must say, my boyfriend and I like to gamble for drinks.  We're not jerks about it, but if I put $20 in a machine, I generally expect to get at least 1 free drink.  The last time we were in it took at least 10 minutes to get a bartender to come over to serve us (on a slow night when he was just wandering around doing nothing).  In that time, my boyfriend had lost probably $10 of his $20 that he put in.  By the time we ordered our drinks, the bartender immediately informed us that he could comp our drinks if we played 5 credits (they ALWAYS make it a point to tell you that).  Ok, I understand that, but more often than not I'd rather lose my money slowly and enjoy the entertainment instead of losing it all in 2 minutes, so I don't mind paying for the beer.  However, my boyfriend was playing 5 credits, won a little and made it back up to $30, lost $10 again and decided to cash out at $20 where he started.  This is after at least 20 minutes of playing.  \n\nThe bartender told us that \"It doesn't work that way\" and \"you can't just put in $20 and then cash out $20 and expect a comped drink\".  Apparently the only way to get a comped drink is to LOSE all your money...\n\nBesides that, the drag show brings in great guest performers but the regular cast is pretty terrible, ESPECIALLY the host Shawn M.  The music isn't terrible and the drinks are cheap, but I wouldn't go if you're not into being treated like dirt by the staff.  \n\nPretty much any other option in the Fruit Loop is better than this hell hole.  We will never be back.","useful":1,"funny":0,"cool":0},
{"review_id":"6VlcIQbXXHJtUXj1FP-sZw","user_id":"30bL_4wHVWmC38KvXOFQ1Q","business_id":"82YGtjc5KKikNiqBZ33qzw","stars":4,"date":"2011-04-13","text":"First of all, I have to say my only reason for giving a 4-star rating is because I haven't been to many other authentic izakaya style restaurants in Vegas so I don't have many to compare it to.  However, I'm a huge fan of sushi and have had a few very authentic home-cooked Japanese meals, and based on what I know from these experiences, Kyara was a pleasant surprise!  It's so unfortunate that it has gotten a few poor reviews so early because they really almost kept us from checking it out.  The bottom line is, the food was great, the atmosphere was clean and comfortable, and the price-point is great!  Do yourself a favor a give Kyara a try.  Personally I can't wait to go back for more!","useful":2,"funny":0,"cool":1},
{"review_id":"TFpsLgb9AD4T6xLLPUEkqw","user_id":"W-6Gw32ejK_B_N8_o5Masw","business_id":"mkE6CyBgfeCG9GFL7zSOYg","stars":3,"date":"2015-02-20","text":"It's likely one of the most fashionable and stylish stores in this city but it's one level. They carry hardly any of the stock you'd see in other stores (Vancouver, San Francisco, NYC), no j brand jeans no nightgowns, the sale section looked rummaged through like a herd of Walmart tramplers had been grazing). It needs to expand!! Get more stock, expand,Calgary shoppers want a good store! This doesn't do Anthro justice. After fighting chinook traffic for a half hour to get a parking spot (middle of the day), I was pretty disappointed at the waste of time.","useful":0,"funny":0,"cool":0},
{"review_id":"ApqJru4FwZEPq2kBWjexoA","user_id":"0myB8TMYSQE4CH0L6UoLLw","business_id":"riFzCvp77DMKDX-5GoTpqA","stars":3,"date":"2014-12-22","text":"Good food and concept but if you want diabetes type 1 go ahead and order one of their shakes too much sugar sorry...","useful":0,"funny":0,"cool":0},
{"review_id":"ga7BHk_-L6XyNhPE7gsT3A","user_id":"QUfHFbe9fG_gsN2yPvPxyw","business_id":"eAydZhKjvFK0-6_7ykjLYg","stars":5,"date":"2017-03-02","text":"They're sweet people trying their best , I went for a nail design on top of my existing acrylics( they don't do acrylics it's just that my previous shellac manni got ruined) It turned out super cute. Worth a visit , don't let the 1 star review scare you. I know I did.","useful":0,"funny":0,"cool":0},
{"review_id":"CGIdWbgKbmHkIYCTM7Lnqg","user_id":"QUfHFbe9fG_gsN2yPvPxyw","business_id":"Nxg73OigmRQQq0d1pKtkUQ","stars":5,"date":"2015-08-14","text":"Great affordable food and beers and great music. Only down side is the customer service but once you become a regular you won't need to deal with that since they'll be accustomed to your face .","useful":0,"funny":0,"cool":0},
{"review_id":"mddI9jHax7ryMqbzYXrnxw","user_id":"QUfHFbe9fG_gsN2yPvPxyw","business_id":"YbCtyhwWljsfT9tuYwVIZw","stars":5,"date":"2016-09-09","text":"Phenomenal , he goes above and beyond. I went in to get my hard drive for my MacBook replaced and was given the most reasonable price by Calvin. He got it fixed much quicker than anticipated and even took care of a few other issues. Would definitely go again and recommend him to anyone.","useful":1,"funny":0,"cool":0},
{"review_id":"MPH-SB7LPpQjzcEjTGXzKw","user_id":"QUfHFbe9fG_gsN2yPvPxyw","business_id":"0Ul_eedbOO0EBvehwgCR1g","stars":1,"date":"2017-06-02","text":"The worse food and service. Ordered online and some of my food was missing. I wish I could say that the food that was there was even edible . They had the nerve to tell me they couldn't deliver the missing items to me.","useful":0,"funny":0,"cool":0},
{"review_id":"CxqBBfUTCyAq6TadXpSvyw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"VLDFjeqpUgWhnVuB_8GuEg","stars":5,"date":"2013-08-21","text":"I stopped in here for Breakfast on a Sunday while waiting for training at the Apple store close by. I sat at the bar and was very impressed with the staff and how helpful and friendly they were. I ordered the Breakfast scramble and added kale it was delicious!! Its great to know that healthy dosent have to mean bad taste. They let me sample a juice drink Kaleaid and will be getting that next time!!","useful":0,"funny":0,"cool":0},
{"review_id":"3-z2yY2DDgv92siH6WGrzg","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"thlAnPN1ApoNxSnok_fcvA","stars":5,"date":"2014-06-23","text":"This place is a great place for a family Breakfast. The atmosphere is down home with carved bears and a lodge look to it. We were seated quickly and the service was great with a friendly waitress.I had the California Omelet and it was ver good and fresh tasting with the avocado on top. My Grandaughter Had the Chicken fried steak and loved it and the portions are large. The prices are very reasonable and I will be definitely going back.","useful":0,"funny":0,"cool":1},
{"review_id":"5CiCh16iYLM1M5Ajn6HKNw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"JIETwXSEGIHMNyxZVEnNKQ","stars":4,"date":"2013-11-16","text":"I really like this place for a quick business healthy lunch!! The service was friendly and quick. I had the chicken protein bowl and was very tasty! We sat at outdoor patio and was nice.","useful":1,"funny":0,"cool":0},
{"review_id":"mrcCnhyMuNQQa9eLh_m4vw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"5ZkBnLjuedyk5rRRT6W5cg","stars":1,"date":"2013-07-07","text":"We came here for dinner and had the Shrimp Tempura which was horrible. We sat in the dining section and the atmosphere is very nice but our meal for 18 Dollars was very lacking in quality and flavor!  We told the server and he made no effort to correct the situation so we will not be back!","useful":4,"funny":0,"cool":1},
{"review_id":"57niVl5jGWwxz6PJqekeuw","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"uxSL4FHWiO-fr2iae_d3Bw","stars":4,"date":"2014-01-08","text":"We went here New years Eve and had a great dinner. The service was excellent and my Lemon scallops and chicken Lettuce wraps were amazing.I highly recommend this place for lunch or dinner.","useful":2,"funny":0,"cool":1},
{"review_id":"lQ9nN9lBUwpY3B2SuzOvcA","user_id":"HlHXBTao9GHJv4MwrVrCEQ","business_id":"70WDApYtMcLlrnb1EUW6fg","stars":4,"date":"2015-12-16","text":"We came here for dinner and we loved the atmosphere. The bartender was nice and made us non alcoholic drinks which were very good I  had the Pomegrante mojito very tasty. We had the beet salad which was good and the lobster tacos which were an appetizer and very good.","useful":1,"funny":0,"cool":0}]