[{"review_id":"5PoQPjlyZkt6-jh3PYzGaA","user_id":"gmTKOVCMCRVCXieituspvg","business_id":"eAc9Vd6loOgRQolMXQt6FA","stars":5,"date":"2017-09-24","text":"I was here at Mandalay Bay in March 2017,I am a gold card member so rooms and parking   was free.Mandalay Bay is a nice hotel,for the right price.All of Las Vegas is over priced,so if you can become a card member where ever you stay in Las Vegas,you will save a lot of money.All of Vegas will try to get your money!! So if you can get rooms, parking, food or anything else for free get it.Or you Will not like Vegas to much.I will be back at Mandalay Bay 11\/03\/2017 for 3 nights.Take What They Give You!!","useful":0,"funny":0,"cool":0},
{"review_id":"QysZZu6gxg9dxVGrrbrZTw","user_id":"pg3SHdmIOtwUNBRvDtHngQ","business_id":"dNYgMK4m8z13eAzMoyg3WQ","stars":4,"date":"2017-06-25","text":"Petros is a great addition to the neighbourhood. The food was delicious and  the staff was very friendly. The octopus is excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"Kxn422LhzHCNvv1xaWYytQ","user_id":"pg3SHdmIOtwUNBRvDtHngQ","business_id":"x4cCFdLMKOudfIyxOMtUJA","stars":5,"date":"2016-06-22","text":"I love this spot! Amazing and creative pizzas and great people! The owner is constantly checking on his patrons. After going there twice, he recognizes me and comes over to say hi every time.","useful":0,"funny":0,"cool":0},
{"review_id":"AeDE69Jol4jjtTTgD9wdjA","user_id":"pg3SHdmIOtwUNBRvDtHngQ","business_id":"FFy9dIwiajcxA3gaDn6AeA","stars":4,"date":"2016-06-22","text":"This is a great neighbourhood restaurant. The staff is super friendly. The food is excellent! I've eaten at Central many times and I have never had a bad experience. Try the Gazpacho this summer. Amazing!","useful":0,"funny":0,"cool":1},
{"review_id":"TMk9iNTXRMwFt_Lfw_LiNA","user_id":"pg3SHdmIOtwUNBRvDtHngQ","business_id":"OwoVxn2cojh7WVMOu8euGQ","stars":5,"date":"2016-07-26","text":"This place is amazing! Everyone is super friendly and they go out of their way to help. I was out of town, my wife was looking after our baby, and we had a flat. (No CAA) I called and they said \"we'll see what we can do\". The next thing I know, my spare tire had been installed in my driveway and the guy they sent over gave my wife an update on what we needed to replace when we could find time to bring the car in.\n\nAmazing service, amazing products, amazing people.","useful":2,"funny":0,"cool":1},
{"review_id":"BYtxQBEqXXYpgVGn87eqWA","user_id":"KOpEA4riIjxElOyFgxIQwg","business_id":"64QldpwnBOWbv25w2wngmg","stars":1,"date":"2014-10-04","text":"Worst breakfast on the planet. We ordered 2 turkey bacon\/egg white\/cheese\/English muffin sandwiches. Fairly quick with the food. Cost was $25. English muffin was soaked and floppy with oil yet still burnt somehow. Egg was good. Very messy and not at all what I would have expected here at Encore.","useful":0,"funny":1,"cool":0},
{"review_id":"2qe6tSBSeDJ8J-WYtK-O9g","user_id":"gtyvUpkhjpeJEk2rGd0eTw","business_id":"v9EqcuA6eUvriLRwxbxQNw","stars":3,"date":"2016-02-16","text":"It looks like a great place to play yet the day we went the line to get in was super long. Don't think there was enough staff. The lines for the rides were long and bumper cars only had 4 of the 6 working. Felt like all we were doing was standing in lines.  The buffet was good. Nice choice of food and locations to eat within Amazing Jakes.","useful":0,"funny":0,"cool":0},
{"review_id":"o3odHnq-Cj26LNtmk9grPA","user_id":"jEKt9MNyxvmtvWvPrPVRZg","business_id":"rry0ESbBfS9s-acxsUVq_g","stars":5,"date":"2016-03-25","text":"Dave and his store could not be better. I'm always a little suspicious of somewhere with perfect reviews, but I experienced it myself. Making an appointment online was easy and the in-store experience was exceptional. \n\nForget all the other mall based jewelry stores, Dave's concept cuts out the middle men and high rent costs to give you the best price. He has the coolest software - you can actually see and design anything you can think of, common or unique, right while you're sitting there. Want to see the diamond you pick with a halo surround? Sure! Want to take it off and try side stones instead? No problem. No need for sketches, wax moulds or your imagination, you can see it in seconds and change it and customize it endlessly.\n\nWe were only in Vegas for the weekend so we couldn't buy right away, but that didn't change how Dave treated us - he was helpful, knowledgeable and friendly with no pressure. He genuinely wanted us to get what we wanted and for us to be happy. We'll be back. You won't find a better place to buy diamonds and jewelry in Las Vegas.\n\nThe worst part of buying a custom ring is hoping it looks like what you have in your head. With Dave, you don't need to guess. See the picture for the rendering you get to see right while you're sitting in his office.","useful":2,"funny":0,"cool":0},
{"review_id":"fIQVdAYMGQXxxARNbUTLRw","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"EHXEJ1eoK5oVw8iEdvIw0A","stars":2,"date":"2017-07-15","text":"Dec 8, 2017 - job was completed. My bathroom is stunning. I am happy with the final result. \nThe owner of the company has advised me that they have taken actions to resolve the problems that led to our project issues. \nJuly 14 - No one from NXS has done any work this entire week. Was told tonight next work scheduled for Jul 24! 2 weeks and 2 days and zero work done. \nJune 29 - no one on my job today.\nJune 28 - my front yard after everyone went home. Zero respect for our home.\nContracted in April with $17k deposit for an est 3 week masterbath remodel. Started May 30th with another $7k paid on Jun 1st. My floor tile selection wasn't ordered so I had to reselect something with quik delivery. My bathroom windows were not ordered until after the job started, even though we paid the large deposit partially to cover \"materials\"\nI bought my own finishes out of my pocket for vanities, faucets, and marble countertops. \nPictures with walls are yesterday. Pictures without walls were June 13th. Still need tile installed, shower glass and wall mirrors, all finishes installed, plumbing and electric hooked up. \nWill update at top as progress.","useful":7,"funny":1,"cool":1},
{"review_id":"lAKbkv3lVk-fbU2O35bAkg","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"zkdtRsV0WH0yT7QqR6kMug","stars":5,"date":"2013-05-31","text":"I had a kitchen remodel done through a Major Home store. Their prices were far to high for Granite Install so I looked elsewhere and found Accent Granite. I also got an estimate from another Fabricator that was far higher in cost. \n\nJason came to my home, arrived early for our appointment, which I was so happy about. Jason was professional and very easy to work with, answered my endless questions without any issue. Always available by phone and Text or promptly gets back to you. I hired them for the job and they picked up my Granite, I also had a very small Island piece I wanted to be different and they referred me to the perfect remnant place where I found what I needed and saved me a lot of money. My job was delayed 6 weeks due to my change in plans with the cabinets and Jason was very easy and had no issues with the delay and storing my Granite. \n\nMichael came to my house for templating and was very helpful and pleasant. \n\nMy install happened yesterday 5\/29\/13, the kitchen layout made it a difficult job, but thru the whole process the installer was very pleasant and professional. \n\nThe entire process was by far the easiest of the entire kitchen remodel. I couldn't be happier with the job they did for me. \n\nI'll definitely use them again for the bathroom remodel.","useful":4,"funny":0,"cool":2},
{"review_id":"UiG2S0OyxbrSqDVIt4pS_Q","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"mnqJVQhLcPHtpVx_6kbJuw","stars":5,"date":"2015-02-11","text":"Thanks to Joe for our 2nd Anniversary cake. He went out of his way to correct our issue and we're very please to update our review and recommend them.  It was delicious!","useful":3,"funny":0,"cool":0},
{"review_id":"m2qbqO5snOm3knyX1zS2ug","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"QvHybsk5_SnyEMD15izeeQ","stars":5,"date":"2014-02-02","text":"We were so happy to see a new restaurant close to home. We went 1st for lunch and then lunch a week later. Both times we loved the food. We thought it was interesting and different than the regular menu you find everywhere.  I'm a vegetarian and the waiter the 2nd visit was great and very helpful on recommending options for me. We'll be new regulars.","useful":0,"funny":0,"cool":1},
{"review_id":"OAt5DX4tPLjEvhMAC380OQ","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"5phloeENuy2durquOfOzKA","stars":1,"date":"2015-12-24","text":"$118?! For dry cleaning everyday clothes!!Run fast and far to another cleaner, any other cleaner! Sad to say I didn't check Yelp first and paid big time for it. $118 for 17 pieces, no silk, no beads, not leather, cotton, nylon, sweaters none wool. I could have replaced multiple pieces for far less.","useful":1,"funny":0,"cool":0},
{"review_id":"mDxbskF0KAZUICFU6Bo0MA","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"I02fZsl5otCPP1XRu0y40Q","stars":5,"date":"2012-11-15","text":"Jim arrived on time, explained all of my options and the service choices available to me in detail, very personable. My appointment with Jim was at 1pm and my alarm was installed by 4pm. Very impressed with the service and installation ease. Highly recommend.","useful":0,"funny":1,"cool":0},
{"review_id":"6IrpaUDTZqp8pTJLm2FOtA","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"c3lQY7bGBnOAncyYI0RcDw","stars":1,"date":"2016-01-02","text":"Wasted 6 months working with PepSolar only for them to show up the day of my install and say they couldn't install on the roof I have...which is standard clay tile all over AZ. Then they told me it would be an additional $8,000 charge for roof work! In addition to the $48,000. Run!","useful":5,"funny":1,"cool":0},
{"review_id":"xBjwTuBaTNXbzrhJkH7n3A","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"Euu79b2o5k5RZReIuThBWg","stars":4,"date":"2014-08-31","text":"Dinner was good. I had veggie enchiladas. Guacamole which was delicious.  1st time here since it just opened recently.  Which I think explains some of the negative reviews. Atmosphere is fun. Similar to Mexican benihana but you don't have to socialize with strangers.","useful":3,"funny":0,"cool":0},
{"review_id":"LKeikKOKBWabFVyWBEeL1w","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"veXwcExHJJIq70ECS-uk4Q","stars":1,"date":"2015-05-13","text":"If only you could leave zero stars.\nIt appears  the only people who like this place are the designers...hmmm?\nWe placed a $5k order in March. I was called in May by Marcia to tell me that the factory  didn't have enough material to finish  my banquettes  and that I'd have to choose  another material for just the seat cushions. When I said I'd only accept leather or cancel. I was told I'd have to pay for the increase cost and I couldn't cancel. \nI called back 15 mins later to cancel and was told by the manager that it was all a mistake and they have material  to finish?! That my items would be done in 10 days. \nIt's been at least 3 weeks and Marcia won't  return an email to schedule  delivery for May 19th almost  3 months since placing my order.  \nI called yesterday  and spoke with  Jennifer  who assured me she would call me right back regarding  my order status.\nNo call! \nSide note...their price was almost double what I bought  exact same coffee table for elsewhere.","useful":8,"funny":0,"cool":0},
{"review_id":"JpVpu5TZcDXf9fS78FgWRw","user_id":"SAEtASQiMRFvs7V384k3mA","business_id":"MtnhP6gh_bxWC1abA4KPQw","stars":5,"date":"2014-02-02","text":"We just completed our pool remodel with Dave Furman at Rondo Pools. I got estimates from 5 major pool builders in the valley before deciding on Rondo. We love our new pool! This was an average dollar project at $15k but we never felt our small job was less important than a big high dollar one. More importantly the process was the easiest remodel project (new kitchen,  floors,  & doors in a year) I've done to date on our home. I'm sure this is thanks to Dave and keeping the project on track. This is our seasonal home and I was concerned about monitoring this project from Chicago but it turned out quite easy to accomplish with Dave in constant contact with me and updates. I'd recommend Rondo pools to my friends.","useful":9,"funny":0,"cool":1},
{"review_id":"rpr5eWAd0K6_m-bIyFpIxA","user_id":"Fg51rJu_cD1ggx9Z1hoSVw","business_id":"u3JkMKLju8XF33tTunUMTA","stars":1,"date":"2012-12-28","text":"Don't waste your time. I made an appointment several weeks out for a Friday morning. I took off work, showed up this morning 20 minutes early, and the receptionist told me she was sorry but my appointment had been cancelled. I said I didn't understand. She said someone, couldn't tell me who or when, had called and spoken with someone, again, didn't say who, or when, or what number they called, and cancelled the appointment. I explained that no one spoke to me, and I wanted to know who they called, etc... she wouldn't tell me anything. She did apologize, and offered to get me in next week. They have so many doctors and NPs there, but she didn't offer any alternative to next week. She didn't escalate, and other than saying sorry, it seemed like this was a normal event for her. No sense of ownership, no caring, etc... I was hesitant to go, seeing all the other poor reviews this morning. After today, I won't ever be going back. There are many other alternatives in Chandler and Phoenix, so if you haven't gone before, don't waste your time. It isn't worth taking off work only to find they won't take the time to see you.","useful":2,"funny":0,"cool":0},
{"review_id":"pN9MVcbQ9w-uhdUFGYGFEw","user_id":"Fg51rJu_cD1ggx9Z1hoSVw","business_id":"p_uGLv1QXHBrwya6meztxw","stars":5,"date":"2013-01-03","text":"I have now been here for a work dinner, and on a date with my wife.  This place is an amazing secret.  Excellent food, great atmosphere, perfect service.  If you go during the spring or fall, you can sit on the patio without it being too hot.  Being so close to the mountain and surrounded by trees, it really is an amazing place.  And with great food to go with it, it can't be beat.","useful":2,"funny":1,"cool":1},
{"review_id":"hoJ_SYkLmnMABOORUysd7g","user_id":"Fg51rJu_cD1ggx9Z1hoSVw","business_id":"zDyv4CoaYvAgQhgr1IK1sg","stars":3,"date":"2013-01-03","text":"I recently took several employees here for a team dinner.  The place is nice and big, with a huge menu!  The service was fine, not extraordinary but not in any way lacking.  The food too was OK.  Not amazing, but not bad.  The atmosphere wasn't loud, but it was lively.  Overall a nice place to go.","useful":0,"funny":0,"cool":0},
{"review_id":"3vGjwmo_SE6gMxo0dDcaQw","user_id":"JgR5So35uqfKD3PobEecQw","business_id":"5p60nXyjQruKvEZix6ahVQ","stars":5,"date":"2012-06-04","text":"I went here with 7 other colleagues on a Thursday night. The restaurant is absolutely beautiful - very chic and rustic, something that is certainly rare in downtown Pittsburgh.\n\nCourtney was our waitress - she was very bubbly and friendly and handled our large and demanding party easily.\n\nWe started with 4 appetizers - the mozzarella plate, fried zucchini, polenta & egg, and scallop au gratin. All 4 were amazing - I was especially impressed with the mozzarella plate, the buffalo was out of this world! My next favorite was the scallop au gratin, I believe it had bacon in it and the mushrooms were incredibly fresh. The fried zucchini comes with a delicious marinara that really enhanced the flavor. The polenta and egg, from what I gather, was also amazing. I am not one for polenta personally so I did not eat this.\n\nI ordered the Papardelle with truffle oil which was out of this world. So simple, served with mushrooms, but oh so delicious. Based on Courtney's recommendation, most of our table ordered the crab cakes for their meal. What a great decision! The meat in this is overflowing and so wonderful. Another colleague got the veal osso buco and was in heaven. He cleaned his plate! The risotto was cooked perfectly in this dish.\n\nOverall, this is a gem of a restaurant. It is perfect for a date or with work colleagues. The staff is very friendly and knowledgeable. We ordered 4 bottles of wine and the staff was very accommodating constantly giving us new glasses, etc.","useful":1,"funny":0,"cool":1},
{"review_id":"TG92sCnRylfe5gJzsaRs0Q","user_id":"fCPDlYIDG2sN60hJl_xnlw","business_id":"ud4410hDak6LxcXzCOy1kw","stars":4,"date":"2013-07-12","text":"If the app would let me I'd give this little hidden gem a 4.5. For the price, it's some of the best BBQ in Phoenix. Nothing at Waldo's is over 4 bucks! Large drinks are $1.00. It's perfect for the Moon Valley residents. Fast drive through and tremendous sauce. I got the Brisket Sandwich. Warning...portions aren't huge. I also got the \"pig\" burrito. Moist pulled pork. So for $7.00, I got an awesome meal and diet coke. Oh yeah, the menu price is the actual price. They pay the sales tax! Im going back tomorrow! (No I'm not a friend of theirs. Driving by and saw it around 7th St and Hatcher. Little place... From Waldo's bbq in Mesa.)","useful":1,"funny":0,"cool":0},
{"review_id":"wcc2bduiElf3A0JGJ_hVaA","user_id":"fCPDlYIDG2sN60hJl_xnlw","business_id":"hnCd1VSLYdb2-eHO7iB9xQ","stars":1,"date":"2012-08-09","text":"Man I'm bummed. I just moved to the moon valley area last month. I asked my neighbors for recommendations on a sports bar near by. One talked me into this place. I literally just got back from there. It is Wednesday, so it's 50 cent wings all day. To me, a sports bar staple should be the wings and beer. Good happy hour prices, but god awful wings. Come on guys, have you been to Teakwoods, Zipps, Goldie's, or The Tavern? I won't come back until you change the recipe. Ive had wings all over the country. The great wings are a perfect combination of crispy and saucy. You have the dreaded soft rubbery skin. That's bush league! Gross! You also use Frank's hot sauce for your wing sauce? Terrible! Want me back? In this order ok? Sauce them...grill them...re-dip them. Also, get real sauces? You know what I'm talking about too. Lastly, take them off the menu immediately until you go to Teakwoods. It's the valley standard. Just trying to help. Please fix this so I have a place to go.","useful":0,"funny":0,"cool":0},
{"review_id":"JoeuVTqvP94P-AGc1aQByA","user_id":"fCPDlYIDG2sN60hJl_xnlw","business_id":"1WBkAuQg81kokZIPMpn9Zg","stars":1,"date":"2012-07-03","text":"$13 for a 1\/3 lb cheese burger. $6 fries? This place was waaay overpriced for 7th st and thunderbird area. $5.50 for a bottled beer? This place was absolutely terrible. I knew it was trouble when I saw a raw bar five feet from the bathrooms.","useful":1,"funny":0,"cool":0},
{"review_id":"U6EWDuJ7wgtm8KaK20TE-w","user_id":"sPQeZn3f-XHwz7Tgw2D7mw","business_id":"6xgcHeLad-VaoTIQewK84A","stars":5,"date":"2015-02-03","text":"I visited N9NE steakhouse with 5 friends while in Vegas for my friend's bachelorette party. It was a Saturday night, so we made 7pm reservations. We were a little late, and the restaurant was so nice to accommodate us. Once we arrived, they sat us right away. Our server was Adrianne, and she made the experience exceed all expectations. She was very attentive, and made us feel like her number one priority. She asked us what we were celebrating while in Vegas, and once she found out our friend was getting married, she made sure the dinner was a true celebration with rounds of delicious mixed shots, and complementary cupcakes for all of us.\n\nFor dinner I got the lobster, and filet mignon dish which was exceptional. The filet mignon was the best I've ever had, and lobster was delicious. I had had a cocktail the server recommended, which was really good. Even the cupcakes were delicious. Overall It's pretty expensive, but well worth the price with the delicious food, well made drinks, and excellent service.\n\nIf you visit N9NE steak house make sure to ask for Adrianne. You will not be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"ppUyo74nMyMmXI0AdbNvIA","user_id":"ItXiz8DvQnyEoFOkmIS9uw","business_id":"nkfOu2xOnhqHOsW0yX9OhA","stars":3,"date":"2014-01-17","text":"I have stayed at numerous Hyatts and this was my least favorite. The check in was a little painful and took a while. Once inside the room it was clean, but I still didn't feel comfortable walking around without shoes. After a long drive from Columbus and visiting family I was exhausted and slept well in the comfy bed. No bed bugs we always check.","useful":0,"funny":0,"cool":0},
{"review_id":"0R3mV3NIgM94SFzLY0hD8A","user_id":"ivtf2c085CPe0hFiyWwilw","business_id":"NeDqVEiin0q-FxCvOKiERw","stars":5,"date":"2016-06-14","text":"The very best Southwestern Restaurant and New York Pizza joint got married and had an amazing miracle baby named My Slice of the Pie.  This little gem in  Arcadia never disappoints, and owner Randy is always in to make sure of it.  Try my favorite- the Supremo pizza, it has southwest sauce, Pollo Asado, chopped garlic, chorizo sausage, green chilies, roasted corn, red onion, Asadero, mozzarella, and Cotija cheeses topped with chopped cilantro, it's AMAZING!  Though beware, you'll be addicted after your first visit.  Keep up the good work guys!!!","useful":0,"funny":0,"cool":0},
{"review_id":"8_VqWjAQ9O7-9ph876qcJQ","user_id":"ivtf2c085CPe0hFiyWwilw","business_id":"9NaZIhfRPkxRJn1eA9zrTA","stars":5,"date":"2015-06-30","text":"Awesome place! Great food, beer, and people!  Try the Mouth on Fire Burger if you like spicy, it was delicious!  I will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"JNTUXj3TQfTQxQeaEuaSZg","user_id":"ijeUNkUThd42AT3c5PxNfw","business_id":"cxaMso5tqJ5KMCM-JgUbKg","stars":1,"date":"2017-08-06","text":"SCAM!\n\nSo many promoters in the casino passing out bands that do nothing.  $25 at the door.  Was told a bunch of incorrect information by the promoters, that the staff would not honor and all the manager said, sorry, nothing we can do about them lying to you.  I wish it wouldn't have happened.  Got out of Caesars in a hurry, get me once...never again.  Had I been offered a drink or my money back... I would have not even posted this review.","useful":3,"funny":0,"cool":0},
{"review_id":"IC7JrwNDdMuiaaHMHHizwA","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"sKa6kQ77I6empnNirIuOVg","stars":3,"date":"2014-07-03","text":"This is a nice Safeway. The Starbucks here is excellent and one of the store's greatest assets, look for Lety or Mary they really know how to make a good drink. The deli sandwiches are awesome, but it can be a hit or miss because the sandwich artists are the also the deli clerks, and sometimes this will cause a car pile effect and lines will form causing even more delay for a sandwich. I think this then causes a lot of undue stress on the workers, especially given their \"3 minute\" rule to create the sandwich. \n\nIt is true that you can expect lines at this store, however most of the cashiers for the most part are efficient and friendly,  with the exception of a couple of sourpusses that work the evening shift.","useful":0,"funny":0,"cool":0},
{"review_id":"inH9CMdy1azJDXuU8067Gw","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"wVLvEcK05JGhw_EmdTpF9Q","stars":2,"date":"2013-10-16","text":"Sephora the company, (Sephora.com) itself receives 5 Stars. I love the products, all of your faves under one roof + others you've been curious to check out. I'm a FOREVER customer here.  \n\nWho can say they don't love their samples and value sets or just their range of products? From Soap & Glory to Benefit to Givenchy to Guerlain to the new kid on the block (make up wise, but not otherwise) MARC JACOBS  Seriously, one could feel very spoiled here. \n\nMaybe its the mall itself ---- but I don't really think so (i.e. The Girls\/Guys  @ MAC inside of Nordstrom are always soo warm, friendly and inviting -I feel rude turning them down -Henceforth, I will be going to MAC @ Nordy's  when the seasons change and I am in the need of a change in foundation and shade or a fun night out.   \n\nThere is one Rep that was helpful and unforgettable, I think her name was Jessica -she assisted me twice in 2011 & once in Feb. 2012, but other than her -the reps at Sephora are rude and hopelessly tacky.","useful":1,"funny":0,"cool":0},
{"review_id":"YgNeaVRGQMM9E1gLZ3WV8g","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"jcw_vtqfZSTLP15DJmvfIA","stars":4,"date":"2015-02-23","text":"The food is really delicious and the coffee is hot.  My party had the stuffed french toast, chicken strips, a cheesburger,  a chipotle chicken sandwich, onion rings and fries and it was all good. The staff is very friendly, the owner is very friendly as well, they even brought my mother a small bowl of beef stew that they had brewing to test out. The tables, floors and bathrooms are very clean. \n\nThe decor is kitschy and fun,  I noticed the mens restroom had a classic Betty Paige poster and over all it is a smorgasbord for they eyes. They also sell wrapped up cheesecake brownies in the front. \n\nThe tricky part about this restaurant is that it is in the Melrose neighborhood and a lot of places are thus named \"Melrose\" something, but it is on the left hand side of the street.","useful":0,"funny":0,"cool":0},
{"review_id":"HtqQFBm_A6C2-DwZUFxI5w","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"4yIOZXIYJiQlkqW_MUtVgQ","stars":5,"date":"2014-03-19","text":"This place is AMAZING. Great food and excellent customer service.  I'd driven by here several times and this place is always packed. I tried it for the first time on a very busy Saturday after doing errands and was blown away by the quality of their take out food and malt shakes. The friendly staff really impressed me as well, very professional, polite and helpful. An all around great place.","useful":0,"funny":0,"cool":0},
{"review_id":"GdNDZqeTDf4HL9U_aB49EA","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"ILHR4Kifn65EDM9f_OzwjA","stars":5,"date":"2015-02-04","text":"Spices Kitchen is such a great addition to this area of town, its classy without being over the top and intimidating, its kind of like going to your friend's for dinner -your friend that always has everything organized just so, with ambient lighting and its the kind of place where you can just chill. \n\nAll of the food is absolutely gastronomically out of this world, the hummus is delicious even my toddler lapped it up. The ultimate star of the menu is the Gyro, seriously go and try on. I believe Spices Kitchen's gyro is in a class of its own. \n\nThank you Spice's Kitchen for bringing the top notch eats.","useful":1,"funny":0,"cool":0},
{"review_id":"ZDPk6AKgY0QFwvb6Ks3dJQ","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"1aBzB1B3d1X8J0V4bvdHZw","stars":4,"date":"2014-04-27","text":"This is your typical awesome Target, you can find almost everything here. While it does carry wine & craft beers it does not carry electrical tape.  The staff is pretty friendly helpful, that's a plus. This Target has a Starbucks as well as personal sized Pizza Hut pizzas. \nThe shopping carts are disgusting.","useful":0,"funny":0,"cool":0},
{"review_id":"nnk76s3FcevvT9hzt-Q1Fg","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"MIW-wvvJS9pwXwocoWo20Q","stars":5,"date":"2013-05-08","text":"Karma is tucked away like a hidden gem inside Chandler Fashion Mall, I found a very summery dress in a gorgeous plum color. The people that run the store were incredibly nice and seeing as they had an eyebrow threading station I decided to go for it and try it and they threaded my brows on the spot.","useful":0,"funny":0,"cool":0},
{"review_id":"N0yOaV1XWB8ubBXkhjgIVw","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"fXqlzAM6PTXUGrU4y33LzQ","stars":2,"date":"2015-02-23","text":"2 Stars for the gorgeous, colorful interior which will no doubt attract customers. With that being said, zero stars for service and food. The waitstaff seems\nincredibly unfriendly.\n\nThe food itself was slightly cold, the tortillas were cold and sub par, like maybe they had used Mission or some other store brand and then rolled them up in foil and then thrown in the microwave. The rice was flavorless and cold as well. The cheese on the refried beans had cooled over as well. The quesadillas were also plastic tasting. \n\nThe interior is fun and inviting, but it doesn't make up the food. This is a bummer, because I really wanted to like this place its just so creative on the inside, but the snooty waitresses and the cold, boring food is not worth the trouble.","useful":2,"funny":0,"cool":0},
{"review_id":"TjnoIOBybO9WA7RSFu97bQ","user_id":"LPKvoLFvUE2RLMcZ9yQURg","business_id":"3ijDAUuPxnptd-bsJagm-g","stars":3,"date":"2015-02-23","text":"This place is ok, 90% of the cute decor is not for sale so 3 stars  for that and the small space.\nI have found some adorable dresses for my nieces for under $6, and the books are usually in great condition and inexpensive.","useful":1,"funny":1,"cool":1},
{"review_id":"oAkz1kUO1nJipOdUodUG_Q","user_id":"uMcQGQ1bU-aBqqEqQt8osg","business_id":"UE3AvVnaPEBPneVahYT2eA","stars":3,"date":"2016-03-10","text":"Service was good..way over priced for the quality of food for a steakhouse. Prime rib was chewy and our filet was over cooked.","useful":0,"funny":0,"cool":0},
{"review_id":"2xxxXhPLWBMx2kT6A1MHNw","user_id":"qAnyqoPMYvU_U0soS7CYVA","business_id":"umXvdus9LbC6oxtLdXelFQ","stars":5,"date":"2015-04-06","text":"Adorable dessert restaurant in Las Vegas! The environment reminds me of a modern place for high tea. I came here when I went to Vegas. You do need a car to get here if you are on the strip. \n\nI tried the jack in the cup(chocolate shouffle), Stella , and the mt. Fuji. I love the stella(strawberry tiramisu). The presentation of the dessert was amazing. Everything tasted so delicate and yummy. The staff was very accommodating. I had to leave for the airport right after and they asked what time I had to leave. They were able to serve the desserts quickly so I can leave on time. Love this place!","useful":0,"funny":0,"cool":0},
{"review_id":"G2r_YXVI_mNM48X9qHLAqA","user_id":"AKm5m3CrWVQHcd-KiVJgdQ","business_id":"yg4OqooJ7NjrvddPccPOiw","stars":1,"date":"2014-12-01","text":"Do not buy the AGAVE groupon if your hair is frizzy\/very curly. \n\nI went to this salon to get the above mentioned treatment. The owner asked me to book 4 hours of my day so I decided to do this on a Sunday. The girl doing my hair hardly spoke any English so we could not communicate properly. As soon as I sat in the chair which should be the initial consultation the receptionist\/owner came to talk to me and did not allow for my stylist and I to have that talk about my hair. She was talking to me about Star Trek and the girl began shampooing my hair. \n\nOnce the treatment was over and I realized my hair was EXACTLY the same as before the stylist straightened it one more time (because she saw I was unhappy) . The owner came back and gave her a scolding about going an extra mile in the most condescending way.\n\nThe owner also took this opportunity to tell me that 1) I needed super straightening not AGAVE 2) The current treatment will not work with my hair type. So after spending 4 hours of my Sunday on a chair she tells me it was useless. She insisted she told me this on the phone when I was booking my appointment....\n\nI was charged $40 on top of the groupon for my \"length\" and taxes....\n\nI will not be going there again.","useful":4,"funny":0,"cool":0},
{"review_id":"dO0anTs3B2v7zMvzhv9Edw","user_id":"AKm5m3CrWVQHcd-KiVJgdQ","business_id":"ttuEwktrkmh3TUlSFPZqAA","stars":1,"date":"2015-03-26","text":"I visited BMB on a Thursday evening with friends. We asked the girl at the counter for 1 fried chicken bao, 1 pork belly bao and 1 kimchi fries. I asked to confirm whether the kimchi fries can come with tofu instead of meat and the girl snapped at my friend and I to an unacceptable level. She was rude and hostile only because we did not CLARIFY that we wanted \"tofu kimchi\" because apparently regular \"kimchi\" means it comes with meat. She ripped out the order and started pointing at it and saying \"YOU ORDERED 3 THINGS AND YOU NEVER SAID BLA BLA BLA\" and my friend had to tell her \"sweety calm down...its ok\". \n\nTerrible attitude. Go at your own risk.","useful":0,"funny":0,"cool":0},
{"review_id":"Ult9j6PfmnwD_Z2uJQrVXQ","user_id":"qgcEGMAy_GfXT0m-qMtEGw","business_id":"j65zwVK-QJQ78gAkZ9smZw","stars":2,"date":"2014-06-13","text":"Ok where to begin with this mess- I go in to fix my brakes and fix a flat I had to leave it there from Thursday all the way to Monday and mind you I left my phone number with them too. Then I call on Monday to ask when I can come get it and the guy tells me that they havnt started because they need to realign a wheel and had to wait all these fing days for me to call as opposed to calling me so then it turns out that aligning one measly wheel was gonna cost me $80 so I told them to just fix the flat and give me my damn bike back he says fine it'll be about $7. I go in to pick it up and he charges me $12 I was sooooo exasperated with the shitty ass service by then that I just took my bike and left. The one plus is that they all are very friendly and nice and personable and they speak both French and English but never again will I go back.","useful":1,"funny":1,"cool":0},
{"review_id":"GdIuundcWOS89uCushfD0A","user_id":"qgcEGMAy_GfXT0m-qMtEGw","business_id":"9Raunn3mrzH2t9ZW_mh8UQ","stars":4,"date":"2014-06-17","text":"I love love love this place! I went in there to get a bunch of macaroons I tried pretty much all of the different flavors and not one disappointed!! I would recommend this to anyone looking for delicious and very reasonably priced macaroons.","useful":0,"funny":0,"cool":0},
{"review_id":"PeonFQNAd2syNhbuyhnWqg","user_id":"REnsHlE_iFVKGwxzXZ9QHw","business_id":"R7-3MCD6_RL_VxN65yCh2Q","stars":5,"date":"2012-05-16","text":"This place is hands down one.of the best whole in the Chinese cuisine really recommend it best to eat in","useful":2,"funny":1,"cool":0},
{"review_id":"ae5kRH2CWll0nDKYIwynDw","user_id":"8WEPsSsFNLQJtYoETKUdpQ","business_id":"SGCJMi4y_uxbRnBODzDbPg","stars":1,"date":"2017-01-15","text":"Return customer this was my 2nd visit to the shop, even though I sat with a different barber this time I still expected the same quality of service. After getting home I realized that I had to touch up a few areas on my own and that I had 2 razor cuts, and I only received half the beard trim service than my first time so I had to touch that up as well. I was also very surprised that the guy charged me 30 bucks for this but still I didn't think nothing of it gave him a 5 dollar tip and walked out. I will be taking my business elsewhere. Date of visit 1-14-2017","useful":0,"funny":0,"cool":0},
{"review_id":"ROKpz8E_R9D0OgaB7aDXyQ","user_id":"3DbTlSQthe-2XzA69o0WyQ","business_id":"GT0K4EdSSxe_LMU6SPr-_A","stars":5,"date":"2013-03-09","text":"I was in town for a conference and my birthday so i wanted something fun for my colleagues and I to enjoy.  We fell in love with them! They we the most delicious, most, and tasty cupcakes! You also get a slight buzz.. hehehe.\n\nThey dropped on of my cupcakes and replaced it but also gave me 2 free cupcakes! they were awesome and super nice! \n\nI will order from you everytime I am in Vegas.","useful":2,"funny":1,"cool":1},
{"review_id":"RZb55PbgJI0HlEPm8qeqNg","user_id":"3DbTlSQthe-2XzA69o0WyQ","business_id":"BjS35X3-_-9TP-RyfzoC_Q","stars":5,"date":"2016-05-08","text":"My boyfriend and I had been wanting to stop by for months. We finally had the opportunity last night and had a wonderful meal. My boyfriend is from back east and misses the mom and pop restaurant. We finally found it here! The food was amazing and the service is excellent! We have found our place we want to be regulars at!","useful":1,"funny":0,"cool":1},
{"review_id":"fRUxHj66BplAk-mOCCeDNA","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"dR_QSP5ngGYiUkxzDUYLmQ","stars":2,"date":"2015-09-16","text":"Stopped in for lunch the other day. Had not been in awhile and it may be awhile before I go back. The menu is extensive, but stuck with a classic smoke meat platter, medium, which had more fat than I expected and with the rest it was just ok. The pickle was the best part. Two platters one beer almost 50$\n\nService was poor as they only returned at the end of our meal as they were busy tending to signage. I could go into this more but won't.","useful":0,"funny":0,"cool":0},
{"review_id":"z4qOt1PWjd8PdeY9pSoFDQ","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"1m4wZlhpGsg57oWLYfpcUA","stars":4,"date":"2016-04-09","text":"The Fish and chips here are among of the best I've had. Lightly battered fish with dark crisp fries that are all served piping hot. Other notables are the shrimp cocktail and the popcorn shrimp. Seating  is cramped in the main entrance area, with the open kitchen opposite it could also be considered busy.  The room to the right side is preferable or on of the two outdoor terraces. Dined here 6 or so times and the place has always been near capacity. Quite popular with the locals. The food never disappoints.","useful":0,"funny":0,"cool":0},
{"review_id":"foOQHE9ySrppRGxf0EgOgg","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"fAlKTsfsUF6A5iujEI2Z1w","stars":5,"date":"2015-08-13","text":"Had a dynamite meal at this great place. A couple of us had The M.O.A.B (Rightfully named, Mother of all burgers) The best of the big burgers I've had. I requested med. rare and it couldn't have been done better. The flavour of this burger with melted cheddar, fabulous, the onions mushrooms and bacon all still hot and freshly cooked and fresh toasted biscuit, top notch. The brightly flavoured accompanying  chipotle sauce is excellent as an intermittent addition of flavour. \n\nMy wife asked if it would be possible to order Eggs Benedict which was not on the menu. The chef was happy to oblige and 4 beautifully prepared eggs Benny showed, she was in heaven. The ham and eggs along with the a terrific hollandaise sauce were excellent. The Exec. Chef  stopped by our table to see if everything was to our liking and was surprised to see the eggs Benny were almost gone but by the way my wife was raving about them we all had to try some.\n\nNice casual area w\/ upbeat atmosphere on the main floor and a beautiful comfortable dining room on the 2nd floor. We ate at many places while in Vegas and this one is defiantly a place to go for great food.","useful":3,"funny":0,"cool":0},
{"review_id":"6I_kY0R9solwFHYsVuJ1OQ","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"41Kbugm-qmIQTt7unkALYQ","stars":4,"date":"2015-08-24","text":"Very nice classic style steakhouse. A great view of the strip at night when seated by the window which we asked to be moved to as another group finished before ours was served. They had to inquire first and then were happy to oblige. Very Friendly service. \nAs for the meal two of the four dishes had to be sent back, one was an overdone Pork Chop Porterhouse which they replaced and was spot on. \nThe Rib eye ordered med-rare was blue, they took a second stab at it, put it in the oven, and brought it back on a clean plate. I guess that's ok ?\nThe other plates were a hit, a NY Strip and a Cajun chicken, which were nearly finished by the time ours returned. \nNot a disaster but there are too many steakhouses in Vegas to be coming up short like that, hope it doesn't happen often.","useful":0,"funny":0,"cool":0},
{"review_id":"itPBPzNoeDaS0QvR52GL7A","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"SVGApDPNdpFlEjwRQThCxA","stars":4,"date":"2015-08-24","text":"Good food, large portions, swift friendly service and reasonable prices. The real stand out was the soup, it's excellent, we all complemented on it and the perfect temp didn't go unnoticed.   \nThe place was quite full, understandably, so we opted to be seated in the bar rather than wait. Our mistake, good meal in a noisy chaotic environment, bit of a shame, took some of the enjoyment out of it. Fortunately the food is as good as it is and made it worth while. \nWould definitely return given the chance.","useful":0,"funny":0,"cool":0},
{"review_id":"kO5Afu3RD_rSFzPDM0CKvw","user_id":"vQ0fqKaoq9yU5N1jluwHjg","business_id":"SSyulcbXDsyq25OQXhEF3w","stars":3,"date":"2015-09-16","text":"The pizza is quite good, very tasty. Been twice recently, and will defiantly be back, and try something else. \nNice big place, two floors with a terrace. Good service, and reasonably priced.","useful":0,"funny":0,"cool":0},
{"review_id":"sVPOsblxaoMLmKf_dPVRXQ","user_id":"BBuCypsgRNU9_LM4b0fcyA","business_id":"OActfpEHMEOCdGH5HN6MOw","stars":1,"date":"2015-08-23","text":"It's really upsetting writing this review.  I have been to centennial hills a few times and they were great visits and I really liked the place and staff.  I decided to bring my 3 dogs for their spa special, I called and made an appt for first thing in the morning and when we arrived we were first to check in for the spa day.   \n\nI'm not going to go into all the details of what happened and why it was the worst experience for myself and my dogs but I want to warn you.   Please before you bring your pet find out what all \"spa day\" includes because I was mislead.  \n\nThere was a lot of mistakes by the staff and I would still consider myself a customer of this facility if they would have stepped up and owned the fact they fell below their service standard.   Mistakes happen but when they do step up and stay we messed up and not just preach policy that didn't happen in my case.  \n\nI did ask for a refund and they gave me the money back.   I would have been more satisfied with them saying they messed up and we could have split the cost. \n\nJust make sure when you go that you ask a lot of questions and make sure you follow up to make sure your animal is ok because if they are not they won't tell you.","useful":2,"funny":0,"cool":0},
{"review_id":"yaEYPyqBVBrQfxK3rkJPbA","user_id":"DH9NrDYCRutYKMCqKYmyBg","business_id":"LiSt3sVWELm7nfVIKJs0MA","stars":3,"date":"2013-07-18","text":"I have to agree with Maryq. \n\nWe love Parasson's and it's a local institution, but to be fair, we've noticed the portions have gotten a lot smaller and has anyone else noticed the prices are not low like they used to be? For cheap pasta, we can overlook a lot...but Parasson's ain't the deal it used to be in the 1970s and 1980s when there literally were lines out the door.\n\nC'mon guys, it's pasta...you ain' fooling anybody with the smaller portions and bigger prices.","useful":3,"funny":0,"cool":2},
{"review_id":"I4PBIqZQGdAnmTk8c573HA","user_id":"DH9NrDYCRutYKMCqKYmyBg","business_id":"A9MJ0MDkFXvMYPzJk_Jp9w","stars":4,"date":"2013-07-17","text":"Nice mall. \nIt's what feels like about an hour and a half trip from the NE side of Akron, where we are, so we rarely get out to that side of town. But at least you don't need an automatic weapon or a platoon of bodyguards to walk the place after 3 pm on a Saturday. And you can't argue they're not miles ahead of Chapel Hill these days. As others have said, let's hope the slimy underbelly doesn't devour this place like the other mall casualties of 21st century Akron Ohio.","useful":0,"funny":0,"cool":1},
{"review_id":"por1RYjeGXyp6PP_3fpT6g","user_id":"DH9NrDYCRutYKMCqKYmyBg","business_id":"RLmXioxW1JdzSHTecSGSuw","stars":2,"date":"2013-07-17","text":"Kind of overrated in our opinion. The prices leave a lot to be desired; it's no discount store, and hobbies clearly can get expensive, but several times we've clipped coupons out of the paper only to have the lady at the register tell us the coupon was out of date, which it wasn't, or did not apply to the item we were buying, which it didn't say there were any exclusions for that either. We felt ripped off by what appears to be this bait and switch tactic. With several large craft chains in the area (Michaels and Pat Catans), we thought Hobby Lobby would be more accommodating and competitive.","useful":1,"funny":0,"cool":0},
{"review_id":"lhgOldZC_JwqB48NDFWs2A","user_id":"DH9NrDYCRutYKMCqKYmyBg","business_id":"G94xOygsxIG2VY2rltPUqg","stars":5,"date":"2013-07-17","text":"Eddy's rocks! Been going there for years and the selection of bikes is out of this world. Running a bike store is tough; it has to be difficult to make everyone happy and helping people who think they know what they want, but are newbs, has to be a difficult feat to master.  I've bought several bikes there, service has been top notch and you really need to get to know Jim to understand he and his family are cyclists at heart.","useful":0,"funny":0,"cool":0},
{"review_id":"ecunzD4a0gsNZEhvoGdVBw","user_id":"DH9NrDYCRutYKMCqKYmyBg","business_id":"xzGe1EkD9FJH0dN7QnyqBQ","stars":4,"date":"2013-07-21","text":"My family loves El Camp.\n\nWe've been coming there for years, and we feel that it's a 4 out of 5 stars. Service is usually fast, friendly, and maybe it's because we've come so often, but we really feel as though we know the people that run El Campesino like they are friends, and that means a lot today. \n\nSure, there's an occasional slip up, but by and large, for the price, we haven't found anything we like as well or better.","useful":0,"funny":0,"cool":0},
{"review_id":"WUKpMVdJlvpuIeinVzF5KQ","user_id":"lJpYNlisYrFLES2rgaHjEQ","business_id":"VhEWjWUrcHFFNAyZN-TzyQ","stars":1,"date":"2015-09-15","text":"Awful Cake made in unhealthy way. I bought for my Son's b'day and wanted to take it to the playground to share with other kids. The cake has serious problems with the way how it was made. It doesn't taste like a cake and was like you are eating sugar syrup. Returned it in 15 mins after taking it home. She took my number and told the manager will call me. She never called back. I called her back again and left a VM for them and they returned the call after a month and asked me to order something new. I told her about my previous experience and she said she will ask the manager to call back. She finally called and said they were sorry but couldn't issue a refund since they didn't find any problems. Well, I wasn't looking for the refund but I would have been happy if they could just respectfully acknowledge the problem. These people have attitude, they are not getting by business back ever.","useful":1,"funny":0,"cool":0},
{"review_id":"AwgoaHe3yacPZFRdADAh6A","user_id":"lJpYNlisYrFLES2rgaHjEQ","business_id":"eD-mLcVZ9WXSVUvOPSbu_Q","stars":1,"date":"2015-10-02","text":"Just Terrible. It used to be nice. They changed the config on washers to use less water to reduce the water bills it seems. What this means is that bigger expensive Huebsch washers don't clean that well anymore. This is VW cheating on emissions control. I will avoid at all costs. Not to say that the place is very filthy and AC never works.","useful":0,"funny":0,"cool":0},
{"review_id":"SDRYwBvAYClFY399DxTZug","user_id":"lJpYNlisYrFLES2rgaHjEQ","business_id":"xYWaZbm000UvTrI2Icb5eQ","stars":3,"date":"2015-06-26","text":"I was there for renting U-haul. Everything related to move is far more expensive, I wanted to buy some medium size boxes for the move they sell 3 times the price you will pay at U-haul or Home depot.\nThe people working there are very professional,courteous and helping and treat you well. Make sure you refill your U-haul truck before returning otherwise they will charge for the fuel hell out of you, their gas is 150% more expensive. I  used their truck (10')  for 12 miles it guzzled up 5.5 gallons which means 2.18miles\/gallon (in non tow mode) which is insanely low w.r.t  truck manufacturer specs that I saw. It seems the guy had wrong reading or they were jacking it up or the truck had problems, I told them and they won't honor any arguments. I should have been more attentive myself. In future I will go to real U-haul for the moves.","useful":0,"funny":0,"cool":0},
{"review_id":"HFupeC3Hg5c7NcvWSEC2LQ","user_id":"hh1UUcyMeZQcOjC-4xq0WQ","business_id":"YPavuOh2XsnRbLfl0DH2lQ","stars":1,"date":"2015-06-30","text":"Ok, so I've been using Yelp for quite some time, and this is the first time I've been so disappointed I had to take the time to write a review. \n\n8.50$ for a Bacon Bloody Mary.. Vodca, tomato juice with a piece of bacon in it.\n\n4$ for a side of home fries (that weren't even cooked all the way).\n\n15$ for a 3 piece two waffles and 2 eggs... Over Medium eggs ordered, sunny up came out. Also chicken was extremely bland... Popeye's Chicken is better and cheaper.\n\n3.50$ for a mason jar of cool aid. \n\n20$ for appetizer sampler.. Pickle chips sooo deep fried couldn't taste the pickles, and breading on fried green tomatoes was VERY bland.\n\n15$ shrimp Mac and cheese.. So salty was barely edible and the shrimp was rubbery. \n\nComplained to waitress (when flagged her down, she didn't even check up on us for over 40 minutes) she provides us with 4 coupons for \"free cool aid\"... As long as minimum purchase and day and time restrictions are met with purchase and says \" best I can do\". We also mentioned that the food used to be so much better before the location was torn down and rebuilt to which she replied \"I don't know why so many people say that.. I think the chicken is good\"\n\nMy SO'S Purple sourous Rex (spelling?) was good.\n\nAll said and done over 80$ for 2 people for dinner. I expect a LOT better for that price. I will not be back.","useful":0,"funny":0,"cool":0},
{"review_id":"TdnC5zWJyRpCjQ3VsQsO9Q","user_id":"HX8P36rOdXZ9dcOIh5jgPQ","business_id":"dD6JQo5tCNtOtauaLaT0sg","stars":4,"date":"2014-01-11","text":"If ever you are in the mood for wings, Oggi's is your place. They are huge. I wasn't too sure when I ordered them since you order by weight not quantity so I didn't know what to expect. I ordered a little side salad to go with the wings. When the wings came I was definitely surprised at the size of them. I left there full and wanting to go back and try the rest of the menu. Next time!","useful":0,"funny":0,"cool":0},
{"review_id":"YStOijqFeUx8PBW9JfNKyg","user_id":"HX8P36rOdXZ9dcOIh5jgPQ","business_id":"7MeMGh0SUlF-GuTyruwtcw","stars":5,"date":"2013-12-23","text":"Always have a great time when we go to mellow! Bartenders are awesome, know what we like and have it ready!","useful":0,"funny":0,"cool":0},
{"review_id":"UStc3hDZ7_UgL26hLcEytg","user_id":"HX8P36rOdXZ9dcOIh5jgPQ","business_id":"Qb1tuREKTsyVKO6DiDQXgg","stars":4,"date":"2013-12-30","text":"Great little neighborhood bar. The food is great and service is prompt. Can't beat the fact that it's walking distance from my house! It does get pretty loud and cramped for space on weekend nights though as they regularly have a DJ and I have even seen a band play one night. Still, great little cantina.","useful":0,"funny":0,"cool":0},
{"review_id":"Q5KpNiPJbNlQE-COsjTAyw","user_id":"HX8P36rOdXZ9dcOIh5jgPQ","business_id":"-01XupAWZEXbdNbxNg5mEg","stars":4,"date":"2014-01-05","text":"Amazing place to relax and grab a bite\/drink while the kids are skating.  The bartender is always on top of things. There are so many TV'S and they have every sports game on.  Happy Hour specials every day as well as daily specials.","useful":0,"funny":0,"cool":0},
{"review_id":"e8AOkvaLOrC7YDUFRl9V_g","user_id":"PeSYCCXJ4ED6RDjmS35ZFQ","business_id":"i1_DfbIgA-HAJliel6ZgZg","stars":5,"date":"2013-10-16","text":"I recently started taking my daughter here and couldn't be happier. She loves her teachers and they combine learning with fun. Every time I pick her up she raves about her day. I am thrilled with this daycare and the prices are hard to beat!","useful":1,"funny":0,"cool":0},
{"review_id":"SAjIqqKSXiiqo7SrZtwMWw","user_id":"9H74jfVFmWyPcqsGRbDt6A","business_id":"3ug1xM71zxibq5RETXCi4Q","stars":5,"date":"2010-06-01","text":"Love South Mountain Park. It is such a great place to get some exercise and enjoy AZ! I take my dog for a trail run about every other week and always seem to find a new trail to explore (that may be because the trails aren't marked very well, but I can always find my way back to the car). I have to say the maps at the trail heads are a bit washed out, so before the \"smart phone\" I had a difficult time determining how far I had actually hiked. Now that I have the cardio trainer on my Droid I can see I was padding my workouts juuuuust a bit... :) \n\nTrails can vary from easy to intense, depending on how hard you push yourself. You can get a great workout or enjoy a nice stroll, makes it a great place to take out-of-towners. \n\nParking is good in the summer (of course) and decent in the spring and fall. Expect to walk a bit to the trail head, especially in the winter - but that is what you are there for! The only day I CONSISTENTLY have trouble parking is Superbowl Sunday... is Camelback Mountain closed on that day? :)","useful":0,"funny":0,"cool":0},
{"review_id":"4uB_vdC7czvVhsisSz9onQ","user_id":"9H74jfVFmWyPcqsGRbDt6A","business_id":"sWwCwjsd27k0Y8m1RIWZEg","stars":3,"date":"2010-05-30","text":"I can't believe how this place has expanded! I was put off by FOUR hosts when we first walked up... told it would be a 2 hour wait and they weren't welcoming AT ALL. We were going to grab a drink and go somewhere else, but the waitress in the bar said she would serve us in there (Elizabeth) and she totally turned our experience around. \n\nFood is tasty. Don't have high expectations for portion size. I ordered the Pan Seared Escolar, which was wonderful It was served with snap peas and crispy potatoes. OK, so the potatoes looked like a Parmesan crisp served on top of the fish, not a side dish at all. There were 3 (THREE!!!) snap peas. Someone ordered the flash fried lobster, that was good. Someone else ordered the fillet - he said it was good. They still have the sticky buns...yum! White Cosmo was super great, best martini ever. \n\nPricey and a little overstated for my taste, but still a good experience all around. BTW... walked the restaurant after dinner, tons of empty tables. Don't understand the 2 hour wait???? Make a reservation... Thanks Elizabeth!","useful":4,"funny":2,"cool":0},
{"review_id":"mwUOA6BqVpg7liFI6B_Lrw","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"3Qi7NwTpAc3Oh1-wMb546w","stars":1,"date":"2015-08-05","text":"Rip off!  The $49 Home Depot special  is only a high pressure sales call.  We were told that our entire system needs to be replaced with 10k worth of products.  Our AC works great - we've never had a problem with it.  Lots of misinformation, won't even put their quote in writing.  Use somebody - ANYBODY - else.  Also complaining to Home Depot for sending these thieves into my home.","useful":7,"funny":1,"cool":1},
{"review_id":"tn1FDzrnlspaPnjlCeM2Uw","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"dA_SibUf2OsnU6jHYyC1iQ","stars":5,"date":"2013-07-22","text":"Really great donuts.  We've been in Vegas for about three years and had given up on good donuts.  This place is pretty far from our NW location but worth the drive.  I doubt if we will ever go past Cheyenne on the 15 and not stop in for a doz.  Nice staff, too.","useful":0,"funny":0,"cool":0},
{"review_id":"jZxoSrXPb29B-3kKBp-iSQ","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"KmuLLSyZJdNoarwcIERHcw","stars":1,"date":"2017-10-11","text":"We are locals that often have friends visiting from out of state. This most recent batch asked to see a Cirque show.  I told them that Mystere might be a good start - none of us have seen one of your shows. They booked rooms at TI and we purchased tickets for tonight's show, Tuesday, October 10, 2017 at 9:30pm in the front row 105, seats 1,2&3.  We stood in line to get tickets, stood in line 35 minutes to get into the theater, stood in line to give the snack bar $20 for 2 bottles of water and a coke, and then sat in our, excellent, seats for another 30 minutes eagerly anticipating the show but was told, 35 minutes after showtime, to 'exit our seats and proceed to the exits' where those of us who bought tickets could get our money back.  As if ticket price should cover our investment?  Because you couldn't pull your sh** together enough to go on, you SQUANDERED OUR CASH (ticket price doesn't reflect wasted, over-priced concessions), WASTED OUR TIME, and most heinous of all you EXPLOITED OUR EXCITEMENT.   For you it might have been just another Tuesday night; for us it was special.  Never again, Cirque.","useful":0,"funny":0,"cool":0},
{"review_id":"cE8defWJMHMK9X9nBIzP4A","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"VYNriOotbFZ7Qj_6jwUB5g","stars":5,"date":"2016-05-04","text":"Excellent food, great service all around.  The captain, Herb, is a hoot and made for an enjoyable evening.  The live piano was a great touch; I had forgotten how much I've missed that in restaurants.  It was a little pricey for us, moving it into a special occasion treat but I feel like we got a good bang for the bucks. We'll be back!","useful":0,"funny":0,"cool":0},
{"review_id":"SedVxZUZrlpTye4XnZiW_Q","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"-P8dGzSVhJi-5oZ-8U2y0w","stars":1,"date":"2012-11-12","text":"My partner and I retired and bought a house in Las Vegas in April, 2010.  At that time we tried out yours and the Aliante Stations buffets and yours was, hands down, the best.  We visited the Cannery several times a month for dinner and a couple times for lunch.  We have always brought our out of town guests there for gaming and food.  The quality of your food has steadily declined since we started coming to what is now inedible.  The prime rib is now a low quality, tough,  underdone steamship round; the tempura shrimp is 'popcorn shrimp' , a dried out bland product that bears no resemblance whatsoever to the shellfish; the seafood fra diavolo is now skimpily scattered atop an overdone spaghetti and your caesar salad is overdressed and limp.  Without exception the other options available appeared to have been held on the steam table until past their prime.  In fairness, I didn't try the pizza.  I don't go to casino buffets for pizza.  Incredibly, while you've lowered quality you've discontinued the bounce-back BOGO that we've enjoyed since arriving here.  Regardless, the meal we had this evening, November 11 at 4:30pm was not worth half of what we paid.  Be assured that the next time we go out to a casino or entertain out  of town guests we will be giving the Aliante Station another try.  A pity, really.","useful":0,"funny":0,"cool":0},
{"review_id":"y3d57hrdEYbJBxTPtM8j9Q","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"qkPiymXn9J8gF1_4s9nYbg","stars":5,"date":"2012-11-30","text":"The Aliante has changed hands and the buffet is no longer managed by the Station chain and has changed it's name from 'Feast' to 'Medley'.  Definitely a change for the better!!  We tried the old Station buffet a couple times and decided not to go back.  The fall in the quality and selection in the offerings at the Cannery prompted us to try Aliante again.  Excellent quality, lunch is only $7.95 (!) and vast selection including a couple carving stations and a barbecue station that would be acceptable in a BBQ joint.  We always liked the look of the Aliante, now their food measures up, Try it!","useful":0,"funny":0,"cool":0},
{"review_id":"R7to668j5er57U07JU0a8A","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"jawDq0UKt_WiZVdYsj1q8A","stars":1,"date":"2016-05-20","text":"Really sloppy practice! Was referred for imaging and it took 6 weeks to get results. After allowing the disc to lay on his desk 'for a week' (5 of 6) made us drive 46 miles to pick it up and take it to our dentist rather than overnighting it.   Otherwise, it would still be there.  Go anywhere else.","useful":0,"funny":0,"cool":1},
{"review_id":"PackEkOxOe879GtkFN1IiQ","user_id":"8mtcV419UVm8nzeH7Y5-1A","business_id":"AdJUHDuX1VSzNGujZbDDDA","stars":5,"date":"2017-06-10","text":"We've had a box at this store for over a year and just re-upped for another.  We travel in our RV over the summer and have our mail and packages sent to them.  When we settle in a spot, we email or call and they box and ship all accumulated to us; Post Office won't do this. \n Also, we have our meds shipped here instead of our home; someone is always there to sign for them and they are not sitting out in the Las Vegas sun all day. Have we had trouble with UPS or USPS?  Absolutely.  But that isn't this store's fault!  Many of the low ranked reviews here are regarding issues out of their control.  Every time there has been a problem, the staff here has called UPS and resolved it - and reversed the shipping charges. Try that at the post office.  Love, love, love the staff. This is a busy store.  No matter how slammed with customers, they always handle themselves with grace and incredible efficiency.","useful":0,"funny":0,"cool":0},
{"review_id":"BxglFs3B_uWxe-on3wUDOQ","user_id":"1pgDD5cC0cV4ZjivgGDBbw","business_id":"-fauz1yMXy1rYt5QcdIjCA","stars":1,"date":"2014-08-17","text":"I went there twice, hoping for a better result the second time - which I didn't get. \nThe plastic tubs for your feet, lined with sheet plastic, just feel weird and unpleasant. There are lovely chairs with attached tubs, but they don't use them. I suppose they would have to sanitize the tub each time and they don't want to do that. So instead, you put your feet in a shallow, quickly-cooling tub of water and wiggle your toes in the plastic wrap. Not a nice feeling. \nThe woman who did my nails disagreed when I asked her to shape my nails square and did them oval instead. Um, I'm paying for the service so I think you can keep your opinion to yourself. \nI won't go back a third time. It's really too bad because they are so close. However, they have a lot of competition and, if they want to build their business, they need to be friendly to first-time customers (the man at the front was; the women at the back just eye you suspiciously and gab away in another language).","useful":2,"funny":0,"cool":0},
{"review_id":"AdOuyG8lVxRqIT1OB8Morg","user_id":"LgrhLjhYggqzOdLeFzEI3g","business_id":"6RbCJLiwNYwS6ab9vzD_zg","stars":5,"date":"2016-08-26","text":"Food Heaven! Don't miss out\nThis place works as a grocery store and a cafe.. And believe me when I say the have amazing food here..\nThe Mana'eesh are amazing, so is the Shawarma! I don't think you can go wrong here.\nI had the Shawarma it was out of this world good.. The pita alone is so fresh, so tender.. Just delicious.\nAlso the prices here are pretty good","useful":0,"funny":0,"cool":0},
{"review_id":"drgixJqZm5T0UgrXPLtPvg","user_id":"LgrhLjhYggqzOdLeFzEI3g","business_id":"C63sF-wG4f1doMIMv2qvOg","stars":2,"date":"2016-07-08","text":"Was a decent experience, Though, the Burata Pizza was Amazing! Other than that I had better.\nI went there and the restaurant was empty only two couples beside us, the service was very slow I don't know why! \nAlso, I think it is bit expensive for what you get.","useful":1,"funny":0,"cool":0},
{"review_id":"Vn4qX0Z4grpPUL0AstsiJg","user_id":"wVnK3NIfeGSusN8Vsu4s-g","business_id":"mvE_5YYENjX-C1oD8nE-iQ","stars":5,"date":"2016-06-27","text":"Our experience with Michael and his crew was amazing. They are professional and do quality work. The guys were in our home for for over a week painting the entire house and also painting the kitchen cabinets. It's a really big house. They have an attention for detail  and easily dealt with my type a personality. They did an excellent job for me. The crew was a pleasure to be around and I can't say enough about how Michael stands behind his work. I would hire them in a heartbeat and suggest them to anyone looking to have paint work done.","useful":0,"funny":0,"cool":0},
{"review_id":"ElwDoQvXUqLEzF6xTNWqqA","user_id":"6LhDBbSC0G_RIX_41RdX9Q","business_id":"D9J1Ihmz7wAWUpRJ0QIn2Q","stars":1,"date":"2016-01-23","text":"I made the mistake of ordering the wrong height barstools.  When I called to request an exchange I was told they don't make exchanges, that it states right on the back of my receipt.  Well since the salesman never tells you this & just says sign & initial it is too late.  1star is too good.  If I could give 0 stars I would.  I will NEVER buy from them again!","useful":0,"funny":0,"cool":0},
{"review_id":"buM6iJnUDqL8y6gvJoRLMw","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"70-d5ojKLTscIcC7RBo5Lw","stars":5,"date":"2017-03-10","text":"Best place to service my bike. Fast service which is super key to me and they know their stuff too. Just a bunch of good guys working there. \nThanks for the service.","useful":1,"funny":1,"cool":0},
{"review_id":"UGoo40Lqy6ToL2l9wXd5NA","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"DrdhxvpwlZGhwF5vTR_QnA","stars":5,"date":"2016-11-22","text":"One of the best Indian places in the city. Super friendly staff and under new management. It's actually better than it was before and it was amazing back then too. Highly recommend","useful":2,"funny":0,"cool":1},
{"review_id":"ZYgWHwcdqzeTJWqkwZYkVA","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"EWKcKRI6m4gEBXb2XdR1zg","stars":5,"date":"2016-08-10","text":"Fantastic service and always willing to help.  Bought my bike there and had to go in for a few adjustments and they are excellent and have a good team to deal with.  I've been to quite a few shops in the city and while there are some other good ones around, McWhinnies are a cut above.","useful":0,"funny":0,"cool":0},
{"review_id":"64Y16IBQe3qCr1w4KIE7VA","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"h5Fz8LxRi7EISSg68ef74Q","stars":4,"date":"2017-03-11","text":"Great little place with fresh food and good service.  The owner is usually on location and is always consistently good.","useful":0,"funny":0,"cool":0},
{"review_id":"sLzZIFjmOuoKPCeA1RE-xg","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"MJd63eC5qluvww6ERoZRBw","stars":1,"date":"2016-12-23","text":"Rude staff, food is good but by no means a clean environment. They have let his place die a slow death it seems.","useful":0,"funny":0,"cool":0},
{"review_id":"O6NOjmD4xqkLju5g0hdUkQ","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"FexomhlA5G7ipOEH3pqFkA","stars":1,"date":"2017-01-22","text":"Would you like food with your salt?  Extremely overpriced and food is very high in salt. Service isn't the best either. Don't expect the same taste as the American chain.  Just close down already!","useful":1,"funny":0,"cool":0},
{"review_id":"ywxrulzXwQqo_2OQ5DwkTQ","user_id":"E1gfrlDDqim0hmPfAx17tA","business_id":"6fPij_e83qj9OUgMvujkwg","stars":5,"date":"2017-03-11","text":"Great place and excellent food and service.  Diverse menu and staff can lead you towards what is popular and tasty.  \n\nWell done!","useful":0,"funny":1,"cool":1},
{"review_id":"MF3csLWPonl-CxZf7P7uyA","user_id":"sDBdjK94wbXDIeN78rLwjg","business_id":"OYINXFNsJH1th423Pb3qxw","stars":2,"date":"2014-11-06","text":"I'm a big tiki culture fan. Walking in side I got stoked the place looks like a tiki bar. I approached the bar asked for my favorite tiki drink the \"painkiller\" the bar keep didn't know what it was. I asked for a drink menu.  No drink menu. I asked if he could make a tiki drink. His reply was baffling \"we're a dive bar bro\" ok. So basically it's a tiki bar that serves beer. Weird right.  If you have the theme why not make the drinks? Just saying.","useful":9,"funny":2,"cool":2},
{"review_id":"Q6lZPGh7iriQakqPpKGUpQ","user_id":"sDBdjK94wbXDIeN78rLwjg","business_id":"McoGYpK3JgrX377D7Crs6Q","stars":4,"date":"2014-10-12","text":"Metro is a great place to kill the time. Ok music and great people watching. Cider on tap beer on tap good mixed drinks. The waitress staff and bartender staff are all nice folks and work hard for their money.","useful":1,"funny":1,"cool":3},
{"review_id":"PW0-zwC77oQHxGKJe9nxwg","user_id":"sDBdjK94wbXDIeN78rLwjg","business_id":"YehAO48XhFcDBDTZd_fhTQ","stars":5,"date":"2014-10-22","text":"Really great staff here.  I needed a large order done prior to there opening. They did me a solid and opened a little earlier than they normally do so they could get my order done in time for me. The food was great and my clients couldn't have been happier. Thanks guys and gals working on Oct 22 morning you all rock. I owe you.","useful":0,"funny":0,"cool":0},
{"review_id":"19bJKqfkZsQOb2DBHwFhsg","user_id":"sDBdjK94wbXDIeN78rLwjg","business_id":"TZlAcfHkAMnIGT0x77Cwvw","stars":1,"date":"2014-11-22","text":"This place is slow. Took my truck in for an oil change. 2 Hrs later it still hasn't got done. Hasn't even moved from the first position in line.  That's two hours of my time sitting in a horrible waiting room.  Wal-Mart would have been better.  If you want to waist your day then defiantly take you vehicle here for an oil change. Slow..............","useful":0,"funny":0,"cool":0},
{"review_id":"dM1DGNsbF-eGXI2JzSBuww","user_id":"nMfyVFpbaSABY-DIfH-H_A","business_id":"9fRmwuNWv56l-pHLDYW6lQ","stars":5,"date":"2014-07-22","text":"As a relative newcomer to the Valley, I selected Harris Dental based on their reputation, and over the course of several visits for both routine hygiene as well as a cosmetic dentistry procedure, I have found that their reputation is well-deserved and worked-for by everyone in the office.  This has been evidenced in every interaction I have had with anyone in the office, whether on the phone or in person, from the receptionists to the dentists themselves.  Dr. Joe and Dr. Brian are warm and personable, skilled and efficient, but never rushed.  Their passion and dedication to their profession felt singularly focused on me and understanding the outcome I was looking for with respect to repairing teeth damaged in an accident.  Dr. Brian went far beyond anything I could have reasonably expected to repair the temporary crown I clumsily and thoughtlessly damaged on a Friday evening, meeting me at the office at 11 PM that same night (yes, 11 PM!) to patch me up for a charity event I was supposed to attend the following morning.  Amazing level of service!  Likewise, the hygenist I have seen through repeated cleanings has knowledgeably guided me back to healthy gums with extremely practical suggestions (namely, water flosser) after a few years deferred dental care due to multiple moves left me with sensitive, receeding gumlines.  I'm releaved and excited to be back on track to a healthy smile with tangible, measureable results.  Ultimately, I am very grateful to have found a dental provider that so clearly strives for excellence in every facet of the service they provide their clients.","useful":1,"funny":0,"cool":1},
{"review_id":"exM59NJMuAyxXpApv2BAYA","user_id":"nMfyVFpbaSABY-DIfH-H_A","business_id":"IsmLGBiitZ89uNLQ7epmOA","stars":5,"date":"2017-02-03","text":"I've been going to another, big name tire shop for years with no complaints for tire purchases and tire-related services.  Community Tire first popped onto my radar as I was searching for the best prices in town for some bigger shoes for my truck - they appear to have great tire prices, and they have great reviews.  To try to keep a long story from being excessively long, I ended up buying some used tires elsewhere and also having my regular mechanic install some new struts to level out my ride in preparation for the new tires.  I knew there might be some fit issues and that I would need an alignment.  I scheduled this to be done at another prominent, well reviewed shop I won't name that \"specializes\" in jeep and truck lifts and aftermarket modifications.  They tried to mount the new larger tires but found they were rubbing on the upper control arm.  Knowing that other first generation Toyota Sequoia owners had successfully mounted the tire size I was looking to run with the addition of wheel spacers, I asked whether adding a 1.25\" wheel spacer would solve the clearance issue.  They said no, just can't make this work for your truck.  Since I knew this was incorrect, I didn't press the issue.  I get it - they just want to do their normal routine on jeeps and 4-runners.  And they completely lost all technical credibility with me.  I will just be on my way, thanks.  Oh, and I had also asked whether I would be able to mount this tire size in the normal spare location.  They said they checked it out and it wouldn't fit.  To their credit, they didn't charge me for their half-hearted, failed attempt.\n\nEnter Community Tire.  I called and made an appointment.  Arrived, wheel spacers and tires in hand, and explained the situation.  This should work, can you guys take a look and see if you can make it happen?  They test mounted one tire, bolted up the spacer and the wheel, and brought me out to show me the clearance.  Looked good, should work.  Finished it up, got everything aligned (lifetime alignment), and even managed to squeeze the upsized tire into the normal spare position.  Totally awesome, on my team, phenomenal service at every step!\n\nDrove it a bit and noticed a little bit of rub at near full-lock with the suspension a bit compressed.  Looked at some further information on various Toyota truck forums and determined the alignment specs might need some tweaking to solve the rub issue.  Called Community Tire back and they said bring it back in and bring your alignment specs, we'll take a look at it.  Now, these guys have been crazy busy every time I've been in.  Alignment rig occupied non-stop.  They get it up and try to get it to my specs and essentially redo the alignment.  No luck, no more caster adjustment left with my UCA's, but they tried.  And they wouldn't take any more money from me.  I insisted, knowing I had just used an hour of valuable alignment rig and tech time, but Kevin wouldn't hear it.  Amazing, old-fashioned, treat you like they really care service.  I've been telling everyone I know about Community Tire as occasions arise.  Getting service from them was a refreshingly outstanding experience.\n\nKevin answered the phone and handled my service visits.  Kevin rocks!  That place is a beehive of activity, with the phone ringing non-stop.  Even though a couple weeks had elapsed between my initial visit and return and he's probably seen and spoken with hundreds of people, he remembered me and the job and provided incredibly friendly, personalized service.  Everyone there seems great.  I didn't catch his name, but the tech was super friendly as well.  \n\nThe term \"Community\" in their name is meaningful and aptly used.  Support local business and do yourself a favor too - try these guys next time you need tire, suspension, or other auto services.","useful":0,"funny":0,"cool":0},
{"review_id":"EzZgZEONolFModoD5WjVgA","user_id":"CeF2iP9ZY_IbyD8IJhfqmA","business_id":"El4FC8jcawUVgw_0EIcbaQ","stars":1,"date":"2015-12-26","text":"A big hotel. I understand. Lots of people checking in. \nChristmas night. Ok, you might be lighter staffed \nLooking like 2 + hours to check in??? At 11pm at night?????\nNot worth my time. Lots of other places around to stay at. \n\nWould have been long gone if it was a refundable reservation.","useful":1,"funny":0,"cool":0},
{"review_id":"UeH3f4r8X-utnsYOuriP3w","user_id":"i2VXnkwBhdr--VndElCPfg","business_id":"OVTZNSkSfbl3gVB9XQIJfw","stars":1,"date":"2017-07-28","text":"At one time this was one of.the best buffets in Las Vegas but good things do come to an end.  We recently visited the Cravings buffet on 7\/24\/17. It was a joke.... $29.99 for dinner which includes alcohol.   The salad bar had greens that looked days old and wilted.  I waited 15 minutes at the  pasta station and the chef never showed up. He was in the back. The Asian food section dishes were nearly empty and lets not even mention latin dishes. Grossssss.  No staff to clean the stations, refill dishes, you have to walk across the restaurant to serve your own drinks and are still tacked with 18% gratuity! For what??? I NEVER once had a waiter come take out plates away?? Save yourself the stomach ache on this place. Visit the Aria if you want a real buffet. I know I will.","useful":0,"funny":0,"cool":0},
{"review_id":"-01Pak82IwNtDam-6TSksQ","user_id":"6f6tttboYKy0QBmomP60eA","business_id":"cDaxoMopGwguj9wlJMStOg","stars":4,"date":"2016-07-25","text":"A nice selection of loose leaf teas similar to David's Tea or Teavana, but independently owned. It's a really cute space and the owner has curated a varied collection of other items for sale (soaps, jewellery, tea sets, etc).","useful":0,"funny":0,"cool":0},
{"review_id":"TSWYHtzXH3X9lRtWNGZT2A","user_id":"6f6tttboYKy0QBmomP60eA","business_id":"ZYTTggT0haYooWAX_T9Ufg","stars":4,"date":"2016-07-25","text":"Really satisfying cheap thai. Decent pho, good stir fries and spring rolls. Cash only.","useful":0,"funny":0,"cool":0},
{"review_id":"mKTT6K_dmk-u1dgPn3UpaA","user_id":"6f6tttboYKy0QBmomP60eA","business_id":"AaWlhVc96VvdwNGMiW7HeA","stars":4,"date":"2017-11-28","text":"Really lovely fresh vegetarian fare. They are very accommodating to dietary restrictions and the menu is really clearly marked.","useful":0,"funny":0,"cool":0},
{"review_id":"FebaRHR10yf9m14whhHxAA","user_id":"6f6tttboYKy0QBmomP60eA","business_id":"es3Uj0jMtHstkvwNNhihNQ","stars":4,"date":"2016-07-25","text":"The sushi is nice and fresh. The presentation is beautiful and the staff is very hospitable. I usually get take out because i live nearby and they always give me some tea and a salad while I'm waiting. Good prices too!","useful":0,"funny":0,"cool":0},
{"review_id":"CWr6_KAvQRf7maPg_WHtBw","user_id":"6f6tttboYKy0QBmomP60eA","business_id":"02Ycww2etUAxorZb5gIM8Q","stars":5,"date":"2016-07-25","text":"My favourite bakery in the city. Everything they make is excellent: pastries, breads, gelato, coffee, cakes. I love that it's a family business being run be the younger generation. They obviously care a lot about their community and it creates a wonderful atmosphere. Some highlights are the cannoli, their ring cakes and the olive ciabatta.","useful":0,"funny":0,"cool":0},
{"review_id":"W7AcHmcFuRlHpBx2JcDZdA","user_id":"-TS2V7tlwSGdGeekyc_Y4A","business_id":"kIUhkZlBr5lgO_pj_DHuow","stars":4,"date":"2015-12-05","text":"In business in Chandler and stopped by here. It's not as fancy as some of the other places but wanted good food and good drinks. Was not disappointed. Sapphire was my sever (yes she said it with a straight face and I bit my tongue) but she was very cool. Worth a Friday night outing. Music not too loud either so you could chat no problem.","useful":1,"funny":1,"cool":0},
{"review_id":"0U0KGI0C3WPUrHpOop_vQQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"h4xSuggtvadNsYQKzNCbFQ","stars":2,"date":"2011-09-13","text":"I have been going to this 24 H location for two years. When I started it was decent, now it is terrible. Downhill all together. \n\nHalf the cardio equipment is broken on a daily basis, the smell is terrible in there, always out of sanitizer and paper towels, the front desk clerks are somber and unattentive. The AC was broken on and off throughout the AZ summer and the front desk would deny it was broken one day, then the next day a different person would admit it was broken and in process of being fixed. That whole ordeal lasted a few weeks. \n\nThe only positive is the classes. They are always enjoyable and the instructors are great!","useful":13,"funny":1,"cool":1},
{"review_id":"FD8qnNUjiodCYLpXUjMdFw","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"CgDonXv70Ha2BkKOIkJWKw","stars":2,"date":"2011-09-09","text":"I went to Urban 7 twice since it opened. Hoping the second time it might redeem itself. The food was not good at all. I had a BLT the first time and a chicken sandwich the second. Two things you think would be hard to mess up? Cold, the bacon looked like bacon bits from a can (was expecting fresh juicy, crispy bacon), the sauce that they put all over the chicken sandwich tasted like pure wasabi. In addition to this the service was poor both times, the restuarant was empty yet the service was lagging. The waiter would have 20 min conversations with people who clearly were trying to eat dinner and not interested in chatting, but just were being polite. All this while his 2 other tables (mine) and another couple sat and rolled there eyes at eachother.  They were out of major things on the menu. The presentation of the food could use work as well. It just seems like this place is on the cusp of closing down and keeps changing the menu in hopes of it working but need to focus more on perfecting simple items on there initial menu, presentation and service rather than weak attempts to change the menu everytime they get a bad review on here.  The location is great, the interior is great, the patio wonderful. This actual structure has great potential. I know that this is owned by Frank and Lupes, which is excellent, so maybe they need to focus there efforts on one thing and not get too much in the hopper.","useful":0,"funny":0,"cool":0},
{"review_id":"6JIBp9-NwSs1aotzl-IKbQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"2GmGT-7QjowR1ihup3FbVA","stars":5,"date":"2014-01-02","text":"Been here 3 times this month. The chicken shwarma plate and gyro plate are excellent. The prices are great, portions are huge and i can never finish it all. Service is good. Highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"w1DWcuc-j5psVO4ZN9c_-A","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"5BJKXuwxjn-TUAoyImzHkw","stars":5,"date":"2011-09-09","text":"They have very reasonable prices and are always running an online Groupon or Weekly Plus special. The spray tan is well done, even and lasts for about 5 days. I have been going here for 1 year now and Donna is terrific. She is always punctual and gets me as dark as I prefer. I don't even have to tell her my preferences now, she remembers and just does it right!","useful":2,"funny":0,"cool":0},
{"review_id":"G6hVomVG5weDbgOPbHX7pQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"9H50C_eXdwu2d8_OdHnSMQ","stars":5,"date":"2012-05-09","text":"Dr. Sanford and her staff are always very kind and have great bedside manner. Dr. Sanford really cares about the patients confort during the dental treatment processes and has a goal of preventative care. Launi and Adrian, two of Dr. Sanford's team members are great and always very compassionate and caring.","useful":1,"funny":0,"cool":1},
{"review_id":"rBAtgn8w9aQDq3wsz_4Tcw","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"e-JcWplcnIx6lRmQoRF-Dw","stars":5,"date":"2012-12-17","text":"Donna does a great job! The spray tan is always even, great color and lasts for a week! She manages the place very well. I am always taken in for my appt on time. Arizona Airbrush prices are the best in Old Town!","useful":3,"funny":0,"cool":1},
{"review_id":"ytLYg-4NAarlRVFOhcN52g","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"CbO40gVd-JlkdwtRBmKXeg","stars":3,"date":"2015-03-23","text":"I have cycled a lot of places over the years including Lifetime, 24 hour, Mtnside, Studio 360, Madison Improvement, Core Balance to name a few. Below is my review of Forza. \n\nPros:\nBikes are nice, and likely really preferred by cyclist who road ride. \nThe owner is a kind lovely woman\nStudio is clean and well kept\n\nCons:\nThey leave florescent office lighting on the entire class (not traditional to cycle classes)\nThe music was not loud like traditional cycle studios, nor was it current music\nThe energy of the teacher was rather low, not very motivational\n\nFinal thoughts: \nThe bikes are not typical spin studio bikes, so if you are used to normal spin studio bikes these might take some getting used to. If you are a road ride enthusiast this is the studio for you, if you prefer the inside traditional cycling \"spinning\" type class, this is not for you.","useful":1,"funny":0,"cool":0},
{"review_id":"RWXLg5RHESdsmd2hV_p5zg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"73AQI-b7Eimtx1n9exicag","stars":5,"date":"2012-09-26","text":"Goober is a great pet store. I am in Phoenix, so they deliver my cats food right to my front door for free! They have unbeatable prices on Wellness brand canned cat food.","useful":0,"funny":0,"cool":0},
{"review_id":"qEuCcCT6NtxhiF1zvdRaPw","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"thLX_k20SPJ0KyusGTBIHw","stars":4,"date":"2015-04-06","text":"I had a cod taco and a chicken taco. Both were very good! The service was excellent, and the patio is nice. The only complaint was that I have had better margaritas, larger, stronger etc for less $ at Blanco or elsewhere. But overall this is a great place. \n\nIt's a very casual, laid back crowd, not the Scottsdale scene you might find other places in the area.","useful":1,"funny":1,"cool":1},
{"review_id":"YzyDtQxDGlLXn6hyzJhqWg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"PWW_jT4tHP_r1S18ePJyTQ","stars":4,"date":"2014-06-27","text":"I have been here on several occasions for lunch\/dinner. Service was good, food is good, prices are decent. I always order the gyro and hummus for an app. I just wish they served rice with the gyro! I love rice.","useful":0,"funny":0,"cool":0},
{"review_id":"kGx7Be6FbnkB85KkiFsTLQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"cTJjTKz2huGZ-ElScC2pSw","stars":5,"date":"2015-12-11","text":"Fatoush salad is great, service is always top notch! Parking is easy!","useful":1,"funny":0,"cool":0},
{"review_id":"VQcEE4-Nl4Avnz6VPkpHZQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"ykb78lXHMHjNFBPVOL5meQ","stars":1,"date":"2012-06-27","text":"I don't know if it was an off day, or if I just liked this place in college because I had no taste buds after a long day of drinking. This place has nothing on Chipoltle. The chicken was dry, salsa had no kick, and rice has no flavor.","useful":0,"funny":1,"cool":0},
{"review_id":"sxAap7YF9NF29X5fdFX7dQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"g2qBncrNraG9NLRA5Om1zA","stars":5,"date":"2012-11-01","text":"Laura is very nice, detail oriented and punctual. She makes sure you are the exact shade you desire and that you leave happy. Cute salon too! Clean and neat.","useful":0,"funny":0,"cool":0},
{"review_id":"SA_swGzaJCsWc2lsh41dfA","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"Cz_lLTWqC9bhwxTdcq0oFw","stars":3,"date":"2014-06-30","text":"For the price you can belong to Lifetime, and have an entire state of the art facility at your disposal. Here you get a nice facility but classes only (no cardio or other equipment) for MORE a month than a swanky full service fitness center. Also, they are using the same class instructors that I see regularly at Lifetime and 24hour fitness, so nothing out of the ordinary there. The class offerings are nothing out of the ordinary either: Crossfit, Cycle, Yoga, HIIT. Overall, I just don't find the concept all that impressive. I feel like if you are into crossfit, you go to a crossfit gym, if you are into yoga, you go to a yoga studio, and if you want all different classes, you go to a full service fitness center that offers those classes and then some.","useful":4,"funny":2,"cool":0},
{"review_id":"E8VFL4PkwtVF-xkZMEX70w","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"zOvZaiuzxUBzQE0Uecg-aw","stars":2,"date":"2015-01-19","text":"The service was great. That's all that was great. Ordered the wedge salad and the blue cheese on it was grayish black in color. They took it back. The pizza was the worst I've had. Dijorno would of been better at home in the oven. Never again.","useful":0,"funny":1,"cool":0},
{"review_id":"eJJGmHdgLfcnr1M12T45Fg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"AqKWtFTREQ_PFSYiIWnBgw","stars":1,"date":"2015-12-11","text":"Had the Chicken Teriyaki. It was awful. No flavor, the chicken was fatty. Took two bites and threw it in the trash. It was so bad I was fearful of food poisoning. Just didn't seem fresh. The one star is because I had to give it a star to even write this. For $10 I would rather have Chipotle.","useful":2,"funny":0,"cool":0},
{"review_id":"L7vWJNHUwsoQG6oWzmtz8A","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"ahyNR2Sfgrrbyds1nWq6cg","stars":5,"date":"2016-03-11","text":"I sent my sister flowers today and she loved them! They are the most gorgeous pink lily bouquet I have seen from a florist in my life. The prices were very reasonable and the customer service was superb!","useful":0,"funny":0,"cool":0},
{"review_id":"fpvK08CmIg_9dxXOvp0mqQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"4p6Wce7Ed707QS2-yQkvZw","stars":1,"date":"2014-06-20","text":"The service was good, atmosphere fine. I had a chopped chicken salad. It had 5 tiny slices of chicken, a 1\/2 cup of iceberg, an entire raw onion cut on top, a few tomatoes. It was a salad I could have purchased in a bag at the grocery store, only difference was it was $13. Not impressed.","useful":2,"funny":1,"cool":0},
{"review_id":"xcS7o9KoNAffMOEdklTGDQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"oyCRc4Zs2RkKOHy9IAa3wg","stars":3,"date":"2016-12-05","text":"The food is good, and ambience is nice. I have been 3 times, had the burger one time, the enchiladas and a salad another time. All the food was excellent and tasted fresh and clean. The service the three times I was here was not good. Lots of employees on the clock, but it isn't clear what most of them are doing. It wasn't busy any of the times I was here so don't know why the service lacked. With all the options in central Phoenix they will need to improve that to keep up.","useful":0,"funny":0,"cool":0},
{"review_id":"Tfe9IyV3DW8pA2HsnQcobg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"togzltbV52oGR-a0jddqZw","stars":5,"date":"2012-05-16","text":"I have gone to AZ Tip & Toe for 6 years, religiously every 10 days. Jason and Tracy (the owners) run this place very well. It is always clean and the tools are always fresh out of the sanitizing machine. They use high quality gel polish and products. The prices are affordable. The only complaint is that they don't seem to ever have adequate staff for busy times such as evenings and weekend. I would suggest making an appt if you don't want to wait.","useful":4,"funny":0,"cool":0},
{"review_id":"P2L3A5gGSJrJVLAPaFlZeQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":3,"date":"2012-12-30","text":"The service is great and atmosphere is terrific. The pizza was good, but I wasn't necessarily impressed with the crepes for dessert. Too much Nutella and not enough bananas. Appetizer we had was sub par. Personally I don't see what all the hype is with this place. Not a bad experience by any means though.","useful":0,"funny":0,"cool":0},
{"review_id":"8y3vAOW1nhX4O2MVX66NJQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"9vXJXydGeJHLdhRohfd59w","stars":5,"date":"2016-03-11","text":"Prices are great, service excellent, sushi is fresh! Great concept.","useful":0,"funny":0,"cool":0},
{"review_id":"dzMUkT_NGcsboYqR8Js8cQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"bmS1onKPckNWPPREDAC8Gw","stars":5,"date":"2011-09-09","text":"The salon is great! The spray tan was even and wonderful. The owner is very pleasant and makes you feel very welcome and comfortable. The prices are reasonable. The only thing I disliked was that I went at night and the building that the suite is in is dark, parking lot empty, no lights and when i was leaving there were not one, but TWO strange men lurking in the parking lot. I had that fast heart beating moment of fear to get to my car as fast as possible. It would be nice if they left lights on for Phoenix Glow since they have evening hours, but it appears all the other suites likely close up at 5PM. Maybe its just me being a scaredy cat though!","useful":0,"funny":0,"cool":0},
{"review_id":"aBb09gyw4XEh3gfr6oBNJg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"Ns20WGWn6s6niKAGIQB4UQ","stars":5,"date":"2013-10-29","text":"I went here for lunch one day, and it is excellent! I had a chicken bowl, and the chicken was sooo wonderful and flavorful. The service was good over the noon hour, and the decor and vibe was nice. I would go back for sure!","useful":0,"funny":0,"cool":0},
{"review_id":"jziqNdH-ZDWFhZntBnHRYg","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"ENcX59YbJYF0Yh7MX7PyBg","stars":3,"date":"2012-11-01","text":"The girl working was very nice and helpful. I don't lay in tanning beds, so I came to use the Versa. Unfortunately, they only offer one color shade (which is the very lightest) in their Versa. It literally gives you nothing. Like you didn't even have a spray tan. I am used to the Versa at Dolce where you can pick your shade and I always do the darkest.","useful":0,"funny":0,"cool":0},
{"review_id":"fYgPhprYHifxZ0J9T65IHQ","user_id":"LUsNCIM2zqLv-D1eRk2QoA","business_id":"nhcAbo6FT9VRDZ4V9AGxnQ","stars":3,"date":"2014-07-27","text":"The burger was excellent! The fries were meh, the shake was meh. But the place is known for burgers so I would go back for that alone!","useful":1,"funny":0,"cool":1},
{"review_id":"uMEFgYEh5whVkBzgsvt-Tw","user_id":"ZZFc_eEaW0l_yrTRAEjBPw","business_id":"0HV8dSmn81fLVr1p-Tqocg","stars":5,"date":"2016-05-18","text":"Having been spoiled in Huntington Beach with an amazing yoga studio that truly focused on the art of mind, body and soul; I was hesitant that I could find one that compared in Scottsdale. This studio is amazing with classes such as Yoga Nidra and Kundalini to name a few. The instructors are caring, skilled and have a beautiful energy about them. This is truly one of the best studios I've been to, including ones I practiced at in Indonesia. Beautiful studio, incredible energy! You won't be disappointed here!!","useful":0,"funny":0,"cool":0},
{"review_id":"afwGwzuU6ia_m45yWisOPw","user_id":"ZZFc_eEaW0l_yrTRAEjBPw","business_id":"wkW_FjO6kIDOw61RsXtdeA","stars":5,"date":"2015-06-16","text":"Dr. Liu is absolutely amazing! I have two chronic illnesses and am seen by an extremely well known and famous clinic in Arizona. Dr. Liu has been able to treat and cure issues that they cannot. After one visit you will feel immediate relief. Just a few visits and you are free from your pain or chronic issue! This Dr is a true healer and I am so grateful for what he does! \nMy sincere thanks Dr. Liu!!! You're wonderful!!","useful":7,"funny":0,"cool":0},
{"review_id":"xqxCcLAshHOADrMuyr6k3A","user_id":"ZZFc_eEaW0l_yrTRAEjBPw","business_id":"D-QCvt10lGgaqvAV-9rMLQ","stars":5,"date":"2017-01-07","text":"\"From the very instant I met Gloria, I had an instant connection with her! She has a beautiful, positive energy about her and is very in tune with her clients needs from the beginning.  She focuses not only on listening to you, but has solutions to help balance your energy, your mindset and to provide ways to improve your life in a positive manner.  From the very first session with her, you will have new ways to achieve your goals and overcome obstacles in your life.  Gloria has an intuitive way to work with you by hypnosis and tune you in to your chakras, angels and energies to help remove obstacles from your life.  She not only can calm worries and obstacles, but can help to strengthen the inner \"you\" that you may be blocking.  In a few sessions, Gloria has helped me immensely to strengthen the person I know I am as well to rid negativity from my life. Don't wait to meet with her- she literally can help to change your life in ways you never imagined!\"","useful":1,"funny":0,"cool":0},
{"review_id":"7Ha6CRq-6rNIQFl6rATgDA","user_id":"ZZFc_eEaW0l_yrTRAEjBPw","business_id":"UE3AvVnaPEBPneVahYT2eA","stars":1,"date":"2017-02-05","text":"DO NOT GO HERE- VERY ILL MANAGER SERVING FOOD!!! I have never written a bad review on here, but this is a matter of public safety. Yesterday on 2\/4\/17, my husband and I came in for lunch. An assistant manager was coughing ( constant, wet hacking cough) all over the kitchen and food prep areas. She was serving food as well. We told the head Manager who was a bit snarky and said \" well, that's why I sent her home\". Unfortunately for all guests, he really didn't. She walked out the front door and quickly returned, back to the kitchen and handling food. We left and my husband asked the manager why he lied and why this was okay to endanger so many people with someone who was so very sick. He said nothing and was very lax in his overall concern for health. Very disturbing and gross!!! Real shame because we use to go here all the time.","useful":0,"funny":0,"cool":0},
{"review_id":"Yb0vKlEB3RsDm6MS50Dv6A","user_id":"ZZFc_eEaW0l_yrTRAEjBPw","business_id":"5fBPtsTbMqlFpIEU6aSLng","stars":5,"date":"2015-06-05","text":"Crystal is absolutely amazing! Very professional, friendly and excellent at sugaring! Make sure you ask for her, you won't regret it!!","useful":1,"funny":1,"cool":1},
{"review_id":"jjFmOgnXqX_PPbDTfqFZTQ","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"YhCAJ8acd1X7GkCHPhD8Xw","stars":4,"date":"2013-06-06","text":"a little loud, but i like how if you sit up top you can see them cook things.\na bit pricey, but which rest in vegas that isnt? lol\nnice huge tvs around the place if you want to watch games.\ni loved my burger the patty was nice and thick & juicy. it was simple, but i could taste all the flavors.\nchili and the waffle fries were okay nothing special about it.\nthe pickle was gross! i love pickles.. but not this one.\nthe tshirts the waiters were wearing were hilarious. \n\nmy only complaint was that they don't do anything for birthdays! \nanything would of been cool! especially when they are charging ppl up the whazoo for a simple burger ;)","useful":3,"funny":0,"cool":0},
{"review_id":"iOZ0Z_oRUagfGH1OJE0XSw","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":2,"date":"2017-06-07","text":"Went Monday night very short wait. \nHad a lot of selection, but some dishes were very salty.\nMost food were mediocre. Nothing special\nGreat selection of dessert.\n\nUnfortunately, i got sick immediately after eating. Did not stay to complain since i had a show to make. The next following day i puked my guts out at the airport. Luckily my friend did not get sick. I had more seafood than him. Prob that was what got me.\n\nBoth ends...Great way to end my trip. Saw the reviews that management did nothing for people that got sick. So much for customer service :( Definitely will not come back or recommend this place. Horrible Experience","useful":0,"funny":0,"cool":0},
{"review_id":"UMrHjkUJooqNmoL-R6kiuA","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"X8c23dur0ll2D9XTu-I8Qg","stars":3,"date":"2013-06-06","text":"I got there at 9:50 and was in a small line bc i heard it would be packed after 11, and it didn't take long to get in. DO NOT TAKE THE STAIRS. i can't remember how many levels, but it must of been 4 or more so girls if you are wearing heels or are drunk this might be difficult... The layout is fine i was out on the dance floor. drinks are pricey but which club isnt? so you obv have to pregame, but hey if you got the money & don't care spending? go right ahead.\n\nThe opening dj was terrible, and i left because there was a lot of ppl smoking and i couldn't stand the smoke. i was also kind of tired from the previous nights. so i left before calvin harris could come dj. I must of stayed at least for an hour, and when i left... the line was so long... like pass the store. i would NEVER EVER wait that long in a line for a club. \n\nand i read some reviews about how ppl paid to get into clubs. i never pay.. lol why spend money when you don't need to? the only downside of getting free admission is that you have to get there early basically when the clubs opens like 10pm. Usually the 1st hr is usually the most boring part, but hey if i can save 20-40$ i'm doing it!","useful":4,"funny":1,"cool":0},
{"review_id":"2QDYOK3FLSME4kM18UyXcQ","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"makqSKZaz1aUipoWBW0BsA","stars":3,"date":"2011-07-24","text":"Great place for behind the strip. \n24 hrs starbucks inside which is awesome. (free wifi?)\ninternet charge is expensive... $13+ each day depending on how much you use\nThe food wasnt great & it was pricey. \nthe room was fine beds are great & comfy, but had stains all over the carpet.\nthe spa was nice i got a massage & a pedicure. The massage the lady was nice, but her touch was too gentle for me. (free drinks & snacks)\nthe pool is small, but usually there isn't a lot of ppl so its nice to take a dip & tan. \ngas station right next door great for drinks & snacks.","useful":0,"funny":0,"cool":0},
{"review_id":"KM9pfUTF_y_AtrcK3VMB4A","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"BLIJ-p5wYuAhw6Pp6mh6mw","stars":2,"date":"2013-06-06","text":"this review was for the hypnosis show\n\nthere were some parts that were funny, but overall it was TERRIBLE.\ncan't complain much since it was a free show for me, but i felt like i wasted my time sitting there. I've been to a hypnosis show before at a college campus and it was highly entertaining.","useful":3,"funny":1,"cool":1},
{"review_id":"ayGMPS9RmIr_ntrOtgx_aA","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"DfgZlNgKwBvCpA_0alumXw","stars":3,"date":"2013-06-06","text":"i went the past weekend for my birthday i was somewhat disappointed in the hotel. I've been to vegas 4 times now. The price i paid was decent since i got a deal from southwest, but i thought the hotel would of been better compared to when i stayed at planet hollywood. I was definitely wrong. \n\nHere's a few things that i liked about the hotel. I loved the aquarium, the flowers, the variety of restaurants in the hotel even thought they were pricey. i wasn't afraid to spend money. i loved the pool it was huge and gorgeous! but you have to get there early or its hard to find an empty lounge chair if you have a few ppl in your group. \n\ni was disappointed that the pool closed at 7. I was disappointed in the bathroom size. i had a tower king room? the bathroom was tiny! i thought it would of been nicer than PH. so i figured i should stop comparing, but this room didn't even have a coffee maker. I asked for hot water and they were about to charge me 4$! or $10 for a kettle. \n\nI had a 252$ spa serv for a massage, mani & pedi. Great ppl very professional. The masseuse i had wasn't that great i expected better since it was at a hotel AND gratuity was included... can't remember if it was 18\/20% the lady who did my nail was nice & great at conversing, but didn't realize she filed one of my nails too much! so my nail was slanted looking. i was pissed! but i didn't say anything because it was too late. when i checked out the i told the lady and she asked if i wanted to tell the lady about it... i was thinking no theres no point since she filed my nail already. i obv said it trying to think that they would do something for me like a discount or a small gift. couple days later the color on the edge of my nails came off! didn't even last a week, and i wasn't even doing anything but enjoying my bday weekend in vegas! ( i had a better spa experience at the WESTIN)\n\nthe carnegie: the food is pricey and it is decent but large portion. its great that it is open 24 hrs. the coffee tasted like water and the bagels were hard as brick. we were craving breakfast i should of just went to the buffet! lol but we slept in...\n\nthe blt burger was pricey, but prob the best burger i had in awhile. SO TASTY! \n\nit was cool that this hotel had quite a few shops like froyo, candy store, tattoo shop, sport shop, watch, and etc. \n\ni would not come back to stay at the mirage. It is a nice location somewhat in the middle. the place got the dim theme going on. even the room the lights are ALL dim. it drove me nuts especially if i was trying to look at something if it was the day time i would of have to open the blinds. it bugged me bc i wanted privacy","useful":3,"funny":1,"cool":1},
{"review_id":"qd1pX77ASKIKfFMOWqRDyw","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"qEJjv2k8nDhOiYpmi_aVOw","stars":2,"date":"2013-06-06","text":"it was difficult to get to this place, and ppl are terrible at giving directions to first timers. \nbut i can't remember now what floor it was on, but you go through few security ppl. you get your stamp from the store right in front after you get off the escalators once you get that you enter through the security check pt to the elevators into the pool you're greeted. Asking for your room key, and if you don't have it you show them the stamp that you're there for tao beach club.\n\nTheres a lot of pool sections, but tao beach is basically located in the FAR left corner. once i got in i was laughing at how small the pool is. great music, but i had terrible serv. my friend kept getting ignored when she was trying to get a drink. All the seats were taken, and i saw ppl passing the beach balls & such. looked fun, but too crowded for me. I got my free drinks and was there for a bit to listen to the music & than i left.","useful":1,"funny":1,"cool":1},
{"review_id":"S9VbYIZFljgNEidNVKs1TQ","user_id":"c9ljz9m6Fmmz6A8ITdubqg","business_id":"l3joBBpkq0ib11dKUpKMAw","stars":4,"date":"2013-06-06","text":"loved the place\ncan't really write the review about how fair the pricing is cause i don't know..\ni loved the individual rooms for privacy reasons\nmy only complaint is that sometimes the random background view is distracting when singing. and some of the songs the tune is slightly different from the original \n\nthe staff is very helpful & sweet. i had an awesome time because i didn't realize i was there for about 3 hours lol\n\nsome other group supposedly stayed for 10 hrs!","useful":0,"funny":0,"cool":0},
{"review_id":"j00vMrBz1d1HhT2qBB2TZw","user_id":"Kyp8ePFG9hYXoQCe80tQvg","business_id":"SSCgpKNpco3l-YZ2MC-lMw","stars":5,"date":"2017-02-05","text":"Best pork sovlakie I ever had and my friends loved their burgers. Also saw two Metro Toronto police officer having take-out so you know the food is good.","useful":0,"funny":0,"cool":0},
{"review_id":"OoU_LDZXq0Yu39zaClbY9g","user_id":"Kyp8ePFG9hYXoQCe80tQvg","business_id":"z_twvOBwyGNbuxJhsiJofg","stars":5,"date":"2017-10-17","text":"Yesterday, a friend took me to PG Clucks on College in the middle of Little Italy and came to this little hole in the wall next to the Royal Theatre.\nIt wasn't much to look at and could do with some new decor. It wasn't hard to notice that their was no inside eating area or tables just a little counter. I order the spicy classic and my friend a mild classic. We walked for about 30 minutes to my friends house with both sandwiches in tote.\nWhen we arrived I was thinking that these sandwiches would probably be cold and soggy. Mine was still warm to the touch and still intacted and not soggy. I bit into this sandwich and I was really impressed with the flavour and texture of the chicken and bun. The spices were just right and not to over powering.\nThis is the best chicken sandwich that I have eaten and have found my new sandwich place and can't wait to try the honey and jalapeo and some of the sides.","useful":0,"funny":0,"cool":0},
{"review_id":"pwZG1cd-0fXPI6mQCtJqew","user_id":"Kyp8ePFG9hYXoQCe80tQvg","business_id":"pxk3liuqNhyo1WB_8ki6YA","stars":5,"date":"2017-02-06","text":"Best burger and fries my brother and I have had in a very long time. Not a fancy place but burgers are great. Will be returning in the near future.","useful":0,"funny":0,"cool":0},
{"review_id":"OE3Scy64BKmGUEYf8qrD3A","user_id":"Kyp8ePFG9hYXoQCe80tQvg","business_id":"zpwl8rQBGrO1XkP1CYBtvg","stars":5,"date":"2017-04-11","text":"Yesterday my wife and three grown up kids stopped by Adonis for some produce and groceries while visiting my eldest daughters new home. We decided to get something for lunch at their snack bar\/deli and take it to my daughters home.\n\nI was first amazed by the customer service and how they explained the contents and gave us some samples to taste. Bought some roasted chicken, garlic potatoes, falafel, fatouish and other items. Also got an assortment of  8-10 different buklava. \nBest take out food I've ever ate and there fresh baked on site pita bread is a must, soft and slight chewy best ever.","useful":1,"funny":0,"cool":0},
{"review_id":"F30E5Sc3HgEaPl31UJQvLg","user_id":"Kyp8ePFG9hYXoQCe80tQvg","business_id":"e9B_DBnyl7MiPyY7ySGR0Q","stars":3,"date":"2017-04-12","text":"My daughter and I were in Whitby Wednesday afternoon and decided to do sushi for lunch. So we decided on Sushi Today after checking the reviews and was recommended by my son who ate there quite often.\nWe were seated right away and it was not busy maybe a dozen tables were occupied. We were quickly served and got our drinks right away. We placed our order and the food arrived pretty quickly compared to most sushi AYCE (all you can eat) I've been too.\nThe sushi was alright some fell apart when picking them up. The orders kept coming and they were constantly rearranging our table as they placed our orders down. The servers were constantly removing our dishes as they were completed and to a point where our conversation was always being interrupted that we felt we were being rushed.\nI'm giving three stars for the food but zero for the service which was rushed and rude. The price was good but the service was bad and they rushed you to pay your bill.\nI'll probably never return because I've been to better sushi places around Durham region.","useful":0,"funny":0,"cool":0},
{"review_id":"bLn3LQ0fz8y5shpltC2thA","user_id":"zbcv_uhxrmEo9mMjBRLI3g","business_id":"Amo5UhXRFce_fegUnFEnMA","stars":1,"date":"2012-05-22","text":"The Laurel has always had one of my favorite Reuben sandwiches.  Last night I convinced my son to have one as well.  We both ordered them and drat -- they have changed their corned beef.  This is the first time I have ever had a Reuben that tasted like it was made with bologna -- not pleasant at all.  I hope they go back to their old corned beef for people's sake.  I doubt we'll go back t find out.  YUK.","useful":1,"funny":1,"cool":0},
{"review_id":"J0oqQQkWj-Ovwgcw5CrAGA","user_id":"zbcv_uhxrmEo9mMjBRLI3g","business_id":"gXPCCCp7-qoxUtdFfOrWmQ","stars":5,"date":"2013-10-22","text":"I had a bouquet of flowers sent to a very special friend that was in the hospital.  I told the lady in the shop that this was a very special friend and we needed our bouquet to say that to her. \n\nMy friend is enjoying looking at her lovely bouquet each day and her nurse told her, \"I see an awful lot of flowers in my job every day and yours really take the award for the loveliest flowers I have ever seen.\"\n\nThe do awesome displays and they will always be my first choice for a florist.","useful":2,"funny":0,"cool":1},
{"review_id":"BRdU8tbgCpF1YEUo0hVvMg","user_id":"zbcv_uhxrmEo9mMjBRLI3g","business_id":"6okGKL2PA7kkc-GjZzNHnA","stars":5,"date":"2017-01-25","text":"We went to Johnny's for Restaurant Week lunch and were delighted with the food, the service, and the entire experience from the moment we walked through the door.  Our meals started with both of us having the Italian Sausage stuffed mushrooms which were one of the best appetizers we had ever eaten.  The complimentary warm foccacia bread with olive oil, parmesan cheese, and cracked pepper is a really nice addition to the meal.\n\nFor our main courses I chose the lobster mac and cheese.  It was topped with a nicely crusted bread topping.  The lobster flavored the mac and cheese nicely.  My companion had the parmesan crusted steak with garlic mashed potatoes.  He gave me a taste of it and it was excellent also.  It was cooked medium rare and just melted in my mouth.  I've had many bad experiences of steak over the years but I now know it is SAFE and WISE to order steak at Johnny's where rare is truly rare.\n\nThe desserts were a turtle cheesecake for him and I had gingerbread cake topped with (and filled with) eggnog buttercream and set atop a port wine cranberry jam.  We had to eat those the next day as we were both too full to have them that day.  Both were excellent!!\n\nWe will be back!!","useful":1,"funny":0,"cool":0},
{"review_id":"j5A_eRQklAO_3O16uSRtfg","user_id":"a5GB__AM0HksURVe1lCmfg","business_id":"1SeD2yu2GDQ_RUQy97tP3A","stars":1,"date":"2011-04-25","text":"If you're looking for a clean room, this is NOT the place to stay. We stayed in the two bedroom suite and the rooms and bathrooms were not clean at all! The bathtub in one of the bathrooms had a huge hair clump in the bathtub, the grout in both bathrooms was black from dirt, you can tell that it was suppose to be tan from the tiled grout on the side walls, there was a wad of gum stuck on one of the floors in the bathroom, and the toilet constantly ran each time you flushed it. The bed duvet cover was stained, the kitchen upholstered chairs were stained quite badly. \nYou didn't really want to sit on them. the walls had scuff marks on them.\nEach room had an extremely loud window air conditioner rather than having central air.  So if you decide to watch TV in one of the rooms with the air conditioner on be sure to have the volume up as loud as it can go. Come on window air conditioners in 2011. \n\n     The breakfasts were horrible! The eggs were cold each morning and the potatoes were even colder. The staff was rude and most guests were complaining about how bad it was. The breakfast staff was clearly Ill  prepared since there was a 20 minute wait for the breakfast meat, then another wait for the eggs. Upon complaining at the front desk the staff member didn't really didn't seem to care.\n  \n     My advice...stay somewhere else, there are so many other choices in Las Vegas, SAVE YOUR MONEY!!!!","useful":1,"funny":2,"cool":0},
{"review_id":"qNlHUIj2Z_I0O8gifhbcFQ","user_id":"a5GB__AM0HksURVe1lCmfg","business_id":"U3ShrvhAFpv5mfT6z07eGw","stars":5,"date":"2015-07-11","text":"When ever we are in Vegas this restaurant is a must for us. The food is outstanding and the owner is truly a pleasure to talk with. The food is made fresh when you order it so it's not a fast food Mexican restaurant. The wait has never been long and they have the best chips. We've tried several different thing on the menu and have never been disappointed. Can't wait to go back again and again.","useful":0,"funny":0,"cool":0},
{"review_id":"AkqJP9idbF3sCkRnBLJrHw","user_id":"a5GB__AM0HksURVe1lCmfg","business_id":"mIJO9f2A3gfj4ahAM0QBQw","stars":5,"date":"2013-10-24","text":"What an amazing experience! We were so happy with our experience with Eco Electric. We are out of town landlords and the service was excellent. We spoke with Melissa and she was able to work us into their schedule the same day. They sent out Joe and he was able to trouble shoot the problem we were having. He did it in a timely and professional manner. The price for the repair was also very reasonalbe. If we ever need any other electrical work done again we will hire Eco Electric without hesitation.","useful":0,"funny":0,"cool":0},
{"review_id":"-zFd5nBrPlNsdhPDWKhOkg","user_id":"8v-DdAN6o_W2Aj-n6RT4AQ","business_id":"ap7qSvGnY3hrhjO1RQKn2Q","stars":1,"date":"2016-07-20","text":"I thought this location was 24\/7. Went this morning at 4AM and the drive-thru was blocked off, so I parked to go inside. Doors were locked, no one appeared to be inside and no notices were posted anywhere saying it was closed for a specific reason (cleaning, etc.). Lame.","useful":1,"funny":0,"cool":0},
{"review_id":"0rXlJkuUr6OfEv-vfcN0-g","user_id":"C-kCQiECfuYCert9FI96Iw","business_id":"m4EqSB0aI17jzMyCtdfWAA","stars":2,"date":"2015-05-15","text":"My wife and I visited this pool while staying at the Mirage April 30th to May 4th, 2015. We booked several months in advance, and knew that this would be a busy weekend in LV. We decided on staying at the Mirage based solely on their advertised offer of free entry to the Bare Pool for hotel guests before 12pm. We figured this was an adult weekend and we could use some rest and relaxation. We read some good reviews about Bare and decided to pursue it. The service was good, the food was decent for pool food, and the drinks were good, but overpriced- which is Vegas normal, I understand. The atmosphere was very relaxed, not unexpectedly small and more gents than ladies. We didn't really care about that since we went as a couple, but I mention it more as an FYI. There are two problems in particular that I am taking issue with. The first being that I was charged $50 to get in, in spite of the fact that this was totally contrary to what was advertised on their website. I mentioned to the 20-something kid at the register that this was the case and he acted like he could care less and said that's what it is because it's \"a busy weekend,\" end of discussion. I decided to pay anyway since our mind was already set on visiting this attraction, as was the other couple's that was with us. We all rented chairs (4 total) for $150 each, with the agreement that we needed to drink and eat the minimum price of the chairs or pay the difference. This was an aggressive goal but doable, so we proceeded. After agreeing to the chair rental, we were informed that we would also be charged tax and a mandatory 20% gratuity, which we had no problems with, but we could have been told beforehand in case we didn't like the ~35% increase in original quoted price. Regardless, our server was good and we tipped her more than what we had agreed to, but that's not where the second problem lies. Our otherwise good time was ruined by some \"Service Fee\" that was tacked on to our bill that was never once mentioned before our rental agreement. Really, what in the heck is a \"Service Fee?!\" We obviously paid for our food and drinks, and we generously tipped the server, why is there this surprise fee in addition to all of that? This came right at the very end when it was time to sign for the bill. I chose not argue about it since I am sure it would not have been taken off, so here I am warning all of you. Needless to say, we did not go back for the rest of our stay. The Mirage is supposed to be a world-class resort, and the stunts they pulled both with the FALSE ADVERTISING of free entry for guests and a surprise \"Service Fee\" after spending over $800 for several hours at the pool is just plain wrong. I could expect this type of poor treatment at a bordertown dive bar that is frequented by rowdy college kids, but for a property that prides itself on being a higher-end resort, like the Mirage, this is totally unacceptable!","useful":1,"funny":0,"cool":0},
{"review_id":"jbT0UXMsQCyJ-vlJFMjtmA","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"K-uQkfSUTwu5LIwPB4b_vg","stars":4,"date":"2015-04-06","text":"The signature margarita as good as it gets! Another virgin, blood orange, cocktail outstanding too. Side table guacamole excellent, popular too. The chicken torta was good, not unforgettable though. Mahi tacos battered, not necessary in our opinion. The mission fries were a mix of sweet and regular potatoes but mostly regular. Would not recommend. House chips and salsa great!","useful":0,"funny":0,"cool":0},
{"review_id":"xAqfn5SPp-EvKOswcRrAvw","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"rJdEbOWNfAELa0YETWf9Lg","stars":5,"date":"2015-04-03","text":"I rarely go over and over to the same place religiously. Actually, I enjoy change and trying new places and food. Deseo is an exception! Ever since I discovered it about 10 years ago, I go back every time when in the area for its divine ceviche! And everything else that we've tried in terms of cocktails and food.","useful":0,"funny":0,"cool":0},
{"review_id":"lDNMgvugPM3ugBz8Mx_how","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"sJvn6FXQ6USpbn2poEp88g","stars":5,"date":"2015-04-03","text":"These guys are handling the move to their awesome new location wonderfully! Excellent customer service, efficient check out and return. Prompt help with forgotten item in rental car.","useful":0,"funny":0,"cool":0},
{"review_id":"VQeNExTxHl6AfDUgwIGoEA","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"1ZusRIDxNN0JKQtuGqq_xQ","stars":4,"date":"2015-04-03","text":"Efficient, prompt and competent service. Conveniently located, comfortable waiting area. The only reason for the 4 stars is that the pricing of the more premium choices was not very competitive.","useful":0,"funny":0,"cool":0},
{"review_id":"MisOocFE_rr4rqjnpjBCHQ","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"xYZefYQ777honVZnlcD3vQ","stars":5,"date":"2016-01-02","text":"Excellent service and results! Will definitely go back. Price is quite reasonable. Convenient parking in front.","useful":0,"funny":0,"cool":0},
{"review_id":"wvzNjU1Og3rgHweCik-Vdw","user_id":"3ZkUO738I62m4D4dygkr3w","business_id":"Mkb7dYT-tBGQPy6tUpWMKA","stars":5,"date":"2015-04-04","text":"Fantastic fresh beer, exquisitely prepared food - great deal for the price! Better key-lime tart than in Florida topped with real freshly whipped cream. Definitely going back before leaving town! Which we never do - usually like to try new places.","useful":0,"funny":0,"cool":0},
{"review_id":"PnynatVl5c9eZrLkaRkdtw","user_id":"Td2BIxrI4c-uV5N-LgXqGg","business_id":"bBtSXvy7D00YYYKDpmUQdg","stars":1,"date":"2013-11-15","text":"Just copied and pasted my Google+ review as I want to warn others:\n\nPathetic. That's only word I can think of when I think of Phoenix Motor Company. I've never gone online and taken the time to write a review of anything! \n\nBut I felt compelled to warn others. Please, whatever you do, do not go to the Phoenix Motor Company for service. I've spent over thirteen thousand dollars in the last year (in one year! for a car with less than 60k miles on it) on repairs and every single time I leave there is yet another issue that undoubtedly costs 2-3 thousand more dollars. \n\nAt first I thought it was smart to get dealer repairs as they would \"know\" what they were doing, right? However, every single time I have them do something, immediately something else goes wrong. Immediately. And to top that off, they charge a good 30% more than what you would pay at a local auto shop. \n\nLast April I promised that I'd never use them again, but last week they were the only ones with the part I needed - so I gave it another two thousand dollar shot. Two days after the day they said it would be ready I pick it up only to notice that it is shifting hard. I bring it back and of course it has nothing to do with the transmission work they JUST DID and now I need to spend 2-3 thousand more dollars. Don't end up feeling like a sucker like I do. Again.","useful":1,"funny":0,"cool":0},
{"review_id":"XSfesSN5jibG41L2l9MH8Q","user_id":"FlEXYA0obs_994bxls9G9w","business_id":"fvlYG05Odf5OYjjmSqc5pw","stars":5,"date":"2016-01-10","text":"Elizabeth was super attentive and VERY friendly!! She truly understands customer service! A+!","useful":0,"funny":0,"cool":0},
{"review_id":"VdidNK-0iJWsFTvyWl8u4Q","user_id":"Ytj__DpsCTdionX2rdOcGQ","business_id":"in6jgLbUm-Auke9EfVDt_w","stars":5,"date":"2015-07-29","text":"My family had a great experience this past weekend with Your Personal Driver. We used them for back and forth from PHX and a dinner pick-up. We had Daniel as our driver for all three and he was A+ Gold Star! Great Job! Will definitely use them when we go back to visit the next time.","useful":0,"funny":1,"cool":0},
{"review_id":"EwA9HkxEPBCh1kd1e2nY4w","user_id":"Ytj__DpsCTdionX2rdOcGQ","business_id":"dA7ORbBrCdxoMlvn3I6JDA","stars":4,"date":"2015-07-29","text":"After having lots of Japanese food in New York, Tokyo and the in-laws house in Hasuda, I was knocked out. They do it right here. I never thought I could get this quality and style of food in AZ. Extra bonus is that it was 2 miles from my parent's house in Chandler! We will definitely go again when we come back to AZ.","useful":0,"funny":0,"cool":0},
{"review_id":"fSjNs_tb1GnpNXMMG57mnQ","user_id":"7619kTGBvHabSmrIL6ssHQ","business_id":"k3X6J0IE6xWMSBjrBG2ZGA","stars":1,"date":"2017-08-14","text":"I don't understand how a human being with 2 ears that work perfectly fine cannot get an order correct. I place an order with \"Alaina or Alana\" it's completely wrong and I was given no receipt! So I call and speak to Jamie the store supervisor\/manager who has the absolute worst guest resolution skills EVER!! I call and tell the manager Jamie my order is wrong and would like it refunded, she thinks that I was lying and asked me to drive back up to Panera bread with the entire order as I was given no receipt to PROVE that I was even there!! She never offered to replace my meal not one time!! I eat at Panera breads all over the country and this location and staff are beyond the worst ever in life!! Poor customer service skills like this example given is why people in the food and beverage industry have the stigma of being stupid people!! All she had to do was replace my pick 2, offer a smoothie or dessert on the house and all would have ended well, but no, I drove to Panera twice that day and I will not be driving back to a Panera anytime because of Jamie and Alaina!! These girls need to be working in the dish room, NOT WITH CUSTOMERS!!!","useful":0,"funny":0,"cool":0},
{"review_id":"OXgLG84RZ10K0QqmR4gu6A","user_id":"7PfVfStdWMTaAPNDvB7G5A","business_id":"0UHuuYw6E6Cjb-l-UEhm6w","stars":5,"date":"2015-02-13","text":"We have been using this dry cleaners since May of last year. We have used both the one behind the Cookout (S Tryon the main facility) and the drop off at Ayrsley beside  Wild Wings. They do a great job and have wonderful customer service. They always seem willing to help. \n\n I started using them because I needed my husbands suits back the same day. He had a bunch of clothes that needed cleaning. Not only did they have everything ready the same day, the girl brought everything to the car for me!! All of the stains were removed and my husband was very happy!! We've never had any problems with broken buttons....no complaints with anything. EXCELLENT quality and service!!!","useful":0,"funny":0,"cool":0},
{"review_id":"03m6Q2PAqC82BevhSbRl8g","user_id":"Jqtj_enosDyofyGcOm06DA","business_id":"dfo-LKRBm40etYpH-Rcsog","stars":4,"date":"2015-10-02","text":"Wir waren jetzt zweimal da und wurden nicht enttuscht. Das Bier schmeckt, auch wenn es kein deutsches Pils ist. \n\nDer Kellner war sehr freundlich und aufmerksam. Wir hatten einmal Flammkuchen (etwas an die Gegend angepasst), der uns gut geschmeckt hat, und einmal Burger.\n\nEin kleiner Nachteil ist, dass es dort sehr laut ist. Aber falls wir noch einmal nach Montreal kommen, wrden wir wieder hingehen.","useful":0,"funny":0,"cool":0},
{"review_id":"fEfN8cqk1g8LJDqOIEiijg","user_id":"EGTw2_r5GdhNNFLCFRaD-Q","business_id":"kNTOkEtBVW14RpFEUREzEw","stars":1,"date":"2013-10-25","text":"Horrible. The water we got was clearly unfiltered tap water. The gyro was cold, my daughter's fried fish was still frozen inside. We gave it back and they brought the same cut apart piece back after frying it again. Of course it was overcooked, dry and hard now. The chicken soup was sour from too much vinegar (who puts vinegar in chicken soup anyways?). \nEventually they counted my son, who is less than a year old and only eats his baby food as the sixth guest and therefore added 18% gratuity to the check for this bad service.\nNever again.","useful":1,"funny":0,"cool":0},
{"review_id":"lx65vmhNmeUL8U1JQPn5UA","user_id":"EGTw2_r5GdhNNFLCFRaD-Q","business_id":"gpiRpdG-8ccLlmPet0Vp0g","stars":1,"date":"2015-01-02","text":"Bad. Bad. Bad. We had orange chicken that was a mush of panko bread crumbs (~70%) and a few pieces of chicken. The jalapeno chicken was the same, 3 impossible to eat with chopsticks pieces of chicken in a huge amount of onions an jalapeno that did not taste like jalapeno but rather like bell peppers. The egg drop soup was kind of okay but looked like hot water with egg. Food should look tasty, too. Very very disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"ltTno1fshlFQjGOvfYL1nw","user_id":"EGTw2_r5GdhNNFLCFRaD-Q","business_id":"JpgVl3d20CMRNjf1DVnzGA","stars":3,"date":"2015-03-15","text":"I wouldn't say it's bad but it's certainly nothing to write home about. The meat is average and they bring the same thing over and over again instead of the advertised variety. If you buy the one with fish and seafood you have to ask for more our you wouldn't get anything more. The service is a bit slow, you have to remind them of your ordered refills.","useful":0,"funny":0,"cool":0},
{"review_id":"v9DMKSgR12iG4hOYL_N-Rg","user_id":"52DQ2wCzYxgAfet-wOJxuQ","business_id":"-865Ps6xb3h1LP67JcQ3mA","stars":1,"date":"2013-11-23","text":"Never again will I order from this place again! I called to order and asked about a dish and was told to \"go online and look at it\" because they're \"too busy\" to tell me over the phone.  (1st red flag)\n\nI then went online...looked up my order & called back only to the same guy who was very rude from the get-go. FYI to the owners...Sometimes it not what you say but how you say it. So then I hang up & remember I want to pay with my debit card and called back was given attitude again about not giving it to them the first time. From then I decided I will not be giving my hard earned money to a restaurant that doesn't care about how they treat their customers. \n\nI usually don't have to leave bad reviews but I will be telling everyone I know about my experience with Rainbow Garden in Urbana! I will stick  to Lai Lai's from now on.\n\nGet a nicer person to answer your phones!","useful":3,"funny":1,"cool":0},
{"review_id":"a5TI76abihQoLvz7JbOl0A","user_id":"52DQ2wCzYxgAfet-wOJxuQ","business_id":"xp9-HFOcV93zdQxNuH5dUw","stars":5,"date":"2015-03-07","text":"After my first time here on a Friday night...I felt compelled to write a review. I went in around 5:30 for a pedicure & manicure.. there was no wait. The pedicure was the best I've ever had with a hot stone massage. It was terrific after a long week of being on my feet. The manicure topped it off with a hand massage & a shoulder massage as my nails dried. The customer service here is amazing. It really is the little things that make the biggest difference. For only $45..I will not be going anywhere else from now on.","useful":0,"funny":0,"cool":0},
{"review_id":"VTeZyoOcdecnOFJ91jPbJA","user_id":"KMgkXFjB8iuXTBn5BIQQzA","business_id":"Kbc83RO9gBH7k1Ujjl1k7w","stars":1,"date":"2016-08-18","text":"I hired Tara O'Grady eight months prior to my wedding because she seemed very nice over the phone and at our first visit. As soon as we put the deposit down for full wedding planning (although the site lists partial planning we were told this is no longer an option) her demeanor instantly changed. Just to give you an idea, the happiest day of my life, was actually the day after the wedding because I knew I would never have to contact or see Tara again.\n\nShe was a total nightmare to work with, at times I thought my whole experience with her was part of some romantic comedy - and that these things could not possibly happening to me based on the amount of time and money that we spent on her services and the wedding - from a melting wedding cake, to family heirlooms stolen from our home, to misplaced bouquets, to my vendors contacting me because she was always unavailable, to her yelling at my mother - it was all out some awful reality show. \n\nI was left alone my whole wedding day that included - having to keep the hair and makeup team on track, the photographer and videographer both of whom left early despite being paid for the night. The bridal party almost left the house without our bouquets for our photoshoot until I asked where  are the bouquets and my florist walked them over not Tara. She did have time to post photos of my wedding on instagram during the actual wedding  which I thought was in poor taste but a good example of her work ethic. \n\nFrom the start, Tara was unwilling to suggest or meet with vendors that did not fall under her one or two selection of preferred vendors usually her friends. I ended up having to do all the leg work though I haven't lived in Toronto for about sixteen years and work in Chicago which is why I hired a wedding planner locally: that included hair, makeup, cake, flowers, and food, and I had to hire, meet with, and negotiate all my own budgets and contracts. Even the simplest of tasks as finding a limo company and putting our guest list on a chalkboard became huge endeavors for her. \n\nMy hair and makeup team told me that they had never experienced a wedding planner who failed to interact with them or the bride the day of the wedding. Multiple guests asked if we had considered hiring a wedding planner due to many mishaps that occurred - honored guests not having a place sit for dinner, bridal party not receiving food or drinks, wine bottles that were purchased not being placed on the tables nor served the list goes on.\n\nThe day of the wedding, Tara insisted on coming at noon even though hair was arriving at 7:30 am and the set up for the wedding was incomplete. I had to insist she come in at 8:30 when she did arrive she was late 9:30 and then disappeared to the backyard as nothing was set up even though staff had access to the venue for four days in advance and everything had been delivered and ready for set up days beforehand but she was too busy with another event. \n\nIt took me almost three months to calm down enough to post a review, because the whole situation left me so distraught. I truly hope no on else makes the same mistake I did by trusting Bliss with planning a once in a lifetime occasion. \n\nFor additional Specifics read below:\n- Unable to meet after 2pm in the afternoon, does not respond to email or texts sometimes for weeks at a time. \n- Uses her kids as an excuse not to meet or email or text since she would have to pick them up for school or go on weekend trips. This made it extremely difficult to communicate with her or meet with potential vendors due to her limited availability. \n- Doesn't work with any assistants or at least in our case didn't have one, concerns and issues go unaddressed.\n- Budget finalized two days before the event after we had paid everything.\n- Errors in itinerary such as scheduling bridesmaid for hair first when she was not even in town as explained in five emails.\n- The catering staff unsupervised for the reception and did not serve the bridal party appetizers, or sides that includes me and my husband. \n- Fans were not ordered so my $1000 plus wedding cake melted and we had to use a regular knife to cut our cake, even though we paid her company thousands of dollars to rent all the utensils and serving utensils\n- sparkler exit did not happen despite buying sparklers\n- antique bone china was stolen from our home by hired staff\n- Failed to show up for the pick up of rental items after the wedding or assist in supervision of clean up, dissembling, and packing up of items. \n- Rental companies sent us invoices for missing items despite her company being in charge of what was ordered, delivered, and responsible for pick up we paid Bliss over 30,000 to act as middleman upon Tara's request.","useful":2,"funny":1,"cool":0},
{"review_id":"Bb6yeKKdpw6TcDfhEZfhoA","user_id":"KMgkXFjB8iuXTBn5BIQQzA","business_id":"QzUhe8LwHf-XZVFjj69E0g","stars":1,"date":"2016-01-01","text":"I had a very negative experience today with Dr. Conway from Martin Vet who was unprofessional, rude, and hostile - someone that I certainly would never trust to care for my pets. I wanted to have my dog have comprehensive dental care completed under her care after my regular vet provided me with a full work up and referral for dental work. When I contacted Martin Vet to set up the procedure and provided them with his medical records no one responded to set up an appointment for over a week. After calling back and speaking with multiple staff, I finally heard back from Dr. Conway herself at 7 pm on New Year's Eve.\n\nShe called me on the verge of hysterics insisting that despite the referral from my general vet from a dental visit completed a week ago, and the urgent needs of my dog she needed to first examine the dog and charge for a consultation before scheduling an actual appointment. When I asked if any dental diagnostics could be completed at the consultation, she stated my dog would need to be sedated for that. So, I would have to wait another two weeks to treat my dogs dental needs.\n\nSince my dog recently just had a wellness exam, and the medical records were provided to the office, I asked if the consultation fee could be waived once I paid for the dental procedures and sedation. To my knowledge all medical professionals are expected to examine a patient prior to sedating them when asked regarding this issue, Dr. Conway angrily stated \"No, the day of the procedure we just check their temperature.\" This was very concerning to me and I would not seek care from an establishment that sedates dogs without doing a thorough work up the day of the procedure. \n\nAs a dentist for humans, I can tell you that without radiographs a dental diagnosis\/consultation cannot be given, so billing for a dental consult without radiographs and then billing again another separate fee for a dental exam under sedation, is unethical. No dental diagnosis can be obtained without radiographs. As well, it goes without saying that if anyone sedates your pet - a thorough exam should be conducted by the anesthesiologist performing the sedation, all medical records reviewed the day of the procedure rendering the consult performed by Dr. Conway unnecessary and inhumane as it delays the ability for a pet to be treated in a timely and compassionate manner. There are many options for vet care in Toronto, and this is not a place I would trust with my pets.","useful":3,"funny":3,"cool":0},
{"review_id":"VRIOJSAmCoeFQFw7QGrsCQ","user_id":"KMgkXFjB8iuXTBn5BIQQzA","business_id":"pZ1quwXnYozLIZIVABojhw","stars":1,"date":"2016-06-28","text":"Place is a total scam retain a copy of your receipt because they add erroneous taxes and charge for items you do not order. Went there on a Monday night pretty empty but we received very poor service.  We ordered several drinks and charcuterie and the waitress asked if we wanted bread, and vegetables with it. We said sure why not.Charcuterie was fine, the bread was table bread and cold.  When the Bill arrived and we noted that we had been charged for bread an the vegetables that we didn't order but the server suggested to bring. In the history of charcuterie I have never heard of it being served without warm toasted bread or brioche as a counterpart. \nWe were also billed three taxes: HST1 8.5%, HST 2 (5.5%), and also a final 13% tax surcharge. When we asked the server for change, she pocketed five dollars of the 120 dollars we gave her returning to us 115. I was extremely disappointed with the service we received and I am considering reporting the taxation that was utilized on our cheque which we took a picture of. Been to gastropubs through out the world, and this is ranked as an overly hyped imitation of what an established ought to be.","useful":6,"funny":1,"cool":0},
{"review_id":"pY-9cHU5_BZLxG1Mzi94UA","user_id":"4-0Jf8F2hqzlWzYWDbEcJA","business_id":"TVKenh65WwJX3zEr36zKCA","stars":5,"date":"2017-02-14","text":"Everytime I'm in town to visit, this is a MUST stop for lunch\/ dinner. Everything here is fresh from the oysters, clams, shrimp, lobster, etc.  The pan roast and seafood chiapp. is my favorite. The chef packs the pasta with big pieces of shrimp, crab, and lobster. I don't know why they have low ratings, but you'll be surprised to taste such amazing dishes from this casino. Come try it out and you won't regret it!!","useful":1,"funny":0,"cool":0},
{"review_id":"_eQC1yMt8_jDe3gZaIf6aQ","user_id":"0ESt2cDt5XWsBtevNLa67g","business_id":"SMtnQ_KdWUL36t3nV497uw","stars":5,"date":"2009-10-17","text":"You always know you've had a good night when you wake next to a crumpled up Jin's sandwich wrapper.  \nJin's popularity is undeniable, and for good reason.  Two options, chicken or fish, have sustained Jin's for years, but recently, a second location has opened up.  The original Jin's cart still stands firm in Library Mall providing nourishment for the weary masses, but a flashier version has opened up on Gorham just off of State Street.  The new cart is called JD's, but don't be alarmed, you can still order chicken or fish.  In addition, JD's sells Polish sausages and Chicago Dogs.  For some, the options can seem overwhelming, but if you're lucky enough to have any cash left in your wallet at the end of a night, whichever meal you choose will be more satisfying than anything else you can find downtown late night.","useful":0,"funny":0,"cool":0},
{"review_id":"lX_1i6dwXk6UY0WhUVdW7Q","user_id":"EIUbigo5LsZDJuaG68Q5lQ","business_id":"XNp5OYhAqY9MBLFQBZaDIg","stars":5,"date":"2017-02-08","text":"Travis and the team at Soulless are some of the most professional, hilarious, and honest guys I've ever met. \n\nTravis is a straight-shooter who will be up front with you about what your expectations can\/should be, as well as provide recommendations for tunes and mods that will help you build RELIABLE power. \n\nOne thing I have consistently noticed about Travis and the team is they are always up front and honest- if he or they spot anything that could be a red flag for hindering performance in the long or short run they are not going to cut any corners, have the integrity to let you know, and will not hesitate to cut through your pride to save you and your ride some potential future heartaches and to keep you on the road and off the shoulder. \n\nHe's got the best team, most honest Dyno, and best character out of any performance shop in the southwest. If you want reliable power and honest work, Soulless is your shop.","useful":5,"funny":1,"cool":1},
{"review_id":"MLA3z59YTQzqYcNS2L0iDA","user_id":"EIUbigo5LsZDJuaG68Q5lQ","business_id":"ohYgabP6PqkNsF0vnZUxeg","stars":5,"date":"2015-06-22","text":"Just. Yes.\n\nCoffee: 9.2\/10\nBeer: 10\/10 \nWine: 12\/10 tell them Tripp sent you, then get a glass of 1448, my favorite red. You won't be sorry ;)\nFood: 8\/10\n\nAtmosphere: 10\/10\nLive Music: 8.5\/10\nStaff: 9.8\/10\n\n1. Check out Wine Wednesday's - wine-tasting - 6 wines, $12. Great conversation, company, and networking!\n2. When you go, send Julian and everyone my love!","useful":0,"funny":0,"cool":0},
{"review_id":"fuRQGcDoJm-zyAISGga8lg","user_id":"WYQXTj8OClXSvyFx1LXyJw","business_id":"GP21Z1t3og9uvNPkP4nkyg","stars":4,"date":"2013-03-28","text":"I have been to Roman Bistro twice, once for take out and the other time to eat in. The menu has many options all at reasonable prices. They also have daily specials, that are often made of premium ingredients (seafood, etc.) that are a bit more expensive.\n\nMy favourite things I have ordered are: \n* the Roman Bistro (cesar) salad, lots of good bacon and chunks of parm.\n* the focaccia, like mini pizzas, very delicious\n* the veal sandwiches, very filling. \n\nThe service is a bit slow both for takeout and in restaurant, but well worth it for the delicious food. I will definitely be going back to Roman Bistro.","useful":0,"funny":0,"cool":0},
{"review_id":"yh2h_wjukpD3I7YABszbow","user_id":"3e2doSJgHBX2skyhg_x07Q","business_id":"fQ00Y8cOLKKZIsE8bAQLHg","stars":1,"date":"2016-04-03","text":"Never coming back here again! I went for a simple cut, wash and blow dry. The lady, gave me such a rush job, it wasn't even a proper hair cut.\nAfter she cut my hair, she handed me a wide tooth comb, sat me under an automatic dryer and left me alone (is this how they do blow drys here?). \nwhile my long hair soaked my back, she was off talking to other hairdressers. I was in and out in 10 minutes.  \nI'm not sure, if the lady was rude and lazy, or if she was just completely inept as a hairdresser.","useful":0,"funny":0,"cool":0},
{"review_id":"aFBx0yFBeM2-ckWU41poJw","user_id":"2h9uHPvN1piY6dmUjI-5sg","business_id":"rcoAajAVBBXsBNfgKYaH-w","stars":4,"date":"2016-02-08","text":"This place is great!  a few small tables, nothing fancy and clean. It seemed they had a lot of carry out. The Owner\/Chef was very friendly and the food was great! We ordered a small serving of Hummus and it was delicious and plenty to share with someone. We also order Falafel, it was just okay and I've had better. We also thought 5 in an order for 8.99 was a little over priced.\n\nMy husband had the Mezza Gyro and I had the Souvlaki. They were both delicious and came with some chopped up lettuce and homemade pickled turnips on the side. The pickled turnips were good too. The pita was one of the best ones I've had, they were loaded with meat. I tried some of my husbands Gyro meat and it was great! You could actually taste the meat and not just all the spices. We live a good 50 minutes from this place and would eat there again in a minute. It's worth the stop!","useful":0,"funny":0,"cool":0},
{"review_id":"AENkgRIQhLsr-HklofcTYw","user_id":"2h9uHPvN1piY6dmUjI-5sg","business_id":"3drQZjrvh8EOJe5aSwYE5w","stars":2,"date":"2016-02-08","text":"I was really looking forward to try this place based on all the good reviews with a few not so good ones. The staff greeted me and were friendly, I ordered the chicken pita and the pita bread and chicken were great. Unfortunately, the taste was ruined from the chemical taste that was either coming from the romaine or the cucumbers. The tzatzik, if that's what you would like to call it tasted more like a low fat sour cream with an after taste. So disappointed!","useful":1,"funny":0,"cool":0},
{"review_id":"hKYxHRnOgHLy05Ha-Q4qAA","user_id":"2h9uHPvN1piY6dmUjI-5sg","business_id":"uhtbPaFrupmH88ZUlEQXPQ","stars":5,"date":"2016-01-06","text":"We had a clogged sink that we were unsuccessful in getting unclogged. I called Royal Flush Plumbing after reading all the good reviews on Yelp and I wasn't disappointed! They were able to work with my schedule, on time, courteous and efficient The owner himself Chris was able to get the sink unclogged in minutes and didn't even charge us the full amount that was quoted since he was able to get the job done so quickly. They will be my first call next time we need a plumber and I will highly recommend Royal Flush Plumbing to friends and family.","useful":0,"funny":0,"cool":0},
{"review_id":"HKOgk52KvAFuQ702apFGdw","user_id":"qIMKp4E50VU1VBQD5Rozpw","business_id":"uF86ZhygpBEGr3CudNemYA","stars":1,"date":"2015-05-15","text":"\"What you see is what you get\"\nThis is definitely the case with O'Noir because you get absolutely nothing for the high price you pay. The food was bland and cold. Chicken had no flavor, the rice was mushy, and the vegetables tasted like they came straight out of the freezer.  The service was slow and infrequent. I felt like my glass was always empty. The wait for the food to come out was waaay too long for what seemed to be a microwavable dinner. Actually I've had microwavable dinners that tasted better. Save your money and eat in the dark in the comfort of your own home. Anything you eat in life will be better than O'Noir.\n\np.s. their employees ARE NOT blind as advertised.","useful":1,"funny":1,"cool":1},
{"review_id":"-HnS7ZXbnaCha8gS5uvK2w","user_id":"qIMKp4E50VU1VBQD5Rozpw","business_id":"CjfsFcNnV62PWWFq7-ZLgg","stars":2,"date":"2015-05-15","text":"Over priced for what you get. Utensils are dirty and the portions are little. This place was amazing and has gotten much worse, what a shame.","useful":0,"funny":0,"cool":0},
{"review_id":"aZPjA-kXnLlHO766Xh0cFQ","user_id":"rMjvs1JLZKyWdkeRndyg1Q","business_id":"bK17vbsRd2_CWxDkHaWkMA","stars":4,"date":"2015-01-17","text":"I also found a great car online and was very interested. I did send an e-mail to Stateline and got a reply right away! I went over to the dealership the next day. I only looked at the car to make sure it would work for my life style and decided to return the next day to drive the car with my husband. \n\nWe decided to buy the car and ended up trading in our old car got EVEN BETTER financing then the loan I already had and got the keys to the new car all in the evening.  Everyone was really helpful and nice!\n\nI have to say thank you to my sale rep, Sandra, for really helping us get the car to the price we wanted and also to trade in our used car. Also the finance person, Aaron, who really helped us get an outstanding rate. Top notch finance professional. We were impressed and felt really good about our used car buying from Stateline. We would go back and recommend these two people.","useful":0,"funny":0,"cool":0},
{"review_id":"-BNW0bqdGh9XsgvmI6vfFQ","user_id":"rMjvs1JLZKyWdkeRndyg1Q","business_id":"frZ7G0v-E4p8DqubLC5MDA","stars":5,"date":"2014-05-17","text":"Fort Mill is lucky to have such a nice studio with such an experienced teacher. \n\nI have been practicing this yoga for 10 years now and Tina, the owner, has really worked with me to correct some old habits. For this I am grateful. If you are thinking about trying yoga this is the best studio and very friendly! They have great packages and very clean facilities with 2 showers and you can even get a massage! You can't beat that. I am very happy to be a part of this new studio.","useful":0,"funny":0,"cool":0},
{"review_id":"BbY1HncXjLCx-u1iqzrngQ","user_id":"soAFdYWoRtqIunTLNXDPwg","business_id":"jChYROMc17z2Wwv6ClE2rg","stars":5,"date":"2017-09-03","text":"The best ice cream. Dense, rich, no air. And the ice cream is hand rolled! \nFun place too.","useful":0,"funny":0,"cool":1},
{"review_id":"99In83jU2iQ6_WEQE-Nq8w","user_id":"soAFdYWoRtqIunTLNXDPwg","business_id":"5A12bfLXQgy53QqqLRW2sw","stars":5,"date":"2017-04-05","text":"Monarch Stone is your go to company for stone care. Justin pays meticulous detail to his work. Call today.","useful":0,"funny":0,"cool":0},
{"review_id":"_x-K7nwAg5X9_hKD_T9trw","user_id":"soAFdYWoRtqIunTLNXDPwg","business_id":"lwxYmWqjmEZ0ukCsXC9Pfg","stars":5,"date":"2016-12-31","text":"Authentic Chicago Giordano's stuffed pizza. Exactly the same tender flaky crust and ooey gooey cheese.  Worth the 45min to bake. Thanks for coming to Las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"Umh2JWzo9B6u7oF4HuLqjg","user_id":"BRlK07TgXekl2jdRHMrbYw","business_id":"K1nwSvx14on6eVBbu5E9rA","stars":5,"date":"2017-12-06","text":"Friendly, helpful, and professional Hostess and Waitress .\nI had the Clams with a Garlic Butter Sauce and my Wife had the cold Lobster Roll\nBoth were delicious and the beer \" Side Launch \" on Tap was good too. \nOur first visit and looking forward to the next time.","useful":0,"funny":0,"cool":0},
{"review_id":"3gD6NIon9JRaxgPORmz2eA","user_id":"-UM0jzj9DaHPKK8K1UHL6w","business_id":"2bhyxas8otY-LNfSNcxvjg","stars":5,"date":"2016-09-13","text":"Scott is the best! I trust no one else with the care of my vehicles. He is very knowledgeable and the prices are reasonable.","useful":0,"funny":0,"cool":0},
{"review_id":"na0lW6AlP_sHEXiRkugyZQ","user_id":"ciidXE07wLawBVe7KhbEOw","business_id":"jbwyl98wXrEKDkgFz2PiwQ","stars":1,"date":"2016-09-25","text":"Worse service when you go inside.  We ordered  our food to go.  You would think that meant putting our food in a bag.  Nope.  We had to ask the lazy chick for the bag & bag it ourselves.  No one was in the place!!","useful":0,"funny":0,"cool":0},
{"review_id":"8knKOIWYkqL3hRFIKdDCAw","user_id":"ciidXE07wLawBVe7KhbEOw","business_id":"7RVIW8mTXbm0349SQpC1fQ","stars":4,"date":"2013-03-09","text":"I like living here because it's nice and quiet. It is by the mountains and away from the busy Ray Rd street. The neighbors are nice and friendly. The staff is helpful and respond quickly to work requests. The upgraded apt features are nice and love the layout. We have plenty of storge and the proximity of the garage.","useful":0,"funny":0,"cool":0},
{"review_id":"aBfzDofBhUtuYYPpVzRwtQ","user_id":"ciidXE07wLawBVe7KhbEOw","business_id":"vuTmJ2FTRzpdS9jxqcxBSg","stars":1,"date":"2015-01-19","text":"Dont move here.The new management company sucks. Low grade features are not luxury. You can here EVERYTHING!! People dont pick up after there  dogs. Nothing gets done when dogs bark at all hours.","useful":8,"funny":0,"cool":0}]