[{"review_id":"R_f2t7Ka7b7Hkz1selGepQ","user_id":"-idUvmrl8h_60FHVAY1rSw","business_id":"dpOWBBnpzpkIvhuLBFIg6w","stars":4,"date":"2017-10-23","text":"I have been coming here for almost 4 years and they have always taken care of me and my car. I have always felt like they have been honest and fair and not nickel and dimed. I also enjoy the convenience of having my oil changed and my tires checked, rotated and balanced at the same visit.","useful":0,"funny":0,"cool":0},
{"review_id":"Bi9bMcZ6MaSgCrkmh_BbxQ","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"RKe49GSTDR7ZYurK3uUuWA","stars":5,"date":"2014-05-04","text":"I was born and raised in Montreal and my mom grew up two steps away from St. Viator.  Bagels were a staple in our home.  So finding Montreal style bagels was something important to me when I moved here.  In all honesty?  I think these may be a little better than the originals.  Make sure you buy them first thing in the morning when they come out hot.  Although they are great on their own, I love to toast them butter them and then coat with Philadelphia whipped cream cheese.  YUM!\n\nI find it interesting how people comment on the quaintness of the store as if it should be more than it is.  The true bagel shops of Montreal are just as simple. \n\nPS... this is a Cash only place","useful":0,"funny":0,"cool":1},
{"review_id":"5l4-QlzBeCLPS8r3-VYt9Q","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"AEOTETRSzo5ubm4-Ud4PUg","stars":3,"date":"2013-11-24","text":"Ok for fast food Asian.  It's like the McDonalds of Asian\/Indian food.  Nice marketting, perfect for those who are not too savvy of  this type of cuisine, decently clean place with fresh enough food.  Perfect for the fast fix, yet if you are wanting an authentic experience, There are many other places in the city that are MUCH more authentic (try the NE) and within the same price point.  For what it is, it's not bad.","useful":1,"funny":0,"cool":0},
{"review_id":"fwaQYIPfaSdmpFcjwZkdmQ","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"Rz3Vdn5uKBAfMY-Uzyjvdg","stars":4,"date":"2014-05-04","text":"Love this place.  I can find lots of things I grew up with.  The meat counter is good, however, I've seen some people sneak out with extra goodies from the back, like fresh sauerkraut and sausages.  I'm guessing if you ask for specific things, there are more (freshly made and authentic) items at back.","useful":3,"funny":0,"cool":1},
{"review_id":"_zqC1y1J0dS_GKGplsNQhw","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"5ZW9XQ57SixZ7xfiiyr51A","stars":5,"date":"2013-11-24","text":"OMG. Price for freshness, can't be beat.  Yes, there are better Viet subs in the world, but this, so far, is the best value for dollar that I've found in Calgary.","useful":0,"funny":0,"cool":0},
{"review_id":"G4fovoHv3kjDRk9BiiIWVg","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"TelTcROqJk_z2zlgZA5uEw","stars":4,"date":"2014-05-04","text":"Went for breakfast with my husband and found it to be the best priced breakfast for great value!  Finding bottomless coffee included with your breakfast is rare in Calgary.  Actually, this is the first place I've found.  The bacon is clearly deli bacon, so very meaty.  Mine was a little overdone, but I'm sure I can kindly ask for it be a little less crispy next time.  Such a friendly atmosphere, clearly lots of regulars.  I'm hoping to go back soon to try her burgers and poutine.","useful":0,"funny":0,"cool":0},
{"review_id":"Nw94BQgMxu8ZS9X2CD6-Pg","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"OuYAxu_PhanQCjd2mlOfJQ","stars":5,"date":"2013-11-24","text":"I am a HUGE sushi fanatic and have eaten at many more \"experimental\" types of sushi restaurants.  Yet for what Kinjo is, a perfect place for groups hosting the connoisseur and the sushi newbie, this is the perfect in-between place.\nThe quality versus price is spot on.  The service is probably the best I've ever experienced. I gave it a 5 star because it really is a great sushi place choice for groups with diverse sushi experiences.","useful":0,"funny":0,"cool":0},
{"review_id":"lO6piOGkgScNavnd0wYREQ","user_id":"xNeJvFm6g2bOmrGjWN264A","business_id":"vO3wH7q0z-bq052VNj-8Cw","stars":4,"date":"2013-11-24","text":"I came for lunch for a friend's birthday.  The service is A1 and I was very impressed by the enthusiasm of the staff to educate us on what the Yellow Door has to offer.  As a lunch experience, I thought it to be very good, yet, quite pricey.  I don't have a problem for paying prime for a dinner with wine. That being said, I am really excited to experience this restaurant on an evening in the near future.  I look forward to trying their wine tasting and experiencing their cellar selection the next time.  The only reason I've given them a 4 is that I  honestly feel that the menu was a little extensive for lunch (meal size and price). Other than that, I'd give it a 5.","useful":0,"funny":0,"cool":0},
{"review_id":"uYlBpjtwv5pzLObkNvdXlg","user_id":"2bL3cXg8D4vNzjhgrdV_mw","business_id":"FsCujpVh9Za2Dl5MIYLCxA","stars":5,"date":"2016-08-16","text":"the food is awesome ! The service is great ! Very friendly and helpful ! We ordered seafood soup and chicken wings plus the Salam cheek !  It was really yummy","useful":0,"funny":0,"cool":0},
{"review_id":"TTTApWbbk8CpnYSyMnJj6A","user_id":"iL9Z1nRUdBi1m88rUu2zGQ","business_id":"txmqJUpS1SPiXPzUy2PgQA","stars":5,"date":"2016-03-05","text":"Best optometry office in Las Vegas. Been going here for years and everyone at Spring Mountain Vision never disappoint. I always go see Dr. Diep when I need to get my eyes checked. He always makes eye exams comfortable and smooth for me. He's very friendly and definitely knows his stuff. This is one of the three stores that Dr. Diep is at. The other location is Chinatown and Vision-3 (on Jones). Will definitely be back for future eye exams.","useful":1,"funny":0,"cool":0},
{"review_id":"COqdlmp_Yl6C9ePTy3ccwg","user_id":"3EhYKZPsiSkCevcykU8rTA","business_id":"k-zdOw1KYrwEMoud1MhFSQ","stars":5,"date":"2017-01-03","text":"Great customer service! I ordered the Rueben and quickly decided that it was one of the best that I've ever had. My wife and I also loved their cheese fries. Will definitely return again!","useful":0,"funny":0,"cool":0},
{"review_id":"NINXMm60mAAbazamWdzdUg","user_id":"auXqsTFsrCfyIIpdeVLlqQ","business_id":"3J0LNbYzW5ALNStufohwMA","stars":1,"date":"2013-10-03","text":"The last time I checked Arabic's don't microwave chicken........sure its packed look at the quality of the people that live in whitby hicks!!!!!!!!!!!!!!!!!!!!!!!","useful":1,"funny":1,"cool":0},
{"review_id":"eSCOQg99o35AXT2Jaa91zA","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"oteTUg7lVM1CEFrq2Z8nLQ","stars":4,"date":"2017-04-01","text":"It's pretty good for the burgers. The fries though weren't good. Seemed like they were frozen. \n\nThe have a nice bar area. And even an outdoor area. Once the weather is better that will be great!","useful":2,"funny":0,"cool":1},
{"review_id":"na-JQXdDWQn74T87NhTdXA","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"DQfZM9b3n3DDMzEg4b4WhA","stars":4,"date":"2016-02-28","text":"bought a king bed here.  They were easy to work with and delivered on time with no issues.  They are a bit slow during the checkout process, which is annoying","useful":0,"funny":0,"cool":0},
{"review_id":"Ax7w5EFpZ47G9PIOxiG-lg","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"QHr_fc_TLnGfUEuDEa2jDg","stars":3,"date":"2017-06-18","text":"They have a good selection of wines, but not a lot in a chilled section.  \n\nThe problem I've had with this place is the employees.  They are not helpful and are so slow at the checkout.  Also, seems they are always restocking and can't step aside to let customers through.   It is ridiculous.  They do have a good parking lot area.  \n\nI'll still go here because it's close to my house, just hope they can do some re-training with the staff.","useful":0,"funny":0,"cool":0},
{"review_id":"AjaTMcyLOoiudvsHTVg73A","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"4qAhL4eJN80rE7MDz-zcxw","stars":2,"date":"2016-07-21","text":"Your run of the mill nail salon.  Nothing special here.  \n\nTwo stars because the girl so did my Pedi was friendly and spoke good English.  She seemed to be interested in repeat business.  Unfortunately the two Tech's that did my kids were not great.  They went super fast and did not speak English.  It's was my kids first time for a Pedi and these Tech's didn't not seem interest in them.  My girl had to translate for them the entire time- really annoying.  My kids were trying to talk to them and they couldn't.  Also, we asked for nail art but it looked weird.  No one could tell what it was suppose to be.  \n\nGood location though.","useful":4,"funny":3,"cool":0},
{"review_id":"_UAjXVsDu5U30ijJkKTJKg","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"PBI24hd97BdLuXPy1xX_Ig","stars":2,"date":"2016-07-21","text":"This giant eagle sucks.  \n\nThey need to find new suppliers for the mushrooms and fresh fish department.  We've been going here for a year now and this two things are always crap.  Shop'n'Save in Cranberry has a great selection of both these items.  Very fresh.  \n\nThe online ordering is a nice option but you have to wait awhile after you arrive.","useful":0,"funny":1,"cool":0},
{"review_id":"YY9sUa_K8XooTjX5gzOKqQ","user_id":"qzfyHU6OU00t860pWjRm7g","business_id":"5jEcNjjYfto56G4CHh1zoQ","stars":1,"date":"2016-02-26","text":"Unfortunately, I was never able to get a quote.  I was informed that I wasn't the right type of customer for them.  This review is based solely on trying to get a quote (that was advertised as hassle-free, amusing).\n\nCalled for a quote they ask for a bunch for info- how many windows, how old is the house, etc.. Normal questions.  Then they throw in- who are all the homeowners?  Why do they need to know I ask, do you think I'm going to buy windows for a house I don't own?  She says we need all the homeowners to attend our presentation.  Yeah right, like we are both going to take off work for this.  So I say I am.  We agree on a date and time and hang up.  \n\nLater that day a get a call from Anderson, here's the run down.\n\nAnderson- calling to confirm your address for your apt, is xxxx correct?  \n\nMe-yes\n\nAnderson-this home is listed as being owned by Jack & Jill X.  (So, they looked up the public records.  They pay someone to do this!  It must be really important to them, part of a high pressure sales tactic maybe??)\n\nMe-yes\n\nAnderson-who is Jack?  Do you know this person?\n\nMe-silence (thinking what is going on here)\n\nAnderson-are you still there\n\nMe-yes\n\nAnderson-we need to have all homeowners present for our presentation.  is jack a homeowner?\n\nMe-yes, but he will not be attending.\n\nAnderson-then we'll have to re-schedule for a time that he is available.\n\nMe-no, he isn't interested in attending\n\nAnderson-he has to be there.\n\nMe-he's not going to be there, you can cancel our apt if that doesn't work for you\n\nAnderson-Your not the right customer for us anyway. and she hung up...\n\nWow!  That's some awesome customer service and hassle-free just like they advertise (not).  I started reading other reviews about them (in other locations) on yelp.  So many people complained about how both homeowners had to be there.  That they were required to be there.  This is a crazy business practice.  The only reason to do this is so that they can tell you they will offer you a discount if you sign today (now you can't say I have to talk to my spouse before I make a decision).  Beware any company that uses tactic's like this.  \n\nTry Pella.  They have online booking and don't harass you about who is going to attend the meeting.","useful":6,"funny":0,"cool":0},
{"review_id":"mzP5Z59gWaI_HlujgV6psg","user_id":"8cDPCETJHxG9buWNOkGZmQ","business_id":"7UTQs_W0y79WwQeCK9sGdw","stars":4,"date":"2014-06-25","text":"Love this place for a huge price savings!! Misty was awesome, she listened and did her best and I honestly got better service and treatment there than Kelly Cardenas Salon who charges an arm and a leg for exactly what these students can achieve. I had a Highlight and a Blowdry with style service and it was GREAT!! Highly recommend to anyone who wants to save a HUGE amount of money. The BEST $40 I have ever spent on my hair!! I will never go to another salon again. Aveda Institute is my go to salon from now on :) :)","useful":1,"funny":0,"cool":0},
{"review_id":"Q0EG2_UsbI3Kq_YE3acvXg","user_id":"8cDPCETJHxG9buWNOkGZmQ","business_id":"thlQQwjsT6RmoqzoD87UqQ","stars":1,"date":"2014-06-24","text":"EXREMELY disappointed after spending 4 hours for a color corrector and highlight. Walked out after paying $240 for a service that was horrible. Was told that he was \"amazing\" by the receptionist who booked my appointment. My hair was just a frizzy mess when I left and no style was done. I will NEVER return or recommend this place to anyone. I will not say his name because I'm sure there are some great workers in there. Customer Service was fine it was the end result that sucked!!! After showing a picture of what I wanted he didn't even come CLOSE to my request.","useful":0,"funny":2,"cool":0},
{"review_id":"devzdhXNj_JBJ6jYZOge-g","user_id":"e2frVahRsNxbjEqqBrtDRQ","business_id":"_DuPG5sSEwZcgfjdndQc4A","stars":1,"date":"2014-01-26","text":"It must have taken years to develop a recipe for both leaden meatballs and tasteless tomato sauce as bland as the fare served here.\n\nLacking in herbs, garlic and anything resembling flavour this \"cash only\" place - which doesn't even take debit cards - neither delivers value for the money spent nor a reason to return.\n\nThere is not enough Parmesan cheese in Italy to redeem this stuff - not that they offer any.\n\nAvoid!","useful":0,"funny":1,"cool":0},
{"review_id":"DMH3MVOK0Jckqju2qEhC2g","user_id":"e2frVahRsNxbjEqqBrtDRQ","business_id":"WbQOuI7mVST8XrJotWq9fA","stars":2,"date":"2013-01-12","text":"The BBQ can be decent but is offset by overtly hostile service and the nasty little tricks this place frequently pulls if you don't speak Mandarin or Cantonese.\n\nWatch out for the following:\n\n1. Packing too much BBQ in your take-out order. Your 1lb.of  BBQ pork often become 1,5lbs. and is charged for accordingly.\n\n2. They often slip fatty pieces and\/or leftover ends in your takeout order if you are not watching them and won't discover that until you open the box. I have had them also do that in the restaurant and scowl at you when you send it back.\n\nAll in all the phrase\"customer service\" does not exist in Kom Jug Yuen's vocabulary.","useful":3,"funny":0,"cool":0},
{"review_id":"vkiEz4b_OMAA6aIj-Wgl6Q","user_id":"e2frVahRsNxbjEqqBrtDRQ","business_id":"sAWo3kwrx53oFKDqUoJEYQ","stars":2,"date":"2013-01-09","text":"As a transplanted Scot, I know good fish and chips.\n\nI had the Haddock and Chips. Unfortunately, to keep expenses down and profits up, many fish and chip shops have cut back on the size of the fish portion served and often cover it in thick batter (and serve lots of chips) to hide the paltry portion of fish.\n\nThe batter here was not thick however, when you fry a really thin filet of fish for too long, you get a rubbery chewy piece of fish and that is what was served.\n\nHad the portion been thicker, the crispy batter and acceptable chips would have complemented the dish instead of being the highlight of the meal.\n\nI've had better and will continue to look for the ultimate Toronto chippy.","useful":3,"funny":0,"cool":1},
{"review_id":"QgV9RPyPUC3cAse1Wxqoow","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"44YFU284Z3KDEy25QyVoUw","stars":4,"date":"2012-04-28","text":"Enjoyed Nee House immensely. No service issues, just fantastic chinese food. Food order? Spicy Green Beans = Perfect!, Chow Fun (Chicken) = Perfect! \n\nJust a great place. Perhaps my expectations were set by all the bad service reviews, but I was not disappointed.","useful":2,"funny":0,"cool":1},
{"review_id":"RPcsomJlhxOQFAjnlw4Nyg","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"F9cXFXk60E2sz_YTSCFp_Q","stars":5,"date":"2012-03-14","text":"Phoenix is LUCKY to have In-N-Out(s). Moving out of the LA area meant that we didn't have an In-N-Out nearby. Problem solved!\n\nMost importantly - The food is consistently fantastic. Don't go to some other guy's place for a burger. Go here. \n\nImportant backup information:\n- CLEAN, CLEAN, CLEAN. Oh yes, the tables are constantly cleaned by their staff. Did I mention the bathrooms are spotless also?!\n- Helpful Staff - Great hiring practices at In-N-Out because the staff is friendly, quick, efficient, and well trained.\n- Secret Menu - I mentioned the great food, but checkout the secret menu at their website: http:\/\/www.in-n-out.com\/secretmenu.asp\n\nFun and quick place for a fantastic burger.","useful":2,"funny":0,"cool":0},
{"review_id":"opuZVDTzMROWoEcjiXIb1g","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"8zodrKSinoKngy2qnA9Irg","stars":5,"date":"2016-07-27","text":"I've been remiss in not reviewing this Youfit earlier. Perhaps I've been trying to keep it secret and don't want to it to get crowded. ;-)\n\nOverall: It's a great gym with good staff and equipment. \n\n- Free weights: There are smith machines, squat racks, incline benches, flat benches, and barbells up to 90lbs. \n- Machines: There are many weight training and cardio machines for every part of your body - Treadmills, rowing machine, bikes, specialized weight machines etc.\n\nHere's what I like:\n- Staff: They greet me by name every time I walk into the gym. They really seem to care about my fitness.\n\nNeed some personal attention? Ask for Dylan. He's great at signing you up and getting started. This guy is great. FYI - I've signed up for a pre-paid annual account so Youfit doesn't have my credit card. No need to cancel etc. (I recommend that for all gyms.)\n\nNeed some training help? Danny is your man. He's knowledgable, helpful,  and encouraging. \n\nI've never been stronger.  \n\nThanks Youfit, Dylan, and Danny.","useful":1,"funny":0,"cool":0},
{"review_id":"m3JMCgVq88JQIyG33yp9Dw","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"q10IXjtZqao66bVtPExTXw","stars":5,"date":"2015-09-24","text":"Parker and Sons just finished repairing our RAT eaten AC system and couldn't have done a better job. Fantastic job. \n\nOur rat problem happened at dusk, but Parker and Sons was able to dispatch someone immediately. The rats decided to eat all the insulation off the high voltage wires. Parker and Sons patched up the system in the dark and got it running. (Thanks Bill.) Today, they came out with new wire and finished up the repair by installing conduit around the wires to keep the rats out. Thank you, thank you, THANK YOU! \n\nNow we have to figure out how to get rid of the rats...","useful":1,"funny":0,"cool":0},
{"review_id":"MlBOwb4ewMs9pO7e5JthLw","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"GQxpWDw3MuCwAMV9BA-62w","stars":5,"date":"2014-08-05","text":"Family run business run by really nice people serving great gryos.  Marlene recommended a fantastic dinner for the two of us. We are dedicatedly going back.\n\nTry the Greek fries.  Not something I would normally consider, but the fries were crispy and covered with feta.","useful":2,"funny":0,"cool":0},
{"review_id":"YoTXXzz_X6t3-rLSpNO_6A","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"SXpVQa9iCl1h_aiFHL5NQA","stars":5,"date":"2012-04-28","text":"Fantastic place to learn Krav Maga and workout. My two sons have been going to React Defense Systems, RDS, for years and they finally convinced me to go. I love it and it's too bad I didn't go earlier! \n\nThe instructors and facility are top notch. As a beginner, the instructors made me feel welcome and motivated even though my skills were untrained. After two weeks, I can feel, see, and hear the difference. I love smacking the bag with sweaty fists and feet and seeing the sweat fly. \n\nIf you are looking for intense conditioning, then RDS is the place. If you are looking for life saving skills, then RDS is still the place. Learn a great life skill, become fitter, and have fun. \n\nI agree with AZ Central: RDS is the best boxing\/martial art facility in Arizona. \n\nIn closing, I'd recommend RDS to anyone and I apologize to everyone for not being creative enough to think of something funny or flippant. \n\nOh did I mention this is one of the few places in the world where parents and their kids can legally beat on each other and enjoy it?! When was the last time your son hit you? ;-)","useful":4,"funny":5,"cool":2},
{"review_id":"JBNrT081M51qDalzlvkwzA","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"_GKMtL4zFOlNc0U3gljT0w","stars":1,"date":"2015-04-20","text":"I hate giving poor reviews. Hate it, but I must warn others.\n\nWe tried this place on a whim.  We should have done more research before going in.  The tables are dirty and the lack of attention to details like the Parmesan cheese containers on every table being empty should have warned us off, but... like many explorers before us, we forged ahead.\n\n The pizza was bland, greasy, and undercooked.  The salad was a mix of very old lettuce served in a plastic container.  As the only people in the place, we could hear the two staff members talking about the lack of lettuce and other ingredients.  ( why let us order something when all the ingredients are not in house?! )\n\nPerhaps the botox place nearby will take the space over.","useful":1,"funny":0,"cool":0},
{"review_id":"FnY8FU8DxmXlDoJMRBUURA","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"UYkMe5_8X9mNA1u-aR2J4A","stars":5,"date":"2012-01-23","text":"Great service + Great People + Great product = Great company. \n\nSelection of watches - Best Breitling and Rolex dealer in Arizona. Fun to look at their selection of Patek Philippe. \n\nFlexibility - I bought  a TW Steel, but wanted a rubber watch band on it. \n\nService - Only place I bring my watches and my wife's jewelry. \n\nDid I mention coffee? While waiting for some rings to be cleaned, they offered us some of the best coffee we have had anywhere. \n\nWe've been shopping at Harma Jewelers for over 18 years and love it.","useful":8,"funny":4,"cool":5},
{"review_id":"TM-aqmLcS-Xo9Rp1F5ighw","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"szhJLmdLDVFTevm8fu0T4A","stars":5,"date":"2014-02-01","text":"Fantastic food - be sure to order Honk Kong Style Noodles ( pick desired protein ).  The dim sum is all great.  For dessert?  The flowing sand buns are hot, sweet, and better than almost anywhere else.\n\nParking is easy, but on Saturdays be sure to get there early.  It fills up fast and by noon the wait can be long. ( but worth it!)\n\nFYI - very kid friendly.  There are nice aquariums filled with fish, lobster, crabs, and clams.","useful":0,"funny":0,"cool":0},
{"review_id":"dMiwL0A8C9hGYAPTMmhNnQ","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"_MVSmAYSl4RkgXBg5e8JaQ","stars":3,"date":"2012-03-14","text":"Read the other reviews, and I agree with all of them. I've had good and bad meals there, BUT it is the only place for an Apple pancake. Don't order anything else. Skip the extras and REMEMBER to bring cash.","useful":0,"funny":0,"cool":0},
{"review_id":"qwZCfsTvq89UHBzMMz3JDg","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"G8k2E3oYHHl2o4lNJQwR-g","stars":5,"date":"2011-11-29","text":"This is my very first review on Yelp. I'm been an active user and decided to share my secret favorite place - Eden's Grill.\n\nLooking for the finest Mediterranean food in the valley?  Eden's Grill is the place to go. Consider the Gyros, Chicken and Beef Kebab combination for two.  It's our favorite dish, since it allows us to have it all. Did I mention the rice? Covered in golden raisins and almonds- WOW. \n\nEnded the evening Nehren's Wedding Cake for dessert. I dislike cake, but I'm still thinking about how good it was. Try it.","useful":3,"funny":2,"cool":4},
{"review_id":"lNWLXoJEgL0eAmG6aFowtQ","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"Ktia9NJfvxVxTLVcEnw9zQ","stars":4,"date":"2014-10-21","text":"Great place, but I suggest ordering to go. Call ahead and pick up so you don't have to wait. \n\nI love watching them make the large flour tortillas in the back. Be sure to order a dozen to go. Everything is good on the menu, so you cannot go wrong.","useful":2,"funny":0,"cool":0},
{"review_id":"eqat5h0d9dSAkiYIOWNAzg","user_id":"P3cMpkppvBuVpPD8LBTbBQ","business_id":"cXdQ3H0GqcIzRgrvBEaBxw","stars":5,"date":"2013-08-13","text":"Great service + great food = Great place.   Noodle and Rice is hidden near the QT, so hunt it down.  There are not many tables, but it's clean, recently refurbished, and serves great food. \n\nWe ordered two items (one noodle dish and one curry), split them, and still had lots leftovers for later.  \n\nOne other thing we really liked - Really large glasses of water that are constantly filled. This was important because we selected \"regular\" spicy level dishes and found them to SPICY. (Loved it!) \n\nGo there, have fun, highly recommended.","useful":3,"funny":1,"cool":2},
{"review_id":"Rq03pG3EHl7h3GvIYvrqsQ","user_id":"oKm4dAatEndASOz4_eAKug","business_id":"7aFMSgA-FrrralP69tgh_w","stars":1,"date":"2015-07-19","text":"Absolutely do not book through jet luxury! Book direct with the hotel. The service is always lacking. There is never a late check out. They will not refund your room even if you have upgraded in the same hotel. They charged me twice, one for my old room and one for my upgraded room. They absolutely will not budge and accommodate me so it lead to a dispute with my credit card company. In terms of service, they are only available at certain hours so good luck if you need anything after hours. The hotel is not responsible for you, jet luxury is!!!","useful":7,"funny":0,"cool":0},
{"review_id":"zF3aLebnqD5ysEnam3njMA","user_id":"3nQhbB-PmzT8cSoAiOsh6g","business_id":"fwYtVfx-RbpZkph9BxOVFA","stars":5,"date":"2014-04-14","text":"Will never go back here. For no apparent reason they removed all the tables while people were sitting at them and were very rude about it. It wasn't crowded and everyone just stood around with nowhere to put your drinks so no one ordered any more drinks and left.","useful":0,"funny":0,"cool":0},
{"review_id":"Pi58xp1t8Yg6P4Dazur6Ug","user_id":"3nQhbB-PmzT8cSoAiOsh6g","business_id":"_Ib9dtK9m-f-mutaKMhT7g","stars":5,"date":"2016-01-22","text":"I highly recommend Trisha!  I have had previous treatments and no other person or entity compares to her professionalism and knowledge.  She spent so much time on my initial visit educating me on things that no one ever told me before and I wish I knew.  She truly cares about the results that you get from her services.  I will be returning to her for more treatment because I was so impressed with her.","useful":1,"funny":0,"cool":1},
{"review_id":"MgS5huCnQlp_VOTJCsc9yQ","user_id":"3nQhbB-PmzT8cSoAiOsh6g","business_id":"q2Pkq8g60KKncFzKgynHOw","stars":1,"date":"2014-04-14","text":"Stay away from this rip-off joint. Took my car there because my air conditioning wasn't working. They said I had a line leaking and needed over $800 to fix it, plus I needed a bunch of other stuff totaling $1100. I wanted a second opinion and took it somewhere else where they said there was no line leak only a bad o-ring. Walked out with an $85 tab vs $1100","useful":10,"funny":1,"cool":2},
{"review_id":"fTv3DOlp8f_CX1nIfPhJaw","user_id":"RHkeyjbP4aHvb-GKXE8DPQ","business_id":"Mmh4w2g2bSAkdSAFd_MH_g","stars":4,"date":"2011-02-22","text":"Red Bowl is always a great choice.  It can get a little busy at times, but is worth the wait.  The generous portions will leave you full and the flavors will satisfy the pallet.","useful":0,"funny":0,"cool":0},
{"review_id":"xK2UTNHR8hnLhKGNgamD7w","user_id":"RHkeyjbP4aHvb-GKXE8DPQ","business_id":"JQ753jv9FPvivLEQFShkrQ","stars":5,"date":"2011-01-17","text":"Be Yoga\n\nThere is a warm and  friendly staff here.  The instructors are knowledgeable and  give a wonderful class.   They offer a range of classes and at good times for when I cannot make an early class.  \n\nLooks great after the remodel.","useful":3,"funny":0,"cool":0},
{"review_id":"h0cCsWYGib7Ts06hX0MMKQ","user_id":"RHkeyjbP4aHvb-GKXE8DPQ","business_id":"GIPY7lBIIY8ITSfu63q-YQ","stars":4,"date":"2011-01-17","text":"Get there early for the  new releases.  The seats fill up fast unless you want to sit in the front row.","useful":0,"funny":0,"cool":0},
{"review_id":"FkpLpENAzkiRh9n5lboayA","user_id":"RHkeyjbP4aHvb-GKXE8DPQ","business_id":"D2ojX9bvE0_-aIj9BhdZZA","stars":5,"date":"2011-02-22","text":"Have the smoked mozzarella ravioli which hit the spot. I was not super hungry so this was the perfect option. I was sat almost right away, thanks to making a reservation. The people ahead of us were told there was a 45 minute wait. I am glad I called earlier in the day. I saw some there menu item I need to try, so I'll be back.","useful":0,"funny":0,"cool":0},
{"review_id":"B1Sc3DCnEeLih6obu-fHCg","user_id":"RHkeyjbP4aHvb-GKXE8DPQ","business_id":"VjLmatrIIRiOdOZWR12c-w","stars":4,"date":"2011-01-27","text":"The memorabilia on the walls are from various sports teams.   The owner works in some capacity for the Panters and that is how he gets them to visit on occasion for special fundraisers.    The food is bar food fills your belly while watching your favorite sports team (lose unfortunately) on this visit.  Be sure to get there early to get a good table if you plan to watch, some have better views then others.","useful":2,"funny":0,"cool":0},
{"review_id":"csK-bdt9KhJ6E6U-qxZYsQ","user_id":"oO83vNDz4A9mz0wXQ69WIA","business_id":"S-oLPRdhlyL5HAknBKTUcQ","stars":5,"date":"2015-03-13","text":"I was visiting from California and after seeing other reviews and pictures I decided to try this place. The service and food was AMAZING! There were 3 people in my party and we were pretty hungry after traveling all day so we ordered quite a bit of food at first and our waitress asked if we were pretty hungry and even though I said very hungry, she suggested that we wait on a couple of the rolls we originally ordered because their rolls were quite large. She was right! We had the perfect amount of food and left very full and happy! Their prices are very reasonable, the food was quick and the staff was very friendly. I highly recommend this place!!","useful":1,"funny":0,"cool":0},
{"review_id":"GE9rG39gOI1U5uFYMdFbMg","user_id":"oO83vNDz4A9mz0wXQ69WIA","business_id":"_JZ7hXqOZ_MngjPWFgER0w","stars":5,"date":"2015-03-14","text":"Everything about this place is AMAZING! The drinks, pizzas, and appetizers tasted great. Service was friendly and quick. The atmosphere and style of the restaurant was well designed and very comfy. Great happy hour specials too. Definitely worth eating there!","useful":1,"funny":1,"cool":1},
{"review_id":"FfGMXPPvUI6eMUg_8x5vnw","user_id":"LCcRraDG4_EW-6drYGfrDw","business_id":"hizckLDtLmSYGQIFAQ9pWQ","stars":5,"date":"2016-04-18","text":"Small café recently opened on the corner of st-Denis and Boucher. Serves coffee and matcha, amongst other hot drinks. Friendly staff and a relaxing space.","useful":1,"funny":0,"cool":1},
{"review_id":"c56kxIROQdx34d_cfd4u2w","user_id":"LCcRraDG4_EW-6drYGfrDw","business_id":"YwRGdP_Vu4WDDT6eNNNROw","stars":5,"date":"2015-05-29","text":"Good food and friendly service. I will certainly go back.\n\nAll it needs now is for more people to know it exists. I discovered it by accident, though speaking to people I know in the area, they weren't aware of its existence either. It is easy to miss being slightly above street level, so restaurant really depend on word of mouth.","useful":1,"funny":0,"cool":0},
{"review_id":"9z-fGeqxAJk6inElh1pS5A","user_id":"ysGshekLfxS8aGDIqj4P5A","business_id":"FDl-B4kuvpAsY8QPgXwQAA","stars":4,"date":"2016-08-19","text":"Food was pretty good. Plentiful. Just add more seasoning to the food and you got a winner.","useful":1,"funny":0,"cool":0},
{"review_id":"8egv30fZtwCAnVnvfE2nWQ","user_id":"ApRBomues4aPp_T5vq18ew","business_id":"8BG2u8inkqzCb2tm6YlqDw","stars":1,"date":"2015-10-02","text":".\n\nCame with clients for happy hour and immediately got a bad vibe from our waiter Jason.  He got obviously irritated because our party of 6 took up 2 tables and declined to move all of our drinks etc, to a single table for 6'once it was finally open.  He was rude and openly unhappy that we were taking up space.  When our sushi was delivered, a few people said the tuna rolls didn't taste like  tuna and when they mentioned it to Jason AND the manager, they both argued and acted as if we were ignorant and just wanted not to pay for the rolls!  Even with the sketchy treatment I tipped him 20%, only to have one of our party overhear him and the manager talking trash about us on their way back from the restroom!  I'm a regular there and Kona is not cheap and neither am I!  However, I will NOT be back to this location and both waiter Jason and unprofessional manager can choke on their tuna rolls that are not real tuna!","useful":0,"funny":0,"cool":0},
{"review_id":"MPd5LeXmJSq3HMiijIA65Q","user_id":"ApRBomues4aPp_T5vq18ew","business_id":"c31YqsnR1aTaSzawqa3L7w","stars":1,"date":"2015-09-13","text":"We had reservations for 6 people at 7 pm on Sat night.  Only one table in the very tiny restaurant seats 6 so at 7:30 when the people using the table were still sitting around talking after they had paid the bill, our group of 6 was forced to be seated separately!  Staff apologized but didn't offer any chips or go to the table and explain to the people taking up space that we were waiting.  Service was slow, food was mediocre.  Shrimp taco came in one large breaded piece.  I thought it was fish and when I picked off the breading I found one tiny cocktail sized shrimp inside the huge blob of breading!  All 3 tacos were the same way.  One tiny shrimp and a pile of breading and very little flavor.  Huge disappointment all the way around.","useful":0,"funny":0,"cool":0},
{"review_id":"Me7pWDTr8532gDO6_N3slQ","user_id":"_Q4s6dqhhz_E89xRAmBQvA","business_id":"VB-Cw7YKC9SWlzR4KUyGlA","stars":4,"date":"2012-04-06","text":"Look for amazing things to come out of the kitchen in the next few months....  the new cook has finger licking good talent !!!","useful":1,"funny":2,"cool":0},
{"review_id":"49JXwHooRYoM_ovFxJWIaw","user_id":"OSUo4-Xe_55O7YqixAcXRA","business_id":"eTBNs0QYa9fUOrNsZEllAA","stars":1,"date":"2016-04-27","text":"I actually went to this location twice about a year apart for child care for my son. \nThe inside looks amazing! But that's where it ended both times. The front desk staff ( one being management were very rude and look at you like you can't afford the place) \nThey walk you around with all these promises and smiles however as I'm looking in the windows of the rooms ... Not one smile on a teachers face. I actually as one parent said and noticed saw a teacher pulling a kid by the arm! Hell no, not my kid.. I witnessed almost every teacher over weight and sitting pointing and yelling at kids to do things. \nSorry.. I'm not thin myself but I'm also not lazy. \nAfter that I said no way!\nThese people here could careless about your children. They are one of the highest priced child care facilities in Las Vegas and they are lazy, rude, and misguide the public.\nNo way!!\nMy son has been at an amazing daycare now for some time and I absolutely love and trust every single staff member. He will also attend private kindergarten there.\nA place like Children's Learning Center is exactly why there should be several cameras in every room!!","useful":3,"funny":0,"cool":0},
{"review_id":"AUfkzeUKZWlYSonudeQCZQ","user_id":"cQ0uWohOim6AmsQ6ZoK9pw","business_id":"M51gw2cz_vXarNBLbKkOxQ","stars":4,"date":"2017-07-05","text":"If you're looking for a great cafe off strip, I highly recommend The Cracked Egg. Excellent service, prices are commensurate with the quality and quantity of food.","useful":0,"funny":0,"cool":0},
{"review_id":"L1uCW6B89BXD1C8ZhhDY6g","user_id":"BRvg0obWRbAToNkMh6L1pA","business_id":"Jy5nTZybMeaoofiAPAw5Nw","stars":5,"date":"2017-02-22","text":"The school is beautiful and the staff is amazing with kids, I would recommend this place to everyone.","useful":0,"funny":0,"cool":0},
{"review_id":"yB9CljreNwOiBmOxiCa2lQ","user_id":"MvIzmzHHoTn_11OnPvGUtw","business_id":"LgsMwQy_qJRD5_pZ2iz3UQ","stars":1,"date":"2016-05-11","text":"Horrible service the employees were rude. When I was going to pay there was four employees at the counter and I asked them a question to see what else they had for baptism...one of them just answered rudley \"what ever you see that is all we have\"... I stood in line for more than 5min to pay I was literally the only customer in the store and I was not even acknowledge by any of the employees. I just had to just walk out and left my things there. It was my first and last time at that store.","useful":0,"funny":0,"cool":0},
{"review_id":"1ySK95K_vOw0Uxb8c4Sz7A","user_id":"Xcde1ow9ubhw7NJ_7cN3tA","business_id":"1axspilnT28VyaM_TCJueg","stars":5,"date":"2016-08-02","text":"Zack and the staff at Rad Air are top notch. I had my vehicle at a dealer where they dismissed my issues because there was no \"code\". Rad Air listened to me, investigated and were able to diagnose the problem - they went the extra mile. I am very grateful to Rad Air and would recommend it to anyone.","useful":1,"funny":0,"cool":0},
{"review_id":"kkpC86Q3VEBNV7u_eGDUTg","user_id":"Xcde1ow9ubhw7NJ_7cN3tA","business_id":"k9rR23TeanYDFEdqUK9Hjw","stars":2,"date":"2016-04-23","text":"So mediocre. Menu limited. High priced. Don't go unless you want corned beef.","useful":0,"funny":0,"cool":0},
{"review_id":"2uCL_W18Z6Ntwrt2LLJ-cA","user_id":"q4Ce2TthzjzkS2xugEd6fg","business_id":"C6cZf419zes2W1S7MfRV6A","stars":5,"date":"2012-04-01","text":"Without doubt one of the most immersive and superb museums I've ever been to. I was on a whistlestop tour of the USA when I came to Cleveland for the Hall of Fame, and was gutted to have to leave after three hours. For a music fan, there was simply too much to see in such a short space of time. This museum has clearly had millions invested in it  from the interactive displays and documentaries, to the brilliantly displayed authentic costumes and painstakingly researched history. It would absorb even non-music fans through sheer exuberance. \nThe museum covers the origins of the blues, through rock, Motown, pop etc. Music of influence from the 20th century is covered, meaning there is plenty of music from Europe included as well as American. There is plenty of social and historical context applied to give a great backdrop  and of course, wherever you go, there are fantastic tunes playing! Well worth a visit.","useful":0,"funny":0,"cool":0},
{"review_id":"71q3-Gwswm7sekgopZ874Q","user_id":"8xc7JvjeDcKwOWcdtsUpsA","business_id":"NY80DkkCfEl198JmwtO4pA","stars":1,"date":"2017-03-03","text":"Terrible, terrible service. I stayed in room 1853 in the Carnaval tower. Room door did not close properly. These are heavy door and you hear a click but it did not close all the way, and can still be open from the outside. You have to pull with full force to get it to close properly. On three separate times, someone pushed my door in without knocking. Twice, there was a latch on the door and they played it off by saying casino security, your door is open. \n\nThe last time this happened, i was sound asleep and a guy went into my room then took off when he saw me wake up. Called the front desk and let them know that the door is not functioning properly and obviously being targeted by these criminals. Got transferred to engineering, person i talked to said they would waive the resort fees but wasnt too interested in doing anything else. \n\nWhen i went to check out, they waived for 1 night out of my 5 night stays. I discussed what happened with the receptionist. Apparently it was the manager's decision to only waive one night. I asked to talk to the manager. The receptionist came back a few minutes later and said the manager will waive the resort fees for one more night but that's it. If i want to still talk to the manager, I would have to wait until she's not busy. I guess she doesnt care about what i have to say. \n\nRooms are nice and clean enough but security is nonexistent. I will take the flak for not latching my door but they don't particularly care about your safety or belongings.","useful":3,"funny":0,"cool":0},
{"review_id":"Vxcy142PEllcJv9JXKLhrg","user_id":"rXsw0Zhe-sq-2KKu-htjLw","business_id":"q_c2ZvPJJxYEFPoWMKY2vQ","stars":5,"date":"2015-07-08","text":"When a reservation was made on the fly by a colleague to try out the relatively new resto, I couldn't help but jump at the chance. The decor is beautiful and set a lovely ambiance right away and the front of house staff moves perfectly, like clockwork. Dishes were whisked away as soon as the food vanished from our plates and glasses were refilled before we realised they were empty. The wine selection is impeccable, but expect to shell out for a bottle-- there were few options under $50.00. \n\nWe dined omakase (multi-course meal where dishes are chosen by the chef) and were given detailed descriptions of each course by the chef, himself, who was even so kind as to make separate versions of dishes for me, the only pescatarian of the group. We had the Jatoba salad with lobster pieces, spice-crusted beef carpaccio, a variety of sashimi from Albacore to Blue fin, another course of every type of dumplings, gigantic pieces of succulent shrimp tempura, seared scallops in browned butter, ginger lobster with grilled gai lan, and my coworkers even had the beef with grilled foie gras, while I opted for the buttery grilled king oyster mushrooms.  \n\nEach dish was a marriage of fresh and interesting flavour profiles, with classic additions such as grilled shishito pepper and pickled daikon to dwarf peaches and cucumber mixed with the lovely texture of roe and the melt-in-your-mouth fish. Delicate flavours were preserved, yet paired with bold tastes which would please even the most discerning of palates.\n\nEven the desserts were exquisite; although none of the eight of us has a particularly sweet tooth, we couldn't turn away the last course, which was plates of the mango curd tart with meringue brulé and green apple sorbet and a great take on the humble but delectable pouding chomeur topped with vanilla bean ice cream and raspberries. \n\nIn all of my experience dining out, I can easily say this was one of the top three meals I've ever had. I tip my hat to chef Olivier Vigneault.","useful":1,"funny":0,"cool":0},
{"review_id":"XJGZ2Pu_uHhw2p24S6SzUw","user_id":"rXsw0Zhe-sq-2KKu-htjLw","business_id":"Axz55vNN-HHUeXpSOodbeg","stars":4,"date":"2015-07-08","text":"I've been meaning to try Nora Gray for some time, as the owner\/chef once worked at Joe Beef, which is basically the golden standard of Le Sud Ouest and it was featured on the latter's episode of Munchie's Chef's Night Out. \n\nBeing vegan as consistently as possible, it was important to me that they be able to cater to my dietary restrictions, so I called ahead to be sure and received a pleasant response to my query. The vibe of the small, intimate eatery was cozy and quirky in the best of ways. Front of house staff were dressed informally, which spoke to the laid-back vibe of the place. Service was attentive without being overbearing and our server gladly offered wine pairings to each course. \n\nI had lovely grilled summer vegetables as an antipasto, which they removed the anchovy vinaigrette from at my request. It was topped off with crunchy, breakcrumbs, which were slightly salty for my taste. Opting to skip the primo, I went straight for a secondo of creamy courgette and pine nut risotto (vegan!) topped with rich, buttery wild mushroom. The second offering was delicious, perfectly balanced, and filling. For dessert, the server thoughtfully mentioned that the chocolate mousse with candied oranges and cookie-like crunchies was a vegan-friendly option. The taste of the orange was strong, but incredibly earthy and natural, while the texture of the mousse was velvety and decadent. Overall, the quality of the food was impeccable. \n\nMy only issue with my experience is that I found it to be somewhat pricey for the portion size, a problem that was consistent through each course. Dine at Nora Gray if you are able to savour and appreciate, as opposed to devour; it is food which tickles the palate and deserves to be treasured.","useful":3,"funny":0,"cool":3},
{"review_id":"dnRmqNJT3cJeY7UiNsSAHg","user_id":"rXsw0Zhe-sq-2KKu-htjLw","business_id":"FhgAHo-8--equM8w5UZ41Q","stars":3,"date":"2015-03-02","text":"We went on a Friday night and thanks to their renovation and added tables, there was virtually no wait time to be seated. The menu offers a fair amount of options-- I might even say too many, as some of the salads and bowls really have only one omition or addiction of ingredients separating them, making it somewhat redundant.\n\nI'm vegan and it really seemed as though the two non-vegans who dined with me were more keen on the food than I was. My perception of Aux Vivres is that it's basically another trendy, Plateau hipster haunt that's geared towards capitalising on the vegan craze, targeting non-vegans more than vegans themselves.\n\nI don't tend to cook with tons of seitan, TVP, tofu, tempeh, etc., nor do many other vegans I know, and yet most of their meals are laden with them. Fresh produce and inventive use of veggies (plus a chia seed there or a nut here) are more than enough to create an appetizing vegan meal. My veggie burger and fries were extremely, extremely heavy. The fries were more like soft slabs of potato than crispy French fries.\n\nMy two friends split a bowl (Dragon, I believe) and a BLT. The BLT was drenched in sauce and wasn't a taste I particularly enjoyed from the bite I had. I won't hurry back to the restaurant despite its relatively good service due to its overhyped, overpriced and under spiced food.","useful":0,"funny":0,"cool":0},
{"review_id":"3Ci30nBWL0i4fKa4JbrXJw","user_id":"rXsw0Zhe-sq-2KKu-htjLw","business_id":"_K63HbZBVQSBCvQicQdl-A","stars":4,"date":"2015-09-18","text":"Went there unexpectedly after grabbing a drink in the area seeking munchies and boy, did Satay Brothers deliver. Great decor and vibe, friendly and laid-back yet attentive service and most importantly, awesome food. We arrived at around 7:30 and thankfully didn't have to wait, though a long cue formed not long after we were seated at a communal, long table (If you seek intimacy in a dinner setting, try for a round table near the back).\nNot long after we ordered the tofu buns, seafood laksa and mee goreng with shrimp, our dishes were served up with homey presentation. This fare is Asian comfort food at its finest. The soup was creamy, spicy and full of body with delicate pieces of seafood that were bursting with flavor. The buns were fluffy and perfect, with cucumber slices that wonderfully offset the sauce and grilled tofu (which was cooked superbly). The mee goreng was spicy, flavorful and just plain tasty with a great blend of textures and was my favourite, because I adore noodle dishes of all kinds. Overall, the portions aren't huge, but they're better for sharing and they're authentic-- definitely worth the price for the ambience and fun I had.","useful":0,"funny":0,"cool":0},
{"review_id":"eP4ptBEcBCDN1xYwZYAOlA","user_id":"wrxSaV_51do65c6sTk2y4g","business_id":"SYa2j1boLF8DcGVOYfHPcA","stars":1,"date":"2014-10-07","text":"The manager screams at customers. Stay away and go to Johnny Rockets in the same food court.","useful":0,"funny":0,"cool":0},
{"review_id":"KN9qfwkmRjEBC_2SzdoJVw","user_id":"dnOOQszB1vGBOKxxiicBKw","business_id":"scLvLqVVIOWZbVT-exGjjg","stars":4,"date":"2016-05-28","text":"The atmosphere is awesome and very laid back, and the chips and queso are the best ever. Drinks are a tad bit expensive but overall a great spot","useful":0,"funny":0,"cool":0},
{"review_id":"80qxx6xxS5oFtPBy4Xb5eg","user_id":"dnOOQszB1vGBOKxxiicBKw","business_id":"jkAK0g9air0WZhc_WWvinw","stars":5,"date":"2016-05-28","text":"Great little place to grab a beer while the wife is doing some shopping! Bartender was very friendly. AMB Blonde was $3.52","useful":0,"funny":0,"cool":0},
{"review_id":"aQ0MLfF2TKi915kTqLxVvg","user_id":"gdXFF6ESAJ97tK2hh8MQ-A","business_id":"beuVp5CZxCdNvQIIPBS2rw","stars":5,"date":"2016-10-17","text":"Food at Chubby's was excellent we have table 5 and Deni was our waiter priced reasonable and the food was good","useful":0,"funny":0,"cool":0},
{"review_id":"XwW74Dll93t9kHc5Y_SV0g","user_id":"DcxNPgiLQ_eHOOFJ9o9LkA","business_id":"W8zRd4B-CjwGK_pgnJV6yA","stars":5,"date":"2015-03-02","text":"I have known John Clarke for 10 years and am a fellow colleague of his.  I find him to be one of the most genuine, fun-loving, empathetic, and compassionate individuals I know.  He is very dedicated to those he works with, and skilled at what he does.  John is not only a warm and welcoming individual who is easy to connect with therapeutically, but he is also knowledgable and well-rounded in his ability to tackle a wide variety of presenting problems.  I would highly recommend anyone seeking therapeutic services to work with John.  He is the absolute BEST!","useful":1,"funny":0,"cool":0},
{"review_id":"ib6BSSoOaCpuXt6qgrJoew","user_id":"2cjMDLUZZqabv5WB7Do66Q","business_id":"oi_jhCtPLj6NULrCe_JllA","stars":5,"date":"2016-05-22","text":"Excellent food across the board!! Have not been disappointed yet. Fry bread is the beast in town!","useful":0,"funny":0,"cool":0},
{"review_id":"uG12cX2ueFvWFXvVStkQhg","user_id":"2cjMDLUZZqabv5WB7Do66Q","business_id":"BEc3HRXw8xSEL2C6e47jRQ","stars":2,"date":"2015-05-12","text":"Very nice resort but be careful when booking a room. I am a Starwood lifetime gold member with over 400 plus stays to date. Never have I been charged for a room until I checked out, until staying at this property. I have been charged prior to arrival before but it is made very clear when booking. This resort gave no such warning. Be wary when booking","useful":0,"funny":0,"cool":0},
{"review_id":"lljeAcMZhxiRPo7QPNre7A","user_id":"2cjMDLUZZqabv5WB7Do66Q","business_id":"-XI7MQo_EVhQ8EtmhIn-BA","stars":1,"date":"2017-10-04","text":"I came here today to get a cashiers check. I wasn't happy with one of their policies. A fee they wanted to charge me for a sizable cashiers check. They didn't want to waive the fee. I told \"Diana\" the teller that I would be closing my accounts and taking my business elsewhere. Her reply was simply \"ok\". What kind of customer service\/retention is that?? I have banked here for nearly 30 years and always maintained a good balance. I guess they just don't care about someone like me that they have profited on for 3 decades. Thanks","useful":0,"funny":0,"cool":0},
{"review_id":"1251PfOgApjIBKewFHMR6A","user_id":"zssCQLeroiq2Cd5KBBO5EQ","business_id":"wAKV6rA1QppMTS3-FXRTSA","stars":5,"date":"2016-06-11","text":"Had the traditional Gyro with salad. It was exceptional. I will definitely be coming back to this restaurant when I'm in town.","useful":0,"funny":0,"cool":0},
{"review_id":"hE6pS-louY9BjFKl6hbg-w","user_id":"N9hUiudC16_2vyczyM4S-A","business_id":"iSQwKRrLYYi-dI2PpJmJJg","stars":5,"date":"2016-05-25","text":"My favorite place to eat sushi !!! This place has the most options out of any other place I know. Plus you can get more than one mochi ice cream! Crazy I know. And the service is amazing ! All the servers are so nice and smiley ! Love it and would recommend it to everyone ! And they have a happy hour BOGO after 9pm !!! Just perfect for an alcoholic for me ;) !!! Just kidding.. Kinda.","useful":0,"funny":1,"cool":0},
{"review_id":"0sPNmI7F3h1sIl2K2a1Sug","user_id":"0-pXmmxXGj4AhBJXAJE9Ww","business_id":"N8D-5-fW7EkBdKjNYGhu0A","stars":4,"date":"2011-05-01","text":"This review is for La Cave at the Wynn Hotel. There is also a restaurant called La Cave at the Paris hotel. Different restaurant, a bit confusing.\n\nBack to business, La Cave at the Wynn Hotel. This is a tapas restaurant. You order a bunch of small plates and share. Everything we ordered (and we ordered a lot) was delicious. There were 5 of us and we probably ordered about 15 different small plates. Also had wine. There was also a vegan in our party, and she ordered 3 different menu items off the vegan menu (you have to ask for it but every single restaurant in the Wynn hotel has a vegan menu if you ask.)\n\nMy favorite item was the flatbread with artichokes and ricotta cheese on top. It was amazing. I don't eat meat, but the guys in our party loved the mini burgers. They wound up ordering an additional serving of those. Cheeses were phenomenal. Had to ask for more little breads to go with the brie. My sister the vegan ordered another version of the artichoke flatbread (sans cheese) which she said was phenomenal as well. She also had a beet dish that she said was very good.\n\nJust a couple negatives. First of all, I called this restaurant a couple weeks before our trip to make reservations. I was told that since La Cave was one of the more \"casual dining options\" at the Wynn, they did not take reservations. Upon arriving at La Cave on the night of my 40th birthday, I was asked if we had a reservation. I told the hostess that i had called and was told i could not make a reservation. She said i must have spoken to the wrong person. She proceeded to tell me that their tables were all booked up for the night, but that she could make room for us in the lounge area. This turned out fine. I actually liked the lounge area better than the main restaurant area. A lot more light out there in the enclosed patio area. (Outdoor patio was closed due to high winds....although we saw people sitting out there even after we were told it was closed.) The only problem with the lounge area was that the tables were low and the seating is not really set up for a meal. But it worked out fine since it was a small plates\/casual eating situation. I was just disappointed that when i called the phone number listed for the restaurant online, i was told one thing, then was told something different on arrival. I am so glad they had room for us since this was a birthday trip planned months in advance, and i picked La Cave out of all the other restaurants in Vegas due to their menu options that worked for everyone in the birthday party. We dropped about $1,000 at this place, and they almost lost our business. I would say they need to fix this issue asap.\n\nOne other caveat: this place is very expensive. It may be one of the more \"casual\" dining options at the Wynn, but not when it comes to the price. Since it is a small plates\/tapas style restaurant, you have to order at least 2 plates per person to have enough food (that's why they're called \"small plates.\") Each plate is around $12-$20. And then there's the beverages. A glass of wine will cost you about $15. The cheapest bottle is around $65.\n\nAlso, i have to say that I wish there were some restaurants in Vegas where all the servers\/waitresses\/hostesses were not dressed like prostitutes. No matter where we ate throughout our stay, no matter how upscale the restaurant, without fail, all the waitresses were wearing skin tight stretchy dresses\/skirts that just barely covered their private parts. Since it was my first trip to Vegas, this caught me a bit off guard. But i guess that's just Vegas. This is definitely a town set up for men. I noticed that male servers were not dressed similarly\/scantily. Just the females (and most of the servers were female in all the restaurants.)","useful":3,"funny":0,"cool":1},
{"review_id":"NFc01xz3mjMRFBz53Ziexw","user_id":"0-pXmmxXGj4AhBJXAJE9Ww","business_id":"qUVnqIEYNbkHdUffYITr-Q","stars":4,"date":"2011-05-01","text":"Probably the least expensive dining option at the Wynn. Best NY style pizza i have had outside of the real NY. And I'm a New Yorker.\n\nFirst time we went was our first night in Vegas. Trying to grab a quick bite after seeing a show. We ate outside on the patio and ate our slices next to the pretty waterfalls late at night. Very nice.\n\nSecond time we came in for lunch with a larger group. Very busy, long line. \n\nThey also have a vegan menu here (you have to ask for it, but every restaurant at the Wynn hotel has a vegan menu). My sister, the vegan, had a vegan sandwich (veggies on vegan bread) which she said was awesome.\n\nHere comes the bad news for vegans. This is a order-at-the-counter then go sit down and wait for your food to be brought to you place. The lady behind the counter who took our order was an english as a second language person. We told her repeatedly that my sister was vegan and everything she was ordering needed to be vegan. We pointed at the vegan menu several times. She still kept asking every time we ordered something, do you want that with cheese? Do you want the vegan one? YES, WE WANT THE VEGAN ONE we said, LOUDLY while pointing at the vegan menu. O.k., so at the end, we thought we had properly communicated that we needed all vegan food for my sister. On the vegan menu were vegan garlic fries, which we ordered. We made it CRYSTAL CLEAR we needed the VEGAN garlic fries, not the regular ones. Seriously, we said it SEVERAL times. Well, my sister gets her sandwich and fries and starts to eat. I say, what's that stuff on top of your fries? She said she thought it was big chunks of garlic. Then she takes a closer look and realizes it's cheese. We go to the counter and complain. The manager comes out. They replace the fries with vegan ones, but the manager seems to be blaming my sister for not ordering the right fries. Are you kidding me? We could not possibly have been any clearer. Seriously, this is a very big deal to vegans. No apology, no offer of compensation, nothing. Very disappointed in how that was handled.\n\nHere's some advice for Mr. Wynn. If you want vegans to eat at your restaurants, you need to ensure that the staff at all your restaurants understand the vegan issue, and that they speak english fluently. This was unacceptable.","useful":5,"funny":1,"cool":0},
{"review_id":"NiHU4KCW3hw_uuK33hX2iA","user_id":"0-pXmmxXGj4AhBJXAJE9Ww","business_id":"8Q6jl7OW8DZzwANggDspcw","stars":4,"date":"2011-05-01","text":"I ate here 3 times while staying at the Paris Hotel in Vegas. Twice for breakfast, once for late night dessert in the chocolate lounge.\n\nEverything here is delightfully delicious. First time, I had the 4 cheese omelet with hasbrowns and rye toast and a big cup of coffee. Perfect and scrumptious. Dining companions had waffles with chocolate chunks and whip cream and berries on top. Delicious fun. Dessert for breakfast!\n\nWhen we came for our late night dessert we sat in the chocolate lounge area which is very cool. Had a huge cupcake. Dining companions had chocolate sundae and cheesecake. And we had some wine.\n\nThe only negative i would say is that just like everywhere else in Vegas, the hostesses\/servers dress like prostitutes. The skin tight stretchy dresses\/skirts that barely cover their private parts. Can i have my breakfast without looking at your hooha s'il vous plaît? This town is definitely a man's town. Male servers are not dressed in a similar fashion.","useful":0,"funny":0,"cool":0},
{"review_id":"8sp3iKiSj4q8EEF2EMpG-A","user_id":"0-pXmmxXGj4AhBJXAJE9Ww","business_id":"twX6mYg7TT1ImLUJflt5Tg","stars":5,"date":"2011-05-10","text":"Loved this place! It is off the strip, which made it hard to choose over the many spa options on the strip, but it had a pedicure option that sounded so divine, it made it worth the trip. I am so glad i did! You definitely need a car to get here.\n\nMy sister and I (along with our husbands and father) spent several hours here one day. The men hung out on the men's side of the spa, and we on the women's side. We went a couple hours early before our pedicure appointment so that we could enjoy the spa amenities before hand. So glad we did. You have to go early to do the \"aqua sulis rituals\" (i.e. the hot and cold pools) as well as the steam room. I love a good steam! Our spa service (pedicures) came with full access to the spa for the day. The men didn't have services done, so they had to pay a $25 fee for use of the spa for the day. My dad, who goes to vegas frequently, said he will definitely be back to enjoy the spa experience again.\n\nIt was disappointing that the outside spa pool was not in service on the day we went. It would have been nice to have been told this when we made the appointment and\/or when they called us to confirm the appointment the day before hand. Although that was disappointing, we thoroughly enjoyed our time there.\n\nThere is also a huge pool area (outside of the spa, the regular hotel pool) which is beautiful. There is also a poolside cafe where you can have a bite to eat. That pool was totally open while we were there.\n\nPedicures were amazing. We got the wine down pedicures which come with 2 glasses of wine each and a huge plate of several different cheeses as well as some crackers. Very generous portions of cheese, very good cheese, very generous and good wine. It was Ravenswood Zinfandel, one of my favorites! There was brie, cheddar, gouda... there was also a bit of fruit.\n\nThe ladies who gave us our pedicures did an excellent job. Every time i look at my pretty toes i smile remembering the great time we had! They took their time and were very professional and thorough with each part of the pedicure experience.\n\nThe chairs that you sit in during the pedicure are awesome. So comfortable. And the foot bath you put your feet in is amazing. The products used on your feet are so wonderful. Everything was perfect, relaxing, luxurious. I couldn't have asked for a better experience.\n\nThe only thing I think that could be improved would be a walk through of the spa area explaining the aqua sulis rituals. We were only shown to the locker room and assigned lockers. We pretty much had to figure everything out on our own. If you are advertising this as a \"ritual\" then you should explain what that ritual entails. Or if you don't want to pay someone to explain that, then at least have a sign up that explains it.\n\nThis was my first trip to Vegas. I really didn't care for Vegas very much and really don't have a desire to go back (i don't gamble, and hate cigarette smoke) but i have to say that the side trip to the spa was the best part of my trip, and i would LOVE to go back just to stay at this place and do spa days every day! I'm thinking i will have to plan a girl's trip just to hang out at this spa again. The entry way to the hotel looked amazing too. I'd love to go back and stay there and check it out.\n\nThe men also had a great time on the guys' side of the spa. The only negative is if you wanted to have a couples experience at a spa, this is not the right spa to do that in. The only shared co-ed area of the spa is the outdoor area pool and the gym.\n\nThis place is wonderful and absolutely 100% definitely worth the trip off the strip. Do it - you won't regret it! My free advice - go WAY early before your appointment to give yourself PLENTY of time to enjoy the spa! Make a day of it! Even if you are only having one service done!","useful":0,"funny":0,"cool":1},
{"review_id":"WKX0ZDAhSdjfeHno6-Ij3Q","user_id":"3L-jXrEUMl_sgmCreWwn_w","business_id":"btV_Ct01Q90nsXrXsD4DOA","stars":5,"date":"2017-01-21","text":"I thought I would give Jim Marsh's new Jeep store a try because I have been unhappy with my previous dealers. Roy took my vehicle in and went over everything I needed. I hadn't been real good about my maintenance and explained all that was needed to bring it back to top condition. I thought the prices were fair for all the work I needed. Highly recommend.","useful":1,"funny":0,"cool":1},
{"review_id":"ta4M02XwfpAjzkehOfL80Q","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"nJrFxROYx9sis3acKkhzgA","stars":5,"date":"2013-02-23","text":"This is a brilliant restaurant. Good ambience (with an excellent soundtrack over the PA), great service, delicious food. Pork sausage pizza, pig ear\/pigtail appetizer, bone marrow, bread pudding. There was no weak link.","useful":0,"funny":0,"cool":0},
{"review_id":"js3DACUyeYpUkAv2TlIxdA","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"i8BUEXriiKa-RmOImgbqaQ","stars":3,"date":"2013-03-08","text":"A decent place to chill. Local folks swear by this place, but I'm not quite sure what the fuss is all about.","useful":0,"funny":0,"cool":0},
{"review_id":"hTyLufPOAxW5tCLgvSfHFQ","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"hvjgF-vnPw2jyL5DBuB0qg","stars":3,"date":"2013-03-08","text":"The food at this place was pretty good, but I'd like to tell you about a fellow patron who absolutely ruined the meal for us.\n\nHe was a boisterous man, he was an obnoxious man. He thought he was a man of class, but he was actually just an ass. The martini he ordered he deemed was too strong, the manager however thought the ugly man was wrong. They had a tiff over this cocktail, one that should have been ended quickly and without fail. But it didn't really. And the fellow patrons (like me) had to endure this insecure asshat's bluster. Shouldn't the manager have diffused the situation quickly for the sake of the rest of us?","useful":0,"funny":7,"cool":0},
{"review_id":"zMCZ1etAIlJw-YJp82kjFw","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"2AM9rlnUE8chfYHzetRJMA","stars":5,"date":"2013-02-23","text":"Severance Hall is one of the most beautiful concert halls in the country, and Cleveland Orchestra is one of the best orchestras in the country.","useful":1,"funny":0,"cool":1},
{"review_id":"YIdUp8-2gsCWxvg8p9ELpg","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"AbPQf-X7awuPFDULiJ43bg","stars":3,"date":"2013-02-23","text":"In LA\/Orange County, this would be a two-star spot at best. But seeing that we're in Cleveland, Superior Pho deserves a bit of grade inflation.","useful":0,"funny":0,"cool":0},
{"review_id":"xwRnUc13PtvkNfyCkP0W5w","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"0W4lkclzZThpx3V65bVgig","stars":4,"date":"2013-03-08","text":"Delicious meats, funny staff, decent prices. Come on a weeknight to avoid the legendary queues.","useful":0,"funny":0,"cool":0},
{"review_id":"rWGoZN95AJoLOyL23ZBC-w","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"76VQeyubOwzkb6LxoWIhXQ","stars":5,"date":"2013-03-08","text":"Fantastic, fantastic bar with decent prices and excellent service. Love the environs!","useful":0,"funny":0,"cool":0},
{"review_id":"2vz7KhdnrW8jtBHL3Mx6rw","user_id":"4W1D-dUW7bC_CJYgslzUqA","business_id":"ZQwDPmRTCXFrNJpeqKihJQ","stars":5,"date":"2013-03-08","text":"This is an absolutely terrific place to get a drink. And be sure to get one of those fancy Slim Jims at the bar!","useful":0,"funny":0,"cool":0},
{"review_id":"OQIeTWkthJC9piqYV7othA","user_id":"pR6RuD3KAvvLmtb-z-T_Tg","business_id":"T_tCnwWz5NzmRHmBoXfDDA","stars":5,"date":"2015-05-01","text":"Bulwark is the best.   My tech is the best.   They come out whenever this paranoid momma calls.   Ever since my daughter was hospitalized from a scorpion sting Bulwark has been there for me.   I wouldn't change company's for anything.","useful":0,"funny":0,"cool":0},
{"review_id":"SCLPaft5YKwH-agqGiU8aQ","user_id":"pN88rAQHGQowb0KzQqdxlA","business_id":"rTQQKa57NHFS55I5JvhIUA","stars":5,"date":"2014-08-15","text":"I have been here 2 or 3 times for issues with my tires. I pull right up and they are waiting there with a jack. They see me right away and get me out of there in 30 mins. Very friendly and helpful for a small town shop!","useful":3,"funny":0,"cool":0},
{"review_id":"9GcTn7rDG69zAypTqehDTQ","user_id":"QRmcRQfdiVcCjGpkzUfK-g","business_id":"h7j6MJegP80-mCKamFWVng","stars":1,"date":"2015-09-22","text":"Worst limo service ever do not use. Limo was filthy dirty no air conditioning and ripped my wedding dress in the door. Charged us extra money without telling my husband and I until the limo picked us up. I am absolutely disgusted with everything about this limo services.","useful":1,"funny":1,"cool":0},
{"review_id":"XNoo9D7GBuioga5p4zcVaA","user_id":"QRmcRQfdiVcCjGpkzUfK-g","business_id":"_SuPPi-txNSwbWlu8IQkuQ","stars":1,"date":"2015-11-06","text":"Never going back overpriced and gross food. It cost $18 for a burger fries and a small can of pop. It took a long time to get the food too.","useful":0,"funny":0,"cool":0},
{"review_id":"-eG87o4qvbR0VFK2WqZtoA","user_id":"u_NJGVZ6rS0s5izP17x3Fg","business_id":"gEv1Og5uGDLw9HkbKSGUZw","stars":2,"date":"2015-04-20","text":"I have to say that I was not impressed, however our server Danielle was great.  A bit overpriced for a watered down Margarita and that taco's are ok.  I've had better at Bloor and Christie in this little dive called El Salvadorian....and cheaper.  Very dark, to the point I couldn't read anything.  I would not go back here to spend my money.  I think there are better options and I found the taco's to be too drippy - wet, making it a nightmare to eat.  \nFirst time and last.","useful":0,"funny":0,"cool":0},
{"review_id":"kzjnuyf5gEJqRv82xDisBA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"AmSW0I3nxtQ4tdkhh0y7CA","stars":2,"date":"2013-07-01","text":"It pains me to give Santorini a 2-star review. After all, my family has been coming here for over 10 years and have celebrated many milestones including birthdays and anniversaries. \n\nWe had called in a reservation for a small group (which I'm pretty sure they didn't write down properly) and were tucked away in one of the empty front rooms, separate from the main dining area. It was a beautiful, warm summer night so we requested to be seated on the patio. The owner said it was \"too windy\" and \"going to rain\" (neither of which were true) and instead, allowed his staff to drink and smoke on the patio. Putting your needs before that of your customers is always a bad business decision. \n\nWe had 2 or 3 different waiters who were intrusive, hovering around and clearing each plate the second we put our forks down. It made us feel unwelcome, uncomfortable, and extremely rushed. I don't go out to a nice restaurant with the intention of, or expectation to, scarf my food like I'm at McDonald's.\n\nThe souvlaki entree used to cost around $15-18 and has jumped in price to $21 for an embarrassingly tiny portion of rice, and lemon potatoes with zero lemon flavor.\n\nI'm sorry to say that after having been one of my favorite restaurants for over a decade, I won't be returning to Santorini any time soon.","useful":4,"funny":3,"cool":1},
{"review_id":"XF90cXe6dHtD_Q2yw8U9VA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"tIvDO_1WNbb6UAifErQ-Ug","stars":4,"date":"2012-02-25","text":"Balzac's is the quintessential Liberty Village café. You feel happy just sitting in this beautiful vintage space with bricks and beams and huge windows; light streaming in to warm your face.\n\nSeating is rather limited and it gets packed quick, so you may have to wait for a table. It's a favourite with the Liberty work crowd on weekdays and locals on the weekend.\n\nFantastic coffee, organic hot chocolate and baked goods, forget about the always disappointing Starbucks in the Village and stop by Balzac's instead.","useful":1,"funny":0,"cool":1},
{"review_id":"eqc7DOeqib00OG-Le0S3ew","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"2wrzJrML4I00e-11UiV4iQ","stars":1,"date":"2012-01-10","text":"Let me preface by saying that after ordering food for delivery, I was going to give Raaw a better rating but that went out the window after dining in for lunch.\n\nUpon entering the dark, sparse-looking restaurant, the first thing I noticed was the smell of the musty cloth used to clean the tables. Not only did the place smell bad but the tables were visibly dirty.\n\nNext, a long black hair on one of the napkins. Appetizing, right? I'm assuming that because the place is so dark, the servers can't see what they're doing. Reassuring in a restaurant that deals with raw fish.\n\nOne of my dining counterparts received cold chicken teriyaki, while another person's was warm. And worst of all, we received ice cold, PRE-MADE sushi. Am I at a mall sushi stand? Good sushi is room temperature, obviously.\n\nTo add insult to injury (almost literally), all of the ceramic dishes had not one, but several large chips in them. Plus the miso soup was served in a cheap plastic container making the soup taste like, you guessed it, cheap plastic.\n\nMe thinks not, indeed.","useful":2,"funny":0,"cool":1},
{"review_id":"OzYoBMfx6y8gPchnML8Yow","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"sHXIiGercy22UVpwMMmYng","stars":4,"date":"2012-08-28","text":"Milestones, you've impressed me. On a busy Saturday night, you accommodated our last minute work reservation for 20 people and hustled like crazy to take our orders and bring our food quickly so we could make it on time to an evening event we were throwing. Good food and friendly service made it a great (albiet brief!) experience.","useful":0,"funny":0,"cool":0},
{"review_id":"yG1PoNfbfLIlWV2x0E9r6g","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"bMTvOepAgtRpD9nrNEy8zA","stars":5,"date":"2011-10-03","text":"After recently moving back to Toronto from Vancouver, my sushi expectations were high. Asuka did not disappoint and in fact, made some of the best sushi I have EVER had! The Green Dragon Roll will change your life.\n\nExceptionally fresh and perfectly presented, the food was truly outstanding. I couldn't stop \"mmming\" aloud in the same vein as the awesomely obnoxious What About Bob? movie dinner scene. \n\nGreat service, and delicious fresh fruit that was the perfect end to the meal. No surprise it's a celeb hotspot and will definitely be a regular spot for me.","useful":3,"funny":3,"cool":2},
{"review_id":"TdS5dc0MinXXQ7Pgd0hsWA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"Y-1lW4JXtrnez8b1T3RnKw","stars":4,"date":"2012-01-07","text":"When looking for a birthday venue that would please a group covering the gamut of 30-somethings to 80-somethings, I did some research on Yelp and came across The Academy (showing you business owners that it actually does do wonders for attracting or detracting new business).\n\nWe met for dinner on a Friday night and were seated at a large round table by one of the big windows overlooking Liberty Village. The interior was stunning with its classic combination of bricks and beams, artwork strewn on the walls, and vintage pool tables (hence the \"spherical arts\" bit).\n\nThe service was fast and friendly but not intrusive or rushed, and the food was delicious. I ordered the special, Red Curry Red Snapper, which was perfectly cooked and served with rice and crispy asparagus. My husband was feeling adventurous and tried the Cajun Seared Alligator, and my mother had the Tequila Mahi Mahi which was beautifully presented.\n\nThe menu is diverse enough to please just about any palette, but not overwhelming in its options. I can see how it would make a perfect wedding or special events venue.","useful":2,"funny":1,"cool":2},
{"review_id":"QPmFG1DGFN8-Kc-wWcLNiA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"RADloW1UROUn4FJFU4JJNg","stars":5,"date":"2011-11-18","text":"Buster's, simply put, rocks. Delicious, super fresh food nestled amongst the numerous vendors in vibrant St. Lawrence Market. If you're lucky enough to snag a table inside, you can eat right on the spot. If it's nice outside, grab a picnic table on the patio and watch the world go by while you happily devour your food.\n\nI'm no salad girl but their enormous Salmon Salad is spectacular.","useful":0,"funny":0,"cool":0},
{"review_id":"448dG3myUGx4BFefqGUbKA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"QoXT0qI6_3WeHImUuLAyjg","stars":4,"date":"2011-10-23","text":"This place rocks! A quaint little diner that makes the perfect greasy spoon breakfast, a mean Cuppa Joe, and Irish Soda Bread that my Irish grandma-in-law approves of. \n\nThere are a handful of tables\/booths so be selective about the time you arrive or you might be waiting in line for a little while. Good food and friendly service make it well worth the wait.\n\nOh, and I adore the Elvgren pinup menus.","useful":1,"funny":1,"cool":0},
{"review_id":"sGr5kF7NRvR0zEy22FM4Kw","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"afuGFlekksBXZQnEvTMv3A","stars":5,"date":"2012-08-18","text":"Oh. Ma. Gah. Some of the best sushi I've ever had! Fresh, delicious and fast, it satisfies my demanding tummy. I've been here with family a couple of times and everyone loved their meal. A relaxed atmosphere with modern decor, spacious booths and private rooms.\n\nThey make some really fun and unique specialty rolls like the Canada Roll and the Go Train Roll, served on beautifully decorated plates, and the Chicken Teriyaki has a generous helping of chicken that's perfectly tender. Great service tops it off and I'm willing to travel from downtown Toronto to eat here.","useful":0,"funny":0,"cool":0},
{"review_id":"H62ZEp_sul7OsZV711Haig","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"6HhR4I-Oq-6iUoq0_BTjyg","stars":5,"date":"2012-02-13","text":"Oh Timmie, we reunite! I used to take my dog here when she was a pup. Then we moved across the country and back, and have returned to Timmie Doggie Outfitters. I've always had such a great experience here and the owner is super friendly. I bought an adorable striped sweater that has lasted for years, leather collars and other goods, and have always been happy with the quality and cute compliments from strangers.\n\nThe only downside is that my dog gets freaked out being carried downstairs for her nail trim, but she quickly forgets her fear when she comes back upstairs looking sharp (no pun intended) and is treated to a mustache-shaped cookie.","useful":1,"funny":1,"cool":1},
{"review_id":"2WUqI6fxM_-gigTwPeFyfg","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"0LA4HKI7ydji1zwnqDbgnw","stars":2,"date":"2012-08-09","text":"It pains me to write this, Sweet Lulu. You've been in my life for years. So it is with great disappointment and sadness that I write this review.\n\nSweet Lulu has always been a Queen West staple and I have many fond memories of date nights and lazy day deliveries. The concept is perfect and the meal has all the elements one could possibly want in a dish - noodles, protein, veggies, garnish and sauce, all customized to your liking.\n\nMy beef (no pun intended) began when both my husband and I started noticing tummy troubles after consuming the main dish. At first, I tried to brush it off as something else we had eaten that day, but it started happening more frequently. Before, just one of us or the other... but now, both of us.\n\nI'm not sure what's causing this issue or if some wacky ingredient has been thrown into the mix but unfortunately now, you're just somebody that I used to know.\n\nNOTE: The extra star is for the friendly phone service and awesome delivery dude.","useful":1,"funny":0,"cool":0},
{"review_id":"Fi2NM-QeJlbg10Chelb8dA","user_id":"fcgF4Vny2sOZc0-4LRmGdQ","business_id":"gJWI-q_STAuJS28--P_E0Q","stars":2,"date":"2011-12-31","text":"U-Haul's website is misleading and their customer service disgraceful. After making a truck booking online for a move to a new apartment, I received an email a couple of days later stating an entirely different pickup time and location. Baffled, I called their customer service and was treated to the attitude of a smug and highly defensive female who refused to let me speak. I called back numerous times before finally being transferred to the Manger so that I could complain to someone with a slight grasp of customer service.\n\nIf your website makes you do the rounds to search for an available truck then asks you for a credit card to hold the reservation, I would expect the date and time to be set in stone. Well, with U-Haul it ain't. They can change it whenever the hell the feel like it if they rent their vehicles to someone else... even though you have expertly coordinated your pickup time\/location to coincide with your apartment elevator booking time.\n\nThe only reason I give them 2 stars instead of 1 is because we drove across Canada with a U-Haul trailer attached to our truck and arrived with all of our belongings in check.\n\nA moving company with a useless website that doesn't understand the coordination and timing involved in a move, while also contributing to your already high stress levels, is not a company that I want helping me move.","useful":2,"funny":0,"cool":0},
{"review_id":"fDOZ5GYFvIL3mG6MlzgavQ","user_id":"Y21XrY57Y4DUGNtYbPlT9A","business_id":"JmI9nslLD7KZqRr__Bg6NQ","stars":4,"date":"2013-03-03","text":"Great airport! Very clean, security lines were not long. And free wifi is always a plus.","useful":0,"funny":0,"cool":0},
{"review_id":"YpjF_8HL4_jIdVhrp4VKrg","user_id":"Y21XrY57Y4DUGNtYbPlT9A","business_id":"Mul_BVwcnhqmp2h_7QFepQ","stars":4,"date":"2013-03-15","text":"My wife and I had a really great time. We were on vacation for the weekend and will be coming back in a couple weeks. This place is very modern, dimly lit inside. We sat outside where you can eat or relax on some couches they have set up.\n\nThe bruschetta was AMAZING! You choose between 4. They come in a fairly big size compared to other bruschetta. Highly recommend trying the pulled pork bruschetta. We split a flatbread too which was ok, but the main event is the bruschetta. Can't wait to come back here during our spring training visit.","useful":1,"funny":0,"cool":0},
{"review_id":"MYbaIKWm7fSUqnhGZSQ55w","user_id":"Y21XrY57Y4DUGNtYbPlT9A","business_id":"7cK9uEV09iPmsTqOqmY3kQ","stars":4,"date":"2013-05-06","text":"The set up to this place is a complete mess. I still have no clue how it works, I ordered my drinks and pizza in two different places. Even the employees weren't sure. I was a little frustrating and immediately put the blame on hipsters and their stupid rules. Parking can also be a mess.\n\nWith that said  once you get over the set up the food is amazing. Highly recommend the corn pizza....soooo good. We even made room for dessert with some red velvet cake which was incredible too. This place really has everything good food, a bakery and even a good sized wine selection.","useful":2,"funny":0,"cool":0},
{"review_id":"6O27IGpbHFMUKb2qxuIyiw","user_id":"vHlBrAOjXIylDJQ1Us9uXg","business_id":"66m_zCy5JIDijS9F5OLC2A","stars":5,"date":"2014-11-18","text":"I went into Gravity Pope looking for a pair of comfortable work shoes. I had a 95hr week coming up at The Royal Agricultural Winter Fair, most of it spent standing.  The sales woman suggested I try on a pair of camper's, which I've never worn before. They've  been the best pair of shoes!  By the end of the week, I had sore legs but my feet were in great shape. \nGravity Pope have great shoes, really impressive stock plus staff who are efficient and knowledgeable.  The sales woman, Mel, really knew her products. Thank you - I will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"H2KzaRINJa0cQoNNTUrOFg","user_id":"A6WnGKjXFec1dlmwsqudvQ","business_id":"JAmQCmczUclNUfZjkNdjQA","stars":1,"date":"2017-04-27","text":"I went into the ticket counter to get information about the different offerings for the High Roller. There I was greeted by the most uninterested customer service representative I've ever encountered!!! Her name is Amonde.  Don't wear a name tag if you don't want to work!!!!!! She never made eye contact and her answers were vague!!! If all the employees are like her you'll never have customers!!!  Don't go to Amonde!!","useful":0,"funny":0,"cool":1},
{"review_id":"5WzKLdBuF3o-Q7G9jb3_cg","user_id":"A6WnGKjXFec1dlmwsqudvQ","business_id":"ThNGovQZjZ5mn-ZwX_N2BQ","stars":2,"date":"2017-04-27","text":"The pool!!!! The pool is open to the public which means if you PAY to stay at the Linq there is no guarantee that you are going to get a free lounge chair. You could reserve a cabana for a fee!! But why wouldn't a hotel  want to make its paying guests get first choice at the amenities it offers!!! And it's only open until 5:00pm!! So if you're planning on staying here and plan on using the pool with the complimentary lounge chairs, I would suggest getting there at 9:00am when they open to put a towel with a book, shirt, sandals, etc.... to hold a lounge chair if you don't plan sitting there at that time so then you should be guaranteed a lounge chair when you decide to stay later. Luckily I was able to get a lounge chair because it wasn't busy yet.  And to close; the hotel should give this info to its guest at checkin!!!!!!","useful":1,"funny":1,"cool":0},
{"review_id":"KzcoLHYyeO66W2txtp1mzQ","user_id":"HXVmLxTIx89mKPElHQyE6w","business_id":"k2Zr99LMNhkKWgJrTcWFpg","stars":4,"date":"2013-07-13","text":"I had my very first ever Juvederm treatment last month from the students and outside of a small amount of bruising, I am really pleased with the results.  The facility is beautiful, the assistance at the front desk was excellent and outside of being nervous about the procedure, the whole experience was definitely worth it.   I'm going back again today for botox.   Can't beat the price.","useful":0,"funny":0,"cool":0},
{"review_id":"l8hqXyy0Xh7RyOdiQpvvNw","user_id":"jcSeam9CVlpfuO73WQe_8g","business_id":"svRAGD2eDu2kXiZuV5Qd5g","stars":5,"date":"2012-02-06","text":"I'd driven by this establishment many times and never paid it much attention.  I finally made the effort to visit the Souper Market after purchasing a Groupon. \n\nWell, let me say that I am very glad that I did.  I tried two soups (Tomato Ginger and Spicy Chicken Chili Verde) and a Greek salad.  Everything I had was delicious.  I'm not a huge soup fan but these were fantastic.  \n\nIt's a little on the pricey side (compared to, say, a fast food lunch) but when you realize that you're paying for high-quality ingredients in freshly made soups, it's totally worth it.\n\nThis is a great example of an overlooked local establishment that once discovered is hard to forget.  I work nearby and plan to make this a regular lunchtime treat.","useful":0,"funny":0,"cool":0},
{"review_id":"viG9Cltg5fNz5h3iUs30WA","user_id":"SOdgarmjj3QJudDCvEet-g","business_id":"xUEoAG8qto7HXQnEqMcuuA","stars":5,"date":"2015-05-18","text":"I can't believe people have bad reviews of this place because we've been here a number of times and it's always been great! They even have gluten-free buns! Yum!","useful":0,"funny":0,"cool":0},
{"review_id":"pNBndkf4t5O7TTWQ6kEj-w","user_id":"QSfVYrd2LoZ-nqXtTt8v-A","business_id":"I6Cjm4e5bg8ywf-FTQ6IZw","stars":4,"date":"2014-03-01","text":"Convenient place to stack up on snacks before flight. Bummed out though that they don't have any hanover flavored pretzels. Lines could be longer and slow at times depending on the crowd!","useful":0,"funny":0,"cool":0},
{"review_id":"S-YDoubjVy8Y3LcWMYdJWQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"WZ33VrvFDH-zZX6S7hg3Tg","stars":5,"date":"2017-09-10","text":"Possibly the best vape shop in Toronto the staff here are awesome really nice and knowledgeable on stuff they sell from tanks,mods,rdas \n\nThey entire store is very organized and clean,they even have a beverage fridge with drinks so you can sit on the sofas and test out all their ejuices they have in stock \n\nThe new Ejuice menu is nice as well organized in flavour category and shows vg\/pg ratio,bottle size,brands & prices,what's nice about this place is they have a discounted Ejuice bin 50% off but most of the time those are either 0 nic or 12mg juices but if you're lucky enough they sometimes have your nic strength in there\n\nGoodlife vapes also has a customer rewards card when you buy 9 bottles you get one 30ml free or 60ml half price which is awesome other stores require have the same reward program except they require you to buy 10 or 12 to get 1 free and they don't offer any discounts in their rewards\n\nThe ejuice selection is pretty good tons of brands and flavours to choose from mostly Canadian Ejuice it's probably cheaper to get local than from the US but they do have some us brand juices","useful":0,"funny":0,"cool":0},
{"review_id":"3iJZioYLkADlFQFzrJHuCg","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"VKe24NSsL8OeWZN2wcX3rw","stars":1,"date":"2017-11-20","text":"I came here last week to purchase a mod that was on sale when I got there one of the guys was trying so hard to push me to buy different mod that I didn't want,seems as if he was working on commission because he just talked about it and features etc etc but I wasn't interested when I got to the counter to pay I also wanted to get some Ejuice he didn't even offer to let me try any flavours he just recommended one of their shitty in house brand juice which taste nasty it's like vaping cough syrup it's that bad 60vg 40pg ratio \n\nAfter I got the mod the employee (guy with the spacers in his ears) even tried selling me batteries saying do you have batteries? And are they new? Like really? What's with the upsell attitude I've been vaping for 5 years now and I know my stuff \n\nSeriously one of the WORST vape shops in the gta small Ejuice selection, the website isn't even updated properly and bad customer service\n\nAlso this location is hard to find it's hidden behind a building \n\nI won't be going back here or any 180smoke it just seems as if the staff are all working on a commission and trying hard to sell there line of juice because I did see other brands but wasn't even told about them \n\nFor those who gave this place 5 stars you have never been to a Good vape store this is a franchised company so they'll end up trying to sell their juice lines and upsell you stuff you don't need,there so many better vape shops that ARE NOT franchised don't even bother going to 180 smoke just the worst big branded store ever\n\nThe only things that's decent about this place is mod selection they do have a lot and usually have sales on the site to","useful":0,"funny":0,"cool":0},
{"review_id":"l0oUdP8dCmP3liRZ1-h4lQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"slU5UwPlYVyrz7HhQeqMew","stars":1,"date":"2017-10-16","text":"WORST MCDONALDS EVER! I just don't get why they always have 1 cash register open and lines out the door,slow employees who can't even work a register it also seems as most of the front cashiers weren't properly trained as they can't even work the pos system \n\nMany times I have ordered and they always forget something in my order that's why I always check before I leave or else I waste my time coming back in for a mistake THEY made oh and keep the receipt in case you drive half way home and realize they missed something in your order\n\nThe manager here is rude the Indian brown guy a customer was angry about his order and the manager said stop complaining  or I'll kick you out! Even the other manager with the tats she's rude seems like all the full timers here are uneducated mor**s\n\nThis location is the worst especially since it's near some schools so DO NOT even bother going there during lunch 11-12pm as it's packed with these school rats and the high school kids that go here are annoying after they order they just crowd around the front counter expecting the food to come,kids...GTFO!\n\nSeriously this location just sucks ***","useful":0,"funny":0,"cool":0},
{"review_id":"RR4jFZR756YjyGudy_8lYw","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"Z40KWLAfjjYhM7qhGPZcNA","stars":1,"date":"2017-11-27","text":"Possibly the worst b&m vape store in all of GTA, been to both locations the Yonge st one won't even allow you to taste test the flavours because they share it with a western union store \n\nThe danforth location just plain sucks the store is so unorganized as they are also a cell phone store, went in the other day because this place has their in house Ejuice on sale and it's my only last resort for cheap juice went in and bought a few flavours and noticed the shelf for their in house is so messy bottles just everywhere\n\nI asked for some of them to be nic'd as they were all 0 mg strength, also if you plan to buy a tank or mod DO NOT because most likely they were open and used and repackaged as new I saw a tank in the display case and noticed there was still Ejuice inside the tank in the package so be warned! \n\nAfter getting the ejuice home I was pissed because one of the bottles was only half full & was just pure nicotine not even vapeable I can see why this place is failing if I asked for nic wouldn't they have noticed it was half full before I went home!? Seriously never going here again I don't even know why this place is still open","useful":0,"funny":0,"cool":0},
{"review_id":"ACb8_-qJw2J-UQ-A_s5FTw","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"qR4EIktJfQKc4rnKgBzvtw","stars":3,"date":"2017-11-02","text":"This is the new location the 1st location is in Markham, so decided to try this place out after seeing it from Blog TO if you do plan to go here either taxi or uber it as parking is pretty hard to find because it's right on Bloor st with limited parking spots available near by.\n\nI called to try and make a reservation but they do not take reservations only walk ins, there was a long line up to the door we waited about 30-40 mins to get a table. The menu has a variety of meats from seafood: shrimp,squid,chicken,pork & beef they also have bibimbap.\n\nEverything is ordered by pieces the pork & beef are sliced very thin which I didn't like.\nWe all liked the marinated Kalbi beef tasted really good & the peppered beef were thick strips & tasted good actually\n\nSides include lettuce,kimchi,mushrooms,cold noodles,bibimbap,brocolli,cold noodles there might have been more\n\nBibimbap was ok small portion rice with seaweed,sauce and a sunny side up egg \n\nFor the meat options definitely order more if you have a big group because the size of the cuts won't fill you up unless you eat bibimbap with it\n\nDessert menu had only 2 items creme brûlée or melona bars ordered one of each, creme brûlée was good crunchy top shell and creamy & melona bar is only ONE per person\n\nEverything came fast even though the restaurant was full.\nCurrently the beer size options aren't available on the menu so they only have Sapporo cans we ordered 2 mojitos lychee & the yuzu mojito which were really good\n\nAfter eating here I can still see why other non AYCE Japanese bbq is still better because of the beef quality,portion size and freshness so in conclusion if you don't want to pay per order at other Jap bbq places this is the place to go with all you can eat & a la carte menu","useful":0,"funny":0,"cool":0},
{"review_id":"WN9h-ARJErjoBrZ69OW-SA","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"uB0--oSQ0x5scE447E7t5Q","stars":4,"date":"2017-11-27","text":"One of my favourite vape shops to go to, the guys there are friendly and greet you as you come in, my main reason why I go here is it's close by and they have a lot of flavours in the brand I like only downside is they carry them in mostly 30ml wish they had 60ml \n\nThey also have samples so yes you can try any of the flavours in store and actually offer to try unlike other \"big brand\" stores I've been to\n\nLike most vape shops they also have a discount bin of Ejuice $10 for 30ml & $15 for 60ml and usually they have a few bottles in there if you're looking for cheap juice","useful":0,"funny":0,"cool":0},
{"review_id":"CfVF7_SVDWJpugzM7FQNzg","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"rxA9c0_XObabVL1WCTA4FA","stars":1,"date":"2017-10-05","text":"Worst service EVER! Ordered large wings,fries & nachos \nTook an hour for this ****!\n\nI just don't understand why it takes that long to make nachos & fried foods...\n\nIt was a busy night but I'm assuming they are really understaffed\nEven most of the servers didn't check up on tables \n\nThe wings were good hot and crispy\nBut the nachos seem like they have been sitting somewhere cuz when we got them they were cold","useful":0,"funny":0,"cool":0},
{"review_id":"-bUVo6Mjy4DkDBqN3vTGgA","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"Sg8yJcPrDzCxkpBWWM9B4w","stars":1,"date":"2017-09-16","text":"One of the worst experiences I had as soon as I walked in this vape shop no greet I stood by the counter for a good minute or so while the guy working there was just watching tv he finally asked what I needed and I asked for 18650 batteries he checked and said sold out and I they won't be getting any for another week...how do you even run a vape shop and not carry products in stock?! \n\nStore is a mess no ejuice testers available\n\npossibly THE WORST vape store Toronto has...stay away from this place","useful":0,"funny":2,"cool":0},
{"review_id":"vQnuADdKmcYgq19L1bzdRw","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"HBYoTLOTyZSKTMk0c5b9pA","stars":1,"date":"2017-07-14","text":"Seriously the worst Walmart I've been to, I asked an employee where I could find clothing dye she just gave me this look and replied very rudely about it. Also when I tried find it almost half the shelves were empty or low on stock...this Walmart is slowly becoming like target empty shelves,low to ZERO stock and failing horribly, also the last time I went here I was looking for a brand of dog food I bought here before and there was none in stock I've come back to check numerous times and still EMPTY f***** shelf as always! All they had was the smaller bag. Avoid this disaster of a Walmart as they don't seem to stock up on their products","useful":0,"funny":0,"cool":0},
{"review_id":"s-_nW5PS2CDXeaXAtjmBEQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"wFxDhEaif1fJM8pBK4CD2A","stars":1,"date":"2017-11-11","text":"The WORST shoppers ever I've had multiple BAD experiences with the new cashier she's a short haired white female with glasses named Sara, she has an attitude the last few times dealing with her. I went to her to checkout upon scanning my items I had a few items with 50% off sticker SARA had to peel off the sticker and look under just to verify it was \"real\" or as if I had stolen it or placed the sticker myself IT was really rude and had caused a lineup she even had to call management, she is NOT even a manager but acts like it,I will be reporting this to corporate \n\nDO NOT GO TO HER CHECKOUT WORST CASHIER EVER! Look for her name tag Sara all she does is cashier","useful":0,"funny":1,"cool":0},
{"review_id":"xLlmlR7g-300mrgzZE4d5w","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"bLtC8xJXkd1b6MT0KjnSvw","stars":1,"date":"2017-09-07","text":"This location got yellow on the food safety pass I would not come back here ever again \nI ordered a pound of shrimp,mussels,clams it took 15 mins for our food,I checked out the Ontario food safety of this place if they got yellow it must be DISGUSTING especially under the new management","useful":1,"funny":0,"cool":0},
{"review_id":"DBy85mIoZ4nxylVjdhDypQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"gPQOUyooQ3O9H8OmnxVNnA","stars":1,"date":"2017-10-16","text":"Those who actually gave this place a 3-5 star rating have absolutely no idea what real pho broth taste like \nWent here and ordered the special pho \n\nThen broth wasn't hot enough,lacking flavour as all it tasted like was a bowl of warm water,salt msg \n\nI can definitely tell the owner is not viet as this wasn't a true viet authentic style pho that I've had other places\n\nEven their vermicelli with sausage was bad \n\nDef won't be back I had no other choice for pho as this was the only spot in the area when I was there","useful":2,"funny":0,"cool":0},
{"review_id":"VtMe2ByYW8dFX8WG8BE_6Q","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"i3oRRwl3RWOxKfTtiJbliw","stars":2,"date":"2017-09-10","text":"I've tried many burrito joints and this one was so-so first time here and I had a large pulled pork it wasn't that bad tho I did find the pork a little to salty for the price around $9-$10 if you add guac which is $1 extra \n\nThe tortilla wasn't grilled long enough so taking the first bite was kinda soggy it's loaded with rice,beans and other toppings basically how you'd order at subway.\nVery filling though though if only they had cooked veggies like green,red peppers & onions that other places do\n\nI also ordered 2 tacos, steak & ground beef soft taco \nI liked the ground beef more as it was moist and flavourful the steak however was REALLY dry & they put the tacos in a take out box which is really messy as the sauces leak out it should be wrapped individually in tin foil\n\nI did come back here a 2nd time but this time just ordered a chicken burrito you can do mix of 2 meats so I had 1\/2 chicken & 1\/2 ground beef,the chicken was actually really good juicy and not dry but what I couldn't tell was if the chicken was actual chicken breast or processed as it's sliced and almost tasted like those process chicken breasts","useful":0,"funny":0,"cool":0},
{"review_id":"dFgLVdH3KJuBPK4ys3MinQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"FnJWypqTdYTcSNYEJeq1Ew","stars":1,"date":"2017-10-05","text":"This was my first time here and won't be back as i was ripped off I had come for ONLY medication for my dog and was told she needed an exam which I wasn't told they'd charge me the exam was $90 and my dogs meds was $150!? I ended having to pay for the 2 minute exam in and meds when I got home I looked it up the tick & flea medication DOES NOT cost $140-150 as petsmart sells the exact same one for $60...I got ripped off","useful":0,"funny":0,"cool":0},
{"review_id":"mAFEeS1SYSw2CoU2ZdjmKw","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"agWZA6ajLvu6MfFySNBzZw","stars":1,"date":"2017-12-11","text":"The portions at all the captains boil are ALOT smaller now went here recently and ordered 1 pd of mussel shrimp & clams came out to be about 10-13 shrimps,9 mussels ridiculous for the price I have no idea wth is going on it could be the new management that's running this place or with corporate but like a lot of people\nHave been saying the cap boil is just failing even their sauce has changed its now thinner the cap boil sauce \nBecause all i see is OIL \nI remember when I first had this 2-3 years ago when the sauce was thicker and now it's just all oil DONT EVEN BOTHER GOING TO CAP BOIL if you really wanna pay over priced seafood in a plastic bag of OIL disgusting","useful":0,"funny":0,"cool":0},
{"review_id":"4TaUOkTljf8KjaxyOO6pOQ","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"0QjROMVW9ACKjhSEfHqNCQ","stars":2,"date":"2017-12-14","text":"The only reason I come here is for the bbq food the fresh roll platter,vermicelli noodle bowls etc I don't even know why anyone would order pho here as it's not that good.\n\nProbably my 2nd or 3rd time here because the service is slow I timed it about 25-30mins to bring our food!? Ridiculous as another table came in after us and got their food first,even when I asked for the bill they didn't bring it to us why is that so hard??? Seems like there is only 1 person in the back kitchen I ended up going to the front to pay\n\nYes they only take cash but that's like most Asian restaurants so better have cash on you \n\nFood was good had the platter but the hot water to dip the rice paper was in a plastic bowl they should actually be using the proper container which would also save a lot of space as our table was small","useful":0,"funny":0,"cool":0},
{"review_id":"UuXVPqk8aI8iHrN3gPw3iw","user_id":"YnKgniSSRLCfEmtVxaOS5Q","business_id":"b6Rv6vwJPaMAQGuSsqPPPQ","stars":1,"date":"2017-09-07","text":"Was here a while ago, ordered the pho dac biet and took way to long to arrive,also tea IS NOT FREE, after waiting about 15 mins the pho broth was tasteless all I could taste was msg,msg,msg,MSG!!! It was basically water and salt this is definitely not authentic pho \n\nAlso another thing I didn't like was that pho only comes in 1 size I know most people can't finish a large but that's the only size they have...you gotta have size options!\nThere are other places to get good pho but this is not the place","useful":0,"funny":0,"cool":0},
{"review_id":"azjVn4uuY-4WTQXRWKI-4Q","user_id":"axJ2Jhq6bESEeKk3ZDfAMQ","business_id":"p0iEUamJVp_QpaheE-Nz_g","stars":1,"date":"2014-08-18","text":"Bad experience.  Went to check in and was told my reservation was canceled.  Then found out later it wasn't and they charged me for an additional room and the \"manager\" I spoke to (a woman) was rude and unhelpful.  Kept telling me \"I wasn't there, I don't know what to say\".  Well, say that you'll find out why I was told my reservation was canceled? \n\nRooms were big, but looked old and plain.  Good enough if you're not in the room very much.  $14 resort fee seemed high for getting about nothing. \n\nOverall negative experience.","useful":2,"funny":0,"cool":0},
{"review_id":"8Kc_tJyqgdf2DHzRivVdfw","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"NLEe-RzDSU-5BN6xp_WWCw","stars":5,"date":"2011-08-31","text":"OK, I have been here before and loved the food, and my daughter adores this place as well. I was a little hesitant because there was a review posted that made me uneasy, I am Caucasian and my daughter is bi-racial. I have been in places where both she and i had been discriminated against and it is hurtful. I will say when i came in here today, i was immediately greeted by Jasmin (?) I hope I got her name right. She was so helpful and took our orders right away. I had a restaurant.com certificate and i wanted chicken and waffles (my daughter loves Roscoe's in Pasadena and I wanted her to have them here). Jasmin suggested we get the chicken and waffles and in order to utilize the value of the certificate she recommended the smothered chicken as a to-go order. The food was brought out fresh, hot and delicious. No attitude by anyone that I was aware of, if anything, they were uber attentive. She even got us our drinks to go. Nice touch. All the food (and there was a LOT) was so delicious. I will definitely be coming back more often. everyone has an \"off\" day and poor service and rudeness are inexcusable, but I am happy to say that M&M treated me and my daughter like family. I can't wait to try the chitterlings next time..","useful":2,"funny":1,"cool":0},
{"review_id":"iSrVV722uwUd772bEEsYeA","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"dWrezcuIAO-Ckx1W0gu5jg","stars":5,"date":"2012-01-20","text":"I am so glad I am back in Vegas,  I missed this place.  I stopped by with the intention of just picking up some fresh pasta foe dinner.  Ended up getting spaghetti Bologna's and a chicken parmesan sandwich as well as a loaf of fresh italian bread and an antipasti salad.  The prices actually seemed to go down (at least stay the same) as they were in the last 2 years.  The food and service are still excellent and you can really taste the quality that using primo ingredients and passion that chef Marc uses in his food.  It is superior to every other italian food I have tried from some so-called \"italian\" restaurants.  The portions are huge, and while it isn't cheap, you get what you pay for and the deli prices are no more than what you pay at the grocery store for deli meats and cheeses as well as bread.  It is also the only place I know that sells actual fresh pasta.  Yum","useful":0,"funny":0,"cool":0},
{"review_id":"t33LPT9Q-tC1tswf6w9Zng","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"lLj9ULb01sNIYDbYbeUqhA","stars":5,"date":"2012-03-03","text":"I give them 5 stars because I there is no 1\/2 point. They are excellent. I bumped up to 5 because the service was so friendly and the food really was worthy of 5 stars. My only MINOR sadness was no cilantro for my menudo (I forgot to ask and should have-can't fault them). I ordered the barbacoa taco (beef cheek) EXCELLENT--flavorful with onions, cilantro and a squeeze of lime to cut the richness. No skimping on the meat here, either! The menudo is some of the best I've had. No \"gamey\" flavor. Rich, flavor broth, tender tripe,  Mexican oregano (I have never seen that offered on the side before!) and the bread--the aroma wafted from the bag and was intoxicating!! I wish I had asked for cilantro and some cabbage, but again..my fault. And the \"piece de resistance\" NACHOS I deviated from the usual carne asada and got the shredded beef because it just sounded good. These are better than \"Bob's\" on SOOOO many levels!!  1: The chips - Fresher, not greasy, better flavor and enough salt. (and more of them). 2. The beans Not a glob of refried beans! Actual pinto beans and delicious at that! 3. The beef Tons of it, tender, flavorful, delicious. 4 excellent pico de gallo. 5. fresh guacamole evenly dispersed 5.what tastes like mexican crema again, even dispersed across the nachos. 6 Finally, and this is a biggie for me COTIJA cheese, not cheddar. Cheddar is greasy--cotija is not. It is a white tasty cheese. Their salsas are also really good they have a red and green, neither overly spicy, but flavorful. I am sure they have some hot stuff, and I can't wait to return to try more, just didn't want to seem a pig my first visit :)","useful":3,"funny":0,"cool":2},
{"review_id":"8CS_xiPVeJ3EDmLhi9X8Dw","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"D1BrHyiZON7u_ef-qt4_Uw","stars":5,"date":"2012-01-20","text":"Wish I had taken a picture! I had a Groupon and decided to treat myself and daughter to this place.  We ordered the dinner \"B\" I think it was around 39.00 and there was chicken, shrimp, different beef cuts, sushi, salads, soup, dumpling's food just kept coming! I am glad I didn't get more of the Wagyu. My crazy daughter didn't like it and was cooking it to death (I traded her the flank). My total bill didn't even total 50.00. I love grilling my own food to my doneness and the sauces were great. I took home a lot of leftovers and even had pineapple sorbetto for dessert, Very delicious. For the quantity and quality of food this place is really awesome. It was a little quiet when we went, but we were there right when they opened on a Thursday evening. Personally, I like that. I also like that they didn't hover over us, just unobtrusively removed empty plates and filled our glasses as need be. Wonderful experience.","useful":1,"funny":0,"cool":0},
{"review_id":"m58CEm1OeJkYLjMwBtnDJw","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"fOzVez6UBi9LPIcC8OJFew","stars":5,"date":"2011-12-24","text":"This place is perfect--I love the unique combinations.  The crust is awesome, chewy, not greasy or too thick. It has a great flavor-almost like a sourdough. Finally a crust worth eating. The toppings are super fresh and just the right amounts. Even the sauce is great. The guys that work there were really helpful, and being able to order by the inch as opposed to by the slice or a whole pizza allows you to try more than 1 type (Perfect for those of us who are indecisive) and people who can't power down a whole pie.  They also have a huge gelato selection (I recommend the butter pecan!) and cappuccino. It is hidden in there by Powder and Sun and Massage Nirvana (by Peace\/Ft Apache). Great product, great prices great service--A triple threat and I really hope this one stays around. We really need more than the big 3 (PH, PH, D) to choose from without paying 25 dollars for a small pizza just to avoid a chain","useful":1,"funny":0,"cool":1},
{"review_id":"ZzC_j_Kvxy5rsW8mAFwfng","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"oYPpWHgsjcIt-tUzGXk_eA","stars":5,"date":"2009-08-26","text":"I am so happy I FINALLY found a decent pastrami sandwich.  They give you so much for the price and it was nice and thinly sliced with a fabulous taste.  I also got the garlic-romano fries--WOW!! I also ordered the chicago style dog.  I really like Sabrett hot dogs. They have the best menu--something for everyone, a junk food junkies dream place!!","useful":0,"funny":0,"cool":0},
{"review_id":"p5NMOeI22rPftbSvJ7a1Ow","user_id":"GZI0VPDn2FXvq-SQJckrTg","business_id":"EGzbYCNiLoBuRvJmzqrKxQ","stars":5,"date":"2011-09-15","text":"Found Just Like Home through Groupon and had been looking for a new facility to take my psychotic (but loveable) 4-legged member of my family to play and burn energy. I am pretty much home bound and puppies need interaction and socialization. This place is AWESOME! They have all sorts of different areas with themes for the critters to romp and play or sit and chill. The staff really seem to enjoy being there and the clinic was spotless and smelled wonderful. I wish my home was like this! So much better than just being in on or two areas. Granted my pooch would have fun just going from the driveway to the mailbox. The prices are very reasonable and I really like the fact that I can check in on him via web cam. That is a nice touch. Agana great set up and I know my little Mo can't wait to go back and make some more friend.","useful":2,"funny":0,"cool":2},
{"review_id":"WcFjtxBb-Ym3EyoQesEzWQ","user_id":"pROlNFjOGLbiqQRoBLOQXw","business_id":"kBJfBVaXJtPEKLTov1hJdQ","stars":5,"date":"2015-10-31","text":"Fantastic.  Can't recommend this place enough.  Authentic, yummy, low prices, great service.  I literally want to eat the menu...","useful":0,"funny":0,"cool":0},
{"review_id":"WjIBoIS2YT_pI6dGn1sRaw","user_id":"qQl_cGPXSBUItQ3TYSSJSg","business_id":"JZGObzUxfOsotOkp1pecdQ","stars":5,"date":"2016-04-24","text":"In town for a race, best food I've had in a long time! if you love bacon this is the place for you. If you are a local or on the road definitely make a point to stop in.","useful":0,"funny":0,"cool":0},
{"review_id":"LXAt9UdTi_MifFQDKkVQdw","user_id":"qQl_cGPXSBUItQ3TYSSJSg","business_id":"wQd7pL2NgKiBnVPaPmchIw","stars":1,"date":"2016-04-24","text":"Foods good, bartender great she was very nice, BUT manager was very unprofessional drunk locals were unfriendly and would never recommend joes to anyone travelling. if I could give 0 stars I would","useful":0,"funny":0,"cool":0},
{"review_id":"IsMP-45rKTY7kOp2vnJUcA","user_id":"qQl_cGPXSBUItQ3TYSSJSg","business_id":"71xXUYGd6c3QaYUaLsex3Q","stars":3,"date":"2016-04-25","text":"It was Chinese food that's it. Same food you would get at a mall for lunch ( I've had better mall Chinese)service was prompt and food was hot , but just OK","useful":0,"funny":0,"cool":0},
{"review_id":"0SqOTZS2fBBr7lscV9wmRQ","user_id":"qQl_cGPXSBUItQ3TYSSJSg","business_id":"fA8fCYTt4RdA3HOhmBVihg","stars":4,"date":"2016-04-25","text":"Food was awesome must try the shrimp and grits!!! bartender was great, only complaint food took way to long","useful":0,"funny":0,"cool":0},
{"review_id":"sRAe0zZlliTtZd39h8BbVA","user_id":"IIt2jan-crhYxB42EomuAA","business_id":"887ZV95R-QUkuX9GxaWqaQ","stars":3,"date":"2014-02-15","text":"Just went for valentines day... The service was the best I have ever had but the steak was not. I was a tad disappointed ... I was expecting a steak like at Michael Jordan's restaurant in Chicago as they are both steakhouses but they were def not the same ... The best thing on the menu was the squash casserole ... Sooo good ... But alas the steak was below par and I'd rather have the keg especially for the price ... Price was way to high for the quality you got in my opinion.","useful":1,"funny":0,"cool":0},
{"review_id":"wBNOp88xwzusk4dqKnOaXQ","user_id":"IIt2jan-crhYxB42EomuAA","business_id":"MrmwDgMlL2GtthlAZsJwNQ","stars":5,"date":"2013-11-17","text":"Big fan of this place. I love the decor and the atmosphere. The food is very well priced (under 20 bucks for most dishes) and the food is phenomenal ( I always get roasted chicken and spaghetti ... Also tiramisu was delish!) All in all its one of my fav spots to eat in Mississauga.","useful":0,"funny":0,"cool":0},
{"review_id":"KEP4IInkUp0XYND_gEyyig","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"5iSmZO0SrKU6EoXK_1M8Kw","stars":1,"date":"2011-01-25","text":"Stay away, stay away unless all you care about is price. The rooms are disgusting. The water pressure in the shower nearly took my skin off and the hotel sucks. Seriously someone puked in the elevator and they just left it...gross! It's only redeeming quality is the new section that connects to the tram that takes you too the tram and the new resort Aria. \n\nUgh...never again.","useful":1,"funny":0,"cool":0},
{"review_id":"bBylgIXW_m9AS1fsP7xUWQ","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"U-zsJM-VN89i3PbaIbKmJw","stars":2,"date":"2011-01-25","text":"I cannot not adequately describe how horrible the service is in the place. I'm not picky but DAMN. Expensive to boot. Why bother.","useful":1,"funny":1,"cool":1},
{"review_id":"XVLn4GvmvgK3UCi9jR6wTw","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"na4Th5DrNauOv-c43QQFvA","stars":4,"date":"2011-01-25","text":"What can you say? It's the Bellagio. Beautiful hotel that stands the test of time. Loved their Christmas display. The only reason I knock off 1 star is for the air system in the casino. Other hotels have figured out how to quickly change the air in the room from all the awful smokers, but not the Bellagio. If you don't know what I'm talking about go stand int eh new Cosmo casino and smell and feel the difference...the fresh air actually blows through the room...awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"kMQUGXGQx2vCPHH5sd2GUg","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"bk4FIHt8ODRBPfqL4Fd2aQ","stars":2,"date":"2010-06-08","text":"Started out well, parmasean potato chips were yummy. The it went down hill fast. Fries and onion straws were luke warm and laden with grease. Burgers are definitely frozen and not fresh. Concept is cute but quality is poor. Save your money.","useful":1,"funny":0,"cool":0},
{"review_id":"3b4WSd2jR7mQFkMTApmEnw","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"mhODWs2r9xApNhx0Yfbqcg","stars":1,"date":"2010-06-08","text":"Went here for a weekend getaway. Deal was too good resort credit equal to the room rate.....good right....well not so much. \n\nArrival- very dated facilities I'd say circa 1980. Key card didn't open door back to lobby we go. 1st room right next to main stairwell and elevator with kids running up and down it....new room please.\n\nSecond room....burn holes in the carpet, bathroom was in a word gross.\n\nOther comments....one pool...that's it. One tiny pool for everyone at the resort.\n\nCalled the front desk said we'd like to cancel our reservation as the resort does not meet our expectations. Thank God they did because I was prepared for a fight. \n\nIf I could give this palce 0 starts I would. Old and disgusting.","useful":0,"funny":0,"cool":0},
{"review_id":"ESOe1_rw7UWVAUPXgpJ-Mg","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"Ycn-l-X6joxbVQzgxjXpRQ","stars":4,"date":"2010-06-08","text":"First let me say, we ended up here after leaving another resort that did not meet our expectations. One step inside the front doors of this place and you know it's going to be a wonderful stay. All I have to say is you get what you pay for. \n\nResort has absolutely stunning grounds and 10 pools! How can you not love that. Very nice Adult only pool with bar and grotto. \n\nThe other pools with kids were still very nice and I found all of the kids to be well behaved. There were not tons of them as this is mostly an adult place anyway. \n\nDid I mention the grounds were stunning...we paid for a room with a garden view and it was worth it. I just loved sitting on our balcony taking in the view. Only weird part is that you share a balcony with the room next door which I did not like and proved to be a problem later on. \n\nAte at SWB, food was good, prices were in line with resort fare I guess. Enjoyed the martinis at Cafe Due. Didn't have a chance to try Alto, though I hear it's out of this world. \n\nLive music was wonderful, I really enjoyed the Falmenco on Saturday night. \n\nStaff was always very polite, although poolside service is incredibly slow and the drinks are not that strong. For $9 solo cup pina colada I'd like a little rum please....I'm just saying. \n\nBack to the balcony issue. Our neighbors decide to have a large get together with their patio door open....this meant I could hear everything...I'd had fantasies about smothering the loud cackling woman who was keeping me awake with a pillow. By 1:15 am I had had enough and had to call the front desk. \n\nThey said they had a \"no tolerance\" policy and would send security up. 30 minutes later no relief and no security in sight...I think I just finally passed out. \n\nThe only other downside were the beds. Very uncomfortable and had a spring in my back all night. For the life of me I don't understand why hotels have to be this way. You pay a high price, you offer 5-star dining, you have the word \"resort\" in your name..lets find a way to put in comfortable matresses....mkay? \n\nWould have given them 5-stars if not for the issues listed above.","useful":1,"funny":1,"cool":0},
{"review_id":"1IkAfWuQ7Wrq0EYjThVkxQ","user_id":"T9SEH0Uupl_2ERy3wYuntA","business_id":"yZAGhlsrmupLbrgdKm6reg","stars":5,"date":"2010-06-08","text":"I'm from Chicago and a friend recommended this place. In a word WOW. \n\nWe made reservations so had no problem being seated. Christine our waitress was incredibly attentive, and knowledgeable and suggested items due to my food allergies. \n\nI loved all the memorabilia, felt like I was back home the minute I walked through the door. \n\nBoth my friend and I had steaks. We agreed it was probably the best steak we've had in a long time. Cooked to perfection everything from beginning to end was delicious. Portions are large and I could not finish my meal. \n\nI will definitely be back next time I'm in Scottsdale.","useful":0,"funny":0,"cool":0},
{"review_id":"oqfg-BBea86I61kqP-CJIA","user_id":"zJTEY5EjAt7Zfnl3Pmvzpw","business_id":"OCwVdrklCtV7xTDplgm-GA","stars":1,"date":"2016-04-04","text":"He asked me what was wrong and I told him I thought the garbage disposal in the kitchen was bad and word replace it with a $500 garbage disposal without even checking to see if the old one was no good .Charged me $ 45.00 . Got a second estimate on the garbage disposal and ended up not even needing a new disposal","useful":2,"funny":0,"cool":0},
{"review_id":"ZHzNaDRIFC4Drzdx5ooFqw","user_id":"zJTEY5EjAt7Zfnl3Pmvzpw","business_id":"0DD-SXcNL07Rh5DA0OAtkg","stars":4,"date":"2016-02-03","text":"For $5 he can't go wrong . The  sushi itself is worth the $5. I almost feel guilty so I usually order a pop .","useful":0,"funny":0,"cool":0},
{"review_id":"G-OAJctJ6b2OhuLIp-UgqA","user_id":"26Ln3d3LenrDbxwcYWUNtA","business_id":"I4Nr-MVc26qWr08-S3Q1ow","stars":4,"date":"2013-12-05","text":"We ate here for lunch and had the New York Skyhigh which was $9.50 and easily enough for 2 people.  We enjoyed it - turkey, pastrami and corned beef, cole slaw and Russian Dressing.  We also really\nenjoyed the $2.50 Egg Cream.  A good lunch for a cost less than &15 for 2 people!","useful":0,"funny":0,"cool":0},
{"review_id":"9huSpQN0cyC72CFkCKghvw","user_id":"vjD4ILJwPgIIpXdjFxCxOQ","business_id":"HnZaAYfeHSqnQwUlGwWuBQ","stars":4,"date":"2014-01-19","text":"I just had my first experience at this salon and will definitely be back and soon. I ended up here because it was close towhere i was, it was open and they were willing to fit me in to fix two broken nails at a moments notice even though it was close to their closing time. \nI was impressed with their attention to my comfort, the various staff offered me reading material and beverages at least twice. \nI ended up getting a full gel fill in addition to my repair and they were absolutely open to my request to have colored tips with sparkle overlay and took the time to teach me quite a bit about shellac.\nThe salon was very clean,  relaxed and welcoming. I will be back this week for a pedi and a wax and am happy to drive 20 minutes to do so.","useful":2,"funny":0,"cool":1},
{"review_id":"A5jok6c1GSh-xDVXdf9UFw","user_id":"x4-QNuFHlib3KQ6cSfeDFg","business_id":"JWldS1fDDZzLQkMgBJ4yUA","stars":5,"date":"2015-02-21","text":"We went on a Friday night at the 830 show. They say your going to laugh it's a guarantee and they are so right. I was laughing and had tears in my eyes and so was my mom. Shang was the main performer and he was amazing I recommend it....not for kids though that's for sure","useful":0,"funny":0,"cool":0},
{"review_id":"-OWkcXKp4Kdhz7nNIRDESA","user_id":"x4-QNuFHlib3KQ6cSfeDFg","business_id":"DkYS3arLOhA8si5uUEmHOw","stars":5,"date":"2015-01-11","text":"Absolutely amazing sandwich. If your looking for a quick bite to eat I recommend this place","useful":0,"funny":0,"cool":0},
{"review_id":"8FFwlwnGs0OKw9_oQgMlEA","user_id":"x4-QNuFHlib3KQ6cSfeDFg","business_id":"rTS8LsUmNIiXsXydE49tPA","stars":5,"date":"2015-02-21","text":"We went on a Friday night during happy hour 3-6 let me say it was amazing. We got the 5 o'clock somewhere drink it was amazing for 5 dollars and the lava shrimp for 6 dollars was just great. My mom had the fish tacos and I had the fish sandwich it was amazing We shared the sandwich the tacos. The tacos  I would get in a heartbeat. The sandwich was great as well but I liked the tacos a tad bit better. :)","useful":1,"funny":0,"cool":0},
{"review_id":"8nx8UGDwou12VEIM9eRu8g","user_id":"-PB1JyGrua5ZFUmFBmnQTA","business_id":"i53HvxUdQEMllZ1XmpjjyA","stars":1,"date":"2016-01-04","text":"Absolutely HORRIBLE!! Messed up the order called back to get it fixed and they were RUDE about it... Burnt the pizza and refused to replace it cuz a piece of it was missing... Ordered a geek salad and was given Italian and Caesar dressing!! Will NOT be ordering from them again!! TERRIBLE","useful":3,"funny":2,"cool":1},
{"review_id":"IRlY6OM3Tyfs8g62hV53uQ","user_id":"-PB1JyGrua5ZFUmFBmnQTA","business_id":"Im_fU7Z1cyebxB_G3WeCng","stars":1,"date":"2014-02-10","text":"I don't even think they deserve one star... I had an appointment and still had to wait 20 mins to be taken. When I finally got to the station she started taking my polish off, right in the middle of doing so she got up and left for about 5 mins. I like my nails flaired and that's how they were when I first walked in. She not only rushed while she was doing my nails but she did a horrible job!! My nails were not smooth, not flaired and I even showed her a picture of the design I wanted and it came out nothing like I wanted!! My heart's looked like drops of nail polish on my nails. Not mentioned when I paid it was a ridiculous amount of money for a fill, almost $40. I was EXTREMELY unhappy with how my nails looked. When asked why it was so expensive, I was told because of my design. My friend who went with me had way more details and rhinestones on her nails and paid less!! The following day I went to Highland nails and had them completely redo my nails!! I was EXTREMELY happy when I left!! Pink Lotus lost a customer who gets their nails done regularly to Highland!! I will NEVER go back or recommended to anyone!! You want excellent customer service, friendly staff, people who listen to how you want your nails done and not pay an arm an a leg... So to HIGHLAND NAILS ON RAINBOW AND WINDMILL INSIDE THE SMITH'S SHOPPING CENTER!!","useful":1,"funny":0,"cool":0},
{"review_id":"scInw9xaANKv8ACDdcVurw","user_id":"-PB1JyGrua5ZFUmFBmnQTA","business_id":"S17AXcOslfQqM18VsOiDIQ","stars":5,"date":"2014-02-10","text":"A customer at my work recommended that I go to Highand Nails after I told and showed her how unhappy I was with how they looked. So I decided to give them a try and I am glad I did!!! The day before I had gone to Pink Lotus and was completely unhappy with how my nails were. I walked in and was immediately greeted, was asked what I needed done. I told them I had a nail emergency and I really needed their help. The guy laughed and asked to see my nails. I showed him a picture of how they were suppose to look and he told me to pick my polish and he would help me. I picked my color and sat down. He started on my nails right away. He asked if he could take a picture to use as an example of how nails should not look and I told him that would be fine. He mentioned how they weren't even smooth and I said I know. He fixed my nails and made them smooth and the shape I like them. I was very impressed!! I will definitely be going back from now on and I would recommend this place to everyone!! Excellent customer service and amazing staff!!!","useful":2,"funny":0,"cool":2},
{"review_id":"Yt4mIWpzELCH4jodIcqINA","user_id":"R-U0I6Rx-R62F0hXcdYjAA","business_id":"ugLqbAvBdRDc-gS4hpslXw","stars":5,"date":"2010-08-27","text":"I contemplated punching my sister out when we rolled up to Yama, which looks like a run of the mill sushi joint placed in a nondescript shopping center off the beaten track of the Strip. She's a NYC transplant so I trusted her judgment of good, quality sushi but I was a little apprehensive when we drove up and saw degenerate\/hobo looking types wearing cowboy hats and smoking cigarettes, standing outside of Sally's (or something or other) gaming spot, next to Yama. She swore it was delicious and convinced me to ignore everything else from the outside. The area is a little run down but don't be fooled, Yama is a total gem. The sushi is...just...so freakin' good! Super attentive waitstaff who are constantly running around to see what you need. Loved the salaciously named rolls like \"One minute man\" or \"Sex on the beach\" - so Vegas! My personal favorite is the Firecracker. I must admit, many rolls are slathered in sauces but that's how I like it. And, how on earth do you beat $23.99 for all you can eat sushi??!! Total yum. And rumor has it, Yama purchases their fish from the same wholesalers that Strip sushi restaurants use, and Yama is a fraction of what you would pay elsewhere. If you're in Vegas, and you love sushi, you must go (just ignore the cheesy, mismatched décor!).","useful":0,"funny":0,"cool":0},
{"review_id":"1hd4UPsmHoTNXMHmT0A_AA","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"fPIA5EBTFDSvdasd6UCiTg","stars":1,"date":"2012-02-27","text":"While I know this applies to all stores and not just this one it's worth pointing out that the prices listed on Books-A-Million's own website are NOT the same as the prices in store and they will NOT price match their own website or other websites either. A book I recently went in to purchase was a whopping $25 more in store ($59 instead of $39). One of the empolyees bluntly informed me this was to help fund her paycheck. Sorry, I'll be helping someone at Amazon out with their paycheck instead.","useful":1,"funny":1,"cool":0},
{"review_id":"bOkfEuxyY2YvYC3nXbmhCg","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"sPwgafejYVdf8hd4-oDYVg","stars":5,"date":"2012-02-27","text":"By far my favorite wing place. Don't let the strip mall exterior turn you off. This place has amazing wings at a decent price. Try the Hoisin Honey, my personal favorite!","useful":0,"funny":0,"cool":0},
{"review_id":"9yergiNCf5J5CWSKcj_AOw","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"SyXQdbGIMtNx4ux4VfKyaw","stars":5,"date":"2014-09-24","text":"Had a water leak in my yard repaired on 7\/12\/14. I'll admit that I'm the type that's skeptical of using smaller shops. The big guys have to be better right? That's why they're the big guys. In this case I'm glad I went against that thinking. Service was quick, friendly, and I felt the price for the job was fair. Hopefully I won't need them again but if I do they're getting my business.","useful":1,"funny":0,"cool":0},
{"review_id":"yVL6PGSpK-i1Jx7tv7FbUQ","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"H71dQF--xtfPyIwNQMw5pQ","stars":5,"date":"2011-08-14","text":"The food was great and I loved the ordering process where you check off what you want on the bag your sandwich will be in. There was a huge sandwich selection too!","useful":3,"funny":0,"cool":0},
{"review_id":"8_spc0CODqJcNfdx04O89g","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"pzy9xWQqsDxVU6j9MktRJg","stars":4,"date":"2011-02-20","text":"Great little Mexican place. Nothing super fancy but for the money you can't go wrong.","useful":0,"funny":0,"cool":0},
{"review_id":"-tQTP_BuZv78GroSuYY8zw","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"huTkwb90PQw4HqGkbhz74Q","stars":5,"date":"2015-04-15","text":"Went in because I was neglected my teeth for years and they were in rough shape. I decided it was time for a change as I've recently made my health a priority. I was worried about the cost and was preparing for sticker shock. Not the case. A simple cleaning was recommended and a plan to help get my gums treated laid out. Long term cosmetic options were a distant third. I really felt like health was give the priority which made me feel great. The staff was great and my teeth came out looking million times better already. It was a refreshing surprise. I look forward to further treatments (the massage chair should be a requirement for all doctors) and improving my smile even more.","useful":6,"funny":0,"cool":1},
{"review_id":"J21lSgRX_ZBA5Q7INZgA0w","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"Y6F9a6Rv_4nhDIZ2VfQFrg","stars":2,"date":"2011-04-03","text":"Not bad but I'd take a bulletproof vest if you go on a Friday or Saturday night. Super duper ghetto!","useful":3,"funny":1,"cool":0},
{"review_id":"nieMawZeVRHLZLSyqoKECQ","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"n5wZxYrle8ROuK-Saq-yyw","stars":3,"date":"2011-04-03","text":"Pretty good pizza! A little pricey but you get a decent amount for the money. Other people have mentioned Jet's and for whatever reason I prefer it's pizzas (the smaller square ones) to Luisa's.","useful":1,"funny":0,"cool":1},
{"review_id":"Q84Ul719JA7uv60_xlkjqg","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"7rh29SPJMkyeI2BJcjqzLQ","stars":4,"date":"2010-12-13","text":"Good, fast, simple Chinese food. Nothing fancy but really good for what it was. Service was quick and the staff was friendly.","useful":1,"funny":0,"cool":0},
{"review_id":"KL486J20T7DXzMXCuviZdg","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"1Geg7R5ACFL0oassVziNiQ","stars":4,"date":"2013-10-23","text":"Got a tasty several cheese (3 maybe?) crepe. Will definitely be going back for a sweet one sometime. Service was good and pretty quick. Worth the price of admission in my book, especially considering the prices were relatively cheap.","useful":0,"funny":0,"cool":0},
{"review_id":"fYB3w4Ia7EOcnJJxDUdGJQ","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"WNad3tggpPxD5JziPU-zEw","stars":3,"date":"2011-04-03","text":"Good enough place to get comfort food. Nothing special but gets the job done.","useful":0,"funny":0,"cool":0},
{"review_id":"YwiEOC5FNZIWITMHgegCYw","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"QFqtVX-lyZQgVHQrG-dhlg","stars":4,"date":"2011-04-03","text":"Service was great and so was the food. Unfortunately several dishes were sold out already and it was still relatively early. I would definately revisit.","useful":0,"funny":0,"cool":0},
{"review_id":"IahF8KnF0EXBv8dH7MHHeA","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"8PNXDkWz3hyZFi7E4tYhjw","stars":3,"date":"2011-04-03","text":"A little bit above the quality of your average greasy Chinese place. Good for both take-out and eating in.","useful":0,"funny":0,"cool":0},
{"review_id":"jSjTfhfxxmkF9XCWMKS-bw","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"0E0QKR3dAmL0hnotqrimHw","stars":1,"date":"2016-08-25","text":"Same day store pick-up within 45 minutes (unless it takes 3+ hours like my order today). I placed an order online which Best Buy gladly collected money for (visible charge on PayPal). I received an email stating if the item is in stock my order could be ready to pick-up in as a little as 45 minutes. 90 minutes later no confirmation.\n\nUpon calling the store I was notified the see my order but it can't be picked up. The item was in stock but hadn't processed. What's the barrier to get that to happen? No one in the store could say. One employee did try to call their help desk. Another I spoke with lied and said they had no help desk. The apparent solution? Cancel my online order (leaving a pending charge until it drops off of course) and just buy the item in store. No-one could logically explain how that's easier than giving me the item I already, ya know, bought.\n\nThe online support team seemed mildly more helpful. Supposedly sending out emails to push the order (though in store upon pickup I was told the online rep didn't actually do anything but rather just waited for the order to progress). Three hours later the order finally goes through. This wouldn't be all together bad if the website and emails sent by Best Buy don't trumpet a 45 turn around. Even the hold music breaks say how easy doing store pick-up should be. So why isn't it? And why give a turn around time well below the actual time?\n\nGetting a hold of higher up managers to ask this question is apparently difficult also. I asked to speak to a GM but they couldn't guarantee I'd be able to. I was also told speaking with the district manager would be unlikely. Corporate contact? Definitely not. \n\nIn short. This is why Amazon exists and why it will hopefully one day replace Best Buy completely. Immediacy is the only reason to go into brick and mortar like Best Buy. Store pick-up is an attempt to provide the immediacy of going into a store with the simplicity of online shopping. Bottom line. Best Buy does not deliver on it's promise of this.","useful":1,"funny":0,"cool":0},
{"review_id":"mWUOIvNzI7mzg1nAwnLCFw","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"ASC3JV2Jh09lTyJZ98UMFA","stars":5,"date":"2015-12-06","text":"I've been several times and have not been disappointed yet. The food is typical tex mex but really good! I typically get one of the crazy big burritos and my wife gets one of the chicken dishes (Aroz Something or other I'd butcher spelling).","useful":0,"funny":0,"cool":0},
{"review_id":"oHky5wqIWC0sHaEVQTqvDA","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"h6f3QbR0n0fpS2Tu9MJJTw","stars":5,"date":"2013-11-20","text":"Visited just tonight based off the rating. Definitely delivered. I had one of the vermicelli salads and my fiance had the pineapple fried rice. Both were full of flavor and came in a pretty decent sized portion. The rest of the menu looked interesting also and I look forward to going back.","useful":0,"funny":0,"cool":0},
{"review_id":"TtJcHB9aSdkgvkS-y3nCQQ","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"YAJzBGvqT3dT_qAg6u8E1A","stars":5,"date":"2010-04-28","text":"Great food and some really good beer specials are the highlight for me. Mystery beer night is my favorite!","useful":3,"funny":1,"cool":2},
{"review_id":"YcVIAW6hzF2ycsNdBAToLg","user_id":"g_gasrzH_1-On-MbIdeqpw","business_id":"hd4DGQ3rZkg2lzw4x4D-5A","stars":3,"date":"2011-08-14","text":"Hey, it's a bar. The food is good enough but nothing special. The service was good when I went. The highlight for me was the upstairs patio.","useful":0,"funny":0,"cool":0},
{"review_id":"ZM8F1oI_NNf0c9XbP9Hs6A","user_id":"9vcRZj3w6qZcIiQ2vqGVEg","business_id":"CjCVFZurydHXPAM2Zu8NzA","stars":2,"date":"2016-08-20","text":"So this review is about Domino's customer service in genefal. I ordered a pizza from the foster ave domino's a little over a month ago . Now it isn't a huge deal but they forgot to put one of the toppings on the pizza. Hey, I paid for the 3rd topping so I wax a little annoyed.\n\nYes it was the workers at this dominos who forgot,  but I'll give them props that customer service was good when I came to get the pizza, the young lady at the front was friendly , gave me extra red peppers etc..\nMy bigger pet peeve goes out to dominos customer service I emailed about the issue and their reply was basically sorry stuff happens , we will reach out to the owner. I emailed again offering to show a copy of the receipt and perhaps some sort of reimbursement, I wasn't expecting full.monet back on the pizza.no Rey ever. I tweeted them, no reply. I left a fb message for them, they relied they would look into it but they never emailed back.\nSo I hate to say do the eat at this dominos , it seems u just. They made a silly mistake missing a topping. Some sort of response from corporate to a comsumer more than hey stuff happens would've been appreciated. These stars reflect my overall opinion on dominos.","useful":0,"funny":0,"cool":0},
{"review_id":"rGDd46dDa3UsQjjHepuxug","user_id":"i8q91P4lS8KzoB3AXIPqtg","business_id":"kP2wC0luve3mT5fcdrA3nQ","stars":5,"date":"2015-03-24","text":"Love this place!!! Food is delicious and service is great!!! I wish it was closer...will continue to go every chance I get!!!","useful":0,"funny":0,"cool":0},
{"review_id":"3K8RXCtABtIc4Z5cQRhBGQ","user_id":"i8q91P4lS8KzoB3AXIPqtg","business_id":"V_jxQeTY-HU0KnSp2zmHtQ","stars":1,"date":"2015-11-07","text":"Gross there was a hair in our fries! Grossed us out couldn't finish our food but they still made us pay minus the fries. I think the whole meal should have been free!","useful":0,"funny":0,"cool":0},
{"review_id":"y2IDkh3bSYVGMqw0RT4orQ","user_id":"VDGMV7aLaUm3dGlv3tKnBg","business_id":"HkPnai4LMRjAYZkZ2AQLkA","stars":5,"date":"2017-07-25","text":"Amazing Coffee, great beer selection, good atmosphere and I love the fact that they turn into a bar in the evening!","useful":1,"funny":0,"cool":0},
{"review_id":"nxou6m1se0xtqxFXUGiVrg","user_id":"h0SMOdLlPDAQzOvoLBzVPw","business_id":"oiECslITYxrRlhz_CtNBCw","stars":1,"date":"2014-06-26","text":"This turd sure is shiny with its fancy location and excellent selection of bikes, but my advice would be to just window shop and buy elsewhere. Spent lots of money on a new bike. Incompetent fitting. Jerks on the phone. I would not go here again. Go to Erik's. Or anyplace else. \n\nNever again.","useful":6,"funny":2,"cool":1},
{"review_id":"klLiZEiU6BOIfwvKvMwIpw","user_id":"SyOXZyJf7u4MW1eY7Rj8mg","business_id":"p_IB-mepGK6xMZBC-20mZw","stars":5,"date":"2017-03-01","text":"Was in town for a few meetings and had some idle time on my hands. Since I am not a gambler, decided this would be a good opportunity to get a haircut. Found this place on Yelp and I couldn't be happier. \nWonderful service. Billie spent 45min with me and I have gotten the best cut of my life at a fraction of the cost of a cut back on NYC. \nI was blown away at the service, the cut and the other friendly staff. \nWas a $12 lyft ride to get there from the strip, but 100% worth it! \nThank you","useful":0,"funny":0,"cool":0},
{"review_id":"RyYNvQ1zKBNkRcbP_cjHbg","user_id":"FWA26kOvKpspo3l8W81tTw","business_id":"M-ajUawvXeHSqpeM_2UDOg","stars":1,"date":"2015-05-29","text":"Returned my car rental on 5\/6\/15 at 2:21pm.  Was rushed to make my flight and I left a bag with a pair of Nike shoes and two pairs of socks in the back seat.  Was unable to return back for the bag.  Followed the instructions and filed my claim.  There were two female workers who checked me in for the return of the car and poor customer service from Alamo on providing me updates.  I have been emailing them and last email received on 5\/24\/15 that nothing has been brought to lost & found.  The bag contained the receipt.  Dishonest workers at Alamo Car Rental at the Phoenix Sky Harbor Airport and would not rent from them again and recommend you rent from another agency.  Per their Manager, Sandra, they have camera systems at every location of their cars, from when its returned, cleaned, and put back in service and they did not find a large gray Nike bag with a pair of shoes in any of the so called camera system.  Shame on the workers and I would not recommend renting from Alamo at the Phoenix Sky Harbor Airport.","useful":0,"funny":0,"cool":0},
{"review_id":"xFnKgQuu2xw5gz-JuV3JuA","user_id":"PkZcF10Nqrqo74w9NWQFEg","business_id":"Em0MDcxhSYZm7JVpR6WyJA","stars":3,"date":"2007-04-29","text":"The drive over to Bonnie Springs from the west side of Vegas is super quick. My husband, son and I got there in no time. Twenty bucks for all of us to get in seemed pretty reasonable, and we thought we would use the ten dollar voucher for the restaurant that you get upon entry.\n\nI know lots of people have given this place positive reviews across the internet, but there are some down sides to Bonnie Springs. My husband and I took our one year old to see the petting zoo, and we tried to take the stroller in, but it was VERY hard to maneuver over the gravel that was in the old west town. There are numerous wooden stairs everywhere as well. If you are in a wheelchair, be warned, this is a very non-handicapped-accessible location. I wouldn't bother.\n\nThey don't have many signs telling you exactly where the petting zoo is. You kind of have to wander around until you find the actual \"petting\" part. In actuality, there are very few animals loose to pet. At least when we went there was one goat, and a few very sleepy deer that were tolerant. The rest of the animals were behind cages (for safety sake, of course). All the animals seemed fairly well taken care of. There were a few cases where I question the animal's health, but nothing drastic.\n\nWe cut our losses and didn't try the restaurant. Since it's so close to Vegas, it was more appetizing to go back into town and grab something there. We didn't make the effort to see any of the wild west performances, either. It was hot and baby was tired.\n\nI would say that overall we had a good time. I'm glad we gave the place a chance and checked it out. The animals did make my son smile, and there was a lot to look at, but I can't see going back any time soon.","useful":2,"funny":1,"cool":0},
{"review_id":"HwoP1r8e6Lq4bqtJ5FFrsA","user_id":"PkZcF10Nqrqo74w9NWQFEg","business_id":"piPwB7EvylrVnPZLcwrdNg","stars":4,"date":"2007-04-29","text":"I've had take out from Jasmine about four or five times now, tried something different each time, and everything has been delicious. My husband has always been the one to pick up the food and says that each time he goes in they give him something more to snack on while he waits for the order. They always seem very friendly, too.\n\nThe price is nice and cheap depending on what you order. My ONLY complaint about Jasmine is that they need more items on their menu. A place this good needs more variety to choose from.","useful":0,"funny":0,"cool":0},
{"review_id":"5Jsob9tFb6sQjJOf9YPwWQ","user_id":"PkZcF10Nqrqo74w9NWQFEg","business_id":"3Fr9RZ8Hfz1iWk51C2RMWg","stars":2,"date":"2007-06-18","text":"I'm sad to have to give this place a low rating, because the pizza smelled really good. We got a 16 in. Boston Garden Pizza and garlic knots. The pizza was, well, average at best. Nothing special, though.\n\nThe garlic knots are what brought my whole opinion of the place down. They didn't look fresh. They didn't taste fresh. The one I ate was chewy in a bad way... just not appetizing at all. (Especially for an appetizer. Hehe! Yeah, that was bad.)\n\nAnyway, what I had was definitely not 25 dollars worth of pizza.","useful":0,"funny":0,"cool":0},
{"review_id":"FZrp7Cmi_HFc8ZdDvy6cXg","user_id":"PkZcF10Nqrqo74w9NWQFEg","business_id":"hubbaEcYPYEZu5Ziz6i0lw","stars":5,"date":"2007-06-27","text":"The food was awesome. Do I really need to say more than that?\n\nOK, so since my family is all about take-out lately, I can't review the restaurant's atmosphere, or wait service, but strictly reviewing the food it was a little plate of heaven. Well, make that a big plate.\n\nI ordered the Chicken Sag and Spinach Nan (Yeah, I'm a big spinach fan). The Sag had the wonderfully creamy, soothing taste I was hoping for. That dish is my comfort food. The Nan was freshly baked and piping hot. My husband had the Lamb Vindaloo and Aloo Paratha. The Aloo was slightly underseasoned for me, and my husband always orders things \"hot,\" so the Vindaloo was good, but too pungent for my taste. Not for the faint of heart. The flavor was right on, though.\n\nAll the food had the complex and earthy Indian spice combination that I've never been able to recreate at home, but love so much. I'm so jazzed about this place. They're a little out of the way. I would have driven right by them if I hadn't known that they're set back off of the road behind another business (sorry can't recall which one). If you like Indian cuisine definitely go give Mantra Masala a try. Let's keep these guys in business!","useful":0,"funny":0,"cool":0},
{"review_id":"ZimIx4xVHrFRttvGcAeSlw","user_id":"15MO_rIqaAhLKgJAnhu06Q","business_id":"DtzDpAflD41-rI6njywacw","stars":1,"date":"2017-04-21","text":"We ordered wings here through uberEATS. Onion rings were burnt. We ordered 1\/2 pound of sweet and spicy Thai wings and 1\/2 pound of Forty Creek Whiskey wings. They were terrible. Scrawny wings with barely any meat that were completely burnt. Barely any sauce. Immensely disappointing. \n\nWhen we tried calling the location they took no accountability saying they were unable to help as we ordered through uberEATS. Like they had no clue how to find the order. Even though we could provide them with the time the order was placed, the order number and the ITEMS ordered. I've lodged a complaint with uberEATS as well, but the terrible quality comes from this location. We will never order wings from here again. Don't waste your money here.","useful":0,"funny":0,"cool":0},
{"review_id":"wr2aqRr8XN45MRfb8nS49g","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"8KSbT4Qi8Mvtp86Igl_ENg","stars":1,"date":"2011-05-16","text":"Insider scoop: 1 star\n...DO NOT buy your meat from this place!!\nThere's really only one thing to say about this grocery store - do not shop here!!!","useful":1,"funny":1,"cool":0},
{"review_id":"KndDsds46vmPxwXrbB6y7g","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"Ye2WDL6sA66605igAbKGFg","stars":3,"date":"2011-04-18","text":"The overview indicates \"Reservations: Yes\", however, when I phoned ahead and specifically asked if I could make a reservation I was advised that they do not make reservations... So, that being said, it should be changed to \"No\".\n\nI think I had too high of an expectation when I entered this establishment.  The interior was a tad small, but my date and I had no problem being seating within 30 seconds.  My only issue was the tables were not spaced far enough, or they had too many tables.  While being shown to our seats, even the host had to squeeze through tight quarters from other tables and servers.  The lighting was dim, the decor was dark, and it had a very nice ambiance - just how I like it! (dim and dark is a \"thumbs-up\")\n\nThe wine list was nice, as I had tried a few of them at other restaurants.  Though a little on the pricier side, still a nice selection.  I chose from the vino rosso, since i only drink reds.  I picked the Australian Tik Tok Merlot - a nice full bodied red that went well with our meal... veal.\n\nWe decided to skip the antipasti and go straight to the main - I had the VITELLO ALLA NIZZARDA and my date had the VITELLO PARMIAGANA.\nMy meal was very tasty!  3 veal scaloppini's in a red wine sauce, with a nice medley of veggies on the side along with roasted potato's.  My veal also came with an assortment of sliced sauteed mushrooms which were full of flavor from the wine sauce.  I didn't eat the potato's, nor can I give a review on the taste of them, since I don't eat potato's.  My dates meal was a lot more delicious than mine!  The veal-parm was almost the size of half the plate; The pasta was cooked to a perfect al dente; And the tomato sauce was nice and zesty!  Her meal definitely trumped mine!\n\nWe ended our meal with cappuccino's - always a nice finisher!\n\nThe waiter was friendly, and although some people will give minuses to staff for not coming so often to check on them, I felt he came by just the right amount of times.  He didn't pester us nor did he neglect us.\n\nI recommend this restaurant, and will re-attend for sure.","useful":4,"funny":0,"cool":1},
{"review_id":"ozcC8xyciGxNL_zfscb9UA","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"9Boahjn3QxlZnP2Aw_V1Rg","stars":5,"date":"2011-05-16","text":"I was pleasantly surprised with my overall experience at Sotto Sotto.  \nThe experience started as such: made 9:45pm reservations, but i was not seated until after 10pm.  I was less than annoyed at that but I did not let it get to me.  The place appears small from the outside, but it is certainly not very small on the inside... and rammed! \nMy date and I started out with bruschetta which was fantastic. I ordered the Valpolicella to drink. For the mains, I had the Vitella Della Nonna (Veal with eggplant).  Everything about this main was to die for!  My date ordered Pollo in Carrozza (Chicken topped with prosciutto and mozza).  To me this tasted a bit bland, but the date really liked it.  We opted for dessert - Foresta Nera.  O. M. G.  Can't go wrong with chocolate and raspberry!","useful":2,"funny":1,"cool":0},
{"review_id":"WT17gYh4Uco4-ic8VHy9Yw","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"S5bNE4Pmin8OQUMOFod8bQ","stars":5,"date":"2011-02-22","text":"Had an overall great experience here.  I was even surprised that they were able to cater to my gluten allergy with a spelt pasta option.\nWould defintely consider going back here!","useful":1,"funny":0,"cool":0},
{"review_id":"nvATU9OxyIth_RB81kcUAw","user_id":"8EB12cOJ7Lpt7Q_qXtChRg","business_id":"LI2gZ017EM3_5gy8Z1QR9w","stars":5,"date":"2011-12-06","text":"Great restaurant!\n\nThe menu seemed to be a mix of italian and french foods.\n\nWe each started with a glass of Pinot Grigio and the fig, prosciutto, goat cheese tapas to share.  The presentation was very nice.  There were 3 morsels on a bed of arugula and balsamic glaze.  The taste was amazing!  A combination of sweet, salty, creamy, and zesty.  I would definitely recommend this appetizer.\n\nFor our mains, my girlfriend had the cornish hen wrapped in prosciutto with vegetables and garlic mash.  Again, it did not fail the tastometer!  It was fantastic and cooked perfectly.  It was a tad salty, but that's because the prosciutto infused into the hen.\nI was in the mood for a pasta since I rarely eat pasta, so I ordered the seafood linguini in a white wine sauce.  It was okay.  It had lots of variety of seafood - calamari, octopus, cozze, shrimp, I think it had some fish in there too.  The sauce had a nice light flavour too, not too overbearing.\n\nWe chose not to order a dessert, as we were both stuffed.\n\nThere was a pleasant ambiance and the decor was nice too.\n\nOverall, we were very satisfied with Sorrel.\n\n5 out of 5","useful":1,"funny":0,"cool":1}]