[{"review_id":"W_sbnKfvzxlgNNqqg93Orw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"E0TK141YMBP0LBknhVKEqw","stars":3,"date":"2013-01-27","text":"Seriously? This restaurant has 4 crepe options on the menu for dinner.  Totally disappointed. The spinach and mushroom crepe was delicious but it was the only vegetarian option.  Call me crazy, but with a name like \"Crepe Cellar\" I imagined several options...\n\nThe tap beers are a sampling of the UK... Which is great but the best local brews are a block away.\n\nThe atmosphere is nice.  We sat at the bar.  My hubs had the fish and chips, which he enjoyed.  We skipped dessert.  MIght be a better option for brunch?","useful":3,"funny":0,"cool":0},
{"review_id":"UEoac96rKNfVM0_UKUQGqg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"09hXjMwfHxWpiOqYj08zwQ","stars":4,"date":"2012-08-18","text":"My 5 year old attended art camp here with a friend.  It was a 3 hour camp and when I realized it was only 4 days instead of 5, the value of this camp sharply decreased... oh!  but wait a minute... they released a coupon for pay for one child and the second goes free!  Score!  This only worked for me because I had not paid for our session yet.  Had I already paid, this deal would not have applied.  Imagine how disappointed my responsible, early-paying friend was when she realized the offer was not available to her!\n\nThe camp itself was well run and organized.  The art work was adorable.  My daughter had a great time and did not get too messy!  They also gave them fun snacks.\n\nThe camp is advertised for up to age 10 but my \"free\" 10 year old only went twice as it is really geared toward the younger children.","useful":1,"funny":1,"cool":1},
{"review_id":"SlHJXZTUERz2vFh543KicA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"idU2ytgY25a2TCVFyXZgjg","stars":4,"date":"2013-07-27","text":"I love a lot of things and live music is at the top of my list.  This venue has a great old school place feel and is a fun place to take in a show.  It appeared to be cement from floors to ceiling, with two different stages- one for a bigger show and one for a smaller crowd. (It is definitely not the Belk Theatre but I cut my teeth at the Milestone, so a grungy-ish venue is fun for me). There were pool table(s), a few booths and bar tables near the bar, and a great outdoor area with seating and fun, colorful lights.  The bartenders were friendly and they have a great selection of beer on tap-- and the beer is reasonably priced!  They also have a full bar... but with some good local beers on tap, why not support our budding QC brewery market?\n\nThe accousitcs were fine.  But, I enjoyed the Prince concert at TWC which received awful reviews for accoustics... \n\nI am jazzed about another great venue from which I can get my music fix!  Psychedelic Furs, anyone?","useful":4,"funny":2,"cool":4},
{"review_id":"FadohB_xUDDuhNRHPiSWYQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"JsUytp_MuZ4AX5JWfi2eLw","stars":4,"date":"2012-09-08","text":"Target at Midtown is a fantastic shopping experience, especially if you happen to have Val as your cashier.  She is a smack-talking hoot!\n\nSeriously, with parking that protects you from rain and all aisles usually open, how can you not love this Target?  \n\nDon't get me wrong, I am all about shopping local, but with 3 children that need a dump truck load of back-to-school supplies, Target is my choice.  And, seriously, where else can you pick up a cute top, scarf and set of sheets, while simultaneously loading up a cart with colored pencils, paper, and notebooks?  (And their junior dept. clothes, while tricky to find smaller sizes, are hard to distinguish from pricier brands... a huge bonus to this mother of a middle schooler).","useful":0,"funny":0,"cool":0},
{"review_id":"_1VmRHWm9gs0-N6TLlDPBA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"ewSh93zoRx0DIWRKU-fFwQ","stars":5,"date":"2012-08-18","text":"I am not a 5-star person.  I think everyone\/everything has room for improvement.  But, Fenwick's?  They are spot-on, delicious every time.  \n\nThis is owned and operated by Catherine, of Catherine's on Providence for any old-time Charlottean.  She is a superb chef!  Her culinary and wine skills are some of the best in Charlotte.\n\nThis is not fine dining.  It is not fancy.  In fact, it is quirky and small and you often feel a little close to your dining neighbor.  \n\nMust try:  Tomato Bisque Soup, it comes as a side option with their meals.  My hubbie says these are the best burgers in Charlotte... I am a veggie, and I beleive their grilled veggie burger is the best in town.  Their fries are great.  Sweet potato fries?  Delicious!  Tuna salad, with  melt-in-your-mouth croutons and an array of homemade dressings to choose from?  Pure yumminess.  My husband also adores the club sandwich.  Oh, and the muffins.  Delectable!\n\nAs creatures of habit, my order is always the same: Veggie burger, with cheese, side of soup and fruit.  And this is a 5-star meal delivered with 5-star service.  \n\nSit at the bar and get to know your neighbors!\n\nPretty tight for families with children... I don't bring my younger ones in here.","useful":1,"funny":0,"cool":0},
{"review_id":"8MQ4k_NResZ6H4c8ZS8y_Q","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"7cnz3nRaVuwHLVTTaV5-PA","stars":5,"date":"2012-08-18","text":"Me loves!\n\nThe stir fried wide noodles are perfection!  \n\nThe make your own spring rolls are my favorite... a big plate overflowing with fresh mint, basil, cilantro, noodles, bean sprouts, cucumber, and tofu.  Soak your rice wrap in the hot water, fill with goodness, squirt with siriachi, and dip in sauce.  Delight taste buds.  Repeat. Again and again.\n\nThe atmosphere is nothing to write home about but with authentic food like this, who cares?\n\n--Restroom is yucky, bring sanitizer--\n--My kids love this dining experience--","useful":0,"funny":0,"cool":0},
{"review_id":"2nI2kKeoXlBAdPk6MoBTsA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"KEGLWeFAWXvo0W2LnujhtQ","stars":5,"date":"2012-08-21","text":"This has been a favorite for 13 years or more.  I have tried a lot of the menu items and have never been disappointed, but my favorite remains the make-your-own spring rolls.  A close second is the vegetable hotpot, and my children love (like squeal-out-loud love) the fried pineapple rice-- it arrives in a pineapple boat and it is delicious.\n\nFirst off-- you do not come here for atmosphere.  They have gussied the place up a bit with some fake bamboo and updated posters on the walls.  The fact that you can see a run down laundromat and a car inspeciton station that may or may not be boarded up should not deter you from this spot.  \n\nDo come for the hot tea, the service, and the food.  It is outstanding.  Although, the rumor is the \"original\" Lang Van owners are now the owners of Ben Thanh (which might explain my love affair with that restaurant).  The staff is so helpful and knowledgable in assisting with food selections.  We have taken several people here for their first visit and our waitperson has always helped make selections that were enjoyed by our guests!\n\nThe food is plentiful.  You will not leave here hungry!  Flat noodles, hot pots and spring rolls are our favorites (and the aforementioned fried pineapple).  We also love the little cookies that come with the check... perfectly sweet but do have peanuts.\n\n--This is a FUN place to bring a small group of people (6ish) to sit around a round table and share food.--\n\n--This is a great restaurant for children to experience delicious and healthy food.  The servers dote on well-behaved children here.--","useful":1,"funny":0,"cool":0},
{"review_id":"zDSlyv7-JnnI5epuDRhxPg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"-BOdPJnlQlLRv2aZ0nEWQw","stars":5,"date":"2012-12-29","text":"I cannot say enough about this church and I don't know where to start!\n\nAside from the obvious, the church is utterly gorgeous, the people are what make this place truly spectacular.  There is a widely diverse population at this church, which can be surprising to new visitors.  There is a Buddhist group that meets here, a Sunday School class for LGBT and friends, and people of all colors.  The minister here is Stephen Shoemaker and he is incredibly educated, intellectual and compassionate.  He is a pillar in the faith community in Charlotte.  The outreach of this church is also impressive.  Service projects and taking care of thy neighbor abounds here.\n\nThere are great Sunday School classes for adults and children alike.  The little ones often are found riding tricycles in the gym after SS and during the church service.  There are sports teams, a gym, art classes, computer classes, etc... offered here.  We have participated in many and loved them all.\n\nThey also have really great small group offerings-- interested in art?  drinking beer at pubs?  going to movies?  and somehow tying this back into Christianity?  Or maybe you want to be an earth keeper, a hiker or a yogi?  They have it all.\n\nMy favorite thing about this church?  No need to check your intellect at the door.","useful":4,"funny":1,"cool":2},
{"review_id":"Rs6tbf7w-SASMxYJJBaXCA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Xm5_AqSjcs7ixHVnPvf8Cw","stars":5,"date":"2012-08-31","text":"Dr. Eap is a healer in the truest sense of the word.  She not only has her Naturopathic degree from one of the most esteemed programs in the country, she also lived and studied with ancient healers and monks in Asia.  She is a true holistic practitioner-- mind, body, spirit.  This is an experience unlike any other...\n\nShe uses kinesiology to test the body for weaknesses.  She then prescribes any array of herbal supplements, and other unconventional treatments.  Sometimes it feels a little voo-doo-ish, but conventional doctors are just \"practicing\" medicine and dispensing potent drugs with known side effects... both seem scary to me, but the natural approach seems less so.  And, honestly, I showed up barely able to function from tiredness and fatigue, beaten up from medical procedures and under the care of an oncologist (for a noncancerous condition).  She really restored my energy.\n\nI credit Dr. Eap for restoring my health back to a place of wellness.  \n\n--It is expensive and not covered by insurance--\n--I eventually had to stop going, the supplements were getting to be too many for me to keep up with--\n--I will definitely go again, when my pocketbook and time can manage it--","useful":17,"funny":0,"cool":0},
{"review_id":"NZ2zjo_GihoCd4AU9kqqcQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"wwezOo-RlJW6whkdQzRxmQ","stars":5,"date":"2012-12-20","text":"Great, knowledgeable and friendly service: first the nice manboy (not sure how old he is... looked like a baby, acted like a polite adult) was awesome in making sure I was buying the best helmets for my kids.  He went in and out of their stock room several times to get it all correct.  Secondly, he asked if I needed boxes (I didn't have to arm wrestle him for them!) and he was genuinely excited when he found out I was Santa(they loaded all my Christmas loot into my sleigh that looks like a Suburban).   They also have the cutest chocolate lab that is in here on occasion.  Seriously, who does not love the beautiful face and aggressive wagging of the tail of a lab?    This place has all the snow and skateboard gear one might need.  Great priced helmets for skating and skiing, great penny board selection.  \n\nThe Tom's, Ugg, Sanuk and Rainbow shoe selection is insane.  Seriously, blows Nordstrom out of the water... kids and adult sizes!  And Sanuks are hard to find... my husband loves them and so does my brother in law (who is a surgeon and on his feet all day).  They are also hip without being hipster :)  But, with skinny jeans could def fall into the hipster category!","useful":3,"funny":4,"cool":1},
{"review_id":"tAvLRntFoaPFgho-9vNmKg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"9flxU7AaMAGlSp16kI9jdA","stars":4,"date":"2012-08-18","text":"I love Dr. Sowell and all of his office staff.  I could not find it in me to give a dentist 5-stars.  I dread, and I do mean, DREAD going to the dentist. \n\nHis hygenists are awesome.  Melissa is my favorite.  HIs front desk staff is wonderful.  For those suffering from severe dental anxiety, he will give a magic pill 30 minutes prior to any work to be done.  I have not done this... yet.\n\nHe also sees well-behaved children. That said, he sees 2 of 3 of mine ;) and is great with them.\n\n--their reschedule policy is difficult-- don't cancel appointments!","useful":1,"funny":0,"cool":0},
{"review_id":"ct6uRcO49L4LeVveF1YSMQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"nL1EXx8Djm6Yorb6A11lRg","stars":3,"date":"2012-08-23","text":"With $1.00 Icees (cherry, coke or mixed) and .50 cent vanilla ice cream cones, this is a great place to treat children to something \"special.\"  The indoor play area is clean and never crowded.  \n\nBK also offers veggie burgers but make sure to ask them to hold the mayo if you do not want your sandwich swimming in it.","useful":0,"funny":1,"cool":0},
{"review_id":"OTOb2TcTAURs_9mqhqV2Ew","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"7YDleCtN_pXsqjo7yQZ4OQ","stars":3,"date":"2012-09-20","text":"I do love this park, really, I do... but, I do not feel safe here by myself or alone with my children, hence the 3 stars. In fact, I was stopped by a police officer who told me as much.  So, with 3 children in tow, we loaded up and went to another park.  I was thankful he told me this, as I was feeling like that but felt I was being paranoid.  Without that significant detail, this would be a 4 star park.  \n\nI think the little splash park is big fun for younger children, although it can get quite crowded and there are, as always, those parents who do not monitor their children's behavior.\n\nThe playground is super fun!  Big, fast slide and great swings.  Great recycled plastic chips in lieu of mulch.\n\nAwesome picnic shelter and wonderful, open field for kick ball or soccer.\n\nNice winding paths that feel like you are really in the woods instead of steps from one of Charlotte's cutest neighborhoods.\n\n--I did find several used condoms on the playground and on the lovely walking paths.  \n\nThis is not a \"go-to\" park for me... Charlotte has too many wonderful options.","useful":4,"funny":1,"cool":0},
{"review_id":"5AaqmPwBBcxE_vB6k8fFyQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"foD6m1lhxAAfNEHdUbBpOA","stars":5,"date":"2012-09-20","text":"I love this park.  I love the tennis courts.  I love the lake (or pond?).  I love the aggressive geese that steal picnic dinners out of unsuspecting children's hands.  I love the interesting people that study, read, and play frisbee on \"hippie hill\".  I love the bridge to the band shell.  I love the yoga that is offered here on occasion.  I love the caddywampus dogs that people are walking here.  I love the random fishermen.  I love catching a little bit of a baseball game here.  I love the train.  I love the second playground with its big sandbox and swings.  I love the nature trails.  BUT, the thing I love the most is having a picnic in this park on a lovely day-- loading my car with scooters and bicycles and balls and dolls and watching my children behave wildly!  I also love the lacrosse for girls offered by CYLA at this park.  \n\n--Festival in the Park is a fun (but crowded) event held here annually.\n--lots of charity walks and runs here...\n--bathrooms are at your own risk!  yucky!","useful":2,"funny":2,"cool":3},
{"review_id":"_E5scWVmbBTI0Np935N9lw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"CSamwh_y3gOSg0Z7tyfJpw","stars":4,"date":"2012-08-25","text":"The Leo has to be one of the best salads in Charlotte; with its chopped lettuce and mint and parsley, cucumber and tomatoes it cannot get into my mouth fast enough!  The pita that comes with it is perfect for sponging up the remaining lemon vinegarette that is too tasty to waste.\n\nI like the falafel here, too.  Crispy on the outside and not mealy on the inside.  My hubs likes the meat specials and gyro.\n\nand the baklava?  like taking a bite out of an angel.","useful":0,"funny":0,"cool":0},
{"review_id":"UoF-5dCaRGZwq9bDId_HOw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"2fseQDxkgIlZIF0cBW5uaQ","stars":4,"date":"2012-08-25","text":"I love this Teeter! Not as overwhelming as the Taj M'Teeter.  I generally find a good parking place and they generally have all otheir lanes open with a bagger in each lane.  I appreciate all of those things!  \n\nIf you shop VIC specials, the Teeter is a good value.  You will shoot your wad if you run in here unprepared, without a list in hand!\n\nThe management at this store is incredibly gracious.  I brought home some HT Organic Milk that was spoiled.  I returned it and they refunded my money and gave me the name brand equivalent.  \n\nMy kids love all the samples they have out in the store.  Bonus!","useful":0,"funny":0,"cool":0},
{"review_id":"O99GTqVDcUvGxNCiArSkiA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"cd3PpDFypgMByAqBSYZc9w","stars":3,"date":"2013-01-02","text":"One of life's most frustrating experiences is shopping for  (and with ) a middle school daughter.  She chose this as our destination.  Really, I was ready to open my wallet and just be done.  Too bad the sales staff was unhelpful and a little... rude.  I asked them, very pointedly, for help.  I knew my daughter would trust their opinion more than mine (and they were both wearing those mullet shirts --you know long in the back, short in the front-- and, well, that is just not a style I am able to work with, so I did not just want their help, I *needed* their help).  They nonchalantly pointed to a section of clothes that she \"might\" like.  I inquired about help with sizing, to which, again, I was met with no offer of help.  She tried on a few things but she was frustrated with sizing and I was annoyed, so we left, empty handed.\n\nTo be sure, this is not my style of clothing, but I know there are some school friends that have picked up some cute clothes in here.  With all the options available in Charlotte, and when I am paying full-retail pricing (to be fair-- their retail pricing is affordable\/reasonable, hence 3 stars), I expect better and more helpful service.  \n\nI opened my wallet somewhere else... where I got to sit and watch the salesgirls work their magic and help my daughter feel a little special.","useful":5,"funny":0,"cool":0},
{"review_id":"jCCOxXAfgyX1Vdx_R6UBhQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Daasejc2-RV-MxEKpPjXtA","stars":3,"date":"2013-01-15","text":"Great place to watch a game.  On Sundays they have a make-your-own Bloody Mary bar which is outstanding.  They are also cheap-- $4 (I think) and also have a Mimosa special.  \n\nI have not eaten a meal here.  I have had the pimento cheese dip (which was an awful consistency-- think not-all-the-way melted Velveeta), I have seen the wings, and had a various assortment of fried bar food.  It was all fine.  My friends thought the burger was delicious-- both were suffering from the liquor flu so I am not trusting their judgment 100%.\n\nThe service here has never been good.  \n\nThe location works.  The back patio is fun (has its own bar) and the Bloody Mary bar is fun.  This is a place to go and drink, not go to eat.  And don't be surprised if you have to get your own drink from the bar because your server is no where to be found.\n\nMaybe I am just disgruntled.  I miss the Press box being here...","useful":0,"funny":0,"cool":0},
{"review_id":"VKPLM1C4fLIVP2wKpwYXeA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"a2h9nrVMpNvfwMBo1e8ffg","stars":4,"date":"2012-12-08","text":"I love The Fillmore.  I was between 4 and 5 stars and the reason I went with 4 stars is because I paid $18 on Wednesday night for two Bud Lights.... and I think that is ridiculous.  And I am not a fan of the VIP seating they had on the second level for the Willie Nelson concert... it took up way too much room, making the venue feel a little overcrowded.  These seats were not there for the Black Crowes or Five for Fighting and I prefer them not to be there the next time I am lucky enough to take in a show here.\n\nThe bathrooms are great here, which is an added bonus and a surprise!\n\nThis venue is fantastic for those who love to get up close and for those who want a more intimate setting for a show.  Really, Willie was spectacular and I loved the small venue for such a big man.  It makes it nearly impossible to think of going to a coliseum\/arena event.\n\nShows often sell out, so buy tickets early!","useful":0,"funny":0,"cool":0},
{"review_id":"jgKMbLlZBl0KgeyaIuGtPg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"QaXU3XeFaWwJ1_E1A3_3uw","stars":4,"date":"2012-08-19","text":"I am a fan of Slate Interiors!  I love the art, the unique tables, lamps, chairs, chandeliers, home accessories, etc.. There is always something unique here that I want to take home with me.  It is the type of place that makes you dream of how you might decorate a beach house, a mountain house, a contemporary house, etc.. The prices are reasonable on most things.  Occasionally, I feel like the pricing has no rhyme or reason.\n\nThey tend to have great mid-century pieces but these move quickly!  A lot of their merchandise turns over, so it is always a new shopping experience.  If you see it and you want it-- BUY IT!  I have lost several great things because I wanted to \"think about it.\"\n\nThe place is overflowing with wonderful local art.  I have noticed these pieces don't seem to sell as quickly as the furniture.\n\nFor the most part, the booths are well laid out with lovely inventory.  There are a few that could use a good makeover.\n\nThe people who work here are friendly, though I did buy an set of something and received a phone call that the price tag on the item was incorrect, it was not for both pieces of the pair but had been priced per item.  I was told I could either pay the new price or return the items.  I opted to return the items and they wanted it back within 24 hours.  As this was their mistake, and I live across town, I thought this was poor customer service.  \n\nAll in all it is in my top 5 places to browse interior goods.","useful":3,"funny":0,"cool":0},
{"review_id":"8x3RzF1L1w41DLBtYjXA-g","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"4vxpq3gE4p710Wxh82traQ","stars":1,"date":"2015-04-10","text":"I would give zero stars, if I could.  We hired H & S to install new brackets on our gutters around our entire house-- we were told they also should have been screwed in rather than nailed, and they would do that, too.  They came, \"did it\", I paid and they left.  Only, they did not do it.  My husband got up on the roof to blow leaves and NOT ONE new bracket had been installed.  The assumption that I have made in regards to this is they had no idea that I am married to someone who still blows his own leaves and cleans his own gutters and thought that we would never know the work was not done.  \n\nThey have come out to do the job properly.","useful":8,"funny":1,"cool":0},
{"review_id":"817R6soeZJmYg3YwX-urEA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"rX55-phMl0GEDjNiwb8Cuw","stars":3,"date":"2012-12-29","text":"I wanted to love this place.  Really, I did.  It is so close to home, I was hoping it would be a \"go-to\" place for my hubs and me.  Not so much.\n\nThe interior is lovely.  The water feature is really cool.  I love the tile.  I hope to find it for a backsplash in my kitchen.  Yes, those are the thoughts that were going through my head as my uninspired meal arrived.\n\nThe berry mojito was good.  The wine list is nice and reasonably priced.  The service was.... weird.  Maybe because we were one of only three tables in there on a Saturday night but, we felt like we were being stalked.\n\nSeaweed salad-- great.  Hard to really mess this up.  House salad with ginger dressing-- ok, here is where I show my odd palate-- I prefer iceberg with my ginger dressing, not field greens.  But, field greens are fancier, so field greens is what I got.  Fine (no stars taken off for this).\n\nThe rolls-- spicy tuna, a special roll, and a few slabs of shashimi.  All ok.  Not wowwonderful. Not even, wow! And pricey. And small (which I prefer, but my hub was disappointed).  I get that I am paying for atmosphere, too.  BUT, there was NO ONE there, which felt a little creepy.  Or sad.  Even our server seemed sad.  The atmosphere, lovely water feature aside, was odd.  \n\n3.5 but I rounded down.","useful":3,"funny":1,"cool":1},
{"review_id":"2BAdh--k0WKCa-rkcSNwCA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"qWSwDbtJRBvKTiMpH3rNLQ","stars":1,"date":"2016-04-09","text":"Awful service. Rude hostess. Rude waitress. If you want to clear your dining room out by 10, DONT seat people at 9:30. I'll never return. There are way too many great Thai options who want to serve customers.","useful":0,"funny":0,"cool":0},
{"review_id":"oejdurr3hkUWd0707UZtyQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"XagMSw5tADQbNSx0IM7TaA","stars":5,"date":"2013-07-27","text":"This gem never disappoints!  It is the perfect store to browse and giggle and pick up fun and\/or lovely gifts for those hard to shop for people in your life... or the people in your life that have a wicked sense of humor.  \n\nFirst, the books and magazines that greet you as you enter.  A fantastic collection of art and architecture coffee table books, some novels that are NYT best sellers, some fantastic journals and calendars.  There is usually a well behaved and very lazy dog lounging in this area as well.  From here you move into candles- YUM!- and picture frames, bath goodies and such, onto hialrious housewares, fabulous earrings and other jewelry, cute clutches, perfectly inappropriate cards, magnets, coasters, bottle openers... you name it!  Even cute and quirky baby and children gifts, which are sprinkled with a few gold standards.\n\nYou can literally knock out your entire Christmas shopping list here, from your gay boss to your ultra conservative mother-in-law, Paper Skyscraper has you covered.\n\nStaff is adorable and super friendly.  Parking is a weebit of a pain.","useful":1,"funny":2,"cool":0},
{"review_id":"dFGEAfyBrDIoIYzsxDYMMw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"RQDY2f8Bn4RL2TOUzPYYMg","stars":3,"date":"2012-08-25","text":"Great produce for the best prices I have seen in Charlotte.  8 limes for a dollar?  Guess I'll be mixing mojitos tonight!  Avocado for .50?  Guess we'll be eating guac with our mojitos!  Basil, cilantro, mint?  Guess who is eating Thai tomorrow?  Plantains? I just watched Alton Brown make these, and at this price I cannot resist!\n\nAside from the produce and the ethnic foods and spices, I was surprised that the prices on the American brands (cereal, frozen foods, drinks, etc...) are much higher than the Teeter.\n\nMy five year old thought we had somehow beamed ourselves to another country.... She loved it!","useful":2,"funny":4,"cool":2},
{"review_id":"zLpHu74_eyCZLsHJHuTrAw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"QSv8Om6yHTypbXfvWb4C2g","stars":3,"date":"2013-01-15","text":"This is a wonderful place to get lost in one lazy weekend day.  Their selection ranges from the weird and absurd to vintage and kitschy to antique, retro, funky cool.  Unfortunately, as of late, their selection has not turned over very quickly, is dull and uninspired and priced all over the map.  There were times when I could not leave without that breathless feeling of finding the perfect treasure you had no idea you needed until you saw it, the maze of aisles confusing me with treasures galore, all over the store and me not being to remember them all.  Not so at present.  I am hopeful that the Spring yard sales and Estate sales will breathe some life back into the long, winding aisles of the Sleepy.\n\nI have come here for years.  I had a booth at their old location and at this location-- I love the hunt, the repurposing of goods, the uniqueness that only this type of place can bring into your home... I hope this is just a little bump in the road for us.  I was there-- in and out-- in under an hour this past Sunday (unheard of!).  And left without anything... not only did I leave with nothing, I left not seeing anything that I would buy if only I could... \n\nFree popcorn in the front and some of the nicest sales staff anywhere in Charlotte.  I will be back and will hopefully be able to re-review my once very faithful bazaar\/homegoods\/yard art store.","useful":1,"funny":0,"cool":0},
{"review_id":"vkUxdDaO0eI4UrJy3-XGxA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"PqcOSnCsJTT9Yd2xWKIMWw","stars":4,"date":"2012-08-13","text":"Falafel pitas, with hot sauce?  Delish!\nHummus?  Delish!\nTabbouleh?  Delish!\nBabba ganoush?  Delish!\n\nService?  Outstanding!  (The owner loves children... has a gaggle of them himself.)\n\nPrice?  5 pitas, hummus, tabbouleh, baba ganoush, and a bag of pitas ~$25.00\n\nThe BEST picnic to-go in Charlotte.","useful":1,"funny":0,"cool":1},
{"review_id":"nj6I2urM7BnNUUbQ1PWX4g","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"emCtTWqzqW62KCUdrYY8oQ","stars":4,"date":"2012-09-06","text":"Great dance instruction for children and teens.  I have one child currently taking tap and ballet here and one who took modern dance.  The quality of the instruction is great.  The recital is truly spectacular, held at Queens University, it is very exciting and professionally done. \n\nThe studio itself is easy to access-- behind Park Road Shopping Center, and sells all the dance shoes, leotards, and tights they might need, at reasonable prices.  No running out to Morris Costume shop!\n\nThis studio is more pricey than the Y but the instruction is more technical and precise.  I have done both-- loved the Y but the convenience and the instruction at Jami Masters won me over.\n\nThey also do a monthly draft, so my scattered brain does not have to remember to pay monthly.","useful":9,"funny":0,"cool":0},
{"review_id":"egsH7BON_6hqkeJ7umuP3Q","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"QJt6EkcHAAa_rY_27B9Rxg","stars":4,"date":"2013-01-27","text":"This place is HUGE and full of vendors who have a great eye for fantastic home furnishings and accessories.  TONS of glassware in right now... the new trend is the mid-century mod highball glasses, cocktail glasses and cocktail shakers-- they do not disappoint but they are a bit pricey compared to others I have been scoping out.\n\nGreat prices on some stuff, ridiculous prices on other things... this tends to be the case in these multi-vendor homegoods stores.  \n\nI used to skip the upstairs as it usually was pretty boring but that area has really gotten gussied up and is worth a peek.  They have awesome art work in the stairwell and throughout the store.  Their signature candles smell wonderful!\n\nThe people who work here could not be any friendlier or more helpful.  \n\nSurprise of the store:  They have really cute jewelry at affordable prices and have recently added cute scarves, as well!\n\n\n4.5 stars but rounded down bcasue they still have a few vendors whose wares are not fitting for this place... seems like wasted space.","useful":1,"funny":0,"cool":0},
{"review_id":"yZDw-hR6TsXtPc2FkoNgEw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"j9xwoU47J57I3I36sye4rw","stars":2,"date":"2012-08-30","text":"I have practiced here a lot.  Not because it is my favorite studio, it's not, but because of the convenience and because of Adam W., one of the instructors.  And Shana, my other favorite.  The classes are often very smelly, and I have had to leave when the odor is so overpowering that I was able to taste it in my mouth.  The hallway is crowded and annoying, both before class and after. Classes often are so crowded that you are touching your neighbor and getting their sweat drops onto your mat. eeek.\n\nThe crowd is definitely...interesting.  Lots of overzealous, scantily clad women who stay for more than one class in a row.  \n\nThis is not so much a yoga studio as much as a bootcamp-like atmosphere that uses yoga as the tool for your exercise.\n\nAdam is the consistent exception to the bootcamp mentality.\n\nI appear to have a masochist bone in my body because sometimes a good a--kicking as a workout suits me fine, but when I want yoga-- the exercise, the mindfulness, the spiritual component experience, I go elsewhere.\n\n--They do offer a lot of karma classes, which is nice--\n--their schedule works--","useful":15,"funny":10,"cool":5},
{"review_id":"J5c7bfRMtIjW9ZdA7DRF8w","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"BFT2OTfdK98J3FQ0ZZdE0A","stars":3,"date":"2012-08-26","text":"WIth a BOGO half-priced sale going on virtually anytime you arrive here, it is a bargain.  While their prices do seem to be slightly less than Dick's, the selection is minimal, and their kid's section is almost non-existent.  So, as great of a deal as one might find here, it is hard when there is not much merchandise to choose from.","useful":0,"funny":0,"cool":0},
{"review_id":"m7AstDi2eYVQTHhfRQWAKA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"UTU4wNXX8iqz0R4NgOlnDg","stars":3,"date":"2012-08-19","text":"I eat here every week for lunch with a lunch group (their choice, not mine).  The lunch menu is changed weekly and always includes Pad Thai and a curry dish (number 4).  All can be made vegetarian.\n\nThe lunch comes with a spring roll and soup.  I enjoy both.  My favorite meal is when number 4 is green curry with eggplant and green beans.  It is spicy- beware!\n\nThe service can be hit or miss but I can easily order, eat and pay within 50 minutes.  As a parent, I have gotten quite good at scarfing down a meal...\n\nIn the summer this restaurant is HOT.  And I don't mean hot as in crowded and covered with paparazzi, I mean they keep the AC at 78 degrees... sit in the main dining room rather than the sunnier side -room to keep from completely melting down- figuratively and literally.\n\nSadly, the food has declined in quality.  What was once a 4 star establishment is now a 3 star restaurant.  \n\nGo get your curry on!","useful":0,"funny":0,"cool":0},
{"review_id":"Fd-8-4gEmOyE0LPe7Xeyjg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"CxsN79g8rZoouLwZvr_FVg","stars":4,"date":"2012-09-20","text":"YUM!\n\nSquash blossom hushpuppies followed by warm kale, fried goat cheese and beet salad, and a house made white bean burger with potaoes on the side.  Delish!  Loved sitting outside on the cute but small patio-- great people watching!  Love the cucumber water.\n\nThe veggie burger, while delicious, was way too big to eat as a burger.  The dipping sauce for the squash blossom hushpuppies was a bit disappointing.\n\nService was great.  Patio is cute; interior is small but quaint.","useful":1,"funny":0,"cool":0},
{"review_id":"zbLNjRcGsjiy4Fkg-_-k7A","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"VK4YQ5_s2-dyfAJgYK2X2Q","stars":4,"date":"2012-08-22","text":"I am a salon girl but my stylist has always said that barbers are the best trained in their craft.  I took my four year old daughter here one afternoon after she insisted for hours that she wanted a haircut.  She went in with a hairstyle I would lovingly call 'bird's nest' and came out with an adorable and well done bob. She did not mind the no-frills atmosphere. There was a local anchorman and an elderly gentleman getting their hair did, too.  Old-school barber with friendly service at a great price... ($15 without tip) and a dumdum lollipop? Good stuff.\n\n--we were walk-ins and did not wait but they did get busier while we were there with people who had appointments--","useful":2,"funny":0,"cool":2},
{"review_id":"dzriS3mAnZ1ParcHx7pWZw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Qt_N75Fc6JiPOIZPLMV9jg","stars":5,"date":"2012-09-03","text":"We have used tham a lot and they have never disappointed!  They take care of our deaf puppy, a big mutt dog, a bunny rabbit and 2 chickens for us.  They text us to tell us how everyone is doing and leave a lenghty note after each visit.  They also water plants and get our mail!\n\nWe have been thrilled with Little Friends!  They called this morning to tell us one of our chickens was missing (she wasn't, just has switched coops).  I appreciate their thoroughness and the attention they lavish on our pets.\n\nMuch less expensive than boarding, much happier animals, too!  They also have been wonderful at helping us \"last minute\" because, fortunately or unfortunately, that is how we roll sometimes...","useful":2,"funny":0,"cool":0},
{"review_id":"k-ga0YTNVe9Mmzze3lyMyA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"8-ymYx-T2TGZ8n2p3ct-9w","stars":4,"date":"2013-07-26","text":"I love this hidden gem which also happens to be the oldest farmer's market in Mecklenburg county.  It is full of locally grown delicious produce!  Heirloom tomatoes, big boys, hot house, purple Cherokees... you name it, they have it.  In addition to the corn, peppers, peaches, berries, eggplants, etc... they also have jams and local baked goods.  Lastly, the Beverly's Gourmet meals to go are divine!  Vegan, vegetarian, and gluten-free options available.  The tomato pie is fabulous!  These are great meals to drop off when you have signed up to bring a meal to a friend and cannot find the time for homemade... these meals are homemade, just not in your kitchen!\n\nThey take a debit card.\n\nLocated next to CMC-Main, park in rear.","useful":1,"funny":0,"cool":0},
{"review_id":"MbGCpR5-YaUY_O08YNVzYg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"xwAjj-iemdpJ6vuL1-zrDw","stars":5,"date":"2012-11-20","text":"Dr. Plonk is fabulous!  Seriously, if you are on the hunt for a pediatrician, he is truly amazing. Providence Pediatrics has moved since we started going to them, but our loyalty to Dr. Plonk is unwavering and I drive past several other pediatrics offices to get there (which, admit idly is a pain)... but, his kind bedside manner and his trust in a \"mother's intuition\", with his own dose of intuition has worked wonderfully for our family of three daughters.\n\nHe has called to check in on a very sick child, offering to work with our health care provider for in-home nursing care if we got too overwhelmed-- this all on a Saturday.  He called every day for a week to check on her (and us).  He has reassured a desperate mother that her unruly child was just \"spirited\" and \"strong willed.\"  \n\nHis father was a country doctor and Dr. Plonk has that same genuine care and concern that I imagine (and have heard) that his father had.  \n\nUnfortunately, we have had some medical bumps along the way and Dr. Plonk has helped us navigate through these tough times.  \n\nBeth Haynes is also tremendous at this practice.\n\nDr. Plonk is 5-plus stars and their practice is, too.","useful":5,"funny":0,"cool":0},
{"review_id":"zGH33h9dUfNvbrqvPBumHg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"lgmDTHqe0IGyvfrfeFciuw","stars":4,"date":"2012-08-18","text":"I love Charlotte Yoga!  This is a friendly yoga studio without the pretense of some other studios.  The instructors are great-- Rowena, Angie and Jaime are my favorites.  And, when you go to a $5 class, not only are you getting a great class but also a great value!\n\nThe studio itself is clean, and has a lot of natural light streaming in from the floor to ceiling windows, which I like during my practice.  I feel a little claustrophobic in a hot studio that doesn't have windows.\n\nThe bathrooms are adequate (well the women's bathroom, did not check out the men's) with showers.  The hall does get crowded during class changes, but most studios have this issue.  They also have filtered water, fill up before you get into class!\n\nThe power classes that are offered after a hot class are little too hot, or I would give 5-stars.  Several times the classes that are advertised as \"in an 85 degree room\" have been in a 100 degree + room (I check the thermostat because I always wonder if something is wrong with me when my practice seems harder than normal!).  I have heard several people comment\/complan about this issue.  Believe me, there is quite a difference between 85-87 degrees and 100 degrees!\n\nThis place is overflowing with friendly yogis.  My husband, who was really intimidated by the whole yoga thing, loves this place!  My top 2 studio in Charlotte.\n\n--\"Friend\" them on Facebook for (occasional) coupons and discounts--","useful":1,"funny":0,"cool":0},
{"review_id":"4f6eWCohAq7PO6pQCIgotw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"YE55riIHyVuC9NfkcU9eFg","stars":4,"date":"2012-11-20","text":"Unfortunately, my family has spent a fair amount of time here and we have always had a wonderful experience, although the wait, on occasion, is unbearable... but, if you show up with a toddler profusely bleeding while wearing a swimsuit (mother and daughter), mercifully, they usher you back pretty quickly.  They were hesitant to stitch up my daughter as the laceration was on her face, and they wanted a pediatric plastic surgeon to do it, but, as she had already had stitches in the EXACT same spot twice-- one of those times being at a clinic in a county that did not have a plastic surgeon, I assured them that plastic surgery to repair the scar was probably in her future, and asked them to sew her up .  They were compassionate and kind.  I appreciated it immensely!  They have diagnosed pneumonia, removed a bead from a nose, lacerated an infected toe, given breathing treatments for asthma, etc...","useful":2,"funny":0,"cool":0},
{"review_id":"4KbJXuf8H2pGQnUatmc1LQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"--cZ6Hhc9F7VkKXxHMVZSQ","stars":5,"date":"2012-12-19","text":"Our family of five got the Latin Combo-- full rotisserie chicken, fried plantains, salad, yucca, rice and beans.  All was delicious! The salad, topped with avocado and dressed with a tangy ( read mouthwatering) dressing was delicious! The plantains were perfect.  The rice and beans were fantastic.  Yucca dipped in the hot sauce... Divine!  My hubs and children devoured the chicken... Rave reviews- even from picky miss.  We had leftovers and, seriously, for a family of five to eat this delicious meal for a whopping $2600. almost made me feel guilty. Almost.\n\nWe also had the tostones and guacamole as an appetizer. Perfectly fried. Tons of well made guacamole.  We may have found our Sunday night supper spot!\n\nSmall interior. I would not bring really young or really loud children here.","useful":1,"funny":0,"cool":0},
{"review_id":"DEsnzui_PkDmiglp3s_fYA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Er1mJJbrhh885LlkNsgqfA","stars":5,"date":"2012-12-08","text":"Great Christmas trees and awesome horse drawn carriage ride to the barn!\n\nThis place is fantastic.  We have strawberry picked here, gone to the pumpkin patch, had a four-year old's birthday party here , ridden ponies, milked cows, gone on hay rides, made smores, and fed sheep and goats. \n\nThese fine people have willed their land and farm to the Catawba Land Conservancy to preserve this lovely 50 acre farm.  It is now surrounded by McMansions but one can truly feel away from it all while here.\n\nEasy drive, straight down Providence Road.\n\nBTW-- the bday party was the best, most fun and affordable party we've done.  Strawberry pickin', kickball and a pinata.  Bliss!","useful":2,"funny":0,"cool":2},
{"review_id":"ybITpT74qBUCw1FJV3Gg5w","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"IFXsOJvq8BaaLjGij639Ow","stars":4,"date":"2012-08-23","text":"What is not to love about half-priced wine on Wednesdays? \n \nI love the atmosphere here.  It is dark and sleek, very upscale.  The prices reflect that!\n\nI have eaten dinner here before and while it was delicious, it was bit too pricey for what I received.  But, for a nice bar and some finger foods, this is the place!  The flat bread pizza with fig, arugula and prosciutto is perfect for sharing with a friend.  I am not a carnivore, so I remove the prosciutto from mine.  The crust is crispy, the figs are heaven!\n\nThe salads are also delicious-- the local heirloom salad is my favorite.  I love local foods, and this did not disappoint.\n\n\n--They also have great draft beers--\n--Napa Cellars Chardonnay on Wednesdays is $6\/glass... can you say DEAL!?--\n--The bar is quiet.  A great place to catch up with a friend, or to plot revenge on an ex-boyfriend (hers, not mine)\n--The bathrooms are fantastic!  Love the faux crocodile floors!--\n--Awesome outside seating--\n--Park on the top-level of the parking deck that is attached to Southpark Mall, and it is an easy walk over... or valet--","useful":0,"funny":0,"cool":0},
{"review_id":"7r2k8QHpUUjwzrS94SdZ1A","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"yt__7tlJA3qUzwAa-okFPQ","stars":5,"date":"2013-07-26","text":"Jeffre Scott Apothecary is a lovely little place full of luxurious lotions and potions, makeup and skincare products.  This would be enough to earn 5 stars but the real reason I gave JSA 5 stars is because of Jeffre and Charlton.  They could not be any friendlier.  And they knew exactly what I \"needed\" without me even knowing what I needed!  \n\nWhat brought me in was the brow service... no wax or sugar or threading here (my sensitive skin says \"thank you!\") .  This service is 5 star worthy in and of itself.  \n\nI think I just gave 15 stars?","useful":4,"funny":4,"cool":2},
{"review_id":"0L8hqmX03h3CsNvsp4pk6w","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"Ex1-tKlQa74J0usZVHxYEw","stars":5,"date":"2012-08-30","text":"Hands down this place offers the BEST children's swim lessons in Charlotte-- and I know because we have tried what seems like all of them!\n\nThe indoor pool area is great, with shower facilities and a locker room that are clean and a good temperature for freezing kids getting out of the pool.  The pool is an Olympic sized pool and is not kept freezing (like at MAC) but is cool enough for the children not to overheat.  The deep end has a ledge around the sides that the children can stand on while receiving instruction.  There are several diving blocks they practice on as well.  The seating is great... concrete bleacher-like seating that is in the pool area and divided by a smallish wall.  While the area does have a strong chlorine smell, it is nothing like other area YMCAs that have the indoor pools and water parks... my eyes do not sting while there nor do my clothes smell when we leave.  And, while it is warm in there (thank Goodness!), it is not sweltering.  The parking is awesome here.  There is never a crowd.\n\nOk, on to the instruction, which is great... I have enrolled a 4 year old and a 9 year old in this program.  My 4 year old could doggie paddle and swim just well enough to jump off the diving board, my 9 year old needed a refresher for the swim team and was mostly doing \"illegal\" strokes that would get her disqualified in a meet.  The lessons are at 6 week intervals, which is nice as really long-term commitments freak me out a bit (commitment phobe!).  They are so reasonably prices compared to what we have paid at the stand alone swim centers, I almost felt guilty.  This guilt increased when I found that my 9 year old was in a class with only one other child. The instructor was fantastic!  He pushed them enough to work hard but feel accomplished.  And he got her strokes totally straightened out (no more lifting her head to take a breath in freestyle).  We did 2 sessions (one 6 weeks, the other 5 weeks (even better for my commitment issues)), and my daughter ended up in the All Star swim meet after summer swim team.  Which was a bonus, I just did not want her to be embarrassed swimming.  The 4 year old?  After one 6 week session, she was doing a version of freestyle, jumping off the diving board and I felt totally safe letting her swim this summer without having to be in the pool with her at every moment.  \n\nWe will be there this Winter doing their little Winter league swim team.  Look for us, I will be the mom reading her book on the concrete bleachers and my daughters will be the ones splashing around and having a blast!","useful":4,"funny":0,"cool":0},
{"review_id":"pQ5UfMv2LbPHHor687IXCA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"D2ojX9bvE0_-aIj9BhdZZA","stars":4,"date":"2012-08-22","text":"As a member of the Matilda Wong society, I felt compelled to review old faithful... 300 East.\n\nI love the atmosphere.  Who can't be enamored with this old house in the heart of Dilworth?  I am not sure if she (the house) is considered a Grand Dame by historians and architects but it certainly is by me!  \n\nI love sitting downstairs in one of the booths to the right of the hostess stand for a long leisurely lunch on a Saturday, that may, or may not, include a glass of wine.  I love coming here in the Fall and sitting outside, hearing the fountain and looking at the sheep statue.  I love coming here in the Winter and sitting in the really small and cozy booth in the main dining room.  Really, I cannot think of a time when it isn't right to come here!\n\nThe hummus plate is a delicious way to start your meal.  If you are lucky the white bean and gouda soup will be the daily soup offering.. it is bowl-licking good.  All the specials I have ever tried are delicious...  But, I tend to gravitate toward a salad or, my favorite, the black bean tortilla (with lots of fresh avacado!).  My hubbie likes the usual-- a grinder-ish type sandwich, the tuna, or whichever pasta is on the menu.\n\nThere is a special drink here called the \"Matilda Wong\"  and it is very, very wong.  It used to come in a smallish fishbowl (think beta fish) but is now served in a small pitcher.  When I say it is \"wong\", I mean it is strong, it is good for sharing but, plan on having a responsible driver.  They cut you off after 2, as they should.  I think I have aged out of the ability to even share one...\n\nNice wine list, half-priced wine nights.  This is a fun girls-night, or date night, or parents-are-in-town place.  \n\n-- funny to see your guests' reactions to the bathrooms--","useful":0,"funny":1,"cool":1},
{"review_id":"GNmQhwPNIdWCKHW0RaEGOg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"ogO3Yh_PgvBFcifw5f8g-g","stars":5,"date":"2013-01-26","text":"At Park Road Shopping Center there is a treasure of a furniture and accessory store frequented by designers and consumers alike that is owned and operated by a woman of impeccable taste and friendly demeanor.  \n\nThis place never disappoints... lovely furnishings, lighting, art work, pillows, etc... it is pricey, so if you are looking for a deal, come during their semi-annual clearance sale- or check the back, where often there is sale merchandise.\n\nThey fabricate orders and offer design services.","useful":3,"funny":0,"cool":0},
{"review_id":"BRUaWr8AXP2R5o06yc7ktg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"1FlIbmN4aNJuXsGK0shnfQ","stars":4,"date":"2012-12-14","text":"My husband and I often stop in here to retox after we detox (look for us at the bar in yoga clothes, often still glistening with sweat).  The pretzel bites and the zucchini fries (more like sticks) are fantastic.  The dipping sauces are great!  The boom boom sauce is perfectly spicy... I wish I could recreate this at home. \n\nDinner:  I did not enjoy my dinner.  Get the fried chicken.  My husband did enjoy his buffalo chicken sandwich.  I had some kind of salad-- obviously not a great choice in a bar but there veggie selection is limited-- it was not great but what is great is their brunch.  I prefer that to their dinner menu.  They also offer bottomless mimosas and bloody marys but-- good grief-- who can partake in that at noon on a Sunday?  Not me.  If you can, stop reading right now and say a prayer of thanksgiving.   The french toast, the omelet, the toast and grits, is all great.\n\nThey have a good beer selection on tap.  What they do not have is a good wine selection... this is definitely an area in which they can (and should) improve.  They have several specialty cocktails which usually are good.  There bloody marys are delish... especially the bloody martin.  \n\nThey have a cute little side room that you can reserve for parties. They have also been generous in the community, hosting fundraisers of various sorts.  Their marketing campaign-- Leroy Fox for President-- was awesome.  I loved seeing those signs in front yards.  \"Free chicken for everyone.\"\n\nThis area needed this spot.  Hotel Charlotte had seen its better days... and the face lift and the thorough cleaning this spot got is great.  Even the restrooms aren't awful anymore.  I wish they had left the train running around the ceiling...\n\nThis is also a fun place to watch a game.","useful":2,"funny":2,"cool":1},
{"review_id":"AHfsjI3uElIHr5hr1WTV6w","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"uKP1_uDGYSsMI2_5XU8fKg","stars":5,"date":"2012-05-22","text":"Tease Salon is awesome!  My hair has never looked better-- both cut and color.  The atmosphere, the employees, the products... they are all wonderful!","useful":3,"funny":0,"cool":1},
{"review_id":"vsgYu7KdwsWnmP8kg8aBYw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"VeFqptSzekFAc3FZOpi81Q","stars":5,"date":"2012-12-07","text":"Run to Alexander Michael's this Christmas season for dinner or drinks.  You will thank me.   \n\nTucked away in 4th Ward (which in and of itself is reason enough to head to A.M.) it is quaint and, right now, decorated with lovely garlands and greenery and twinkling lights (I love twinkly things).  It truly looks out of a movie.  And the houses around it are also decorated so sweetly.  A little bit magical.  \n\nI was a 4th Ward resident and kinda lived at A.M. for a few years and had not been in awhile.  We went  last night to meet friends for drinks and dinner before heading to one of my all-time favorite venues (The Fillmore... but I digress...).  Great beer selection.  We all had different meals-- nachos are delish (salsa not so much), my hubs said the burger was good, fried pickles (yum!), veggie pita was great, but you have to get the \"what it is.\"  What it is sustained me for years.  I'm veggie now, so no chicken for me... but, it was good all those nights!\n\nWhile the food is not 5-star worthy, the atmosphere, the bar, the beer selection, the people, and the staff make this a 5-star establishment, for sure.","useful":3,"funny":3,"cool":3},
{"review_id":"jQQeiU5PKrUqXD5qy4c-Ug","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"CJty_bUZVJJaLFcTppxmzg","stars":4,"date":"2013-01-02","text":"I love the Neighborhood Theatre... it has kept me coming back for years.  From the Indigo Girls to DSO, the Brazilian Girls, North Mississippi Allstars, and Yo Mama's Big Fat Booty Band, to my most recent show-- the Blue Dogs and Drivin N Cryin, this is just a fantastic and friendly venue to see and hear a show.  \n\nIt gets loud and it can get crowded (very crowded) but it is usually a fun and friendly crowd.  On occasion you might want to get there early (bring a yard chair) if you want to grab a general admission seat (just put your name on the paper and pen you brought with you, and use the scotch tape you also remembered to bring) and reserve your seat... now head out to grab a bite while you wait for the show to start!  Seriously, it is that friendly... but, remember your seats won't allow for you to view the show, which is great for say, a husband who got dragged to see the IG.  \n\nThere are seats upstairs that are sometimes open, sometimes included in the GA price and sometimes reserved, just check the show listing.  There is also a VIP seating area that comes with a server.  I am fine to get my own PBR or-- the value cup!-- a big ole, in the case of this past weekend, Sierra Nevada.  Score!\n\nBathrooms surprisingly rarely have much of a wait... probably because you want to get in and out as fast as you can...but, they do have a Dyson hand dryer (the long one that you take your hands in and out of while hearing a sound similar to a jet engine!).  \n\nThis spot is a neighborhood staple and is an anchor to the area.  It is truly local business at its finest.  It also really helped ramp up the music scene in Charlotte...","useful":2,"funny":1,"cool":0},
{"review_id":"U2j3HMTTIZHMMGR5r1LDeQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"sEeV71wQBgNM8ipdfHszkw","stars":5,"date":"2013-01-02","text":"I cannot believe I have not reviewed this bakery gem, this little slice of Heaven, the sugary wonder, my sweet and reliable Suarez Bakery.  \n\nCream Horns-- seriously, the flakiest pastry shell, sprinkled with powdered sugar and filled full of the lightest, fluffiest frosting-like fill.  \n\nSnickerdoodles-- cinnamon sugar yuminess on top of an elephant ear like cookie\/pastry.  \n\nElephant Ears-- a huge treat that is as large as a 5 year old's head (really).\n\nSugar cookies-- all shapes and decorations, perfectly sweetened to be able to eat several without feeling ill!  --- They also make these to order--- perfect for school parties that require cookies for decorating and the mom who does not bake!\n\nCupcakes-- all different flavors.  Delicious and lovely.\n\nCakes-- Tizzerts.  Need I say more?  Just the best cake you can put in your mouth... Our wedding cake was Tizzerts, and have had several other special occasion cakes from Tiz.\n\nThumb print cookies--  perfect for the little bit of sweet tooth, a small sugar cookie\/ shortbread like cookie, topped with a smudge of frosting (this is my go-to treat).\n\nI do not have a sweet tooth like the rest of my family.  So my go-to is the thumb print cookie but, even without a sweet tooth, the temptations of all this goodness cannot be resisted.   We celebrate milestones and accomplishments and hard days and completed projects by occasionally popping into Suarez and picking out a delectable treat.  \n\n-- Seriously, the made to order cookies have saved me for years as a room mother who cannot bake--","useful":11,"funny":1,"cool":6},
{"review_id":"pOf1x6FUWY6ncp93xNjHAA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"uZx57JEWbG4hIPv-QtGYZA","stars":5,"date":"2012-12-29","text":"I love Dr. W (his name is long and confusing to spell... let alone say) and this location (downtown in the BBandT building next to the Caribou- bonus!).  He is very patient and thorough and just a really nice guy.  His staff was super helpful in helping me pick out glasses and training me on how to put in and remove contacts (which was awful but not their fault).  They also filed everything with my insurance company, which is great.\n\nI also love that they call and email to remind of upcoming appointments.  I really appreciate this service.\n\nThey also have a location on Colony Rd., near the Lodge.\n\nI am a person who hates going to any type of doctor.  They really make this a nice experience.","useful":0,"funny":0,"cool":0},
{"review_id":"d5xLDbIi6vGIDblk8Zk0gA","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"wNAhWqABvz1FQ7PR42OYqA","stars":3,"date":"2012-11-20","text":"You never know what might be waiting at this consignment store-- a mirror, a chandelier (their selection is usually fabulous!), window treatments, or a lamp... who knows!?!\n\nThis is a consignment store and not a thrift store-- the prices reflect this.\n\nTheir inventory turns over quickly.  As a former client and a current customer, I can attest to that!\n\nThey can be a bit rude, or I would give 4-stars.  I do appreciate and expect friendly customer service as a consumer.\n\nI have found some unique treasures here, so I continue to peruse!","useful":8,"funny":0,"cool":0},
{"review_id":"Yg_hsgav8dC3HoJYTayZfQ","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"a_ozcQNKgUOW4Lr0NQq4qg","stars":2,"date":"2012-09-19","text":"This is the slooooooowest Starbucks service in town.  Due to the convenience of the location, I stop in here for a coffee on occassion but I have to have plenty of time on my hands in order to do so.\n\n--parking is tight--","useful":0,"funny":0,"cool":0},
{"review_id":"lBSfo0CnRUvyBVs9PYLh1w","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"QCUjHPu7OF_bqfjnehlQaQ","stars":3,"date":"2012-08-28","text":"The patio gets 5-stars.  It is one of my favorites in Charlotte.  It has plenty of shade for eating brunch outside and it is a lovely setting on which to dine.  \n\nI usually love their brunch but my food on Sunday was not good nor was our service.  I had the breakfast pita and I could not eat more than a bite of it, it just tasted really bad.  And this was weird based on the fact that some of my favorite foods had gon einto its preparation!  Spinach and cucumber sauce, egg and cheese and pita... should be delicious.  It was not.  \n\nOur water and tea glasses were empty the entire meal, and we asked several times for refills to no avail.  \n\nThey do have excellent sangria and a nice wine list.  I guess I will stick to my standards:  fruit and granola for brunch, hummus and cheese plate for appies with wine.  \n\n--the scones that are served before the brunch are divine--","useful":1,"funny":0,"cool":0},
{"review_id":"0iSp7MGMXhPykRvHEO9oSw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"kWgdj5qr5WWvn7kAO8Wr1w","stars":3,"date":"2013-07-26","text":"What do you send to a mother who has decided to drive four 13 years olds and a 7 year old to Florida?  How about 4 huge bags of popcorn?  (Hey, it's not my car!)  A cheese, a carmel and 2 bags of butter should keep them busy for a little while, right?  \n\nIf you find yourself in need of popcorn for car trip or slumber party, movie night or school function, this is the place to get it.   \n\nNo need to call ahead for the aforementioned flavors.  They do have fancy flavors but you need to order in advance.\n\ntip:  Skip the metal bucket and save $20 by having them put the bagged popcorn in a box.","useful":0,"funny":0,"cool":0},
{"review_id":"c0YaKp8miTpvVRmQ1qxYqw","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"2S6p5ICNswz_EdgcZk76qQ","stars":3,"date":"2012-08-22","text":"As other reviewers have mentioned, the beer selection is great, but.... no Guinness on tap!?!  Isn't there a rule about this, somewhere?  That to be considered a bar with a good beer selection you have to have the real King-of-Beers on tap?  Out of a bottle does not do my Guinny any justice.  \n\nThe food is bar food but for a vegetarian, it is a terrible selection.  The salads are not good.  HUGE but not tasty.  My husband liked the wings just fine.  \n\nToo many other places with beer selection and good food for this to my go-to bar.  Or to be a go-again bar.","useful":1,"funny":0,"cool":0},
{"review_id":"27D7CWE8oo_n96Hcw65lUg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"aIJqDWUt10iS45zYCr0KcQ","stars":4,"date":"2012-09-19","text":"The best massaman curry in town.  I get it with tofu.  My hubs likes the gang dang with chicken.  \n\nWonderful tea.  Wonderful service.\n\nI love this cozy place in the winter... it is so endearingly ecclectic on the inside: it is small but not tight, it has a great window onto the sidewalk of East Blvd., it has twinkly lights around said window.  Walking in here from the cold, sitting down to a hot pot of tea and some massaman is a great way to spend a lunch hour but an even better way to spend an evening.\n\n--the parking is tight--","useful":0,"funny":0,"cool":0},
{"review_id":"_kBUPVy8wKyUTSMSRTlz8A","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"6zi7dAlnk7vgvlGbUMoKkA","stars":2,"date":"2012-12-14","text":"OK, the atmosphere is fun and festive.  Who does not like colored lights strewn about and awesome old rock band posters on the walls?  The floors were clean and the bar area was fun... a great place to meet a friend for a canned beer.  Yes, really.  And with a gut washer choice of one chardonnay, you will drink the canned beer.  Or the draft beer- but beware, the Shiner Bock was flat and not very cold. Disappointed, party of one.  Ok, Ok... so, you might enjoy a fun atmosphere on a great street to meet friends for... drinks.  But not dinner.\n\nI had the fried avocado tacos and the black eyed pea salad.  Both were bad.  The bean salad, and I love stuff like this, was swimming in salt and vinegar.  I think those were the only ingredients.  It was bad.  The fried avocado tacos (as a vegetarian this prospect sounded delicious to me!) were, ummm, tasteless. Which might be better than the black bean salad which might have benefited from being tasteless?  The queso was good.  But, seriously, who can't melt some cheese?  \n\nI like food too much to return here.","useful":2,"funny":1,"cool":1},
{"review_id":"MqTTA2Rjyv869IzwoX5ytg","user_id":"OQT9DjfBrzrwOEdVJjuYIA","business_id":"bT0Vjx-ylhz3OeYWlqxMXw","stars":4,"date":"2012-08-18","text":"I love this precious little spot.  Birds, and turtles, owls, snakes, frogs, butterflies... what is not to love?\n\nThey will get the snakes out on request for you (or in my case, my children) to hold.  They will also get the skunk out!  Apparently, they are a lot like cats-- and I must admit, my curiosity got the best of me and I did find myself stroking the coarse hair of the injured animal.  The butterfly garden is a wonder!  We also found turtles hidden in there.  My younger (5 y\/o) loves the puppet shows.\n\nThe staff is so friendly and knowledgeable! \n\nThe little play area gets crowded and lots of inattentive mothers can create quite a bit of mayhem... we usually skip this area.\n\nBring sanitizer, as little hands seem to find their way into the turtle water.  Eeek!\n\nOnce we are finished here, we walk on the nature trail to Freedom Park for picnic fun and play time!  We usually look for the grumpy old troll who lives uinder the bridge, as we cross into the park.\n\nThis is a great way to spend the day!","useful":6,"funny":0,"cool":1},
{"review_id":"g03YSyEswJF3XOVbJqe3QQ","user_id":"XLA3LkbfQfeA-VYO7Zgzyg","business_id":"VoYF6KnSnnhZ2lI4D9O-KA","stars":5,"date":"2016-01-02","text":"The best beef kebab EVER!! The meat is so tender and juicey - just be careful not to touch the bottom of the metal skewer when it arrives - it's super hot. Make sure to also order the garlic sauce and red meat sauce for dipping. It's a warm atmosphere with a very friendly staff. I've gotten many friends hooked on this place. 5\/5.","useful":0,"funny":0,"cool":0},
{"review_id":"1_ntTyrsYYYAy41nm3UD3Q","user_id":"XLA3LkbfQfeA-VYO7Zgzyg","business_id":"aAYl1-tsvP9Kzs7YESi8Rg","stars":2,"date":"2015-10-04","text":"Extremely disappointing.\n\nThis place had been on my To-Try list for a while now. I came with three friends on a Saturday night when it was not too busy. I ordered the beef ribs ($16.50) with a side of potato salad ($4.00). My friends ordered the pork ribs ($16.00), along with a few appetizers.\n\nWhat bothered me about the service was that they just sort of drop the food off at the table to no one in particular. Ideally, the server should place the dish in front of the specific person who ordered it, or at the very least ask, \"Okay who ordered the so-and-so?\" and place it in front of whoever answers. Also, delivery should be simultaneous. Two of my friends got their dish, and me and the fourth friend waited 15 minutes after that for ours.\n\nFor $16.50, I received TWO beef ribs with barely any meat on them. In my opinion, ribs should be fall-off-the-bone. These were the exact opposite, and the flavour was nothing special. My friend was even more disappointed with his pork ribs, and sent them back in exchange for the pulled-pork sandwich.\n\nFirst time in a very long while where I tipped less than 15%.","useful":0,"funny":0,"cool":0},
{"review_id":"5-yR9ZRd02OZFQwICwV3Kg","user_id":"mY2GaC-O0t4_2N27XO6CPQ","business_id":"7mFNJCgmZCiSjv2mzoP1Cg","stars":1,"date":"2016-05-24","text":"Ridiculous! The hostess seat us down with a major attitude because we asked to seat on a booth. She throw the menu down on the table, and did not speak a word to us. After that we waited 20 mins for a server to come to us. The services there was absolutely terrible! If you want your night ruined, then go there. The food was cold when it came out.","useful":0,"funny":0,"cool":0},
{"review_id":"ls8MhHG2EkUW6RB2-ZLbtA","user_id":"EfOhaQ-J5s9t2EmH0uBELw","business_id":"eBj_YyJU5jVu6tbZCkdtDA","stars":5,"date":"2011-09-24","text":"Brio is always a happy dining experience.  For this specific location, I've only been for happy hour, but I don't see how their regular menu would differ from their location at Town Square.  \n\nTheir happy hour must be one of the best!  They have a list of items for $2.95.  Don't let the price fool you though.  Their portions are decent sized.  We always order one of everything, and maybe even two of some other things.  (Don't judge us!!)  How could you not though?  Cheap, good food is so hard to pass up!\n\nTheir service is always amazing.  They check several times to make sure everything is okay and refill drinks before it is necessary.","useful":1,"funny":0,"cool":2},
{"review_id":"YA5W9vlM8fk3bNsJeXCITw","user_id":"EfOhaQ-J5s9t2EmH0uBELw","business_id":"CWhCFNnV60zdQo4c1GBWOA","stars":2,"date":"2011-09-22","text":"A couple girl friends and I ventured over for lunch on our break between classes.  One of the girls heard from some of her friends that this place was \"soooo good\".  Well, these friends of hers have either really low standards or just don't know the difference between good, quality food and junk.\n\nAll of us ordered the shoyu ribs ramen.  To say that it was disappointing would be an understatement.  The soup was luke-warm at best and it tasted almost sweet.  Ramen is supposed to be savory, so the sweet-ish soup was a major no-no.  The noodles were also sad.  It tasted like the instant stuff.  Gross.  Supposedly, their other menu items (i.e. gogi beef stuffed waffles) are supposed to be better, but that is a chance that I am not willing to take.\n\nTheir decorations\/furnishings were quite interesting.  The first thing we noticed upon walking in was their Transformer-like chairs.  They had some anime characters painted on the wall and had some anime show\/movie playing silently on a tv.  The place was insanely dark that we were blinded when we were walking outside to leave.  \n\nIt goes without saying that I definitely will not be going back.  I much rather eat Panda Express on campus.","useful":4,"funny":3,"cool":0},
{"review_id":"UHyP7y4t-mZ6tmq_lFZpwA","user_id":"EfOhaQ-J5s9t2EmH0uBELw","business_id":"DB9BRdu7is0AK1DvcuKlcw","stars":5,"date":"2011-09-04","text":"Five Guys FTW!!  This place is pretty amaaaa-ZING! \n\nWe usually get the bacon cheeseburger (I order the \"little\" since two patties on the \"regular\" would be too much for me).  I love the FREE toppings you get which include grilled mushrooms and onions.  I always  order mine with extra mushrooms as I am a mushroom feign.  They also pile on the bacon which is awesome since most places gimp you on that.  Their bacon cheese dog is also delicious.  I just wish they had sport peppers.  Oh well, you can't win them all.  \n\nTheir cajun fries are also a must!  I'm not a big french fry fan (especially the thick cut kind), but the fries here are to die for!  The cajun fries are extra addicting (which is probably why they have such generous portions).  \n\nThis place does not fail to disappoint and has grown to be our go-to place for burgers.","useful":0,"funny":0,"cool":0},
{"review_id":"6TbQQWS01lVfXpiDL9GK2Q","user_id":"EfOhaQ-J5s9t2EmH0uBELw","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":4,"date":"2011-11-10","text":"This used to be our \"go to\" for buffets.  The boyfriend and I decided to try it out when they first opened, and found that we enjoyed the pre-divided portions.  (Mind you, not everything was like that.  There were also food served the traditional buffet way.)  Apparently, you either love this particular serving style or you hate it.  We loved it.  Food and service quality were definitely up to par.  They have a variety of food and have choices available that aren't your typical buffet fare.  They also have a mac and cheese bar, which I loved since I am a mac and cheese feign.  I think the thing I enjoyed most was the desserts.  I'm not a big sweets person so I chose the French macaroons and the white chocolate dipped crab apples and strawberries.  However, for the people with a sweet tooth, they have a variety of gelato, fudge, cakes, and whatever else.  \n\nUnfortunately, we've heard that the food isn't the same as it was before so we haven't been back.  They also raised their prices (it used to be $29, I think).  It's now $35, which is a bit steep if I'm not guaranteed amazing food.","useful":1,"funny":0,"cool":0},
{"review_id":"aNZJwHFhErxEy6Mw5TUsoA","user_id":"D0rMhllY0wFtifIsDQYM4A","business_id":"TysP7COEyCzMTOTjk_sYrA","stars":5,"date":"2014-10-14","text":"I grew up in Glendale and I have always loved Cerreta's candy. I think the Cerreta family has put a lot of thought into the variety of their product offering and to ensure the highest quality of their ingredients. I feel that the candy itself is a testament to another time, the shape, size and taste transports me back to a time even before my youth.  I time I never knew but always imagined as better somehow.\n\nEven though some of the presentation of the products and dcor may seem dated, I sincerely feel that it is all part of the charm of this family owned business. I now live on the east coast, and try to swing by the store whenever I am in town to grab a box of French Mints for my office and get a few free samples while I'm there. It's always a hit with my co-workers. \n\nI also like picking up the individually wrapped candies, from time to time.  I find the factory store to have much more variety than the grocery store chains that also carry Cerreta's products around town. I have found this location to have a few more modern candy offerings, such as peanut butter truffle and mint cookie crumble. Everything is excellent here and if you are in the area, you should swing by. Life is short, what are you waiting for?","useful":2,"funny":0,"cool":0},
{"review_id":"rsZQTvCkoVloY7i5M_DQtA","user_id":"D0rMhllY0wFtifIsDQYM4A","business_id":"67Dl9MQcSUNU0OqgsaFs_w","stars":5,"date":"2014-10-14","text":"I grew up in Glendale and my parents would have Friday Pizza night, where we would get take out from Pullano's. I now live within proximity of Manhattan and have access to really great pizza. I try to swing by Pullano's when I am back in town, and I have to say that that the pizza still holds up after all of this time. It's nothing like the New York style pizza, but it's always really good. They have a thick crust, with a house made tomato sauce (that at times can be on the sweet side). They have a tendency to overdo it with the cheese but it still comes together well. I think it's a testament to the fresh ingredients. Overall, the menu is expansive and does not disappoint. See you guys next time I am in town!","useful":0,"funny":0,"cool":0},
{"review_id":"p2WnLi7Tj-2x9rqSOwHERg","user_id":"aD4iVmjokKSK8HDm-L-dlQ","business_id":"qSsUXOWF9W4sekeHVekuug","stars":1,"date":"2013-10-04","text":"Anyone looking to have their yard landscaped by this company WATCH OUT!!! This place is horrible to deal with and has NO communication skills!! My job was pushed back for weeks and nothing was communicated to me. On top of that I am now having to report them to my bank as fraud since they have yet to return the upfront money I gave them. Horrible horrible experience all the way around! I wouldn't even give them 1 star but that is the lowest it would allow me to select. I just hope my bank is able to get the money back soon from these rat b@stards!!","useful":5,"funny":0,"cool":0},
{"review_id":"kshbZ29ZiPtlDOyixi8Gjg","user_id":"s5LYD5-cU8ji2F-7yCYfew","business_id":"na4Th5DrNauOv-c43QQFvA","stars":5,"date":"2013-06-27","text":"Awesome price, came here for our anniversary, got a discount, great room, always clean, inside the hotel is he most amazing bakery and garden.. MUST SEE. Close to everything, watch fountains outside your window. Free parking and great scurity. LOVED IT!!!","useful":0,"funny":0,"cool":0},
{"review_id":"d_I9gHDXtJ987wL1joF_Gw","user_id":"i1pvdQh3C5GeTbMmcvHJ7Q","business_id":"oGTYDN6lzkBuFk3mTpFB0Q","stars":1,"date":"2017-07-04","text":"Terrible. They advertise the bar stays open till 12am but in our whole stay when we arrived back after dinner, usually before 11pm,  the place was all locked up. The hotel is under renovation too so don't expect the famed Ritz service for the medium future.\n\nOk next night gets even better we arrive back at 10.30 and guess what ... bar closed. No problem we order drinks in our room and they send us Macaroni and Cheese!\n\nAll this for a mere $400 a night!","useful":0,"funny":0,"cool":0},
{"review_id":"HhNBPMGbBQnJeqTsi_V5uw","user_id":"JNRDWUE5exH2mGjSqbUF7Q","business_id":"2CmLLrNHS_IBxzFllXx83g","stars":2,"date":"2015-12-20","text":"It was horrible, the soup tasted like it came from a can. You can tell it's frozen food. The prices are good but you get what you pay for. I gave it 2 stars only because the staff was outstanding. Think I'll pass on this place in the future.","useful":2,"funny":1,"cool":0},
{"review_id":"UC2474KYTL2DP1wR6qwvFQ","user_id":"JNRDWUE5exH2mGjSqbUF7Q","business_id":"CHFw_V836nIKpWtqMP4E5g","stars":3,"date":"2013-12-23","text":"Food was very good but service is below par. Wasn't crowded at all but still took forever for someone to seat us. Just a person yelling across the room telling us \"Someone will seat us soon\" I recommend it for the food but don't be in a hurry to be seated.","useful":0,"funny":0,"cool":0},
{"review_id":"kYqVueLaCEAHNDDG3j1Xtg","user_id":"IPRDLNnafj6Lxfh-CmVtGg","business_id":"Wf7AV7JbR52qABil0bU8NA","stars":5,"date":"2017-06-08","text":"Amazing view. Friendly staff. Outdoor seating goes quickly, but even sitting inside almost every table has an amazing view of the lake.","useful":0,"funny":0,"cool":1},
{"review_id":"ziAMZGx8QInZjqlDG4qRCA","user_id":"_0lqX3m25K6qEkbLlY4DLQ","business_id":"XvuUYiJYAAiNC4AmdbBZ8g","stars":5,"date":"2013-08-19","text":"Me and my boyfriend live on the same block and we have to stop ourselves from going there every day. The food and service are amazing!!! It is homemade Indian food full of flavour and made fresh. The owners are lovely people and every time we go there we love spending sometime just chatting with them.","useful":0,"funny":0,"cool":0},
{"review_id":"mIyMereUwhex_nDr63YOAg","user_id":"sOuFzmgPBoZO_da0ao0MXg","business_id":"_zTW9DhfQxU7HaVAu-Tsmg","stars":1,"date":"2014-12-16","text":"Went in looking for a good knife, as an Xmas gift. \n\nGot talked down to by the fat\/balding guy behind the counter (son of the owners?), saying the good knives (which were fully within my expressed budget) were for \"higher class people\", even mentioning every few minutes that all the kitchen stuff was final sale and he didn't want me thinking about a refund.\n\nThis literally happened a few hours ago. I've been there in the past, but unfortunately never had the pleasure of interacting with the lovable son.","useful":3,"funny":2,"cool":0},
{"review_id":"Swh8eQtbNdcuMyHP5OXkfQ","user_id":"sOuFzmgPBoZO_da0ao0MXg","business_id":"ELt26I6N0VqVywR5J4TMlw","stars":4,"date":"2014-12-20","text":"Been coming here for the lunch special every Saturday for the past few weeks now. It's usually pretty empty, but the food is tasty and fast, and the owner very friendly. Don't expect anything too fancy, just simple honest food.","useful":2,"funny":0,"cool":1},
{"review_id":"Ku0bs-MtWERfUmgw2jchMA","user_id":"sOuFzmgPBoZO_da0ao0MXg","business_id":"ALkOqlWODyxPg5VSp0HLrg","stars":5,"date":"2013-04-08","text":"Super solid. Arrived at 10ish on a Saturday night, had a cozy bench-table in ~15min, food was tasty, cheap biru, everything was clean. Ranks among Don Don & Guu for sure!","useful":0,"funny":1,"cool":0},
{"review_id":"oDyR6JoXffJap50oGIZuMw","user_id":"VJ88BrywqE-_n_7_UJMTbg","business_id":"tyVRfb_Xr7r9aQ73Q-NQXQ","stars":5,"date":"2013-06-30","text":"Dufferin Park is one of the top parks in Toronto. There are plenty of old grove trees that provide shade for the playground area but there are also sunny fields to spread out a blanket for sunning or a picnic. The organization that runs this park does an outstanding job of holding unique family events like puppet shows and movies. It has a rink, a wading pool, a pizza oven, fire pits, a gigantic sand box...for a kid it really does't get better than this park!","useful":0,"funny":0,"cool":0},
{"review_id":"QWWLdWa3srs0ibN8dnK6Aw","user_id":"aGgv8QmMT-kpp_gy6mcjiA","business_id":"dNMYNKhAAKo5O4WfrAPzcQ","stars":5,"date":"2016-02-03","text":"Very nice and modern dentist office with a top notch staff!  The experience definitely put my anxiety of going to the dentist at ease.","useful":0,"funny":0,"cool":0},
{"review_id":"E0v0r4hqhYFKdiMXosXtTA","user_id":"nND2klG0KoIEvnrLyKzQTQ","business_id":"owLXnEhlMLsFpemYoOxNkg","stars":4,"date":"2011-09-04","text":"Stayed here for a few nights when I arrived in LV and loved it. The suites were amazing....the pool was sooooooooooo nice. We went swimming at 10pm and it was 103!! Very relaxing. The staff was on point, they even loved the dogs....lol.....Its a vew blocks off the strip and reasonably priced. Find them on hotel.com","useful":1,"funny":0,"cool":0},
{"review_id":"OOj9B9A_56rI7TEMYwYvhA","user_id":"nND2klG0KoIEvnrLyKzQTQ","business_id":"t5LFQy9h9IpWfFfcMwQT4w","stars":5,"date":"2011-09-04","text":"Other Auto shops need to go to these guys and take lessons!!! I went here with my son to get his car repaired....oil change and serpentine belt changed....first off...they have a special for the holiday ALL WORK HALF PRICE......and second...the did the work wihtin 15 minutes.....they were clean...mannerly and  helpful.....VERY KNOWLEDGABLE...other questions about the car were answered intelligently.\n\nFrom the manager to the ladies in the office...THESE GUYZ ROCK It out!!","useful":9,"funny":1,"cool":0},
{"review_id":"aefWon7MeIoGpsLG5iwZ5g","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"F1VasoCjLgA079A21nQIvA","stars":5,"date":"2013-08-25","text":"I have 3 competitive bird dogs as well as breed occasionally.  Dr Sondel was already the best vet I have had the pleasure of working with.  Now that he he has ventured out on his own he has taken vet care to a new level.  His new clinic rivals modern medical facilities for humans.   Nicest facility I have ever seen!  Jesse is for people that want the most advanced care with an honest\/pragmatic approach.","useful":13,"funny":0,"cool":2},
{"review_id":"dnrcOZK4UXIXPy3Uf66xZA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"LhU-XsZ2YObJnP-5uiMIjA","stars":5,"date":"2014-03-31","text":"Same as other habanero's.  Best damn quesadilla money can buy at a really affordable price.","useful":0,"funny":0,"cool":1},
{"review_id":"pXyvNnfENxdsAZGVJZXroA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"wX8btbqgyFh0yHgmyR8ovA","stars":5,"date":"2014-12-19","text":"Great service, great food, and incredible fried ice-cream!  I like the sun dried beef a lot.  Happy to have this place in my neighborhood!","useful":1,"funny":0,"cool":0},
{"review_id":"CXSBfX-4fCWGngtysdhPpQ","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"4XGjbI2Ggi-kdgt9eZR83w","stars":3,"date":"2011-03-04","text":"Safe bet for a cheap buffet .  Nothing blew me away but the price is right.  Nice service and cool fish tank.","useful":0,"funny":0,"cool":0},
{"review_id":"FRh3yuD3uunzqxTbEqN9ag","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"dei67jnanWpRLRL7aRwqAA","stars":1,"date":"2011-03-04","text":"They said I needed a timing belt replaced when Honda Civics from 2006 don't have a timing belt.","useful":6,"funny":3,"cool":0},
{"review_id":"r6GdPfGtXbcEud4-iIdiGA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"Zzvjuyxr1iudPN_heAAygw","stars":5,"date":"2011-07-19","text":"The Salomon salad for lunch was simply the best food I have eaten for 11 bucks.  The service was fantastic.  Sometimes I wonder if people who complain about bad service receive bad service because they are not the friendliest people themselves.  I also was here for a grooms dinner and there wasn't a complaint in the party.  My beef tenderloin was awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"lbkNRnKXFAEQmSBPDxo7Jw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"rcGjCTd9wYPBv6Szslti-Q","stars":5,"date":"2013-09-24","text":"Twisted fitness is a special place.  The instruction is world class and the team\/community built around it is incredibly positive.  I started Jujitzu a year and a half ago with no previous martial arts experience.  Since then this school\/gym has become one of the most important aspects of my life.  Twisted has challenged and pushed me in ways not comparable to any gym i previously attended. If you are looking to get in shape, learn to defend yourself and expose yourself to the beautiful sport of Jujitzu there is no better place to join.  (My previous sport was tennis so please don't think you can't try Jujitzu)","useful":4,"funny":0,"cool":2},
{"review_id":"cAMTFx8iwWM1z0PT8KINGw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"B7a5Gknl7QAYKLCV33w6IQ","stars":2,"date":"2011-07-26","text":"I tried to get a home loan here and they never got back to me.  Anchor bank down the road was happy to help.  Disappointed that my home town bank didn't take me seriously.","useful":5,"funny":1,"cool":0},
{"review_id":"8ok7nmMATfhg1zbXok-_wg","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"YSUPAkyni4qpcHfrMOAEww","stars":5,"date":"2013-09-13","text":"I like to come here to focus on a project.  Great coffee house vibe.  The staff clearly likes being here.  Everything is unique and delicious.  I had the soup of the day.  Baja chicken.  Excellent!!!","useful":2,"funny":0,"cool":1},
{"review_id":"6rId0GkjJ_8_pULwN8RV0Q","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"NYf9TKBKPpa1wkA_uwIlfg","stars":4,"date":"2011-03-04","text":"One of my favorite places in Madison.  Tons of character with good food and drink.  Service is good.  Bar is very cool.","useful":0,"funny":0,"cool":0},
{"review_id":"A6YNKGEIJ2paX5JGBd6FLA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"jx3fLDLunReaFpBMKldurg","stars":2,"date":"2011-03-04","text":"Went here for a routine check up  and wasn't impressed with the service, facility or prices.","useful":3,"funny":0,"cool":0},
{"review_id":"K4Q574jOsfKLPKkLK7JKqw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"FzWPma3eYLFPger8npNvdw","stars":3,"date":"2011-03-04","text":"Spring Harbor has changed direction since my previous review.  Dr sondel was my reason for being there.  He is gone.  Not a bad place, but not the best anymore.","useful":4,"funny":0,"cool":0},
{"review_id":"xx0JXNPadRM82XR-_UBOWw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"xVpE01l6ZXdEtVf5PkRpDg","stars":5,"date":"2015-12-31","text":"All aspects of the experience exuded high quality and care.  The food, service and atmosphere were unique, thoughtful and added to the great dinner I had.  Great addition to Madison!","useful":0,"funny":0,"cool":0},
{"review_id":"ODriYcxb0OQv4oUrN54TJA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"sdfmHavBrOZMMsiBv2sg7g","stars":2,"date":"2011-07-26","text":"My wife and I came here trying to diversify our restaurant portfolio.  Food across the board was okay.  Lettuce a little brown, rolls very out of bag from store feeling.  Many things lacked flavor when the creative names and combos made me expect something bold.  I'm not sure what some of the yelpers liked so much ?  The snickers pie was blah.  My salad was plain.  My wifes quiche was like a frozen pot pie. I liked my app, but not so much I'd order it twice.  The only thing we like was our butter finger shake, but madison has a few thousand places to get custard.  Our server was nice and helpful, but lacked courage in guiding our selection.  Not a awful experience, but not very good.  Would not give 2nd try.","useful":0,"funny":0,"cool":0},
{"review_id":"3rm8lrS9uTC24UP2JuujLw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"hBROX8RGSUYXDJAF97OV_A","stars":1,"date":"2011-07-19","text":"Cleanliness inconsistent.  Price high for some low for others.  Equipment all over the board.  Basketball crowd @ the EASTSIDE location is not friendly. Carpet in locker room is just not right.   Better options in town.","useful":6,"funny":0,"cool":0},
{"review_id":"mlhp9_Qpr_KKEcRB-uohrQ","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"M0pXDKKvnM5sc7ceisBD4Q","stars":4,"date":"2011-03-04","text":"Good.  Not great.  Very consistent and attentive service.  If you need sushi and a seaweed salad it is the place to go.","useful":3,"funny":0,"cool":0},
{"review_id":"wg8wrJE1e5y17F56jv8KNw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"wwnuIvnVLgpEZOKzcdfDhw","stars":2,"date":"2013-09-28","text":"I have been here a few times with an okay experience.  Today I ordered 35.00 worth of food for 2 people and toddler.  One order was flat wrong and needed 2 sausage patties added to the plate.  I kindly pointed the mistake out.  Pointed to the menu which supported my claim and she declined to make it right.  The person behind me then told her she was wrong and she correct my order.  I left and went back to eat my food with no resolution to the issue.  Then the front desk girl brought out the carbon copy and told me why I was wrong while my two year old is having a meltdown.  I then told her I didn't want to Argue and asked her to leave.   5 min later as we left the sausage showed up and no boxes ( requested 2 times) were brought to our table.  Go to crema and support good service and food.","useful":3,"funny":0,"cool":3},
{"review_id":"OSGkpByQp38wi1DIfuig7w","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"9SvAcGdswHs88kA6HHaC-w","stars":5,"date":"2011-08-20","text":"This is one of the last \"real\" service stations left in Madison.  The guys at this place are the type you build a relationship with and they take care of you.  I recently had a quote for my truck that was quoted other places for 1500 to 2000.  They worked their magic for 600.  The next day when grabbing gas for my boat and jet skis ( no corn gas available here) I had a lock on my trailer that was jammed.  They cut it off and told me to have a nice day.  No charge.","useful":8,"funny":0,"cool":0},
{"review_id":"5kMnY9eUsskyknVszeqWQw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"wuQDMDlqM17jQNo0lYQZ7g","stars":5,"date":"2014-06-23","text":"One of the best experiences I have had in Vegas.  Food, drink, decor, outdoor patio and vibe.  The chicken and waffle sandwich was great.","useful":0,"funny":0,"cool":0},
{"review_id":"qRZq5UEIFUawBc3i1TPR4w","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"DHiXfpd_vSfCCeFXPSucTA","stars":5,"date":"2014-04-28","text":"This place is great. The name, the owner, the food, the coffee, the cleanliness, the vibe, etc.  I had the special cold brew, quiche and the breakfast sandwich.  All perfect!","useful":1,"funny":0,"cool":1},
{"review_id":"tk9UGvIeTjfpV9sgK3CtOQ","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"LjSM0o6KR00zP-cl1SHlwA","stars":4,"date":"2011-07-19","text":"Great gym, nice staff, good trainers, I tried a yoga class, instructor was awesome.  The salt water pool is great.  Always clean.  Need more weekend hours and a heavy bag.  My wife loves the cardio cinema.","useful":0,"funny":0,"cool":0},
{"review_id":"q_iD4bhSviFn7LvqVyzDuQ","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"paNjgpMDRhNzBj6xzhHPVQ","stars":5,"date":"2013-08-26","text":"Best quesadilla I have ever had.  I go with steak extra meat with hot sauce and sour.   Real coke.  Sure the place isn't fancy.  But I'm reviewing food darn it!  And its great!","useful":2,"funny":0,"cool":1},
{"review_id":"zU4xciYe_AaoObASK5E-XA","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"YLwXQbMN-4NvUs_U8brP-w","stars":4,"date":"2014-06-07","text":"Green tea in a can.  Solid sushi.  Unique atmosphere.  The person who brought out my  sushi cared that I'd liked everything.  Good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"bdBIdDGgiVYXX6LMQr7kMg","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"rIgbi8lCr85UIKSQDVetZw","stars":1,"date":"2014-12-28","text":"If this place wasn't on the  lake\/channel it would be out of business.   Crap food, blah service.  Avoid.  Nice outside deck.  That is why it gets a star.","useful":4,"funny":0,"cool":1},
{"review_id":"ETnHErkDD0waB7DXKqxirw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"wsmVIHJEi9J_38dXx2qLKA","stars":4,"date":"2014-05-01","text":"It's good.  I thought it was on the right track.   Everything was solid.  Deviled eggs, chick sandwich and komboocha tea. Nothing blew my mind,  I'll go back and see what the evening vibe is like.  Glad to have it in the neighborhood.","useful":2,"funny":0,"cool":1},
{"review_id":"hNAith0lrpt9DTM1iEESaw","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"_n7WS5jqFs89WHOINineqg","stars":3,"date":"2014-07-11","text":"I want to start out by saying I'm going to give this place a second try for sure.  But if my yelps aren't honest they don't mean anything.   So here we go.\n\nThe space and view is excellent.  Great vibe and view.  The problems started with my order.   I ordered the quiche of the day and sat down.   15 min pass and they came to my table and said they were out of what I ordered.   I switched to what's left, no problem.  Another 15 min passed and I went to the front and they told me it was a very busy day and that it was almost ready.  (It was less busy than an average lunch rush at most places I have been in town.) When I finally got the quiche it was cold and blah.   I hope to try again and experience what everyone is talking about.  It stands on 3 stars for being a cool hang out.","useful":5,"funny":0,"cool":2},
{"review_id":"0IDsjVimXLlaY_wKUL3ZEQ","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"Kvr3maTyGSS9Xo_nhsEvrA","stars":4,"date":"2013-05-13","text":"Good local shop.  I haven't experienced any racism like jayson and can safely say after LONG conversations with a very interesting owner that they are NOT a racist bike shop.  Madison maybe a bit on the hyper-sensitive side when pulling the race card.","useful":2,"funny":0,"cool":1},
{"review_id":"-5LANRkGm8Y8SRCUdbE0Bg","user_id":"FHwl6kaKdD5-KAnfVb_pKQ","business_id":"krsjoEks-XF-PLKjOJW66A","stars":5,"date":"2016-12-31","text":"Chef Dave plus an amazing atmosphere equals my favorite spot in the 608.  Huge beer list and great fish fry. Never had a bad experience.","useful":0,"funny":0,"cool":0},
{"review_id":"caHQiDwI7N9GyFRfOeOk5Q","user_id":"KA3YwBSc1oqe7SzHErshJA","business_id":"gqdqnFg2lYeSyS20q2ZK_Q","stars":1,"date":"2014-04-14","text":"I'm no sure if we got a bad box or not...but these are the most disgusting pastries I have ever had. Four of us shared a mixed box and sampled each one. Everyone of us gagged. One person spit the lemon from the lemon meringue across the room. This will haunt me for years!","useful":0,"funny":1,"cool":0},
{"review_id":"dcva2qGxSqvn5iwSOBzvHA","user_id":"G48saj2SXOgP4BAUabIPAg","business_id":"68O4uYCd0YToLOLqHTBSZQ","stars":5,"date":"2013-04-29","text":"Jeff's show was hilarious!!! It was the highlight of my weekend in Vegas! Jeff engages the audience throughout and is simply very funny. I laughed for the entire hour performance! His juggilng isn't bad either! I would absolutely see this show again and highly recommend it for all ages! His opener, Turf, was also fun to watch and his crew was awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"CqXpUDDdnes8E1cVAXJ--g","user_id":"G48saj2SXOgP4BAUabIPAg","business_id":"ObA-QNMqnv9X9g06zoDP3Q","stars":5,"date":"2011-06-14","text":"I love the powter puff boutique. Everything there is super cute and their is something for every budget. I bought the best blue ruffle dress for $50 and a gorgeous necklace for $23. I get nothing but compliments on both. Sometimes the stock is low, so I try to check facebook first to see when new stock has come in. Brooke is amazing, and super super helpful. I can't wait until my next visit to see what's new!","useful":0,"funny":0,"cool":0},
{"review_id":"jKaehzMhYR5ztghbdcfWIQ","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"DblaHOPFkdqKNMXlSOzw7Q","stars":2,"date":"2012-06-10","text":"I brought in two cats to get groomed today, they were extremely nice, fast to book, however when I got home I noticed a huge amount on them and they weren't finished drying. I expected one of the cats to still have shedding, however the other cat  gets groomed regularly. I noticed that they were using furminstors which I have been told isn't good for cats because it just pulls out more hair. I got home and brushed my normally groomed cat and I've never seen her so bad. I think they just pulled out the hair without trying to brush it out. I'm unfortunately disappointed. I will be going back to Petsmart. They did have a challenge with the other cat however because of the amount of hair. She looked like a different cat when finished. However in the past taking my other cat to get groomed I can pet her without getting lumps of hair or not seeing loose hair.","useful":6,"funny":0,"cool":0},
{"review_id":"bvQjQ2hypECMPEmqjBNkcA","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"h5qBxa_L-pIdNSOBQxTNGQ","stars":1,"date":"2013-01-13","text":"If I could give negative stars I would.  Their pizza is not that great, go get yourself a five dollar pizza for better taste.  They mess up your order, and when you go to call to get it fixed they tell you, \"I really don't care sweetheart.\"  Don't waste your time unless you like shitty food and liked being insulted with it at the same time.","useful":3,"funny":0,"cool":0},
{"review_id":"tS-Yzg6ptY3jKsufVWc_9w","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"thlQQwjsT6RmoqzoD87UqQ","stars":5,"date":"2013-02-16","text":"I absolutely love this place!  By far the best salon I've ever been to!  Yes it's pricey, but they disclose all the charges to you before they start their work.  I've been screwed over multiple times by hair salons, but they are very honest upfront about their prices.  I spent a lot on my hair, but I was also box dying it for several months which they had to correct, and I didn't have a hair cut in six month prior to coming here.  Jenn did my hair, and she did an excellent job.  Some may not like that there were passed off to different people, but I didn't mind it at all, it gets things done much faster.  The essentials are done by the person you are originally set up with.  I bought a lot of product, which I was given an awesome discount on, and Jenn put some of the red hair dye in my conditioner while sending me home with gloves as well!  I don't care what anyone else says, I would totally recommend this place!","useful":1,"funny":0,"cool":0},
{"review_id":"S0ureIixZBkhCvbrtntGdQ","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"16tWXenJ1wTqugXJU7yiZg","stars":3,"date":"2012-06-24","text":"Decent place to go, only reason I give it five stars is because of the prices.  During happy hour, rolls as low as 2.75, I had three and found myself full.\n\nTaste, like any other sushi place.\n\nI subtracted a star for the attitude I received from the servers.  One however was extremely nice and made sure my cups were always full.\n\nWe walk in, I wanted to sit in the back, and the woman who seated us had us sit where an employee was eating and kicked her out of the seat...right in front of us.  I felt extremely uncomfortable and felt bad.  Then as we sit down, a man came out and said something to the waitress and looked at us and said, \"You took my table.\"  I almost wanted to walk right then and there and say, \"Oh okay, here is your table, we'll go where they welcome their fucking customers.\"  ...but didn't.  I told the woman, that we could sit at the table next to us and not have anyone moved or their table \"taken\".  Her response? \"We need that for the bigger parties.\"  That table remained unoccupied the entire time we were there.\n\nIf their prices weren't cheep and the sushi wasn't decent I wouldn't have been back. :\/","useful":0,"funny":0,"cool":0},
{"review_id":"cWKz6xtgzgTE4GyqmMMYBw","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"K5XjxDyq3ZIjUhbtLaW4ZQ","stars":4,"date":"2012-06-24","text":"I'm not sure why there are so many negative comments, I had a good experience here.  The main reason I tried this place is because of the location, only being about 5 minutes away from my house.  Christina did my nails, extremely helpful and nice.  She took her time to get me the the exact color I wanted, talked to me and offered me a drink.  I went in an hour before closing and the receptionist was afraid I wouldn't be able to squeeze in a pedicure, but Christina was fast and efficient to make sure I had enough time.  Another woman (I forgot her name :( ) did my pedicure when everyone was already packed up and ready to leave so I really appreciated that.  It seriously was the best pedicure I've ever had, all the tough skin I had on my feet gone.  A lot of people complain about the laziness of the owner, but I didn't see him fooling around.  A nail lady's phone was going off and he was attentive to put her ringer on silent, and sorting through the receipts with the receptionist. \n\nOnly downside...the owner of the place was there today, and a bit standoffish.  I wouldn't say rude...but not friendly.  He interrupted my pedicure to have the lady check a yelp review (I'm assuming) because it was regarding a complaint and it was in a different language she could understand.  I didn't mind but it seemed unprofessional.  He kind of was staring at me, so I just said hello and he ignored me. :\/ I would have given it five stars.  However, I work in an office, and a lot of ladies ask about my nails since I'm constantly working with my hands, and I will recommend this place and Christina!","useful":1,"funny":0,"cool":1},
{"review_id":"aBOLg1RFvpDeCAKdPO4Rfw","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"ZtsnwjxjzMUI6tDZNrJUeA","stars":1,"date":"2012-06-10","text":"If there was an option to give this place negative stars, I would.  First of all, you walk in and even in the dining area wreaks of smoke.  So you push that aside thinking your steak will be good enough to bare the smell.  Nope, ordered a medium rare, still tough as nails.  I ordered ONE drink, the same exact drink I ordered at Tex Mex down the street, a smaller portion for literally double the price.  Tex Mex $5.00, this place $10.00 for a vodka and seven up in a smaller glass.  Then, I asked for a side of ranch, charged me for it.  This place is ridiculous.  What are you? Gorden Ramsy Steakhouse?  Get out of here, your food sucks so don't charge me extra for ranch to try and get the leather tasteless steak out of my mouth.","useful":1,"funny":1,"cool":0},
{"review_id":"9c6nf4kocK1pWo8k67L8fg","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"VnZ7QP7OnJD8dJIFk91-Yw","stars":5,"date":"2012-06-10","text":"Best vet ever! We drive all the way from mountains edge just to update our cats on their vaccines because we only trust him!!!","useful":1,"funny":0,"cool":2},
{"review_id":"6amCsEd7iyyyh6_ZPnMlqg","user_id":"Rr4nRgrl3JVJPdDSz4__PA","business_id":"DBcBz2b8c4eHHxAzln3gog","stars":1,"date":"2012-06-25","text":"If you want your ice cream served by rude bitches, by all means, go here.  I went in with my fiance and friend after eating at the Thai restaurant a few feet away.  The three of us walk in, my fiance wanted a peanut butter shake.  \"We don't have peanut butter ice cream, but we can put peanut butter in the shake, what kind of ice cream do you want?\" He ordered the chocolate malt ice cream.  Then I order, then my friend goes to order, and as Sammy the \"leader on duty\" walks out my friend goes to tell her what he wants, but instead is told, \"Oh she'll help you when she's done.\" and helps the person after him.  I don't know, maybe I'm not sure how a line is formed and serviced, but I thought it was on a first come first serve basis, but apparently at Cold Stone, it's every OTHER person in line...who knew?  Anyway, my fiance goes to try his shake, and low and behold...no peanut butter.  He goes to the register and just simply asks, \"Can you add peanut butter to my shake?\"  Sammy looks at the ice cream scooper who took our order and asks, \"Did he ask for peanut butter?\" ....she says no.  Seriously little girl?  We were all there, we had a discussion about not having peanut butter ice cream...how can you try and manage this lie?  So as I'm explaining to this girl to try and refresh her memory about our order...Sammy rudely interrupts and says, \"Well it's going to cost more to add peanut butter.\"  We all just looked at each other shocked and the girl who took our order stated, \"My bad.\" as if she really thought that was a proper apology.  Wow.  So we all walked out.\n\n I will not be coming here again, just because I'm worried for MY well being.  I wanted to throw my fiance's shake at Sammy aka leader on duty's head for being such a rude brat.  If they were a little bit nicer, and actually acted like they cared because I don't know...that's your job working in customer service...I wouldn't be so bitter about it.  If any of you ladies are reading this, please remember you aren't going to get too far with that kind of attitude with anything you do in your career. :\/","useful":7,"funny":2,"cool":0},
{"review_id":"zPRRy6tQZQEAP46IGQn_8Q","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"3VvPKmr-6LXJ7aWlFtp4Yg","stars":4,"date":"2013-05-20","text":"I've been waiting for Live Market to open for a while. From the moment I saw the familiar \"Live\" sign appear in Liberty Village, I've been waiting. They opened in the week I was out of town visiting family, so for a week, I watched from a far, watching my friends post pictures of the various things they had bought, and ate,  looking forward to being back in my hood of Liberty\/Niagara so I too could eat this stuff too.\n\nLive Market is conveniently(?) located right near my gym, so I have been here three times in a fairly short time period, and it's nice to have such a great post-workout option, and really extra nice to have a close non-starbucks coffee\/tea option near my house.\n\nBoth times I've actually ordered food, it's been very very tasty. First time - the chickpea burger, second time, upon the recommendation of the server - Burdock Burrito (Do order this. It is yummy.) Live Market also keeps me in Silk Road earl grey tea. I've had the wherewithal to arrive shortly before the influx of Liberty Village work folks coming in on their lunch break.\n\nI often feel like the best way to tell the service level of a restaurant is how they handle minor errors. My partner ordered and ended up waiting a fairly long time for his lunch order, so not only did they make it right, they apologized, and offered him a coffee for his trouble. Smooth. Empowered staff make me a happy camper, so we just left liking them even more.\n\nThey've got Ezra Pound roasted coffee, and prepared ready-to-go items, juices, snacks, and treats, as well as order-in items if you have a little more time. \n\nThere are lots of locally made products like ChocoSol chocolate, Stasis Preserves, Bunner's Cookies, Sweets from the Earth treats, amongst other things. You can buy protein powder, tea, coffee, and even make up. They also have jars of Rawtella for sale, which I wouldn't call \"healthy\", but I would call really really delicious (since I did end up buying some on my last visit...)\n\nService has been consistently friendly, food has been consistently good, and I feel like I get good value for my money when I go there.\n\nThings to know: They don't have debit\/credit working yet, but it's coming soon. I.E., At the moment it's Cash Only.","useful":2,"funny":0,"cool":0},
{"review_id":"KPfapMni5c1zXRA5az3wOg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"1Lm1euBdgzxuPGjJbHTudg","stars":3,"date":"2013-04-02","text":"Like most Veg-o's I was a little sad when Fressen announced they were closing. Not because I particularly liked it, but because it was the main option for a slightly fancier totally vegan night out, with wine (the other tasty option being Vegetarian Haven, without wine.)\n\nA group of 7 of us went on their second day. Is it too early to do a review? Maybe. So take it all with a grain of salt. I hear things are still \"evolving\" and the menu might change. More desserts might appear. Anything could happen. \n\nThe Bar Snax menu looks interesting, and the idea of being able to have drinks and vegan snacks at midnight or 1 am, is promising, especially with Bar Chef next door (which has zero veganizable food options at all according to the last time we went...)\n\nThe Grasslands interior and drink menu is the biggest change when compared with Fressen. And those are really nice improvements. It's brighter, while still being intimate, and has a more open feel, with less cramped seating. \n\nAnother pleasant change is that the servers all seem friendly, and generally helpful.\n\nFood is very Fressen-like, so if you liked Fressen, you will like Grasslands. I had a favourite go-to dish at Fressen.  I ordered the skewer and liked it. Everyone else ordered the seitan roast or the chicken. Bar Snax menu is the biggest change from the former, and it's full of crispy and bite sized options.\n\nMajor problem on our first visit was that we went in a group of 7, which means an automatic gratuity of 18% was added to our bill. But there was nothing on the menu to indicate this, the person taking our reservation didn't let us know, and the servers didn't mention it. Since we're decent people, we obviously added a tip, and so, double tipped. Womp womp.\n\nI'll leave out the Facebook page drama that ensued after we commented about it on their page, but regardless, they did not handle the comments well, and shut off posting on their page entirely. Hopefully it was an educational experience.\n\nTo sum it up: Food is okay. Service is good. Bar (and associated menu) is great. Interior is great.","useful":10,"funny":2,"cool":1},
{"review_id":"xjUv6EeU_6wRbfmoW_oxoA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"WYG7xp_UO12qf5_qRLBQHw","stars":3,"date":"2010-10-24","text":"Since this place is one of the Indie Coffee Passport stops, I skipped buying my typical latte and ordered a (vegan) soup instead. I asked the server if the bread that came with it was vegan too, and he said he didn't think so. \n\nNow, this is the part I really liked. He quietly gave me a bit of a discount on the soup (which is normally 3.95) I thought that was a nice (and unexpected) touch. He was very friendly in general, and asked me how my soup was when he walked by later. \n\nI wish they got their vegan baked goods from somewhere other than \"OMG Baked Goodness\" because I can't support that place at all. Please get some Sweets From the Earth!\n\nIt's got free wifi (yey!)\nIt charges extra for soy milk (booo!)\n\nThe soup was decent, the first bite was kind of oddly sharp and unpleasant, but by the end of it I was really enjoying it, so I think I'd probably order it again.","useful":1,"funny":1,"cool":1},
{"review_id":"ovXJotrA7x7kq8MyaIfEvA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"nUVnnr5dYTXLLFwiCAp22Q","stars":5,"date":"2012-02-08","text":"Today I successfully made a pillowcase. I'm so proud I had to tell Yelp. But seriously, I love this little store, and I'm sad that it took me so long to visit, but I anticipate visiting more frequently in the future.\n\nI took the Basic Sewing Essentials class on a whim, and now I can't wait to take more. The classes are small (just 6 people) and easy to follow. The instructor was helpful, with good advice on troubleshooting machine problems, threading issues, and other sewing machine stuff. I left feeling like I had learned something that I could actually do again without  being confused. Karyn, the owner, was our instructor and came around regularly to check on everyone and offer help or advice.\n\nThere is a store dog, and initially, that was weird, but in a good way. I usually don't like dogs, but this one is laid back, friendly (but not too friendly) and spent most of her time on the couch in the back. \n\nThe fabric selection is awesome. So many different colours and textures. They have fat quarters in various styles and colours, notions, patterns, and other supplies.\n\nReally positive experience, and I would recommend it if you're looking for fabric, or if you're looking to start taking sewing classes.","useful":5,"funny":2,"cool":0},
{"review_id":"GBDHc0_hT12_PvM8NONBaQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"M-UEi9A08B4URLfrsql3BA","stars":1,"date":"2012-04-25","text":"Their \"Vegan Delight\" wrap has Havarti cheese in it? You suck Itz A Wrap. Will not return. Ever. And apparently they've had the sign up since at least last year?\n\nI'd give it no stars, but it's not an option.","useful":1,"funny":2,"cool":0},
{"review_id":"sQlDlTNl8qSciIUQOzFdUw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"nhfZW6Pi-oLQuhYcrcZJWw","stars":5,"date":"2010-10-05","text":"I ordered a soy latte and it was PERFECT. Just a perfect cup, the flavour was so smooth and delicious. I walked in mid barista banter, which was pretty entertaining, and while the space is really small, I managed to come in when it wasn't too busy and got a seat.\n\nI really want to try the siphon coffee sometime.","useful":2,"funny":0,"cool":4},
{"review_id":"ezMtw-e85E-GPHAMAUQiIA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"y8JvM_qahiCA12shK5vPJQ","stars":4,"date":"2011-03-01","text":"I dropped into this wine bar for.... surprise.... a glass of wine. I had checked out their menu online earlier but opted not to order anything solid. Though they do have a couple of small veganish options.\n\nEight has a modern decor, good atmosphere, and while I was there, a live DJ. There were television screens in the wall playing oh so hipply distorted Alfred Hitchcock movies.\n\nWhen I walked in it was mostly empty, the bartender was friendly, and the service reached that delicate balance of attentive but unobtrusive. \n\nI ordered a terrible wine, the name of which I have forgotten, but that's not their fault. I picked something local and cheap. They have a great wine list, available by the glass or by the bottle, so you're bound to find something to enjoy.\n\nThe server was kind enough to keep offering to fill up my glass of water at least 5 times after I finished that 1 glass of (terrible) wine. They weren't exactly busy, but there wasn't a moment I felt rushed out of there and it was appreciated.","useful":9,"funny":7,"cool":7},
{"review_id":"H9BpJnQ9Zy90Ib6qGA3DZw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"dgpPVSFL84ONx477Lln2sw","stars":4,"date":"2011-01-12","text":"The first time Merchants of Green coffee was recommended by a barista at another coffee shop, I put it on my mental To Visit list. She had mentioned that it didn't look like a place you could go inside and drink coffee, so I was slightly more prepared for the remote location, but I still got lost on the way.\n\nUnfortunately the day I went in, they had run out of regular soy milk, and considering I've been ordering a soy latte from everywhere... that was a bit of a disappointment. They don't have soy milk, so one of the barista's happily suggested 2%. I'm not sure how that's an equivalent option, but (obviously) I didn't go for it.\n\nLuckily there was someone else there, and he offered me a very awesome tasty latte made with So Nice soy creamer (which is a lot thicker than regular soymilk). He warned me it might be too sweet. But no, it was delicious and a great cozy cup of coffee (and now I kind of wish people always made me lattes with that heavy soy creamer...).\n\nWandering through their location is a bit like visiting a mini coffee museum.\n\nI'd like to go back again and try just a regular coffee from Merchants of Green Coffee or take one of their coffee workshops after I've completed the rest of my Indie Coffee Passport Stops.","useful":2,"funny":0,"cool":3},
{"review_id":"51L4yFwq6KKV7VdAxrG_bw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"M2E6gfRD1toJFgR0UumddA","stars":5,"date":"2010-11-15","text":"I had a great experience at the Wind store today.\n\nHonestly, the store was a madhouse when I got in. There were over a dozen customers inside and 4-5 customer service agents in the store.\n\nBut, I waited only around five minutes to talk to someone, and in a little over 15 minutes I was set up with a new account, with the plan I wanted (at 50% off for 6 months) and a new phone (on WindTab). \n\nDaniel S was super helpful, gave me all the pertinent info I needed, answered my questions, and hooked me up with a phone number I might actually be able to remember. Everyone working in there seemed friendly and approachable, so that's a plus.\n\nThat is what customer service should be like. \n\nOverall, I was really satisfied with the customer service I recieved, and so far the coverage has not been an issue (for me). I haven't seen \"Wind AWAY\" at all yet. Surprisingly enough, I can use my new phone in places I couldn't use my Rogers phone (like... the elevator in my office building...)","useful":7,"funny":0,"cool":3},
{"review_id":"1zEqp7KhU1xZUvhccddtDg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"EVSfdVw1j-kr3Pn9K08Ruw","stars":3,"date":"2012-11-02","text":"Once upon a time we came here for a birthday party. There were around ten of us, and we'd reserved a space.\n\nMusic seemed subtle enough, and I liked their selection of drinks and vodkas. Staff was polite and friendly, but it was difficult to actually order as we were left alone for long stretches of time. \n\nMost drinks were delicious, some were total flops, at least for my palate - if we come back here again, I'll be sure not to feel too experimental.","useful":1,"funny":0,"cool":2},
{"review_id":"jk9POXdfBbBfLTjgO8YFFg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"cRMC2eQ9CP6ivhEY8EdaGg","stars":2,"date":"2011-03-03","text":"I guess I'm not excited about this place because for me, it not only has limited options, it doesn't actually have a good option. The \"Juicy Vegan\" is one of the most expensive items on their menu, and when I ordered it, the woman at the counter asked me if I want sour cream or cheese. And I ask... well is it vegan sour cream or cheese? to which she replies \"no it's not included\" (???) \n\nDear restaurants, if you have something labelled \"vegan\" on the menu, could you let your staff know what \"vegan\" actually means? Thank you.\n\nWe waited about 20 minutes to get our orders. After I picked out the big tasteless spears of tofu out of my not so juicy  \"Juicy Vegan\" it wasn't so bad. I liked the diversity of vegetables, it was an ok size, but I'd probably opt for Big Fat Burrito or Burrito Boyz instead of going to this place again.\n\nMy friend ordered the special of the day which was a Korean BBQ burrito and his reaction was equally meh. \n\nI wanted to like them, because I love burritos and I'm nearly always in the village, but it just didn't happen.","useful":2,"funny":3,"cool":2},
{"review_id":"_CL0bKkhbgXcLGyfefArhA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"4Dqv3RVR7faMYfeJCChdyA","stars":4,"date":"2010-12-20","text":"Like the Crema Coffee Co. on Bloor, the soy latte I ordered from here was delicious. Though if you're expecting coffee art, you might not get it. I certainly didn't, but luckily that doesn't really matter much to me.\n\nThey baristas are friendly, helpful, and competent, and when I bought an Indie Coffee Passport here, one of them had a few suggestions for other places on the list to visit (which was extremely helpful, and I'm looking forward to taking advantage of her coffee wisdom.)\n\nThere are adequate outlets (well... okay there are six, and I got one, so for me, that's adequate)  for us computer folks, fast free wifi and places to sit. I noticed one gluten free\/vegan option in the collection of sweet baked goods at the counter, hopefully they improve the selection on that front. Though people looking for gluten free or vegan baked yumminess with their coffee can just cross the street like I did, and grab something from Bunner's Bake Shop. \n\nMy only complaint is that they normally charge extra for soy milk, but I avoided that issue by using the indie coffee passport.","useful":4,"funny":0,"cool":3},
{"review_id":"K8rhK9yIKeQxNb72ILiTjw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"VvSmE1NnTjnaTPHT0WrCaQ","stars":2,"date":"2010-10-08","text":"I finally went to King's Cafe after it was recommended to me by a lot of other people.\n\nI had sampled some of their very delicious appetizers at the Vegetarian Food Fair last month, so I was excited to try an entree. Well... I had the Soy Fritters with Curry Rice, and I don't know if it was just the wrong dish to order or what, but I didn't think it was very good. Fried tofu gluten fritters with carrots, potatoes, beans and cauliflower sounded so yummy but it wasn't.\n\nThe only thing I really enjoyed the flavour of was the potatoes, because they seemed to have taken on the most of the curry flavour, the veggies and soy\/gluten stuff weren't very flavourful. I needed some hot sauce for sure.\n\nAt least it was on the Special Order menu so it was only 5.99, some of the other items were 10-13.\n\nThey also wouldn't let me plug in my laptop and were generally kindof rude. so, eh. Not very enthused.","useful":2,"funny":0,"cool":2},
{"review_id":"IIrkRcw2i95xsm3yUH57Zw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"OK_djnmJWmK4G3NMAjGGjg","stars":5,"date":"2013-09-27","text":"You know, it's been two years since my first review of this place, and often, places start strong and then fizzle a little, sometimes I expect that quality will go down, or the atmosphere might change. Not this place.\n\nI straight up love Boreal Gelato. They have vegan-friendly gelato in interesting flavours, today they had chocolate, salted caramel, and coconut. Fruit based  sorbettos are great and all, but these were extra exceptional, creamy, rich, and just all around delicious. \n\nI know flavours rotate, but I haven't yet tried any flavour of their non-dairy gelatos that wasn't tasty.\n\nThere is ample seating, inside and a little area outside to sit on, service was quick and friendly, \n\nGo there.","useful":1,"funny":1,"cool":0},
{"review_id":"UZEvglRhpX_bQNM59mvsyw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"gSPALi3f3Ga01HGXHrhlUQ","stars":5,"date":"2012-05-05","text":"I've been going to the Depanneur nearly once a week for a few months. They have a casual atmosphere, and are generally a good venue to find local food stuffs. Corner store by day, dinner establishment by (some) nights, it's really a great space.\n\nThe drop-in dinners are usually why we end up there once a week (or more) whenever they have a vegan one (which is on the regular.) It's always something different, but it has been consistently delicious. The chef stylings of Len (who I think is the owner) cooking something up every Tuesday, Emily Z, or Kalmplex (and many others) make this place just a total hidden gem (that I kind of don't want to tell anyone about, because I want to keep it to myself.)\n\nAs people have mentioned, sign up for the newsletter on their website (or connect with them on facebook\/twitter) to keep up with the events they have going on, there is always something for everyone. \n\nThe house made sodas are totally delicious (elderberry, blackcurrent, maple lemonade, just to name a few), they also have coffee\/tea, apple cider, and soy milks. \n\nPackaged foods include local mushrooms, jams and jellies, ketchup made in house, and freshly baked buns and breads (often with gluten-free options as well), soups, milks, yogurts, and other small business produced products.\n\nThere is WiFi, there is table space, and the service is always friendly. It's like a home cooked meal in the best possible way.\n\nThings to know: CASH ONLY (there is an ATM available at the convenience store across the street)","useful":6,"funny":0,"cool":6},
{"review_id":"rVVXd7jcyQnjf-nhKdpzRw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"pA44gWen_SoKoLqfiipkvA","stars":4,"date":"2010-10-26","text":"I love this little place off Church.\n\nThis place has  three varieties of sorbetto that are vegan and DELICIOUS. I love getting a scoop of mango and a scoop of the lemon (the lemon is amazing.) Sure variety is limited, but what they do have is fantastic.\n\nThe service has been consistently friendly every-time (and there have been many times) I've gone in with friends. The interior looks great, and it's nice to be able to sit out on the patio if it's decent out.\n\nPlus they have a beautiful selection of chocolate (That I've never tried, but it looks great.)","useful":2,"funny":0,"cool":2},
{"review_id":"z30pqS3yP2z3iiHV3unFLg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"7dLsjpsoHDoOVIhQriYc7g","stars":5,"date":"2011-09-15","text":"I loved this hotel. High ceilings, and a spacious, stylish room. I kept telling my partner... I like this... I like this... and then this.\n\nClean lines, hyper modern rooms with a split shower, where, if an interested party wanted to voyeristically watch you bathe, they could do so, while laying on a very comfortable bed. And if you aren't so keen on goose down, they have alternate bedding available upon request.\n\nThe service was stellar. More towels? 5 minutes you're swimming in towels. You want a ride to the train? Here is our fancy Audi we'll take you over. You want free wifi? Here you go. You want to come back to a room with a bottle of ice wine, soft music and lit up by little floating candles? No problem.\n\nThe included \"continental breakfast\" wasn't bad either. Not the vegan friendliest of places obviously, but they had fruit, coffee jams, peanut butter, and DIY toast your own bread station. They have almond milk sometimes,  but not during the time we were there, but I appreciated that the server tried to hunt some down for me.\n\nI loved all the little details.  I also loved how close it was to the Metro and bixi stands, art galleries, and copious amounts of patios.","useful":3,"funny":0,"cool":3},
{"review_id":"lEwYfkqQEPfvUs-0inB2-w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"sscP36MO34i5ep4QO8c7KA","stars":3,"date":"2011-01-06","text":"I had a terrible latte here. Bitter, weak foam, and unexciting. Maybe it was a bad day to go in, since I walked in on Boxing Day, and it was one of the only open cafes. I might give it a do over after I'm done with the rest of my Indie Coffee Passport stops, but I'm not in any rush.\n\nI enjoyed the space itself though, that wide open emptiness. My table was covered in magazines (so if you don't bring reading material, you're more than covered), they have wifi and I read and finished a book without interruption (it's quiet). I'd probably go back eventually, buy a coffee I might not even like, solely to hang around. Maybe that's why there isn't much seating, there is a certain dark homey comfort to this place I can't quite put my finger on, but I like it.\n\nWhile I'm happy they offer soy AND almond milk, I don't like that they charge extra for it.","useful":3,"funny":0,"cool":2},
{"review_id":"nUOZFEJtFnlcve_5s8DwVg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"phxC_5lTppMGf79F8Y-uHQ","stars":4,"date":"2014-08-31","text":"I went for my first ever float yesterday evening and I really liked it. Staff at Float were super friendly and helpful, and offered me a nice peach tea while I waited for my turn to go in. It was very relaxing.\n\nI've been getting a few questions about the process so I figured it would be helpful to have some idea of what happens when you walk in.\n\nSo this is what happens when you walk in.\n\nI had already paid and made my appointment online, so I just walked in around 15 minutes before my appointment. I signed a release form, drank some tea, and waited until my turn came. A friendly member of the staff showed me to the room I would be using, explained a bit about the tank, and some advice on ear plugs, then he left me alone to do my thing. \n\nThe doors lock, so you have some privacy.\n\nI had the last float of the night, so it was 2 hours long, but standard floats during the day are around 1 hour.  They have 5 rooms, each with flotation tanks in them, and it's easy to make an appointment online, which was a major plus.\n\nEach room has a shower, a bench, and a flotation tank, and a robe. Towels & ear plugs are also provided. They have scent pre-float shampoo & body wash you can use to get ready before going into the tank, and a more scented post-float shampoo and conditioner.\n\nThe flotation tank has about 10 inches of water, and a whole bunch of dissolved salts (for max float potential), so it's easy to get into the tank, sit on the bottom, close the door, lay in the water, and then open it again, or whatever you feel comfortable with. \n\nAt first I was a little anxious about getting lost into the abyss of the tank, and it just seemed to get darker, but as I found out, it's easy to find the door handle in the dark, and easy to open it whenever you need to. So after realizing it wasn't a big deal, and that I could open the door anytime, I closed the door, and floated away 2 hours without realizing it.\n\nWhen your time is up, there is music that comes on, and gets progressively louder to gently wake you or get you out of your relaxed state.\n\nThere is no right way to do it, but I had a great time just floating around with my eyes open, enjoying the feeling of gravity mostly disappear, and also got some really good stretching in as well. Just be careful with the salt water, as you might expect, if you get it in your eyes - it stings! (but there is a towel with a water bottle near the tank door if you need to rinse)\n\nThere was only a brief moment in the beginning of my float when I heard a siren from the street, otherwise, I didn't notice any street noise at all, and considering what I saw when I left Float last night, that's really impressive (lots of police activity, another ambulance that I hadn't heard). I'm usually pretty sensitive to sound, so mostly for me it was nice to have some near-total quiet and no vibrations other than the sound of my heartbeat for a couple of hours.\n\nI think they've got a great set up, and I didn't find their prices high (especially when compared with some other float places I've seen in the past) and they've got a variety of options to choose from on their website. \n\nThe one thing that is worth mentioning, is that after floating and being relaxed and blissed out, walking out onto Queen Street at 1 am on a Friday night can be kind of shocking (not like this is a surprise of course, it's loud, and busy). I know I'd like to try and do a late night 2 hour float during the week next time. Otherwise, I had a really great time.","useful":9,"funny":3,"cool":6},
{"review_id":"ocMVC0Vguf9tGkpflSqvHg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"r-uKGbHOb3Qdz_s2U-PuFQ","stars":4,"date":"2011-02-25","text":"Another one of those lovely places that I'd probably have missed if it were \nnot for the Indie Coffee Passport.\n\nFirst thing Saturday morning, I went over there to meet up with Nicole H. for a minicoffee crawl.\n\nI got there way too early, but the moment I walked in, I instantly felt comfortable and welcome. It's the kind of place I could see myself visiting everyday for a coffee. Very friendly atmosphere, the lighting was great, and there was ample seating (but of course,  it was 10am on a Saturday morning). It was obvious this was a local spot, people coming in and out, chatting with Bob (the owner) like he was an old friend. \n\nI ordered my usual large soy latte. It was so good. Thick, with a cute three dimensional heart made of crema. And I just loved the cup. I commented on it in my head and then again to Nicole H when she got there. It was the perfect size and shape to hold with both of my hands. Also, I was very happy to see they don't charge extra for soy milk!\n\nOther things that are great: \n- They have free wifi (when I went in, the password was on the chalkboard at the front)  \n- There is definitely an outlet at the back corner. I didn't look anywhere else, but there is at least one!\n- There are vegan snacks, soups, sandwiches in addition to several nonvegan options.\n\nComplaints: \n- None really. It's a bit out of the way for me, but I would go back anyway.","useful":9,"funny":4,"cool":6},
{"review_id":"qKnZ79iSewkDqTZYzIC_fA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"B7crzLt3Cmq2Uy3JOiMnRw","stars":3,"date":"2010-10-21","text":"We went and saw a movie here on Telus Tuesday, where we got a discounted movie ticket, and a free popcorn and a drink. The combo ticket was cheaper than buying a regular ticket. Can't go wrong with that. Avoiding the massive price of snacks is always nice.\n\nIt's close to the Osgoode Subway station, I loved the copious self-serve machines,  and the seats were comfy. \n\nWhat is with the bathrooms though? First of all, they were kind of hard to find, and secondly, for a big theater there aren't very many stalls. I'm glad I went on a Tuesday in the middle of a movie, because I can't imagine what that looks like on a Friday or Saturday.","useful":3,"funny":2,"cool":3},
{"review_id":"8I7pohJcQcGWuSXVjClxdQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"oM4nwtYDw5Ml-hrJdgv8TA","stars":4,"date":"2012-05-11","text":"Working in the Yorkville area, I've come here regularly for lunch. I love the location and the interior. It's a nice break from the everyday, and it's automatically relaxing. Calm, ignorable, music fills the restaurant, interspersed with the occasional loud whirring of a blender.\n\nI like that there is always a bottle of water on the table, because I end up getting a couple litres of my H2O intake for the day while I'm there.\n\nI've ordered a bunch of different things, but the Pad Thai was easily (and most expensively)  my favourite. Nice filling serving, with a fresh rich flavour.\n\nThe nacho plate is pretty delicious too, but as some other reviewers have mentioned, don't expect a giant nacho plate portion here. It's not huge, but paired with a meal it's a nice snack.\n\nSmoothies are always thinner than I expect them to be (and after ordering it several times you'd think I'd be used to it by now, but I'm not) so that's something to be aware of and set less thick mouthfeel expectations. \n\nOverall I like it here. I do find it feels expensive, especially since there is no guarantee of organic ingredients, but service is always good and not intrusive.\n\np.s. Get a macaroon (or three) they're delicious.","useful":0,"funny":0,"cool":1},
{"review_id":"XyFCr4BVEbKymURD7dSjKQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"yV7f80Nw8nJGilZpRnS6HQ","stars":4,"date":"2010-10-09","text":"I went to here the other day. It had a lot of places to sit (most of which were occupied), free wifi, but no power outlets that I could find.\n\nThe latte I had was beautiful, but not super exciting flavourwise. I've been spoiled entirely by the Sam James Espresso Bar. The one from here, was probably the second best one I've had in the city so far though.\n\nIt seems like the perfect place for both hanging out (there are cozy spaces behind the coffee bar) and group work (they have giant tables by the windows) and it's a great location (close to Kensiginton Market.) \n\nThey do charge extra for soy milk, and it was the second most expensive latte I've had, but I loved the space and would definitely go there again. Of the food items they had available, I saw a couple vegan cookies from Sweets From the Earth which was nice.","useful":2,"funny":0,"cool":1},
{"review_id":"ybGHCaTR-wXTxF5rJz1TXg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"pLWt3bWwQ9NPvk_xv8Dzgg","stars":4,"date":"2011-07-26","text":"Tonight after nearly everything in Kensington Market was closed we saw a glowing light out of this new Sadie's Juice Bar location. Yes, it's open and right next to Hot Beans.\n\nWe picked up two Tofutti ice cream cones (they had vanilla, vanilla almond bark, and chocolate) and they were of course delicious. Lots of other options available (like drinks, floats, sweets from the earth treats, and soy delicious bars), but I didn't  pay enough attention because I was too excited about stuffing my face full of my vanilla Tofutti cone. (& the person there was kind enough to let us in after closing, and I didn't want to overstay my welcome)\n\nI'm looking forward to visiting them again during the day!","useful":4,"funny":0,"cool":3},
{"review_id":"Df9X2MfmHiVR8KGCt0c53w","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"aEnoF_79jQE83s-I756n8w","stars":3,"date":"2012-04-23","text":"I walk by this place on the regular, and through the power of the Indie Coffee Passport, I decided to actually go in and check it out. It was crowded and very white, modernish interior, with an absolutely beautiful espresso machine. Their chairs aren't comfy and the interior was brightly lit with natural light from all the windows, so it's definitely set up as more of a pick up and go place than a sit down for a while place.\n\nThey charge extra for soy milk, and did so when it pushed the price over the $4 dollar Indie Coffee Passport limit. The service was indifferent and the soy latte was okay, but wasn't spectacular. \n\nThey don't have any vegan baked items, though I think they had something gluten free while we were there.  Since I have too many options for really fabulous vegan friendly indie coffee shops in the neighbourhood I probably wont return to Thor.","useful":0,"funny":0,"cool":2},
{"review_id":"zg8kiy719EmA2cHwxL3drg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"Q-lz4ZAYDGk0kE-P2Hncsg","stars":4,"date":"2013-04-05","text":"I'm really digging this tea shop. I'm not in the area as often as I'd like to be, but when I am, I usually stop in for a cup of tea. It's a tiny space, but houses a nice variety of in house made tea blends. I didn't think the selection was really that small, but I think it's a sign of quality. Kind of like a carefully selected wine list at a restaurant rather than I \"here is every single wine we could buy ever\" list.\n\nService has been lovely.  The owner is consistently a nice, helpful person, and answers questions about tea and recommends things as needed.\n\nThey've got a nice variety of in house made tea blends. But since I'm a creature of habit (at least with tea) I will probably just order an earl grey or a cacao tea probably forever. I like that the cacao is from Chocosol, and that the tea tastes like some kind of chocolate magic, while still being light.\n\nI'm going to have to look into some of their tea mixology classes!","useful":2,"funny":2,"cool":2},
{"review_id":"6PkCZqMq9pgpBBQEe00eDg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"leMIHa6TogufHv5HNYjnfw","stars":2,"date":"2011-07-08","text":"We ended up at Ravi's Soups on Queen Street a few days ago, after a failed attempt to check out E.L. Ruddy (they were closed).\n\nRavi's Soups had a big group of people waiting for wraps, so that was a nice sign. They had a veggie wrap on the menu, and a vegan soup option. That said, I wasn't excited about this place from the very beginning.  Service was weird and all over the place, there wasn't a line waiting by the time we were at the counter, but he was still frenetic and rushed, but the food didn't come to us for quite a long time, and as with most simple vegetable dishes, I feel like I could have probably just made the wrap at home.\n\nThe veggie wrap normally has brie in it, and jut as a heads up, one of the unlisted additions is mayo... so you know if you're vegan, ask for it without, or just skip it and just opt for soup. (or go somewhere else.) The wrap came with a tiny salad, that of course, had \"just a little bit\" of mayo on it, I guess \"a little bit\" of mayo is the same as \"no mayo\"? Not quite.\n\nMy friend had the wrap and the Porcini Mushroom Soup and loved it. It's based on an onion broth, and has mushrooms, barley, and truffle oil in it, so it's actually vegan. However, soups all come with a cheese biscuit.\n\nThis place, like most of Toronto's restaurants, is great for lacto-ovo-vegetarians, but going there made me wish I had gone somewhere else on Queen that was a bit more vegan friendly with more exciting options.","useful":3,"funny":0,"cool":1},
{"review_id":"urhz69ahF0pVy0IbI1PMeg","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"y-Zbg19VSb-k15A_yzruYg","stars":3,"date":"2010-11-15","text":"Before we decided to wander through the AGO yesterday morning, we stopped into Frank for brunch. The server was awkward, stiff and extremely formal (in a way that seemed unnatural), but overall very attentive and helpful, so I wont hold her attempts at trying too hard against her.\n\nFrank has a vegan dish on their brunch menu, the roasted shiitake mushrooms with heirloom squash, which was nice to see. The server suggested a slightly more substantial dish the chef could make for us with braised lentils and eggplant (also with heirloom squash and tat soi salad). It was phenominal.\n\nBeautiful presentation, and absolutely delicious.  But, with phenominal food, comes a phenominal price tag, so that part was an unpleasant surprise.","useful":1,"funny":0,"cool":3},
{"review_id":"9lhodxDU2rSKsY3ni0CCFQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"edf1UxWW9-7u_f35kbvEwQ","stars":3,"date":"2014-08-28","text":"I'd suggest any of the adults here check out one of Legoland's Adult Nights (which happen on the last Wednesday of every month), where you can enjoy a kid free Legoland. I don't know what it looks like during the regular days, but considering there were kids that didn't want to leave the park today, there must be lots of them. Happy to skip that. \n\nWe booked adult night tickets in advance online, so it was a bit cheaper than getting them at the door, and while it still felt a bit expensive, I did spend around 2 hours running around the park and having fun on rides (there are two of them), playing games, and building cars (and then racing them) with LEGO, and building minihouses with duplo, so overall I had a good time. I also liked the miniatures exhibit of Toronto's downtown and area.\n\nAll of the staff was all friendly as well.\n\nThe thing is - Legoland is small, and there isn't *that* much to do. We finished with everything quite quickly, and found ourselves wondering what else is there...\n\nIt's in Vaughn Mills (a mall), at entrance 4. \nGo on adult night.","useful":2,"funny":0,"cool":0},
{"review_id":"AnPjCb40a6zeTM_55kEctw","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"3ycYtMXIAMz7SSyFUfSppA","stars":4,"date":"2010-11-17","text":"I snuck in here when it started to rain and wandered around looking at more Barbapapa stuff than I'd seen even when I was a child, adorable little baby products, cookbooks aplenty and the most beautifully unnecessary (albeit potentially useful) kitchen accoutrements and accessories.\n\nI loved this store. Couldn't help making a little list in my head of all the things I wanted.\n\nOne of the folks at the cash was pleasant and even held the door open for me when I was coming in; the other one was pretty much off in her own world. Though this was fine with me, since I just wanted to browse the store in peace, and they didn't seem to care that I had been in there for a considerable amount of time.","useful":5,"funny":0,"cool":4},
{"review_id":"FEtMyYYTSQyOArTSrFSrHA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"d84_mtSFHt8xgYTly2T-9A","stars":3,"date":"2010-10-20","text":"A friend and I some time to kill before seeing a movie at the Scotiabank Theater so we went to Sushi Time and grabbed a bite to eat.\n\nWe ordered edamame as an appetizer and a few orders of cucumber and avocado maki. Well, we got our maki first, and it was good. It was a bit on the big side and loosely wrapped, but on the bright side, the avocado and cucumber were fresh. The edamame appeared after we had finished about half of the maki.\n\nThe service was friendly and we got our order quickly, but at the end of the meal we waited about ten minutes for a bill. Every moment one of the staff would go by we'd try and wave at them, but they'd come rushing past us. \n\nOverall it was okay. It's a decent spot to go before a movie, but I probably wouldn't seek it out on at any other time.","useful":2,"funny":0,"cool":2},
{"review_id":"C9Oy7FRDLfaEDmB7tGZGtQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"RNu4p38Eh8TmFzqcwS8KFA","stars":4,"date":"2011-07-08","text":"This gym is great. I'm not sure what issues people have with it, but this was my first experience with GoodLife and overall it was extremely positive.\n\nThe staff are friendly and helpful, the trainers were friendly, there are loads of treadmills, elliptical machines, bikes and equipment. Some old, some new. The best part about it, is that it is nearly empty.\n\nI think the biggest selling point for me is that it has great change room facilities and amenities. Unlike the Liberty Village location (that is now my regular location), there isn't a mass veto on scented products, and they have lotions, different shampoos, hair spray, gel, deodorant, etc. There is a hot tub, sauna and steam room, and more than enough showers.\n\nI liked it, now it's just too far out of the way to visit.","useful":1,"funny":1,"cool":2},
{"review_id":"3pPmYHmobYxEBUJqw7CvgA","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"c6f8wBjPLDzyubEBqgcMnw","stars":5,"date":"2012-11-14","text":"I went back here this weekend and had a pretty great time. The staff are friendly, the cafe was busy but the line moved quickly, and our soy lattes were delicious.\n\nI still love this place, and I still wish I was closer to them because I'd drink their coffee more often. Staff are so nice, and seem to like working there and with each other. That makes a huge difference to the whole coffee experience. \n\nThere are no vegan baked goods, but it doesn't matter, because their coffee is good enough to stand alone. (though you know... I wouldn't be sad if there was a vegan cookie or two someday...)","useful":2,"funny":0,"cool":1},
{"review_id":"XUfHQ65W_GmPm1oGW1UJkQ","user_id":"YgavGxfAdjhkkbwlAY_9ZQ","business_id":"e2r5_zNwNu4kVBnpFRv0AQ","stars":3,"date":"2012-11-14","text":"Before I finally moved to Toronto I stayed at the Fairmont Royal York. \n\nThe main lobby was of course beautiful as most Fairmont Hotels are, but the hotel room was tiny. But the bed was comfortable and the room was spotless, and really - I just wanted to have a good nights rest in somewhere a bit fancier than a typical hostel stay.\n\nThings that are great:\n- Location location location.\n- Products in the bathroom.\n- Service was friendly.","useful":3,"funny":0,"cool":0},
{"review_id":"-VegTMVHzxYe2pWUUOtZ8w","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"jIzygnVmajEXYmfsBNY_Gw","stars":5,"date":"2016-09-13","text":"Good tacos here. Its in North phoenix if you live far it wort it going you won't regret it. I tried there tacos and they are bomb. Highly recommend","useful":0,"funny":0,"cool":0},
{"review_id":"eRjmNpymCCRvN43nmEy-lg","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"5fM69_oyGPAtrvR7bSGVOg","stars":5,"date":"2016-09-08","text":"Good place to go grab a dessert! I think is the best  place to get a true Mexican raspado! They are always busy since its a small place but is worth it going","useful":1,"funny":0,"cool":1},
{"review_id":"JDgO0ICb93RpLx-mq3BiBA","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"MYExA8lcXaHYXuAPlGBWUg","stars":5,"date":"2016-09-08","text":"First time ever going to an event  to Phoenix Symphony. I got free tickets my a friend I wasn't planing to go but did;t want to wast them. I ended up going and I have no regrets I love it. I high recommend going","useful":0,"funny":0,"cool":0},
{"review_id":"Pyv-2NO0IF_M3WpHE1YxHg","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"1yIedrVRAfAtsG2Fk0p9Fw","stars":5,"date":"2016-09-10","text":"I was nervous to try a new place to do my nails, as soon as I walk in they greeted me. The staff were great and polite. I recommend this nail place.","useful":0,"funny":0,"cool":0},
{"review_id":"F_9Jcggf4VKwFbnRkh6w1A","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"l683preTG0GIk9XMaHAUNA","stars":5,"date":"2016-09-13","text":"Have you ever tried real fresh Mexican bread, well this is the right place. Its just the corner of my work its in the southern east corner of 32st  and Thomas. I usually go  around 7pm to 8pm that when they have warm bread. They also have fresh food it  might not be cheap but its very good and fresh.","useful":0,"funny":0,"cool":0},
{"review_id":"wbrJ6ymAvVJBGmCavo7fgw","user_id":"OHhFN14jFGmjPmCOph12vQ","business_id":"WzrMNz9eUF78RgZGDTS8xg","stars":5,"date":"2016-09-10","text":"I love the sweet and sour combo the food is fresh and hot. Great place to go each lunch, they are fast and courteously. They are clean and friendly I highly recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"oLQyEOmsGx4Tb06PO6wMwg","user_id":"EXVQS5nz4lepwRy8QJq50A","business_id":"Wijq97TO27mhi_OG-xaW-w","stars":5,"date":"2010-09-03","text":"Top quality food here! We were staying in filey about 10 miles away and spotted this place but was busy so we drove back the next day and we were so glad we did. This has THE BEST fish & chips ever! And a top quality service too! Give yourself a treat and make sure you go, we will the next time we are over that way, thanks the 3 from Morecambe","useful":0,"funny":0,"cool":0},
{"review_id":"wl8BO_I-is-JaMwMW5c_gQ","user_id":"fo4mpUqgXL2mJqALc9AvbA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2012-06-10","text":"I booked a table here for brunch and it did not disappoint, it was a great experience and more relaxed I feel that the pricy dinner menu would of been, with the same outdoor table overlooking the Bellagio fountains and the Paris hotel. Eggs Benedict for me was fab and some other good options on the menu. \nI told them we were celebrating a birthday and got a chocolate cake with a candle brought out which I was pleased to find was not included on our bill at the end!","useful":0,"funny":0,"cool":0},
{"review_id":"1d4kSfyD-VkRMiq7DbmmZQ","user_id":"JaX7_FD-oO4V5kbixx01rw","business_id":"sdYkVaTy7EJwUkO8Ie_qPg","stars":5,"date":"2017-07-17","text":"What a great find for a quick lunch. The place was packed on a Monday afternoon,  but barely any wait even though there was a line. The roti chicken was delicious, along with the crispy yucca fries and a side of sweet plantains. Be sure to try all the pepper sauces the are all very flavorful and really complement the dishes nicely!","useful":0,"funny":0,"cool":0},
{"review_id":"wnojnTpteq7um67mivbfag","user_id":"Eirm5Cv1Mk4pyJfi_LprbA","business_id":"5mmF-H_4emxvultbneKFWQ","stars":1,"date":"2012-10-17","text":"Average food - had the worst service last night from a young man.  We were the only table in the restaurant at 8:15 - our server was rushing us out","useful":1,"funny":0,"cool":0},
{"review_id":"kcHtpyK7v0BIoXZKUZ5sWw","user_id":"Eirm5Cv1Mk4pyJfi_LprbA","business_id":"8jHLEXfoy3Q9TdvJYvtWvg","stars":1,"date":"2014-08-05","text":"I had a 7:30 reservation on a Monday night.  I did not get seated until 8:15.  At 9:00 no chef had come to cook for us. I had already complained to the manager once and he did nothing. Finally my family had to leave as we had hungry young children.  I am so disappointed and will never go here again.","useful":0,"funny":0,"cool":0},
{"review_id":"JRI9Cc0PVbMX6nN8EQsWIg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"I-5qHCVwT7k_KH67-YOx3A","stars":4,"date":"2009-06-29","text":"I love Cheesecake Factory period but The District location is my ultimate fave in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"0FcdLS7o6pQ4WPFooisfbg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Zrx25j1M794Nh8fUGB8E9A","stars":4,"date":"2013-10-08","text":"I love TGIF ever since but I never wrote a review.  The food is good, the dessert is not to miss and their happy hour on drinks is cherry on top.  This one inside The Orleans is great place to dine after or before going to the movies or bowling (or to gamble for the gamblers).","useful":1,"funny":0,"cool":0},
{"review_id":"_wzBkx7HCHcpdSAf-oX0Ug","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"4tWF2w6jP2LNK2xTVNEMFw","stars":4,"date":"2009-08-06","text":"Could be the best Mexican cuisine I've ever had in Vegas?! Coconut margarita is liquid nirvana.","useful":0,"funny":0,"cool":0},
{"review_id":"gBKDf27W9LAysSANwH_cEA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"1Vn_lex3LGGwuTo-xeJnww","stars":5,"date":"2009-10-03","text":"I love froyo and Yogurtland makes it a dream come true.\nThis is my fave venue since the ambiance is cozy and relaxing due to plenty of tables and chairs to unwind unlike the one in Town Square.  \nService is definitely friendly and warm.\n\nOverall ~ I am a big fan!!","useful":1,"funny":0,"cool":1},
{"review_id":"kcUIeVskF2zAnUSYeqTyAg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"JTSk0BCHw-uusHO4snGePA","stars":4,"date":"2013-07-30","text":"My experience with Portrait Innovation was great!  The prices are stiff but the photographer took her time with the shoot and was patient with my baby boy.  We will come back for a family holiday photo this year and I will make sure to use their coupon (I didn't the last time and paid $180 ~ yikes!).  This place is much better than JCPenney on Grand Canyon.","useful":1,"funny":0,"cool":0},
{"review_id":"ceKleTs7hPyWIX4_KpHCZQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"Zmfq3DVhHdtVChhSxzoUHw","stars":4,"date":"2009-10-03","text":"Thai food is just delicious but Panna Thai makes it irresistible.  \nFood is scrumptious with good portions.  \nAmbiance is very private, mellow yet warm & friendly.  \nPrices are very reasonable (almost like Thai BBQ).\n\nOverall ~ will be coming back for more!","useful":2,"funny":0,"cool":1},
{"review_id":"9ivLrV6UgjaeabqkEmq4Fg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"IcOvxejpd5FLFIkj20Opqg","stars":4,"date":"2009-08-06","text":"The only place where I get yummy red bean or green sesame balls.  Also their steamed pork buns are my favorite.  This is where I order birthday cakes - mocha cake with coconut filling is a must-have!","useful":0,"funny":0,"cool":0},
{"review_id":"G9Wd0iKSuFyHuEc2sIGK0g","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"pybIuTluqRhH_BQ3CJHlLw","stars":5,"date":"2013-07-30","text":"The food is absolutely delicious.  The price is a little higher than other good Thai restaurants however you really get every penny's worth, plus the ambiance really takes you to Thailand unlike other restaurant.  You must try and I will definitely come back!","useful":0,"funny":0,"cool":0},
{"review_id":"h0m315KtVu2g8YfXc5LA6w","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"SycXTaA4MeJZuDK4Y1owDQ","stars":3,"date":"2009-08-06","text":"I'm not a burger-fries-shake kind of person, however, Islands have delicious burgers and thick shakes.  I would recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"3gWfTCum4nGVnX0FTffBTA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"5shgJB7a-2_gdnzc0gsOtg","stars":5,"date":"2009-08-06","text":"One of my favorite hang-out spots in Vegas!  My friends and I been loungin' at Firefly since 2005 and I have nothing but praises to say.  Sangria and Mojitos are smooth plus their calamari and paella are delicious.  As I said, I have nothing but praises!!","useful":1,"funny":1,"cool":1},
{"review_id":"0M1gnowzgTpGWRk9gHvEtA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"UvF68aNDfzCWQbxO6-647g","stars":3,"date":"2011-08-25","text":"They have good Vietnamese sandwiches and refreshing Thai Tea with boba.  The service is good but you must remind the cashier if you want to redeem any specials they have for she won't automatically do it for you.","useful":0,"funny":0,"cool":0},
{"review_id":"RuQbhgENXUlf28wcv2Cwsw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"NXNa5OYmN1CNmXwHhDxpRA","stars":4,"date":"2015-01-13","text":"My first time and there was no wait, so plus. Wait staff are friendly & accommodating; the menu is simple and easy to read; price is reasonable less than $10 for a regular size bowl of ramen. i would come back here.","useful":0,"funny":0,"cool":0},
{"review_id":"1eS9M4YeJnykAzcUJQ1o1A","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"JlPLadwBV3o20GjQwKmXAg","stars":4,"date":"2009-08-06","text":"DJ Paul Oakenfold brought back life to Vegas nightclub scene.  I love Rain but Oakenfold makes all the reason why I keep coming back.  Atmosphere is out-of-this-world with neon lights and glass mezzanine plus add lovely ladies in their pyrotechnics rope dance moves.  Definitely Vegas!","useful":0,"funny":0,"cool":0},
{"review_id":"DtBjK1efAKKk4xr-MOtFjw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"BEplfZTUzYwApjMUaOA12w","stars":3,"date":"2009-08-06","text":"Chicken tacos are delish especially their guacamole ~ not so pricey even if it's inside The Venetian.","useful":0,"funny":0,"cool":0},
{"review_id":"Cxc_NMKsze-XlmS3dl44mA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"DzKl51tivGJMLiNsQqf38w","stars":3,"date":"2009-08-06","text":"My friends and I were here in June and they were packed ~ the table wait time was 5 minutes.  Our server was friendly and knowledgable, food is good but it's the dessert that I enjoyed the most.  Price range is very affordable for the food and service that they deliver.  Must place to see!","useful":0,"funny":1,"cool":0},
{"review_id":"MrrMGfG7ee6qvoRrWbA9MQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ZGXd87vme_dDVYqr-HpRQQ","stars":4,"date":"2009-06-29","text":"My old boss took us out for lunch and we went to Bamboo Bistro.  The ambiance is clean and casual.  The food is delicious however they have a triple-layer dessert that just didn't hit the spot.  Overall it was a pleasant dining experience.","useful":0,"funny":0,"cool":0},
{"review_id":"ddAAYIGyBvgLOg3jPYzCAw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"NvKNe9DnQavC9GstglcBJQ","stars":5,"date":"2009-08-06","text":"Grand Lux is the higher end scale of Cheesecake Factory.  Their menus are quiet similar yet very different.  I love all their food especially the chicken flautas and strawberry lemonade topped with creme brulee' dessert.  The only downfall is that it's inside The Venetian resort and I'm not a fan of the strip on my days off. XD","useful":0,"funny":0,"cool":0},
{"review_id":"1th2vReHW-c2CNvszrRxxg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ixAh9crILnJ9tM8LhWFhkw","stars":3,"date":"2009-08-06","text":"My younger sister suggested Archi's for lunch and I enjoyed the place, however I prefer Thai BBQ better.  Archi's ambiance is pretty, service is good but food is not the most delicious.  Overall experience is fair.","useful":0,"funny":0,"cool":0},
{"review_id":"B7aHcwapqRxqLEKuYghimw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"_vHI2zsJp7b02MFJUWJgbw","stars":5,"date":"2009-08-06","text":"My fave asian bakery in Vegas! Quaint and friendly, good selection of breads, pastries and cakes.  One can never go wrong.","useful":1,"funny":0,"cool":0},
{"review_id":"79Eb56aD3dX0ey-s6IIPGQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"0CB7YB1qRSWLQvMbHw3Fmw","stars":4,"date":"2013-10-08","text":"My new discovery and new place for boba tea.  I tried their mango fluffy snow with mocha, bananas and condensed milk ~ it was yummy! But I will go with red and mango toppings next time.","useful":1,"funny":0,"cool":1},
{"review_id":"E95c6ZlB43GIpAGu2rfzQQ","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"lxPWvoHDxgxBXIwfRjtLwg","stars":4,"date":"2009-08-22","text":"It's been a couple years since the last time I was at Zizzy, but as I recall I had a great experience.  Drinks are fantastic, service is fast and the private karaoke room was pretty cool.  I'll be here again for my friend's birthday this Saturday ~ we'll see if things got better!","useful":1,"funny":0,"cool":1},
{"review_id":"ys7qIpoSMx_tIfbeCKqcxA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"OK0ba4X5seibH8oMWh4bhw","stars":4,"date":"2009-08-06","text":"Definitely my fave sushi restaurant in Henderson.  Ambiance is relaxed and friendly, service is efficient, price range is reasonable, sushi is delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"xMabXlUlIQkmNn2NjnIOlw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"C9ImzBi5fn742ZcAYDww2A","stars":4,"date":"2013-07-25","text":"Food is delicious, price is kinda high for breakfast place but the service is excellent & the ambiance gives an uplifting mood.","useful":0,"funny":0,"cool":0},
{"review_id":"NR16KuBnKwtZjEdlN6Eeug","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"ZRe7iIrIRDMMWhrcieMsiQ","stars":4,"date":"2009-06-29","text":"My family and I call this \"Sunday's Best\" because we're almost here after church enjoying refreshing all-natural boba tea.  Red bean, Taro Fresh, Lychee and Coconut and Durian flavors are my fave.","useful":0,"funny":0,"cool":0},
{"review_id":"ZGfMyCFAYg7PtTF16eSXZg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"N4BbeIbQNgtUEEMutu9U3w","stars":4,"date":"2009-06-29","text":"This location is the only one I've been to and I would recommend it.  I usually come for dinner and I would say there's about 10 - 15 minute wait on weekends but the staff is friendly and courteous, the food is good and prices are reasonable.","useful":0,"funny":0,"cool":0},
{"review_id":"4GbneGXe15aA4RAidrqb9g","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"DYuOxkW4DtlJsTHdxdXSlg","stars":4,"date":"2013-10-08","text":"BEST happy hour in Vegas!! $3 for a pint of blue moon (and they have a selection of beer) $5 martini (totally delicious) and their appetizers like Jamaican jerk chicken, empanadas and burger sliders are around $5 as well.  A definite must-try if you've never been!","useful":0,"funny":0,"cool":0},
{"review_id":"Jbmccd7w_rPduEsLphMAHw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"h5a8aJ_Pd71JzUGFA-IaAg","stars":5,"date":"2009-08-06","text":"One of my favorite lunch spot whenever I'm craving for some Thai Iced Tea and Thai BBQ chicken.  Restaurant size is quaint but staff is friendly, price is cheap, and food is scrumptious.  Highly recommended for casual lunch!","useful":0,"funny":0,"cool":0},
{"review_id":"jy2hXP_dQmjKnQ-RYitnbg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"31cOttU_tML5b6eLLXZfsQ","stars":5,"date":"2016-06-13","text":"Awesome and very delicious ramen!!! I have eaten here with my family 4 times now, and we all love it (children alike).\nThey have a great lunch special (11am-3pm cut-off time 2:30pm) for $12.99 you get ramen of your choice, 1 chasu, choice of karaage (fried chicken)-fried rice or 5pc gyoza and 1 lemon sorbet. A really great deal! \nThey also have a stamp card if you fall in love with their ramen and decide to eat there more than once. \nOverall one of my new fave ramen place here in Vegas.","useful":2,"funny":0,"cool":0},
{"review_id":"jaQL4mkn_nJ9qLtDD_PVHA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"0WoQQlMXVIDEgI0xNdENKA","stars":4,"date":"2013-07-30","text":"I love this place!  The food is good and such a great selection unlike other buffet. This is my first choice buffet off-strip.","useful":0,"funny":0,"cool":0},
{"review_id":"Jfbl_-2PHqeIcY7BJQyrGA","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"gKibp_umj24h3ggID-Akkg","stars":3,"date":"2009-10-03","text":"My first time to get my hair cut and I am pleased on how it turned out to be.  Kevin was my hairstylist and he showed me a picture of famous layers and he recommended for some layered side-swooping bangs, at first I was skeptical since I haven't had bangs for a year.  However after the cut was done I decided to get my bangs.  Kevin was very nice about it and did a pretty good job.","useful":4,"funny":0,"cool":0},
{"review_id":"0C52L4Gr4yfqodk1q2IeRg","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"n_K2xa_nqzUqaUJa0S_5tQ","stars":4,"date":"2009-06-29","text":"I love this place. \nMy girls and I are always here.  Taro balls, snow white snow ice and tea-flavored spiced pork chop are my favorites.","useful":0,"funny":0,"cool":0},
{"review_id":"9bA1GBclAfD4MWXYxIj8cw","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"uu5AtMrz_94e8kk4Gixg9Q","stars":4,"date":"2011-08-25","text":"One of my fave Filipino fast food restaurants here in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"Ku-Hjx5iNEfmqAukQyTMew","user_id":"AuIK5tF2GjO7SftHawTLKw","business_id":"L6qd3x0bHymyxub9dF7lIA","stars":5,"date":"2009-06-29","text":"My girlfriend and I love Chinese food specially lunch specials.  Cafe Noodle does have the best lunch specials.  Price is cheap and food is delicious but like any other Chinese restaurant, customer service is a little off.","useful":0,"funny":0,"cool":0}]