[{"review_id":"5N0F0fIzTZ54q191D14RDA","user_id":"pc7Q0BKyCYSiqR-0a9rPgQ","business_id":"gOpOoZgrF2shRLCBBzO3Mw","stars":5,"date":"2014-05-19","text":"Had \"The Shack\" breakfast burrito. Probably the best one I've had in a while. Usually I can't finish the entire thing but it was so darn good I couldn't stop.\n\nThe Shack, with a Mtn Dew at 830 in the morning is a good start to a Saturday!\n\nLocation is really awesome as well, it truly is a shack. Cool decor and makes you feel like your somewhere else!","useful":0,"funny":0,"cool":0},
{"review_id":"KBxSlhF42ftAE2BGCyVMuA","user_id":"QF6zSrKl1NS3dmJHOJ65lg","business_id":"hNsRj2nXuALlJS4Op-8MmA","stars":5,"date":"2014-03-11","text":"Favorite Saturday night hangout! Great food and happy hour drinks. Such a fun environment. They have local bands play on Saturdays. They have reverse happy hour! It's seriously a places to try out!","useful":0,"funny":0,"cool":0},
{"review_id":"fAUEyC62x6IJ143xivJwzg","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"4kDLEb1OgE7IrO54lCkn3A","stars":5,"date":"2016-07-27","text":"The food was pretty tasty but what makes this a five star for me is that the staff were also very personalable. The stuffed pepper was oh so good. We got our food to go and had a picnic at the beach (forgot utensils but had napkins) and it was simply a really good experience.","useful":0,"funny":0,"cool":1},
{"review_id":"Kgt0sJrm8wgms1ZVKwbgjA","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"D5oYTE-sbkV2wurOWOGzjQ","stars":4,"date":"2016-07-27","text":"I will come back when I have more gourmet doughnuts but these were really good. Had the salted caramel and it was this salty delicious treat. Also the pastor I think it is called (one with hazelnut on top) was not to sweet bit that Tims could never replicate.","useful":0,"funny":0,"cool":0},
{"review_id":"U_4aCUEmEQ7gHOkr8DxupA","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"ZUZZEQ61ZD826C65SZLAQQ","stars":4,"date":"2016-03-01","text":"I had their London Fog variation (forget the name) and it was delightful. The set up is a bit cramped but that's because it's a smaller shop. We went late and had seats but I imagine they might run out quickly. It had a good playlist at the time giving a nice ambiance but that is dependent on who sets it. It is definitely worth checking out if you are a tea buff. The way they infuse the leaves and water is interesting but that novelty will wear off, moreso if you are rushing. You'd be returning simply because they have good tea and a large selection. \n\nTl:dr large selection of flavourful teas (and coffee), infuser is interesting but will upset impatient people, good ambience in a smallish venue","useful":0,"funny":0,"cool":0},
{"review_id":"TfBZ5FoCh2MoZanvxxDqyg","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"gtfLQysuCBEAQk3wwWxwTg","stars":4,"date":"2017-04-02","text":"Three and a half?\nFine pizza. Interesting options. I thought it was tasty companion thought it was not as good as they wanted it to be. I'd order again though.","useful":0,"funny":0,"cool":0},
{"review_id":"6ZtWO7CN-BDmkoagD1NlXA","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"5X3dzKWnBdV-KmxdGEPb_Q","stars":2,"date":"2017-04-02","text":"The pizza looked old when i walked in. Maybe it's better to order it fresh... I got the chicken schwarma which came with some wilting veggies and layers of sauce. It... Tastes as if the sauce is compensating for the lack of flavour in the chicken. Yes it is cheap and probably a staple. You're not coming here for top shelf food. It's the draw of schwarma on pizza... \nMore like 2.5 but i don't see how this deserves a four star","useful":1,"funny":0,"cool":0},
{"review_id":"W0NXLSlWLk5NME-WHLOjog","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"_Gv5HPQBM3fzI9bOUYFYuw","stars":4,"date":"2016-04-20","text":"I had the fish n chips to go so I'm mostly speaking on how I really liked it. The slaw was one I could eat and I hate slaw. It is a more upscale place than I am use to. The ambience was nice, quieter, something I expect more in the suburbs actually. The patio looks like I will be returning in the summer especially for the nachos. Good date place I think. \nFish was large and tasty and the tartar was something I could eat. I also don't normally do tartar.","useful":0,"funny":0,"cool":0},
{"review_id":"-nk41W1iIdmsgf-BY-g17g","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"pks_z0EXHrxouKLKaMq1gw","stars":1,"date":"2017-04-13","text":"I don't know why this is four stars...\nMy food came out well before my partners. One might assume eggs benny on waffles would take less time than steak and eggs but maybe it was because when i asked for medium they gave it rare. The home fries looked like they were McCain fries and the eggs were bland. I had to send the steak back the first time. When the steak was cooked more (still under done), it was quite frankly disgusting. Not the seasoning per se but the meat was very bad. They said something is wrong with the supplier, so until it is resolved stay away. I took a bite and put it aside. \nThe eggs benny... Well I mean wow these were terrible. The sauce was lackluster and strangely textured (congealed a bit?) on top of cooked centre poached eggs. The yolk should be runny. The waffle also tasted like it was out of a packet. I don't care if (cheap) food is store bought but it should have some pizzazz at least. \nThe customer service could have been better. Maybe it was that she was new and the amount of tables were too much. She was friendly enough i suppose. \nOh and the latte sucked. \n\nTL:dr terrible food.  Just ... Terrible","useful":1,"funny":0,"cool":0},
{"review_id":"aIwGaDtSOwchGqealgu33g","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"kEq7eudoX5qdcaSLAq3axw","stars":2,"date":"2017-04-02","text":"The service is ok. The food was mediocre and the hot chocolate tasted like it was from a packet. It was sad that it is close to the laundromat as it would be a nice place to wait. Not a repeat visit.","useful":0,"funny":0,"cool":0},
{"review_id":"dGdy7IecAg2XVAaHGmAMzg","user_id":"U8tqYI-gQXp5QBx-EL9xsg","business_id":"tWdp26XQEJqJGnRmFVJQxA","stars":3,"date":"2016-07-27","text":"Tried the seafood pasta (forget name) and it was terrible and for $22 the price is ridiculous. The staff seem friendly and the decor is very nice but blegh.","useful":0,"funny":0,"cool":0},
{"review_id":"IyRRS2eJcvBGpKQPhQHOCA","user_id":"2GyyWJgIRUE4ZA0RW6T4EQ","business_id":"dxeu5YQIzw0jOp1cSVkimg","stars":5,"date":"2015-02-05","text":"Wow and I mean wow. Various dishes made from scratch just as well as their very own soy sauce! I am greatly impressed and by all means you will be too! This small Japanese tapas restaurant is more than meets the eyes!! Thank you Go for the introduction! I'm huge on sake and love to marinate with a few dishes. I will be back regularly!","useful":1,"funny":0,"cool":1},
{"review_id":"faYfZsMgSNzkO_lzf-wpHA","user_id":"2GyyWJgIRUE4ZA0RW6T4EQ","business_id":"UN_6ebslv5cxdDmZAX3ivQ","stars":5,"date":"2014-12-07","text":"I've been coming here for over a year now. I love the atmosphere but what shines the most is the amazing hookahs and absolutely great customer service! Everyone is on point and I've been treated like family. I definitely recommend this place to become your second home as it is now and has been mine! Thanks Luna!","useful":0,"funny":0,"cool":0},
{"review_id":"IrqcYcOvIx86Y4bw4qS8ew","user_id":"z2rwgHZ_0gxQdysWw_0XCQ","business_id":"Pbh0WNaKvkyI7HYwQMEWpA","stars":1,"date":"2014-05-05","text":"This was the worst experience I have ever had.  I purchased a car that then had issues within the first 24 hours.  I took it back as they gave me the impression I had a 10 day return period.  Turns out it was just an exchange period so after many wasted hours I am still without a car and they will not refund the $2,750 I have give to them.  The owner, Jack, just keeps telling me to come pick up my BMW....which I said lets exchange many times to.  I've gone twice and spent hours looking for something else and they have nothing so then I was told I was being difficult and my expectations were too high.  NOTE:  If you buy a car from these guys you must have LOW EXPECTATIONS!  I strongly recommend you DO NOT BUY A CAR FROM THIS PLACE!!!!","useful":15,"funny":0,"cool":0},
{"review_id":"usYQXb-Hxy66t2Ifo8XfDQ","user_id":"z2rwgHZ_0gxQdysWw_0XCQ","business_id":"hpvHHl_f4PHk0gc1qcg5qQ","stars":1,"date":"2015-08-31","text":"Worst service ever.  We went in to eat at 4pm on a Sunday and there were only a few tables and about 8 waitstaff so we should have had perfect service.  Instead the staff stood around gossiping and we never got drink refills and waited forever for our check.  On top of that we were very unimpressed with the food.  My boyfriend had a salad that was $18.50 and the corn in it looked old and his salmon way over cooked.","useful":3,"funny":2,"cool":2},
{"review_id":"l4q5Opk2Btg69jD7iO1_jg","user_id":"z2rwgHZ_0gxQdysWw_0XCQ","business_id":"H8RPjZJMrDC7nNcx2S6nHQ","stars":1,"date":"2014-05-23","text":"Worst furniture nightmare of my life!  Absolutely do NOT buy from these guys if you are planning on having your furniture delivered!  They showed up exactly at midnight on a Sunday and left damaged furniture that I tried to refuse.  They were supposed to send someone back the next day to pick up.  It has now been 4 days and I have taken 2 days off work for their so called scheduled pickup times only for them not to show up.  Absolutely ridiculous!!!  I lost more money in wage from unpaid work time then this was worth!","useful":7,"funny":0,"cool":0},
{"review_id":"tDK1SvIkQnXrKOt21V8RAQ","user_id":"eTG0FrgpMsasVATOy9vbxQ","business_id":"GhM6y2RX1zU-Gc0ustXsqw","stars":5,"date":"2016-01-08","text":"Great experience...The staff are so friendly and professional. Dr. Bazargan is very caring and knowledgeable... I am very happy with their service and will recommend them to my family and friends.","useful":2,"funny":0,"cool":0},
{"review_id":"bW4sSmAx7qHkLXDEFcDCFw","user_id":"eTG0FrgpMsasVATOy9vbxQ","business_id":"n43SvzsYHO_4UTC_QwrZKA","stars":2,"date":"2015-01-04","text":"they just wanna get rid of you and charge you. worst great clips ever","useful":3,"funny":0,"cool":0},
{"review_id":"7kcuQp7E3HUYJGpr_uhj4g","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"OyiOg9GYKzHI19EbnWqL8A","stars":4,"date":"2011-09-24","text":"Geez. There seems to be some negative buzz surrounding this place. Most of the stuff I read made it seem like there wasn't any shot of much good coming out of it. So, imagine my surprise when the food was good, the service was attentive, and the overall experience was one that I'd come back for.\n\nIn all fairness, a lot of that negative stuff I read was about their Theatre district location on King West, which I've neer been to, but that just doesn't hold much value for me. The fact is, most of those places on that strip of King seem to get a bad rap. Get 'em in, get 'em fed, get 'em out; that's their philosophy as they wait for theatre goers to arrive, and then again when they hope for them to come back after the show... thankfully, Hey Lucy's Annex location isn't anything like that.\n\nWith their soft lighting, chandeliers and black-and-white cow print seats, it's difficult to describe what exactly they were going for when they designed this place, but somehow, it works well and provides a nice backdrop, particularly for a date night. The ambience is hip, the decor is comfortable and cozy, and the space is of a decent enough size that it can easily accommodate both large groups and couples.\n\nHey Lucy is busy in the summer evenings, mostly because of their killer patio that lines the entire side of the building. Perfect for people-watching, this packed space is a nice addition to The Annex, and it holds up well against other patios on the street (except for Pauper's Pub!).\n\nProbably what Hey Lucy is most well-known for is their martinis. They've got a pretty decent martini menu with some interesting things on it, like the Godzilla and the Freedom 55, but man, these guys are expensive. Although they do come with a minimum of 2 ounces of booze, you can expect to shell out 9 bucks plus taxes for one. And while that may seem ok at first, having a few of them can easily add up... trust me on that. If martinis are your thing, but getting ripped off for them isn't, then you're definitely going to want to come back on a Wednesday. Wednesday is Martini Wednesday at Hey Lucy, and the prices drop to 4 bucks for the exact same martinis. But come early, other people like a good deal when they see one too, and this place fills up pretty quickly.\n\nTheir menu doesn't follow any sort of style; it's a bit all over the place, but it's still the sorta thing you might expect from a place like this. Pastas, wood-fired pizzas, paninis, sandwiches, all of it is pretty good, but unfortunately, this can unexpectedly change once the place fills up. In Hey Lucy's case, it's better to go when it isn't that busy.\n\nWhile I wouldn't go out of my way to go to Hey Lucy, if you're in the area and looking for a night out, Hey Lucy provides nicely.","useful":0,"funny":0,"cool":0},
{"review_id":"h3B3eG9lwnoXk2AlvqAtTQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"27_N5P9HZ86IviONPT_twg","stars":4,"date":"2011-11-28","text":"I'd read much about Woodlot in the last few months: about the fantastic bakery, the locally-sourced ingredients, the simplicity of the food and decor. Between the personal recommendations and the fawning of the print and online food community, the decision wasn't too hard to make to try it out. (The fact that it was voted one of the best new restaurants of 2011 by Toronto Life definitely didn't hurt.)\n\nWe popped into Kalendar for a drink beforehand (check out the rojo martini if you go. Most excellent.) and watched the world go by, including the chef of Grace, Top Chef Canada contestant Dustin Gallagher. Mental note: must get to Grace! We wandered over to Woodlot and as soon as we opened the door, the aroma from that spectacular wood-burning oven wafted over us. Figuring that was a good sign, we inhaled deeply and sat down at our cozy table. The restaurant looks like it seats about 50 on the upper floor with room for another 10 or so downstairs at the chef's table. The exposed brick walls are adorned with native Canadian art as well as knickknacks that lend a cottage-like vibe to the place. The waiters are dressed casually and it is explained to us that there is a standard menu, plus a separate vegetarian menu. I perused it quickly and was impressed to find a nice selection that didn't fit into the standard roast-veg-or-pasta options.\n\nWe ordered a bottle of cabernet franc and eventually settled on three courses: the scallop ceviche with black quinoa, whipped avocado and julienned red cabbage; Red Fife whole wheat papardelle with wood mushrooms and hazeluts; whey-fed pork chop with grilled treviso, tri-tip steak with caramelized onions and side of Jerusalem artichokes.\n\nWhen the bread basket arrived at the table after placing our order, we jumped right in. My dining companion loves bread and watching his face light up after taking that first bite of the gorgeous Red Fife bread was wonderful! I'd read about this particular grain in Sara Elton's book, Locavore, and was excited to check it out. It kind of makes regular bread taste entirely pathetic. We'd both had a couple of pieces of the various kinds when the appetizer arrived. The scallops were soft, the avocado was whipped into a lovely, airy bubble and these textures were complimented well with the crunchy quinoa and cabbage. I wish there'd been more of it, but we weren't exactly going to starve.\n\nNext up was the papardelle which was out of this world. Again, the Red Fife made a huge difference in terms of flavour. The wide, handmade noodles were cooked perfectly and provided much more dimension to the dish than you'd have otherwise. It was a very earthy plate, one that you wanted to hunker down with in front of a fire and never stop eating. I hope that's on the menu year 'round, because I would have it again and again.\n\nThe service at Woodlot is quite good, if not entirely exceptional. Importantly, however, they let you enjoy your meal in peace and the timing in between courses is well paced. We needed a little time between the hearty pasta and giant slabs of meat that would imminently arrive at our table. And giant slabs of meat they were: delicious, juicy, perfectly-cooked pieces of meat. My pork chops had that little layer of fat around the outside that you know you probably shouldn't eat, but can't help yourself because you know how good it is. The grilled treviso was a perfect compliment, too. The steak was exactly medium-rare as  ordered and was incredibly tender. The caramelized onions were an excellent accompaniment - in fact, I'd eat a whole bowl of those if they sold them. Even the Jerusalem artichokes were great - caramelized and not overcooked.\n\nTo say that we savoured every bite is not an understatement. Nothing was complicated (though I have a spot in my heart for complex food) or overwrought: in fact, we saw several dishes come out on wooden cutting boards. Dessert was very tempting, but we passed this time. I'd like to go back in the cooler months as I'm dying to try the marrow-infused whipped potatoes.  Of course, I also want to go back so I can eat ALL the bread that's there.\n\nSo there you have it. Great food, cozy and welcoming atmosphere. It's tough to get reservations on a weekend, but the hostess with whom I spoke to make our reservations was gracious and as accommodating as could be. I will definitely be making return trips here!","useful":2,"funny":2,"cool":1},
{"review_id":"Pswa777brp60Z7SYvptBeQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"RUd_M7DPJq1I3DPq0oF--w","stars":4,"date":"2010-11-27","text":"A neighbourhood staple, Lahore Tikka House is located on Gerrard East in the heart of little India. They do one thing and do it well: Halal Pakistani cuisine. The space is fairly plain, the decor is mostly barebones, and they've been 'under renovations' for the last few years. Despite that, this place seems to run seamlessly and churns some serious Indian food. Outdoors they have a large patio where the huge indoor space can spill over to in the warmer months once the restaurant gets busy, which it inevitably does. If the seating is full and there's a line at the door, no worries, this place has a great takeout service, which I usually get. Just call ahead, and it's usually piping hot and set for pickup in about 20 minutes.\n\nFlaky with hint of spice and smokiness, Lahore's samosas are better than your average samosas on the Gerrard. But my usual order includes the Vegetable Biryani. It's a huge portion of perfectly cooked Basmati rice, tomaotes, peppers, cauliflower, chickpeas, potatoes, and a mild blend of tumeric, cumin, and chili powder. I also love their Paneer cheese. The squeaky Indian cheese is an unaged curd cheese that is denser than tofu, but seems to absorb flavours just the same.  Lahore serves their Paneer Tikka Masala, and in my opinion, it's the city's best. Lightly seared and tandoor, it's served in a smoky, slightly spicy sauce; it's made the way it should be. And of course, be sure to order a side of their naan bread. Not only is it lightly oiled, seasoned, and softly charred, but it's also perfect for making sure you soak up all of the sauce.\n\nNext time you're looking for some Indian food, forget all those 'all you can eat' buffets and head to Lahore Tikka House on Gerrard East. It sets the bar pretty high for good Indian food in Toronto.","useful":3,"funny":0,"cool":2},
{"review_id":"jZ4bjL-A4X1iFtRzzvPLBQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"_mtAXGkVLLB6I9NddO-whQ","stars":5,"date":"2011-04-06","text":"There sure are a lot of tea places showing up nowadays, especially since the monstrous success of David's Tea. Say what you will about that corporate beast, but in my opinion, David's Tea has had a firm hand in pushing tea into the hands of mainstream Toronto. So, in a market on its way to becoming pretty heavily saturated, what's Tea Blendz doing to differentiate themselves? Plenty...\n\nFirst off, it's not a corporate beast. It's a little boutique shop owned by Khadija, an incredibly nice person whose passion for all things tea-related is almost contagious. That feeling of non-corporateness runs throughout the experience at Tea Blendz. Khadija is easily approachable, encourages you to ask questions, and is obviously passionate about the stuff she's selling. Not to say that the staff at those corporate places aren't passionate, but at Tea Blendz, it just seemed more honest.\n\nThey also have a pretty kick-ass teaspresso machine--one of the only ones in Toronto right now I'm told. Basically, it allows them to quick-press loose-leaf tea rather then steep it. That means you can get it faster and cleaner, and the whole process is under more control of the brewer rather than being at the mercy of the boiling water. Your tea will still take a few minutes, but those few minutes can easily be spent talking to the warm and pleasant staff. In fact, I ended up staying and chatting about tea and the neighbourhood for far longer than those few minutes that my tea was pressed.\n\nUsing the teaspresso machine, Tea Blendz also brews up some pretty amazing tea lattes. Khadija claimed they were the best in the city, and I can't say I'd disagree with her. While I'm self-admittedly not a tea or tea latte expert by any means, I thoroughly enjoyed it, and I could definitely see myself going out of my way to enjoy another one.\n\nKhadija works with local tea blenders to come up with a lot of her blends. They have plenty of classic flavours, like Earl Grey, English Breakfast, and Bourbon Street Vanilla, and some of that are hers and the blenders creation, like Chocolate Mint Delight, Root Beer Rooibos, and Sweet Pumpkin Spice. Despite being pressed and not steeped, the subtle flavours that the tea descriptions promised were still prevalent. I also picked up on a slight sweetness, which amazingly highlighted the even subtler flavours in the tea. All-in-all, I'd sort of equate it to wine-tasting; after tasting it, discussing the tea and its flavours seemed almost natural.\n\nKhadija mentioned that there's a growing trend in food and tea pairing. Because of that, I wondered if she planned on offering any food at some point, which right now she doesn't. I don't mean sitting down and eating a club sandwich and fries, but a small, one-bite of something that was specifically made just to be paired with a particular tea would certainly have been interesting. But Tea Blendz just opened a month ago, so things aren't yet set in stone.\n\nAll-in-all, I had a great chat with Khadija. I learned some stuff, and I even left with a few bags of tea. I brought home a bag of Chocolate Mint Delight and the Sweet Pumpkin Spice, and at 5 bucks for 50 grams, I left feeling pretty good about buying it.\n\nSo if you're in the neighbourhood, this honest-to-goodness, non-corporate boutique shop is definitely worth checking out and supporting. Even if you're not in the neighbourhood, it's worth the drive if you want to learn more about tea and if you appreciate truly nice customer service.","useful":6,"funny":0,"cool":6},
{"review_id":"-T7S40J4p6lEYfrR7BPsEA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"FeC5DeqINOSr37y5TABnKA","stars":4,"date":"2011-03-19","text":"If you venture away from the downtown core, just outside the hustle and bustle of the 9-5 crowd, the theatres and skyscrapers, you might just find a restaurant that is surprisingly unique and that shows some real passion. You can still see the CN Tower, but it all seems far removed from the tourist-focused mentality. Preparing food requires creativity and there is no better place for the chefs of Parkette to find artistic inspiration than on Queen West beside Trinity Bellwoods Park.\n\nA very tiny restaurant, Parkette offers an equally small, very succinct menu with starters, second courses, salads, pasta, pizza mains and desserts. The server tells me, \"our dishes are meant to be shared, like family-style,\" and so we did.\n\nA meal for two should typically be made of three dishes; a starter, a salad and a main or a \"second\" and two mains, and so on. They offer, what I would call, up-to-date traditional Italian food. Our starter of mussels in tomato broth, topped with fennel and white beans ($10), was just light enough to leave room for the heavier mains of beef cheeks on bed of polenta ($16) and ricotta gnocchi with oxtail ($14). The beef was tender enough that only a fork was needed to pull the pieces apart and, though not experienced with polenta, I thought it was appropriately soft and that it held up to the rich beef. \n\nAs mentioned in previous reviews, I am a new gnocchi-addict. Parkette's was not so dumpling-like as I've had before and it was certainly not topped with your typical pasta sauce. Little packets of tender potato, assumingly kept so soft by the ricotta, were paired with oxtail and sun-dried tomatoes in more of an aus jus, than a sauce. I think I had a bit more than my fair share of that dish - at a $14 price-point, this was the best of the night. The ingredients are bold, but the layered flavours hold up perfectly. \n\nHumble, but delicious, Parkette offers carefully prepared food in a great atmosphere; natural woods, stemless wine glasses and paper napkins prevent the tiny interior from becoming claustrophobic. Parkette does almost make you feel like you're having a lovely dinner in the park.","useful":2,"funny":0,"cool":0},
{"review_id":"2unf_arECVYH-rmbFuBerA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"QFPS9JBNdOOHVP0C3pSslw","stars":4,"date":"2011-12-07","text":"Earl's is nestled amongst the business giants at King and University and was teeming with suits and loosened ties on the Thursday night I paid a visit.  The place was packed, and I soon realized that this was not only attributed to its convenient location.  Earl's serves up some seriously good food.\n I'll be totally honest right out of the gate and say that I rarely frequent chain restaurants.  If I do, it's because it's for a birthday or office party where the show of hands wins.  Chain restaurants don't usually sell me on coming back for more.  Earl's did.\n\nWe started with the Tuna Poke Nachos ($11.50).  Served on crispy wontons, and loaded with cubed raw tuna, cucumber, avocado and tomato, they looked like they would be a task to eat.  I envisioned myself taking a bite and (if the toppings made it as far as my mouth without falling off) having it crumble, leaving me with half of a naked nacho, or in this case, wonton.  They surprised me though by maintaining their structure (and toppings).  The spicy mango coulis they were drizzled in leant a nice kick with some crushed macadamia nuts paying tribute to the Hawaiian roots of the dish. I'm not normally a big fan of sushi, but in this case the texture of the tuna and avocado married nicely with the crispiness of the wontons.\n\nNext was the Gnocchi with Italian Rose Sauce ($10.50).  I love gnocchi, but it is associated with being too heavy and too filling often because, well, it usually is.  Not in this case.  Earl's handmade potato gnocchi was the perfect consistency throughout.  Consistent consistency if you will.  And true we shared it, but it was a generous portion and neither of us felt weighted down afterwards.  That wasn't the best part though.  The title of the dish doesn't do it justice.  This gnocchi isn't served in just any ordinary rose sauce... it's served in a rose sauce made of San Marzana tomatoes, burrata cheese and fresh basil.  This, my friends, is the Margharita pizza of gnocchi.  Enough said.\n\nBeing ambitious (see: gluttonous), we welcomed the Pulled Pork Sandwich ($13.50) and Potato & Leek Soup ($7) to our table.  I'll start with the soup...although in reality that wasn't the sequence of events.  The soup was creamy and filled with chunks of potato (skin still on...because that's where all the vitamins are!).  It was good, but let's face it, it didn't compare to the main event of this course.  Even halved, our plates were dwarfed.  This is one behemoth of a sandwich.  Piled with tender BBQ braised pork and coleslaw then dressed with a fiery chipotle mayo, this sandwich was a nice balance of spicy and sweet.  It was messy like it should be so keep the napkins close at hand.  I had almost reached my limit but I knew dessert was on the way, so I exercised some will power (says the girl on her third course) and left a few bites on my plate.  I would be lying if I said I wasn't sad to see it go.\n\nYou might think that by this point we were too full to even consider the possibility of dessert, and by daily caloric standards, we probably should have been.  But we laughed in the face of those standards and pushed onward...onward to Warm Gingerbread Cake ($8).  Rarely do I find myself at a loss for words, but this cake found me there.  It might have had something to do with the fact that my mouth was full of the aforementioned cake, but also because it was really, really good.  I could use a plethora of colourful adjectives to describe this cake (see: heavenly, divine, decadent) but it all feels so cliché, and none of them would do it justice anyway, so I'm sticking with good.  Damn good.  It was served warm (as promised), drizzled with salted caramel sauce and with sides of brown sugar apple slices and vanilla bean gelato.  Now on any given day, I'll take a cookie over a slice of cake, but not on this day (or any day going forward where I'm given the choice between a cookie and this particular cake).  It was impossibly moist and as we ate it we debated about what made it so.  We came to the conclusion that... well, we didn't really come to any conclusion, except that it was killer, and we would be back for more.  Whoever is slicing the cake at Earl's isn't stingy (bless their soul) but that was one plate that went back to the kitchen devoid of crumbs.\n\nNow Earl's isn't the place to go for a quiet date.  The people are loud (because there are a lot of them), and the music is loud (because it fights to be heard over the people), but the food is excellent and the service, equally so.  It's a hike from my house in High Park to the Financial District, but one I'm willing to make again.  Three words folks... warm, gingerbread, cake.  Do yourself a favour.","useful":0,"funny":0,"cool":0},
{"review_id":"-YEDeSzvmGSDEGVmu3D0gA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"RtUvSWO_UZ8V3Wpj0n077w","stars":5,"date":"2011-11-23","text":"Have you ever walked into a restaurant and thought to yourself, \"Well, this is going to be different\"? It's an exciting feeling that doesn't happen all that often; but, walking into Guu Izakaya on Church St., I was definitely overcome by that thought.  Everyone who enters and exits gets a loud greeting and goodbye from the entire staff. A bit overwhelming, but it certainly sets the tone for your evening. The place is an absolute nuthouse in the best possible way.\n\nThat evening, my two companions and I were lucky enough to get seats within a few minutes upon arriving, a rare feat as I understand it. Guu features communal dining, with long tables that seat around 15 - 20 people, as well as seats at the bar where you can watch the chefs work. There is a two-hour time limit for diners and often a 1-2 hour wait for a seat. If you can, go early or prepare to cool your heels for a while. I promise you that it will be worth it.\n\nMy friends had been to Guu before so they did the bulk of the ordering. They chose the best dishes they'd had before and also took cues from our tablemates who'd ordered some fascinating fare. The menu is set up tapas-style, a fantastic way to sample all sorts of delicious creations. We ordered eight dishes for the three of us which was just about right and all were quite reasonably priced.\n\nThe first to arrive was the decidedly (and awesomely) decadent deep-fried brie served with a mango and blueberry sauce.  The four pyramid-shaped morsels were golden and crispy on the outside and gooey, rich deliciousness on the inside. Like, eyes-rolling-in-the-back-of-your-head-good. Next up: the salmon sashimi. Melt in your mouth greatness. It's one of those simple dishes that really sings based on the merits of great, high quality ingredients.\n\nOn to the bacon-wrapped scallops and enoki mushrooms. Holy. Smokes. Bacon-wrapped anything is a winner in my books but here the contrasting textures played against each other so beautifully. Paired with the salty pork, the sweet scallop and earthy mushrooms, this dish was so good that it was tempting to cancel the rest of our order and have nothing but this for the rest of the night.\n\nThe beef carpaccio was placed before our wide eyes next and it was a lovely, bright contrast to the richness of the dish before. Served with with ponzu, wasabi, mayo & garlic chips, this rare beef was light and, somehow, refreshing. It was nice to have a lighter bite after the richness of the scallops before.\n\nIt was at this point in our meal that I noticed a crowd of waiters pause from their constant, frenetic activity. Then I spotted a server with a slice of cake with a candle in it. Guu's birthday celebrations put Chuck E. Cheese to shame. Not only did the wait staff lead the entire restaurant in a rousing rendition of \"Happy Birthday\", encouraging everyone to clap and sing along, but even the insanely busy chefs joined in. At one point, they had the lights flickering on and off. Utter celebrational pandemonium and it was amazing.\n\nOnce the place had settled down a little (to be clear, Guu is the least settled place on the planet), the strangest creation of the evening appeared at our table. It was roughly the size of a softball, deep fried and had a wooden knife protruding from the centre. We wracked our brains trying to figure out if we had actually ordered it, decided we hadn't and dug in anyway. What it turned out to be was a Japanese scotch egg with a layer of pureed pumpkin surrounding a hard-boiled egg. While I was skeptical initially - I'm not a big pumpkin fan, much to the horror of many of my friends - the combination of the creamy pumpkin, rich egg, crispy exterior and tangy sauce was downright addictive. We just about scraped the plate without chopsticks long after other dishes had been cleared away.\n\nWhen the spare ribs arrived, it was all I could do to refrain from gobbling them all up myself. The marinated beef was tender and salty, having surely been marinated for quite some time. If you're a fan of spare ribs, these are a can't-miss.\n\nThe final dishes of the night were the decadent, baked oysters and the light, miso-glazed black cod. We ordered the oysters because we saw them arrive for another group at our table and they looked so unique! Kind of a twist on oysters Rockefeller, they're served with spinach and mushrooms, smothered in a potent mayo-garlic sauce and topped with melted cheese...all in a giant shell. This was a thing of glorious, messy beauty. The mushrooms nestled in there made for an umami bomb of a bite. Definitely give this one a shot, my friends. It's weird and tasty and I've never seen it anywhere else.\n\nNot only was this one of the best meals I've had all year, it was by far and away the most fun. Unquestionably, the company helped but the atmosphere at Guu is like none other. It's not the place to go for a quiet, intimate dinner; it's the place to go when you want to try innovative, playful and truly remarkable dishes.","useful":4,"funny":2,"cool":4},
{"review_id":"aebfsKiV7QpqKzhWBX4H4w","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"eaIVcOTMOeb8U2inN3UTzg","stars":3,"date":"2011-01-08","text":"If any description of this dessert-centric restaurant fits, it is \"the resolution-killer\" that rings the truest.\n\nThis is a sit-down restaurant offering a wide variety of sweets.  The menu is a full three panel - front and back - array of original creations, ranging from the unique and beautiful Lazy Sundaes to the Scoop du Jour - one or two scoops with cream and cherries.  Of course, you can also just select from the many offered toppings and ice cream flavours to create-your-own.  Ice cream includes peanut butter, nutello chocolate (not to be confused with Nutella) and vanilla-honey, amongst others.  On top of that, they throw in a freshly made crepe or waffle, some bananas or strawberries, chocolate sauce and a couple of dollops of the clearly-in-house-made whipped cream, and you have a dessert that will put you in a delightful sugar coma!\n\nIt was close to 11:00 p.m. when I made my way to Demetre's, but there were still a good number of sweet-toothed patrons enjoying some of the sugary creations - this was clearly be more than your regular two-scoop waffle-cone kind of place.  They make all of the ice creams on the premises, using fresh Ontario dairy and utilizing a special freezing process that prevents ice crystals from forming in the carefully crafted artisan frozen treats.\n\nThe servings provide you more than enough ice cream and extras to share comfortably, but my group decided to be gluttonous and each have their own; three ice cream crepe dishes, one with peanut butter ice cream, one nutello chocolate and one with the house chocolate.  The best thing about these desserts, right down to the whipped cream, is the balance of sweetness with the bold flavours.  There is a truly special way they do things that prevents the strong flavours from overwhelming the whole dish.  The peanut butter ice cream was nowhere near that almost sticky consistency and too-rich taste that can be attached to some PB creations; the whipped cream was a clean and creamy compliment to the light chocolate syrup; and the fruit was fresh and surprisingly bright considering the winter months.\n\nI am a self-proclaimed cheap dessert-eater, but here I felt like I got much more than I paid for.  The dishes come in at about $10 each - but, if you're sharing, which is probably more appropriate than polishing off a whole plate alone, it is quite affordable - especially for the top-notch quality.\n\nThe cherry on top was the service.  It was fast, friendly, and appropriately attentive.  A few casual checks were done here and there and an offer for re-fills was made - so simple, but so important.\n\nIf you haven't done so yet, check out Café Demetre. It's a sweet spot to get some sweets.","useful":1,"funny":0,"cool":1},
{"review_id":"-Uz4wUcs33HJw8GVXNZ_2A","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"HudCKBs3crW5mjaD7Y89gQ","stars":4,"date":"2010-12-22","text":"Sweet Flour bakeshop is a tremendously original idea. It's a custom bakeshop in Bloor West Village that revolves primarily around the cookie. Their website lays out their philosophy best: there is nothing quite like a cookie just out of the oven. That cookie, just out of the oven, and the experience that goes along with its creation, is exactly what Sweet Flour is all about. I say 'revolves primarily around the cookie' because although your perfect cookie is their goal, they don't stop at cookies. Everything from homemade granola to muffin tops and ice cream sandwiches to gingerbread is there for you to claim and customize as your own. For me, Sweet Flour delivers the experience of one of my best-remembered childhood memories: watching cookies bake through the oven window and patiently waiting for them to cool just enough to eat.\n\nSo what exactly does it mean to 'customize' cookies? At Sweet Flour, it means you're in charge of what's getting made. It all starts by picking what you want to bake. You can choose muffin or cookie batter, and from a couple variations of either of those, but your best bet is probably the classic cookie. It's perfectly sweet with hint of vanilla and butter. From there you decide what you want in the cookie; trust me, it won't be an easy decision to make. There are tons of different treats ranging from chunks of chocolate to crunchy nuts to soft dried fruits. You get a choice of two. Then they mix it, form it, and bake it ultra fast. Your cookie is perfectly hot and baked and in your hands in about two minutes.\n\nSweet Flour doesn't just stop at custom cookies. They also cater parties with baked goods, bake and decorate custom cookies for events, do cookiegram deliveries, and even package their cookies into kid's loot bags.\n\nOne thing is made perfectly clear from the minute you walk in until the minute you step out the door; these people care about quality. Everything in use seems fresh and high grade. From the glass bottled locally source milk to the fair-trade coffee to those incredible cookie ingredients, all of it seems to be bought with both quality and you in mind. A rare outlook nowadays when everything seems to be about the bottom line.\n\nThe aspect about Sweet Flour I immediately noticed is that their space has expansion written all over it. I'm sure this is the only one, but the layout, decorating, even the logo, all of it made it feel strangely familiar, like I was somehow used to it. This place definitely screams franchise, and I wouldn't be shocked to eventually see one downtown, at the mall, even at the airport. While that certainly isn't a bad thing for the business, I personally felt as though it sort of takes away from the connection to my childhood feeling.\n\nI know there are a couple more places in Toronto that do the same sort of custom cookie experience that Sweet Flour does, but I'm not sure who did it first. The only thing I can say is that I've been to Sweet Flour twice, and both times it was a pretty good experience from start to finish. However, although the cookie does come out hot, fresh, and made to order, it did cost almost 8 bucks for two of them and a glass of milk. Seems a little steep to me, but as a treat, it's nearly perfect.","useful":3,"funny":0,"cool":1},
{"review_id":"NyFCY7suqmtTQvROO66yRw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"lsxbnkAD5DZ4SuVPrFx39A","stars":4,"date":"2010-12-15","text":"Living in the Junction and relying on transit can make for a lack of choices when it comes to food, particularly stuff that's considered artisanal. While that may have been true a few years ago, boy-oh-boy, the times are changing. Those of us living in the neighbourhood awhile have seen its dynamic (albeit slow) change, particularly when it comes to food; but in the Junction's ever-expanding food landscape, a few places are setting the stage. Enter the Junction Fromagerie.\n\nJunction Fromagerie is sitting non-coincidentally right next to Delight, a chocolate shop that's perhaps known in the neighbourhood more for their ice cream than their handmade chocolate. Both Delight and Junction Fromagerie are brain-childs of the same people, Jennifer Rashleigh & Jeff Brown, and the association is obvious as far as quality goes. While Delight doesn't have any cheese, they do have a uniquely flavoured and way-better-than-it-sounds Quebec blue cheese ice cream. Soft and creamy with an exacting amount of high-quality blue cheese, it's obviously well crafted and surprisingly tasty.\n\nWhat makes the Junction Fromagerie different from the handful of other cheese specialty shops in Toronto is their strict direction to Canadian products; they only carry Canadian cheeses, local and artisanal mind you, but Canadian nonetheless. They're also particularly partial to Ontario cheeses. Their in-house made butter, crackers, and croustinis, in conjunction with those small-batch and locally sourced cheeses, make them a worthy underdog in an increasingly competitive business.\n\nThe Junction Fromagerie brings with it some old-world charm, and at first walk-in, you may mistake it for a boutique fromage on a quiet Paris street. Big-frame bay window and a creaky wood-laid floor set the space. Besides that, the whole store is fairly nondescript other than the front case brightly displaying their cheeses.\n\nDon't know your Comtomme from your Bleu de la Moutonndere? No worries! Not only is the staff knowledgeable and the cheese labeled and explained, but the Junction Fromagerie also offers cheese tastings and pairings that not only teach you about the cheese they carry, but also inspire you to be a bit more adventurous in your cheese selections. Although these tastings aren't a regularly occurring event, they do happen. Their Stone's Throw Cheese and WIne Pairing event, which was created with the folks at Stone's Throw Winery, sold out super quick.\n\nThe appearance of Junction Fromagerie signals more than just beautiful cheese being available in the Junction. It also serves as an important reminder that when it comes to food, the Junction is fast becoming a neighbourhood that is known for quality.","useful":4,"funny":0,"cool":0},
{"review_id":"wnVu_kYwVdjwCS3UmiGt6g","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"gAt8Vbrf4FiLqLIhkA4bZg","stars":4,"date":"2010-12-04","text":"I am not one who is opposed to going out and dining alone, but this is one place where you definitely want to bring a friend along. Offering a tapas-style menu full of Spanish dishes, with a hint of Latin American flare, Torito (Spanish for \"little bull\") gives you the opportunity to sample a variety of dishes and flavours, and provides a great atmosphere for sharing with friends.\n\nTorito's dining room is quite small, but has a great look and feel. Spanish pop culture images tastefully adorn the back wall and it has an intimate atmosphere and décor modeled after a traditional Barcelona Tapas bar - having never been, I will have to take their word on that.\n\nAt first glance, two things stood out about the menu; they had so many options for beverages that the wine and drinks section made up for half of their selection (no complaints here), and I did not know what most of the items were - Patatas Whatas?. Thankfully, the knowledgeable staff were more than happy to explain the menu to me.\n\nAlways an advocate for ordering the specials, I began with the Picos and Jamon, thin prosciutto-like ham wrapped around crispy breadsticks, and the Huevos Escoceses, boiled quail eggs battered and fried - quite good!  Following that were the Crab Croquettes and, with the server's recommendation, the Patatas Bravas and Chorizo, or potatoes and spicy sausage.  The Crab Croquettes were perhaps a bit soft for my liking as I do enjoy a bit of crunch, but they were seasoned and plated nicely.  The Patatas Bravas were my kind of \"meat n' potatoes\" - simply delicious!\n\nThe food is flavourful, fresh and clean, and is not hidden behind a barrage of spices and sauces.  Most importantly, it is served in a timely manner.  Torito offers hot and cold tapas, and instead of everything coming out at once to litter the table, it is brought out in a staggered sequence; the cold remain cold, and hot remain hot.\n\nOn my next visit--and I will make my way back--I am definitely ordering the Ceviche.  When it arrived to my neighbouring table, it looked fantastic!  If I can recommend something I did not actually taste, it would be that.  If you have tried it, please comment and let me know the verdict!\n\nA few cautionary items to draw your attention to: the restaurant is open only from 5:00p.m. - 11:00p.m., so it is not a late-night-bite place; there is an 18% gratuity (before tax) applied to parties of six or more (not unusual, but watch out for it); and Torito's spread is not for bargain eaters.  For my party of two, with only one single-serving alcoholic drink each, and a dinner of 4 appetizer-sized plates, it was just over $65 before tip.  That said, there is a difference between dining and eating; and Torito is a dining experience that I am happy I had.\n\nTorito is a \"little bull\" of a restaurant that packs a punch!","useful":3,"funny":0,"cool":3},
{"review_id":"b9bfnHrDKmJ0GiajNbTBUw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"VXlK-DWw4ADR4TE7Eou5Dg","stars":1,"date":"2011-08-25","text":"Margarita's Fiesta sounds like it should be a delightful, authentic, and fun Mexican dining experience. I had extremely high hopes for this restaurant. As a self-professed Mexican food addict, I could not wait to try this place out. But unfortunately, Margarita's Fiesta was no party at all.\n\nFriday night on Baldwin Street is a lively place with an excess of restaurants, all of them boasting lots of patios, people, music, and conversation; Margarita's is no exception. They have a cozy patio out front, a larger patio on the roof, and tons of colourful umbrellas and luscious plant life. Add in the sounds of the Gypsy Kings, and it's enough to lure anyone in.\n\nThe restaurant is quaint and decorated with traditional Mexican and Peruvian artwork, and the restrooms are an art gallery in and of themselves, a fitting homage to Mexico's own Frida Kahlo and her incredible self-portraits. Sounds fun! I know! But that was where the fun stopped...\n\nWhen we arrived, we were greeted with a grunt, and then pointed to a table on the lower patio. When we asked if we could be seated upstairs, we were told it was closed, only to see guests seated upstairs within the hour. Not a great first impression...\n\nIt took a solid 15 minutes before we saw anyone willing to accept our drink order of a pitcher of sangria ($24), which arrived with more ice than wine, a few apple slices, and little flavour. Ever the optimists though, we decided to overlook those and a few small details, and we were anxious to try the food.\n\nWe decided to start with their 'famous' nacho chips and guacamole, which arrived only minutes after ordering. The quick arrival slightly redeemed the long wait for cold drinks on a hot Friday night, but the fact that plates, or even napkins, were almost impossible to come by brought us back. Apparently, according to our server, cutlery is reserved for the special people that order entrees.\n\nAlmost a half hour later, we were finally allowed to order our mains, after numerous sidelong glances and polite 'excuse mes' to our server. Between the three of us we ordered the Chicken Taco Salad ($12), Chicken Quesadillas ($11) and Vegetarian Enchiladas ($14), each with a side of salad and\/or rice. When our meals finally arrived, they were much smaller than I expected, especially for a Mexican restaurant, which is normally known for their large portions size and abundance of extras like salsa, cilantro, sour cream, hot sauce; none of which found their way to our table.\n\nOur meals were okay, but certainly not noteworthy. The taco salad was crispy and fresh, but lacked the colourful palette of ingredients normally found on a taco salad and was overall, a little bland. The quesadilla was small-one tortilla cut in half-with a meagre side salad and no additional toppings to speak of. The enchilada was a decent sized portion, but swam in so much grease and oil, it was difficult to find the substance of the actual meal, whihc was supposedly green peppers, onions and cheese. Overall, we were really quite disappointed with our drinks and our meal. On top of the unfriendly and snail-like service, I was very underwhelmed by my experience at Margarita's Fiesta.\n\nIf you are looking for a fun, friendly and rewarding Mexican dining experience, be sure to try out Ahora on Dalhousie Street the next time you find yourself in our nation's Capital, which is Ottawa by-the-way;) Until then, I will be on the lookout for a Toronto Mexican restaurant that lives up to what a Mexican restaurant should be.","useful":2,"funny":1,"cool":1},
{"review_id":"LQbBYjuunnWaiLcc7r8vKQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"XmgdFa3G_CZVfjtQEJMZfQ","stars":4,"date":"2010-12-20","text":"On a recent, cold winter's Wednesday, I had the opportunity to have dinner at Caplansky's Delicatessen on College Street. Having heard a number of things about Zane Caplansky's mission to re-invigorate, or at least continue the waning culture of the deli, I was intrigued.\n\nThe first thing I noticed, besides the tiny vestibule, is the number of framed magazine covers and articles adorning the walls. It is obvious that this place has captured the attention of many reviewers, both far and wide.\n\nThe decor is pure deli. Open all the way back to the meat counter, with requisite white-hatted carver, it is a mixture of banquettes and bare wooden chairs. The walls are covered with kitschy pressed signs advertising everything from chopped liver to catering. Clearly, a lot of work went into making this place feel authentic; like it had been here for 80 years.\n\nOur server was quick to get our drink order and explain the daily soup and what the kitchen was out off. He was back, eager to help, a couple of times before our decisions were made.\n\nWithin moments, he was back with our soup order. The borscht was hearty and thick with shredded cabbage and chunks of meat. It was slightly sweet and full of flavour, with just a hint of tomato. Possibly one of the best borscht's I have had in Toronto. My guest's turkey soup, which happened to be the daily soup special, was interesting to say the least. Everything in the bowl, turkey and vegetables, was shredded very finely. It had a hint of smoke, which left us wondering if they were using yesterday's house smoked turkey breast. It was quite tasty, but completely unexpected.\n\nWith our soups almost done, our server returned with sides of smoked meat poutine. As a second course, it was the perfect size for two to share. The fries were crisp and cooked well. The gravy was more of a ragout of smoked meat and onions, seasoned thoroughly. The only complaint to be had was the small amount of curds.\n\nWith all our bowls cleared away, the mains soon arrived. I opted for a smoked meat sandwich. It arrived with a pickle spear and a small cup of oil and vinegar coleslaw. The meat was moist and well smoked. The fattiness was exactly as I ordered. The sandwich came unadorned with mustard, which was nice as four styles were provided for you to choose. The coleslaw was sweet with a little tang, neither overly vinegary nor oily.\n\nOn the other side of the table, grilled kebabs were ordered. The lamb was cooked perfectly, tender and a beautiful medium rare, with a nice crust, which pleasantly tasted of charcoal. Served with a grilled vegetable medley and side salad, it was quite a large portion. Care should be given, as the kitchen uses metal skewers, which, without warning from the server, turned out to be very hot to touch.\n\nAll in all, it was quite a good meal. Everything the kitchen put forth was prepared with pride. The only real issue was the desserts: a mixed berry crumble and a chocolate bread pudding. Both were incredibly sweet and had their issues with technique. Unfinished, however, the server asked what we thought and immediately offered to find something more appealing when we told him our thoughts. Kudos to the good service.\n\nCaplansky's Delicatessen lived up to the promise. The food is very well prepared and delicious. Coupled with the easy-going, friendly service, I can see myself going back there time and again.","useful":3,"funny":0,"cool":3},
{"review_id":"WF8IWKJOiZAepJRK4SA3cw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"oYWy-hOTCOF7h8DCAZ_Mxw","stars":2,"date":"2010-11-18","text":"Cool Hand of a Girl offers simple and healthy food made with organic products, which has become what you'd expect from a place in the Junction as of late. Don't get me wrong, I can appreciate how great I feel after a wholesome meal made with locally-sourced, pesticide-free food, but to me, one of the most important things that a restaurant can and should do is make their guests feel welcome. That's where Cool Hand loses points. Maybe it's all part of the appeal for the artsy crowd you can expect to see, but Cool Hand can make you feel as if you're an annoyance to them just for being there. So although I did enjoy my Chicken Tarragon sandwich, I just can't see myself getting back there anytime soon, and somehow, I dont think they'll care.","useful":4,"funny":0,"cool":2},
{"review_id":"4c4MYYrVnJXcTNb-uVCv5g","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"nu-DHeDtxnOW5vYj93dGPQ","stars":5,"date":"2010-11-29","text":"- If you haven't eaten at The Lakeview, I'd suggest you do.It's quickly become one of my favorite places to go when I'm craving diner food, but want to stay away from the typical greasy spoon diner type-of-place. The Lakeview is open 24 hours-a-day, and that definitely contributes to one of the cool aspects of this place: it isn't that you can eat imaginative diner-esque food at 3 o'clock in the morning on a Tuesday, but also thatyou can eat it at 3 o'clock in the afternoon on aSunday and the experience is entirely different.\nThat's because it's inconsistent, but not in a bad way. It's inconsistent because of the diverse group of peeps you can expect to see there when you go: Sunday afternoon is the brunch crowd, Saturday evening is the daters, Friday late-night is the Ossignton bar crowd. Whenever you go, it's a different sorta experience.\nIt's not just diversity that makes this a kick-ass experience, the food is also spectacular and truly imaginative. The style of upscale-diner definitely comes through on their menu withitems like theCorriander Walnut Pesto Omelette, a Peameal Brie and Havarti Cristo-style sandwich, and the Lakeface Albacore Tuna Melt. It's a genuinely nice blend of the expected and the unexpected. As a side note, I need to mention the impressive veggie burger they've got that's made from black beans and served with a wild mushroom saute and caramelized onions. Spectacular. Whether it's their 24-hour menu or their brunch menu, vegetarian or carnivore items, this place cranks out some delicious food.\nI'd definitely recommend you check out The Lakeview. They're doing diner food right, 24 hours-a-day.","useful":2,"funny":0,"cool":2},
{"review_id":"qp5HMCDxnXEmBudkZtskDg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":2,"date":"2012-03-30","text":"Here is the best advice I can provide if you're thinking about heading to Khao San Road:\n\n1. Make reservations. Since it opened, this place has gotten great buzz for providing authentic, flavourful Thai food. As a result, people from all over the city have been flocking to this casual downtown joint for lunch and dinner. (They also do take out orders.) My friend and I arrived at 6pm on a Thursday and the place was already almost full: tables of two and four, plus the larger tables at the front that could be utilized for larger parties or cafeteria-style seating and the bar were occupied by a mix of couples, friends and colleagues from the surrounding businesses. While we waited to be seated, I noticed a sheet of laminated paper at the host's stand imploring potential, hungry customers to be patient while waiting for a table to become available.\n\n2. Come hungry. Portions are more than reasonable and priced accordingly. We were starving and decided to try a number of dishes and split them between us: cold rolls filled with home-made chicken sausage, lettuce, carrots, mint leaves and Thai basil (Po Pia Pak Sod Gai Yaw); crispy squash fritters (Gra Bong); a curry dish with bell and hot peppers, kaffir lime leaves and the ubiquitous Thai basil (Gaeng Panang); pad Thai; and a house specialty of stir-fried minced beef with holy basil, topped with a fried egg (Pad Gra Pra). We also ordered the only beer available, Singha. Not entirely sure why there is only one, but it's a light, refreshing beer and I had no complaints about it.\n\n3. Temper your expectations. The food at Khao San Road is good, yes,but it was not exemplary. It wasn't bad by any means, but I had very high expectations that were sadly unmet. The exception was the Pad Gra Pra which was very, very good. It's a house specialty so if you go, you might be best to stick with the items on that particular part of the menu. There was nothing wrong with the food in particular; however, after hearing such glowing reviews from both friends and reviews, I was anticipating more.\n\nAdditionally, we found the service lacking. Our order was taken promptly and our first round of drinks appeared in short order. The problems started when food began to arrive at our fairly small table faster than we could eat. I pointed this out to our server who shrugged and kept piling on the plates. Once we had all our food, our server disappeared, a problem on two fronts: we had no room to maneuver and we wanted another round of Singhas. We were able to flag her down eventually and we were served with much reluctance from that point.\n\nKhao San Road is not a bad restaurant by any stretch. The food is better than average but not spectacular. Stick with the house specialties and you'll likely do well. If you're going to go in for a sit-down meal, reservations are a must. Better yet, call ahead for take-out and have a couple of beers ready to go at home.","useful":1,"funny":0,"cool":0},
{"review_id":"SSM8AKnHtAk7Ajdp5wgMeA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"MzjfSbFFTEVlX4Lp2kHg_Q","stars":5,"date":"2011-05-25","text":"My chicken lived a healthy, happy life. She was lovingly cared for, allowed to roam the yard, and fed fresh corn and barley. How do I know? The other day I was going to my neighbourhood grocery store to buy a whole chicken. You know the type of bird I mean. It sits in those refrigerated, glass boxes at the back of the store; the only indication it was ever a chicken at all is the familiar sight of wings and breast meat. As its lifeless body sits there, I can't ever imagine this thing having feathers, breathing, living. Truth be told, buying that chicken is a mostly unceremonious experience that people rarely give a second thought to.\n\nBut something spectacular happened to me that day. I didn't buy that chicken; I didn't even get to the grocery store. On my way there, I noticed the Butcher by Nature storefront, and I felt compelled to check it out and see what all this 'By Nature' business was all about.\n\nButcher by Nature gives life to that lifeless chicken. Much like purchasing pedigree, the butcher and owner, Frank, knew all about my chicken and all the other chickens he was selling for that matter. He knew the farmers personally, and he knew that they were passionate about raising animals. He spoke proudly about the pesticide-free and natural-focused environment the farmers raised their livestock in. Clearly, this is a different kind of eating.\n\nThe shop is fairly small, but truly cozy, and the store is classic with more butchery area than retail shop. The retail area has shelves lined with locally-sourced dry products, like jams and honey, and fridges lined with locally-sourced meat products, like duck and eggs. Butcher by Nature also has a passionate, knowledgeable owner. Actually, forget that last bit; calling Frank knowledgeable is an understatement. The art and science of butchery is seemingly ingrained in his bones. Much like those chicken's proud lineage, Frank was raised to do butchery.\n\nPesticide-free, hormone-void, locally-sourced meats, combined with an experienced owner and a pleasant store-front is what Butcher by Nature is all about. And of course, they're not limited to just chickens. They carry quite a large variety of meat including duck, venison, pork, and beef; all of it butchered and prepared in a bunch of different ways.\nFear not. Eating all this organic natural stuff isn't for just the rich. In fact, most of the products at Butcher by Nature are actually reasonably priced. In most cases, you can expect to pay just a few bucks more than you would at the neighbourhood grocery store. That, combined with the absolute passion surrounding what they carry makes it an easy choice for meat. Even if you're not in the area, Butcher by Nature is worth the trip.\n\nSo, if you think that chickens, or most other animals for that matter, magically end up in refrigerated, glass boxes at the back of a grocery store, then you owe it to yourself to check out Butcher by Nature because when it comes to meat, it's all about where it comes from.","useful":5,"funny":0,"cool":2},
{"review_id":"B2l4WqDSqYksZw_jqZA1LA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"FML0YqZ7dLBBC3Suap4_4Q","stars":4,"date":"2011-02-05","text":"Offering up \"snacks and libation\" from 5pm to 2am, Monday to Saturday, this brand new spot just north of Queen proves to be a great and funky stop to grab a little bite. \n\nThere are three reasons why this new restaurant appealed to me... \n\nFirst, the atmosphere is very cool and casual - there really is no theme or décor; it almost looks as though they opened before they were done decorating, but in a charming way that allows it to become almost homelike in its honesty. Even the menu is printed on a piece of lined paper that remains set on the table on a (mini-sized) clipboard.\n\nSecond, someone here has tapped into that great ordeal; you have already eaten dinner, but the energy spent on socializing has left you feeling a bit ravenous. The problem is that you don't want to go out for a whole second meal. The answer: Snack Bar. The small, inexpensive portions are a perfect pairing with after work drinks (you won't ruin your dinner appetite) or a nightcap (you won't stuff yourself to the point of uncomfortable).  \n\nThird, they understand that \"snack\" to food-lovers means more than grabbing a granola bar or settling for a muffin for satisfaction.  They have nibble-sized some of your favourite late-night snacks, including a grilled hot dog, pork belly on a bun, Jamaican beef patties and pizza pockets at an appetizing price-point of $3 - $6. There are a few other items, like oysters (coming in at $6 - $7) and latkes with gravlax, to give the menu some oomph.\n\nI started with the pork belly on a bun, one of items I saw featured on their website - a delicious crispy pork morsel tucked inside a steamed bun, filled with Asian-inspired flavours (like Hoisin and chili sauces) and some leaves of arugula, making a wonderfully balanced salty treat. \n\nThen, I rounded things off with a grown-up version of the nostalgia-inducing pizza pocket. This is really more likened to a mini-mini-calzone; it's crispy and airy, stuffed with cheese and laid upon a bed of rustic tomato sauce. After the super flavourful pork belly bun this almost seemed bland, but it was perfectly cheesy and the crunch was on-point. My dining partner caved in and got the hot dog - it was smaller than expected, but hit the spot - followed by the Jamaican beef patty. Both were good, but the bun and pocket are a more interesting choice at the Snack Bar. \n\nThe drinks menu is very scant, but I won't sneer at a cold beer. Overall, I think 416 Snack Bar is on its way to being one of those great spots in the city. I'm going to keep my eye on this one - it's something new and unique and, I use the word again, honest. This could prove to be a new favourite for many a food-loving Torontonian.","useful":2,"funny":0,"cool":2},
{"review_id":"9RuZXO2Mn0qb5qFDL_H-vg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"SEvUFPydtLJ5eExD32Agxg","stars":4,"date":"2012-08-04","text":"Crepes aren't just for dessert folks.  That's what Dewey Truong, owner of Chococrepe wants you to know.  Yes, they are paper thin, but they aren't as one dimensional when it comes to their meal potential.  Walking into the Queen West restaurant on a hot summer day, the last thing that I wanted to eat for lunch was a Nutella and chocolate smeared crepe, so it's a good thing there was so much more on the menu.\n \nDon't let the name fool you.  At Chococrepe, the menu is divided into savoury and sweet options.  So yes, they do offer the obligatory Nutella crepe along with a slew of other sinfully sweet creations, but they also have an impressive selection of crepes with fillings usually associated with sandwiches or wraps.\n\nTo start off we had the Pesto ($9.25) which came with egg, mozzarella , pesto and arugula served on a buckwheat crepe.  Now I'm not an eggs anytime of the day person as I lump them into the breakfast only category, so this probably wouldn't be my go to crepe, but it was tasty nevertheless.  The egg was fluffy, the pesto made its presence known without stealing the show, and arugula is never a bad idea. \n\nAll of the savoury menu items come served on buckwheat crepes which are a bit similar to whole wheat wraps in their texture and consistency.  Despite the name though, it's interesting to note that buckwheat is gluten free, so while I can't speak for the filling, the crepe itself is a good option for those who are at least sensitive to gluten.\n\nTo round out our savoury options we tried the Country and the Chipotle Chicken (both $9.25).  The Country comes stuffed with cheddar and punctuated with wood-smoked bacon and caramelized pear.  I'm not even a huge fan of bacon (I know...sorry) but I loved this crepe.  The saltiness of the cheddar, the smokiness of the bacon and the sweetness of the pear blended so nicely into a ménage a trois of flavour. (What?  It's French...like crepes...)\n\nThe Chipotle Chicken though, with a generous amount of tender chicken breast, mozzarella, arugula, and chipotle mayo, might have been the winner, but I like anything that comes served with a side of heat.\n\nAt this point it's fair to say we were beyond full, and I was convinced that yes, crepes could be lunch, but it wouldn't be fair of us to ignore the dessert crepes completely.  So we tried two.  The Berry Banana ($8.75) is the Platonic ideal of a dessert crepe.  Covered with sliced strawberries and bananas, then drizzled with dark and white chocolate, it looks like art (think Jackson Pollock).  This crepe had a nice balance of tart, thanks to the strawberries, and sweet, thanks to everything else. \n\nOur last crepe of the day came in the form of Crunchy Pear ($8.50), also beautiful in design with sliced Bosch pears, a generous sprinkling of crushed almonds, and painted with milk chocolate, it was a bit sweeter than the Berry Banana due in part to the milk chocolate, but won in the texture category.\n\nAll of the dessert crepes here are made with the typical sweetened wheat flour and served open-face which gives diners the artistic license to fold, roll, or just dive in as is.  And it just looks prettier.\n\nOh, and I should mention that all of the crepes are huge, taking up plates that are larger than your average plate.  My suggestion is to bring a friend, or two, and sample multiple crepes like we did.\n\nDid I forget to mention the hot chocolate?  Oh yes, we sampled a couple.  They take their hot chocolate seriously here at Chococrepe.  All flavours are made with melted Valhrona chocolate and you can have your choice of having it made with dark or milk chocolate (and in some cases, white) and with cream or milk. We really wanted to try the popular Fleur de Sel Dulce de Leche made with dark chocolate, but sadly it was unavailable, so we went with the Pumpkin and the Coconut.  The Pumpkin ($5.95) was made with milk chocolate, so as not to overpower the spice and milk instead of its heavier counterpart.  It was tasty, but I would liken it more to a chai latte than a hot chocolate.\nThe Coconut (also $5.95) however, made with white chocolate and cream was something else.  It was rich without being cloyingly sweet and the coconut flavour came through nicely.  I can definitely see myself going back for one of these once the temperature starts to drop, but if you're craving one now, Truong just installed a brand new air-conditioning system that he's very proud of. \n\nI would also be remiss not to comment on the excellent service at Chococrepe.  Truong himself is a living doll, and he goes out of his way to make your experience at Chococrepe a memorable one.  He obviously loves what he is doing, and says that he wants eating at his restaurant to be a comfortable and social experience, not to mention a delicious one.  Check, check, and check.\n\nFootnote:  Why doesn't the saying go \"as flat as a crepe\"?  Let's face it, in comparison, the crepes pancake cousin from the West has a bit of a weight problem.","useful":8,"funny":4,"cool":4},
{"review_id":"klqQO7GQk9VP4TH9qFPfUw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"F2PcvHf7G8QwCDSJ1-7fFQ","stars":3,"date":"2010-11-17","text":"With a secluded feeling and an amazing view of the Toronto skyline, Pauper's Pub arguably has one of the best patios in Toronto. The wings are slightly charred and saucy, and they have a pretty decent draft selection. While the second floor lounge is a cozy space, the first floor could use a reno because with its handmade 60's fabric lampshades and dull brass railings, it definitley doesn't hide it's age well.","useful":1,"funny":0,"cool":2},
{"review_id":"Bsaig80p_SxxCXca3O6cUA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"MS-hfug4QDXqb_Mws3qlzA","stars":5,"date":"2012-01-22","text":"Let me start by saying I am truly a Latin American food snob. I am fortunate enough to know what the good stuff - the real stuff - tastes like, and I resent those who do it poorly. It's not difficult food to make, but it takes both time and love to create great Latin American dishes, and it frustrates me when I see melted cheese from a jar smeared on store-bought chips that are passed off as \"Mexican food\" in restaurants. So it was a relief and a thrill to hear that the head chef from The Black Hoof was helming Grand Electric and promised, \"Mexican food, craft beer, brown liquor and loud music.\"\n\nI met my dinner companion across the street at The Mascot at 5:45 and watched as a line started to form outside Grand Electric. The baristas suggested we get ourselves over there before the line up got too long, warning us we'd be eating at 9pm if we didn't get it in gear. We dutifully lined up at 5:50pm behind two parties. Within five minutes the line had extended half a block behind us. At 6:02pm, the doors opened and people flooded inside. We were shown to a table for two and marveled at just how quickly the small space filled up. Tables were gone by 6:05 and the bar was full a minute later. Music blared, servers started making their rounds and Grand Electric was off and running.\n\nThe bar is quite the thing to behold. Bourbon-heavy, it is run by enthusiastic and well-informed staff.  It towers over patrons and is a great focal point for the restaurant. In addition to bourbon, you can try several craft beers including Churchkey and Canucklehead cask ale. Both are excellent, but if you haven't tried a cask ale, you should know it's not carbonated. Don't let that dissuade you from checking it out, though, as it has a fruity and slightly bitter taste. You'll be hooked after your first taste.\n\nThe menu for Grand Electric located at the back of the restaurant on a giant chalkboard. It is split up into appetizers, tacos, specials and dessert. Given the advanced buzz that's been generated, we opted to try as many dishes as possible. We had the guacamole and nachos (an excellent test of a Mexican restaurant's mettle), tuna ceviche, chicken frito appetizers, one of each taco, and in the end, we went for the key lime pie for dessert.\n\nBeers in hand, we eagerly awaited our food which came out surprisingly fast considering the kitchen must have gotten just crushed with all of us arriving at once. First up came the guacamole and chips. The dip was generously salted and had lots of lime juice, essential elements both. Without enough of those two simple ingredients, guacamole falls flat, but this was the best restaurant-made I've ever had (oh, and it comes with a huge serving of light-as-air pork chicharron as a garnish; a great aesthetic touch as it towers over the guacamole & chips). The fresh corn tortilla chips were also both well seasoned and delicious.\n\nA plate of three tacos was delivered to us, and we hung on every word our server said as she explained which taco was which. The first three were the sweet pork belly al pastor with pineapple, the fried queso (cheese) and spicy arbol chicken. It's not that spicy, I promise, especially considering some of the other choices. Of these, the only miss was the queso which I thought could have benefited from some salt. Having said that, the other two were simply wonderful, especially the pork belly.  We also tried the Baja fish taco, a lightly breaded tilapia fillet topped with bright, fresh cabbage. The textures of the soft tortilla and the crunchy, crispy toppings had us grinning from ear to ear.\n\nNot-to-be-forgotten is the chicken frito dish we ordered: a mound of crispy, fried chicken pieces slathered in a sweet and citrus-y coating and sprinkled with healthy doses of cilantro, jalapeno peppers slices and little, red, evil chile peppers. I like heat, but skipped over the red chiles in favor of the jalapenos. Sweet, sour, spicy, juicy, crispy, hot...there was nothing about this dish that should be changed. Ever. I will most definitely be ordering this one again.\n\nOverall, this was one of the most fun and delicious meals I've had in Toronto. The atmosphere is supercharged in the restaurant, filled with happy customers taking pictures of and devouring the food coming out of the kitchen. While you can hardly say that each dish on the menu is truly, authentically Mexican, it hardly matters when it's this good. A word to the wise: go early or you will be waiting for hours for a seat, but even if you do end up waiting, it'll be worth it. There is no other place in the city putting out food like this.","useful":5,"funny":0,"cool":2},
{"review_id":"1CJVt_LZ_3gZCGxa1chM8w","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"xD293QcX3kHO5Z1Kz5zPww","stars":4,"date":"2011-01-05","text":"Coffee Tree has some seriously outstanding coffee. I guess they should. They tout themselves as being Toronto's first onsite roastery--since 1988. Despite all that time, it's not a colossal roasting operation. In fact, it's a small machine in the front window of the shop, but that's part of the appeal of this place: fair-trade coffee roasted onsite, in small batches, right in front of your eyes.\n\nAs it becomes available, Coffee Tree scrawls all of their different roasts and blends of contrasting kinds of beans on a chalkboard near the front entrance. Some of these blends and roasts change from time-to-time; others are Coffee Tree's signatures. On any given day, you can expect to find Casa Primi, Sensuous Morning, Tuscany, and Millionaire's Mixture; some of their well-known signatures. Other days, you can find blends that have been created exclusively for the week or month.\n\nRegardless of what you choose, this coffee is superb, roasted perfectly, and balanced. Sip it slowly, and you'll definitely find complexity. There's the perfect blend of sweet and savoury and none of the unpleasant bitterness you'd expect from other coffee shop brews.\n\nBut it ain't all coffee at Coffee Tree. They've got a surprisingly detailed food menu, considering it's a coffee joint. From breakfast, lunch, and dinner, to French toast, sandwiches, and empanadas, they've got something for whatever time of day you go. They've also got a chilled dessert fridge featuring in-house made desserts, which includes what they call--and I'm inclined to agree--the World's Best Carrot cake. If you're there, give it an unregrettable try.\n\nThe shop layout is the typical long narrow space of most Toronto street-level businesses, and unfortunately, their furniture and decorating ideas aren't much of a help. Despite having unforgettable coffee, the space makes the experience of drinking it feel closed off.  They do, however, support local art by featuring a local artist's work on their walls for sale, and that certainly is a plus, but when I was there, the art wasn't something I was particularly captivated by; but I'm told it changes. All this place really needs a little reno, and it would be near perfect, or at least get 5 stars in my review.\n\nDespite the poor decor choice, they still roast some brilliant coffee. Even if you're not in the neighbourhood, it's worth the trip.","useful":3,"funny":0,"cool":2},
{"review_id":"nM4LQHx_IgDckOQCylOyBg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"TrOgTZ0DfmQxvpTehiNibQ","stars":4,"date":"2011-08-13","text":"We visited Brassaii during Summerlicious this year and their selections were fabulous. Prior to ordering our meals, we focused our attention on their specialty cocktail list which featured several special mixed drinks and Caesars. I wish we could have tried them all. Instead, I settled for a tasty Gin Caesar topped off with a slice of cucumber and a grape tomato; while my date enjoyed a Balsamic Bramble: a sweet mixture of gin, chambord, and champagne crested with some fresh fragrant berries.\n\nChowing down for dinner after taking the edge off; I ordered a sweet flavoured vichyssoise topped with a chive creme fraiche as my appetizer; sirloin steak frites served perfectly to my liking with a sensational chimichurri sauce that sent a wave of excitement through my taste buds accompanied by perfectly seasoned Yukon fries; and although I normally pass on dessert; I, thankfully, let the temptation of their dark chocolate raspberry delice overtake my sanity to perfectly cap off my dining experience.\n\nMy date enjoyed two crab cakes served with curry aioli and mango salsa as her appetizer which looked very tasty, and I suspect they were SO tasty, and that that was probably the reason I wasn't even afforded a nibble. Her entree was a filet of baked salmon seared to pink perfection, with a pureed mash of wasabi potato and fennel, presented elegantly next to a julienned citrus salad; and, as her sweet tooth is always stimulated, this time she enjoyed an almond butter cake topped with freshly sliced strawberries and a Brassaii specialty their home-made basil ice cream.\n\nAll in all, I definitely would'nt hesitate to recommend Brassaii. It's a true neighbourhood gem that isn't as hard to find; it's located just 100 metres west of Spadina Avenue on the south side of King Street West.","useful":0,"funny":0,"cool":1},
{"review_id":"FlgobZpaP-5kQFg0UP9s8A","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"ts_kVtBEAJsdmdoqxRDdRQ","stars":5,"date":"2011-12-10","text":"What makes for a great neighbourhood restaurant? There are certain essential qualities that it must have: a friendly, knowledgeable staff, a charming host, great atmosphere and above all, fantastic food. Tabülé is unquestionably one of these restaurants. Serving amazing Middle Eastern cuisine, Tabülé is a midtown spot not to be missed.\n\nTabülé offers fresh, intensely flavoured dishes from start to finish. Over several visits, I have had the pleasure of trying about half the menu and have yet to come across a dish that wasn't utterly delectable. Normally not a big fan of eggplant, I make exceptions here for the babaganüj, a gorgeous pureéd eggplant dip mixed with tahini, garlic and lemon juice. Additionally, the fried eggplant has great char on it and is finished with a lemon & garlic dressing that adds a bright note to the soft, creamy, rich starter. Not to be overlooked are the fresh, pungent tabülé and the labni which is a yogurt cheese mixed with a healthy dose of garlic and topped with zaatar. Finally, the hot cauliflower appetizer was recommended by the host who did not steer us in the wrong direction. Finished with Lebanese tahini, there were polite fights over who would get the last morsel.\n\nOnce you have gorged yourself on the hot and cold mezze (starters), it is time to move on the main event. There is always a fresh fish of the day, topped with the bright house lemon and garlic dressing. The grilled mains all come with heaping portions of rice with crispy onions for texture as well as grilled peppers, onions and zucchini. The kefta is certainly a popular option and a tasty one at that. Consider them Lebanese meatballs, made with a mix of ground lamb and beef, tomatoes, onions, parsley, garlic and lemon juice. Always perfectly cooked, they are steaming hot upon arrival at the table, a little bit pink inside. Also fabulous is the charcoal-broiled shrimp that have been marinated in Middle Eastern spices. Spicy and succulent, they are even slightly better with the squeeze of lemon that accompanies this particular dish. You will not want to share them with your dining companions.\n\nWhile you are thoroughly enjoying your food, take some time to look around and drink in the atmosphere. The restaurant itself is cozy without feeling claustrophobic and the dining room is host to just about every demographic in Toronto. You will see couples on dates, families, birthday celebrations, even bachelorette parties. On Saturday night, people wait patiently at the bar for a table and are entertained by the belly dancing show at 9pm. Though a little calmer during lunch, Tabülé certainly does not lack atmosphere. Upon return visits, you will notice that you see the same wait staff over and over again - a good sign in a turbulent industry. Hospitality is the name of the game here, and it is done expertly.\n\nShould you have room for dessert (and if you don't, just loosen your belt a little. It's worth it), check out the künafa ashta. Lebanese custard is topped with super fine shreds of phyllo pastry, pistachios and rose water syrup. Light and not overly sweet, this dish is a superb way to end a meal and is a paradigm of why Tabülé's menu is so successful: it combines many elements in a balanced, seamless dish. It is at once creamy, crunchy, a bit tart, a bit sweet and is highly aromatic.\n\nLike the final course of the evening, all the dishes at Tabülé balance flavor and texture and, because of this, the food is elevated beyond the ingredients. Pop in for a meal, or have one delivered to you: either way, you enjoy a hearty, mouth-watering meal that will have you coming back for more.","useful":0,"funny":0,"cool":0},
{"review_id":"DEsNyUYLdjbi7e2DHR1WOw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"ULl0tYsqcHe3S-TqKD3mjw","stars":4,"date":"2011-02-21","text":"About a year ago, Bloor and Lansdowne saw the closing of its neighbourhood institution: The Dale. The Dale had been serving 'greasy spoon' diner food in the neighbourhood for nearly 60 years, but what emerged from behind the brown paper and dressing screens of a renovation was so much better.\n\nThe Bloordale Pantry, opened by young couple Rose and Anthony, has moved this venue from institution to gem. A lot of love went into this place; and not only love for their little diner, but also love for the neighbourhood in which it sits.\n\nUpon entering, the greeting was warm and friendly, which wouldn't be strange as my guest and I have eaten there a couple of times, but you don't need to be a regular to feel at home; every one of their guests seems to be rewarded with a warm smile and happy hello.\n\nThe room is decorated with local art mixed with diner kitsch. It's all brought together by red vinyl booths lining one wall, and an old dinerstyle counter and stools lining the other.\n\nThe menu's main theme is diner food with an all day breakfast and lots of sandwiches, but it's all updated regularly and prepared well. It also features a lot of Italian fare with both a panini and pasta section.\n\nOn a recent visit, my guest tried the 'Mac'n'Cheese', which she thought was cheesy and good, albeit needing a little more flavour. My Bloordale Brisket sandwich was sloppy and well cooked--as it should be! The brisket meat was tender, but not falling apart. The barbeque sauce was a little sweeter than I generally like, but overall the sandwich was filling and comforting just like diner food is supposed to be. Served with their expertly seasoned and perfectly crisp French fries and creamy coleslaw, it was quite a large portion.\n\nOpen for breakfast, lunch and dinner and with a menu that has vegetarian options and interesting daily specials, like meatloaf, 'Jalapeno Popper' burger or house cured trout, The Bloordale Pantry pretty much offers something for everyone.","useful":3,"funny":1,"cool":1},
{"review_id":"LSoQi3v7L0R9fcjzHuW5AA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"WlkOFaqRL5vtYZZ7fl4x1Q","stars":4,"date":"2010-12-03","text":"- It wasn't that long ago that Bloordale was a strip of Toronto that felt neglected. In fact, most people may feel like its still neglected, but looking around, it's evident that there are signs of improvement. That's where Three Speed comes in. Located unseemingly near Pauline on Bloor street West, they definitely took a risk opening up in this somewhat seedy Toronto neighbourhood. But regardless the risk, it seems to have worked for them. Packed nightly with 20-something hipsters, it's difficult to get a seat if you show up past 8 or 9 o'clock, but don't let any of that stop you. As far as 'Blansdowne' goes, bar-wise there just isn't much that competes with it. \n\nThree Speed is brought about by the same people that started the Communist's Daughter, and they also have some affiliation with The Dakota, so you can expect the same sorta crowd and atmosphere--and dare I say pretentiousness--that you'd expect to see in any of those spots. If you can find the dam place that is...\n\nThree Speed is difficult to notice. In fact, if you weren't directly looking for it or didn't know where it was, you'd probably go right past; and if it wasn't for the red lights strung about the front window spiking my curiousity, I probably wouldn't have ever discovered it either. So when you're walking around Bloor and Lansdowne, and you finally do find it and get inside, the hidden-factor sorta gives the feel of a Bloordale oasis.\n\nThe inside of Three Speed is not what you'd expect by the near-crumbling exterior. Inside it's dimly lit, low-key, and seriously comfortable. With exposed brick, wood panels, and art galore, it's an easy place to want to hang out at.\n\nScribbled on a chalkboard and suspended on the bar wall, Three Speed has a slightly random food menu that displays their feature items, like mussels served in 1 of 3 styles,  Lo, Med, and High, indicating 'speed' but not content. You can expect well-rounded flavours of lime, fennel, and roasted garlic. No mistake, these are mighty good mussels.  But if there's a bunch of you, and mollusks aren't your thing, I'd recommend the Party Plate. It's a nice spread of cheese, meat, and pickled goodness. If you're not the sharing type, I'd go with the sirloin burger. Although I've definitely had better, this is still a savoury and sizeable burger that won't disappoint you.\n\nLike I said, it feels like the neighbourhood is on the mend and slowly losing its feel of neglect. There are even a few other cool spots that followed suit and opened up in this neighbourhood, like Holy Oak and the Starving Artist; both businesses that are beginning to do well.\n\nIf you're in the Bloordale area, hanging out at Three Speed is an easy, but slowly becoming not the only option. But the fact remains, these people have taken a crappy, ex-Karaoke dump in a less-than-desirable neighbourhood and turned it into something special that is directly impacting the culture of Bloordale and for that, they definitely deserve to be commended. Nice job Three Speed.","useful":4,"funny":0,"cool":3},
{"review_id":"-_hUevRiFvXx7Yt8bB1xUg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"PUDtJu2bFTvIl1_WhyUIXQ","stars":2,"date":"2010-11-17","text":"It's just overpriced, ill-prepared pizza, but because this place holds nostalgic value for a lot of Junction locals, it's often busy. You're better off grabbing a slice on the takeout side of Vesuvio's. A slice is cheaper, and for some reason tastes far superior.","useful":3,"funny":0,"cool":0},
{"review_id":"wkD3Yrzty5_iTBWmCN9qQw","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"VBcmyBxAPcpzbbnPbFfttA","stars":4,"date":"2011-02-05","text":"Out on a cold winter's week night, some friends and I thought we'd head to Terroni on Adelaide for a casual bite. Not having a reservation, on what appeared to be a very busy night, the hostess recommended that we try their new venture, La Bettola di Terroni, which was close by.\n\nOnce we arrived, we were all immediately impressed by the glass-walled pantry in the entranceway. It is always comforting to find a restaurant that flaunts its freshness. To me, it screams, 'Come in! We know what we are doing!'\n\nWe took the advice, and waited for a table in a very cramped entrance way. With three other patrons in front of us, the hostess desk seemed very busy, but soon we were greeted and seated having had a table reserved at the suggestion of the hostess at Terroni.\n\nThe first thing we noticed, sitting at the end of a very long shared table, was how loud the music was. A mixture of 60s R&B and 70s Disco; it was far too loud. We actually couldn't even hear each other. Being a trio, I had to use my friend to the left to convey what I was saying to the friend sitting opposite me. At one point, while trying to explain my thoughts on my salad to the person across from me, they smiled, nodded, and asked 'so what salad are you having'? I'll admit the restaurant was packed, bustling, and full of all the noises that come with that, but despite that, the music was the biggest contributor to the noise.\n\nOur server soon appeared and did a great job answering all the questions we threw at him about red and white wines. He spoke well and seemed to truly care about recommending something we'd enjoy. Unfortunately, upon his return he gave the white to the red drinker and vice versa. To his credit, he noticed his own mistake and did not make it again with any of the refills.\n\nLooking at the menu, anyone familiar with Terroni will find a lot to like here. It is, as their website describes, a sort 'best of' all the food at Terroni, with something for everyone.\n\nBread arrived with olive oil to dip. The oil had a nice earthy bitterness and was quite enjoyable. Our salads arrived soon after: a Giuggiolosa with mixed greens with Cambozola cheese, grilled peppers, pine nuts, black olives, honey and a Barbabietole e Caprino with roasted beets, goat's cheese, lamb's lettuce, pistachios, candied lemon zest, and anchovy balsamic dressing. The Giuggiolosa was slightly too sweet and could have used a few more of Bettola's exceptional olives to add some more saltiness, but the Barbabietole e Caprino was near flawless. The beets were well roasted, and the flavours all stood out, as they should have. \n\nLooking at the menu, one of my guests fondly remembered having eaten Arancini di Modica on a ferry ride once from Italy to Sicily, so out of nostalgia, we ordered them. Arancini are breaded and deep-fried balls of rice, cheese and other fillings. At La Bettola di Terroni, they're filled with mozzarella and a pork ragout. They were a step above their peasant food origins, but all of us agreed that they weren't spectacular, didn't live up to the nostalgia, and we wouldn't be compelled to order them again.\n\nOur pizzas arrived soon after. Having been to other Terronis before, I knew what to expect, and so we decided to split two pizzas between the three of us. Although thin crusted, they're not small.\n\nWe ordered a Smendozzata, with sausage, red onion and gorgonzola on a tomato base, and a C't Mang with prosciutto, pear, walnuts and honey with gorgonzola and mozzarella on an olive oil base. The Smendozzata was classic Terroni style, and just as expected. The Gorgonzola was sharp and salty, and the sausage had a hint of fennel. Tasty. The C't Mang was also excellent, with the perfect combination of salty and sweet, and a nice sharpness from the Gorgonzola.\n\nOverall, it was a good meal. With La Bettola di Terroni, the Terroni family has added another feather in its cap. La Bettola di Terroni serves classic, Italian comfort food and serves it well. Besides the noise level, it's be a great place to take a date, bring the family, or bring friends.","useful":2,"funny":0,"cool":1},
{"review_id":"ihW0mpuMrkkmeN3TeZ4rog","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"kw8Lh8bJAtquHkT9CB4zGg","stars":4,"date":"2011-02-16","text":"Anyone remember when Future Bakery was big business? It had multiple locations around Toronto, and it was focused heavily on the food and culture of its Ukrainian ownership. While the Annex location is still kicking strong and remains a popular beacon for starving U of T students, the others, except for the tiny St. Lawrence Market outlet and a baking factory in the city's Westend, have all but disappeared. All that remains is a lone, ceramic Ukrainian Easter egg sitting high up on a shelf in the Annex location. But time moves on I suppose, and there's a reason that despite the others all going under, the Annex location is still packed at almost all hours of the day.\n\nFuture is cheap. Straight up, that's probably one of the predominant reasons they're so busy, but it's not as if you're getting some reheated crappy food for your money. They make some pretty good stuff. (Right off the bat, I'd like to point out that there is a food outlet right in the back of this place, and I think they sublease it to sell food in there, but I am including it in this review, despite that they might be two different places.) Most notably, you can grab a pretty good breakfast there, especially on a Sunday morning. Sundays in the Annex are deadsville; everything is closed until the early-afternoon, so if you live in the area or you happen to find yourself there because you thought everything would be open, this is a great place to grab a pleasant morning breakfast or a greasy hangover cure.\n\nFuture has some seriously amazing cakes, and if that's your thing, then you should know that Future is probably one of the best values for cake in the city. Besides having a killer selection of top quality cakes, they all sell for about 5 bucks a cut. There are a whole ton of different kinds too, ranging from fruit pies and caramel-based cakes to cheesecakes and heavy-chocolate tortes. Although I don't find their coffee particularly spectacular, they do have it available, and it's still a pretty natural choice to go with the cake, despite being nothing-more-than-average.\n\nOnce the warmer months hit, Future place has got a pretty spectacular patio too.  Busy, big, and perfect for people watching, it's easily the 2nd best patio spot in the Annex. It covers the whole side of Future's corner building, and it's an ideal place for cold pints.\n\nFuture pretty much accommodates everyone. Early morning breakfast, late night after the bar, mid-week meeting spot, in-between-classes study hole; no matter what you're using it for, chances are that Future will be able to offer you something. So despite the fact that the Ukrainian aspect is no longer really existing here--or at least not being a visible existence--it hasn't slowed this place down at all. Most likely, people haven't even noticed the lack of Ukrainianess. And while purely for nostalgic reasons, I find that a bit on the disappointing side, as long as every time I go in there I can be reminded of Future's past by that lone Uki Easter egg, I'll make due, and I'll being eating cake.","useful":2,"funny":0,"cool":1},
{"review_id":"thXhMCBeDU4Ht-o1EEPDdA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"ct90rEU1YlKgzW7BrfAZTw","stars":4,"date":"2011-01-15","text":"Despite all of the new multi-story buildings going up in the area, the Entertainment district is still full of lively, exciting, cool and truly unique places to check out; from the theatres to the restaurants, it is a great area to spend a night or two and explore.  I hesitate to say I \"stumbled\" upon this particular location as it is quite visible across from the main strip of theatres on this part of King Street, but I did enter on quite the spontaneous whim.\n\nTheir contemporary and inviting atmosphere is infused with Motown and Blues décor and music, which sets the mood perfectly for their southern dishes.  They offer up a nicely balanced menu of traditional Cajun-style grub and the more typical Canadian restaurant fare; from fish and fried foods galore, to goat-cheese-adorned salads and honey-garlic chicken, there really is something for everyone.\n\nI popped in early and was greeted with the notice of half-priced appetizers before 8:00 p.m. - a great opportunity to try a couple.  There are plenty of barbecued chicken, rib and steak platters to choose from, but what could be more appropriate than their cornmeal crusted catfish sticks?  I had them with the goat cheese and Cajun-roasted pistachio salad, and it turned out to be a delightful meal.\n\nThe catfish sticks are a must. After I ordered, a small plate with one tiny morsel of something arrived in front of me - this was worrisome.  Thankfully, it was just a mini-muffin sized, mildly sweet portion of cornbread (a side note: not enough restaurants give you complimentary bread at the table anymore; it does not have to be an overflowing basket of buns, but just a small bite of something light and delicious starts the meal off right). When the fish did arrive, I was more than impressed with the serving size. They were light and crispy and with smokey-sweet Cajun spice and served a tangy tartar sauce.\n\nThe salad had a hint of that same Cajun spice on the pistachios, but was otherwise just as expected for greens, except for one crucial detail - the copious amount of cheese!  Finally, a restaurant after my own dairy-loving heart!  I have too often overpaid for goat-cheese-promising pastas and salads that have fallen short.  Joe Mamas, on the other hand, gave me a meal-size salad, with more than my fair share of cheese, and all at half-price no less!\n\nI eased myself into my first southern cuisine experience with a dinner of appetizers, worried that I might be confronted with an over-spiced and over-fried spread.  Thankfully proven wrong, on my next visit to Joe Mamas, I'll be diving into their menu with less hesitancy.","useful":3,"funny":2,"cool":4},
{"review_id":"oqZS5Kb1SzeSi7-rV5JJuA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"Qa4eXuZ1IFPwnVXJcpZWtw","stars":3,"date":"2011-09-10","text":"Real Sports Bar and Grill is an amazing place to go if you are an avid sports fan. Casual viewers need not apply. A bar boasting North America's biggest HD TV screen, and at 39 feet, they are not exaggerating, creates a certain atmosphere, but that may not be what everyone is looking for in a sports bar...let me explain. \n\nReal Sports is shiny, flashy and new. The place is decked out with 199 other HD TV screens, all vying for your attention, on top of the main attraction. The bar is lit up with translucent coloured panels, creating a space that feels a bit more like a nightclub than a bar and grill. The wait staff all look really good, but it seems to take the entire quarter of a basketball game to get your drink or order a meal.\n\nReal Sports menu is comprehensive and well thought out. They serve 12 different flavours of chicken wings, and a great selection of sandwiches and burgers. I can attest to the quality of both the Grilled Chicken on Swiss Panini and the Grilled Portobello Mushroom Sandwich ($13, $12). Real Sports also serves of a variety of appetizers, hot dogs, poutine, salads and some filling entrees of ribs, salmon and meatloaf. But here is where the fun stops. I have not had good luck with the appetizers at Real Sports, often finding the portion to be smaller than I expected, and the food lacking a certain something. The calamari was a bit dry, and the chipotle mayo has been done. When I ordered the sweet potato fries as an appetizer, the portion of \"5 spice aioli\" that came on the side could have been consumed within the first two fries. I was not impressed. \n\nFood issues aside, Real Sports serves up 112 different beers on tap, and a decent selection of wine and whiskey. Expect to pay a steep price, however. With most of the beer prices ranging between $6.25 and $8.50, and wine from $9 up to $23.50 a glass, the \"sports\" theme of the bar is quickly replaced with the pricing of a mid-range restaurant. I must admit, I have never been able to digest the alcohol prices at Real Sports.\n\nWhat Real Sports lacks in food and prices, however, it makes up for in location and style. Located walking distance to the Rogers Centre, and across the street from the Air Canada Centre, it is, literally, a 30 second walk to the ACC, giving meaning to the \"real\" in Real Sports. With more TV's than you could find inside the biggest BestBuy store out there, you will never miss a game or event again. It really feels like Real Sports is actually playing every sporting event in the world, and you can take your pick. \n\nReal Sports boasts a 90-foot ice bar, which swaggering up to and ordering a drink at feels pretty cool (pun intended). It's a neat gimmick, but also extremely functional, as those sitting at the bar always have a cold drink. I have just never quite figured out where to rest my hands. \nReal Sports is loaded with seating, it always seem that there is a place to sit. With the bar spanning over two levels, all with forward facing booths, there really isn't a bad seat in the house.\n\nIf you are looking for a good time, and not extremely concerned with the quality, or price, of your food and beverage, then by all means, head over to Real Sports; I can almost guarantee you will have a good time. Seeing the 39-foot TV for the first time is a fun experience, especially when your team is playing on it. If you go to Real Sports with realistic expectations, you will not be disappointed.","useful":1,"funny":0,"cool":1},
{"review_id":"kKCQQuZmIThApuq4Z_r62g","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"-L88B-PrtzwujhLuYc2k_g","stars":3,"date":"2011-12-05","text":"You're downtown, you're headed to a game and you need to grab a bite to eat before you head there. You take stock of your options and think, \"These places all look kind of similar - where should I head?\" Might I suggest you check out Joe Badali's, an Italian-themed restaurant on Front St. West, steps from both the Rogers Centre and the ACC. The spacious bar\/restaurant has something for everyone, a key to success for large groups that often book parties there.\n\nA friend and I popped in the other day to check out their fall\/winter brunch menu. Given our choice of bar, table or booth, we opted for a cozy booth in the middle of the restaurant and were given three menus from which to choose our meal. A bit overwhelming, perhaps, but our waiter explained that one menu was strictly for their new pescetarian promotion where you can choose the fish you'd like and how you'd like it cooked. Feeling like it was a little early for ahi tuna, my companion and I went for the brunch options: I had the eggs benedictano and he had the steak frites, ordered medium rare. To accompany our selections, we ordered the pear and cranberry cider and the maple bourbon lemonade. (Both drinks made by the fabulous bartender, Katie, who also makes mean After Eights and Monte Cristos.)  \n\nA plate of house- made bread was brought to the table, accompanied by olive oil and balsamic vinegar. Warm, crusty and soft on the inside, we polished off that complimentary snack pretty quickly while we sipped our delicious drinks. The wait staff is clearly comfortable with time crunches of customers and took into consideration that the tables around us had a short amount of time to eat before they needed to head elsewhere. The service was swift and friendly for them, while it was a little more relaxed for us  - though by no means slow or lackadaisical.\nWhen our brunch plates arrived, we were eager to dive in. Neither my companion nor I had been to Joe Badali's in quite some time and wondered how brunch would stack up. The portions were a good size and, importantly, cooked as they should be. My egg yolks were runny and the Canadian back bacon was a great salty accompaniment. The ciabatta base was a nice touch, as it worked well to absorb the leftover yolk on my plate. The home fries might have been a bit crispier, but the peppers and onions were crunchy contrast to the creaminess of the eggs. As for the steak frites, the steak was indeed medium rare and had been rested properly before being brought to the table. By the end of the meal, only a few pieces of diced fruit were left in our respective cups.\n\nSince we felt like indulging at this particular brunch, we allowed ourselves to split a very generous portion of white chocolate mousse cake with strawberry topping. Not overly heavy, it was actually quite a nice way to wrap up a meal. As mentioned earlier, we also tried the After Eight and Monte Cristo specialty coffees. Topped with whipped cream and a cherry, these were decadent and deliciously boozy. We allowed ourselves a few minutes - and a couple of glasses of water - before attempting to get up.\nWhen asked about the capacity of the place, we learned that Badali's can hold up to 750 people, making it a great place for large parties. We also discovered that they set up a secluded patio in the summers, blocking off the adjacent parking lot in order to make it a pleasant place to escape the downtown crush. If you happen to be in the area - say, before a concert, a Leafs, Raptors or Jays game - check out Joe Badali's. You're bound to find something for everyone at reasonable prices. And if you're in the mood for a drink, I highly recommend checking out either the maple bourbon lemonade or pear and cranberry cider. Had it been later in the day when we went, I suspect there may have been a few more rounds of these!","useful":0,"funny":0,"cool":0},
{"review_id":"1hkQ5og5pirju4ZrZqsg9Q","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"PzxaySdQuhULRTXhWwM8Kg","stars":5,"date":"2011-05-17","text":"Man. This whole area is pretty packed with coffee shops and the like. Just up the road in The Junction, there's Crema, The Good Neighbour, and a Starbucks; just down the road in Roncys, there's Alternative Grounds, Coffee and All that Jazz, and yet another Starbucks. And that's just to name a few... The neighbourhood, it seems, is littered with coffee shops. So how does Hula Girl stack up against all the rest of them? Really, really nicely.\n\nHula Girl isn't just another boring-old coffee shop; they're an 'espresso boutique', and they focus their boutique-ish expertise on blends of Kona coffee beans and turning those blends of beans into near-perfect cups of espresso. The owners are clearly not only passionate about coffee, but knowledgeable about it too; it becomes blatantly obvious with the first sip. The espresso is noticeably balanced and brewed with a high-level of skill. Simply put, they have some truly nice people that are dam good at pulling espressos standing behind their shiny brewing machine.\n\nNo worries if espresso isn't your thing. They have some of their Kona blends brewed and served as the standard coffee fare too, which is also seriously good. They've got a nice window at the front counter with some baked goods. There isn't much there right now, as I think they've only recently started serving food, but it sure would look good stocked with some interesting, local pastries and deserts.\n\nThe space is beautiful too. Chances are, after you pick up an espresso you're going to want to stay for a bit and soak up some of the killer atmosphere. Old wood, exposed brick, shiny chrome, the entire space is exquisitely designed and faultlessly put together. Fair warning though, the insides may be pretty to look at, but they sure aren't big. It's ok though. What Hula Girl lacks in space, it makes up in comfort. Sitting around Hula Girl and sipping an espresso just feels good. The space is nice, and there's a few wooden chairs and a little bar space where relaxing music, a comfortable vibe, and fantastic coffee is all in abundance.\n\nChances are, they'll be busy too. People around here seem to have already shifted their morning-coffee-loyalties over to Hula Girl, and that's a good thing, for Hula Girl and you. Somehow, in this small environment, more people just make it feel cozier, which you'll appreciate. And obviously it's good for Hula Girl because they get to succeed and stick-around, and honestly, there isn't much that's nicer to see succeed than an independent business run by nice people.\n\nGood on the folks at Hula Girl for opening up on this tired part of Dundas with its old pizza joints and 2 dollar palm reading shops. This street really needed a place like this, and no doubt the people that live there will appreciate it too. Especially among all the artsy stuff that's crept up around here, pizza and palm-readings aside, Hula Girl seems perfectly at home.\n\nLike I said, the coffee is spectacular. So if you want some near-perfect espresso made by people that truly know what that means, then Hula Girl should be on your to-do-list; but if you're looking for a place to grab a donut and suck up some free-WiFi, keep walking up the street to The Junction or down the street to Roncys.","useful":2,"funny":0,"cool":0},
{"review_id":"5XrFbIQXoXwxaMCCN_PCtA","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"tjw1yJdmatifLYHbsI9HGA","stars":3,"date":"2010-11-23","text":"By the Way Cafe in the Annex sort of has the feel of eating at a friend's house, as far as the space goes anyways. It has all the elements of a cozy space that just feels comfortable and easy to relax in. \n\nNo complaints as far as the food goes either. By the Way has a decent sized menu with enough on it to keep most people satisfied. Despite being busy, our food arrived hot and was cooked perfectly: softly-poached eggs for the bennys, light and golden fried crust on the calamari. Where By the Way loses some points is with the service. It seemed to take forever between times the server came to our table. So overall we waited quite awhile to get, well, everything, but the quality of the food made up for most of those waiting times. \n\nThis may be one of those places that is completly hit-or-miss, but the time I was there, the food was defintiely a hit.","useful":2,"funny":1,"cool":2},
{"review_id":"HPrS6nbMQEYrnBPKe7KlMQ","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"ghaj1MZzPW1qXYCZWfoTTw","stars":3,"date":"2012-02-15","text":"\"So, are you going to eat a steak first?\"\"You might want to sneak some meat in with you.\"\"Enjoy your...vegetables.\"\n\nThese were not uncommon responses from folks when I said I'd be heading to Live Food Bar. I too was skeptical but went along for the ride anyways when a friend suggested we go. While perusing the online menu, I was genuinely stumped as to what I would get. I already eat at least one - but generally several - vegetarian meals a week, so I'm not opposed to eating a meal with no meat. But Live is a vegan, organic restaurant that features recipes without gluten, without sugar and certainly without any animal products which is outside my culinary experience. If you happen to feel the same way, I suggest you go with an open mind as Live has an excellent reputation and it is well earned. \n\nI settled in to the table at the front, which has a great view of the world walking by, of the bright, cheerful restaurant. While I waited for my dining companions, I had a look through the drink list and eventually settled on a bottle Mill Street Organic. (Should I come back in the summer, I will definitely sample the cocktails on the lovely patio!) When the ladies arrived, we ordered a bottle of organic cabernet sauvignon and started going over the menu for the millionth time. It is an extensive list with dishes that should appeal to just about all diners. Appetizers, salads, bowls, mains, pasta, dessert: Live certainly does not lack for choice. The three of us agreed that we wanted to try the chick pea fries, so we ordered those while attempting to make a decision.\n\nFinally, we made our choices: raw sushi with pumpkin & sunflower seed nori rolls and a detox salad; \"Bacon Cheese\" burger; and tempeh cakes with a warm corn, avocado and white wine salsa. Orders placed, we tucked into our wine and the chick pea fries which arrived shortly thereafter. Crispy on the outside, piping hot and soft on the inside, this non-traditional take on a staple hit the spot, especially with the homemade BBQ sauce on the side.\n\nOur mains arrived in a timely manner, and we hungrily tucked in to them. The sushi roll had a great combination of flavour and texture. I was a little jealous of not ordering that one for myself, but my giant plate of food was more than enough. The tempeh (an Indonesian soybean product) cakes were piled high on top of the wonderful salsa that was accompanied by a spicy chipotle aioli. If you're hungry, get this dish. It was undoubtedly for the best that I did not order an appetizer, as well as the cakes and sides were so surprisingly good that I was nearly scraping my plate. \n\nAs for the \"cheese bacon\" burger, it passed the taste test. The patty consisted of chick peas and had macadamia cheddar \"cheese\" and eggplant \"bacon.\" I can see your eyebrows raising. The eggplant had a smoky flavour and was quite good, though certainly not bacon. The cheese in question was a bit of a head-scratcher, though not unpleasant. The gluten-free bun was nicely toasted and the BBQ sauce was a great touch.\n\nSince we had already gone through much of the menu, we thought we should give dessert a whirl. All the desserts are kept on display in near the back of the restaurant, and there is quite an array from which to choose. We opted for two: the tiramisu and the Black Forrest cake. Now, my Italian friends would be horrified to find a tiramisu without real cream, but it really was quite good with a strong, but not overpowering, taste of espresso. Similarly, the Black Forrest cake was rich, creamy and cut nicely with the cherries on top. No complaints - I certainly didn't feel like I was missing out.\n\nLive has a great vibe to it and customers were constantly arriving either to have a seated meal or to pick up their take-out orders. The music is at just the right volume and the staff is friendly and accommodating. We were there for several hours and never felt rushed, nor got the idea that we were no longer welcome. Food arrives promptly and with a smile, water bottles are refilled, and the service is relaxed. So take your vegetarian friends, take your carnivorous friends: they will likely all be satisfied. The portions are well-sized and, most importantly, the food is delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"jATJA_ZFrHZBtlgRphW_gg","user_id":"YHWsLBS8jzZiPjKHMFOaAA","business_id":"fK1oj0dk9Bc6KsBk5mMDxg","stars":4,"date":"2013-04-01","text":"Playa Cabana Cantina is the latest restaurant to open in Toronto to fuel our newfound taco addiction in the city. It's located in The Junction at 2883 Dundas St. West (at Keele).\n\nPlaya Cabana Cantina is the second location for Playa Cabana - with it's first location on Dupont (at Davenport). The Junction has accepted it well, considering there were absolutely no reservations available for the whole weekend - but they assured me that they keep the bar open for walk ins.\n\nSo we walked in. Right away I was impressed by the decor, there's plenty of neon-lit signs including a shout out to JUNCTION - WEST TORONTO, and an \"Keep and Enforce Prohibition\" sign at the bar - perhaps a little tongue in cheek reference to The Junction's past as a dry neighbourhood until 2000.\n\nThe menu here is set up a little differently than other taco favourites like Grand Electric or La Carnita. Instead of ordering tapas style - one taco at a time, Playa Cantina's menu includes everything from tacos and tostados to burritos and enchiladas along with a side of rice and black or pinto beans.\n\nWe started off the meal with guacamole and chips. The chips arrived warm to the table and were extra crispy and fresh. The guacamole was smooth and not too spicy for our tastes. The bartender replenished the chips free of charge too, which is a great touch.\n\nPlaya Cabana Cantina has a fresh oyster bar set up, and at $2 a shuck, we couldn't resist them. They were huge, no skimping here, and were served with horseradish and hot sauce. Then, we each ordered a set of tacos with a side of rice and black beans, after starting off with Amber Agave Margaritas.\n\nThe Ancho Braised Shortrib-Brisket Crispy Tacos were served on a corn tortilla with melted cheese, sour cream and pico de gallo. They came to the table piping hot, and the mix of brisket and cheese was perfect along with the extra crispy tortilla. They were reasonably priced at $14 for an entree.\n\nNext up was the Tacos de Pescado (Baja-Style fish tacos) for $13 . They were a little underwhelming in comparison. The breaded tilapia didn't have the substance to stand up to the guacamole and shredded cabbage filling. Usually I'm a big fan of a good fish taco but this wasn't the best I've had lately.\n\nPersonally, I prefer picking and choosing different tacos to try instead of ordering them as a personal entree. The sides of yellow rice and beans were fresh and a great addition, but it would have been great to try a few different kinds of tacos instead of three of one kind.\n\nWith another round of drinks coming, we felt the need for some dessert... Unsure of what to get, the bartender recommended the Mexican Flan, so we gave it a shot. After waiting a little longer than necessary (I think the kitchen forgot about us), our bartender arrived with the flan, which was actually 2 mini flan served with whipped cream. He apologized for the delay and said the dessert was on the house.\nOverall the personal service at the bar was great, the bartender gave us a lot of recommendations on what to order and was more than helpful. The atmosphere was comfortable and casual, it didn't have that 'too cool' vibe that many new restaurants are picking up on now.\n\nWe definitely will be returning to try out the burritos and other menu items along with the amazing guacamole again too. The tacos were flavourful, with fresh, house made ingredients but not the best of what the city has to offer right now.","useful":3,"funny":1,"cool":3},
{"review_id":"QclKJbwubv2518A052FYGg","user_id":"OjLfOpMrKabrUT1k70sVWQ","business_id":"Ym0xnOQsoG3XTKMDuqIrjw","stars":5,"date":"2015-11-27","text":"Pros: Good prices, friendly staff, family owned and operated. \n\nCons: Took a little while to print the label, but they were able to fix the machine. 15 minutes total. I will update this next time I go. \n\nI live nearby and my family lives in Maine. This place was across from the US post office so I went in to check it out. New location and it's a family operated business. Pretty friendly and helpful to get my Christmas presents shipped at a reasonable price. I think it was less cost than shipping it at the post office, too. I will be using this place more often.","useful":2,"funny":0,"cool":0},
{"review_id":"ShHKkAHxdN5G5f79AFq7zQ","user_id":"LsN3fFDkKjUzUU8o7enE-A","business_id":"QDvUdj36I_oAzXoFzCQnNA","stars":3,"date":"2014-03-07","text":"Prefer crusty breads at other Italian restaurants. Would have liked to have been forewarned about the $2.95 charge for substituting one sauce over another.","useful":1,"funny":0,"cool":0},
{"review_id":"gytdcCLTLdiEXbFmxoijxQ","user_id":"0LlEa0ZvJPIpzEPnXRTomg","business_id":"P7pxQFqr7yBKMMI2J51udw","stars":5,"date":"2012-12-06","text":"Came here before heading home and had the Gold standard burger and The rising sun burger!  These were the best burgers I've ever had.  Well worth the price and experience!  Quality burgers.","useful":0,"funny":0,"cool":0},
{"review_id":"zKQlnqSmGyT0d1vT3oX6vQ","user_id":"QlqUK17AUs7aV0gerQik3A","business_id":"MpmFFw0GE_2iRFPdsRpJbA","stars":1,"date":"2017-01-19","text":"Totally a horrible experience! From security guards at the entrance to bar tenders, no one knows how to talk human. They're extremely rude in any question or assistance we asked. A friend got his wallet stolen and was yelled by the security guard by trying to search for it on the  floor. Lost-and-found was so useless. Will never step foot in this club again if you don't want to ruin all the fun you have while in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"ynF-WD-11AcpNAcoroOpjw","user_id":"qKz_fN0lgrY1OvYPNTpHsw","business_id":"_YRVlJmnsTxwUrMgjIGCQA","stars":5,"date":"2016-03-14","text":"Excellent location, close to Kensington Market. \n\nIt's definitely a favourite spot for a pint or two when in the area. It's even worth a special trip for the various bands\/events\/televised football (soccer) games. \nI think I've seen more selfies taken in their washrooms posted than from any other area pub. They are decorated pretty cool!\n\nAs mentioned, the pints feature a great selection of both difficult to find imports and domestic items. \n\nThe vegan food options, although limited, are available. I had the vegan shepherds pie and thought it was fantastic. Fairly priced and well presented, along with accompanying side salad. I was stuffed!\n\nThe service was friendly and competent. \n\nWill be back. Again and again.","useful":3,"funny":0,"cool":2},
{"review_id":"gHVzgYq5hXHOBXc7ipm71w","user_id":"qKz_fN0lgrY1OvYPNTpHsw","business_id":"ho5ClDsYijmOJy9OSUx8UA","stars":5,"date":"2015-10-12","text":"My first time at this establishment (overdue!) and I will certainly be back. \nThey had a great selection of food and drink. \nFantastic and friendly service. \nI enjoyed a superb cup of coffee and was offered several different non-dairy milks for it. \nI accompanied that with my first ever pumpkin pop-tart which has set the new standard for any and all future treats to enjoy with a cuppa!\nI'm looking forward to seeing live entertainment there at some point in the future too, as they have space for that as well. \nI would recommend this establishment without hesitation.","useful":0,"funny":0,"cool":0},
{"review_id":"xYtmlSQiZ0RYZU6AkdD4ew","user_id":"KMinNwBquxsvvjeE91Mc2w","business_id":"JLbgvGM4FXh9zNP4O5ZWjQ","stars":1,"date":"2013-06-13","text":"Service was poor (no silverware when my food arrived, begging for coffee\/water refills...) and ambiance was dreadful. Sunday brunch and there's a middle-aged, top buttons undone, \"DJ\" pumping out crap from the corner of the room. Saturday night, sure, I'll expect bad dance music and deal with it but Sunday Brunch!? I asked an employee if the music could be turned down since the bass was so out of control I needed ear plugs but the volume remained the same. Cool bloody mary bar concept but it was messy, you can't make your own rim because the alcohol's already in your glass, and it always seems a little unsanitary...My food was decent but this place is trying too hard and is not good enough for a return.","useful":2,"funny":2,"cool":1},
{"review_id":"duVXjmNdgk_KMR4YVXKnfQ","user_id":"KMinNwBquxsvvjeE91Mc2w","business_id":"zMfZLd5_h5W8ZVxTNoeJyQ","stars":2,"date":"2013-06-13","text":"Pretty tacky place but gotta love a rooftop?! Food was pretty gross American Mexican food. My taco salad was just like what you'd get at Eddie's under Towers. At least corn tortillas were an option for a taco, though. The margaritas tasted like jolly ranchers but my mimosa had a generous champagne to oj ratio. I'd go back to hang out on the roof..","useful":0,"funny":1,"cool":0},
{"review_id":"2bphH1hip1_1SxqQh7xMJQ","user_id":"KMinNwBquxsvvjeE91Mc2w","business_id":"lNh_U1fEfxtcLRpT1RpX8g","stars":4,"date":"2013-06-13","text":"I went to a private event here and it was lovely. The room looked great and we had a very attentive staff helping us the entire way with setting up to helping us pack up our leftovers. The space itself was very cute and thoughtfully decorated. Our food was well prepared and we had a great time.","useful":0,"funny":0,"cool":0},
{"review_id":"UMOnbR-u431xIQYC1qyHDA","user_id":"0FMQdH3pNm5N1K5ddlMhdw","business_id":"wPiRP76arN0NB3M1ZXXp7g","stars":3,"date":"2012-06-10","text":"Great food and ambiance! Service was terrible. She never came back to the table after we ordered our food.","useful":0,"funny":1,"cool":0},
{"review_id":"rF3oaRJKJvkIqOooCslyKQ","user_id":"fEsysVVi8KVtLUfKWCU67Q","business_id":"OUP9dy2eu_-2Mga3DpSFfQ","stars":5,"date":"2015-03-14","text":"Love this place. Extremely nice staff. Pizza is always delicious. They only use fresh ingredients and u can taste it. We always get their wings too. They never disappoint.","useful":0,"funny":0,"cool":1},
{"review_id":"8byisBV2IJXn0OvPjGo-Ug","user_id":"fEsysVVi8KVtLUfKWCU67Q","business_id":"5dH3vZY2wHF4TNa3oGRH7A","stars":1,"date":"2015-04-25","text":"I have dealt with many apartment complexes, but this place by far is the worst place EVER! The manager Janice Lee is the worst part of the living there. She is most disrespectful, unhelpful and rude manager I have encountered. They kept our deposit even after their walk through claiming they were very happy with how clean we left the apartment. When we moved in we already had our own fridge so they took theirs out. Once we moved out they accused us of stealing their fridge and kept the deposit. Janice refused to even look into our situation and just said \"do whatever you want because we are keeping your deposit\". Go on Google and read their other terrible reviews. They suck. Whatever you do, save yourself a headache and deposit, and stay far away from this stupid place and worthless \"manager\"","useful":5,"funny":1,"cool":1},
{"review_id":"a6-pKMnQChRUW7NmYiKOUw","user_id":"fEsysVVi8KVtLUfKWCU67Q","business_id":"3xEO9oyGqfO_O8eSlxYTBA","stars":5,"date":"2014-11-13","text":"Best spa ever! Greatest prices, nicest staff, just an overall amazing experience. I won't be going anywhere else. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"nTVeuKnpYLqz80GKSlBIKA","user_id":"gxnkxIqCnzM5djoM9lAsqg","business_id":"9t3P70MYhBKYqbGfcYbC8w","stars":5,"date":"2016-11-01","text":"Great service and prices!! Highly recommended brought my rims and tires to get them put on and balanced and they can strech tires too, professional staff good job guys!!thank you :)","useful":0,"funny":0,"cool":0},
{"review_id":"r21wJ7Ui9ecLsYiNJXkv2w","user_id":"gxnkxIqCnzM5djoM9lAsqg","business_id":"4Q-P8lbk9d5zO_ireZFRPQ","stars":5,"date":"2015-12-05","text":"I had followed cesar, noel isaac to many different places and really happy they finally got their own salon. I enjoy the vibe, their really friendly. I really like how they cut my husbands hair and my own as well. I really really really recommend coming here (: \nThank you guys! !!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"8VPlRg8Vxctc5d4AjW4J2w","user_id":"GPfuLhzPYF_0o_uHlE4HVQ","business_id":"cSwEDCPtfN-t545eQyGhmQ","stars":2,"date":"2017-11-18","text":"I sought out the new b-dubs in downtown Kent. Having never been to the new location I was impressed with the building and T.V set up and everything else. Very impressive however it ended there our waitress on a dead afternoon came by 4 times and really didn't talk the even ask us how the food was she would just grab our drinks with no heads up and bring them back. Really frustrating service. Very disappointed because with only 3 other tables being served on the floor by other ppl idk what in the hell could keep you from providing some decent service","useful":0,"funny":0,"cool":0},
{"review_id":"2xbStAheMkwTfI95vjSTmg","user_id":"8WRMcaok7FNieG7zBBbmSg","business_id":"r0qkp4khoxEe1dVKSRZmUg","stars":5,"date":"2016-07-16","text":"Great coffee shop in the heart of Independence. Staff was extremely helpful and kind. The latte was very good. Food was great too, I ordered the egg muffin with guac and salsa which was a nice healthy start to the morning.  Keep it local and try Babe's !","useful":0,"funny":0,"cool":0},
{"review_id":"-A-ynwojLhFWN_aNWxhsFQ","user_id":"2Eq5oRG-5dHajsPa2RIyEw","business_id":"wWH4dED55sn0DMFBqaD56A","stars":5,"date":"2015-11-08","text":"I used to work for steve not only as a counselor but i also did costumes. Hes definitely a character but he loves to see kids smile! He takes time to clean each ball in the ball pool and whipped down EVERYTHING in the playground over all it was great watching kids have fun there","useful":1,"funny":0,"cool":0},
{"review_id":"IUbUpA1HznQZY8Ni8dF1tw","user_id":"2Eq5oRG-5dHajsPa2RIyEw","business_id":"7xn6RDKmCanq2C8Fn-FNgg","stars":5,"date":"2015-11-08","text":"Honestly jill the owner absolutely gives the best customer service i love their spinach tri tip wraps they are to die for everything is soooo amazing you must go there at least once in your life","useful":0,"funny":0,"cool":0},
{"review_id":"c6h3vpQuEWXCtWgicSNpEQ","user_id":"nJGM5-vfxnTYlhCMIge4Ww","business_id":"36nKuNkunJ9ML4kdA4iR8w","stars":5,"date":"2014-07-16","text":"I wanted to take a second to write a review about Dr. Degen along with his office staff. What a stressful time it was dealing with a double failed root canal, and after a few visits with a few different doctors,  I was able to get different opinions, but I decided to come back to Dr Degen for treatment. I felt as if he was most honest, very confident and I never once felt rushed, he answered all my questions and concerns. I had previous nerve issues and honestly just felt scared to have any more dental work done.  He made my fears become so calm and I just trusted that he would do his absolute best! I got teeth 31 & 32 extracted and both my top wisdom teeth removed all in one visit. His office manager Cory is fantastic and was very helpful from the beginning , even after 50 questions... the front and back office was super friendly, helpful and always smiling. I'm sure it makes for a great place to work and as a patient I would most definitely return in the future if needed.  I have found a wonderful office and just pleased with my decision to have chosen him as my doctor- Post care was just as great of experience and would highly recommend there office! Very clean office too! :) \n\nCorrena","useful":2,"funny":0,"cool":1},
{"review_id":"pdD3ObAgR4NIdFd4cxByyw","user_id":"mFBIF-EQ8OdLw15rzFf1sw","business_id":"xkVMIk_Vqh17f48ZQ_6b0w","stars":3,"date":"2010-01-31","text":"I suppose that I have some explainin' to do, considering that my group of 3 friends and I dropped $500 on dinner here yet only gave it 3 stars. \n\nSo, let me start with the sides. We tried the Hen of the Woods mushrooms, gold yukon potato puree and asparagus. The hen of the woods mushrooms were quite good, but nothing I can't put together myself. They had no great sauce, no POW factor. The gold yukon potatoes were fine - nice potatoes that were boiled and pureed to baby-food texture. No special or unique flavors going on there. Finally, I'm convinced the asparagus was just microwaved in some water. Very poor effort there, guys. Considering each of these dishes was $15-$25, I'm very disappointed. \n\nNow, onto some better things. I had the lobster bisque which was very good. Nice and creamy with succulent chunks of lobster. The only complaint I have, if it even counts, is that they served me a ton. It was very rich and I didn't have a cup of bisque, it was a giant bowl. \n\nOn to the most important thing, which were the steaks. My friends ordered the 16oz Ribeye, 16oz New York Strip, 12oz Hanger and I had the grade 8 12oz wagyu beef skirt steak. They were all really, really good but I have mixed feelings here. Sure, they were cooked perfectly, but I can do that at home on my grill. No sauces here, nothing; just pure steak goodness. It was my first time ordering the wagyu beef, and it was good, but I actually preferred the Hanger of the four steaks we ordered. \n\nOverview: The service was impeccable. The wine list was extensive (however out of our price range, at $125 per person without drinks). Though the steaks and bisque were great, the sides were eerily reminiscent of my grandmothers (terrible) cooking. I think Craftsteak is a poor value for your buck, therefore I'll give it 3\/5 - A-OK.","useful":0,"funny":1,"cool":0},
{"review_id":"n0Pk4wn45671wWhlDD_K9g","user_id":"mFBIF-EQ8OdLw15rzFf1sw","business_id":"Cni2l-VKG_pdospJ6xliXQ","stars":5,"date":"2010-01-31","text":"Stopped by Burger Bar in Mandalay Bay while having a great weekend with old college friends in Vegas.  Burger Bar definitely added to the great weekend.\n\nLet's start with the drinks - they have an excellent beer selection, including fat tire which is one of my favorites.  Pitcher for $22 = very happy me.\n\nTheir burgers were cooked to perfection and included fresh, very tasty ingrediants that matched some of the other upscale burger places I've been - like Five Napkin in Manhatten.  I had the Black Jack Burger, which I can attest was fantastic.  My friends also enjoyed the American Classic, Black Angus Beef and Original Ultimate Burgers.\n\nAs far as sides, I tried their sweet potato fries as others on Yelp have said they are fantastic - I thought they were good but nothing special.  If I were to go back and I would probably go with regular fries.\n\nFinally, the atmosphere was great.  Very modern place and it was packed, everyone was having a great time.  Great experience, I would definitely recommend.","useful":1,"funny":1,"cool":1},
{"review_id":"dgRbfwb1cZnPv6uJWOidVA","user_id":"gImIEPRjjwinhiwxsygCOg","business_id":"tpM73m9YqgYFwIQIzIpQ2w","stars":5,"date":"2015-02-10","text":"Amazing service and very nice shop! They took me and my sister as walk- ins and Jason did an excellent  job on both of our tattoos! We will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"I9q49ZHiVp5MQAya5fxLDw","user_id":"Qu7EESO_z6yryC2rRXbynQ","business_id":"jRPwCUg9X0fUSLR7w1D-MQ","stars":5,"date":"2014-06-26","text":"These guys are great, friendly and care. They have made things easy for me more than a handful of times ..I have had bad experiences in the past with other title companys...... I would recommend auto tittle loans USA to anybody!!!","useful":2,"funny":0,"cool":0},
{"review_id":"InR6Vwf7dfo4MMTQiZ92_Q","user_id":"Qu7EESO_z6yryC2rRXbynQ","business_id":"_-vDX3omTBcx646X5TRpfQ","stars":1,"date":"2014-10-28","text":"This place is a dump .... mold everywhere toilets.sinks.showers in cabinets would not deem reasonable for a prison let alone an apartment complex","useful":2,"funny":1,"cool":0},
{"review_id":"o8we68tk-yg9k5OrnK1AKw","user_id":"Qu7EESO_z6yryC2rRXbynQ","business_id":"4YKU46PNs-wCi3TAafrRaQ","stars":1,"date":"2014-08-28","text":"I am completely dissatisfied with with this location .. we order a pizza at least 5 times a week always the same ... until 1 came that was absolutely gross and non edible when we called we were told that there was nothing they could do or would do to make it right.... therfore we will not order from them or barros ever again","useful":4,"funny":0,"cool":0},
{"review_id":"OZcNP8omEhNGGLPdvvfpHA","user_id":"LJu7g4iEbLaMZo6xFQCufA","business_id":"qNRyP8ItRICZOnKS4jf5ig","stars":1,"date":"2013-11-06","text":"Service With A Smirk.\n\nWent in to buy a snack , and asked the kid behind the counter how much one of the brownies was, and if it was plain (no nuts). Looked everywhere but where I was standing, and said \"Looks that way.\" Condescending as hell. Two dollars for a stale brownie, and stale service. Never again.","useful":2,"funny":0,"cool":0},
{"review_id":"3mqCbjXOqyo9bOfdeegx5A","user_id":"Af2RkSSiYqTCHruDQ3C7jw","business_id":"lYFpDTiVMNrpkpFyIEcc_w","stars":5,"date":"2015-11-14","text":"Stopped by this shop to pick up one item and found it to be a great place, so great in fact I went back about an hour later and picked up a whole new kit, the staff is friendly,  knowledgeable and don't try to up sell you.\nThis is my new vape shop whenever I'm in town.","useful":0,"funny":0,"cool":0},
{"review_id":"sX4_Qlg29H4aeIJ01oOIxw","user_id":"zxCJAztRkzw4kDBxpwKWWg","business_id":"OotqWIuPJcRC3iXA7v5xwg","stars":2,"date":"2017-02-21","text":"Granted this company is cheap but they are cheap for a reason. So first I get a gray Nissan Sentra I think it was and I was very unimpressed by the condition of the car. Then I'm driving on the highway and the car damn near stalls out on me and could have gotten me killed! I was close to the rental office so I took it back and demanded that I get a different car and be compensated for my troubles. I got a different car but instead of the company trying to make up for it and put me in something nicer they give me a car that had ink stains everywhere! As far as compensation goes the manger told me they would have to get it checked out as if I was making it up and after a few hours how did I know that they would call back and say nothing was wrong with the car?! Overall, I didn't like the whole rental experience from this company and never get in a gray Nissan! It might save your life!","useful":0,"funny":0,"cool":0},
{"review_id":"cjbl4me6Q6UJNp3-eUumjg","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"kPR47uxGqmQNIQkIZr2_Tg","stars":5,"date":"2014-11-11","text":"Great food and generous portions. This place is a must if you have guest visiting from out of town and you want to get some great breakfast food.  My old boss recommended this place and we are glad he did. It gets busy on Sundays. Way better than any IHOP or Waffle House. We left happy and full;)","useful":0,"funny":0,"cool":0},
{"review_id":"vVq6GHe75QkrxHUjKemqyw","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"FX_9bEgVSLjSaFU2GclZyg","stars":5,"date":"2014-11-11","text":"We have been taking our son here since he was really little. He's five now.  Admittance is free the first Sunday of every month.  We definitely make use of that great offer. They keep adding to it each year. We love to see it grow. Glad we found this place. We live out on the west side but it is so worth the drive on the first Sunday of each month.","useful":3,"funny":0,"cool":0},
{"review_id":"-ClsFmk_xHdDjUALFdtpoA","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"2a_Hh52GRoC6RBLznYRGMA","stars":5,"date":"2014-11-12","text":"Fun place to be...esp.during spring training time. If you're into getting autographs it's easy here during spring training. I'm not even that into sports but I'm originally from Ohio and my friend (ohio friend) comes here esp.for spring training (she loves the Cleveland Indians who train here along with the Cincinatti Reds).  The amount of signatures and pics of players we've gotten over the years is amazing.  The games are fun to watch...I just chill and drink a margarita. The whole ball park is so family friendly. They do events. My family enjoys the halloween event.","useful":0,"funny":0,"cool":0},
{"review_id":"HW-5PD6ZDkG6iNlIjdWHUw","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"YPavuOh2XsnRbLfl0DH2lQ","stars":4,"date":"2014-11-11","text":"Great food. They keep it simple here by not allowing for substitutions. You just pick a number on the menu that matches what you want. Pretty much anything you order is delicious. This used to be a little hole in the wall but they re-did it - expanding the space and making it more modern looking. If you love chicken and waffles and basically comfort food, then this is the spot. It's busy at lunch time.  Each time there has been a good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"Hm05qceDQg2kVDTh_lyKCQ","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"ZkGHqd_f6hxNb5TN6Knu-g","stars":2,"date":"2014-11-11","text":"I think since they have grown people get less back for their traded clothing than what they used to. They say they accept certain brands and it appears so. It's almost better to sell stuff on ebay than bring it here. Not really worth it in my opinion.","useful":0,"funny":0,"cool":0},
{"review_id":"9jv0V3rQKV6iTYk_SHLR4Q","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"8Vpfy_WtcVvZS8Wfz7JQJA","stars":4,"date":"2014-11-11","text":"Love this little hidden gem. The best thing my family ate was the shrimp po-boy sandwich, the hush puppies and the tea. Yum. We will be back.","useful":1,"funny":0,"cool":0},
{"review_id":"KdfdQTdPrH9OCxfnG5B2WA","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"laEOq0egnG2F_6hxtBMYSA","stars":5,"date":"2014-11-11","text":"Great experience. My stylist was Tracy and she rocked - making the whole experience great. Excellent price to get my extensions clipped in and styled for a night on the town with my friend.  Thanks Tracy. I will be back!","useful":0,"funny":0,"cool":0},
{"review_id":"lS0wY9P9DvL0r0oqqcn8QQ","user_id":"TacjkBCCgfe_xix2XtlvJQ","business_id":"7xob9k-4ytfPuphlClMmvA","stars":5,"date":"2014-11-11","text":"I am so happy I chose Dr. Nachbar for my breast augmentation.  Surgery (cosmetic) or not is a big decision. His website was very informative - advising people the proper questions to ask cosmetic surgeons. The staff was welcoming and kind (especially Tammy). Dr. Nachbar is realistic with clients about their expectations. He does not impose any preferences and allows you the client to make the proper decision for yourself (ex: how many ccs to get for your breasts).  He is  very energetic and you can tell he loves what he does. His sense of humor helps diffuse any nervousness you have when talking with him. I had my breast augmentation done May 2, 2014, and I'm still happy with the results. His description of the healing process and what to expect during recovery was on point. Thanks Dr. Nachbar for giving me a lil more pep in my step.","useful":0,"funny":0,"cool":0},
{"review_id":"dkGwU0Og80K7xHQfmRfOCA","user_id":"zaQWSRfWrC3dOgkhc-_Q1w","business_id":"3Jq5LfJ5fmJ5KmuA6VHmzw","stars":5,"date":"2016-11-18","text":"Our server, Jewell, was awesome! Thank you for the great service and attitude. Would be great to have a hot tub and billiard tables if you could swing it. Definitely will be back.","useful":1,"funny":0,"cool":1},
{"review_id":"4NQpSNOrofNFUSDmat59dQ","user_id":"ZalEExPCJHmSR6MgrQ3W5A","business_id":"B70iTJjcPkuYn8ouUewWgw","stars":4,"date":"2016-05-24","text":"This is the best patio spot for a mild spring sunday. Food was good enough in the neighbourhood as you are enjoying bright daylight in the glasshouse!!!","useful":0,"funny":0,"cool":0},
{"review_id":"hZFTPeocE0XbC1_kxokNRw","user_id":"ZalEExPCJHmSR6MgrQ3W5A","business_id":"0a2O150ytxrDjDzXNfRWkA","stars":5,"date":"2016-02-06","text":"One of the best fusion Japanese cuisine in TO!!! The space is a bit loud but great for friends gathering. The tasting menu is a great value. The portions are HUGE!","useful":0,"funny":0,"cool":0},
{"review_id":"dC-9cPf2Wnr7Uv3e6wUlww","user_id":"ZalEExPCJHmSR6MgrQ3W5A","business_id":"MdjIl105vqCYUGKFSUVytA","stars":4,"date":"2016-02-06","text":"Great atmosphere. Seafood is great and fresh. Love big glass window.a perfect place for first time dates","useful":0,"funny":0,"cool":0},
{"review_id":"6kM0ktQTWZH6ogfP8CUUEQ","user_id":"u93hjvj7b_hGU5veNE5Elw","business_id":"XfO5MZI2lH1U2HsMnIsYzg","stars":5,"date":"2017-10-29","text":"I stopped by Noosa this past week and had a great time! The soy salmon was a delicious meal. I sat at the bar because I came in alone so I didn't want to take up a table. After about a minute of me sitting down I realized I made a good choice! The bartenders working were AMAZING! Not only did they give great service they were entertaining and fun to talk to! Both Tiana and Jay or \"T\" and \"J\" ( which is what they told me to call them) addressed me by my first name the entire night instead of \"sir\" or \"Mr\" which gave very friendly vibes. They made sure my drink was always full and that I was satisfied with everything I ordered. I will definitely be back and am sitting at the bar again even if I had other people with me. GREAT FOOD even better service! But like I said I recommend sitting at the bar area and ask for \"T\" and \"J\"!","useful":1,"funny":0,"cool":1},
{"review_id":"7tDrVNbvfvNhzE0y4mvT3w","user_id":"To64NG53nM1j9bH1InnVaw","business_id":"2MJd97hSFiaBGs_pWkjM3g","stars":5,"date":"2012-06-19","text":"I cannot express my gratitude enough for A&M. We returned from out of town Sunday night to discover our a\/c was broken...this leading into a heat advisory and 110+ temperatures. We got A&M as a referral and gave them a call. They said they would be out between 1 and 2, but would call first. At 1:10 we got a call that they were on their way. For the next 3 hours, Bill, the technician, spent his time professionally and diligently fixing our a\/c. He even made sure to let me know that the damage was covered by warranty and I would only be paying labor (which was so reasonable considering the conditions -- up on the roof and in the heat!!). He was sweet, gentle and kind to my dog (despite her incessant barking) and incredibly friendly with me. I couldn't ask for a better experience to fix my a\/c in sweltering heat. Thank you, Bill!","useful":3,"funny":0,"cool":0},
{"review_id":"qDEZ98AUKl_qQVkDIaujYA","user_id":"To64NG53nM1j9bH1InnVaw","business_id":"HjXI6lKGPVNQ8dYJPtaOCg","stars":5,"date":"2015-05-16","text":"I placed an order for carry out and clumsily dropped the entire pizza as I walked out the door. The employee and manager made me a new pizza, free of charge, and I got to keep the dropped pizza (that hadn't touched the ground, just lost all of its veggies). \n\nI sincerely appreciated the thoughtfulness of the staff after I proved to be such a bumbling idiot.","useful":0,"funny":1,"cool":0},
{"review_id":"Wj7029cjJMPFYX8lypAncw","user_id":"F2WCyB53HixIUWbgbtaDSg","business_id":"pbc1PalcR3V6duF4Tk5F_Q","stars":5,"date":"2016-07-27","text":"I walked in and after a very brief conversation with William I picked the perfect choice. The price was unbeatable by a long shot! I felt that William was patient, not pushy and very knowledgable. From start to finish the process was less than 30 minutes!","useful":2,"funny":0,"cool":0},
{"review_id":"-G-nIICXVjRSidItDCyySQ","user_id":"F2WCyB53HixIUWbgbtaDSg","business_id":"j0K_tuCeXVpjq6caSlkMIw","stars":1,"date":"2016-07-27","text":"I don't have one good thing to say. This was the worst medical care\/advice I have ever gotten. I was horrified by the provider and everything she told me. She sent us straight to the ER and the ER couldn't even understand the reason we were there. It was so much stress on me, my child and my whole family for no reason other than negligence. Don't take your child here!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"uyF5J64fxqnC5muE4c2btw","user_id":"8INlSUmfUMMINVqB51mAyA","business_id":"E9ovPn_2KjA-_0OOZSHPBw","stars":1,"date":"2015-03-12","text":"I had my eyelashes done a few years ago, and loved them. They were a bit too long, but they lasted well over two months and were surprisingly were very low maintenance. The woman who did it just said not to be rough with them, to not use mascara, and to use oil free remover.\n\nI wanted eyelash extensions again for a trip I was taking on a Friday. The Sunday before my trip, I went to this location for a petite set. I was given a packet of materials, and part of it said to get your lashes done at least a few days before an event. Lucky me, I thought, because I was going about 4 days before leaving. I figured my lashes would last for at least a few weeks and then I'd have to get a touch up to just fill in empty spots. Boy, was I wrong.\n\nFirst of all, the woman who worked on my eyes must not have washed her hands. I could smell a strong peanut butter smell, and those little latex finger things they use didn't help. \n\nSecond, my lashes lasted for less than a week and a half, despite me following their instructions to the letter. I didn't wear any eye makeup for several days before, I didn't wash my eyes the day I got them and for a couple of days after, and I barely wore any eye makeup at all and definitely did not use mascara. When I did wear eye makeup, I used makeup remover that was oil free and meant for lash extensions. I was on vacation but didn't swim or submerge my head. When I took a shower, I kept my face out of the water at all times. Even with me being extremely careful, every time I blinked another lash would fall off. By the end of the week they were 90% gone.\n\nI was extremely disappointed with the lashes. I am also pretty suspicious of the fact that they push you to get an annual membership so you can get a refill once month. \n\nAnyway, I'm glad I got a Groupon for this because I would have been even more mad if I had paid full price ($250). Never coming here again.","useful":2,"funny":0,"cool":0},
{"review_id":"M8H9Y2jA3W0h95cQ4Fwdww","user_id":"asmt99BZnZpLkdmmf7oFHA","business_id":"G3TpqG_3h0ZRkC1em6qcAA","stars":5,"date":"2014-03-11","text":"Just had my carpets and furniture (upholstery) cleaned by Bill M. with Trademark Carpet Services. They looked stunning and smell so refreshing. Trademark Carpet Services uses top of the line cleaning equipment. They even showed me how the equipment works and how much dirt was being removed. Bill M was honest, trustworthy, professional and courteous. In addition, he was very knowledgeable and informative. I would recommend this company to everyone. \nThanks for your hard work, Bill. I look forward to using you again in 6 months.","useful":0,"funny":0,"cool":0},
{"review_id":"ssTDyHICXbPTsa9mEKGNZw","user_id":"asmt99BZnZpLkdmmf7oFHA","business_id":"pgSc8dBFiyAc0Cxzx1ryuw","stars":1,"date":"2017-06-16","text":"I give this shady, unprofessional, worthless RV dealership a ZERO!!! Do NOT buy your RV from them. You are better off purchasing a RV from an out-of-state dealership such as Utah or Arizona. \nWe bought an $84K fifth-wheel from this place and we had a horrible experience starting from the receptionist all the way to the general manager. The sales staff is a joke. They are lazy, unprofessional, smokers and drunks. They think they are too good (arrogant). The management is a bunch of shady, incompetent liars. They shift the blame onto their subordinates, or they make you sound as if you are the one who is wrong or mistaken.\nThe service department is just as bad. They tell you that they have fixed\/repaired the parts, but when you get it home, nothing works properly. They also keep your trailer for weeks at a time, so if you plan on using it, good luck getting it back on time for your next trip. \nTrust me, they rig everything. \nDO NOT buy from this dealership. Save yourself the time, money and headache by purchasing from out of state.","useful":5,"funny":0,"cool":0},
{"review_id":"Q7R-TE0GA0pGj7zA_hb-HA","user_id":"asmt99BZnZpLkdmmf7oFHA","business_id":"VTqNVgL8_My5jXTpr8lB3Q","stars":1,"date":"2014-05-30","text":"Incompetance, unprofessional, stupidity and inaccuracy is how i would describe the management of this facility. \nIf you read their response to by initial review, you will find they make reference to my \"displacement of my fob key, or to be specific, \"I didnt place my fob key in a convenient place.\" (Same thing). Well, that is completely inaccurate. It's apparent that this manager is stating FALSE information. If you recall correctly, I had my husband's vehicle with his set of keys and he had my vehicle with my set of keys (which OBVIOUSLY would have MY key fob on my key chain). Therefore, tell me how this is NOT putting my key fob in a \"convenient place?\" Really? Are you that stupid? Having my key fob on my key chain is NOT a convenient place? This manager clearly doesn't know what he's talking about. As I said previously, I wasn't trying to scam the gym by getting 2 keys fobs. I am not a deceitful person. All I asked is for this facility to provide me with a way to get into their gym, \"that I fund,\" if I didn't have my set of keys. They talk about providing security, but i guess they prefer that you to wait until a customer leaves the gym, grabbing the door behind them, before it closes, in order to get jn. This is what I had to do on several occasions, as I didnt have my set of keys with my key fob. And each time this happened, there was NO staff member present around 7pm to even IDENTIFY me. Do you call this security? I could have been a \"non-member\" walking into the gym for free. What a joke!!! This leads me into my next question...what is one to do when they forget their key fob and no staff memeber is present, to let you into the gym after 5:30pm? Are you supposed to go home and abandon your workout for the day? I know I am NOT the ONLY person out there that this has happened to. \nAs an owner of my own company, I believe in conflict resolution, honesty and customer service. So let me be the mature, managerial, adult here and say humbly, that my comment on the early termination fee was incorrect. The $341 fee was my contractual commitment. I realize this was my contractual responsibility, which is why I paid it. So I stand corrected on this. Why doesnt this gym offer an APOLOGY to me, rather than be argumentative and flippant???\nBottom line, these people are not real business men, because they should know that you don't argue with a \"paying customer.\" Obviously their egos are more important than their customers. But what can you expect from a mediocre, gym manager? You're NOT that important.","useful":8,"funny":5,"cool":0},
{"review_id":"_QQERKG8NOdsD1Ej8ua2Vg","user_id":"asmt99BZnZpLkdmmf7oFHA","business_id":"8m1HM54_hE6UcQcxWTWMaA","stars":5,"date":"2014-05-28","text":"We are SO GRATEFUL for Jamie and his staff, specifically Pamela V. \nWe can't express how appreciative we are to their firm. Both Jamie and Pamela were so patient, informative, helpful, and understanding of our \"loan modification\" situation\/process. They provided us with peace of mind, not to mention insight and advice. They assisted us through the entire loan mod battle. \nI would recommend their office to all our friends and family. You will get the service you deserve. Trust me when I tell you that you will feel valued and very satisfied. This firm knows the true meaning of \"customer\/family service.\"","useful":1,"funny":0,"cool":0},
{"review_id":"51BM9-TQj4zO-GKF1nsG_g","user_id":"eOb1E-Y5PNJqetvKDVyoPQ","business_id":"vHZ5zRfM2a4ZyfpPdEBSdQ","stars":5,"date":"2017-11-07","text":"If you are looking for a no hassle car buying experience Rodeo Kia is the place. We purchased our first Kia Soul in 2016. I called Rodeo and gave the sales manager the specifics on what we were looking for. But I also stated we were not 100 per cent sure. There was no pressure. Three days later we picked up the exact car we wanted no hassle what so ever. Recently I started reading the reviews on the 2018 Soul and some of the new features were changes that made us think about taking a closer look. Well last week Rashad (he did our paper work last year) left me a voicemail just checking in and we are now driving the 2018 Soul Plus and we could not be happier!","useful":0,"funny":0,"cool":0},
{"review_id":"US9LywEJbvQUa0nyte0MZQ","user_id":"ZISNvek0336SEF3C-QeA8g","business_id":"wzugmCevnXuCMCF4upAf0w","stars":5,"date":"2013-09-18","text":"It's pretty much already been said so I won't bother repeating. This place runs like a factory. Smiles all around. Great food, although not particularly light food as you may expect from a Japanese place.","useful":0,"funny":1,"cool":1},
{"review_id":"B4Ac3b49jeMlgFlomLYkSA","user_id":"RntZyw9EBzKvsmQnc3j6aw","business_id":"2PCmdNMtG3zLp7dBH4Gxfg","stars":4,"date":"2017-08-26","text":"This is my family's new favorite seafood spot! Seasoning on sausage was perfect. My favorite dish was the gumbo and I would recommend it to everyone! Only two cons, margarita could have been a little stronger and our server Viviana was very slow. Nothing that couldn't be changed. Definitely will be back!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"UmL1rYkuwslOeqB_oS0WGg","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"IDQaKXffLa37mKBd9ZA8DA","stars":1,"date":"2015-10-23","text":"This is by far the worst experience I've ever had with any car rental company. The agent was rude, did not to her job in checking that the car was damaged (had to come up and tell her as she didn't take a look at the car whatsoever) and I was given a filthy vehicle that had dirt in the floor mats and bird poop on the chair in the back! Before I picked up the car, I asked what the 'other' charges were on my bill (amounted to about 1\/3 of the price) and she didn't know. \nWhen I mentioned the car was dirty and had a strong smell, she told me I was wrong because she cleaned the car herself.\nAny attempts to fix the situation with the location were fruitless as I was told multiple things by multiple people and nothing ever came of it for weeks even though I called back once a week to try and discuss the situation. I finally went through Avis' customer service who solved the issue and they provided excellent customer service.\nI'd like to stress the following: as a company Avis is great, it's this particular location that seems to employ rude employees and is owned\/managed by a woman whom they called \"Mrs. Mary\" who does not seem to value her customers or giving good service of any kind. There are plenty of other Avis locations to rent from in Montreal, please choose one of them instead!","useful":2,"funny":0,"cool":0},
{"review_id":"HbvxGb5znr6FtKjijHG3mQ","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"1Ok2EXqdH-R0sy-_tyOrMg","stars":1,"date":"2015-09-10","text":"Bad food, worse service. Skip it.\nWe went on a quiet weekend when there was plenty of staff and open tables but lack of organization seemed to be rampant. The food really wasn't anything special and the service was terribly slow and not all that friendly. Also, the trays that the pizzas are brought out directly on are thenstored ON THE FLOOR\/SIDEWALK once we were done. Absolutely disgusting.","useful":1,"funny":0,"cool":0},
{"review_id":"uYK4DlD_5yMaqBiFNBLaxg","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"qDM-yZ9320Vkkt97UG1uqw","stars":5,"date":"2015-10-23","text":"Hands down one of the best dining experiences I've ever had. From the decor to the friendly and knowledgeable wait staff to the absolutely incredible food, you will not leave this place disappointed.","useful":1,"funny":0,"cool":0},
{"review_id":"nMApnOK6NPii5qn8tP7MMQ","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"a8WBqe4FpzaaeSzpG9sVDw","stars":5,"date":"2016-09-25","text":"Amazing service, amazing brunch. Highly recommended and already making plans to come back.","useful":0,"funny":0,"cool":0},
{"review_id":"lyoZoX7OLkgjm35XKaIbFg","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"Sfj3hnJQoiEhUi-pp4n1xQ","stars":1,"date":"2015-10-03","text":"BBQ chicken pizza tasted like it had been made earlier today, found an ant scurrying next to our table. When I told the waiter this he jokingly said he didn't control the ants and told us about the bee problem they had over the summer. Great.\n\nWould not recommend, go to one of the many downtown locations instead.","useful":0,"funny":0,"cool":0},
{"review_id":"880leT8MIskJYcZQDiVY8A","user_id":"oClSop924pYiEwnm_Et_6Q","business_id":"DbxQ3FVcb_9khJA7rDiRtA","stars":5,"date":"2015-10-23","text":"The best all-you-can-eat sushi place in the city. Lots of options, speedy\/friendly service, tablets with pictures to make ordering quick and easy. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"U3vz_7B0WqJg19ae5rtzsg","user_id":"U2G3ogb15LCpQ4hs4iZlCw","business_id":"LRCo7BmPAg_rW3Q8W_8-Ng","stars":5,"date":"2014-12-08","text":"Amber is amazing! Such a welcoming, clean, boutique feeling atmosphere. My skin is glowing. I will absolutely be coming back!!","useful":4,"funny":0,"cool":2},
{"review_id":"qNmWgIsFWFsnZd7WArznuA","user_id":"5Eqk_ogELW5Zw-7DeYXMbA","business_id":"RsxqZk0wswetGMaaQh2r2Q","stars":2,"date":"2015-11-29","text":"Drinks are way over priced. Places in Chicago with the speakeasy atmosphere are much cheaper. Place was much better years back","useful":1,"funny":3,"cool":0},
{"review_id":"OfZ02jShKFRth-m0cOCiAQ","user_id":"_iZrj2q6nQTAHgkjfcRElA","business_id":"t24iet8ECETVbu_2UhrxkA","stars":5,"date":"2016-08-23","text":"A very professional place!  My repair estimate was a fair price and the repair was done in a timely manner!  I highly recommend Ric's Body and Paint!","useful":0,"funny":0,"cool":0},
{"review_id":"Jlw4yv8rqvrYxPKWdfvyxg","user_id":"B1Ip0lpWVzGsXfSWU-nuqQ","business_id":"bXoRrDhojAQ1B3nGNEs7wg","stars":5,"date":"2016-02-16","text":"A taste for taste. A bless in a continent where fake food has become normal. \nWines are really special, food has fine taste and the atmosphere is cosey!\nDon't doubt just go!","useful":0,"funny":0,"cool":0},
{"review_id":"ScfPCfo89l7SeiA053QBLA","user_id":"jssynLAfMwZ1_cmCW_S_5Q","business_id":"XaCZ11vawjLZ6gDE2dU6CA","stars":5,"date":"2015-11-04","text":"I'm waiting for the new Costco off the 303 to be built in the West Phoenix Valley.  Please come soon!","useful":1,"funny":0,"cool":1},
{"review_id":"Q0lt6HPq3jjNPmPmKKpEQA","user_id":"I5HauGR99Jfns9BymJ8Jmw","business_id":"rACsJxfreq6l1pquJeC36Q","stars":5,"date":"2015-12-21","text":"Kengo Sun was extremely helpful in explaining the process to me. He kept in touch often so I always knew what was happening. He treated me like a friend!","useful":0,"funny":0,"cool":0},
{"review_id":"MzZWEBFQjzMmiaF9F6bc3g","user_id":"I5HauGR99Jfns9BymJ8Jmw","business_id":"234xl6FvaEjileGm2jtKGg","stars":5,"date":"2011-02-21","text":"I had my back piece done by Byron at Black Lotus. I had it done in three sittings since it is a fairly large design. He did an awesome job! I love my tattoo! I definitely plan on going back to have Byron add to it. The shop is very clean and inviting and everyone is very friendly. The artists are truly very talented. You can view each artists' work on their website. If you are looking to get a tattoo, I would definitely recommend Black Lotus Tattooers!","useful":0,"funny":0,"cool":0},
{"review_id":"8blfKpjDwSqELG3cSuTCiA","user_id":"I5HauGR99Jfns9BymJ8Jmw","business_id":"nG9xyZhpNzhVKHb5Gsy1GQ","stars":5,"date":"2015-10-10","text":"I recommend Ryan at The PC Fixers for any issue you may have with your Apple or Windows computer. He fixed a problem I was having with my Lenovo touch screen laptop in just minutes. Great service!","useful":4,"funny":0,"cool":0},
{"review_id":"AQqyyRWltQTxjy9U9DO4hg","user_id":"I5HauGR99Jfns9BymJ8Jmw","business_id":"ajxERYetbZnOJ1eOqik67w","stars":5,"date":"2014-01-04","text":"This place is the best! I used to eat lunch at this location all the time because it was near work. Not only is the food fantastic but the service is too! The manager Jeremy is so friendly and helpful. I stop here whenever I can for a delicious and healthy bite to eat.\n\nFavorites here are the Chicken Tortilla soup, the Salsa Verde Shrimp tacos and the Grilled Gourmet Chicken tacos.","useful":0,"funny":0,"cool":0},
{"review_id":"DTNuVmtL57SwCxF8WR5Inw","user_id":"dc2f8UTYeeOL6Y6x0oq_FA","business_id":"b6VTEZTFaTcaoNqv4v2AXg","stars":5,"date":"2016-02-15","text":"Yes yes yes!!! Was there once, if need help with my teeth- will back here!!! Very great services, nice - kind people - who work there!!! Pretty much fast and quality work! Thank you guys ! Please keep doing it , you are make me bite some hard things","useful":0,"funny":0,"cool":0},
{"review_id":"-MNw7z7YsR-J_FQWZjEfQg","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"gOOc6MDdhw7fV0Tf30mfAQ","stars":4,"date":"2015-02-28","text":"I put my previous review n the wrong area, so this will be pretty short...great food at great prices! Make sure you order ahead if you have no patience, food takes a while to come out but oh so worth it when you get it. Clean environment, friendly staff. Place is super small","useful":0,"funny":0,"cool":0},
{"review_id":"fP-UItEDbN1WwbOvjPfjew","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"G6BwYw_0_atLPTzI1uokIA","stars":2,"date":"2015-05-04","text":"I'll keep it sweet n simple. This place is very basic n bland. They need their on seasoning to make the food stand out more. Customer service was good tho. Place needs work for sure but I can tell improvements are around the corner. I'll try again n a couple months maybe","useful":1,"funny":1,"cool":1},
{"review_id":"VkDn83Uwe61zQsVxmCYr8A","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"ruPFtD9dU6Cv9_wpzIR4UQ","stars":4,"date":"2014-09-19","text":"Can't beat steak n eggs for $5. taste good too.ive been coming here for years n I'm not tired of it yet. I couldn't tell you how anything else taste tho, it's all I get lol. go after midnight eat good, then order one to go so you wake up to the same goodness. doesn't get much better than that.","useful":0,"funny":0,"cool":0},
{"review_id":"7EASiVBGH48NG7cdg8GGEg","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"kiweDovyXezj-ZMpB1tlXg","stars":4,"date":"2014-09-05","text":"This place has great food and friendly bartenders.i try to come here at least once a week for happy hour. 10 great wings for about 4 bucks is just awesome. Addictive I tell ya! I come graveyard hours. Damn near empty at that time. Nobody is ever way too drunk n sloppy.","useful":0,"funny":0,"cool":0},
{"review_id":"2wfMyWhdwD_IyWkgjS9AXQ","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"SueEpC916vd8Lo3Lyl9_pQ","stars":4,"date":"2014-08-07","text":"Lot of food for a good price.and it taste great too! I will eat here at least twice a week now.highly recommended","useful":0,"funny":0,"cool":0},
{"review_id":"XqXyQ57GlG2EBTgt788x1g","user_id":"8u8IITscJK5Hhy5ERtjMYg","business_id":"aquwzx3ZsiG8l83lpnWF3Q","stars":4,"date":"2014-06-25","text":"My regular gym, tried others but they don't compare. Few people mingle too much, but most are focused on their workout","useful":0,"funny":0,"cool":0},
{"review_id":"8vQEgorIR29PXNJqfOiq6g","user_id":"rTqVgvPGjPh2gUHe-leKRw","business_id":"hpnFcRFzs3kg-qM1tPEg3g","stars":3,"date":"2016-09-19","text":"Went to Sapphire Friday night and was impressed with the interior and the service they provided.  After they sat me down on my reserved table that's were it went downhill.  Everyone expected a tip for everything.  I had a two hour open bar and every time I ordered a drink the server would ask for a tip.  When I got vip dances they make you buy drinks and they add taxes and don't expect your change back because they'll just keep it as a tip.  I give this place 3 stars just because it does seem like an upscale type of place and it does have plenty of beautiful women. But the main reason I'm giving 3 stars instead of 1 or 2 is because the girl I was with was really cool.  She was one of the rare ones that will actually talk to you even if you tell her no.  She was so full of energy and really kind I had to get a dance and boy could she dance.  I planned on being there for about two hours,  I stayed for over 6 hours just talking with her and getting a few dances here and there.  She definitely gets 5 stars.  If you want to have a good time and not just another girl trying to take your money talk to Evelyn she's got a great personality and serious skills at dancing.","useful":0,"funny":0,"cool":0},
{"review_id":"fekMspN8qzJtai03tCUUvQ","user_id":"vuJ39vRaVZTgkT6I4L1jjA","business_id":"1HnYxHZw2icWQ7-T4AmQ0Q","stars":5,"date":"2017-06-18","text":"Awesome place!!! Love that they have old style beer!!! Pizza was amazing as well! Service was A+ I will be coming back for sure!:)","useful":0,"funny":0,"cool":0},
{"review_id":"O6HtRybnYaaQ3xQ2tk-gxQ","user_id":"T6iCejlqE3I7dC7kfi7SnQ","business_id":"KJva9u5Zu7_tyZrjYBFnIg","stars":5,"date":"2013-09-08","text":"This is a great family restaurant and the prices are great as is the food. It's old fashioned but great value. I'm a regular here.","useful":0,"funny":0,"cool":0},
{"review_id":"6PPkMrIO_ov8limrWT4FfA","user_id":"P22y_ihLcicX4iRiru0hiw","business_id":"mFrkBUEyop52sYWAQhBm5A","stars":1,"date":"2012-10-07","text":"Worst place for breakfast in Gilbert, horrible food. This place really needs to invest in a real cook.\nWill never come back, period.\nWe estimated that half of the patrons sent thier food back (at least one time, some folks had to send back more than once) and the smug servers were totally unphased, they must be used to it.\nSave yourself the headache and go somewhere, anywhere, else. This dump only survives on the overflow from the Farmhouse next door.","useful":3,"funny":2,"cool":0},
{"review_id":"82CBfDZKU-pS0hzRa3eB7Q","user_id":"P22y_ihLcicX4iRiru0hiw","business_id":"Ln9fVEDjGdxmynkws2jICg","stars":2,"date":"2016-07-18","text":"Stopped going here after all the heath code violations but thought we'd give it one more shot last Friday, wish we hadn't.\nEven with reservations we waited over an hour for our food, not because it was busy but because they sat us at a table by ourselves but wouldn't start cooking until more people came in to fill up the table.\nIt was well over 90 degrees in the restaurant, despite every person complaining they would not or could not help the situation.\nLastly the food is horrible and way overpriced, the \"show\" was a non-starter as well. \nThey do still have the dragon lady walking around, frowns for everyone. SMH.","useful":3,"funny":0,"cool":0},
{"review_id":"RiMzetjWQEWR0HXFHga0pw","user_id":"P22y_ihLcicX4iRiru0hiw","business_id":"VX2ceab1YVMMIxAt0aZEeg","stars":1,"date":"2015-08-27","text":"Ordered online with over 24 hours notice for my daughters birthday.   Picked up my order (which was not what I ordered) at the pick up time requested.  When I got to the store was greeted by a nice young girl who made sure I knew this was just her second day and that she was alone.  When I told her what I ordered and she could not locate my order she proceeded to call her manager, that manager was just has helpful as the 2 day employee.  Needless to say since I had prepaid for the cupcakes, I took whatever was on hand.  No discount or reimbursement for the wrong order.","useful":0,"funny":0,"cool":0},
{"review_id":"48WgYJVQ3kD2e0e3Gi41lg","user_id":"D46d0Nve_BjZEu9r9piBOg","business_id":"bIrg_VRbL5gvAi-zxJJcWw","stars":5,"date":"2016-02-05","text":"I couldn't be more pleased with the arrangements they made for my daughter's baptism. The center pieces included ivory roses and hydrangeas. They were so beautiful and elegant! I didn't need any other decorations at my reception venue because the flowers were so lovely. The head table arrangement was my favorite, bigger and more elaborate than the other center pieces. It was so beautiful, elegant and sophisticated--totally exceeded my expectations! They delivered everything to the venue on time, which made the day much less stressful for me. Additionally, their customer service was exceptional, they were just wonderful, easy to work with and very accommodating.\n\nI've been disappointed with florists in the past because you typically get something smaller and more disappointing than what is advertised in photos. VIP Floral Designs delivered the opposite--something bigger and better than what I expected! I couldn't be happier with my experience with them. I highly recommend this florist.","useful":0,"funny":0,"cool":0},
{"review_id":"ULJZnG_di4Yte_8G26BeEQ","user_id":"yHU5lMo4yXOWY_UMgz84Pg","business_id":"1S7kSjqPmXo2KTPyc98LYA","stars":5,"date":"2016-06-21","text":"Good service, I've been coming to this dry cleaner for about 3 years. The women who work here are very friendly and the store recently got a new owner who is friendly as well. My shirts come back with no wrinkles, all clean! I'd recommend Titan Cleaners.","useful":0,"funny":0,"cool":0},
{"review_id":"B0gxxExfBBpT8ZBkmu7D3g","user_id":"LMz8_uaijdLYq1w-GObr-g","business_id":"hMAw6C_-67QgvkGVLaErEg","stars":5,"date":"2012-12-05","text":"Have given the hotel 5 stars on the above reviews, only a quick visit on our way to Whitby impressed with Scripps garage (A man after my own heart, he had a 350 Manx Norton hidden away). This is typical Heartbeat country, well worth a visit.","useful":0,"funny":0,"cool":0},
{"review_id":"z-N2lRW601si4ewBDY_23Q","user_id":"LMz8_uaijdLYq1w-GObr-g","business_id":"Y5VQLoDhjFmJQbSsLyjhAA","stars":5,"date":"2012-12-05","text":"Visited last weekend whilst on visit to Whitby area. Absolutely amazed with Robin Hood's Bay; it is whatever you want it to be; romantic, adventurous, mysterious and everything in between. Very obviously lots of holiday lets which can raise argument for and against, but well done to the residents. Beautiful, historical and a place I would want to visit again.","useful":3,"funny":0,"cool":0},
{"review_id":"Q0rWCTdKSTLtfr9-7vA7ww","user_id":"LMz8_uaijdLYq1w-GObr-g","business_id":"_Wq-Ei5VKopb--qBHltLjA","stars":5,"date":"2012-12-05","text":"Staying in Whiby for a few days went pass the Magpie it was Sunday and there was a queue so we came back Monday dinner time this time walked straight in, we had the small fish and chips, it does say they are Yorkshire portions, they are not wrong, the food was perfect. The fish is bought from the market just across the road. would certainly eat there again","useful":0,"funny":0,"cool":0},
{"review_id":"eT9k2yQQPlusCkMOgNONEw","user_id":"WWw7pNf3EzxP3lMu1jUgOA","business_id":"SRevXU9q4n2CVMRzjPOw7g","stars":1,"date":"2017-09-10","text":"Terrible experience. I bought 4 tires from a different NTB, it included free tire rotations. I was in the area so came to this location to get them rotated. While they were doing that the mechanic came out and told me my struts were leaking oil and needed to be replaced, said he could do it for $900. I thought this was weird because I had just taken my car in to the dealer to get an oil change and if they could have sold me new struts I'm sure they would have. When I said I'd think about it he tried to get me to sign up for their credit card, said \"he was just trying to help me out.\"\n\nThe next weekend I took my car to a mechanic I trust and he told me the struts were in good shape and not leaking anything - so NTB was either trying to rip me off or are incompetent.\n\nTo further lower my opinion of this shop, a few days after the rotation my car said all the tire pressures were low - they didn't even do that right.","useful":1,"funny":0,"cool":0},
{"review_id":"kjAVm8aK3AIqott8WXB_1Q","user_id":"WWw7pNf3EzxP3lMu1jUgOA","business_id":"Sf-ZyFFc4UgdgaGzONgaCA","stars":1,"date":"2017-12-29","text":"Went here after Christmas to build a stair railing. All the wood for the precut kits was warped. Tried to find an employee to ask about steel or aluminum options. When I eventually found one, they couldn't help me but said they would call someone else. Waited 20 minutes for help then left in frustration.\n\nPassed a group of 6 employees hanging around talking at the front of the store. Very frustrating, won't shop here again.","useful":0,"funny":0,"cool":0},
{"review_id":"RhIYih76Qc2Ru1fVcQjEaw","user_id":"F77_PJlvtOL11lU2aKYaLw","business_id":"HKfW6AZ-lW7jwLJwNlcLLQ","stars":5,"date":"2016-07-03","text":"Amazing food, very friendly staff, baby\/kid friendly (they even have a real change table and low sink in the women washroom, and kids books, colouring books etc).  They also offer very tasty (free) appetizer that most Japanese restaurants used to offer.  Highly recommend!!!\n\nAlso, a very unique and personalized touch: they offer (regular) customers to bring in and store their own chopsticks right by the entrance.","useful":1,"funny":0,"cool":0},
{"review_id":"GM9coBT9xt8l1HTmgZYFiA","user_id":"F77_PJlvtOL11lU2aKYaLw","business_id":"o4gB1zWiCHgbjq-tNFRW-g","stars":5,"date":"2017-09-18","text":"While they only have 10 items on the menu, the ones I tried are one of the tastiest noodles I've ever had.  Staff is attentive as well and decor is simple but sweet.","useful":0,"funny":0,"cool":0},
{"review_id":"SkeAztmKoMKj2fc8Wj8Nvg","user_id":"F77_PJlvtOL11lU2aKYaLw","business_id":"HY_A1DREcEnlf7S2KnZWNg","stars":5,"date":"2012-12-05","text":"I love going there for the freshest fruits\/vegetables and the good selection of salads plus ready made hot food.  The slight higher prices are worth it for me, a local resident who love the freshness and convenience.","useful":0,"funny":0,"cool":0},
{"review_id":"UeMRrq6v8-aQjpVhAwhAaA","user_id":"F77_PJlvtOL11lU2aKYaLw","business_id":"2aIgbnGUg8VC0u9iXO-wnQ","stars":5,"date":"2012-12-05","text":"What a gem!!  I love the selection (even has takoyaki) and taste.  Also love that the combo hot dishes such as salmon teriyaki (one of my fav's) comes with red bean rice instead of just plain white rice. Really fresh fish, that even my very picky sister complimented on the freshness and loved her meal.","useful":1,"funny":1,"cool":1},
{"review_id":"duCThemBKq7lLmlO3S3_Hg","user_id":"F77_PJlvtOL11lU2aKYaLw","business_id":"DsKmWMwYjxNyswHem6TjQw","stars":5,"date":"2015-10-09","text":"Found this place by accident and man one of the best schnitzel I've had, and amazing super friendly owners.\n\nI had their mushroom schnitzel on rice, so delicious and not greasy or dry. My husband and daughter had their cabbage rolls with potato and it was a hit with my picky daughter.  \n\nThe owners are so friendly and helpful.\n\nIt was such an amazing dining experience!!\n\nHighly recommend!!!","useful":1,"funny":0,"cool":0},
{"review_id":"xvzy7AsIYjAKx_i_jHLq3A","user_id":"2W2iOwh277SBnZoSMJsnFA","business_id":"l8k4gOEkfoLKq0mPVWHWGg","stars":5,"date":"2015-03-22","text":"Went here for lunch with my Navy unit today and Wally, the owner visited our table, thanked us, and comped our entire bill of 15 people! We were floored. The food is fantastic and Stephanie, our server was awesome! Will definitely be our regular go to place:)","useful":9,"funny":0,"cool":2},
{"review_id":"FS2GSrwxvCG152eIDDRK4g","user_id":"DjzzS8hwscurSbfXeK0lVQ","business_id":"pTSZVeKu0Hykw2I0blwmPA","stars":1,"date":"2016-06-30","text":"I live close & visit this establishment frequently . Tonight it was about 8 pm, they start shutting down even though they don't close until 9 or 10pm. I dare you charge my children and I for ratchet food that's been there for hours lifeless! That mgr, wish I got her name, snapping back. You are so unprofessional & rude! You don't stiff customers because your lazy ass don't want to make fresh food! Disgusting! I won't be back & km going to tell everyone I know to avoid that trap you call a restaurant !","useful":0,"funny":0,"cool":0},
{"review_id":"VHhqdCRoEqTrHVvDQOuyuQ","user_id":"0-zWHZhLFKlkQEQpAJZZRw","business_id":"8qNOI6Q1-rJrvWWD5Btz6w","stars":5,"date":"2012-07-05","text":"Their alfredo pizza is the best!   We also love their lasagna, calzones, and chicken salads.  Luciano's is always near the top of our list for a great local restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"ljXCZ1SKKfVS0T6RuFZKZw","user_id":"2dpKUbXYtMcjSLwtuZXdcQ","business_id":"jkicNu9xyZhsAOuDqbgDVQ","stars":4,"date":"2015-01-07","text":"Love the clean friendly atmosphere here.  I go regularly and so was looking forward to the New Years Eve party.  It was awful.  The band was the only good part.  They served Chex Mix and tostitos with salsa as the \"snacks\".  Really?  Not enough places to sit down, not enough drink stations. People in the crowd were rude and pushy. A $35 ticket was a waste.  I would rather have had a nice dinner somewhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"zNVZ0sF6TnNbtTPg2b8K8w","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"U1cXgftMjQheZfY8QKoXmA","stars":5,"date":"2012-08-06","text":"I absolutely love the magical forest. We go every year at Christmas. I have helped decorate trees. This year I am helping with metros tree. Last year I watched over police car kids could play in . freat place for holiday fun.","useful":0,"funny":0,"cool":0},
{"review_id":"rFH9iSvRmdm5LtDdsYwwpA","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"4KfDcE9iU2isFpoaKeDpgw","stars":5,"date":"2012-06-14","text":"Great place to take your kids and interesting for adults to.","useful":0,"funny":0,"cool":0},
{"review_id":"ANOe0tl2xCSA01ukWayPIw","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"ojd-Sn7A05kl2wdZA0YGzA","stars":5,"date":"2012-06-14","text":"I saw Sir Elton a couple of weeks ago and he was fabulous. His piano is amazing to watch as it changes scenery as he sings. The huge video is beautiful that plays the whole time. My friend and I loved the show.  I recommend this 100%","useful":0,"funny":0,"cool":0},
{"review_id":"uYNwOiYQnbZtk681pZ2e8A","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"7U-yh8dvsvhd87i2crfOAw","stars":5,"date":"2012-07-05","text":"great place to go . The dam tour is interesting. have to go if you are tourist,","useful":1,"funny":0,"cool":0},
{"review_id":"3vF-u7WylAslou_AV9UIrw","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"o69XnnmtOaj6a2sjOTsGeg","stars":5,"date":"2012-06-18","text":"Would highly suggest to try this place awesome sandwiches","useful":0,"funny":0,"cool":0},
{"review_id":"pSpXcRCy8i8Y9CS6XLgMlg","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"Sovgwq-E-n6wLqNh3X_rXg","stars":5,"date":"2012-06-14","text":"The best . Music and great food what more can you ask for? Great service yep they have that to.","useful":0,"funny":0,"cool":0},
{"review_id":"XHUxlQJL4FOQ8tJBhHUl7w","user_id":"9gYbRvijurhrnC6yPRlaUw","business_id":"z0rSmZQz9eEXjg_C3_E5-g","stars":5,"date":"2012-06-18","text":"would suggest anyone to try it. I have an ex coworker who now works there. Racheal is gonna rock it.","useful":0,"funny":0,"cool":0},
{"review_id":"uO1TqZbnKhV8IlLEUjF4RA","user_id":"gUmbo8Jmoq8I1kn9Ca2-bw","business_id":"3JcmZmhiI11tt-ffzPAP2A","stars":5,"date":"2017-03-09","text":"Arturo was fast, friendly, and extremely affordable!!! I highly recommend him for any and all of your plumbing problems!!... Thank you so much, Arturo!","useful":1,"funny":0,"cool":0},
{"review_id":"FVCoVOScTjWgrtPFSFFkEg","user_id":"gUmbo8Jmoq8I1kn9Ca2-bw","business_id":"gXU8gjs64viFq69UTsCjDw","stars":5,"date":"2016-09-16","text":"I recently had a breast augmentation (smooth, round silicone sub pectoral through an inframammary incision) and the results are absolutely amazing!!! Dr. Richards and his staff are extremely professional, accommodating, knowledgeable, and friendly!! I highly recommend Dr. Richards for any and all of your plastic surgery needs!!!","useful":0,"funny":1,"cool":0},
{"review_id":"T8pO6tqp8_61YEifW3m2KA","user_id":"N0y1uMlaq7LlRDSoAE5uqQ","business_id":"im2J4GZZdEl7s4o21D7rgw","stars":5,"date":"2017-04-16","text":"Well, there's only one thing you can get, but that one thing is perhaps the best sandwich I've ever had. Lucy is not just an amazing cook but is incredibly friendly. Don't go here expanding anything other than a beautiful banh mi and a soda.","useful":0,"funny":0,"cool":0},
{"review_id":"4lUTfSNAs91lhT6o5vuSGA","user_id":"N0y1uMlaq7LlRDSoAE5uqQ","business_id":"N42CouuodYv-yGpmuUZyew","stars":5,"date":"2017-04-16","text":"Amazing authentic Ethiopian! This place deserves to be packed since its the only Ethiopian in the city, but even if the were twenty, it would still probably be my favorite. If you want to try a completely new cuisine, this is the place for you.","useful":0,"funny":0,"cool":0},
{"review_id":"zrJ6EFZ1uJ3x-vxtg8H-Sw","user_id":"RfH7MV2_ekMzSyYftdudMA","business_id":"zdd3hyxB8ylYV6RcNe347Q","stars":1,"date":"2016-02-08","text":"Do not live here! The office staff is shit they don't keep track of anything a bunch of morons working in the office. There's always cops in the complex and the place is infested with roaches. Take your money somewhere else that's affordable and nicer.","useful":2,"funny":0,"cool":0},
{"review_id":"k6PyBOhOs5tR6EofGenh0g","user_id":"gxpc8aCm2MiX2pX4xsLiiA","business_id":"BORPULADzZV6_LJZzcsywQ","stars":5,"date":"2016-05-26","text":"Absolutely the best PATTY MELT (even better than one from the Waffle House at 2 am down off Peachtree Street).\n\nDo youself a favor visit the PBR RockBar & Grill and Jessica at the bar.  Place to be!\n\nIf your curious who Jessica is, she the bar tender who's a true-blue BLACK HAWKS fan!","useful":0,"funny":0,"cool":0},
{"review_id":"K29dPmLSMRkgSeebRFvv0g","user_id":"gxpc8aCm2MiX2pX4xsLiiA","business_id":"nOnyzCNbWCPu-I8XskU1PA","stars":3,"date":"2016-10-26","text":"White washed on the outside.  Inside just plain fun hangout.  Waitresses are great.\n\nIf you think that the place isn't a hangout, just count the number of bar stools.  Ought tell you something.\n\n2.95 PBR  beers turned me in.  But do try a bowl of the house's chilli.  Ask for your onions and cheese on the side.  Mix it how you like.  The Cook has a winning recipe!\n\nI'd like to be here on a weekend and ride up on a bike. Fun place!","useful":0,"funny":0,"cool":0},
{"review_id":"lLIhGhcahkSE0nZfbJvd5w","user_id":"gxpc8aCm2MiX2pX4xsLiiA","business_id":"0ydy2fdDg6kpGy1dbnHYsQ","stars":5,"date":"2016-05-24","text":"Hidden treasure.  They make a mean omelet. That Mexican white cheese has made me a believer! Really great food.  As Arnold would say, \"I'll be back.\"  If you get Chris as your waiter, count on excellant service.\nChuck C., Birmingham,  Alabama\n\n\nSecond visit (5-26), same as first.  This time it was great service by Ivan.  Highly recommend the garlic shrimp.  These folks have it going on.  Eat there.","useful":2,"funny":0,"cool":0},
{"review_id":"b_zn7gOqZhkcdKZM9MFOHg","user_id":"gxpc8aCm2MiX2pX4xsLiiA","business_id":"X3ec1nuK2BmOULN4Kk3Fgw","stars":4,"date":"2016-10-28","text":"At check-in Cibola Resort folks mentioned The Haymaker (when you go show your room key for a pleasant benefit).\n\nWe were sat in 1 of the 2 booths facing the bar.  Shielded from all the commoners (ha). Travis our Server, turned out to be the Bar Tender.  Great attitude and great service.  Made the statement that he figured we were staying at Cibola because \"everyone around here has been here before, and knows the menu, including breakfast, is served all day long.\".\n\nPleasant place.\n\nWe got the Oriental chicken salad and chili.  Breading on the chicken was very good.  You should ask for a extra thing of dressing with your order.\n\nThe fried green tomato BLT with a avocado was good and juicy.\n\nIf it wasn't my lunch time, I'd have tried one of the Eggs Benedict that Travis bragged on about.\n\nOk it is past 6 pm, Mike and Jill can handle it. See photo","useful":0,"funny":0,"cool":0},
{"review_id":"_3OZa3offR6rxrW-Fi8gig","user_id":"C2EThwvYMK1eHS1UsoPRAA","business_id":"Wb6Q0YVcNghQ2w20hUYRoA","stars":5,"date":"2015-09-02","text":"Nice folks, great coffee with a good location.  \nSkip the one a block next to butters  Much \nbetter coffee!","useful":1,"funny":0,"cool":0},
{"review_id":"wZ1MUT1jaqeEMtWo5zS1_A","user_id":"C2EThwvYMK1eHS1UsoPRAA","business_id":"c7ih3d4WF-TdlgdViHIJbA","stars":5,"date":"2017-11-08","text":"Jim handled a lease transaction for the property i will be renting.  \nCouldn't have been more professionally done.  Opulent is thorough \nand well versed on leasing.  the folks who own the property spoke\nhighly of Jim  and i could not be more pleased.","useful":0,"funny":0,"cool":0},
{"review_id":"xRYIcsA2J6TGXprUP6Eo7Q","user_id":"C2EThwvYMK1eHS1UsoPRAA","business_id":"6vFt-nY4xUngNQ6eU5aOiw","stars":5,"date":"2017-12-15","text":"These folks are terrific!!  I am very cautious where I take \nHenri (dog).  Could not be happier nor could my dog.  He\nleft with a toy from their toy box (henri picked a chew toy),\na red bandana and a bow with a bell.  Looked and smelled\nclean.  Can't wait for our friends to see him at the dog park.\nSuper nice people, tell them Henri sent you  (haha)","useful":1,"funny":0,"cool":0},
{"review_id":"pDi2jo04ZJLMc5C54To1Fw","user_id":"t6Ya1J5KyHTNdjARpXMv3A","business_id":"aZnSqhKYKjvY3QrjS27MmA","stars":1,"date":"2013-04-23","text":"Very very bad & dis-honest I left my back pack in the trunk of the car, the driver said he never seen it and maybe someone else took it out (and how might that be?) 10 calls later and 1 to the manager and still nothing, they keep saying \"oh no sir the driver said there was nothing left in his trunk\", LIES. I refuse to accept this dis-honest behaviour!! I caught this cab from the airport to downtown Calgary and tipped the drive $9, how can the airport let this firm be a contractor\/service for their airport?? Are there any good people left in the world, I have to say I will never take this cab company again and I will putting my complaint to the paper, google, bing, yahoo, and the airport. Do not use this bunch of criminals!!!!!","useful":2,"funny":1,"cool":2},
{"review_id":"KxdFvaTwjvrnQABaIKmg0w","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"A-KVm7iKLOe1X1yAQP13FA","stars":4,"date":"2013-12-27","text":"This food here is fantastic! My wife and I eat vegetarian most of the time, and this is one of our mainstay restaurants for take-out nights. But don't let the 'vegetarian' label scare you off, this is just damn good Indian food by any standard.\n\nOur usual order is the aloo paratha (potato bread), masala dosa (dosa stuffed with spicy potato), and the chana masala (chana dal in a liquidy masala sauce with rice). One order of each of those is enough food to stuff two people, for a total of $18.53+tax+tip. Note that's 1 order of each of those, total, not 1 for each person.\n\nI'm docking one star because the service when you eat in is lacklustre to say the least. Most of the time they don't seem to care whether you get water, take your order in any reasonable time, etc.\n\nBut the food is good enough to keep me coming back again and again for take-out.","useful":2,"funny":0,"cool":0},
{"review_id":"vqIBblEKpswqyXV3T8FG9Q","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"fiFNpXVk4OkW76vzDtL7JQ","stars":4,"date":"2013-10-09","text":"The pizza and panzerotti here are great. Even when you go in and get a slice from the warming tray, it is good. I can't comment on their delivery, as I have always just walked in.\n\nThe only issue I have with them is that they don't seem to have any posted hours, and apparently they're not open for lunch?","useful":0,"funny":0,"cool":0},
{"review_id":"7Lt2W9ixwpbuNgv9Sjwoxg","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"0yZkGtnjZYxdW39aaKKzQg","stars":4,"date":"2013-10-07","text":"Got home from the airport last night (Sunday) at 11 pm. No food in the house, and starving. Check what's open: Mi Gia Phung. Why not try it?\n\nOrdered the deep fried spring rolls, the large Thai-style pho (me) and the medium vegetarian pho (Jackie). All were delicious.\n\nApparently they don't necessarily close at midnight, it's whenever they stop getting business, which \"might be 11 pm, might be 2 am\". So that's kind of annoying because you can't count on them being open if you roll in at 11:15 pm, but if you're lucky they might be open even later.\n\nMost importantly though, the food was delicious and the waitress was friendly (I think her parents might own the place? They were hanging out in the back.) Will definitely return.","useful":0,"funny":0,"cool":0},
{"review_id":"2c-2fZHq7nCXckX9igJBcQ","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"n44grut83X0UiRZCA-O1fw","stars":3,"date":"2013-10-11","text":"Let's start with the positive: the pastries, baguette, and sandwiches here are great. (I haven't tried the quiche.) The country-style pate sandwich is my favourite.\n\nThe reason I only give it three stars is because of the service. And not that the staff aren't helpful - they are. They're great. It's just that there are never enough of them. Twice I've come here and there is only a SINGLE person trying to cover the cash register, make coffee, get pastries for people, and serve tables. Totally impossible!\n\nOr during the lunch rush, there might be TWO people. They still can't keep up. They're trying, but they can't keep up. It ends up being a frustrating experience for me, and I'm sure it's frustrating for them, too. I really wanted to love this place --- it's very close to my house --- but I just can't deal with the lineups when taking things to go, and slow service when eating in the restaurant.\n\nIf they only did coffee and take-out pastries and baguette, it would be fine, but with sandwiches and quiche, and table service, and fancy coffees, it just doesn't work.\n\nSo this three-star review is not really aimed at the food, or the staff: I'm hoping that the owners read this and start putting some more employees in the restaurant!","useful":2,"funny":0,"cool":0},
{"review_id":"BnCyPRc0D8BrWAaQIWf2dw","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"Xy74meQwdTnloAAyRC-4cg","stars":5,"date":"2014-01-08","text":"The Works is one of my regular stops for a spontaneous restaurant meal on the Danforth. Solid beers (I like the Barking Squirrel), ridiculously good fried pickles with spicy mayo, and a great selection of burger toppings. I always order one of the pre-selected combinations (usually something spicy) rather than choosing my own toppings. Poutine for a side is also great - better curds than many places. Did I mention that I'm not watching my calories when I come here? The veggie burgers, which my wife gets every time, are also apparently great - I haven't tried it yet though.\n\nEvery time I've been, we've been seated quickly and service has been good, even when in a big group.\n\nBeing located near Donlands, The Works is easily walkable from the Danforth\/Greenwood area or Greektown. Highly recommended for nights when you just feel like a great burger and appetizers!","useful":0,"funny":0,"cool":0},
{"review_id":"fzJwe9wtdrkMCVX5IfssVQ","user_id":"V4YikatszGV5nYAEGf5edw","business_id":"htLs5a7fmL0-2hv2dmgV-w","stars":5,"date":"2013-10-07","text":"I moved into East Danforth this past summer, had my first appointment with Dr. Petrou last week. His office is small, with just a tiny sign outside. But that doesn't matter, what matters for an optometrist, at least for me, is (a) competence, and (b) friendliness. Dr. Petrou had both.\n\nIt was just a simple eye exam, but he was patient and explained to me what was going on with my eyes (I got 0.5 dioptres worse over the last year, which has me very concerned), explained what I can do to slow the degeneration, and discussed my glasses, contacts, and the possibility of laser eye surgery. (Not an option: they want to see stability for 2 years before considering it, so that you don't get the laser surgery only to need glasses again in a year.) Anyway, we discussed my options and then he re-ordered my contacts for me; same brand as I was already using, so that was nice.\n\nHis secretary showed up late so when I got there for my morning appointment, he was answering the phone (in Greek!) and scheduling appointments himself. He seemed to accept this with a sort of patient resignation; I get the feeling it wasn't the first time it had happened.\n\nAnyway, this is not a flashy office, and most of the patients seem to be older, but I would highly recommend giving Dr. Petrou a call.","useful":8,"funny":0,"cool":0},
{"review_id":"M5OJsuyUuyACpv0N1KNGoA","user_id":"aJyNPvjjqyE1_6ozDqnCcQ","business_id":"i5vxtyiHKYnRcJ0p9N7mLw","stars":5,"date":"2016-04-18","text":"The food, service, and staff at the Gourmet Deli are all authentic and excellent.  On the wall they have written their full menu on the black board; it is a mix of New York Deli, Southern European cuisine and Italian restaurant.  All of the specialties are created by Carlo, or Emilie and reveal their Italian & French heritage.  \nI have been for lunch many times and have enjoyed ordering my favorites that remind me of the New York Deli's I grew up on.  Most recently I have been just ordering the special of the day; today was a French lentil soup created by Emilie and it was wonderful.\nThe service is very fast, especially considering every dish is created to order.  Over time they have been busier and they seem to have increased their staff to keep up their service level.","useful":0,"funny":0,"cool":1},
{"review_id":"6B2ysMkgzibLvgQqmKTc1Q","user_id":"aJyNPvjjqyE1_6ozDqnCcQ","business_id":"FXPywtnz2Tt_ko03dqxLBQ","stars":5,"date":"2010-09-23","text":"Nathan and his company seem very trust worthy and responsive.  They were able to replace a battery and fit in a few scheduled maintenance issues without an appointment.  What was impressive is watching them work with several  customers while I waited; they are very focused on their reputation and long term relationship with customers, not a one time money grab.  I will work with them again, I hope my next experience is the same.","useful":2,"funny":0,"cool":2},
{"review_id":"ci-9ZSsBTYG5mjDhUsxSTQ","user_id":"aJyNPvjjqyE1_6ozDqnCcQ","business_id":"-WExTQDca_JdeWd1BjlOTw","stars":1,"date":"2011-02-14","text":"I am sad to report poor experiences with the service department of  Chapman BMW.  Before their move to the new facility in Chandler they performed well for me but now they seem very comfortable and boarding on arrogance with the limited choices available to BMW owners.  What is most disturbing about their attitude was a lack of interest in determining a solution to the problem of a safety critical component of the car.  They spent all of their time attempting to limit or eliminate their responsibility.  Babbitt is an excellent alternative to Chapman BMW and I have given up on the dealer.","useful":4,"funny":0,"cool":0},
{"review_id":"Hs8FoVKJI3J6RUQORF8bxA","user_id":"rIGp-LgZOz45tf0Z8j0SWg","business_id":"LrgxalxieY0oRXHouWw8Sg","stars":5,"date":"2015-05-15","text":"Motorcycles of Charlotte is a fantastic store for enthusiastic motorcycle riders. The staff is very knowledgeable and helps in every matter. For Triumph riders it is a pleasure to spend money there, because you get a great customer service and help after the purchase. The part department is a great help too and could answer all of my countless questions regarding accessories for my Street Triple. The service department does a great job of taking care of the bike. If you want to finance the bike, the business and sales team gives you excellent advise. Allover, fantastic store, fantastic European bikes, fantastic customer experience. \n\nLast but not least, ask for an insurance quote at the store. It doesn't cost anything, but could you save a lot of money. In my case over $600 per year.","useful":2,"funny":0,"cool":0},
{"review_id":"RhKePCg4lIbMEvRUylcfGg","user_id":"h6pN2W14MU2WjzAOA3e3Jw","business_id":"ZMx9_sQydPUj5KGvcm73Sw","stars":1,"date":"2015-09-20","text":"My husband and I waited until after 10pm to come here because it was busy for a private event! I had my eyes set on the short ribs which is basically roast!!!!!! Yes roast! Enough said not impressed not happy and being we came up from Syracuse we obviously will never return! $70 bill and it wasn't good at all!!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"KE55tjBRMwR_wxt9qdC77g","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"YVt-Da2CplTzqLKu8JFD9A","stars":5,"date":"2017-01-23","text":"I highly recommend the trolley pub! Vincent, our pilot, was a wonderful guide. We had such a fun time and it was the absolute perfect thing to do for a night on the town with friends. We did the Uptown tour, but the Noda tour sounds awesome too. It was raining for a lot of the trip yet we still managed to have a ton of fun, drink plenty of beers, and jam out with the speaker Vincent provided.","useful":0,"funny":0,"cool":0},
{"review_id":"7oYhUM1To8hOzqI2Att7uQ","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"dztcNrIVDg6D-6sFOOofDA","stars":5,"date":"2017-01-14","text":"Two words: cheddar biscuit. If you're a fan of biscuits and cheese, and who isn't, this spot is a must try for breakfast or brunch. I get the #3 egg, cheddar, and avocado on a cheddar biscuit and it may be one my favorite breakfast sandwiches of all time. I think many others tend to agree as Saturday mornings at the Dilworth Sunflower location are busy. The space is on the smaller side, so plan on feeling a bit crammed, and possibly waiting a bit for seating and\/or your food. To-go orders are always an option. It's worked out fine each Saturday that I've gone and I've definitely left happy with a full tummy. \n\nThough I haven't tried their pastries and desserts, they look amazing. Sunflower even has a number of vegan desserts, you're into that kinda thing. They do have a full coffee and tea bar. The green tea latte is delicious!","useful":1,"funny":1,"cool":0},
{"review_id":"faxfc3KI4lsmYxAJaFifkw","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"VeFqptSzekFAc3FZOpi81Q","stars":2,"date":"2017-01-23","text":"I must say that I'm disappointed with Alexander Michael's. For the most part, each time I've dined there I've enjoyed the food. I'm a huge fan of the veggie burger and fries, and the prices are reasonable. The space is great, and I adore the 4th Ward neighborhood. In fact, I live there. \n\nThat said, I've been consistently underwhelmed with the quality of service that Al Mike's delivers to its patrons. On a couple of occasions I've felt as though the server did not really care much about my dining experience. As an example, recently I went with a friend who explained to the server that she was gluten intolerant and order the GF pasta. Despite that, her pasta came with two slices of bread on top. To me, that seems like something that should have been considered, and if it was an honest mistake, that would have been ok. However, the server acted as though it was preposterous that she asked for another plate. She was extremely disrespectful despite the fact that my party was respectful towards her. I really want to like and enjoy this spot and I think the food is great, but the experience of eating out is 100 percent framed by your service and on a couple of occasions it's been subpar to horrible at Al Mike's.","useful":3,"funny":0,"cool":0},
{"review_id":"TnlIKGL7Bje4eduO-xuXAw","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"-UV2tt3gy57-5a29paA_4w","stars":5,"date":"2016-11-13","text":"Great local, family owned sandwich shop. Food is good, and prices are very reasonable. Also, they have a great vegetarian sub, which is uncommon for sandwich shops. Definitely a 4th Ward must try.","useful":0,"funny":0,"cool":0},
{"review_id":"gqmTwAsGcXGDBhMmKYTAFA","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"buacGSEw8yLGJo8g-i02wg","stars":4,"date":"2016-12-21","text":"The $10 all you can eat lunch special was on point. There are probably 20 or more rolls to pick from, including tempura rolls, a philly roll, and a couple vegetarian rolls. It great that you can also get small orders of noodles and alike. The service was quick, and we didn't do much waiting for food despite putting in 4 rounds of orders. I'd highly recommend the lunch special! The space was cool and interesting as well.","useful":0,"funny":0,"cool":0},
{"review_id":"PyAlscB4Z4UdQyUdX1JqIg","user_id":"ADILa64OS8zottDZxpWpQg","business_id":"Uftnd7njdHNFxhz_6rpUrA","stars":4,"date":"2017-03-01","text":"Sea Level is one of my favorite new restaurants in Charlotte. I've been in a couple of times with my boyfriend and so far we've tried the shrimp po-boy, catfish reuben, lobster roll, and $1 Sea level oysters. Everything was delicious, but the catfish reuben was the real stand out dish. The sandwiches all come with french fries, which are really tasty. The lobster roll could use a little more butter drizzled on top, but that's my only critique of the food so far. \n\nWhat I really love about Sea Level is that it seems to strike a great balance of semi-fine dining, while also being casual, if that's what your mood is. To that end, there's a big patio, and a good bit of bar seating, so even on a busy weekend evening, you may be able to be seated without a reservation at one of the aforementioned locations. Additionally, the service is fabulous. The servers are very professional - They know their stuff and they ensure patrons have a great dining experience. Finally, I love that there are cheaper options (i.e. $2 beer, $5 house wines, ~$12 sandwiches, and $1 oysters), and there are plenty of high quality, more expensive options as well. You really can achieve whatever dining experience you are looking for at Sea Level, whether is be a nice date, casual happy hour drinks and oysters, or somewhere in between!","useful":0,"funny":0,"cool":0},
{"review_id":"Nje1i5hRu8kUOxsAhzy5pA","user_id":"1hrFWpaN6CgP04tJT3Dmxw","business_id":"jrtt21Q_ehzfrdeaC2J5nw","stars":5,"date":"2012-04-17","text":"I grew up in Little Italy amongst the best Nona's in the country and had an unforgettable memory of what good Italian was supposed to taste like.  Short of going to a top Italian restaurant, this is it ... Real Italian flavor with top quality ingredients.  You can purchase frozen entrees, appetizers, and side dishes as well as fresh pasta and sauces.  If you zip home before the family or guests arrive and put it in your own cookware for heating, the house will smell amazing and they'll think you are a professional cook.  The store is owned and operated by family and a lot of love goes into everything they make.  The fresh pasta is what separates their products from the rest...it is outstanding.  Unlike the reviewer who rated it a three without tasting the products, I have sampled most products and they have all been excellent.  Anyone I've sent there (many), have been equally impressed.  Give them a try and say Janice sent you.  Whether I am doing my own Italian cooking or just want it done for me, I always start with at least their pasta.  Enjoy!","useful":5,"funny":1,"cool":0},
{"review_id":"Yhl8ZZxBQtPGJDFjs6-3Bg","user_id":"g1_80rT8aDqGGk2Eh-ylDQ","business_id":"MQkAWkWf3sPCSjo4HeSOaw","stars":5,"date":"2016-11-21","text":"I am proud to work for wholesome market for local food heroes we proudly support local foods and we are proud to serve our community.","useful":0,"funny":0,"cool":0},
{"review_id":"h5nuCLXoEha8nTJcLavsCw","user_id":"NFLIu5vFeGUgMBDFseyt1A","business_id":"d9wSnfW2kaJR-_auyK9G4A","stars":5,"date":"2016-05-13","text":"I thought the price was steep but within 15min Of entering I was SO pleased. It was so beautiful and the collections were amazing. I loved the videos too...I cried watching \"Home\" - a must if in town!","useful":0,"funny":0,"cool":0},
{"review_id":"Kx4b9YcuF-QXPwhPOCpGSg","user_id":"NFLIu5vFeGUgMBDFseyt1A","business_id":"-FLnsWAa4AGEW4NgE8Fqew","stars":4,"date":"2016-05-13","text":"Nice little brunch spot and it happens to be the name of my favorite movie so we had to stop. I got \"the bird\". It was good, I had the hash browns instead of the potatoes with peppers and onions - glad I made the switch. It was hearty and flavorful!","useful":0,"funny":0,"cool":0},
{"review_id":"9rDSuKrwaEv-RK2X3kuQ0A","user_id":"NKcj9goowaXSCPVIjff6Cw","business_id":"JDZ6_yycNQFTpUZzLIKHUg","stars":5,"date":"2015-09-26","text":"First time here tonight! My husband & I took a trip to Las Vegas & I yelped near by restaurants that were open late & El Dorado Cantina pops up. I have to say this place is phenomenal! From the nice ambiance, nice servers to the amazing Street Tacos, let's not forget the flan! It's a MUST have. I'm a Latina & I know what flan is supposed to taste like, and this was AMAZING!! Chef Paco was very sweet & took the time to introduce himself to us. I will definitely be coming back before I head back to the OC.","useful":0,"funny":0,"cool":0},
{"review_id":"NBE4AWwlxVd6VBIW0cYltw","user_id":"B5kdtmwb4xi6IZsE6GA_6g","business_id":"1DP5vHxJzCDbgawv0WC3yA","stars":5,"date":"2014-03-10","text":"Amazing doesnt even describe this show. Very entertaining. Interactive.  Pricey drinks though.","useful":0,"funny":0,"cool":0},
{"review_id":"ziE300ueXQ9bOYamFBkSow","user_id":"B5kdtmwb4xi6IZsE6GA_6g","business_id":"uGlxpR3HAyqBsOf1HTvkvQ","stars":4,"date":"2012-11-08","text":"I was asked to make cake pops for a baby shower and without thinking about how busy I was agreed of course. While I was stressing about how I would find the time to make the cake pops the living social deal came across my email. I figured it was fate:) I purchased the 2 dozen cake pops for $25 deal and then scheduled my order the next\nDay. I wasnt picky,  just requested whatever colors and flavors I could get for the deal and not have to pay anything extra.  I went yesterday after work to pick up the pops and was thoroughly impressed with the end results! Not only were the cake pops ready when I arrived, but they were absolutely darling! Definitely above and beyond what I expected for my $25 deal. I couldnt resist trying one (the shower is tonight) and as I thought they taste amazing as well. Well done Michelle! I am surprised there arent more positive comments on here. I feel like everyone always takes the time to leave negative comments but its also important to remember to leave the positive ones. Give this new business a try!!","useful":2,"funny":0,"cool":1},
{"review_id":"U4koFr5AnAcqhWwL9o6dtQ","user_id":"V-UUb52j7XDgwDnqcMDZQQ","business_id":"182GDGXSdT5AFKYfsXG9Jw","stars":5,"date":"2015-05-09","text":"Great place! Live entertainment, wonderful customer service, outside seating, & the food and wine menu-superb. First time here, & will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"javprIz_GImjja5Ae1anDA","user_id":"V-UUb52j7XDgwDnqcMDZQQ","business_id":"-iE-wYKjSzNKp_9Q9G3W4w","stars":4,"date":"2015-05-09","text":"Food was Great!!!! The hubby was a little wary of the strip mall environment & the clientele is definitely \"of the local assortment\"-very nice & family- oriented. No alcohol served, but we planned to go out later for drinks. Seafood was good...service, efficient & friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"IobIRp1mGJiLg4B6wHAvqQ","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"P4Plzlfm4uJjNmH3wY4W1Q","stars":2,"date":"2014-01-14","text":"While I will continue to eat at this establishment, I will only do so because it is the closet Chicago food place near my work, otherwise I would completely avoid this place due to its outrageous pricing. There are better tasting and cheaper options all over the valley.","useful":2,"funny":0,"cool":0},
{"review_id":"Ja0eOVPqdWzpOJj70fHasg","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"WU4wM-uD1INThG6F3sGzCQ","stars":5,"date":"2014-01-14","text":"This has been one of the best hotel experiences I have had. Door staff is incredibly friendly, as is the front desk staff. Rooms are essentially new and are incredibly well decorated (wish my house looked this nice). While I didn't get an opportunity to eat at the Blue Hound, I did have drinks there and it was definitely a nice environment. Will be back in Phoenix this January and I will definitely be staying here again.","useful":1,"funny":0,"cool":0}]