[{"review_id":"m8G2oTZcjSwHNuDHL7DCmA","user_id":"kBbgwZCiwv9QRajqcqkG3g","business_id":"lu-94OWHJBV0MZET7KVNpA","stars":1,"date":"2015-10-16","text":"This is the worst Apartment Complex EVER!  I've submitted 5 complaints due the noise from my upstairs neighbor, including the Las Vegas Metro Police.  The last one was for my neighbor hammering nails in the wall at 2 am!  It's impossible to even have people over because of the constant arguing and noise at all times of the night.  Management has not even responded to the last 2 emails sent.  They are worthless!  Overpriced!  Too Loud!","useful":4,"funny":0,"cool":1},
{"review_id":"wN90Q9vARvZlGqyldkUHFg","user_id":"QDCo08V0Yx97-k6UjlCbIg","business_id":"H9EMCNAdGt1vJ_DZAcrosw","stars":1,"date":"2017-06-03","text":"After you've been a member for a while they will charge you $70 for transferring your own hard-earned money!!! They'll charge you for not sufficient funds when the funds are really there!! This is the most horrible, dishonest, uncaring, greedy bank ever !!I believe what they're doing is illegal. Now to make it even worse... I closed my checking account so they can stop robbing me blind and magically my account has now reopened without my permission??? How is that even legal? Do not use this Bank unless you want to be treated like a number, treated unfairly and robbed right before your eyes!!!","useful":0,"funny":0,"cool":0},
{"review_id":"A5VHAqagDqjjBVlr41PUYw","user_id":"peFxHFeltAmJXazI4jwEHw","business_id":"CnzzfFzVB4us-NHY-NhmsA","stars":5,"date":"2016-04-16","text":"Great tasting food with attentive and knowledgable service. Family dinner with our 11-year old was a pleasure.","useful":0,"funny":0,"cool":0},
{"review_id":"_Qi3ssF3VD2MH56PuZYjUw","user_id":"LYaU8vdhEN0wUBW42SMSfg","business_id":"vfjPOe9bzErPTq3OLMXLfg","stars":2,"date":"2016-12-27","text":"I was not satisfied with the food or service. We ordered a lot of things and only a few came. A lot greyed out on the iPad but the food never came. At the end, we were told some of the food were sold out. But they should let us know in the first place in stead of letting us wait and wait.....the sashimi is not that fresh....","useful":0,"funny":0,"cool":0},
{"review_id":"f9LnvxppTOuw5uf2mZnB9g","user_id":"LYaU8vdhEN0wUBW42SMSfg","business_id":"XJ3LI67qsJq08m3i7Y_yfQ","stars":1,"date":"2016-10-30","text":"This place is horrible! The vet is so careless and not good at all.\nIt makes you feel that the doctor only cares about your money, not your pet.  A few weeks ago,  I brought my cat in, she recommended to go through all kinds of unnecessary expensive tests. When it really comes to some issues, she had no ideas what should be done. She did some physical check on my cat without finding out any wound or  real reason causing the problem. Then My mom went back home and found some wounds. (My mom has no medical knowledge at all) We went back and forth a couple times without actually fixing my cat's issues.  SO If you really care about your pet, DO NOT go to this hospital.","useful":1,"funny":0,"cool":0},
{"review_id":"71pn8B4rwCaCbAQ2FgS3XQ","user_id":"1R3U576EWEc6WIOu_gcUlg","business_id":"DESv2ys6SjBKA4SyDtJvxw","stars":5,"date":"2014-03-17","text":"My wife and I love Ferraro's. The food is excellent and everyone makes us feel like family. For locals there is a 25% discount. The staff is extremely knowledgable, especially Paolo, and the wine selection is fantastic. Our favorite salad is the Cappucina Gorgonzola. We recommend it to everyone.","useful":0,"funny":0,"cool":0},
{"review_id":"jVfuHl5K--F8foCnayHg9w","user_id":"1idtVhG5SR7Yoj4nlWUXzQ","business_id":"-nCIWJk0QSi3L5__YGWseA","stars":5,"date":"2017-08-26","text":"Stayed here 4 nights by myself, visiting from Philadelphia. Had a great time in Montreal. The staff were super friendly and recommended some excellent bars and restaurants. They have two bikes that you can ride around the town. The complimentary breakfast was tasty. I packed some extra croissants for my hike to Mont Royal. The bathroom soaps smell wonderful (Le Labo). The location is also quite beautiful. Also, they have complimentary quality coffee available 24\/7. Highly recommend. Merci!","useful":0,"funny":0,"cool":0},
{"review_id":"KCSQQEEZizWXCawFObxpMA","user_id":"RAvQGeeUfhYjgBJKNNStxg","business_id":"I9Rw9CSZPNKvIYG0gOHOjw","stars":5,"date":"2017-10-23","text":"Plenty of outlets and friendly baristas. Good light, WiFi, nice place to setup with a laptop for a bit.","useful":0,"funny":0,"cool":0},
{"review_id":"Gd9BdWc1Ze3jxw5MULhb5w","user_id":"RAvQGeeUfhYjgBJKNNStxg","business_id":"dusNIzdCaH6EoLl2hRy6cQ","stars":4,"date":"2014-11-03","text":"It's open. It's chipotle. A little on the small side but there's extra seating in the mall.","useful":0,"funny":0,"cool":0},
{"review_id":"I9rkhX-bObJUekVMpWKfRA","user_id":"RAvQGeeUfhYjgBJKNNStxg","business_id":"kwtWpiGGlq9B9MeiZmed_w","stars":5,"date":"2017-10-31","text":"Great place to get some work done on a laptop. Baristas are friendly, the store gets lots of light, the wifi is strong and the music good. The community tables also have access to outlets.","useful":0,"funny":0,"cool":0},
{"review_id":"VksliFnDImzAS8XKgCRivA","user_id":"D-_Cq7IQWcoGCkbpXiOniw","business_id":"0lz6c4BSzgmURYsGBcb7AA","stars":5,"date":"2016-08-17","text":"Justin (and Scott) were about as good as it gets.  They were very professional and genuinely concerned with \"our stuff\".  We had them load our POD, and importantly, they were both good listeners as well.  I would highly recommend them!","useful":0,"funny":0,"cool":1},
{"review_id":"Yc3K4zu2BQdT-w0EyXf_vg","user_id":"D-_Cq7IQWcoGCkbpXiOniw","business_id":"lx-xmhETRiz-PV1Pkrf-Cg","stars":5,"date":"2015-02-28","text":"Outstanding customer service!  Working with Ray Albright made us appreciate that all appliance stores are NOT the same.  Not only did Ray provide us with the best price, but he remembered us several weeks later when we came in to purchase the refrigerator.  We also made a mistake in the purchasing process and when we contacted him after the fact - he quickly took care of it and everything was the way we wanted.  I rarely fill these things out, but this guy and this store deserve it!","useful":1,"funny":1,"cool":0},
{"review_id":"sfWS9LkHaw-GE_lUmeSR-g","user_id":"BfsRmHPkVEuAWOTIUToahQ","business_id":"LAFt8MYPG1aJeloOuOt-Pg","stars":2,"date":"2016-09-25","text":"As a 20 year visitor to HInkle's, and probably the largest Hinkle's memorabilia owner on the West Coast I was let down last time we went in Sept 2016. \n\nThe reason why...Price almost doubled, and the service and quality is noticeably worse. The new buns or way they cook the buns is so far off what it used to be. And these burgers are tiny, why are they more than a regular sized McDonalds Cheeseburger. A normal guy, i used to get 4. On a late night after the bars, most of my buddies and i would get 6. Not any more. So the burgers aren't as great, again somethings different about the bun, and the Price almost doubled....oh and the service. The wait staff didn't have that many tables, and its small in there, so its not like you could have more than 4 tables per person. Slow service, and even if there was a waitress next to you and you wanted to pay or wanted help, good luck getting their attention. \n\nReally let down. Hopefully something changes.","useful":2,"funny":0,"cool":0},
{"review_id":"pPrNA6O1hj5nt636TKdFyQ","user_id":"WZSDxM-JLZ9ugkmWxW2iqA","business_id":"yMeyFt8ktPvzN0qFYLljMw","stars":5,"date":"2016-10-06","text":"Bought a used car from dealership with a door ding on drivers door. The dealership contacted Dent Guys to repair. They came out the next morning to the dealership and did an EXCEPTIONAL repair on the door. They did not have to drill into the car at all, and were able to go through between the window glass and door panel and massage the dent out. Then he used some products to buff out the scratch in the clear coat. The results were INCREDIBLE! My father in law has also used this company to repair a door ding in his show car and was also EXTREMELY HAPPY with the customer service and result. If you have a dent PLEASE CALL DENT GUYS!!!","useful":0,"funny":0,"cool":0},
{"review_id":"32tFB4KKlcEZz9Umn_4j-Q","user_id":"Dl9blCGNvrwxf2eSedHtuw","business_id":"FDJMmucEYffBLU_JeNHMPQ","stars":5,"date":"2017-10-02","text":"Been taking my dogs here for years. Heather has been my primary groomer. I think they do a swell job.","useful":2,"funny":0,"cool":2},
{"review_id":"3HA-AWIpK7hElz-e57FSyg","user_id":"Dl9blCGNvrwxf2eSedHtuw","business_id":"pY3eeeZezb9cgCK2B8Q0mQ","stars":5,"date":"2017-07-14","text":"Had my house's breaker panel catastrophically fail on a Tuesday morning. On Time was at my house that day and promised to at least have my AC and some lighting on before they left. They stayed until 4 AM to keep that promise. They finished the project on Thursday and the work product is beautiful. Newman Barrett was the electrician and Tyquan Johnson his apprentice. Would I recommend these guys? Heck yes.","useful":0,"funny":0,"cool":0},
{"review_id":"UsxnCrYngsES-eXPjNL3LA","user_id":"0zPnAatuCtSD5e96jTjtJQ","business_id":"yRQFS-UT0Tn5PvNCLeZV9w","stars":1,"date":"2017-06-03","text":"Came here tonight to get my meds... the receptionist along with the security guard were awesome however there were two other customers being serviced I waited patiently browsing the store and when it was finally my turn the guy pretty much blew me off they didn't have what I wanted he then proceeded to start assisting two other people that came in after me as if I weren't there I will never spend another dime with this dispensary teach your sales reps to be more customer service friendly and I will never recommend this place to anyone I know there are plenty of other dispensaries that have great customer service.Needless to say I left without getting anything and went somewhere else","useful":4,"funny":0,"cool":0},
{"review_id":"_sLuueGTHhOVn_vLQJWOpg","user_id":"9E6OHQQNECEe3qSFq5UqHw","business_id":"DwP10iEz5LGf3fhcVQZm0Q","stars":5,"date":"2017-06-02","text":"It's a treat to go back to Sushi Roku in Scottsdale. My favorite sushi place other than Morimoto's in Napa. However, Sushi Roku's service is leagues ahead. I was on a short trip, this time, and made it a point to go twice for dinner this trip. Logan was our server on my first trip and the first dinner of this trip. He is exceptional in his service, manners, and brilliant recommendations. My second dinner was lovely and interactive thanks to Sarah's service. She made dinner a treat by her wonderful tasting suggestions, and her attentiveness to our experience. Great work Dan, GM for making this establishment so amazing! Service is exceptional. Can't wait to return.","useful":0,"funny":0,"cool":0},
{"review_id":"eqdmntjUri00NChteAd-9A","user_id":"GkZ_pwrn5VaAShZC2TcKGQ","business_id":"3Jq5LfJ5fmJ5KmuA6VHmzw","stars":1,"date":"2016-07-27","text":"I have to say the service is terrible. Hot, hot July day and no one around who we could get to give us water or order food. Given that we were prepared to have 6 entrees someone missed out on a good tip.","useful":0,"funny":0,"cool":0},
{"review_id":"ZEE8at4P9xk5sM9zn5REyg","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"iFRvXYRnkMLS_IR8rlmTpQ","stars":5,"date":"2010-07-22","text":"We've used this guy twice and both times have been very impressed. Good service, good prices and just in general a whole non-BS thing going on with this guy when it comes to your money. Seems to have pride in doing a good job and always gives your car a quick wash when everything's done which help to alleviate the pain of paying (admittedly very reasonably priced) for car repairs.","useful":5,"funny":0,"cool":0},
{"review_id":"9HJwNz5UCM-Ac2D-harHLA","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"9fJW6mVIR8wDw2pbhYalPw","stars":5,"date":"2009-06-03","text":"This place is great with friendly staff. I think it was recently remodeled and it is very nice inside. Nice cheap used books with a decent selection.","useful":2,"funny":0,"cool":0},
{"review_id":"f2hrPqZyfEb7_4qb7S1zoQ","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"aSBUYsMgYXh-Spnl-4nBeQ","stars":5,"date":"2009-06-10","text":"I've been a customer of UWCU for almost a year and have been very satisfied with the service. The branches are conviently located and the staff is always super friendly. The website is OK but it often seems to be quite slow to load. My favorite thing about UWCU is that they offer full overdraft protection, if I overdraw my checking account it will deduct from my saving account for free. I guess since they're a credit union and not a normal bank they're not all over screwing you out of your money which was my experience with other banks in the past.","useful":1,"funny":0,"cool":0},
{"review_id":"UzKwbBR1jp4Dn_I-v9JKgg","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"v3AS5LGeV2Si4nOHZ7lgxQ","stars":4,"date":"2009-07-07","text":"Pizza here is most definitely a step up from some other places around, price wise it's a step up too. They have a big selection of \"unique\" pizzas, think Thai food on a pizza, most of which I've found to be a one off thing, but still interesting. I'd rather give this place a 3 1\/2 but perhaps I'm just spoiled, haven't ordered from a different pizza place in probably almost a year.","useful":0,"funny":0,"cool":0},
{"review_id":"PzuJzPK8weerKTv2j1wncQ","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"wlZceADqZ0m9Zw5qM4y3qw","stars":4,"date":"2009-08-07","text":"Nice place, out of the way, this bar seems to clear out pretty early, large selection of drinks. I noticed in the local press that the owner was trying to get some outside seating arranged which the city was blocking due to code issues. However that seems to have been resolved since the last few times I've been past there's been people out in the parking lot sitting at tables.","useful":0,"funny":0,"cool":0},
{"review_id":"wIygKNGH2_Y4H1REa47wxg","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"CQNq2sgLokwOVf4OL-19Hg","stars":3,"date":"2009-06-03","text":"The food here was great but the service was severly lacking. The waitress seemed genuinely annoyed that we were in the restaurant during a slow afternoon. As others have mentioned the prices here seem very reasonable.\nI will most likely come back here again but only for take out.","useful":0,"funny":0,"cool":0},
{"review_id":"WbYvkNXCnQuZ6f7O_976Sg","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"Hr_Bk65xD2yQxjJhhorH1g","stars":5,"date":"2009-07-07","text":"I went here a couple of weeks ago, the zoo was very nice, although the bears didn't seem happy at all, their enclosures were very small and it was 90+ out. Otherwise the zoo was great, free of course, parking wasn't too much trouble but I imagine it could be difficult. The worst exhibit obviously was the one with all the small primates riding the carousel. \nIt's nice to be able to just walk out of the zoo and along the lake.","useful":0,"funny":2,"cool":0},
{"review_id":"l8TX8PBHMsusxDHxR7Oy8w","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"4GZ5-fMT58T4E6Ib2xpRRg","stars":1,"date":"2010-08-16","text":"Used Charter for a couple of years. Just ditched them and I couldn't be happier. Shortly after we first started with Charter our connection went out, took them days to send someone out and it turned out they'd disconnected us for no reason at all. Thanks Charter. Fast forward to the recent past when our bill went up, I called up to try and get a new promotional rate because I'm no paying $60 for internet that bombs out briefly a couple times a day. They said they couldn't do anything better than their listed rate. \nAfter that I decided to downgrade to their lowest speed for the time being in order to save some money. When I called up to do so they transferred me to retentions and magically they offered me a better rate. Turned out they were lying and there was an additional charge on top of that because I wasn't bundling serviced (I have no interest in rotting my brain out watching cable TV or having a phone that I can't take with me in my pocket), when I complained and asked for the original rate the supervisor did not apologize and said the last person I talked to must have assumed I knew about the extra fee. When I told her I wanted the original rate she said there was nothing she could do, what is the point of having a retentions department if the best they can do is what is listed on the website?\nFinally I organized DSL with AT&T which was simple and easy and did not require a visit for installation. I just plugged the DSL modem in and called customer service who guided me through the set up. When I called to cancel with Charter they offered me the original rate but I'm pretty sure it would have been the same thing again. After calling to disconnect I got several calls from Charter trying to get my business back if perhaps they offered me a really good rate but by that point they'd managed to blow whatever shred of credibility they had left in my mind. Since I don't trust their billing practices I had no interest in continuing business with them any longer and am now much happier for it!","useful":5,"funny":0,"cool":0},
{"review_id":"G1j96pkZQMsdt3tw6kRV3Q","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"zi_qqjCzkerE2dT-ViE2JA","stars":4,"date":"2010-07-28","text":"My girlfriend and I recently tried this restaurant. I really enjoyed the converted church thing, especially when we realized the booth we were sitting in has been pews in a former life. The stained glass windows created a fun atmosphere since it's summer and the sun was up while we were eating. The food was also very good, usually I'm not such a big fan of going out for Italian food, I find that it's not \"exotic\" enough for me to bother with when I'm going out to eat. However as I said I was impressed with my meal and the service was also very pleasant, we were seated right away and the server managed to balance checking up on us without being a nuisance.","useful":1,"funny":0,"cool":0},
{"review_id":"9TsDD3GCf3msOipm2t7-Rw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"T83qrR3cwQEAMhHAC8YqIg","stars":1,"date":"2013-12-07","text":"Stopped by to pick up a new pair of walnut Blundstone boots. Was informed that they only come in black and stout(almost black). Proceeded to order said walnut boots off the Internet instead, since they do make them and saved $50. This is why local businesses are going broke, agree with the other reviewer that this shop was boring.","useful":0,"funny":0,"cool":0},
{"review_id":"6yO0K3wfZX5Q6vl5tnmvsg","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"IPZubyVcN1OPwDJ68uqUHQ","stars":4,"date":"2009-06-03","text":"Always nice to come here for lunch. The sandwiches are of course made super fast and the staff is uniformly friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"PfGAEXJrDSA2VGu4NdeBZw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"HNh3jvPAVKeTOwe-NkF3uA","stars":2,"date":"2009-08-23","text":"FAIL, due to the manager trying to post a review on here, at least he was blatant about it. Also now that tanning beds have been officially classified as carcinogenic this place is totally a cancer peddler.","useful":3,"funny":3,"cool":0},
{"review_id":"Z7fzj5OtGiiXMjYoMIxPVQ","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"eJYvivWUp4Hdc9Tc8SaZPA","stars":4,"date":"2009-07-10","text":"Tasty food, decent price, outside seating like many other restaurants on state street. I enjoyed my meal here and my girlfriend absolutely adored hers, service was alright too.","useful":2,"funny":0,"cool":0},
{"review_id":"gf4TqBrUjKhf7dT3AuzgQw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"Trs4cEYdP6AX_KihTk9kWQ","stars":1,"date":"2009-12-12","text":"Went down to try this restaurant. Waited 15 minutes for service in an empty restaurant while the servers were bussing their tables. Finally got service and cold bread, waitress blamed the slow service on it being busy when the place was deserted. We decided to leave and try our luck elsewhere.","useful":2,"funny":0,"cool":0},
{"review_id":"kOLwMuX7VcxjQvgHkxgj9Q","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"imBVeP4aA-aLTdPD-t8_WQ","stars":4,"date":"2009-06-12","text":"This is my go to place for Chinese delivery. Never actually been to the store though, most of the food is pretty standard, however the dumplings are fantastic, they're all I order now.","useful":2,"funny":1,"cool":1},
{"review_id":"KxZHl6NFOM1mCUvlDv75Zw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"CLB0ctwOdLxNuw0MuqkYZA","stars":4,"date":"2009-06-10","text":"Nice well kept new laundry, prices are reasonable and I haven't seen a machine out of order. They have two televisions which can be a little loud at times. Two computer terminals that run linux for web browing and wifi. They also have a play area for children.","useful":3,"funny":0,"cool":0},
{"review_id":"5LVIvPUufFc0wKidS4QweQ","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"3cYkM3UvwzKAiPWNdbUQfg","stars":3,"date":"2009-06-03","text":"The washing machines did a good job of cleaning my clothes, and there's some nice stores in the strip mall to wander round while you're waiting for you laundry. However this place is totally decrepit, with broken arcade games crowded up in the corner. They have no change machine, you need to ask the person at the front desk to make change.","useful":4,"funny":2,"cool":0},
{"review_id":"4ONZTGfj6tUqSgHlNM3IlA","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"6rqDzz92kOzGMndUhkKH2Q","stars":2,"date":"2009-10-20","text":"Wouldn't do an oil change when I came in at 5:10, the guy at the desk said they didn't have time to do it, but they only had one car in the bay. What's the point in advertising a cheap special on oil changes if you won't do it because you close only an hour after people get off work.","useful":0,"funny":0,"cool":0},
{"review_id":"yTW7Yk4jjDb4BsSZ9A6-iw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"p5LmGtCNBI74xmwhSmyo8Q","stars":4,"date":"2011-10-03","text":"I've been here a couple times. Their bubble tea is very tasty, and the patio was a nice place to sit out and enjoy the sun. It would be nice if they stuck a couple more tables out there though.","useful":0,"funny":0,"cool":0},
{"review_id":"wq1b3Uq111xOMfkqEpZWWw","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"OjphXv9ooT4jkuCgX1l-8A","stars":3,"date":"2009-06-03","text":"Overpriced but they do have a good selection of pet food. Use your head if you go to this store and only buy what you can't find elsewhere. We spotted a litter scoop at Target for 1\/4 the price they were selling it here. They did match the price.","useful":1,"funny":0,"cool":0},
{"review_id":"P8f1HF2IfvcbBvCmV1c65w","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"Tk79j0dMuCDF24NhXSeIfg","stars":3,"date":"2010-02-16","text":"I've stopped by here a couple times on the way home to pick up a few things needed for dinner that night. Prices are a little high but not out of line for what you would expect with regards to its location. Selection isn't great, particularly when it comes to produce.","useful":2,"funny":0,"cool":0},
{"review_id":"YY6KRekZpZ3K7YZod0Nm5A","user_id":"cdg3WTchnVZ6DpuDG_InNg","business_id":"CxaNzL8c1itzZ-WhpLo6Ow","stars":4,"date":"2009-08-23","text":"This is definitely smaller than the farmer's market downtown, but that isn't a bad thing, personally I've grown to hate the sluggish crowds down on the square. This is a nice smaller market, prices seemed like they cheaper than what you find downtown too. Plenty of parking of course, since it's in a parking lot.","useful":1,"funny":0,"cool":0},
{"review_id":"GR_Vt_kCKXxZt3oXO5RXOw","user_id":"UqtAVcD3BsAlIiv6vIaY8g","business_id":"ao-k5gZVwkeceTqGsknukQ","stars":5,"date":"2014-01-30","text":"Wow!  Talk about a rare find these days.  An auto repair shop that does not try to intimidate a women when she brings her vehicle in for repair.  One of  my vehicles did not pass an emissions test here in Mesa.  I had no idea what was wrong.  I needed to find an auto repair shop to bring the vehicle too and Shane's was recommended.  I brought the vehicle in and they fixed the problem with my vehicle and even brought it back to emissions testing for me and it passed?  The were extremely reasonable and very helpful,.  If you need any type of auto repair, an oil change or just a question answered, do yourself a favor and call.  You will not be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"733lP0vGoqtpPx5jhPSpwA","user_id":"6HvmzmxWcJEW1nyL79g_ng","business_id":"3Pr7cF5wdndA6xVFgkPtWA","stars":1,"date":"2015-12-05","text":"They installed the WRONG spark plugs in my vehicle, which I later found was the cause of engine knock and a rough idle. The owner is a coward who is unprofessional, belligerent, rude and likes to use bully tactics when he's safe behind a phone. Trust me and the rest of the reviewers here... Save your money, hair and lifespan of your motor by either driving or having it towed to a local dealership or some other reputable auto mechanic who respects and knows your vehicle.","useful":0,"funny":0,"cool":0},
{"review_id":"ITdCpwUQBirWyFYP-rbepA","user_id":"03_OcS8SbBcO4RTx_jYAUw","business_id":"WbJ1LRQdOuYYlRLyTkuuxw","stars":2,"date":"2016-03-26","text":"This was a disappointing first visit to Tupelo Honey of Charlotte. We arrived around 4:45pm on a Saturday...so, not slow but definitely not what I would call busy. We were seated immediately and as far as service is concerned, we had no problems. The food was another story. My husband and I decided to go with the Easter dinner menu (three courses, $25 per person). Our appetizers arrived with our food. Disappointing, but we didn't make a big deal aside from mentioning it to our server (her response was, \"I don't know what the kitchen was doing.\") Unfortunately, I think our apps were the best part of the meal (goat cheese medallion and fit to be tied pickled & fried). I had the southern steak frites...completely flavorless and also cold. The potato cracklins were the star of the dish which is sad. My husband had the porterhouse pork chop, which he said was \"just ok.\" Dessert was also just ok. I left feeling like I should have gone to Cracker Barrel where I could've had mediocre food and biscuits for half the price (no offense to CB). There are so many great restaurants in Charlotte, I doubt we will be back to waste our time and money here.","useful":0,"funny":0,"cool":0},
{"review_id":"WjyA5-Z2ZqTnEk014uzFsQ","user_id":"ybwKgOck8piKqnwGg36_BQ","business_id":"hvjgF-vnPw2jyL5DBuB0qg","stars":2,"date":"2014-06-01","text":"Myself and a friend were visiting the area from The United States.  We have a friend in Montreal who was able to get us a reservation at this restaurant.  We were very excited to be able to eat here during our trip.  We had an 830 reservation and we walked from our hotel not that far away.  We arrived about 20 minutes early and we were told we could sit and have a drink at the bar.  When we approached the bar to sit the bartender asked if we had \"permission\" to sit at the bar, which i thought was kind of strange.  After informing him that we did have \"permission\", he asked us what we would like to drink.  Two of us ordered a Pinot Noir and one ordered a mixed drink.  We sat chatting until our table was ready.  The waitress was very nice but must have been very busy that evening because she was slow coming to the table.  We ordered another round of drinks.  When she came back she poured a different wine and we told her we had the Pinot Noir.  She came back to the table and told us that they didn't have any Pinot Noir that evening and wasn't sure which wine the bartender had given us. They finally figured it out and it wasn't what we had even asked for originally.  We decided to just have the original wine and let it slide being we were so excited to be there.  We ordered the Lobster Poutin to start and also placed our dinner orders.  We were served bread thankfully because it took forever to get the Poutin which the three of us ate in no time because the portion (and we ordered the meal size) was quite small.  We had to cut the lobster pieces on top so that the three of us would at least get some lobster.  We sat talking and waiting for dinner for a very long time.  Finally the food came out and we started to eat.  The waitress then came over and kept trying to clear dishes while we were eating.  We finished up dinner and were waiting for the waitress to come back to give us the desert menu but that didn't happen.  A male came over and put a small piece of cheesecake down and said this is on the house and could we please hurry because they needed our table!!! Are they kidding me.  It was not our fault that they took so long serving us dinner but now they didn't offer us a desert menu or coffee and they throw our one small desert for 3 people and ask us to hurry so they can have the table.  We paid the overpriced bill and left and got our coffee elsewhere.  Not happy was an understatement.  Overpriced, small portions, slow service (until they need your table), never offered a dessert and coffee menu.... We ate at much better restaurants during our week long trip...","useful":1,"funny":0,"cool":0},
{"review_id":"pc6f3XwZWgHRM9edfLZq4A","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"oX7lSVsg4j7-SrSZVGWVnA","stars":2,"date":"2015-04-02","text":"My daughter and I decided to try Babbo for lunch today based on reviews and friends recommendations.  The hostess was less than friendly when we asked about being seated at a booth.  The waitress was nice and took our order quickly. My daughter order a pasta dish and I ordered a pizza.  It took forever for our food.  My pizza was not even warm. I did not want to complain since my daughter treated me to lunch.  \n\nI think Babbo has been the only upscale Italian eatery in the area for some time.  We recently visited Pomo Pizzaria down the street and it was soooooo much better.  I would not return based on the service, wait time and of course the food.","useful":3,"funny":1,"cool":2},
{"review_id":"RTki4b47Jz6bheBkkZF4Bw","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"vwyIJCuXDB58p2PsHB7LSg","stars":5,"date":"2011-02-27","text":"I have been doing training with Seth for about 2 months. I am very pleased with his level of caring and expertise.  Not only am I training, but my entire family has begun training with him.  We are making great progress and I am so pleased that we are doing this together.  He works you hard but is very encouraging.  I would recommend Seth to anyone who wants to get healthy.  He definitely gets results in a positive way!","useful":3,"funny":0,"cool":0},
{"review_id":"XnGpUEZLnonmwbqLzyIk8g","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"YAODkC2s68TbF_kB9rFmMQ","stars":5,"date":"2016-03-01","text":"We recently purchased a vehicle from Geoff Williams. He was professional, knowledgeable and extremely helpful. I appreciated his willingness to let us think about our purchase. We had been to other dealers who pressured us to buy immediately. We are very happy with our vehicle and with our salesperson.  If you are looking for a new or used car, call Geoff.  We highly recommend him and Chapman.","useful":1,"funny":0,"cool":0},
{"review_id":"caMUQwRLjTDwSVX0iE2vlQ","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"kxZAnsPao8c3JDqiR0v2ew","stars":1,"date":"2013-11-16","text":"I am just ordering while an employee who walked in ahead of me has left with her drink. It's always nice to know the customer comes first?","useful":0,"funny":0,"cool":0},
{"review_id":"qqTfNH-aFw_B7OBeURYBVQ","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"9okONcnxTKDGnlaWFpUiWg","stars":5,"date":"2014-07-08","text":"I recently took my car to National for a check engine light issue.  I was on a tight timeline due to the fact that I needed to pass emissions and register my vehicle.  They replaced my computer and took my vehicle through emissions to guarantee that there were no issues.  I am thrilled that they completed my work on time and for a great price.  I will definitely return again.","useful":5,"funny":0,"cool":1},
{"review_id":"Rb50VhwJ3hkKbdLqOnON8w","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"lHgr2wxDiOcEt3n40BcKmg","stars":5,"date":"2013-07-05","text":"Fantastic bakery!! We have gotten macaroons here so many times and they are always delicious.  The chocolate is to die for.  Where ever you are this is well worth your drive.","useful":2,"funny":0,"cool":1},
{"review_id":"6xO8HzOus_NAekdWeIXdcw","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"67X6JB3kvZ2B_p8pucgNXA","stars":5,"date":"2014-02-10","text":"We just returned from a great meal at Kona Grill. The macadamia nut chicken and teriyaki ribeye were perfect.  From the moment we walked in the door we had outstanding service from Trevor and Bud.  We could not have asked for a better experience. Thanks for a great evening.  We will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"y73cloPPyo4eLIwRSNAq8Q","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"zidkKI_N1OPxsiddTOQH_Q","stars":5,"date":"2015-02-18","text":"Probably the best pulled pork sandwich...ever!! Great family run business with delicious food. We liked it so much I bought brisket and pork to take home to my husband.  This is definitely a keeper.","useful":1,"funny":0,"cool":0},
{"review_id":"wZZWiE7O6_ilJWJfeEBDEQ","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"y5bQlEMCMnYba9I5XRzlzA","stars":5,"date":"2016-04-24","text":"We absolutely love this place. They have the most delicious sandwiches. Their prices are good and portions are huge. This is a family business and they really care about their customers. When we eat there, they always remember us. They make their own roast beef and steak on site. This place is great!","useful":1,"funny":1,"cool":1},
{"review_id":"jbLnHntVcFYACP56n5_KBg","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"cnfYugAYBFKgwDCTAVdViA","stars":2,"date":"2017-05-06","text":"Went here for dinner last night and the hostess was beyond rude. I have NEVER had such a horrible greeting. The service overall was awful. I watched other patrons be ignored even when they were trying to pay their bills. The food is always good, but I will choose a different location next time.","useful":1,"funny":1,"cool":1},
{"review_id":"cTlipCHl0rzfH20xH_kdcQ","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"APXWKd1N-COyUdncd_FdyQ","stars":4,"date":"2013-07-21","text":"Just finished a delicious meal of pulled pork, brisket and ribs.  The meat was incredible and everything smelled so good.  I wanted to pull my car over and eat it all.  I would definitely come here again.","useful":3,"funny":0,"cool":0},
{"review_id":"txvgzKH3Y3evSre9uz6Ugw","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"2skQeu3C36VCiB653MIfrw","stars":5,"date":"2014-12-22","text":"We came here for my birthday and had a fantastic time. The service was top notch and the food was delicious. We had a bacon board which was amazing.  There were five of us and we were able to try several menu items. We had pulled pork, turkey, and prime rib along with our appetizer. The food was really delicious and tasty. We will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"yR_xA7X7O8YoXpHXmtIFXA","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"L2p0vO3fsS2LC6hhQo3CzA","stars":4,"date":"2014-06-16","text":"We recently visited Matt's for breakfast. We were seated at the counter and the food came out quickly and was fantastic. However, our waitress was less than stellar.  She gave us our food and ignored us the rest of the time.  The thing that really bothered us was that she and another server were talking about their customers.  Basically, right next to where we were sitting.  How unprofessional can you be?  I loved the food ,but I am not sure if I will return based on the behavior of the servers.","useful":0,"funny":0,"cool":0},
{"review_id":"pTfa4bpdMb4WvKH4bnk-tw","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"iE4yD010nv-Au_N5T9RCjg","stars":5,"date":"2015-05-15","text":"I have taken my pets to this practice for many years. We recently had a concern with our 10 yr old corgi. They diagnosed her and did surgery as well. We tried everything but, she eventually had to be put down. They were so wonderful every step of the way.  I would recommend them to anyone who wants a caring, responsible and reasonably priced vet. They are the best!","useful":7,"funny":0,"cool":0},
{"review_id":"YgiM5L3YexMfzVYg46byzA","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"g0-3y0G4zJMU3hUZYqoopg","stars":5,"date":"2009-07-08","text":"We have used this shop two times, most recently for a minor repair.  They are the best shop I have ever dealt with.  Everything was done on time and in such a professional way.  We have been so happy with them that we would definitely use them again if needed.","useful":2,"funny":0,"cool":0},
{"review_id":"uEpEOkH7qYf68lxswXNfzg","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"rIhu4bA2CmSicOSJmTpGug","stars":5,"date":"2013-09-21","text":"Fantastic bakery with tons of delicious goodies and a wide variety of breads.  Everyone was extremely helpful and knowledgeable.","useful":0,"funny":0,"cool":0},
{"review_id":"rvALgfEC_KTH5tH2G3Ru9g","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"2RsLaIEnNUIzjQyCvPCNWA","stars":3,"date":"2014-12-21","text":"We recently had dinner at Cuff. Drinks were yummy and super delicious.  I ordered a club sandwich which was not great.  My daughter had a chicken Caesar and which was okay.  The prices were a little high as we'll.  I would recommend appetizers and drinks only.  I had high hopes for this place. Hopefully it will improve.","useful":0,"funny":0,"cool":1},
{"review_id":"Gt_vr87A2uqzfUEeWKV7dg","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"LJ6F0Vyias0EpuXAqGcA0Q","stars":5,"date":"2010-03-18","text":"I took my teenage daughter for a haircut today at Hair Pollution.  She is thrilled with her cut and could not have been happier.  WayCool aka Hair Pollution is an awesome shop.  We researched other salons before choosing this one and I am so glad we went there.  So many salons are about promoting themselves and who and what they know.  This salon is about getting the job done without all the fluff.  Chris did an amazing job and took a ton of time perfecting her cut.  The salon has a cool artsy vibe that doesn't usually exist in Phoenix.  We will definitely return again in the future.","useful":1,"funny":0,"cool":0},
{"review_id":"s4Vi9kKjZDWMxTn2D50X7g","user_id":"xJVgRZuKNRSmvIlub51YaQ","business_id":"3TnNC-AMuQ4upCtcgtU49w","stars":4,"date":"2011-03-26","text":"We came here after enjoying a delicious pulled pork sandwich at taste of Glendale.  Unfortunately, they were out of the pulled pork:(  We decided on a chicken sandwich and Sonoran dog along with some onion rings.  The onion rings were delicious!! The hot dog and the chicken sandwich had a great flavor.  The only issue was that the chicken was somewhat dry.  The wifi did not work and no one knew anything about it. Overall it had a nice ambience and we would definitely come again. Maybe next time we will get to have the pulled pork sandwich.","useful":1,"funny":0,"cool":0},
{"review_id":"InWkySdjEihVy04PzetiiQ","user_id":"8x0eQSBdbxg6Eb7jwLBRSg","business_id":"6PCofNYsEn0QVjxss4YsFw","stars":5,"date":"2013-02-09","text":"I got a tattoo from their apprentice for only $30. She spent overall an hour doing it and it came out great. I'm very satisfied and tipped her also.","useful":1,"funny":0,"cool":1},
{"review_id":"M7LvcOwUghudQQ_SFxLEbA","user_id":"Qoqv2hpzgJd9K4cMi0HWIg","business_id":"-WjzGtp2xV6xHk6TF-J7Nw","stars":1,"date":"2016-02-08","text":"Beware!!\n\nI bought a gown that was 3-5\" too long for me. The sleeves and shoulder needed to be taken in, but it was not my main concern. I wanted the dress hemmed so the inner slip landed on my ankle, with the outer layer resting on the top of my foot. I took it in Monday, asking if it being done by Saturday would be a problem. I was told that it would be close, but no. It would be fine. \n\nI had to go back in on Tuesday so the main seamstress could see what I needed done. After waiting 10 minutes for him to meet me there (he said be there at noon and he was very late), he seemed very mad at me for making him go in. I got the sense he was not interested in this job and definitely not in the customer. He removed all of the pins from the previous day and put in ONE pin on the inner slip. I asked if he needed more and he grumbled no. He would hem both pieces up using the one stitch as a guide. He also pinned the sleeves and shoulder. I showed him the image of the dress several times so he could get a reference of where it needed to fall. \n\nI never got a call back, so 6 hrs before I needed the dress, I called and found out it was done. I tried it on and to my dismay, the bottom was not done. If it was, I could not tell as both slips were still inches on the floor and I could still not walk in it! The 2 workers there were very nice. They tried to figure out what to do. I wound up getting some temporary stitching that pulled the dress up about 4 inches. I overheard them say that since I was so polite and didn't raise my voice, cuss or yell at them, that I should get some form of discount as the dress was not done properly.\n\nThey insisted (I offered many times to pay) I take the dress without paying and they would have the owner call me on Monday to work out a discount. When she called, she sounded very mad about it. It took a few tries to explain why I left the store without paying and then she told me in an extremely stern voice \"You know, you still have to pay.\" Ummm. Yes. I know. I told her the girls were the ones who suggested a discount and she said I just needed to come in and have the guy do the stitching in a permanent way and discuss the dress with him. I don't need the dress again, or to speak to such a rude person again, so no thanks. Then she spent the next few minutes complaining about how her worker isn't going to be happy with her at all as he wont get paid. She also kept saying that he was confused about why there was only one pin (that he put in) in the dress, and that he didn't know or understand what I wanted. I reminded her that she was there when I showed him the pic, gave many explanations of what I wanted. I wasn't sure how long they needed, but Tuesday - Saturday didn't seem like it was an impossible mission. \n\nI've decided, after dealing with this all, that I am going to pay the full price because they care about some very rude employee who didn't do HIS JOB more than the customer who tried to remain polite throughout a thoroughly bad situation. At least the upper part of the dress was okay. Please do not go here!","useful":5,"funny":0,"cool":0},
{"review_id":"2rUZeziwfIEP9WEaqMYjJg","user_id":"Slv0j4bDdaEAloyPp8Txpw","business_id":"rIaO14rf3RQ4H98K9I15-Q","stars":5,"date":"2015-08-22","text":"Excellent shop. I am new to vaping, and both times in this shop the owners and employees took all the time I needed to set me up, answer my questions. No more cigarettes for me thanks to Big Daddy Vape! I look forward to my next visit where my money is well spent. Great prices and great service!","useful":1,"funny":0,"cool":0},
{"review_id":"gUwsD9l7Un6LYgzZsjLXPg","user_id":"sZiPJgvTSd_A36nCYFklYg","business_id":"5CSKKOzL2f50pvi-EIAw1Q","stars":5,"date":"2017-06-02","text":"I love it here. If I need a service request dealt with it's done right away. I appreciate the whole team here.","useful":1,"funny":0,"cool":0},
{"review_id":"tQKe0rWrRMQ7my_P3O_v7Q","user_id":"xn5pHH-L0KHZt4jlWznMtA","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":1,"date":"2011-11-22","text":"I was really excited to try the food at Khao San Road, since I had heard such great things and seen the Yelp ratings. And, the raves about the food are absolutely correct. The food is good (but even still, I've had better Thai). Unfortunately, the owners and the service I received completely ruined my experience. \n\nI was staying at a local hotel, which made reservations for our party (and I heard the concierge make the reservation). When we got to the restaurant, they first couldn't find our reservation; after waiting 10 minutes, they tried to seat the four of us at a table for two in the back corner. There was no way the four of us could fit around this small table. So, the OWNER (note: not just an employee) apologized and offered us a round of drinks on the house to make up for the delay. We were finally seated, but again the owner came over to our table to tell us that we didn't have a reservation and basically called us a liar. We asked him what he would like us to do - we already had appetizers on the table, so he told us to stay (so what was the point of him harassing us again?). \n\nThe bill came and our drinks were not taken off the bill. We called the two co-owners over and they told us we all must have misheard and that had never said anything like that. Blatant lie. He then called us liars and told us we were trying to get out of paying. He then proceeded to charge our credit cards twice, so somehow I now am paying three times what I should have been paying (since those drinks were never taken off). As a customer, I've never been treated so poorly. So, yes, the food is good, but there are equally good \/ better places out there that don't treat their customers so horribly. Do yourself a favor, avoid the crowd and wait, the insults and harassment, and go eat somewhere else.","useful":1,"funny":2,"cool":0},
{"review_id":"t8JXGPwAAsz36E2Cgp17pw","user_id":"YxLwkZ0-9CtaFmoe-nd1Bw","business_id":"v9u0NgjA4iQeKGevFnYSCA","stars":5,"date":"2014-01-14","text":"My girlfriend and I treated ourselves to the 2pm tea and had such a lovely time.  The service was very friendly but is not fast.  The whole experience should be Savored and not rushed so I'd attend with someone you enjoy talking to!  The food was excellent and we tried 5 different teas in total.  We had a crazy time parking due to an event at the hotel but the server was so kind about it and gave us some tea to take home for our \"trouble\".  I thought this was above & beyond and was surprised by the gesture.  I'd recommend it and would love to go again soon!","useful":3,"funny":0,"cool":0},
{"review_id":"vOuVUsSBCDGuHkYeRabsBA","user_id":"YxLwkZ0-9CtaFmoe-nd1Bw","business_id":"orMlHMLyHSldYgzfFTaeoA","stars":5,"date":"2013-03-17","text":"We celebrated our Anniversary here and had a fantastic meal!  The service was attentive and Chef Eddie stopped by several times to make sure we were taken care of.  We had the Lamb stuffed mushrooms, Fetoush Salad and Filet with Rissotto.  All the dishes were amazing and had such great flavors.  Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"WAcVYwFjm_YwXBzQrQnECg","user_id":"YxLwkZ0-9CtaFmoe-nd1Bw","business_id":"xlD0MntJ8B0eP_mZJSpggA","stars":2,"date":"2015-03-08","text":"I wanted a rice, chicken and veggie bowl but the only sauce choice was Teriayki (not my fav).  I ordered anyway.  Then when I was waiting for my food, I read the ingredients on the Teryaki bottle on the counter which has High Fructose Corn Syrup.  Darn it!  When I got my food, it was a good amount of chicken, rice and veggies but the veggies were not seasoned at all and the broccoli seemed past its prime (some florets were yellow). On the plus side, it seemed clean and was pretty fast.  But I'll spend my counter service dollars somewhere else.","useful":1,"funny":1,"cool":1},
{"review_id":"sLBrOnRC56EA85WwAM4gPA","user_id":"DIZFY5eEY_8BxgjVUP_vhQ","business_id":"ms4nFq8B56RHkFViRaAiWQ","stars":5,"date":"2015-10-10","text":"Excellent food!! We're Dutch and know our German food! This is so authentic!! Loved the schnitzel and the Wurst Platte. Furthermore, my daughter has a dairy free diet and they were very flexible about that. That is really very rare,so we would recommend this restaurant to anyone. Guten appetit!!!","useful":0,"funny":0,"cool":0},
{"review_id":"yQR7-LpDd1Q1sf2TZoBNtA","user_id":"E0G6-96thE0_lgUnPQzzRA","business_id":"mD-YvRPnIt0PX25dkqjNEA","stars":5,"date":"2016-12-18","text":"This Supercuts is a great place to get a haircut! Landree and the other stylists are always friendly and professional. They are easy to talk to, they listen to your needs, and they don't use aggressive sales tactics to get you to buy expensive shampoo! I recommend this salon to anyone looking for a good haircut at a reasonable price!","useful":3,"funny":0,"cool":0},
{"review_id":"JZ6tcA2F4dUKsLNEkt3Udw","user_id":"E0CVItehK4CILhWsTuj_6A","business_id":"lUzX5Prr8TfXeWRt94POBg","stars":3,"date":"2015-10-05","text":"It's more like a night club, full of young people. The music is ok, but the drink is horrible.","useful":1,"funny":0,"cool":0},
{"review_id":"azcCFgd1OzeKtJKjdjorrQ","user_id":"nD8RtrDv_cGaAKs-68EVtA","business_id":"o0DwNnvKb9bV14p-5wBXLw","stars":5,"date":"2014-09-01","text":"Amazing work by these people. They arrived early, were very friendly and did amazing work. The quality of the face painting was the best we have ever seen. The balloon blowing can only be described as art in action. The adults at our party were mesmerized by the creation of the balloon figures and the kids were delighted with the results. They made our daughters party one of the most memorable. We will use them again and highly recommend them. \nThe cost is more than reasonable or the quality of service provided","useful":0,"funny":0,"cool":0},
{"review_id":"O2ZCeUnQqCybF9Qois8CGw","user_id":"gHRBbxBIODuMYN-6mbcjEA","business_id":"uLYFOYr32IzIDjZNYzG0AQ","stars":1,"date":"2016-12-06","text":"I had a simple question about my bill. I told the person at the counter. He took my information and went behind the closed doors. I assumed he was getting my account details so I waited. 25 minutes later no sign of him. I went back to the counter and was told I was 3rd on the list. No one had bothered to mention this before. Because I had to meet someone, I left. Later I went to another Verizon store and got my answer in two minutes. \n\nVerizon being a high end provider should not allow their stores to require long waits from customers for service.","useful":0,"funny":0,"cool":0},
{"review_id":"U711SEMGgAxuwZIeR5LMjw","user_id":"gHRBbxBIODuMYN-6mbcjEA","business_id":"Wxxvi3LZbHNIDwJ-ZimtnA","stars":2,"date":"2016-02-22","text":"Very sad about this one, but I'm hoping the management will read it and take the needed corrective action. We've stayed here many times before, but this last time will probably be our last. The reason we've stayed here is its location, its reasonable prices, and the room size. Every room is a suite with a double bed and a living room.\n\nUnfortunately, we were beset by what appears to be a re-structuring of the hotel's housekeeping service. Our habit is to leave for breakfast and notify the housekeeping service to make up our room while we're gone. We like to come back after lunch and nap, and hate to find them only getting around to making up our room when we're back. \n\nSo, the first day, we called at 9am, asked them to clean within the next hour. I left my wife shopping at 2pm. Guess who had just gotten started on making it up. I came back at 3, and they were gone. BUT, I found our newspapers and used glasses and coffee cups not removed. Also, the bathroom floor had some kleenex or possibly toilet paper on it. I didn't say anything then.\n\nNext day, we call again at 8:30am. Go downstairs for breakfast. I get back to the room at 10am. Room not made up. I want to do some work while my wife shops. Call housekeeping. They tell me they'll do it as soon as possible. I say when is that? She says, right away. I change my plans and go do some exploring. Get back at noon. Yep! not done. The person says they're in the middle of changing housekeeping systems and they're sorry.\n\nRoom was cleaned that evening, but we napped on dirty linens. Shouldn't happen at a first class hotel. I've stayed in many many hotels and never had that problem. While I didn't ask for some credit on my account, I expect a first class hotel to offer some sort of compensation, maybe just a credit on a future stay. Nope. Nothing. Nada.\n\nAs I said, the hotel is fine. Lots of good restaurants, good location, great rooms, if not clean. So, I will probably stay somewhere else next year. Sorry, Venetian. Two stars.","useful":1,"funny":0,"cool":0},
{"review_id":"F1_nzd6Ti39F7kFs0LkSaw","user_id":"gHRBbxBIODuMYN-6mbcjEA","business_id":"LV9Stq-s3H4dqaTE1Z7rwA","stars":2,"date":"2016-01-18","text":"The happy hour menu is a real bargain. I went alone tonight. I was seated right by the kitchen even though there were other small tables in better locations. I know I could (should) have asked to be moved but I figured maybe there would be a crowd later on and when I'm alone I don't get very picky. I was apparently assigned to a busy waiter who was annoyed at having to serve me. He took my order after about ten minutes making it clear that he was in a rush. \n\nI didn't see him again except once when he refilled my soft drink. Others bring the items when they're ready. They brought out two of the three appetizers I had ordered in reasonable time. I knew the third one - the chicken wings - take 20 minutes to prepare so I waited. And waited. Didn't see my waiter. After 40 minutes the bus boy asked me if I wanted any boxes for my leftovers. I told him I still didn't have all my order. He went to check it out. Only then did my waiter come (actually about another five minutes later) to tell me it would be just a few more minutes. I told him to just forget them and bring me the check. \n\nHe seemed reluctant to do that maybe because it would reflect on his service. But he did. So, I got a pretty good albeit a pretty small meal for about ten bucks. Because I feel sorry for people who have to make a living as servers I still have him a five dollar tip. \n\nThe other problem with Flo's is that, other than a few appetizers, the rest of their dishes aren't even mediocre. \n\nThe two appetizers you should try are the shiu Mai and the chicken wings. The calamari is tasty but often too chewy.","useful":1,"funny":0,"cool":1},
{"review_id":"2lZDjWiqlqJTU_xZdYZD9w","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"UScXRDCz535-5MOkpoJyqw","stars":2,"date":"2013-12-21","text":"Only one Ikea store in Calgary Canada. Visited the store with the young grandchildren and found the family restroom upstairs by the restaurant sorely lacking. There were no hand towels in the dispenser . Grandpa in the men's washroom noted that his area had no hand soap. The store was not busy so it would be interesting to know how staff are alotted for hygiene matters.","useful":1,"funny":0,"cool":0},
{"review_id":"c0p5QGtyJAqbLEsKhwsj4g","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"v1po8i9MdguA5-nJNbrHNA","stars":2,"date":"2013-08-20","text":"Food over cooked, seasoning not up to Greek cooking standards. Calamari deep fried with very thick and tasteless batter. Tzasiki...  could .only tell that it was because that's what we ordered but unable to tell what it was otherwise\nHope they improve so we can enjoy Greek food in our area!","useful":0,"funny":0,"cool":0},
{"review_id":"pEReZ-_BEVT1Y5pyhFganA","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"KvAGwOlBijq1KyL_jLmieQ","stars":1,"date":"2013-06-06","text":"Dealing with Melchers was truly disheartening after my friend Elizabeth died on May 5. Her husband and I felt that we had no help from the funeral home.  They did not communicate with us unless we called them. Dealing with Melchers made our loss even harder to deal with.","useful":5,"funny":0,"cool":1},
{"review_id":"Gi6fY78ClQc6erD1-s6xdA","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"AabR8NEwbwoGhQxJohs0OQ","stars":4,"date":"2014-05-07","text":"Quaint little \"down home\" breakfast\/lunch restaurant. Out of the way so not easy to find but worth it once you do. Service is good, even the owner\/ cook came out to greet us. Coffee was filled over and over. Food was good and not too high priced. Good place for a decent meal.","useful":0,"funny":0,"cool":0},
{"review_id":"ecK2nTOLgxTQh-WQuJF-dQ","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"L_9ij8g3xMDOG3NScnCQhg","stars":1,"date":"2014-07-05","text":"This store needs a management team. It is obvious that the ones there now have had NO training nor do they even use common sense.\nWent to electronics for a battery and could not find it. 2 staff at counter and no customers. My husband asked about the particular battery. The clerk looked over to the battery section, pointed and and said they're over there, and if you don't see it, we don't have it. He never offered any assistance .\nWent to pick up lettuce. Numerous bag holders and not one bag.\nWas there in the winter, temperature was -40degrees. The last teller by the door was so cold that she had on her jacket , hat and scarf.. There were 3 empty tills much further inside where it was warmer.\nThe store is dirty, stock is low and as said before, staff have no management to supervise and guide them.\nMoral is poor. \nWhen will this be fixed? I tried to e-mail Walmart offices 2X now but the letter doesn't go thru...... Is it meant to be this way?","useful":2,"funny":0,"cool":0},
{"review_id":"AYKge4J0gUKn1bqc9GyMRA","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"MgzGvq5VKDqXKigty36xRw","stars":2,"date":"2013-10-07","text":"OMG, loved this place before the fire, but now the service is haphazard, the food is for lack of words, interesting. Good news , it's clean....will try again but if worse, will tell you all why... I hope I am having very bad dream!!! Please, only 2stars!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"pLbtoolo4oCoSbSk4pWw3Q","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"9njwmO6YzhaQB3-htNMFYQ","stars":4,"date":"2013-10-31","text":"Food is good, atmosphere welcoming,and Jessica our waitress was great! Will definitely go again . It's a place we will be pleased to bring friends to.","useful":0,"funny":0,"cool":0},
{"review_id":"m7vd3vGyIAcVSvgI8k-XCA","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"WhSrqG9a7u-3vxCB7Mxwcw","stars":4,"date":"2014-03-07","text":"Thursday is $9.99 steak sandwich special. Second time my friend and I went. Tender steaks done perfectly. Nice choice of sides.\nNice to have good food in the area. Happy hour with food special....great","useful":0,"funny":0,"cool":0},
{"review_id":"fZNL-CzWASFwESpZTT3dRg","user_id":"kOgoFz__Xw-wQs3MZTQ7Og","business_id":"jnEeU5rAhKt-ORxk9L1LYw","stars":1,"date":"2013-10-31","text":"Went on Sunday, 2 football games on TV. One being a Arizona cardinals game.\nPlace was half full....why? The food was terrible. Example, jalapeo poppers made with red peppers and the dip was sweet and sour sauce. Not very appetizing! \nGood thing happy hour is seven days a week, but don't go if you are hungry","useful":0,"funny":0,"cool":0},
{"review_id":"-N4WWCBoFX0foP6vdnEAVg","user_id":"zSzfVdiCKwE2Pn8KKgJp2g","business_id":"UtsJThJWezQCAz1Ag2PaBQ","stars":4,"date":"2015-11-19","text":"Cooked perfectly, very friendly staff. A bit too oily for me, so i'd recommend a good straining before the sauce goes on.","useful":0,"funny":0,"cool":0},
{"review_id":"4-HAkVj-G7sEz1G_9Raeww","user_id":"zSzfVdiCKwE2Pn8KKgJp2g","business_id":"poSV39UqEg-gpESXafS9-g","stars":4,"date":"2015-09-05","text":"Had 3bs. of the Trifecta 2 Crawfish. Hot! Make sure you get two empty buckets, and dump the bag into one of them, so the sauce mixes into the bugs. Won't do medium again. Too hot for me, and I lived and ate in New Orleans. Also, way busy on Fridays; hour wait for a two top.","useful":1,"funny":0,"cool":0},
{"review_id":"Lm2gZ5xrneIx__94ylCazQ","user_id":"zSzfVdiCKwE2Pn8KKgJp2g","business_id":"2T66oHiIi1Ql-j5IhwbGjw","stars":4,"date":"2015-11-19","text":"Great burgers, very friendly staff. Reasonable prices.","useful":0,"funny":0,"cool":0},
{"review_id":"NNrIdeXpACPnpb7_IOi2Fw","user_id":"NJ-nisPpWrd8XQkIEKeOkA","business_id":"Sg61okMqqrUnxJkNsReWtw","stars":5,"date":"2014-07-31","text":"I went to Arauna without knowing much about him. I relied on the Yelp reviews and the pictures of his work. I am so glad I did. This guy is not only talented but he's cleaner than most hospitals. OSHA would give Arauna an A+. He does ask a lot of question so that he can get to know you. He is creative and actually fixed some previous work I had done and wasn't quite happy with it. His prices are reasonable and it's not about the money with him. He would just as soon politely ask you to leave rather than do something that would compromise his beliefs!!! I am returning for more work. My wife is definitely not a Tatau (Tatoo) fan but she was totally impressed when she saw his work. Talk with him, let him get to know you and you might think you know what you want but at least look at his free hand suggestions. He has no problem doing exactly what you came to have done but you just might want to see and hear what he has to say. What a stress free clean and friendlyenvironment. Oh yeah, and the music he plays is SMOKIN!!!! Thanks my friend and be well until I return...to wish you well again!","useful":0,"funny":0,"cool":0},
{"review_id":"GMeyi2m3RP8Ltnm1lZjnLA","user_id":"NJ-nisPpWrd8XQkIEKeOkA","business_id":"j075ERyBlOEmAzLeou6nlg","stars":5,"date":"2014-08-24","text":"Forget what you have read about all the negative stuff that went on in the past at CCS. They are aware of the problems and have taken drastic steps to address and correct all your issues and concerns. I just left there and was totally impressed at the concern of the staff to make things right. Rico has been there for years and has been personally addressing any and all problems that is brought to his attention. They are overhauling the staff to insure that only good qualified people are working on your car. Give these guys another shot I think you will be glad you did!!!","useful":0,"funny":0,"cool":0},
{"review_id":"dLIVBEvrYPf3WIRcmjjdHw","user_id":"tbbNiAYN7WFRFoQk8LzBUg","business_id":"iRwT2pBa87Y54q8nqfNAzw","stars":5,"date":"2012-04-17","text":"Coming from California, I have REALLLLY high expectations for pho. This is especially true when you wake up in Vegas with a pounding headache due to high levels of alcohol consumption the night before.\n\nLooked up the nearest pho place from the strip on my phone and wah-lah! We arrived at Da Lat.\n\nHands down, best pho I have had. And this is coming from someone who lives twenty minutes away from Westminster. \n\nService was great. Food was great. I'll definitely be returning if I'm in Vegas.","useful":1,"funny":0,"cool":0},
{"review_id":"tw-6spYcxA7Lzj-BTMHrIg","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"nT16Y6AsJDwEpUB1JICKzg","stars":1,"date":"2016-11-23","text":"Poor customer service, overpriced, crowded and stressful. Be prepared to spend more than you planned. On one occasion we were overcharged at the cash register the girl at the checkout scanning items that were not ours but (suspiciously) not placing them in our bag...\n\nWorst offender: Cheese express (on your right when entering from Front St.) Staffed by two young, surly and resentful employees. You would think they would be polite and appreciative for our business instead they were actually hostile. Hope the owners take note.","useful":2,"funny":0,"cool":0},
{"review_id":"MvStC-_hchE8pHdH9VndPw","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"3D-FJxp8bsBzm3zJVqs92g","stars":1,"date":"2017-02-27","text":"Over Easy\n\n208 Bloor St. West\n\nRidiculously overpriced garbage.\n\nI ordered the meat lovers omelette. The eggs were overcooked, rubbery and tasteless; probably the worst eggs I've ever eaten in any restaurant ever. The omelette filling was tasteless and lacking in cheese. My friend got the smoked salmon eggs benedict which was a bit better than my order. On the positive: We ordered a side plate of extra bacon which was delicious and beautifully cooked.\n\nThe service was breezy and careless. He did not seem happy in his job. We had to ask several times for coffee sweeteners and by the time the server brought them I barely had time for a sip of (badly needed) coffee before our food came. The biggest shock was the bill: over $50 for a simple brunch! We regret not going to Eggsmart instead, which is far better value. The Bloor and Ossingtion location of Eggsmart is great - not Sherbourne and Bloor!","useful":2,"funny":0,"cool":0},
{"review_id":"R-vEtiZOIVecWLlKkvu5gg","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"8pewDasd0KjSHI90hFo8xw","stars":2,"date":"2017-02-14","text":"Decent grub but sooooo overpriced!!!\nC'mon folks, it's just humble BBQ in a somewhat rough part of town-with no seating!\nDrop your prices and I'm there everyday!","useful":0,"funny":0,"cool":0},
{"review_id":"Wjk7GiMBUl869GDx3BqEnA","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"h_4dPV9M9aYaBliH1Eoeeg","stars":2,"date":"2016-11-23","text":"Overpriced street food. What you end up paying for a gourmet hot dog is what you'd pay for good French, Indian or Italian food with decent service. The food is good but not great. The biggest problems: You serve yourself in this restaurant. This means getting up and looking for the right counter to place your order. Most irritating, the machine-like bus-girl tried to swipe our food\/drinks from the table even though we hadn't finished (the glasses were half full!); nothing worse than an overzealous bus-person. Positives: The bread was good, freshly baked in fact, and the duck fries were also tasty. \n\nIn an trendy place like this you expect to be served and tip for it. At Vwerst, you end up feeling like you need to tip but without the service. If you're jonesing for an upscale hotdog then this is for you but in the end all you're getting is meat, bread, and potatoes. Tasty but not a lot of selection. A bit pretentious and poorly thought out.","useful":2,"funny":1,"cool":0},
{"review_id":"CpI0ROkmELfEphUUkU_ykQ","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"sF7md_NdYUzXLl5ZtwwC4g","stars":5,"date":"2017-02-20","text":"Qui Ristorante Pizzeria\n\n1654 St. Clair Ave W\n\nAbsolutely wonderful dining experience! We ordered the margarita pizza, fried calamari, and the meatball special. The pizza was among the best I've ever tasted, that includes New York, Italy, and the hippest joints in Toronto. The service was friendly and attentive. We took the servers recommendation for wine, which was also quite good. Will definitely go again! Great addition to the area - I highly recommend it!","useful":3,"funny":0,"cool":0},
{"review_id":"xa6xnK55-0vrd2Yj7Rb-4Q","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"svYRwm8unFfkki__lJrR2w","stars":5,"date":"2016-11-23","text":"Pros: Wholesome South Indian food made with care and a home cook feel. Everything is vegetarian (but not lacking in flavor). Star attractions are the Chili Cheese Dhosa, the Scrambled Egg, and the renowned Dhosa Mahal. The chutneys are scrumptious. They also sell some quite tasty samosas and pakoras near the entrance (three or four for a buck I think; affordable for any budget). \n\nThe restaurant is family run and you get a genuine sense that they see their customers as people. \n\nCons: The Landsdowne neighborhood is a bit rough. Be warned, this restaurant is far from fancy, very humble decor etc. Just saying if that's an issue","useful":3,"funny":0,"cool":0},
{"review_id":"GX0dERYYa-pAC3ZZceQn3A","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"VZCUs6n7F4tcg-TCtx_9Ew","stars":5,"date":"2017-01-05","text":"El Rancherito\n\n1662 st clair ave west\n\nA nice, unpretentious place. Ideal for families and large groups. We ordered the beef taco's and the fried plantain served with sour cream. Both dishes were excellent and the portions generous. The atmosphere is colorful, ethnic and welcoming. The service was also good as was the pricing which was very reasonable. The Modelo beer was a refreshing change.\n\nAll in all, a fantastic local eatery and a great addition to the Corso Italia\/Junction north neighborhood of Weston-Pelham park.","useful":3,"funny":0,"cool":0},
{"review_id":"p2LgmQFARITDuaVj05RANQ","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"d_jxInosU_3cAYI0qi34UA","stars":4,"date":"2016-11-23","text":"Congee Time is our favorite place for Chinese food in the city. I have had the opportunity to travel to China more than once and although the food here cannot compare with the dishes I had in China the chow at congee time is the best Chinese cuisine I've had in Toronto. It's also quite affordable (just wish it were closer to the downtown core!) Generous portions; we always go home with leftovers. Over the years, we've visited for lunch and dinner - it's a bit quieter during lunch or early dinner hours.\n\nTop dishes: Hot and Sour Soup (and any of the Congees), Salt and Pepper Squid, Crispy Roasted Chicken, Eggplant and Pork Hot Pot, Olive and Pork Green Beans, and Oyster Hot Pot. \n\nCons: The atmosphere isn't pleasant for two reasons: First, it is cold. Very cold,almost as if they keep the front door open. Second, it's extremely noisy, made worse by the busboy staff who smash and bang the plates together with fervor (irksome when you're sitting two feet away); these detract from the dining experience.","useful":2,"funny":2,"cool":0},
{"review_id":"rHWVi1wLORNocMFnWBPPNg","user_id":"fM58Hcz_OeTuWNsy2hjx-w","business_id":"gaJDeNh6xKIKJIT13abKTg","stars":5,"date":"2017-01-05","text":"Pho Xua\n\n1768 st clair ave west.\n\nPleasant surprise! The food is decent and the atmosphere and service is nice. Has an upscale feel. Ideal for couples and small groups.\n\nWe ordered a variety of fried rolls and appetizers; grilled shrimp and veggies skewered on a kebab, and bunh vermicelli, all of which were excellent. The Tiger beer was a refreshing change. The only disappointment were the fried squid which would have been better with more breading\/crunchier.\n\nAll in all, a fantastic local eatery and a great addition to the Corso Italia\/Junction north neighborhood of Weston-Pelham park.","useful":2,"funny":0,"cool":0},
{"review_id":"vhm28w6n-7BWLy0VIAGKxQ","user_id":"bvuc9hJTYHm7YnfDQMb_tA","business_id":"rcaPajgKOJC2vo_l3xa42A","stars":5,"date":"2012-05-30","text":"Outstanding experience at Bouchon.  The Gnocchi  la Parisienne was fantabulous.  Rich flavors without being too heavy.  I wish Vegas was closer or Mr. Keller would open a place in Denver.","useful":0,"funny":0,"cool":0},
{"review_id":"05xIli1OI7_Xca8pesxtpw","user_id":"HrnfLYpzkqykUBuqjPXipQ","business_id":"IhCgS63KdIuQC6I7qZJLzg","stars":1,"date":"2016-09-26","text":"Aptive in Pittsburgh, Pa. Please avoid these people as it's a door to door scam. The salesman convinced me to sign up at a $69 application price and three more applications in the year. When the service tech sprays the property he said there is a total of five applications\nat $116 each. After the first application I still have bees and their policy of returning is to charge another application fee of $116... no free return service. I tried to get out of this contract but the local office in Pittsburgh wants $160 fee to get out of the contract. And yes I still have ground bees!!!","useful":12,"funny":0,"cool":0},
{"review_id":"B06TBpuFdfDNoYXDdUEhaQ","user_id":"YEPRF75BMDDJ_SkGtUwAxw","business_id":"o7AiTlyWUrBSzdz6oMHj5w","stars":2,"date":"2016-10-11","text":"I would give a 3, but this trip dealing with the front desk was frustrating. I had some resort credits that I received with my players card. It was not explained to me very well how to use them(put a credit card on file with the front desk, then charge the food to the room). This was not explained until the 2nd time asking about how it worked. \nWhen I finally understood how to use it, not many of the food places were set up to even charge to the room. I finally inquired again on who of the very selected few can charge to the room. After charging to the room, i found out that  buying a drink in a bottle was not included. This i feel should have been  explained to me from the beginning. The people that work in rhe restaurants dont even know. The money I spent on that drink although not a lot was not able to be fixed by a manager. Spent money i was not planning to spend. Knowing all This when i checked in would saved multiple trips and calls standing in line wasting time at the front desk and multiple restaurants. What a headache. \nHousekeeping was awesome as usual. Annoying time share people trying to give you shows are annoying and like vultures.","useful":1,"funny":0,"cool":0},
{"review_id":"QN-j5d9k1GOf7md9Kw8kIg","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"Dux0FHqMLYZGf4pEyHky2g","stars":5,"date":"2009-09-16","text":"Clean, knowledgeable, professional and talented. Everything I'd want in a tattoo shop. Got my tattoo from Rodney and I couldn't have asked for better. Not only is he an extremely talented artist, he made sitting through a four hour session a breeze (Well, as much of a breeze as having needles rapidly inserted into your skin can be). I wouldn't hesitate to go back when I get my next tattoo.","useful":3,"funny":0,"cool":1},
{"review_id":"tCg4XI5eHcUapNrwcvLTZQ","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"yWUBX9Pe6pzh1PjVj04UmQ","stars":4,"date":"2008-08-03","text":"You'd think that a really good burger wouldn't be that tough a feat to accomplish, but surprisingly not too many places seem to be able to pull it off. In 8 or so visits in the past few months Big Daddy's has consistently been able to serve up the best burgers I've had in Charlotte. Plus, they have really good fries, excellent sweet potato fries and the ne plus ultra of potato based burger sidekicks tater tots. I'm not certain why tater tots seem to go so perfectly with burgers, whether they actually taste good or it's more of a diabolicaly insidious after effect of school cafeteria tater-tot brainwashing, but the pairing of the tots and the beef puck works. If you dig root beer try the stuff they have on tap.","useful":0,"funny":0,"cool":0},
{"review_id":"KF8Ngyb0YdCs2_ESBW8NdA","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"X23bt-XPgRC5yqtrSgp9Jg","stars":5,"date":"2008-07-31","text":"You can tell when a lot of thought has been put into a venture and after just one visit to Winestore it becomes apparent that the brains behind the thoughts had their synapses firing to great effect.\n\nUnlike some stores that tout \"bazillions of bottles\" or \"bestellers\" (I'm not naming names but pretend you're Robert Frost for a moment and think of some things that rhyme with Scrotal Vine and Paris Feeter), Winestore carries a limited stock, and they don't carry anything that they themselves haven't tasted and thought worthy of stocking\n\nThe look is modern, the lighting pleasing and the lion's share of the bottles are displayed vertically with labels out and within easy reach. Most of the wines are also sorted by color and density(Light Reds, Medium Reds, etc) while the rest are displayed in the rotating floor stands with labels like \"Date Night\", \"Tax Refund\" and \"Girl's Night Out\". All of the wines have cleverly written description cards next to them that are helpful in ascertaining the character of the wine.\n\nTwo wall mounted kiosks also allow you to browse the store's stock and with the recently updated software they are running, track which wines you have purchased and rate them,which is great because I cant always remember what I thought of a particular wine that I may have had a year ago. They will also give you more information about the wine you just tasted (more on that in a sec) and allow you to add wines to your wish-list should a friend or relative happen by and want to know what to bring to that party your hosting. \"Hey Mom, don't show up without a bottle of the Niepoort 20 year if you know whats good for ya!\"\n\nAnyone who drinks wine knows the sad little moment when you take a taste of a wine not yet tried and think, \"I don't like this nearly as much as root-canal.\" To combat this problem the slingers of grapes at Winestore have installed two machines imported from Italy called Enorounds, one for Whites and one for Reds that allow you to sample wines. You purchase a Winestore card, putting whatever amount of money you wish on it, insert the card into the Enoround, push a button and a sample will be poured for you by the machine. Not only does it allow you to try before you buy, it makes shopping for wine a lot more fun.\n\nWhat really makes the store stand out for me as my absolute favorite is that the owners, Matt and Keith, have taken the time to get to know me as a customer, are always willing to take the time to discuss particular wines with me and have become familiar with my tastes and will gladly recommend wines for me when asked.  For those of us that love wine, but aren't really educated on what grape is what and what region produces which to what effect, purchasing wine can be somewhat daunting. Not at Winestore. While there are a few good places to buy wine in Charlotte, Winestore is my absolute favorite.","useful":0,"funny":0,"cool":0},
{"review_id":"wBVn0Uz390vQOatbF7br_Q","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"eCeFBHucdjbZkJlry8EALw","stars":5,"date":"2013-01-13","text":"Great grilled cheese and friendly service. Couldn't ask for more. Have tried the Big Cheesy, the Pig Mac and my favorite, the Leek and Mushroom.  All three were well worth it. Comfort food on wheels!","useful":1,"funny":0,"cool":0},
{"review_id":"VCQDGObNrZUz-dS1lwH0mw","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"7x04lVFbPbznsjiJSNu5Rw","stars":4,"date":"2012-03-02","text":"My experiences at Biggs have been quite different than many of the reviews posted here. For a small store, they carry an impressive array of goods, new and used, and the staff, mostly, seems to know their stuff. While I have had to wait to be helped, it's always been because the staff was busy helping other customers. One of the first items I purchased there we my digital SLR and the salesman who helped me was patient and answered all my questions. I've been a repeat customer, have purchased cameras, filters, a bag, cables, film, and have had film processed and images printed at Biggs. As for their prices, they seem competitive when it comes to cameras and lenses but their film and smaller items are quite pricey. In this day and age, when privately owned stores with knowledgeable staffs are few and far between, it's nice to have Biggs there when I need them.","useful":2,"funny":0,"cool":1},
{"review_id":"tbcFmSc1AbohehEIpW9QOA","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"K3iw26MkmSBPAM7BzHkIYQ","stars":5,"date":"2009-12-25","text":"Here's the key to any sushi restaurant with its salt: Consistency. If you're a fan of seafood in general, and especially RAW seafood, you want your restaurant of choice to hit the mark every single time. I have eaten at Yama dozens of times and they have been consistantly excellent. From the taste and quality of the food to the great service and atmosphere. If you're a sake fan they have quite a good selection. For my money, the best sushi in town.","useful":1,"funny":0,"cool":0},
{"review_id":"iLSjCieSTNPtb0C4K0Jp9w","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"WOj8nPos3R9IIf0Pyttd8g","stars":5,"date":"2008-12-06","text":"Eating is a subjective experience. One person's orgasmic-gourmandic experience may be another's mediocre meal. Tastes vary greatly and it all boils down to that meal at that moment in that place.That being said, if you don't find Lulu to be absolutely amazing then there is something horribly wrong with you. \n\nWe went on the friday after Thanksgiving and Charlotte must have been still under the effects of post-gobbler tryptophan malaise because when we arrived we were one of three tables, a scenario which I understand to be atypical. We were greeted warmly and seated by a window which framed a vignette of Central Ave at night. Wine was poured, conversation ensued and then the food was plunked down in front of us. My wife had the eggplant lasagna and I opted, in spite of the \"you are what you eat\" connotations, for the Chowdahead. My wife's dish was excellent, smoky and perfectly balanced taste and texturally. My Chowdahead, well let's just say the only superlative that could come close to describing it is \"wicked awesome.\" For those of you not from New England, that means phenomenal. A fillet of salmon, which was perfectly cooked, lay atop a bed of the most wonderful chowder I've had south of the Mason-Dixon line. That evening was one of the first nights with a winter chill in the air this season and these two entrees fit the weather perfectly. Hot, rich, perfectly seasoned and filling. Our waitress was great, the service excellent. It was comfort food with class, served in a warm atmosphere coupled with good wines and great service. It was, absolutely, the best meal I've had in Charlotte in years. And I hear they do brunch as well.","useful":1,"funny":1,"cool":1},
{"review_id":"bU_JXXyhnKg9VHvlpsfCOw","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"c6-5RCj8FtV-m1aHz4wnmQ","stars":4,"date":"2010-02-23","text":"I grew to appreciate Vietnamese food after graduating college. I was living in an are up north that had a sizable Southeast Asian community, and there were at least six Vietnamese restaurants within walking distance of my house. Not having a lot of spare cash coupled with the fact that the Vietnamese eateries were quite affordable meant that my friends and I would quite often find ourselves with bellies full of pho and vietnamese iced coffee. Fast forward many years later and I'm glad to find that there is an excellent choice for Vietnamese food a quick hop from my current abode.\n\nI've been to dine at Saigon Palace close to a dozen times and it has been consistently good. The staff has been friendly, the service great, and the food has been extremely tasting and satisfying. The Pho is quite good as is the Bun. Also, the quail appetizer is outstanding. I did manage to make it to their Sunday buffet lunch which was very cool. It was packed and the place was buzzing with families and large groups happily chowing down and enjoying the food and conversation.  Saigon Palace has pretty much everything I could ask for in a regular dining stop.","useful":2,"funny":1,"cool":2},
{"review_id":"1L0JoS8kuhxTWb1kMiSiaQ","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"bmcxT_geMvzExMb6Hpifgg","stars":2,"date":"2008-07-29","text":"I truly wanted to like the counter. A burger joint within minutes of home that didn't have a clown as its mascot? Sounded good to me. Sadly though the reality of the counter is that in 4 visits they screwed up our orders 3 times out of 4. Fairly incredible when you consider that the kitchen is working from customer filled-out checklists.\n\nOnce when we were in we were one of 3 occupied tables. The food took almost 30 minutes to arrive once ordered. Another time one of the management was at the entrance and was angrily trying to either get the attention of or berate a member of the staff. He did so by raising his hand in the air and repeatedly snapping his fingers at the staffer in full view of the entire restaurant. that sort of thing should be kept behind the scenes. It just made the manager look like an imbecile.\n\nOn my fourth and final visit I had to send back a burger that I had ordered medium-well that arrived on the rare side of medium. The waiter looked at the burger and said \"Our medium well is like that.\" Their medium-well? I was sort of flabbergasted  and simultaneously amused by the thought of arbitrary meat temperatures, it would save restaurants having to re-cook items. \"No ma'am, OUR chicken, unlike other establishments birds, are fully cooked when pink, not to worry.\" \n\nI won;t be going back, when I get a jones for a really good burger I'll drive the extra 8 minutes to Big Daddy's Burger Bar on East Blvd.","useful":1,"funny":0,"cool":0},
{"review_id":"TbgObBpsvnCzsCBkppZgOw","user_id":"iLzOjHz1KO95FyPXr3V-aw","business_id":"sR8abAg-zKxqE0HkICA-4A","stars":5,"date":"2008-08-01","text":"I am WAAAAAAAYYYYY overdue for a visit to Down To The Bone. We found out about it when my wife and I met the owners at a grocery store. I must admit, I can't describe most of the main courses because I can't get past the Pork Ribs. They're so incredibly delicious and melt-off the bone tender that anytime I'm waiting in line to order I look at the meats on the menu, think to myself \"That looks good, ooh so does that, hmm maybe I'll try...\" but as soon as it's my turn to order what flies out of my mouth is inevitably \"Ribs please\". My wife swears by the fried chicken. I have danced my way around the sides though and the Yams have to be tasted to be believed. Beyond great. The mac and cheese is stellar too. This isn't \"light lunch\" fare so take my advice and come hungry and save room for dessert. They have Junior's cheesecake. Now, if you've never set foot in Brooklyn, NY that might not mean anything to you, but if you dig cheesecake give it a go. My wife loves the banana pudding, but my favorite is the Pineapple Upside-Down cake. The service is great, the staff friendly and customers are made to feel welcome. I always feel a lot slower when I leave, but also a hell of a lot happier. It must have been something I ate.","useful":0,"funny":2,"cool":1},
{"review_id":"uJqWUhoCczb_4aeKTvZzjw","user_id":"A97y_I-9pJ6qjbrffHcfwg","business_id":"rv9T1qGHbh9eXqFpKEPy_A","stars":5,"date":"2017-12-29","text":"Wow, food was amazing, and staff was super friendly.  Definitely has a Mom and Pops vibe. \n\nHighly suggest Almond Chicken, Mongolian Beef (I believe the meat they use is filet mignon), CRAB PUFFS, and Pepper Steak. \n\nMost people are used to Mandarin style Chinese food (aka Panda Express). If you're not familiar with Hunan or Szechuan style food, you won't understand Sesame Inn.","useful":0,"funny":0,"cool":0},
{"review_id":"r4uZlJAeKzDObexBWB4JAQ","user_id":"ptf9JIV-exjl8wQmK84AxA","business_id":"LAKs5UatFvOhlaF4sZ1obA","stars":2,"date":"2016-07-20","text":"A co-worker and I went there for lunch and she ordered one of the dish that contained fish sauce.  She did not like it because of the smell of the fish sauce and asked the waiter to see if she can exchange it for another dish.  The waiter brought the owner and he refused and told her that if he did that for every customer, then he would go out of business.  I was shocked at how unprofessional that was.  The food was okay, but the customer service has got to change.","useful":0,"funny":1,"cool":0},
{"review_id":"9fwXrc-QZHpmHt-1EZs7Hg","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"89gr564KWwUQBVW-faLe_w","stars":5,"date":"2014-07-02","text":"we have recently went this store to have my fiances engagement ring to resize. We very pleased with the service and the fair prices at this store. They have also very nice staff in store . Highly recommend.","useful":6,"funny":0,"cool":0},
{"review_id":"MAyi-N6hE9il2rD4G9lFkg","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"k4GyGL2er4PvQ4Cc8XZJqA","stars":2,"date":"2014-07-04","text":"this store is very near  to my house, sometimes Its takes very long  and staff is very unfriendly","useful":0,"funny":0,"cool":0},
{"review_id":"y2PGj2qu1tEFZ3fqz8Gb6w","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"KOAchpyju_dXU24h-96Kzw","stars":5,"date":"2017-02-13","text":"Great service! Friendly and very clean!!The salon is really pretty, with modern\/ contemporary decor. Eveline did amazing job! \nHighly recommend.","useful":0,"funny":0,"cool":1},
{"review_id":"xMhFIzTSfvgYte5vgKdkCw","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"vl1aHp6pvnSmpoRQShWLjg","stars":4,"date":"2014-07-07","text":"I come for lunch and I have ordered BBQ chicken sandvich, I liked it very much, only it takes very long to bring food specially when you have only 1 hour lunch time","useful":0,"funny":0,"cool":0},
{"review_id":"NPbyQBObDN7Zluss_9-VVA","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"iJy7ameVQsas8IA6nGhywg","stars":5,"date":"2014-08-22","text":"First time patient of Dr. Athari and he is one of the BEST dentists I have ever had the pleasure of seeing for dental care.\n\nHe is very professional and his work is excellent, fast, gentle, with tremendous results. His equipment is brand new and the highest tech I've seen.\n\nDr. Athari truly cares about each patient, he takes the time to explain in detail everything and he works \"one-on-one \"with his patients  and  takes the time to do all the work himself  and focuses 100% on each patient. I am extremely pleased with the service he provides and I am so very happy he is my dentist. BEST Dentist, Highly recommended. Thank you Dr. Athari .","useful":1,"funny":0,"cool":0},
{"review_id":"7Mu1DphZzArIT3tbcCSTZQ","user_id":"7GacL5zr1c6Uy0JYLTMcLA","business_id":"edV_IqWqz5KVSGLrsru5EQ","stars":4,"date":"2014-07-07","text":"Very good pediatrician. I am taking my  2 years old son since birth, I would highly recommend Dr. Robertson to anyone. I am not rating 5 star, because of even it is very easy to do appointment but it takes very long to wait.","useful":0,"funny":0,"cool":0},
{"review_id":"yw_JqUF6x1vndahcoFoLNQ","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"A06xqmhmL7U7--NbKP32fQ","stars":5,"date":"2011-06-02","text":"This IS the place to go for any shoe or leather repair. Luis has been a miracle worker... Puppy chewed the leather couch and he fixed it (three times) - countless  designer shoes have been refreshed- heels fixed- belts mended. He's a sweetheart and doesn't overcharge. God knows I love my shoes and I know I'm in good hands with Luis!!","useful":6,"funny":0,"cool":1},
{"review_id":"zN9UGY1VnxakSOsf-5aa4Q","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"XI3iNUgChOfJk5ppjKVEQQ","stars":5,"date":"2012-09-19","text":"What a fabulous little gem!\nThe service was stellar!\nThe atmosphere perfection!\nAnd the food\/wine delicious-o!! (the spaghetti dish had flavors I would not have expected- my mouth was overjoyed.\n\nI only wish I lived in this city to enjoy this spot every week.\nWhat's great about this place- it's not trying to be amazing- it just is!\n\nMerci beaucoup to the entire team that makes it so special.\nI shall return","useful":1,"funny":1,"cool":1},
{"review_id":"DkIcDbZx9Rl1Z_xujRtm6w","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"ayFjn1TCXMLKjmbOB-SvnA","stars":5,"date":"2011-06-01","text":"If you have a computer then chances are you will need assistance for one thing or another... go to Jared (not the damn jewelry store) Jared @ Folsom Tech can help you out with whatever you need. No muss, no fuss- they get it done and don't charge crazy prices. I've been with them for 3-4 yrs now and wouldn't ever think of trusting anyone else (says a lot since I'm self-employed and rely on my computers for everything) Jared is my \"go-to guy\" for all technical support. He even keeps me clued in on new Mac goodies- very grateful because I always want new gadgets!!","useful":2,"funny":0,"cool":1},
{"review_id":"lveRcvN_2Fw8wlFhIXlOgg","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"k8BqCejnaMlw7aoVthvqyw","stars":4,"date":"2011-06-04","text":"I totally agree with these positive reviews- old school Vegas style that us locals sometimes forget. It warm and inviting. And live music-- ya just never know who you'll bump into. And just wanted to suggest the pizza for tasty takeout-- far better than one of the pizza chains! Still quick and much better variety of toppings that are fresh not canned. And they love garlic like I LOVE garlic!! Yum mm my!","useful":0,"funny":0,"cool":0},
{"review_id":"903mgea8IKvm6E9wJi3lNA","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"Yevhl8bTwdJuu_LWKv-4Fw","stars":4,"date":"2011-06-18","text":"Visiting a good friend in Solon and we zipped over for girls Friday night. Super happy! Sat in bar area- had great wine and a tasty meal. I would definitely recommend this place for a good social spot to grab some good food in a cool atmosphere\nBTW- salmon is excellent. And Guacamole is pretty yummy!","useful":0,"funny":0,"cool":0},
{"review_id":"MJc0oBzvLBzgvLlPkX_qMQ","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"jYeADFgNxbtbiOMCdlIDlw","stars":5,"date":"2013-04-22","text":"Excellent! Had my car smog'd and it was perfect. Owner is obviously a pro. You're in. You're out. And $20? What a deal! I wish more service establishments were this solid.","useful":0,"funny":0,"cool":1},
{"review_id":"YBJFxn2r_nYHcsU-wjsDtg","user_id":"snBLOw_NEhslK_LSlp48OA","business_id":"bPcqucuuClxYrIM8xWoArg","stars":5,"date":"2012-07-08","text":"DELIZIOSO!!\nThis place has got the closest thing to real Italian Pizza that I've found in Vegas. The Roman style is just that- crispy and perfect flavor. Their ingredients are quality which make the price a bit higher than your normal pizza place. BUT this is NOT a normal pizza place!\nThe service is spot on- the most adorable Italian female server (forget her name) she is perfection! Ensuring your experience is pleasant with her Italian hospitality.\nOh and did I mention the wine- get selection!\nCan't go wrong with this place!!","useful":2,"funny":0,"cool":2},
{"review_id":"p-IFxfsB_B6yc1OR3aOdkQ","user_id":"gFe8deaRoQl3GVIRNj2fjw","business_id":"_T_B78LZIp_CI42SqzZ3QQ","stars":5,"date":"2017-01-05","text":"This place was a wonderful surprise! While not an upscale massage parlor, this place is so worth going to. The atmosphere is quiet and serene. The masseur was really great and gave a wonderful massage. There were three of us who got the 60 minute foot massage for $30 a person. It's so much more than a regular foot massage. Just great! Check this place out! We'll visit this place again. Make an appointment!","useful":0,"funny":0,"cool":0},
{"review_id":"JBwaD1nTVkwvVvQ4AoQkeA","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"dJsp8s2GAW5tsLWLc1BIQQ","stars":3,"date":"2016-08-18","text":"The food was a bit salty and greasy, the service was average. I didn't have to wait to get seated and it didn't take too long for my order to be served. I liked the outside patio, it is right on Kensington and I went on a weekday.","useful":0,"funny":0,"cool":0},
{"review_id":"kC4_uoHbSjsRYWmiKLiDVw","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"NBpDpXVKZOKF2wuhGEwjEg","stars":5,"date":"2016-09-04","text":"Great service, awesome food. I look forward to eating there again.","useful":0,"funny":0,"cool":0},
{"review_id":"zfT6Tjr9fja80TZTutvxkg","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"YtY3AtfF1CDHrd2xYrnfKg","stars":3,"date":"2016-08-20","text":"Basha foods has something for everyone. The place is huge, they stock all kinds of middle eastern goodies. You won't find everything you are looking for but I go there whenever I am in the North East. They can do better with their produce section, prices were better and the quality was a bit higher a year ago. There was an earwig in an apple we bought from there. The apples were delicious It could have happened anywhere but I wish they pay more attention to their produce section.","useful":0,"funny":0,"cool":0},
{"review_id":"zBYYH0Bxpu6BiD0VT5wMBA","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"KtRZwgAdlUTpLM-n5TTKag","stars":5,"date":"2016-08-16","text":"They know what they are doing. They are open late. They try their best to help. Great customer service. I have used them to register my truck and I have had them help a friend of mine renew my plates when I was out of province for work, he had the right documents and the process was seamless.","useful":0,"funny":0,"cool":0},
{"review_id":"B1oY-AqhfMDd3gl2vG6OUg","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"fyLNg6Ec5LRIBk4KWonNNg","stars":5,"date":"2016-08-25","text":"The food was excellent. The service was amazing. The staff was very friendly, they made us fresh bread. Great food for a buffet.","useful":0,"funny":0,"cool":0},
{"review_id":"79WkErgQhL5gpf2INwWbvQ","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"nA8Z8jJlqjCnD2_nd-jhxQ","stars":5,"date":"2017-02-06","text":"The bread was so fresh. It always smells like fresh bread in there. I heard of their meat pies. I will be trying them next time.","useful":0,"funny":0,"cool":0},
{"review_id":"d6_YZGhnR4QrPt15jA4m-w","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"VTAAkjpTc40FZCv9nBTAvQ","stars":4,"date":"2016-08-28","text":"The service at this No Frills was phenomenal. The prices were great. It is not the largest No Frills out there but it definitely carries lots of products. The cashier was so helpful and very well trained.","useful":1,"funny":0,"cool":0},
{"review_id":"9eG_ynlj9dVrTKJaOO7cTg","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"lCVnsj9mq-RkqlNFRies4g","stars":2,"date":"2017-04-27","text":"This is one of the worst retail stores of all times. Terrible customer service. I have been there a few times because it is right by the hospital. 2 out of 10 times you deal with people who do not want to even help.","useful":0,"funny":0,"cool":0},
{"review_id":"w31xtL0W3BbtSa7VGjPHSw","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"7LIdSY3MXJFnaaSw3ad8nA","stars":5,"date":"2016-08-13","text":"The Drop In Centre is an admirable initiative, they are extremely organised and it's very enjoyable to volunteer there, the workers, fellow volunteers and the public being served have all been, in my experience, friendly and kind","useful":0,"funny":0,"cool":0},
{"review_id":"Y6kKyjRQlceE7Be5l7zmfQ","user_id":"VT14Ye4kmqDJ73FnlALdfQ","business_id":"WhSrqG9a7u-3vxCB7Mxwcw","stars":2,"date":"2016-08-06","text":"I went there for their wings night, the wings were too dry. The service was not that great but I can't blame the waitress the music was too loud to hear anything I said. The chairs and the table were not as clean as I would have liked them to be. We had to wait for our order for  over 20 minutes and it was not that busy. The place smelled like the bottle depot. I heard good things about this place and I was very eager to try it out. Would go there again if I was in the area and nothing else was open...","useful":0,"funny":0,"cool":0},
{"review_id":"IHxaAf8IbZvf-vBJWxF2nQ","user_id":"zi7I92jqMK1L_heIbcbxPw","business_id":"4LXZzgsrM1ZyS_-uB9Od2Q","stars":2,"date":"2010-03-07","text":"A cosy restaurant with great atmosphere. Unfortunately, the meal and the service fell short of expectations. \n\nWe ordered the Roasted Beet salad- to find it came with a pile of arugula and four beet slices. Upon inquiry, the chef said that while the salad was called \"Roasted Beets\", it didn't mean that the salad would come with all roasted beets. Great for a comedy hour, but surprisingly bad laughs for a $9 salad. \n\nThe rest of the meal was good, but did not measure up to the almost $200 bill (for two entrees, three aps and a liter of house wine).","useful":1,"funny":0,"cool":0},
{"review_id":"TZon21mLv8YhTcN1tGFHrg","user_id":"ehzR89Be5vnG5RUvsO4kkQ","business_id":"gxe9WjcRYm2cSrTSS0726g","stars":5,"date":"2017-02-18","text":"My husband goes here and loves it! Kadir is very friendly and always does a fantastic job! Check this place out! Great work and great price!","useful":0,"funny":0,"cool":0},
{"review_id":"LmMpjY983VzmnnfuNFPucQ","user_id":"ehzR89Be5vnG5RUvsO4kkQ","business_id":"5OirvNAmgGn2OHf8-YN9ZQ","stars":5,"date":"2015-09-17","text":"I've taken a pair of Jimmy Choo's and just took a pair of Tory Burch wedges to JR and they both came back perfect! Service is always great! Very fast and reliable! Thank you!","useful":0,"funny":0,"cool":0},
{"review_id":"11JFqrdEaKAFX0_rKKSG2g","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"Qx2BnG2jpVV6XVFOYPfGcQ","stars":4,"date":"2015-07-22","text":"One day, my husband got stranded because our jeep stalled after putting gas in near a QT. he called me and I called several different towing services and found this one. Their towing cost was the lowest I found and not too far from where my husband was. It was a hot day. Thank you","useful":2,"funny":0,"cool":0},
{"review_id":"ZjqNlBPvXLhMsQ-0AYqg3w","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"1SGEGeYEdTpYkqz60fpG2A","stars":3,"date":"2014-06-25","text":"I'd say this place is good, they try to do well each day. The only thing is that when I order my ice coffee and nothing else, I end up waiting a little too long to get my coffee. I understand they give orders in chronologically but having to wait only for a drink and no food. I feel that I can get my drink quicker. Get the ones who only have a beverage out and on their way. You will a lot more happier customers that much more. Keep up your smiles, that are welcoming. Thank you\n\nNeed more improvements. I noticed the service is faster when there is a certain manager around. Come on people.","useful":1,"funny":1,"cool":0},
{"review_id":"pLJZlyVfH3n7iuh5XKaJ6w","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"_i8lbJrV-J61QEn7yRCEAQ","stars":5,"date":"2013-09-05","text":"I took my Jeep to this shop and within a few minutes they found the problem. What other shops could not find Johnson Automotive found it. You see my vehicle shakes when going 45-50 mph. Pep boys and two other places could figure out the problem. Johnson Automotive said it was the tire. Though the tire looked good but was bad for our Jeep. So we changed out the tire and Walla problem solved. No more shaking. Thank you Johnson Automotive.","useful":3,"funny":0,"cool":1},
{"review_id":"M7uxRfNo2LofPdwcqbbnDg","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"BZUhdg7GQJfNstUyH2BcSA","stars":3,"date":"2013-03-19","text":"I love ordering ice coffee from Wendy's because their coffee is larger than anyone other fast food joints. The medium is Macdonalds large cup.    I feel that it's worth my money.","useful":0,"funny":0,"cool":0},
{"review_id":"ZIExQua4UtXl5unTkkIS0g","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"bZI17QllLnEugZmw_7qoLQ","stars":5,"date":"2015-08-10","text":"My husband and I came this auto zone store to test the alternator, the first test it passed and second test it passed again. Later that even we came back to check it again but this time the battery was tested first with taking it out of the vehicle. The battery tested slightly low, the manager suggested to get a new battery and see if that fixes anything but my husband said no, we will get a new alternator since that one has warranty. The manager said ok, so he tested the alternator first just to see, this would be the third test, and it failed when load was put on it. \n\nTools were loaned to use and such, the new alternator put back in, immediately there was a difference. \n\nMy thing was that the manager was working with three customers simultaneously, that was cool. There was no complaint all he wanted was for all to go home happy. We came at the right time and now there is no loss time from work. Thank you so much.","useful":0,"funny":0,"cool":0},
{"review_id":"Emtok5ed7yvMmvcSuINzRg","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"6G8Wc5sthO-GR1h0YS1bMw","stars":3,"date":"2015-01-16","text":"I would love to give this place a five star but this morning I ordered a latte but when I got my order through the drive thru, I got what looked like an iced coffee. I was looking forward to some whip cream on top of my latte. I did not return to the store because I needed to get going to work. \n\nPlease next time make your\nLattes as advertise on the pictures. You'll have much happier customers especially for those who return to you. Thanks","useful":1,"funny":0,"cool":0},
{"review_id":"Der58X_ef3qzJplmNDF5bg","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"YstdDnNa6h_ms3Ys7Pz4uQ","stars":2,"date":"2013-01-23","text":"Did not like, few selections, not really cost effective","useful":0,"funny":0,"cool":0},
{"review_id":"CheTCM1ERAGseG-mIUb_JQ","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"x_4gEfC25uiX21NyYdohgQ","stars":4,"date":"2013-01-23","text":"When ever we feel like eating Chinese food, we enjoy eating at this location, we get great services, and the food is tasty.","useful":0,"funny":0,"cool":0},
{"review_id":"qrZr9XWsxNN8VIC4Mr14wA","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"Aw-Fkzq0uDEHJJZ0xBdOwQ","stars":5,"date":"2013-01-23","text":"All you can eat, the best and the cleanest place I have ever eaten at. Every single dish is delicious.","useful":0,"funny":0,"cool":1},
{"review_id":"GslNAQ1_b9Ap27lBIdp1pg","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"dNHDXn2ot4mFc2YfIFBNhQ","stars":2,"date":"2013-01-21","text":"The food was ok, the prices was too high and very few selection dinner choices. Will not return, because of false statement made of another restaurant, very unprofessional","useful":1,"funny":0,"cool":0},
{"review_id":"NtscH7IOUl04PnES_D-2KA","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"JeKPwCjObf1bwjZpBLOifw","stars":4,"date":"2015-08-28","text":"Love the new look of the store. But sometimes when I ask the employee where an item is, he or she would just point and give a look like \"damn stupid\". \n\nAnother time I stopped here to pick a few items the cashier did not greet me, she talked to her fellow coworker and still did not acknowledge me at all. I felt like I was not important. \n\nI will continue to shop here but please greet your customers.","useful":0,"funny":0,"cool":0},
{"review_id":"6RvJ5T03ewDDLKARvsVWLg","user_id":"xJIIN-QCYm4S7AJAyIhT-w","business_id":"Jhsgg9RSmI8vm5bXKJtDDA","stars":4,"date":"2013-05-22","text":"I took my Jeep in and was told my transmission was missing a gear. They completely fixed my Jeep within three days, they took care of my bill with a rental car. They stayed in contact with me about the work. They help me get financed to help pay for the work done. They also recommend I bring back my Jeep for checkups. I think they done well.","useful":1,"funny":1,"cool":1},
{"review_id":"srkfgCUltsNdnlFSEul8Eg","user_id":"AD_3upCy8cx_77i8xu_wXA","business_id":"OnGPegQGuQ5_uuFLvezvKw","stars":5,"date":"2010-04-20","text":"This was my favorite Chinese place in Charlotte. Their sesame chicken is unlike any other kinds I've tasted. This place is under new management recently and I'm still happy with all the service and the food. The new renovations look great as well.","useful":1,"funny":0,"cool":0},
{"review_id":"O2Y_yLPS-8CRIUbdjWY_jA","user_id":"QtM-sCkYw-lSdNLqgso6Ag","business_id":"tQifTiY-vutj8orxcMJKfQ","stars":4,"date":"2014-04-19","text":"Good food, reasonable prices and nice atmosphere.  A respite from The Strip.  We combined it with a look see on Fremont St.","useful":0,"funny":0,"cool":0},
{"review_id":"b6oc1Nve-QLVqMlhofIz2Q","user_id":"qCZjmcDgU363UHj8_Zm6Mg","business_id":"je5h9jV38Wpist76omY_Pw","stars":4,"date":"2017-05-01","text":"I only gave this four stars because yelp + business owners remove all low ratings and i felt my experience should be published.\n\nI'd love to provide a review of the food here, but unfortunately I can't because we never had a server come to our table.  The hostess seated us and gave us menus, and that's the last interaction we had with any employee in the 15+ minutes we sat there.  For the first several minutes we though maybe its because they were busy.  But as time went on and we were passed by numerous servers, we started to wonder if we were invisible.  For the next several minutes we amused ourselves wondering how long it would take a server to eventually come to our table, and we spent the last five minutes discussing where we were going for dinner after we left North Park Lounge.\n\nNo, we weren't in a remote corner.  We were front and center at a table that every server had to walk past to pick up their orders.  Our table was right beside the hostess station where two of them were working.  Sure, we could have gone to them and asked for a server, but that's not our job.  Besides, after waiting so long our appetite for this place had soured.  There are enough restaurants around that we don't need to help ourselves.\n\nThe purpose of a restaurant is to serve food to their customers, and this place failed us.  I have a one strike rule with restaurants.  As I said, there are plenty of restaurants, and we will opt for other places in the future rather than risk another poor experience here.","useful":1,"funny":0,"cool":0},
{"review_id":"FH8wkZE97P2-tqrhXUkRxA","user_id":"JXmma6xNkjWTEXempnDfbA","business_id":"_tINCWlo445Mh69IUtE1LA","stars":2,"date":"2011-09-17","text":"Having just come back from NYC, I was excited to check this place out with the missus after reading all of the glowing Yelp reviews about \"NY-Style\" pizza here in Toronto. Could it be true? I mean, would it really be possible to get pizza like Grimaldi's, Lombardi's, Patsy's or Ray's here in Toronto? Unfortunately, I'm sorry to say the answer is no.\n\nThe food - We both split a Bomba which is a large meatball drizzled in tomato sauce and accompanied with some fried cheesy dough. The dough was the best part though the meatball was ok. Get it if you want but nothing to really write home about. \n\nWe then ordered a large pepperoni pizza. Definitely not NY-style pizza, and definitely not the best pizza in Toronto (which, in my opinion, still ranks as: Massimo's, Bitondo's, Terroni's, Vesuvio's, Libretto's). If you happen to be up by Marlee and Eglinton and you really want to try their pizza, go ahead. The portions are huge. However, do not come with the expectation that this is the best pizza in Toronto. \n\nThe atmosphere - the place was clean and nicely decorated. The staff behind the counter were friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"EnK1NAFKDpWViNsb1eFk9Q","user_id":"JXmma6xNkjWTEXempnDfbA","business_id":"cA9LmSotIsN3C8zCI94--A","stars":3,"date":"2013-08-04","text":"Been here a few times at the Baby Point location and have been pretty happy with everything. That said, I'm a huge fan of Brooklyn style pizza (Grimaldi's, Lombardi's, Ray's, etc...) and the closest thing in this city to that is North of Brooklyn. But since they only do takeout, QM is works if you're looking for a sit down dinner. Don't know that it surpasses Terroni or Libretto, but all in all, can't complain.","useful":1,"funny":0,"cool":0},
{"review_id":"fH076Blq8e0BIFOH4jnhsw","user_id":"ogNtRQtwLlC7ryOK2SHaKg","business_id":"8VCyDz3DHrlo5TFt8T1x6Q","stars":1,"date":"2015-03-31","text":"Ordered via Eat24 app, about 20min after I placed the order I received a call from the Eat24 staff apologetically explaining that the restaurant wanted to double its delivery charge because it was a long (8ish miles) drive... I'm within what they had marked as their delivery area but I figured it wasn't a big deal and maybe they made a mistake with their map, whatever, no big deal but they should have covered it and fixed whatever issue they were having in my opinion-\n\nSo the food arrives...\n\nThe chicken fingers were ordered plain with bbq sauce on the side, they came drenched in sauce, the chicken was of good quality otherwise but the fries that were part of the order were soggy, cold, and undercooked.\n\nThe side order of 'spicy fries' were also cold, soggy, and undercooked as well as being absolutely CAKED with chili powder that was bland and not spicy in the least, they were essentially inedible.\n\nOur order of (6) mozzarella sticks consisted of five (5) mozzarella sticks, they were of average quality but one was mysteriously soggy so we were left with (4) mozzarella sticks...\n\nAny one of these I would chalk up to a mistake, it happens, I understand that. All together though, I recommend you stay away, these guys are about as unprofessional as is possible which is really saying something in Vegas","useful":2,"funny":0,"cool":0},
{"review_id":"N_4sIB6KhE7nfDSofp5PXg","user_id":"5REN2nJK5B_8jfPIYmR_Pw","business_id":"vR5Hppx__U_VXObK8VPLOw","stars":5,"date":"2017-06-14","text":"Delicious meal, helpful and friendly and attentive wait staff, reasonable prices. I really couldn't ask for more. The oyster po boy is a must have.","useful":0,"funny":0,"cool":0},
{"review_id":"pR2rpyu1mjEGKKx_9PItAA","user_id":"TyIUesIo54GONVXvaRv0Mw","business_id":"zl_DQ9PM2j6zpGD1NUN2YA","stars":5,"date":"2014-01-11","text":"Awesome vape shop!! The person that helped me was super cool letting me try a ton of e-juice. Bought the Ramune juice that tastes amazing!! Definitely a must stop for vapers.","useful":1,"funny":1,"cool":1},
{"review_id":"MGQHEg0TE-kxxl38VG5mAA","user_id":"1G7tKAJfR8J4s9BAOV0_Qw","business_id":"J7nkkWt1hIkZvqE4L5-43g","stars":5,"date":"2015-08-18","text":"Had a neck pull and let it go till Sunday.....rut row not best of time to look for chiropractor. He opened office and got me adjusted. Highly recommend this place and will be back!!  Thank you thank you thank you.","useful":0,"funny":1,"cool":1},
{"review_id":"ym4q7yFxvUrn0pjIeVkd3A","user_id":"1G7tKAJfR8J4s9BAOV0_Qw","business_id":"oPkaBoX_0hVIBV_VXp7nlA","stars":5,"date":"2015-08-15","text":"Great location fast service   Every time I go to Daves the food is consistent, hot and beer is cold. Basically all you want from bbq joint. Yes some reviews say good is salty and salads aren't that great. I wouldn't know ....I don't go to bbq place for the lettuce but the barnyard animals taste yummy!!!  Oh and buy a jar of pickles when you leave!!!","useful":0,"funny":0,"cool":0},
{"review_id":"JO7t4fVdal9B4N9JxE05zw","user_id":"1G7tKAJfR8J4s9BAOV0_Qw","business_id":"Fn_IxcCtZl1EoS81sq_s9w","stars":5,"date":"2014-09-09","text":"I order from rush street a lot probably 70 times a year. Great pizza and meatball subs. I haven't ordered much else because I haven't had the need. Oh yea I like anchovies that's a plus. It's a real mom and pop place I would highly recommend!!","useful":0,"funny":0,"cool":0},
{"review_id":"75aF6mO5uTNXOdHwzauAbA","user_id":"1G7tKAJfR8J4s9BAOV0_Qw","business_id":"1IozQKFwVu2I_u0F7CxwWQ","stars":2,"date":"2015-10-09","text":"Some things they do are really good, not great but good. when I was about done with them and moving my business to another firm, they started changing all their policies and started holding my stuff hostage.  Watch out and make sure that they send you everything.  The major problem started when they owed me 8 hoodies with company logo.  They demanded me pay them up front prior to shipping, which I said naturally said NO, keep it the way it has always been.\nThen they turn me over to a collection agent who then promises the goods will be delivered and guess what?  August 29th, turned into a typo and was meant for September 29th.  You guessed it September 29th came and went and nothing, not even a tracking number.  SO after a couple weeks they decide they want to ship COD, which again is a new policy and of course this was shipped to wrong address and magically lost, i.e. they never did the work and never shipped the goods anyway.\n\nNot a bad firm while you keep them busy but if you are going to make get away and move your business elsewhere either count your goods as lost or do it fast so they cannot hold materials and goods hostage.  \n\nAlso every once in a while I would get a blue logo on a blue shirt, which never stood out but I can chalk that one up to the $10 \/ hour worker bee...Beware get your goods first before you pay","useful":0,"funny":0,"cool":2},
{"review_id":"hRex8LZtRRugJ_AqbTZgAQ","user_id":"1G7tKAJfR8J4s9BAOV0_Qw","business_id":"XM9qnJBQ4IVdb5tr_y5TwA","stars":1,"date":"2015-07-19","text":"Pretty awful service. 22 minutes from when I walked in till I received my one donut which I ate way before my sandwich was done then received my coffee..... Completely backwards. This place is not run well but it looks more organized that frys but next time I'll get Starbucks and frys donuts","useful":0,"funny":0,"cool":0},
{"review_id":"aMoqvr7zaja4Bvl1cYvVqw","user_id":"Hn_Ap7jCWT3qR5mVqfuSTg","business_id":"Y5-xLnUY1uElittV4Ic7IA","stars":1,"date":"2013-09-06","text":"I really wanted to like this place... I went there with my husband for our anniversary. The terrace is one of the most beautiful I've ever seen, it's completely magical and it's what made me want to go there in the first place. I had the meat tortellini with rose sauce, and my husband had some too. After dinner, he started feeling sick. The next morning, he was okay, but I started feeling terrible and found out I had a bacterial infection. It's been four days now and I'm still terribly sick, I'll most probably have to be hospitalized.\n\nSo yeah, avoid this place - or at least the tortellini. I just had a talk with the owner and it would seem it's not the first time something like that happens. She did seem really sorry and I hope she'll try to do something about this.\n\nP.S.: I think the owner also works as waitress, a member here posted a photo of her. She was our waitress too. I must say she acts a little condescending and that pizza thing doesn't really surprise me. She really seems to take people for fools.","useful":0,"funny":0,"cool":0},
{"review_id":"6O8NIMzjNjyLl_T8gQTy1A","user_id":"q_a-J4pKCe3HgDuLNrBz4w","business_id":"VKHLI58XlTYTMSkxyjhU7g","stars":1,"date":"2017-02-01","text":"this place was a disgrace not only to me but to America, horrible service, horrible attitude, horrible environment. I went with my children and they sat down to take a break because my little baby's were tired and the ladies told my babies they have to be standing and wouldn't allow them to stand up and began to yell at them. I have never been so disrespected like that before in my life. I highly suggest you don't waste your time and go here i also saw one of the employees pick her nose while she was getting out brackets on so disgusting. HORRIBLE PLACE","useful":1,"funny":0,"cool":0},
{"review_id":"wkBUwzJKEVgQVvaBlJAqog","user_id":"6twsj0sYnt5qJcVBZ5Da2Q","business_id":"mDR12Hafvr84ctpsV6YLag","stars":5,"date":"2017-05-15","text":"The staff are amazing and really make you feel like family!  Kat is extra special and has a huge heart of gold :)  If you are looking for amazing food at an even more amazing price this is the perfect spot.  Great portions and flavor is on point all the time.  It is tradition for us to make this our trip home breakfast spot every time we are in Vegas!!!  The Rogel family loves Mr. Mamas!!!\nBryana R.","useful":0,"funny":0,"cool":0},
{"review_id":"xevtM7usC6Oq3-pnrgMVEA","user_id":"yTz2ehyUIFVmwvVH7p0b6g","business_id":"3p410D9YzcmgyXQWCcCPiA","stars":5,"date":"2017-12-26","text":"I'm so grateful that they opened up a Flavors of Louisiana in the East Valley.  It will save me the trouble of driving my family in rush hour traffic for dinner in Avondale.  It was and is worth the drive.  This new Flavors of Louisiana is more of the same.  Best Cajun food in the Valley period.  Just finished dinner there this evening and every dish was fantastic.  We ordered etouffee, boudin, jambalaya, fried green tomatoes, gumbo, a shrimp po boy, and beignets.  Each dish was a perfect example of fine New Orleans fare. Their remoulade is some of the best I've ever had and even their fries are exceptional. The service was perfect, which is all the more remarkable for a restaurant that just had their grand opening.  We met the charming owner and he took the time to tell us all about the place.  He's a true ambassador of Southern Hospitality that is oft hard to come by in the West.","useful":0,"funny":0,"cool":0},
{"review_id":"kWSqijLgbcssz1MNo523wA","user_id":"9pnaydmg6jc1EZystjEaeA","business_id":"30Q5xBagQHmkwp8Q9I1FCg","stars":5,"date":"2013-04-25","text":"Took my niece here for lunch, thanks to Groupon bringing it back to my remembrance. We had jerk wings, curry shrimp and jerk chicken plate and festivals. \nEverything tasted fresh, well presented and DELICIOUS! I love that their food is flavorful and spicy, like caribbean food should be.\n\nThe atmosphere is cute, with reggae music playing at the right volume and slightly corny island themed decor. Perfect ;-).\n\nI love Ocean Blue and, unfortunately, realize just how close it is to where I live...I'll be trekking over for festivals and fresh made patties on the regular.","useful":3,"funny":0,"cool":3},
{"review_id":"_cz6uLmSQ0N6JCZHookAdg","user_id":"LwgExnxUPg6Beyn7JRVAvA","business_id":"vUhxuFgKCZn6cTZePbhd6g","stars":5,"date":"2014-07-23","text":"This is easily my favorite Starbucks in Charlotte so far. It's the only location that has asked for my name like they're supposed to, especially when they're busy. (the first time I visited, they didn't, but it seems they were on it the second time around). The staff are friendly and they do a great job with the drinks.\n\nIt's also the most unique Starbucks I've ever been in. Located in an old house, it's not anything like the other Starbucks, other than the counter of course. There is so much seating here, too.\n\nI would only complain about the floor outlets as they don't seem to work for charging your computer. But no other Starbucks I know of has floor outlets. I don't think Starbucks intended people use the floor outlets; I think they were just there previously before the Starbucks moved in. The wall outlets work great. \n\nIt's a busy location, just so you know. You can expect a little delay in your drink but that happens with the business.\n\nThey don't have a drive thru as there's no space for one here. That's not a big deal for me, however, because I take the bus anyway. Public transit is pretty good in Charlotte, though it does tend to run a bit later than scheduled. But buses run late at night as well as the light rail. I would recommend getting to this Starbucks via public transportation just because the parking looks like it could be a little crazy. It's not far from the East\/West Blvd Lynx light rail station and it's just one bus ride away, just take route 25 there. \n\nI still want to check out the Steele Creek Starbucks as I've heard good things about it but I think the East Blvd Starbucks will be my regular Starbucks from this point on.","useful":0,"funny":0,"cool":0},
{"review_id":"HuzjxYya-9gEvyrdeNpK8Q","user_id":"LwgExnxUPg6Beyn7JRVAvA","business_id":"g-E12y45gBKedax5N20YmQ","stars":5,"date":"2015-02-04","text":"is is the best burrito place in Charlotte I've been to so far. It's the only place around i know of where i can get a California Wet Burrito. You can't find these things too many places outside of southern California.\n\nThe salsas are excellent!  \n\nAs someone who has tried many burrito places in San Diego, and recently moved to Charlotte, I highly recommend this place!","useful":1,"funny":0,"cool":0},
{"review_id":"6bgY43UAN55BHlYk8uE4qQ","user_id":"LwgExnxUPg6Beyn7JRVAvA","business_id":"Rx6PF3O6Q8pJz8dLMJZfKQ","stars":4,"date":"2014-07-19","text":"It appears that while the Whitehall Location is remodeling and I've relocated to this Starbucks to hang out, they have upped their game from my previous review.\n\nWhitehall is still my favorite (and I look forward to seeing it after the remodel) but the staff here at this location are now much friendlier than my previous visits here. Also it appears that the speed has improved! My drink was made in a timely manner today!\n\nI don't know if there was a change in management or what, but I'm now quite a bit happier at this Starbucks location!","useful":0,"funny":0,"cool":0},
{"review_id":"CAOd-VfKq-Jv8-SXwMD5Tw","user_id":"LwgExnxUPg6Beyn7JRVAvA","business_id":"3vSYu180m7yhOD_qaQUCTw","stars":5,"date":"2014-07-23","text":"The staff here were very friendly! I had a free drink on my card and the barista gave me a suggestion of something to add to my drink, too! Awesome job! \n\nI think out of all the Starbucks locations I've been to in Charlotte, this and East Blvd are my favorite locations.","useful":0,"funny":0,"cool":0},
{"review_id":"JNeyxUEKOqwpp5XiJpxngw","user_id":"u3ovgqpMrEu7jxJL76G_Pw","business_id":"L9pTWWAATj7HoLaRe6ZA1Q","stars":4,"date":"2016-09-03","text":"Great food and the service was outstanding! \nThe only complaint was that while eating in, the noise\/ clanging from the guy at the grill was so loud it was hard to carry on a conversation.  I'll be back for sure but maybe to go.","useful":0,"funny":0,"cool":0},
{"review_id":"UQ3unIaq1AdF5h_6h7f6rQ","user_id":"u3ovgqpMrEu7jxJL76G_Pw","business_id":"QMI6A2H1N3SwKU69SiASJA","stars":5,"date":"2016-11-20","text":"Great food,  excellent service. The couscous was made just right... So light and fluffy and the beef was so perfectly tender it fell apart with a fork.  Will definitely go back!","useful":1,"funny":0,"cool":1},
{"review_id":"xX3U3pnAXG6zKofHX9JwaA","user_id":"9OQiUmJ24xffQDz7MmHlPQ","business_id":"yuprwDG3OCIgxIJp7CZxNQ","stars":4,"date":"2017-04-14","text":"Getting my eyes checked found out what has been bothering my eye now getting proper care for them.  I am getting good care for my eyes","useful":0,"funny":0,"cool":0},
{"review_id":"mHfPCBf9LywCEe53kp0u8g","user_id":"07jp_KJ9Ov7thDnjCe0s9w","business_id":"Se-co1eXBho5A4YwMfKMIQ","stars":4,"date":"2017-10-18","text":"This is one of my favorite little breakfast spots in town. Their pancakes are amazing, the coffee is strong, and the service is pretty good! The only thing I don't love about it is that sometimes the people working will congregate near the drink fountain, and some of their conversations can get a bit inappropriate. They look like they're all in high school or college, so I understand that kind of behavior, but it would be nice if it wasn't out in full view of the patrons.","useful":0,"funny":0,"cool":0},
{"review_id":"ZDwJKZNzSzsW_nXULHlAfw","user_id":"07jp_KJ9Ov7thDnjCe0s9w","business_id":"1cfbdSIgqPqApuxNww51Og","stars":5,"date":"2016-06-17","text":"I have been going to Karla for a couple of years now, and can personally attest to the long term difference that MFR massage makes. Karla is very skilled and knowledgeable, and makes me feel completely comfortable each time I go. Not only do I feel better after each massage, I also see long-term benefits as well. I was in a pretty bad car accident a few years ago and have struggled with chronic back and neck pain. However, working with Karla has helped me bring my body back into it's regular alignment and experience many more pain free days. \n\nI will absolutely continue getting body work with Karla, and wholeheartedly recommend her to anyone!","useful":0,"funny":0,"cool":0},
{"review_id":"ff-r8ykt2_jSQpmqi6tVVw","user_id":"07jp_KJ9Ov7thDnjCe0s9w","business_id":"4mb32UmQULqg7IMck28vog","stars":4,"date":"2017-10-05","text":"This place is completely fantastic. My favorite order is the carne Asana gringos taco and a blood orange margarita. Their churros are the best way to end the meal, too, if you're feeling like a cheat meal is in order!","useful":0,"funny":0,"cool":0},
{"review_id":"WGr42H4JWzCemB9suHpBGQ","user_id":"07jp_KJ9Ov7thDnjCe0s9w","business_id":"TCEOq0IoCW76Z7J9jwED9g","stars":1,"date":"2017-10-18","text":"Honestly, if I could give this company 0 stars, I would. I had a couch that had some pet dander on it, so I needed it cleaned. I called and got a quote for $39 for a full shampoo of the couch and ottoman, plus $15 for a stain guard, and set an appointment window for 2-4pm. At 4:15pm on the day of my appointment, I called to see where the technician was, and was told \"Oh, he's running a few minutes late, can we reschedule?\" Um....no, THIS was the time I had available. Long story short, tech doesn't turn up until 5:40. \n\nThen, he looks over the couch, tells me it will actually cost $400 to clean it, and tries to get me to sign a paper that had the total amount blank, as well as sign something stating I was happy with the service....before he had even done anything. I told him I wanted to just the cleaning I had requested and for which I was quoted, and I wasn't going to pay any more than the price I was quoted, despite his protestations of, \"But it might not look\/smell right,\" and his assurances to work with me as long as I could tell him \"what is the maximum amount you're willing to pay?\" \n\nAfter about 10 minutes of this ridiculous run around, I told him to get to it with the cleaning I requested or he could leave. It took him almost half an hour to clean it, which normally would be fine, except he was very obviously going slowly, which just annoyed me. \n\nThen, once he finished the couch, he had the audacity to begin asking me questions about my personal life, like who the people were in photos I have up in my living room, if I was seeing anyone, how long I had been in a relationship, etc. I was absolutely appalled at his behavior, from start to finish. To show up late, try to get me to pay for services I don't need or want, and then to violate my safety by hitting on me in my own home is completely unacceptable. \n\nI will NEVER use this company again, nor will I ever recommend them. I was beyond disappointed and angered by how I was treated.","useful":2,"funny":0,"cool":0},
{"review_id":"HP6NEsv8ePTtmYqgaDZ87g","user_id":"ylC0zE1JoF8wfApsveqPRg","business_id":"IImZFNzX4cP84rFsyb-9mQ","stars":3,"date":"2017-04-25","text":"Nice atmosphere and reasonable prices. Food was just ok...not bad but probably won't be in a hurry to come back. Restaurant was empty but they had the check on my table before I put my for down...wierd service.","useful":1,"funny":0,"cool":0},
{"review_id":"bhwtJtIrrxdaB5ND1p7Fiw","user_id":"rCxEHnTep-ep8fba-k11nQ","business_id":"FXPywtnz2Tt_ko03dqxLBQ","stars":5,"date":"2017-11-20","text":"Danny\/Jeff are excellent at what they do & provide value, service , trust in an industry where at times it is lacking.\n\nJeff knows BMW's inside out & Danny with his customer service skills have ensured that as long as I owe an BMW Babbitt is where I go.","useful":0,"funny":0,"cool":0},
{"review_id":"1xvQgdiBnoozLA87d_2S1A","user_id":"eeplUKjBprdaXTRhoJeChg","business_id":"Jxi4Jb7yp-QfYUeUaXaYKQ","stars":5,"date":"2013-07-02","text":"Wow.  We just happened upon this restaurant--with the help of Yelp.  What an amazing experience.\n\nThe food, the ambience, the attentive staff were all wonderful.  I loved the atmosphere--it was small, intimate and cozy.  The food was amazing, sensitively handled, with subtle flavors that celebrated each dish.  The staff were very attentive and easy to converse with.  \n\nThe chefs are to be congratulated!  It was so apparent that they love to create unique experiences.","useful":0,"funny":0,"cool":0},
{"review_id":"TChbRrPPToktohK9Iz4pyg","user_id":"BXM-uWnlcJhjd-ye5okOKA","business_id":"k2b3niokS_tosjah_rzCPw","stars":5,"date":"2015-05-17","text":"Best pizza in the north west area,if you like pizza from NY or NJ. Which I do! Born and raised on the easy coast,I didn't realize how good I had it when it came to pizza! Moving out to Vegas,I found out fast the pizza out here was pizza pretending to be pizza lol or trying.. Now Rocco's pizza by red rock is VERY GOOD! Mmm. BUT..it's far from me.","useful":0,"funny":0,"cool":0},
{"review_id":"SeYJ9BaO-3fePlrC_bxoWA","user_id":"t6tXMf9_3_TnB-T46LEjcA","business_id":"RvG07zPC9O_g9GXA5Lt9gQ","stars":4,"date":"2017-09-06","text":"We love coming here! Always delicious! I get the blended green tea and I'm never disappointed","useful":0,"funny":0,"cool":0},
{"review_id":"aW2gbc-0cWzbxiacSnMDVA","user_id":"t6tXMf9_3_TnB-T46LEjcA","business_id":"BOD0yRkakyxXzJmbVVAxSA","stars":5,"date":"2017-07-29","text":"This place has such a cool vibe!! And the DJ was amazing!!! Would highly recommend! Plus I have a gluten allergy and they were extremely accommodating!","useful":0,"funny":0,"cool":0},
{"review_id":"W9CY4p2wVZ4Oa61JmckQyQ","user_id":"t6tXMf9_3_TnB-T46LEjcA","business_id":"hRK876bEBdPYAJKbg6pCEw","stars":5,"date":"2017-07-29","text":"Had a WONDERFUL time today hanging by the pool! Great service and staff! Meet Dragan the bartender who was AMAZING! He was friendly, funny, & so polite!!! \nMacy was our server for the afternoon, who was always on top of our orders & made sure we were having an excellent time! Plus she was such a doll to talk too!! \n\nThe Fairmont is probably the most gorgeous resorts I've been too in the valley! I was telling my Hubs that this is what you think of when you think of a resort! It's lush landscaping, gorgeous pools & pods (those Lilly pads ) and beautiful unkept buildings! Nothing was rundown or \"old\"","useful":0,"funny":0,"cool":0},
{"review_id":"nbz58twK-EprbbcsAZRW0A","user_id":"t6tXMf9_3_TnB-T46LEjcA","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":5,"date":"2017-07-29","text":"We adore this place!! The gluten free crepes are to die for!!! We always have great service and  get seated quickly. We have had a few issues with our orders but they are always willing to go above and beyond to make them right!!! Which we highly appreciate!","useful":0,"funny":0,"cool":0},
{"review_id":"23Q8iqbbErxKaUD8UmZkow","user_id":"I0eaaSzalrXbv0dYE02bLQ","business_id":"dhvePGMLjWvl4fhk9lgxew","stars":5,"date":"2017-12-12","text":"I've been here twice and loved it! The first time was a year ago and Civil Liberties left a great impression as the bartenders crafted individualized drinks based on our descriptions of what we liked. There were about 6 of us the first time and we all loved what we got. After that first visit I was looking for a reason to come back. Went back again last week and it was as great as I remembered. I got a mezcal based cocktail and my friend ordered one of their craft beers. The drinks were great. I love the vibe of this bar. Can't wait to venture back when I'm back to this part of town.","useful":0,"funny":0,"cool":0},
{"review_id":"L6nPUsCg2P7_tURVq4oJ1g","user_id":"I0eaaSzalrXbv0dYE02bLQ","business_id":"gtcsOodbmk4E0TulYHnlHA","stars":5,"date":"2017-12-12","text":"Came for a drink with a friend last week. We were just bar hopping through the neighbourhood and came across Northwood. I loved the cozy feel of the bar. Our waitress was great. I wasn't sure what to drink and she recommended a gin based drink with thyme, I think the Choupette. It was AMAZING! I go out for cocktails regularly and I must say I loved this one! My friend got a classic old fashioned which was also great! Can't wait to come back and try more cocktails!","useful":1,"funny":0,"cool":0},
{"review_id":"z6Ac--ak5Qs8mQHCJzYKSQ","user_id":"I0eaaSzalrXbv0dYE02bLQ","business_id":"DQf63-KJ25m-kDIMto614g","stars":5,"date":"2017-12-12","text":"Came for Sunday Brunch. Arrived 5 minutes early and there was already a line. Luckily I got seated right away. My friend and I ordered a latte and a ginger tea. We shared their baked eggs of the day, the rajasthani eggs and a half order of their french toast (stuffed with brie and sour cherry). My only regret was not taking a picture before I ate! The food was delicious and fresh. I loved everything we ordered. The regularly changing menu of specials will keep me coming back regularly! The meal was pretty cheap considering how much we ate! Highly recommend this place!","useful":0,"funny":0,"cool":1},
{"review_id":"2jDVIz9dB9hr0lBQsbxKww","user_id":"NUTbTgL9QvOUkzl7Vt9T5A","business_id":"7JnFDiJu9cmOr3X_az0VnA","stars":1,"date":"2015-12-29","text":"To a dish, everything tasted as if it was previously frozen. Service, marginal at best. Value, non existent.","useful":1,"funny":0,"cool":0},
{"review_id":"l4CR5CWfyoZCnUu2wB9A1w","user_id":"g93o6YThieCI3zlknkNZaw","business_id":"vAXlIzBMGaw-Oqjq1DMuKQ","stars":2,"date":"2014-09-11","text":"I don't see what the big hype is about this place I went here one time n got the chicken cheesesteak I didn't like it. Then my co workers told me I had to get the one they are know for which is the bobi I guess. N I tried it. It was still not good. N in top off it was a chopped up turkey bone in my sandwhich which scratched my throat n I almost choked on n died. N the staff wasn't nice when I walked in there was no one in line it took him 3 minutes to even look up from the grill n notice I was there.","useful":0,"funny":0,"cool":0},
{"review_id":"aKJl2p1zyT4Rujzvj0Y4zg","user_id":"g93o6YThieCI3zlknkNZaw","business_id":"GSiAgRigPwSvXeR7emLSiw","stars":4,"date":"2014-09-11","text":"When I came here back in July for my birthday it's was fairly late maybe 8:30 at the latest we were sat n it literally took us 30 minutes before our waiter came to take our orders! We later found out that he was the bartender and the waiter.  Which is ridiculous the bar had about 5 people sitting there he had to serve n one lady was talking his ears off which took us forever to get our food. That wasn't his fault, it's red lobsters for being cheap and understaffed. That's the reason I took a star off other then that it was an okay visit the waiter was pleasant it just took forever. I also went here last night for the endless shrimp we got there at 9pm. We had an amazing waitress her name was Fabiola. She never let our glasses get empty , she was very nice, and she kept our shrimp coming at a steady pace. Even after 10 when the restaurant was closed she still let us order another dish. When I come back to red lobster I'm defiantly going to ask for her to be my waitress.","useful":0,"funny":0,"cool":0}]