[{"review_id":"1trd4N7gDjvy0MQdOKt58A","user_id":"hoKqUvmU9iz_p6HsYdJmdw","business_id":"Dcu698L9WArPRc9mAYrAzA","stars":5,"date":"2016-09-16","text":"They have a short menu that doesn't offer much if you don't like raw fish. But what they do sell is fantastic. I had the sashimi bento box. All the nigiri was stellar, very fresh and flavorful. The shrimp tempura was cooked perfectly: The shrimp was tender and not at all rubbery, and the tempura coating was delicate. For dessert, they gave us a couple complimentary bites of honeydew melon. Prices were very reasonable and service was prompt and friendly. Some Japanese ladies were eating at the table next to us -- not a perfect sign of quality and authenticity, but a good one nonetheless. Highly recommended overall.","useful":0,"funny":0,"cool":0},
{"review_id":"vvcxmKkpstzpZooyxZF27w","user_id":"NaND5HsXbwQJQOjH2AtXIA","business_id":"2Wff1lKhXu56Rdsf0omDGA","stars":4,"date":"2014-01-26","text":"its a good location with awesome food , the taste of food is great  and its connected with a dancing hall at the backside with a wide variety of programs everyday...the service was exceptionally good..","useful":0,"funny":0,"cool":0},
{"review_id":"JTYalRBrz0QkZPxsNc9A3g","user_id":"NaND5HsXbwQJQOjH2AtXIA","business_id":"ebhkQpSusPpPgZLU1a_HxQ","stars":4,"date":"2014-08-10","text":"I was so pleased of the environment and service.The quality of the food is so good.\n\nI seriously recommend this place if u want real south indian flavour .","useful":1,"funny":0,"cool":1},
{"review_id":"RMAJ9k2wHgO6VREUXkFGJg","user_id":"NaND5HsXbwQJQOjH2AtXIA","business_id":"WNnrNto5bLcamqzL5gZZCw","stars":1,"date":"2014-11-25","text":"Worst food quality.. If u want a proof go to this place on monday and tuesday they will be giving all the left over food from weekends.dont see and decide taste it.","useful":1,"funny":1,"cool":0},
{"review_id":"u-_iMw0Wf3LW4cnFd1O38w","user_id":"NaND5HsXbwQJQOjH2AtXIA","business_id":"lf1wqczeKUz5iyQn7J7sBA","stars":5,"date":"2014-01-11","text":"grt place  , especially friday nights r awesome...the people and the environment is awesome..","useful":0,"funny":0,"cool":0},
{"review_id":"TsnQ6WvyYQvYiEvndDJgRQ","user_id":"NaND5HsXbwQJQOjH2AtXIA","business_id":"GM3_MoAgPcyE1ozWxjy-XA","stars":4,"date":"2014-02-15","text":"good place in scarborough where its decent place for drinks with food and dance , especially on friday nights...","useful":0,"funny":0,"cool":0},
{"review_id":"reqrXJDYcn3cmaCF1A63WQ","user_id":"P1XBBaKOT-M0jKS7oLF9HQ","business_id":"pyqnGlIfP9Zw8LLxBjyAiA","stars":2,"date":"2017-10-29","text":"I have always wanted to try Nobu and I was completely let down.  We went to Vegas for my sister's 40th and got a reservation at Nobu Friday night.  They sat us at this square table in the back with no atmosphere.  Service was super slow and our server was nowhere to be found most of the time.  Average tasting rolls and a huge bill..... not good for a group.","useful":0,"funny":0,"cool":0},
{"review_id":"YuftGNAh_lnRxUS5xG0WeA","user_id":"yBaFeS8DsABlaiVax1Chog","business_id":"pJGfdoRYWqBU1aVfxWvThA","stars":2,"date":"2015-05-19","text":"We were looking forward to a cold beer and found ourselves at Boulder Dam Brewery.    Had the Pale Ale.    Found it strangely flat and served cool, not cold.  :(  wings came to the table overcooked and rock hard ...but chips were good !","useful":0,"funny":0,"cool":0},
{"review_id":"UnTnCfhqC8q32qfMHzJTwA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"W4dPWczZVbRf2WH5qGXrmA","stars":3,"date":"2016-02-29","text":"the food is tasty, but the restaurant was so dirty. I got free ice tea with my lunch combo, but couldn't get myself to drink it after I saw the container it was in.","useful":0,"funny":0,"cool":0},
{"review_id":"i6R1QcWBQHmHmbefmAgI8w","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"9TCzxlrOZSIFcBlvHIUgFA","stars":4,"date":"2016-02-23","text":"so far, pepero korean market is my go to when it comes to korean food. still looking for good korean food around charlotte.","useful":0,"funny":0,"cool":0},
{"review_id":"FBU4yi9Tqivf3B6rKg-CaA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"H3seUzUzMvIPB92OP8yT_w","stars":2,"date":"2016-02-23","text":"oh my.. our second time here and this restaurant is always crowded, super dirty, and not sure why, but always full of obnoxious customers with potty mouths.  I have 2 little ones and couldn't eat comfortably.","useful":0,"funny":0,"cool":0},
{"review_id":"Orn8QOMLctt_jiZNBTd4Lg","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"RoyywlTNAmM8dJcibAr1rg","stars":3,"date":"2016-02-23","text":"I went during lunch and everything was fresh. however,  the restaurant was not very clean, the bathroom smelled and our table was sticky..","useful":0,"funny":0,"cool":1},
{"review_id":"txh3HPD_872RWjBqlRg4xA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"Jk_9H-N-EwZguRWUCt8ZbA","stars":4,"date":"2016-02-29","text":"we pick up our dinner here once in a while. the dishes are good, but we substitute our fried rice for steamed rice. the only bad thing is, the wait is long during dinner time.","useful":0,"funny":0,"cool":0},
{"review_id":"JNXAJYZEIp0Az1AbLJp98w","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"LKuzbx5Yt3yqiokUFdjVhg","stars":4,"date":"2016-02-23","text":"food was decent, but the price for Korean\/Chinese food was too high for the amount of food we got. we spent $60 for 2 kids and 2 adults and no one came out satisfied :( really wanted to give 5 stars cuz the service was great, but it was not worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"bdNr38FdDE58oZMNVlbHmg","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"yesClkCZlpLGTYZROkx4SA","stars":4,"date":"2016-04-12","text":"saw them on food network so we wanted to check it out.  super eclectic decor with great service. the food was ok. I'm glad we stopped by. would love to check out their other dishes.","useful":0,"funny":0,"cool":0},
{"review_id":"xmthk2VfBMy-R0V7-3f5Nw","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"56HZLqQOcS1FSXqYG-3vLg","stars":5,"date":"2016-02-29","text":"great place to go if you love outdoor adventures. zip lining, kayaking, water rafting,  hiking, etc... haven't tried the restaurant yet, but will be going shortly to check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"ysnEknyimxpIPFTOdYiVsw","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"6kq9oLduJAYkb2WjAb36KA","stars":4,"date":"2016-02-23","text":"I love their sandwiches but the Plaza is really dirty.  I'd go all the time if it was located elsewhere.  hope they open another one somewhere safer and cleaner.","useful":0,"funny":0,"cool":0},
{"review_id":"XwXukF5sx4AxHGlaMtLthw","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"COKSA2i-9GVwKjCu5jI8Ew","stars":4,"date":"2016-02-23","text":"I love coming to this particular chicken king because the front counter girls are great. I enjoy their service more than their food. that being said, the foods not bad either. just simple home style cooking. nothing fancy.","useful":0,"funny":0,"cool":0},
{"review_id":"HkPdDB7dcvB5zwHWkOiSDA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"Oy2WnPyiOlPFvPKMIuOC8w","stars":3,"date":"2016-04-12","text":"heard great things about tin tin, so we went for dinner on a Wednesday night. other than the crabs, didn't feel like it was anything special. just another Chinese buffet with a few unique dishes. I felt like they had other items, but no signs or descriptions on how to order from the lady behind the counter. stood there for a minute to see if someone would ask me what I wanted, but that didn't happen either so I decided to skip it. overall experience was not bad, but will not be going back.","useful":1,"funny":0,"cool":0},
{"review_id":"Q--p7KuAPYcBN96U4QTPgA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"VYp2vOy8n8OSeFsngKRwsw","stars":4,"date":"2016-02-29","text":"this is our go to pizza joint for Friday dinner and movie.  haven't had a bad experience yet.","useful":0,"funny":0,"cool":0},
{"review_id":"uW7Lzrtuu75rtltMfu8XWA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"qCSWNJ2ClIaO5XTfzsiYFA","stars":4,"date":"2016-02-29","text":"good service, friendly environment, good food.  it's more tex mex. not authentic mexican food. the wings however were terrible. it tasted like it was ketchup based, not hot sauces at all.","useful":1,"funny":0,"cool":0},
{"review_id":"qrPKG3fKCBwKmRxez-g5Ng","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"KHXurEsX7zv3nIJ9kY2XnA","stars":3,"date":"2016-02-29","text":"drive thru pick up order. service was good, but the veggies were too sweet and not enough rice to balance out the flavors. I just don't like super sweet food. I save that for dessert.","useful":0,"funny":0,"cool":0},
{"review_id":"2QUgUiwP3DIXTbmXwGDpwg","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"L_RotH31jKbxf32WBrw43A","stars":4,"date":"2016-02-23","text":"we had it to go, so that being said. the pho was good because we love it piping hot.  we boiled the broth and the meat because it was dripping with blood.  the sandwiches were ok and a little over priced.","useful":0,"funny":0,"cool":0},
{"review_id":"rsF5wPr9DP-vanoL38T5Kw","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"rT2ownx0bn2Wfve3iYHLxw","stars":3,"date":"2016-04-12","text":"I got chicken salad.  I loved the salad. It was fresh, however it was lunch time and only 2 other customers were ahead of me, but it took over 20 minutes to get my salad.  They were extremely slow and didn't seem to care.","useful":2,"funny":0,"cool":0},
{"review_id":"D8iMOtL-ns_RkXAWO4DdQg","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"bHWUajFY-fHtNXTRnXh1TA","stars":4,"date":"2016-04-12","text":"we've been here several times and never had a problem. the drive thru gals are always friendly, out going and professional.","useful":0,"funny":0,"cool":0},
{"review_id":"IXUiyZ1fEg1CpC6xUicObQ","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"34lgzV2XYAKjl8dt8olYMA","stars":3,"date":"2016-02-23","text":"from l.a. so my palates a little spoiled when it comes to korean food.  food here does not taste traditional.  it's very bland.","useful":0,"funny":0,"cool":0},
{"review_id":"NchPbZQZPnBJDA8KabiuOA","user_id":"Yc4j_tfkkgKaT6J_hPU26Q","business_id":"5li4Wxd__uYGrgB8_n_uzw","stars":4,"date":"2016-02-29","text":"our family enjoys take out from here. we get 1 meat dish and 1 noodle dish for the 4 of us. we have lots of left overs for the next day.. :)","useful":0,"funny":0,"cool":0},
{"review_id":"WVWgTA1HxZV54xEmDqK3pQ","user_id":"TA7ncge3WfxmLAbpv3S4sw","business_id":"bjllusUsLq9zE4yZnLpOzg","stars":5,"date":"2016-07-16","text":"Our first time here and I'm so glad to have found this awesome place! I had a lamb gyro; which was absolutely amazing! The lamb was so tender and flavorful it about melted in my mouth. The cucumbers, lettuce, tomatoes and onions were so crisp and fresh, it was perfect and hit the spot on such a hot day. I ordered the rice bowl, but the owner accommodated me and let me substitute it with the gyro wrap. The stuffed grape leaves were excellent too! Had a nice piece of baklava for desert and it too was fantastic. I've found my new place!","useful":1,"funny":0,"cool":0},
{"review_id":"UhB5PJvv_pgcJ7abGbsLgw","user_id":"jSnS5RfKTspAXs8RLcbpZQ","business_id":"t6RLptyqKK0uxcmH15Geag","stars":5,"date":"2017-01-22","text":"Foods good very friendly workers can't wait to come back again to enjoy legit Thai foood!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"eS3EeUtHigpNH6NXourQwQ","user_id":"nCaWaE9egGXkNBEnkKulkA","business_id":"4hl9R8kNim-Pr0yWJoqjMw","stars":1,"date":"2015-03-27","text":"Dr. Handler scarred me for life.  I would' send my dog to him.  You are better off going to Mexico!","useful":0,"funny":1,"cool":0},
{"review_id":"kv5r1Slald6hgH_hoFgz6Q","user_id":"UxFq1dDRwpqw9Tcr5fWMsg","business_id":"jeTvVMOR8W_04xFsPjzOEQ","stars":5,"date":"2017-07-19","text":"Nathan, Gavin and Daniel were the bomb.com. They moved my 3 bedroom 2 bath house in basically 2.5 hours not including the drive. From the thorough appointment setup process to the execution Camelback Moving is the best. And I've been scarred so many times from other moving companies. I thoroughly enjoyed having them on our big move day.","useful":2,"funny":1,"cool":0},
{"review_id":"QL9C9HOw8dfGq9aLs7Zk6Q","user_id":"UxFq1dDRwpqw9Tcr5fWMsg","business_id":"zLsgXEuw0jaiQgZmLWUtFA","stars":5,"date":"2016-01-09","text":"Eating a whataburger. It's fantastic. Haven't had one in years. It's a perfect compliment to a football game that may be a blowout. My burger had no less that 8 pickles on it. I'm sick of this one pickle bullshit. The bacon could have been thicker, but this burger was easily 1.8x larger than a McDonald's burger. French fries could have been crispier but the had a good flavor. And they offer spicy ketchup. What a burger","useful":0,"funny":1,"cool":0},
{"review_id":"lqR808rlKDpuS44XJ4KmAg","user_id":"UxFq1dDRwpqw9Tcr5fWMsg","business_id":"Qt7EOWunbxf16Gstm1KtVw","stars":5,"date":"2017-07-25","text":"Dr. Rubenzik is great. Nice, thorough and charming. Her assistant Danielle was fantastic as well. Funny, intelligent and sassy. Can't ask for much more at a dermatologist.","useful":3,"funny":0,"cool":3},
{"review_id":"qdcbvC3dvGrhrQq7NzpuwQ","user_id":"UxFq1dDRwpqw9Tcr5fWMsg","business_id":"W8tAlPUg8XkT5Itw_8xPhg","stars":5,"date":"2016-02-23","text":"Perfection is not something that should ever be attained. But my experience with Boojum Tree since day one has been just that. I find it hard to believe anyone that visits this venue will be able to walk away from it without finding it beyond gorgeous. We visited several venues (including ones that priced themselves much higher) and Boojum Tree is clearly the cream of the crop. However, the best part of Boojum Tree was my interaction with Jennifer. You don't realize when you're starting this that you're not only selecting a venue, but you're also going to have a lot of interaction with the venue's coordinator or in this case GM. My wife describes her as thebomb.com and I simply appreciated and thoroughly enjoyed every conversation wit her. She was timely, respectful, friendly, sharp, hilarious and just a blast to be around.  I will sincerely miss communicating with her all the time but I still intend to bug her just because she is so wonderful. She gave me the best set of vendors to work with and the whole wedding went off like a well-oil machine. We were able to customize so much to make it our own but it wouldn't have been possible to achieve that level of perfection anywhere else. Boojum Tree will forever hold such a special place in my heart. If I ever find myself driving by the area during an open house on Tuesday night, I'm just going to pretend I'm getting married all over again to experience it's atmosphere. THANK YOU FROM D&B.","useful":1,"funny":0,"cool":0},
{"review_id":"nj_HgFgnki_VZ2ckbQYVhw","user_id":"UxFq1dDRwpqw9Tcr5fWMsg","business_id":"qEY6ceR1HVogrvcQuKHnBQ","stars":5,"date":"2016-04-11","text":"Travis was our driver and he was just great. Fantastic attitude. Very genuine and nice. He followed all the rules but still made sure we had a good time. He's definitely the type to go above and beyond for others. Thanks again for making my birthday great!","useful":0,"funny":0,"cool":0},
{"review_id":"lWSkLp9hmsjAMuvUwcwz0Q","user_id":"Cgy63dNbG_juXVFXGRGaDg","business_id":"S-oLPRdhlyL5HAknBKTUcQ","stars":5,"date":"2017-10-01","text":"This is the best sushi I have ever had in Phoenix!  The quality of their fish, menu variety, and prices are unbeatable!  My bf brought me here after reading some yelp reviews but I was extremely skeptical.  After moving from LA about 3 years ago, I have not been able to find a good sushi spot in Phoenix.  Ive tried so many places guided by yelp, but was always disappointed.  Luckily, we stumbled upon this gem!  Everyone was so friendly and the service was amazing! I work in the restaurant industry, so I am definitely a critic when it comes to good service.  The owner, Juno, was so personable and genuine, he really made our night special  The staff was accommodating and knowledgeable about the food.  This was certainly the cherry on our evening.  They use purple sushi rice for their rolls and nigiri, which is much healthier than plain white sushi rice.  I was a little hesitant when I saw the purple rice, but it was delicious!!! My bf earned many brownie points for finding Harumi.  They also have a location in Scottsdale called Kodo Sushi that we will definitely be trying. Must try this place!! You will not regret it!","useful":0,"funny":0,"cool":0},
{"review_id":"aOzcr7ICWJNZDecovjoxsQ","user_id":"BR3JBUu3DHSUo9tbymYhqg","business_id":"cdpiHHignnk8hVcPEiYzMw","stars":4,"date":"2015-04-10","text":"Wife had the veggie burger said it was very good. I really liked the pizza crust. The sauce was a little sweet for me but still very good. I would order again.","useful":0,"funny":0,"cool":0},
{"review_id":"Acsru0sl4BzngjjjJC4ntQ","user_id":"GzUlQLbfzLG5o_pwuRcYBw","business_id":"9bO59CesgJPE9JIzRqTBog","stars":5,"date":"2012-08-21","text":"This is a great little motel. It's clean, with recently renovated rooms in a modern style and no bedbugs (apparently Ohio is the bedbug capital of the US!). They allow dogs (with no extra fee) and there's a nice little area to walk your dog - it even has a picnic table and a grill. It's a great deal - we paid around $60\/night for two adults, a baby, and a dog. We will definitely stay here again - it's the perfect place to stop when driving on the 80 through Ohio.","useful":1,"funny":0,"cool":0},
{"review_id":"h7NtSb1PhTTP5upItYPKaQ","user_id":"60EjFve2Mk2QpelvxeS0Mg","business_id":"5LNZ67Yw9RD6nf4_UhXOjw","stars":5,"date":"2014-03-06","text":"AMAZING!! They have every little detail covered. My second stay here comp nights from the Cosmo!! I even one about 400 bucks here during my stay. If you can stay here it is a perfect mix of New York and Vegas!!","useful":0,"funny":0,"cool":0},
{"review_id":"NU31J9EmSO8kk_5z89fopQ","user_id":"ma6Xt5wMsS56n86889C6ew","business_id":"KITTPaT-rcm8SRx2wM49sA","stars":1,"date":"2017-11-21","text":"Terrible customer service. I asked simple questions and they become terrible salesman and women. The two staff members there today was a man and woman neither knew what I was looking for and neither knew how to sale me anything while I walked in trying to spend money. Go to vitamin shop it has a better staff","useful":0,"funny":0,"cool":0},
{"review_id":"UmgjlXsE5y6M8LK2TJKaLQ","user_id":"wtEYIiwgen3vi6ks5OZR6g","business_id":"_E36-nDMWizyfEo88CZQ2Q","stars":1,"date":"2013-01-25","text":"The shoe department namely, the mens shoes department there has the worst customer service.  I was there on a weeknight, took two pairs of shoes and waited to be served.  There were two clerks working there, two other customers besides myself.  I was ignored, made to wait, and wait some more.  I waited for 20 minutes without even the clerk acknowledging my existence.  Disgusted I asked to speak to the floor manager on call that night.  I told the store manager what happened to me and that I will NOT EVER shop at their store again for this kind of bad service.  I eventually went to the puma store and bought 5 pairs of shoes.   Nordstrom, take note.  Piss me off and your bottom line will suffer.  Shoe stores and clothing stores are a dime a dozen - especially in las vegas.","useful":2,"funny":0,"cool":0},
{"review_id":"URCweuhE_sg0Vb440zbOtQ","user_id":"VprLsYs1-0J3c314O-TaFw","business_id":"lF6LP81FVEuPUXJiQg0Eag","stars":5,"date":"2016-08-25","text":"We first took our puppy to Dr. Stefanescu for a wellness check as soon as we brought her home and have really enjoyed working with him and his team from the beginning.  Dr. S and the staff at Yonge-Davenport Pet Hospital provide dependable, caring and professional service - and our puppy gets so excited every time we bring her in (even after all of her shots!)!  I so appreciate their thoroughness and genuine care for my dog, and am very grateful to have found a vet who clearly loves what he does and who is so kind and engaging with pets and their owners.  Very highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"JA8EB1ak4pICVGsY8a0Pzg","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"avl8sqAPq0hdOGyC6WXctQ","stars":5,"date":"2017-11-02","text":"First place I've ever been to that uses REAL all white chicken!\n\nFood is awesome!\n\nWe plan on ordering from here more often.","useful":0,"funny":0,"cool":0},
{"review_id":"31rnT4ZHhExtbG9NI4ppiA","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"C_cwPZ2xQmAQjxRUUP8BuQ","stars":1,"date":"2016-02-17","text":"Save your money!\nHad them come \"deep clean\" our hardwood floors, and put down the protectant.\nI told them to leave after doing only 1 room, and paid for that only!\nI could have done better with a paper towel and 409..... The machine they use does not \"deep clean\", and they go back over with a swiffer.\nThe room they did clean, looked the same after they left!!\nSave your money, hire a private\/local company that will actually clean them.... Or do it yourself!!","useful":2,"funny":1,"cool":0},
{"review_id":"b0HOmRBWU5hu5zquqIm6Tw","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"1ylgrtS3iSNaf3V68kw4bw","stars":5,"date":"2016-10-20","text":"AMAZING!!!!!\n\nWe both ordered the chicken and waffles which were unbelievable!\n\nGreat service, excellent food, and best of all is that it's a small local farm to table restaurant.\n\nCan't wait to go back!\n\nHighly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"a9rYZuhnDLrGLxDml-iiZA","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"MPzcE4ubmaYHv0Qroyapbw","stars":5,"date":"2015-10-03","text":"Great service, friendly, and most of all, honest!\n\nSmall business owner.\n\nHighly recommend.","useful":1,"funny":0,"cool":0},
{"review_id":"pPC2OhpVvMEkR4g7Ky2_7Q","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"6MtzIWnwN6q4Swgf2M8NLQ","stars":1,"date":"2016-08-26","text":"Extremely over priced, especially for the portion sizes.\n\nIts chicken, which is as cheap as it gets.... Followed with a side of rice, again as cheap as it gets! And you can pick your last side, nothing special.\n\nService was terrible..... Waited forever, and they never came back to check on us.\nWe had to go ask for our bill!\n\nIf you want good chicken, stick to the many bbq joints in charlotte.","useful":0,"funny":0,"cool":0},
{"review_id":"n7kKiABvxqcwdeUfrVQ0ow","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"JwgjueA-_Ayiv20II3nqWw","stars":1,"date":"2016-05-09","text":"Worst experience ever dealing with this place...... They never answer the phone, return phone calls, and worst of all, perform work without approval.\n\nAvoid this place!!","useful":2,"funny":0,"cool":0},
{"review_id":"FbCFtHjVXUjDo1knbYGfqQ","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"7wJmtqPXXfK3NB_E8oOUGg","stars":5,"date":"2015-03-18","text":"We love this place.... Food is amazing, (especially the wings), great beer prices, and excellent customer service!\nHighly recommend!","useful":2,"funny":0,"cool":0},
{"review_id":"aIaAwu5ZZNnu8UNJx04tog","user_id":"ZLTinDXCj80805T6nK2Zyg","business_id":"kzD6FCqGJzk4Lqw9SL71XQ","stars":5,"date":"2016-07-11","text":"Highly recommend this place!\n\nGreat haircut by friendly staff..... Great prices!\n\nBest of all, no wait..... Quick in and out!","useful":0,"funny":0,"cool":0},
{"review_id":"cQkHCRndGGrmCf7pIk9N_w","user_id":"TUicKDcMzvYTwTtCOwdXkA","business_id":"8KJSfDRhAZjAs_rMDqem7w","stars":1,"date":"2017-07-15","text":"Last two times I was there I seen more workers in the exhibits than animals. At 4pm a worker was using a floor machine to wash the floor in the aquarium and I felt I was in the way. Way to much construction. Nothing but over grown landscaping where the bears used to be. Way too much of nothing in between exhibits. By the kids area by the sea lions there is a picnic area and there was one table with shade and a zoo worker was sitting in that seat on her head phones. The new dining area is nice but we sure pay for it if you eat there. Escalators are broke all the time. Literally never running so to enter you have to use one of two slow moving elevators that make the worst noises and there is constantly a line. Bathrooms are not maintained. Totally went down hill. I bought season passes last year and won't do that again. Wont be back and will drive to living treasures or any other zoo like Erie or Toledo or Cincinnati.","useful":0,"funny":0,"cool":0},
{"review_id":"WN1N9YfllEJqrR5CcsAcCQ","user_id":"H3hOAacpaHwIOdb2GJUU1g","business_id":"UadjF8_TEWUbuU-QnzQicA","stars":2,"date":"2015-08-27","text":"I have stayed at this hotel 3 times in the past year and a half. There was a reason for that..it was clean, had nice staff, was inexpensive, had no crowds and most of all...no resort fees. As many have stated on here, I went on here a week ago to book a room, and there it was in bold letters..RESORT FEE. You're really going to charge a resort fee for a hotel that's off of the strip? Oh, and what do we get for the wonderful $25 PER NIGHT? A measly bottle of water, some DVD's, and a long distance call..oh and terrible internet? I am disappointed by this and I hope they soon realize that this decision will turn out to be a terrible mistake in the future.","useful":1,"funny":0,"cool":0},
{"review_id":"eNnCHaXjs5m-jcD8FK0FpQ","user_id":"B9-6O6-ch4s_f2z22DA07w","business_id":"QR8_Ma63hQS90QfIearKaA","stars":1,"date":"2012-02-19","text":"Tried to take some out of town guests to one of Gastonia's \"better\" restaurants.  Horribly disappointed.  Food was tasteless, cold, and overpriced.  Service was some of the rudest I have ever experienced.  Not going to waste my time with details.  Just don't go here.","useful":2,"funny":0,"cool":0},
{"review_id":"lQ8J2sKYICzceFcTSTZ8Vw","user_id":"MfGPntpM3IGtHHFOf4qf-A","business_id":"O589S0opFB9oK8VcL5tRcA","stars":3,"date":"2012-04-04","text":"yes, it's a strip joint but it's also a Steakhouse and the girls keep their bottoms on, I personally wanted to experience it but they made us wait over 30 minutes for a table and we had a reservation so we didn't get the peep show or to try the steaks. too bad.","useful":1,"funny":1,"cool":0},
{"review_id":"JIe1B3lVJZriu3jka921xg","user_id":"MfGPntpM3IGtHHFOf4qf-A","business_id":"Lau3N654yNyWdIIybea1uA","stars":5,"date":"2012-03-14","text":"this fine dinning italian restaurant is inside the chaos of New York New York Hotel and Casino.  We wanted to have a good sit-down dinner where we could have a romantic mood and no so close to the noise of the casino. Well, this spot is very nice, very romantic and we had an early dinner so it was very quiet.  I had the Insalata de Capri and Fettuccini Tuto di Mare... delicioso!  my date had the roasted chicken.","useful":0,"funny":0,"cool":0},
{"review_id":"T1hKJPNWrmGvZWNbvVh5bQ","user_id":"MfGPntpM3IGtHHFOf4qf-A","business_id":"sB1lPLICz4nrOuuqgLv50A","stars":5,"date":"2012-04-04","text":"my honey was looking for a good steak house in Vegas and this one came highly recommended. Everything from the bread, to the salad and the filet mignon was to die for. nicely aged and very tender. my beloved had the porterhouse. the service was magnificent.  lovely and romantic.","useful":0,"funny":0,"cool":0},
{"review_id":"L38JgQ_Hlth2XZQMaf0FPQ","user_id":"MfGPntpM3IGtHHFOf4qf-A","business_id":"E6DmUAHfSRCEakvknot-zA","stars":5,"date":"2012-04-04","text":"yuummm!  I love well done seafood and this place has it all seafood and every way possible plus the live music on a sunday afternoon with a bucket of Pacificos, was just perfect. there are like 6 different ones, I went to the North Vegas spot.  it was great and not so pricey.","useful":1,"funny":0,"cool":2},
{"review_id":"MxAaMj8qb4m4_n1iFgFHXw","user_id":"MfGPntpM3IGtHHFOf4qf-A","business_id":"R_ZlcX46pPdjhjmfd043LA","stars":4,"date":"2012-03-14","text":"love love the view from the top of the Stratosphere Hotel and Casino. it made a great birthday lunch, it was delicious! Service was great!","useful":0,"funny":0,"cool":0},
{"review_id":"CFp3cM6mclIAbpdm0ntg6Q","user_id":"aOr79H_zU6VzZAxI3c6iog","business_id":"Z_JkVkaUcN4ITVeuG-4Qtw","stars":4,"date":"2015-12-07","text":"My date and I came here for an early evening drink and appetizer. They sat us on the 2nd floor balcony which I highly recommend even if it's a tad chilly outside (they had space heaters). The beer selection was good, but not great as you would expect at a \"gastropub\". Maybe 15-20 beers total in this place. We had the hangover fries sans-eggs and these were fantastic! Great amount of toppings and the fries themselves are delicious. Crispy on the outside like Arby's curly fries. So good!","useful":1,"funny":0,"cool":0},
{"review_id":"4ozRbS2a6U7Tl4mIEbB-9w","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"V1cWGBZLQLyIiyo0iUOnyg","stars":5,"date":"2014-03-18","text":"What a gem! Easily the best cup of coffee you'll find uptown. Their pour over, for people like me who like their coffee pure, is nothing short of perfect. The people here are knowledgeable, but not in that \"I know more than you, I'm going to talk down to you\" way. Very friendly and a super cool atmosphere.","useful":1,"funny":0,"cool":2},
{"review_id":"7v3yWXBYROqCRnvjWEIVXA","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"DyOzNIeXUksPNLXYHnB-oQ","stars":5,"date":"2014-01-27","text":"What a great addition to the area! The food is phenomenal (they don't skimp on the protein) and the price is unreal. I got 3 tacos (shredded chicken and shrimp - recommend both), added guacamole, and a side of black beans for $7 (thanks to the 30% deal). If you're familiar with the NoDa area, they get their beer from Salud so there is a great craft brew selection. I will be returning soon.","useful":1,"funny":0,"cool":0},
{"review_id":"5G8FaCVae0vzjETRkPPClQ","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"KMHYSb1VLfUr6S3Hryp3Qw","stars":5,"date":"2017-05-28","text":"Great experience. D. Walsh's office is in a nice shopping area, next to Duck Donuts (a bit ironic, yes). The office is clean and nicely decorated.\nDr. Walsh's dental assistants are very nice and great at their job. Dr. Walsh is great. He doesn't rush through patients and he also doesn't push unnecessary treatments on you. I asked about a treatment for slowly exposing roots from brushing too hard and he deterred me from making a costly decision that he didn't feel was necessary. Instead, he pointed me to less expensive and less invasive steps.\nI definitely recommend this practice.","useful":1,"funny":0,"cool":0},
{"review_id":"_ldReWFSP18MNYCbpFxxnA","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"iAD5r5vNOzc1AP6UA5yFiQ","stars":5,"date":"2014-02-22","text":"Such great food and such a great price!!! This little gem is well worth a try. Whether you are getting lunch, dinner, desert or drinks, this is a solid choice. \n\nThe gelato is phenomenal. The owner is here most nights to come out and talk passionately about his love for his food and how he learned about the ingredients and processes to make his food the best.\n\nThe beer selection is solid, for you drinkers: they have Bell's seasonal in bottle and on Fridays and Saturdays they're $3!","useful":0,"funny":0,"cool":0},
{"review_id":"JuXojOcYOGMhkQmVdL0vbw","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"dwLfu8PGUIqGB-svwXAnJw","stars":5,"date":"2016-03-09","text":"Very clean office. Seen promptly. They seem to have all of the newest technology (which I am a HUGE fan of, since it meets less trying to keep my eyes open for those puffs of air and more in-depth results).\n\nDr. Mumford is incredibly friendly and happy to explain exactly what she is doing and why, and walks through results in terms I understand. I highly recommend this practice!","useful":0,"funny":0,"cool":0},
{"review_id":"3LyhGDdCwz-bD88FpsatnQ","user_id":"rFL8Ytis3U5W4w-LWgTx0Q","business_id":"2S6p5ICNswz_EdgcZk76qQ","stars":4,"date":"2014-02-22","text":"Awesome place to watch sports - they've got a ton of flat screens with multiple sports channels going - and one of the best beer selections around. I'm a huge craft beer fan and this place definitely hits the spot. Pub style food is done well, too ;)","useful":0,"funny":0,"cool":0},
{"review_id":"hqZHso-N34458BOgPpIgEA","user_id":"ToQAbLqy3d1dr74_uXrtxg","business_id":"yW_pQ6kq_8v4QkfJHmJVww","stars":1,"date":"2015-06-02","text":"I sent them a nice note mentioning that the website was confusing and got this charming response:\n\n\"If you have not bought the voucher DON'T, we will not be providing any\nservices to you. If you have bought it, contact the company your purchased\n it from and ask for a refund. DO NOT CONTACT US AGAIN.\"\n\nso you know what to expect","useful":0,"funny":0,"cool":0},
{"review_id":"qKncKF5lCbVWPVv0rBX-YQ","user_id":"crXCXgm63hUbpg8mOZpvbA","business_id":"piJeE_GQxpYE3hvqW__jvA","stars":5,"date":"2015-11-06","text":"Expect this place to be packed EVERY SINGLE time you visit. The food is that good. The coffee cake alone is worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"hMdl79AeUhg1Xv334HHbfg","user_id":"crXCXgm63hUbpg8mOZpvbA","business_id":"Kx0MUrNQ737s-VVElk6Vig","stars":5,"date":"2015-10-07","text":"We order from here ALL the time. The food is great and cheap! I've probably tried close to everything on the menu and have not yet been disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"xZ98s-rMZE4xeEKNFW003Q","user_id":"crXCXgm63hUbpg8mOZpvbA","business_id":"-_yEVC3_3M6YOsamYfNFEw","stars":5,"date":"2015-10-07","text":"We decided to get lunch from here for the first time. The lobster chowder was amazing. Soup was chunky and filled with lobster. The wild salmon-wich was good but might try a different sandwich next time. Definitely will be coming back","useful":0,"funny":0,"cool":0},
{"review_id":"-_6aaPa9lxzn5atVfq-TNQ","user_id":"crXCXgm63hUbpg8mOZpvbA","business_id":"0xvdC8F0HmFpAFkJk6nXLg","stars":5,"date":"2015-10-07","text":"Our first time here and we were not disappointed. The food was amazing and the staff was friendly and helpful. We ordered the Yojie's cut and Kobe beef with sukiyaki broth. The broth was sweet and delicious and the beef was so tender. We weren't sure about dipping the beef in raw egg after you cook it in the broth but it was surprisingly good. It balanced out the sweetness from the broth. Afterwards you can put your veggies and noodles in the broth to make some soup. :) cant wait to come back.","useful":0,"funny":0,"cool":0},
{"review_id":"G_02EuZ7gXZHn9SRPhEW0w","user_id":"crXCXgm63hUbpg8mOZpvbA","business_id":"EHIUp6lUabQCtQ4SVZitQw","stars":5,"date":"2015-10-07","text":"For 8 bucks you can get a basic sushi roll, your choice of ramen or udon, miso and a salad! The more complicated rolls will cost a little more. Ive ordered the ($8) spicy tuna my first time the ($12) las vegas roll the next. Both were yummy! The salad come with this tasty creamy dressing on it. The miso was flavorful. The Ramen noodles were kind of soggy but we did get our food delivered which took about 45 minutes to an hour. For the price all was definitely worth it.","useful":4,"funny":0,"cool":0},
{"review_id":"e_qHKmmSaEbWnKKy3Ww2bQ","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"eEnNw3_hBvxcFHyr23kAuA","stars":1,"date":"2013-06-03","text":"I am extremely disappointed in the security of this place. Yesterday we were at the pool with some friends. An iPhone was given to a waitress and then the phone just disappeared. Been almost  24 hours and some how the waitress at the pool must have got lost on her way to security. We have a handful of people stating that this waitress with dermal piercings located on her left top wrists and on back was in possession of my friends white iPhone. I would maybe expect this to happen because its free on Saturdays but for a valued employee to put the hotel at risk and the people who stay here by stealing from a mother of two, is beyond me. I would warn any visitor to watch your belongings and credit card information. Read reviews and google this place you will find there is more than one case. Sadly she may never get her phone back with pictures of her babies but hopefully this review can help someone. \n\nWe have tried to even contact security today and still no luck. I would like to know how a phone in a hotel could vanish?","useful":2,"funny":2,"cool":1},
{"review_id":"jKtzAxh5lrY9OAjcNp3WtQ","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"3WipOV5JlbCEO_o0tV49yA","stars":5,"date":"2014-01-29","text":"I absolutely love this place!!! For years I always order the buffalo chicken wrap. I have been going here for years with my boyfriend and by far one of my favorite places to go to! I would defiantly recommend going here!!!","useful":0,"funny":0,"cool":0},
{"review_id":"ZGWEHJb7LMCBRYyy1zALdA","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"HcY_uzbNGiRNif9LbGtXYA","stars":5,"date":"2014-02-09","text":"I have to say the family that owns this place is awesome. Exceptional customer service and never once been rude. I live down the street and been coming here for almost two years.","useful":1,"funny":0,"cool":0},
{"review_id":"FQBmINs9dCyDD13JpDgXbA","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"ahzHzyALM4ZCEVRrs2KejA","stars":1,"date":"2014-07-18","text":"We went in here today, ordered our sandwiches and when we went to pay. Guess what apparently our card was declined. See I have more than enough money on my card but used cash to make it even. So in front of customers told me my card was declined. I decided to walk over to food for less and get a print out from an ATM. Guess what I walked back and showed her the print out. They did nothing! Horrible customer service. We went to Subway and guess what it worked and when I told them what happened at port of subs they threw in a free sand which. This is what happened the dumb cashier prob entered in it wrong and needs to be retrained. Doesn't need to announce in from of customers that our card was declined. I have never be so humiliated in my life. I will also be contacting corporate.","useful":0,"funny":2,"cool":0},
{"review_id":"pDfUeCdLltRtpvnQO7rUCQ","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"hen4hE5vC5JRCxR842vuhg","stars":1,"date":"2014-01-28","text":"I came into this office tonight for an abscess tooth. I have had a few so I know the difference. The pain is unbearable and your gums form a pocket after you have had a cavity for some while. I don't have insurance and I do not have 50 or would've went to a dentist. Let me add I came in for antibiotics, not hard core pills. Let me say this place is horrible! After claiming I have gingivitis from the female doctor on staff at 7:30 at night to not giving me a prescription  because I wouldn't pay 50 is basically holding it hostage. I could understand if I was trying to get Vicodin but an antibiotic? The lady in charge of billing kicked me out! I will be going to the director having a law background I know that UMC has a sign on the wall stating that they will help everyone. What they're forgot at the bottom is anyone with money. By the way already at another hospital and have been seen and what so you know I have an abscess tooth, not gingivitis. You will have to pay a copay if they find you as not an emergency, which gingivitis would be considered as not an emergency. The nurse there who has blonde hair I will be writing the director for her because she belongs in a way better environment. Gingivitis is where all your gums are inflamed and your gums are bleeding.","useful":3,"funny":0,"cool":2},
{"review_id":"2GLiT0tz4Gits8jDvQN7Rg","user_id":"Bjh6QvM7vqr2Lm4xWGrQ5A","business_id":"xD0qY7CyI2PCcr0lvVp9-A","stars":1,"date":"2014-06-25","text":"I would give this place no stars if I could but I can't. We have been calling all morning finding places to get married at. The man who answers the phone is extremely rude. First let's tell you they charge 500 to get married at the Las Vegas sign. Yeah 500! First off there are at least 6 other places in town that you can get that for 100. Go some where else! Do not do business with this company. When we told him that was a little steep he commented back that there is also a Mc Donald's and inn n out in town that we could go get married at. Extremely rude and unprofessional company. By the looks of other reviews they seem to have a wide variety of complaints. We are actually having our big wedding in Tahoe at Zephyr's cove next year but wanted a typical Vegas sign wedding. This company should look into finding someone else to represent them. To be told to get married at Mc Donald's or a fast food restaurant is out of line and uncalled for.","useful":5,"funny":2,"cool":1},
{"review_id":"2gxcigqc_yx3riM0wbQXlQ","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"QsMR_Fp9YRtDegThsOgFLA","stars":4,"date":"2009-04-21","text":"I like the :\ngorgeous decor.\nFriendly staff.\nGinger Mint Duck Salad.\nSoup Gyoza ( which is not in a soup bowl but each dumpling carries the soup in it!  So different and tasty.)\n\nI am scared of:\nthe intense red light in the bathroom.  It's a personal piccadillo.  Makes me feel like  its a bad trip or something. And I can't figure out it my makeup is lookin right or lookin like the tasty food spit up on me.","useful":3,"funny":1,"cool":2},
{"review_id":"He9aKbZ2XFuj8dzgA56sjA","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"NJ0RzuWd5xDqfJejYQZ65g","stars":4,"date":"2009-04-21","text":"Great burger but I happen to love blue cheese.  Their panini's are awesome and even though I am not a vegetarian I still adore the veggie panini.  \nSweet potato fries are amazing here.  especially with the aioli sauce.\nBartenders remember me and the managers always come over to say Hi and make sure everything was alright.\nLove the candles everywhere cuz who doesn't look great in dim lighting?! Bathroom is always super clean and it's retro look is neat.  Some of the patrons can be a little stuffy but they are easily ignored.","useful":2,"funny":0,"cool":0},
{"review_id":"oJwuM2sqNHxqazzbJyageg","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"8Wf7aCIszfVY-TZOdAKyBA","stars":5,"date":"2015-07-30","text":"I throughly enjoyed my haircut at Steven Paul. I was with Mark Loposky and he was amazing! Two thumbs up for Mark! Side note, I adored the mural on the ceiling at the hair washing station. It was beautiful.","useful":0,"funny":0,"cool":0},
{"review_id":"lnZdO6c2_inIoFfOI5_yTw","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"gHutuGMMMH-5Qv9DbemLFw","stars":5,"date":"2015-06-11","text":"I just can't get enough of their sandwiches! Best Cuban sandwich I've ever had. Drool. And I love the Scottwich and reuben.","useful":0,"funny":0,"cool":0},
{"review_id":"EPsud29blvrLy6sj0DCgvw","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"jAsvKe4-SteA-ZgyfVPoTQ","stars":1,"date":"2009-04-21","text":"The margs were watery and low on the alcohol.  \nThe server treated my mother ( yes my MOTHER) like she was from outer space and water went empty more times than a trip across the desert.  \nNever been to another macayos but not gonna try after that visit.","useful":0,"funny":0,"cool":0},
{"review_id":"a_IWhIQJI-6Ytjb5_XCDUw","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"sWwCwjsd27k0Y8m1RIWZEg","stars":5,"date":"2015-05-15","text":"Went here for a belated mothers day celebration. Loved it! Had two delicious signature cocktails, a lemon drop martini and a spiced rum old fashioned. Had the mussels to start, a mozzarella salad and then the pork tenderloin. It was all so good, I will absolutely come back again.  My server John was amazing with his wine knowledge. I wish I had had enough room for dessert but there's always next time!","useful":0,"funny":0,"cool":0},
{"review_id":"Aj9tXJBJfe35rPhgO_PWxg","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"ZCzey5aPhd7jYIoHsUfjmQ","stars":5,"date":"2014-10-28","text":"Loving my server Daisy! She's is the best ever! The menu looks amazing and I can't wait to try everything on it! I'm having the pig face to start. Super tender and I adore the house made sriricha. Yum!","useful":0,"funny":0,"cool":0},
{"review_id":"-32VbvWwEKGhFCHCqPd6uQ","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"JCmyrBoNl2qfZ-f8I5RA3A","stars":5,"date":"2014-09-18","text":"Very inventive side dishes! Persimmon kimchi is out of this world! The owner makes it herself. Awesome","useful":0,"funny":0,"cool":0},
{"review_id":"ndxSdvHrDD3K5pi1R7pC-g","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"OQggqcQglU-lHY3rY-8Lhw","stars":5,"date":"2015-09-15","text":"So far  so great. Loving my bartender Morgan. She is the cats meow. Will definitely come back and try all the different yummy looking items I didn't get to today.","useful":0,"funny":0,"cool":0},
{"review_id":"7FgrwT9p5nSIbjwdB9msuw","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"GpX1PmgplBrG_DLiJVDC-g","stars":4,"date":"2009-04-21","text":"I just love their food and great mojitos!  \nThe lobster quesadilla is out of this world!  And the mango pico that comes with it is the perfect compliment for the seafood inside.\nMY next fav is the mango chile duck breast.  Very rich and med rare is fantastic.\nThey just got a new chocolate cake in and I have definitely gone back for seconds.  It's not quite all chocolate but that's what I like.  It's surprising in each bite.\nAll in all, \"modern mexican\" is the right term for this place.  If you want a three dollar menudo hangover cure try the fillibertos down the st.  This is a twist on regular mexican, good quality, and well thought out.","useful":0,"funny":0,"cool":0},
{"review_id":"eTdnkNJLpFNDQnhIiX2Wdg","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"KxWqA5Wv0Zghzz8mRlkl-w","stars":5,"date":"2014-08-30","text":"Super quick. The Lady who helped me was really nice and accommodating to my child. I love the use of computers instead of traditional ink. No messy fingers for me afterwards!","useful":2,"funny":1,"cool":1},
{"review_id":"SrCPLELwYeS0J7HUDVZSWQ","user_id":"TIvTTZWgLuxVcMVsp-WsPA","business_id":"qjjYP_3McovO_bsg9nOl6w","stars":5,"date":"2015-02-04","text":"Had the duck wings...drool.  Sooooooo good.  Very rich but with the perfect size and crunch on the outside.  Thought the coleslaw could use a little something... more sweetness or maybe a touch of spice?  But that's me looking for something. Truly the wings were very much so worth a try.","useful":0,"funny":0,"cool":0},
{"review_id":"MmnShmcCHplOD4dxScHmDA","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"djW8gh3JJ-__NCxx1YQaHg","stars":5,"date":"2016-04-10","text":"Best donuts in town!  This place his been around for years because their donuts are delicious. Their pizza isn't too bad either. Take note, they don't accept credit cards,  only cash. Also they are closed on Sunday. The service is fast and the prices are fair. Give 'em a try!","useful":0,"funny":0,"cool":0},
{"review_id":"4rf9MRn145trVyA1WCLGEg","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"mgkzOlvtT_PUHIt1ftjcPQ","stars":3,"date":"2015-04-25","text":"Don't sit at a table in the bar. Service was slow and not that friendly. Waited awhile for our order to be taken and for a drink refill. We liked our sandwiches, but fries were slightly undercooked. Prior experience was very good. Maybe this place is hit or miss?  Like that it is owned by local folks.","useful":3,"funny":0,"cool":0},
{"review_id":"AW7sAkWH644PiuReJ1HGPg","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"3a9VwysYDeUBBAS7xiJOJw","stars":4,"date":"2016-04-10","text":"I enjoy their sliders and my husband likes their stuffed burgers. A basket of fries is enough for two to share. We enjoy the fries with malt vinegar. The owners, Mr and Mrs C, are great hosts and often check-in to ensure that everything is okay.   The food comes out quick. The only complaint is that the space is tight, the tables are a little close together and the chairs aren't comfortable.","useful":0,"funny":0,"cool":0},
{"review_id":"euu98fHYCewsg0-BfrX_Pw","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"5G-i1t7VXLGByswnCKvrDQ","stars":4,"date":"2016-11-19","text":"Great local Mexican food. Happy hour $2 Bud Lights from 3 to 5pm Monday thru Friday. I enjoy their fajitas. Coupons in local circulars. Good service.","useful":0,"funny":1,"cool":0},
{"review_id":"OI92ywtF6lCl3pDeTJ6lIw","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"AEoWScs-gYsXSUUmDbseFg","stars":4,"date":"2011-04-16","text":"This is my favorite local restaurant. I absolutely love their scampi.  They are huge!  This is a nice place to go for good service and great food.","useful":1,"funny":1,"cool":1},
{"review_id":"iIWnpiCDetd_wV7k0aKLLA","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"SWDEdiv_v1QppobT1YnEPA","stars":4,"date":"2016-04-10","text":"This is the best place to get Chinese takeout in Willowick. My husband and I get sweet n sour chicken from here about once every couple of months. The sauce is yummy and my husband loves the pineapples in it. The gentleman behind the counter is very polite and efficient. We've tried other Chinese restaurants in the area but none compare to Chin's!","useful":3,"funny":0,"cool":0},
{"review_id":"XBDCdFRDhxSsI6miNbEriQ","user_id":"3pQxT_d2seD4p7hTLZ0uSQ","business_id":"2S-NV3clYHDbDEmqT8fuGg","stars":4,"date":"2016-04-10","text":"We love their ranch dressing, warm bread and chicken parmesan.  We were happy to get seated quickly. The mozzarella sticks are homemade and delicious. Our family really enjoyed them as an appetizer. The food came out quickly and our waitress was very attentive.","useful":2,"funny":0,"cool":0},
{"review_id":"MExvaR_eSBiyP3kYnsgZoA","user_id":"N6xxOl7GXyCwBwmlEYuA9w","business_id":"0xdpv5CPpbUUch7JKBG98Q","stars":4,"date":"2012-10-14","text":"Sirio is one of those gaudy, overdone, bombastic kind of Las Vegas restaurants that is a sensual overdose before your food even arrives.  It is also ridiculously expensive.  But if you get past the high-roller, Sin City riff, you'll find outrageously good food and drink and attentive service -- the kind of impeccable that you can't find fault with, although you can't really be sure it's enough to bring you back.  \n\nI was in Vegas on business, and wanted to treat myself to a nice dinner.  I was warmly greeted and not made to feel awkward as a solo diner.  The wait staff was very pleasant and attentive, from the hostess, to the waiter, to the flirty sommelier.  I had an excellent seared ahi appetizer, although I confess this was a second choice because the ala cart pricing scheme for more typical Italian choices was just simply outrageous: build-you-own platters of olives, cheeses, meats and pickled veggies at $12 PER ITEM!  So a antipasti platter of 6-to-8 items, which might run you $14 to $18 anywhere else, you're looking at close to a hundred bucks here.  Just stupid.  I had a stuffed veal chop that was excellent, actually worth the $49 ala carte price.  The wine list rocks.  I enjoyed an unbelievably good Super Tuscan from my favorite Italian winery, Gaia, a treat that I rarely see on wine lists outside of Europe or China.\n\nNot a place I'd take the family, but a solid choice for a romantic dinner or to impress a client.","useful":0,"funny":0,"cool":0},
{"review_id":"h36MJSbIj9NQQNxXVzZ9fw","user_id":"N6xxOl7GXyCwBwmlEYuA9w","business_id":"_w5hBpkjHs5_Hv3pLeHtIw","stars":3,"date":"2012-10-14","text":"A blindingly long list of Tapas, from salads brimming with chunks of lobster to fresh meats and seafoods and desserts.  Very open air seating that lets in all the noise of the casino.  Good food, prompt service - not the kind of low-lights and cozy spaces your used to in a Tapas house.  More like shopping mall tapas, although with the Vegas glitz, glitter and chrome, of course.  Best value is probably the steamed mussels - a giant bowl of superbly steamed and flavored bivalves for just nine bucks.\n\nGood for a quick bite between games in the Casino, or a decent business lunch if you're in a hurry.","useful":0,"funny":0,"cool":0},
{"review_id":"u-PVzOmaZ26G0DdNvb_A5Q","user_id":"gFb84WvNsJNUl0p6BqYNYg","business_id":"fq1gYSEDB5tZT1pUCdWVkg","stars":1,"date":"2012-04-30","text":"2012 Honda Odyssey\nHonestly, my experience at Bell Honda was the most painful vehicle purchasing experience to date. The way the entire transaction was handled makes me not want to buy a Honda ever again. Apologies for taking so long to write the review.\n\nHere's how the story unfolded:\nSaturday, 10\/22:\nVisited the dealership, met with Corey (Internet Sales Manager), we drove to the adjacent lot to verify the Honda Odyssey I was specifically looking for was on the lot. We confirmed the car was on the lot. I told Corey ill be back the next day if I'm ready to the deal for the car. He said the car has an additional \"$1100 of options\", but we'll see what we can do.\nAt this point, I had seen the msrp sticker ($44,250) and the dealer added options attached to the vehicle specified for the deal.  Dealer Add ons included:\no Cantek Protection   $399\no Window Tint   $299\no Protection Package  $449\no Alarm (Remote Start) $895\no Appearance Package $195\nTOTAL    $2237\n\nSunday 10\/23, Returned Sunday around noon, greeted by Shane, the only person that I would care to work with again, told him I was ready to do a deal if they could beat the $41,500 quoted by Concord, for the specific car.  \n3. Corey came back with the counteroffer to match $41,500. \n4. I agreed and we proceeded to finalize the deal. To prevent any misunderstanding, I reconfirmed the dealer options that I expected with the car. At that point, Corey mentioned that the Cantek Protection, Window Tint, Protection Package were NOT included.  This was a surprise to me, but Corey seeming to think it was ok. For the $1146 in options, he reduced my payment by $4.50 a month. That left only the alarm and appearance package to come with the car.\n5. Corey verbally mentioned that the document fee was $395. As we reviewed the prelim contract, the document fee specified in the contract was $295. Rather than honor the written amount, he crossed it off and changed the fee. This was the next example of subpar customer service. 99% of dealerships would acknowledge the mistake and give the customer the benefit. Not in this case. \n6. Once the prelim paper work was complete, we headed to the finance office\na. Firstly, we went through the details of the add ons. The first accessory was Cantek Protection, I said it was actually not included. The finance rep, said it WAS included.  I can't believe the miscommunication between the front and back end. Then came the discussion about the alarm.  The finance manager said the alarm was NOT included. I couldn't believe it. The one item that was making the deal marginally beneficial was excluded? I said no way, call Corey....Corey came back to the office and said that it was not included, and I misunderstood. Since the deal was put together differently, this was overlooked. Ridiculous. At this point, I had invested 5 hours of my vacation to finalize the deal, and i wasn't going to leave empty handed, in hindsight maybe I should have. So I conceded on the alarm, making the deal at Concord Honda in Northern California a better overall deal. \nb. After all the back and forth with Corey about the monthly payment amount, I couldn't believe that I was told that another $35\/month was required for maintenance. No mention was made during the initial negotiation. I tried multiple times to exclude the service contract from my lease deal, but it pushed as required. I basically gave up.\nc. Then I noticed the contract specified .15 mile excess in one place and .20 in another place. The finance rep told us the excess mileage penalty was based on the msrp of the car. I said OK, please fix it. He went to his superior, came back with a different explanation. Again, not acceptable. If you know the answer great, if you don't, say that you don't know and get back to us. \nSo after all was said and done, Shane gave us a very detailed walk through of the features. We're happy with the car, yet the experience has left a bad taste.\n\nIF POSSIBLE, DO EVERYTHING TO AVOID THIS DEALERSHIP. Its not worth it.","useful":19,"funny":1,"cool":2},
{"review_id":"8UP-A1wSTjILdEQR48fgSA","user_id":"LIgzOgqBuTg-YbySy3Lp8Q","business_id":"wA2xaBsT8d2opW_jYe1XLA","stars":5,"date":"2017-05-25","text":"Usually when you come back try something that you loved as a child, you find out that they changed or maybe that they weren't really so good in the first place.  Danny's hoagies really were that good, and they still are!\n\nSince I was 5 years old - 5 decades now - Danny's oven baked Italian hoagies have been exactly the same.  The meat & cheese topped hoagie roll is baked in a pizza oven until the bread is toasty, the cheese is melty, and the edges of the salami and ham are brown and crispy.  Then they're topped with lettuce, tomato, onion, and Danny's special hoagie dressing.  All the flavors and textures are in perfect harmony making the best Italian hoagie you'll ever have!","useful":2,"funny":0,"cool":0},
{"review_id":"E49GdssS-6vVQISi5GhGNg","user_id":"phAHGz2Fr5io4K6uZ6HzrA","business_id":"p-8AMN9Q0qwym-3Pdle20Q","stars":5,"date":"2013-07-08","text":"OMG... my review may be tainted as I ate here after being thrown out of that Amy's Baking Company, and even though I was there for over an hour... I cam into Pita Jungle STARVING! \n\nAny ways, after having nothing palatable at ABCs, I came here for a meal (see my review on Amys Baking company). The other couple who was involved at ABC was already enjoying their meal (which they should, they had to wait over an hour at ABCs before they were thrown out) I had the Gyro X2 (I love those things) and it was great! I joked with the other couple I saw from ABCs and an employee of Pita Jungle. I learned that Pita Jungle gets a lot of business from ABC, as they are all ways throwing out customers when they complain. And the customers come right to them.\n\nMy advice to the owner of Pita Jungle, would be to offer a discount to anyone who has been thrown out of ABC. Advertise that in your window! \n\nJust to finish this story, as I left Pita Jungle with the other couple, and we crossed the street, we saw the girl that served me she was on the sidewalk just outside the restaurant. Both myself and the couple gave her $20 and advised her to find employment elsewhere. She mentioned that they were going to implement a contract for their wait staff that was ridiculous, and she was looking.\n\nAs I read the news.... yup they did! \n\nYAY Pita Jungle!","useful":0,"funny":3,"cool":2},
{"review_id":"Tpt2j4tN6IHJnCp0P-kZaQ","user_id":"phAHGz2Fr5io4K6uZ6HzrA","business_id":"DN0b4Un8--Uf6SEWLeh0UA","stars":1,"date":"2013-07-08","text":"WOW! Of course I went here as I was in AZ on a business trip, and was staying not far from this place. I was in my hotel room (thinking about just ordering room service), when someone I knew had posted a comment about the Kitchen Nightmare episode on FB. I then decided to look up the episode on HULU (this was not long after airing), then realizing I was not far from there, I decided to go. Uggg... I could tell just walking in that the kitchen was in distress. The old guy was sweating like a fat man in a marathon behind the touch screen computer. He had several tickets in his hand, and was having trouble with the technology. There were shouts from the back and a lot of loud banging from the kitchen. I noticed only one table had their entre. That table seem unimpressed with their food. one other table got some appetizer shortly after I was seated, I heard one person remark \"will I have to wait another 45min for my dinner\" The time frame got my attn., because it looked like a simple pita and hummus type appetizer.The old man responded curtly to this comment but with his accent I could not understand what he said. When he left the table, the group kinda snickered. There were like 2-3 other groups\/couples waiting that just had drinks. My waitress was very polite, and attentive she kept my glass full. I noticed she stayed away from a couple tables, until someone asked her to fill their water glass. She did as asked, and the old man noticed and scolded her telling her that they were HIS customers, and she is NOT to serve them. Even when the customer tried to explain to him that he just wanted some water, the old man responded \"You do not tell me how to run my business! I am the boss here you are not.. if you want water you have to come through me, not her...\" I then realized why she avoided those tables. My order was taken... I ordered the Chicken Parm. \nI waited for a while, even though I fully intended to, I forgot to mark the time I placed my order, but it seemed like an eternity when I did start clocking (I imagine 15-20min later) still the waitress was kind, and kept my glass full. about 30 min later the old man placed and Eggplant Parm in front of me. He was still sweaty, and had some strong odors about him. At this point my sense of humor was thin, and when he placed the wrong dish in front of me I called him on the fact that I was her customer and not his. He argued with me insisting that he took my order for an Eggplant Parm. The table kinda caddy corner from me actually got up, and informed him that THEY had ordered that dish over an hour ago, and that they herd me order the Chicken parm. The old man continued to argue till the waitress had to confirm my order with the original hand written ticket. I will say at that point, the old man said \"I am sorry, but you know how it is... it is confusing...\" The other customer and I rolled our eyes he sat at his table with his wife (who had no food in front of her) and I returned to waiting. Well I got my meal the same time the other gentleman's wife got hers - about 15min later. \nMy meal was an undercooked chicken that was supposed to be baked, but somehow was greasy. and when I mean undercooked, the thick part of the chicken was RAW, BLOODY RAW! It was NOT crispy the breading was soggy, mostly from the weird pasta situation. It looked as if they used a non slotted spoon to pull the pasta from the pot, because there was A LOT of water on my plate. and I am not sure the physics behind this, but somehow, they managed to have both overcooked and undercooked pasta on my plate. As if they cooked left over pasta, with new (dry) noodles! Some of the pasta was like mush, and some of it was crunchy. This meal could have killed me had I eaten it!\nThe other couple was served the Eggplant Parm, then 15 min later she was served (I think it was a salad ) As a gentleman would, he did not start his meal till his wife was served. When they started eating the wife threw her fork on the plate and said, I can't take another bite of this $%!+ ! The husbands eyes and mine caught each others. He came to my table with his plate in hand. He asked me to taste his Eggplant Parm. I tried to cut his Eggplant Parm, but it was REAL tough, I managed to get a small piece, and it tasted like dirt - literally! We both took our complaint to the old man, and he started arguing with us concerning the quality of his food. I pointed out the blood, he said \"Good! Hope it kills you, then you will never bother me again\". The other couple slipped out, didn't pay the check (don't blame them) but that left me - the old man insisted that I not only pay my tab, but the other couples too. I pulled out a $20, threw it on the table and left! I was chased out the restaurant by both of them. I went to the Pita Jungle and had a much more positive experience there (The other couple was there when I arrived with a full meal in front of them. This place is a HECK NO!","useful":69,"funny":46,"cool":15},
{"review_id":"30B8k4rQzGXb-v6G9XIUnQ","user_id":"p7GeYkqjITy0tupFdUzMcQ","business_id":"jaoFwU5mqxtw2JpZrM73Yg","stars":1,"date":"2017-04-01","text":"This place is a definite pass. Seems like they cut corners with everything but it's still just as pricey as quality places. We ordered delivery and the food took over an hour to arrive, the sushi was warm, and very underwhelming. Most enjoyable part of the meal was the after dinner mint.","useful":2,"funny":0,"cool":0},
{"review_id":"_Ahb5h33buFw1IWBzmEw8Q","user_id":"rKq0dKslXU0mNT5h0Q3JOg","business_id":"pwm-Pfc6f3S0X3BCFT2Aqw","stars":5,"date":"2011-02-03","text":"One thing I really wanted when planning our small wedding was a good photographer, because long after the day is over all you'll have is your memories and pictures. We used Mike from Glitter Lens Photography to shoot our wedding reception in Vegas this past January. We were on a very limited budget and planned it all last minute. He worked with our budget and schedule to get us everything we wanted. Mike was on time, professional, and totally accommodating to everything we wanted. We got our pictures back on time and they were amazing! We have great posed shots and the funniest candid shots as well! I couldn't have asked for more. We are so happy with our choice and would recommend him to anyone planning a wedding!\n\nEric & Julie Scott","useful":0,"funny":0,"cool":0},
{"review_id":"vvHqr2eX7z-dLj_x4bEeAQ","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"xGzKRIUAuqDrT9eYthGqKw","stars":4,"date":"2016-06-12","text":"best bagels ever. and you can't beat their Monday deal! the breakfast foods are pretty good but it can get busy really fast so the staff can get overwhelmed. great for take-out though!","useful":0,"funny":0,"cool":0},
{"review_id":"s6Ft8PryeW3r-U2q7MKkrA","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"R7-3MCD6_RL_VxN65yCh2Q","stars":5,"date":"2017-01-03","text":"very good Chinese food, way more authentic and cheaper than Panda Express. the orange chicken and fried rice is great. they have an awesome lunch special, and you get so much food. the staff was very nice and the wait time wasn't bad at all. the interior is also very clean. and they deliver!","useful":1,"funny":0,"cool":0},
{"review_id":"pBj1WUVPhJRJasBucP3Z8g","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"CtfCmOhJvpnTFcKm_MyQwA","stars":5,"date":"2017-01-26","text":"Finally stopped in this afternoon after meaning to for months! it's right next to European Wax Center, and it's got a nice little outdoor seating area. the inside was very clean and a nice place to chat and eat, kind of reminds me of a Jamba Juice, but more modern? I got the acai bowl with peanut butter, and it was absolutely fantastic. the fruit was fresh, the granola was very good and so was the yogurt with the peanut butter. you can literally taste the healthiness in the bowl! the service was very quick and the counter girl was super friendly and sweet. I will definitely be back in again!","useful":0,"funny":0,"cool":0},
{"review_id":"NWFbMQG2RwFv52iyvNEW-g","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"m1BRMnrel42nz_qIPSBO9w","stars":4,"date":"2016-06-12","text":"I love Keegan's and have been going here for years. the food is amazing and the staff are always really nice however they changed their menus and got rid of some of the great dishes. I loved the angel pasta and the burgers but they don't have it anymore!","useful":0,"funny":0,"cool":0},
{"review_id":"wBeTrh80iDnWurvUmJc6Pg","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"snP8QGxG-YRNBL_uq1kiAQ","stars":5,"date":"2016-07-18","text":"best smoothie place ever. try the Pink Star, and the White Gummy. they're on the \"secret menu\" and they're delicious. the regular smoothies are good too and I love to add a whey boost for some protein. the service is always fast and accommodating and the staff is super friendly. I wish they were open on Sundays!","useful":0,"funny":0,"cool":0},
{"review_id":"5E3jQkAeJZCehkaoREBZ9A","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"2-_HV0XUYK64OylB5J4i6A","stars":3,"date":"2016-10-13","text":"it's decent pizza. for $10 it's a good size, but the pizza is still so small that it seems like they're a bit stingy with toppings. also not enough cheese! i wish they had put more on, because that would have made a difference. however, i didn't want to ask for more- not sure if they charge that as an \"extra topping\" & i did not want to pay extra for what would be considered average cheese. the customer service was great and everyone was friendly and polite. the store itself was clean and nicely decorated. not sure if i will be back yet. the double mod is very good too, but a bit expensive considering it's not that much bigger of a pizza.","useful":0,"funny":0,"cool":0},
{"review_id":"MWE6bFb-R4ZSBgBF3JelTg","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"XPLSNGSClW8gR5BTcvyOhQ","stars":4,"date":"2016-07-18","text":"great place to have family\/work events or birthday dinners! the food portions are HUGE and they feed so many people. the staff is always friendly and helpful. be sure to reserve a table if you have a large crowd. the food takes awhile, but it's always great","useful":0,"funny":0,"cool":0},
{"review_id":"4Yuv2cJzQpWg1AClw3wSwA","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"Gw-ozqLSHoP3BQPKaiXJGg","stars":3,"date":"2016-10-24","text":"the restaurant itself is very nice and clean. it's right on the lake, and it has a great patio and bar area. I was in a group of 6 people, and we were seated outside. it was pretty, but I wish they had misters and a big umbrella bc the sun was either right in your eyes or on the back of your neck. our waiter was helpful and nice, and made a point of checking up on us every 15-20 minutes and refilling drinks. however, the food took forever (about 35 minutes) and we were there on a Sunday evening. the food was okay. I had the portobello sandwich which was quite small and it came out cold. my boyfriend had the fish tacos and they were also cold. we would have gone on one of the boat rides that they offer, however the battery was dead by the time we were ready to go, which I figured would have been the redeeming quality of the evening. they gave us about 10 free boat tickets. I would suggest going during happy hour to watch a game and load up on appetizers (which were all very good!) then do a boat ride around the lakes. not sure if I would visit again if we didn't have the boat tickets.","useful":0,"funny":0,"cool":0},
{"review_id":"d2025RAs-K2EBxzJfaBOBw","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"AUp7fTAH7PwxecdSO_iAhw","stars":5,"date":"2016-07-18","text":"I love CPK! this location always has really friendly waiters and staff, and they're usually very prompt, even if it's busy. it's great pizza, and the Tuscan hummus with pita is a great appetizer. I love the wild mushroom pizza. they're willing to do half\/half pizzas, which is hard to find at big pizza chains. the butter cake is absolutely divine!","useful":0,"funny":0,"cool":0},
{"review_id":"gqS7V4CDirdleFdJbaY3Tw","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"TVYJx5iUkLJFiuiXc8rxEQ","stars":5,"date":"2016-07-18","text":"delicious pizza. the Yukon bacon with egg is the best! I usually get take out, but dining is also a great experience. the staff is friendly and the food usually doesn't take that long. the pizza and salads are great.","useful":0,"funny":0,"cool":0},
{"review_id":"IwUQOT2qOg3B2xWzkTAQSg","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"fKm6mfATDJRDDQH0PtZeeQ","stars":4,"date":"2016-07-18","text":"I always have good food when I come here. it's a great local place with a nice patio for breakfast. you have to have an open mind when coming here, as there are some \"unusual\" menu items, but the staff is always accommodating. it's great for breakfast and dinner!","useful":0,"funny":0,"cool":0},
{"review_id":"jTalBPGSL91Gvj8OZXR-bw","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"wN2zNgEK-QizEA_NKAHj6Q","stars":5,"date":"2016-06-12","text":"RA is my favorite place to go for a date night. the crunchy calamari roll and the crazy monkey are so good! the viva Las Vegas roll is good too but it's a little expensive. the fried cinnamon gelato dessert is amazing! the music can be a little loud but the staff is super nice and will move you to a quieter table if you ask. the wait is usually only a few minutes. best sushi place in ahwatukee!!","useful":0,"funny":0,"cool":0},
{"review_id":"NG_Ik78Id8HfNANd3SimgA","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"4uZkUUbl6dr_bjmS2QNnbA","stars":5,"date":"2017-10-30","text":"Went in on Sunday afternoon about 40 minutes before close and even though they were busy, they were able to do a full set for me. The technician who did my nails (didn't catch her name) was super sweet and made sure that my nails were exactly the way I wanted them. Only $28 (before tip) for a full polish set of acrylics- can't beat that price. And they look awesome! I will definitely be coming\nback.","useful":0,"funny":0,"cool":0},
{"review_id":"VPtsT7ctxtGkmpFTYEFxQQ","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"owtAH-xAVf_hS2rFNGAXsQ","stars":5,"date":"2016-06-12","text":"the shaved ice is so good here. the strawberry cheesecake with cream is the best! the staff is always friendly and quick.","useful":0,"funny":0,"cool":0},
{"review_id":"kRi3I0B0nAqVQvp1tW4MCA","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"P8IsTiHq5Hesa6UPL604ww","stars":5,"date":"2017-01-26","text":"The absolute best place in Ahwatukee for authentic Mexican food. it's right next to the Safeway on 48th and Elliot, so a bit of a drive from the foothills but so worth it! The restaurant is clean and has plenty of seating. I've always had a pleasant experience with the cashiers, they're very friendly and don't mind if you ask questions (some of the menu is in spanish). I get food from here at least once a week, the quesadillas, tacos, burritos and bowls are all amazing and decently prices. always get the meal\/plate, they add in beans and rice for only a couple bucks extra. they also have fresh horchata which might be my favorite part! the service is always quick and they have never messed up an order for me. if you're looking for great Mexican food, you need to go to Los Taquitos!","useful":0,"funny":0,"cool":0},
{"review_id":"wVdFLpjU1LWbzGIIFAMjoQ","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"4sWZYYJs2Uw2N0qHu1TBsg","stars":5,"date":"2016-07-18","text":"I love this place! I will never go to another wax salon again. I go to Kennedy and she always does an amazing job, and she's also friendly and very personable. the staff is nice and always welcoming. it might be a little expensive for an $18 eyebrow wax but the results are always fantastic, and I only have to go in every 5 weeks. tell your waxer exactly how you want it, and she will do it for you!","useful":0,"funny":0,"cool":0},
{"review_id":"kFcsP-cHpct47E-72qR7kA","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"3x45Q9c5G6VBicedNKrXxQ","stars":4,"date":"2016-06-12","text":"the place is really nice but sometimes there are flys in there that can get annoying. the gyros are amazing, I just have to get past the fact that I'm eating a baby lamb. the iced chai latte is super sweet and good. the servers are always nice and the food is always quick to the table. also the pita is amazing!","useful":0,"funny":0,"cool":0},
{"review_id":"dy1NtOyn0kxi6Bh37N78Jw","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"0rjU_WK5HxoH1fIuEpTpcg","stars":5,"date":"2016-06-12","text":"best pizza in tukee! also pizza fries are the bomb. customer service is always A1. Jody and Mark are the sweetest people ever. the breadsticks are to die for and the ranch is the best in town. we love zzeeks!","useful":0,"funny":0,"cool":0},
{"review_id":"oTHiV6SdVQg_PBywZybyEg","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"cg3hmwyf2yP4iA1B67XkyA","stars":5,"date":"2016-06-12","text":"best Starbucks in tukee. has a drive thru that can get a little backed up but the staff gets your drinks quickly and promptly. they're really nice if they make a mistake too and will gladly make you a new drink. the berry hibiscus refresher is the best!","useful":0,"funny":0,"cool":0},
{"review_id":"LOgPry9QqH9yD94uMCdFUw","user_id":"9u_uBl2RTNRJ2FMCHvPnaQ","business_id":"WDW-_f2l7faA80KTopiILQ","stars":5,"date":"2017-12-06","text":"Truly a hidden gem in Tempe!! Charlie is absolutely wonderful and her salon is chic, clean and the employees are all great. I was offered a bottle of water as soon as I stepped in, and was greeted so warmly. I didn't have an appointment but they were able to fit me in no problem with only about a 20 minute wait time (totally normal for a walk in btw). Dee cut and styled my hair, and she went above and beyond to cater to exactly what I wanted! I love my haircut and I will definitely be back for a color job. Did I mention a shampoo and deep condition add-on is FREE?! They also have top of the line salon products for purchase! Charlie honored the 15% off my first cut which brought it down to only $15. You MUST check this place out, definitely one of the most affordable and chic hair salons you can go to! Not to mention it's local, and I love to support small businesses. Charlie's is a wonderful and relaxing experience with great results! Thank you Dee for my amazing haircut and styling!","useful":1,"funny":0,"cool":0},
{"review_id":"8HYY-JXDwDhI0adXWLpPVg","user_id":"dQS6WaHYkFnu0heqI2HHgg","business_id":"horxuC3ltKmt9Fh4-2ewMw","stars":5,"date":"2015-05-28","text":"Never meet an CPA as awesome as Ray Kondler.  Meet Ray 2-3 years ago by chance I had  been looking for someone to get my back taxes done after my old CPA dropped the ball for a few years( didn't do my taxes at all!!!) So I was behind 3 years of taxes when I meet Ray.  \nThey got me caught up not that its hard to do but with all the questions I had and how unorganized I was with my finances Ray helped me through that with ease.  He was like a friend you can talk to bout your taxes thats how he made me feel.\nNow besides my personal taxes he now does our biz taxes too.  And I refer all my friends to him.  \nIf you are not happy with your CPA or have none check Ray out!","useful":1,"funny":0,"cool":0},
{"review_id":"turOYiT7yRMY_NYRd0e_sQ","user_id":"EzU75XujqCHlK-y5BIQbFw","business_id":"gsUmOBq16wksQqLvPB2QMQ","stars":5,"date":"2017-04-25","text":"This place is amazing! We were out for a Sunday drive and thought we would give it a try based on the Yelp review history.  We weren't disappointed!  My husband ordered the Blueberry pancakes and I ordered the Mixed nut pancakes.  They were the lightest, fluffiest most amazing cakes I have ever had.  It isn't a big place, and however they move customers through at a steady rate.  We will definitely be back.","useful":0,"funny":0,"cool":0},
{"review_id":"F81iJtFA4GAnDGW2eADQuA","user_id":"EzU75XujqCHlK-y5BIQbFw","business_id":"VoayviMR2sm4C0CSh_I8Nw","stars":5,"date":"2017-08-22","text":"So darn delicious!! If you haven't been here, you are missing out! I ordered the black berry walnut aai bowl. It was so","useful":1,"funny":0,"cool":0},
{"review_id":"oBxJQ3G-PVyYexj3dG1w2Q","user_id":"UvJ1v-KHmVYSNE_-t_EkMQ","business_id":"64o_nYvzIKwHFOSYSEm-qw","stars":5,"date":"2016-11-23","text":"For years I kept coming across people who work here as well as the family who own it, I'd never been to visit the pizza place!  Honestly, I was a bit of a skeptic, but let me tell you THIS PIZZA IS THE BOMB! We only ordered the Super Cheesy and it came with these SMALL dollops of buttery ricotta cheese strategically placed around the pizza, my GOODN it was fabulous!!! My husband says it's the best pizza in town and he's from Chicago!!!","useful":0,"funny":0,"cool":0},
{"review_id":"pws8a-xG1B-LuUk8QBxVNQ","user_id":"wP7T34JqQ63LWVzVexNjXA","business_id":"YDuZQyZZzloR40sPHTlUvA","stars":5,"date":"2015-10-06","text":"I 've been going here for years now and always have loved it! No matter which hair dresser I get, they are very attentive,caring, and ensure you are happy and satisfied with the outcome!! I highly recommend!!!","useful":1,"funny":0,"cool":0},
{"review_id":"vJSVZE8D1IyyZr7RgcTvwg","user_id":"08BwbeiANHBD_FZflQN9rw","business_id":"3EbGNDu48fktNVRViCSlkg","stars":1,"date":"2017-09-19","text":"I got Jimmy johns all the time and for a while it was great; I hadn't a problem with them. But lately, they've gone downhill. Not only did they mess up my order completely twice in a row, but the delivery people wanna give you an attitude if you don't tip them well enough. It was an hour before they arrived at my door. \"Freaky Fast\" is a big lie. If you want a quality sub, go to Jersey Mikes.","useful":0,"funny":0,"cool":0},
{"review_id":"_Pajuvg7Ib7YUvW8kd2AKg","user_id":"A-x0btDjxEgSq_xLDNgbRA","business_id":"VMXl3Dm1Nwvgwo1PVYTXbg","stars":5,"date":"2014-10-06","text":"BEST LOUNGE\/GAME ROOM IN TOWN....heck, it's the most down to earth & fun place in LA\/OC or Las Vegas.\n\nThe ability to socialize with a variety of people, listen to live music, play a variety of fun FREE games is all right in one location.\n\nGood drink prices, plenty of space and no attitudes.\n\nFYI, I have been to this place 3 times and each time, I have a good time.","useful":3,"funny":1,"cool":1},
{"review_id":"2lV18nX0Il5XxS8nW1YmpA","user_id":"ob794jdC2v5DuuzNN5waSA","business_id":"jMrpr92nMEhe4cC4FF00VQ","stars":5,"date":"2017-01-15","text":"BEST experience today at this store.  We brought our 7 year old daughter to find a fossil as she is studying them in school.  She wanted to get something special that she could share with her class.  The owners daughter immediately came up to us and went above and beyond with her explanations abour various items in the store.  We left with not just a fossil but many other \"treasures\" that our daughter is so excited to have... including a gift from the owner.  Not many family businesses that really care are around these days so we were thrilled about our experience.  Everyone at the store was a weatlh of knowledge and our family learned a lot today.  If you are a gem expert or just looking for something to do - this is the place for you.  Can't say enough!!! Thank you for your time... our daughter is so excited to go to school on Monday!!!","useful":0,"funny":0,"cool":0},
{"review_id":"UcXzDH1yct7bTjDaEs7q3w","user_id":"sGz2Naza66KPTlCeW1aNaA","business_id":"nmTOGH5cunMweQ0uNaG52A","stars":1,"date":"2015-08-31","text":"No pride in their work.  1 year and 40 days later I numerous buckles in the carpet.  I called and spoke with Ron,  to ask about their warranty for work. Ron looked up my file and called back the following day stating it's past 1 year, we can come out but there is a service fee of $60.00 to come out. take a look because it obviously needs to be stretched out","useful":4,"funny":0,"cool":1},
{"review_id":"uyHkMW72Rtvj4cu1hByiiA","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"h2cPIifmtPD029q4sthRSQ","stars":5,"date":"2013-09-24","text":"just had lunch here today. delicious, very cheap! $12 lunch buffet. you do not help yourself, instead they serve you a platter with 3 veggie dishes and 3 meat. It may seem like you don't fill up your plate as much as a standard serve yourself buffet, but it is very filling, and the quality is way better than a serve yourself buffet.\n\nNot greasy at all..this was superb! Delicious!\n\nI recommend it if you're in the mood for indian,, and don't like the idea of traditional buffets. This is cleaner, and the food is sent to you perfectly, not dry or mixed all together like in normal buffets.","useful":1,"funny":0,"cool":0},
{"review_id":"0HhCAnNbi9_12Y0dV09cjQ","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"jesEHiUvX8CzF9gRjwMZ3w","stars":1,"date":"2013-09-24","text":"I've been to a lot of restaurants..and if I had signed up on Yelp sooner I would have reviewed them all..but am soon going to catch up. I've been to very pricey places..that does not deter me, however this place was almost on the ridiculous side. \n\nHigh prices for sub-mediocre food!\n\nThe rice\/paella was flavourless, my mussels were a bit off too. I could of had tastier rice in Chinese take-out. That's not supposed to be a joke. That's true.\n\n$30 for a paella for one.$30 for rice. and it was not good. not even \"ok\".\n\nOn Saturday's they offer suckling pig..mmmm.im thinking warm, juicy, suckling pig. $14 for a small tapas! NOPE! COLD! DRY! arrrrgh. I had read the bad reviews before going, but wanted to give the place the benefit of the doubt.\n\nAnd yes..the other reviews are true..there is Arabic dancing as well as the Spanish dancing..which I must say, was the best part of the night! The girls did a great job entertaining. \n\n..but seriously..don't bother eating here. there are a million restaurants nearby that will probably be more enjoyable.","useful":5,"funny":0,"cool":0},
{"review_id":"fqFFk6EM6HUZyRZGjGxfww","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"C-56qFtgSD_60qP-9ZK-7g","stars":4,"date":"2013-09-24","text":"Delish! I went to this place once because I was craving Carribean food..and I don't know about too many in the Mississauga area..\nI ordered the Jerk Pork and it was tasty, juicy and fresh.\nPortions are great..and the price is right..my combo was around 10-12 dollars ( I got a pop with it too). \nIt's authentic tasting, and spicy.\nthere is only take-out, and I guess I took a star off because I felt I waited a bit long for take-out, but this isn't a fast food joint, so keep that in mind. It was nothing unbearable.\n\nI recommend that you check this place out!","useful":2,"funny":0,"cool":0},
{"review_id":"tPr9lwdMYytJkOXC40SOFQ","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"4MQaqhBUJCpghGukSWNq7w","stars":5,"date":"2013-09-24","text":"Yum! I made reservations for 5pm before the Leafs game on Sunday. We got a corner half boot\/half table infront of a TV (hubby loves to be at a tv in a sports bar).\nThey have a ton of beers on tap and they sell you samples for $1.77 which is cool, so you don't have to worry about not liking it if you really want to try all the flavours. My cousin got the first beer on the list, it was like a fruity pop type beer , which I liked because I am not a beer drinker.\nThe nachos are not skimpy on the toppings, loved that! The wings came out with celery and carrots and ranch sauce (which may not seem like a big thing, but some places don't bother with those extras, which suck because you spend so much on wings!)\nMy cousin had the black been and corn quesadilla , which to me seems to be lacking fillings, but she liked it, she's vegetarian..so at least she had options.\nHer BF got the avocado BLT type sandwich, looeds pretty big and yummy.\nDeffinately would come back for another pre-game, pre-concert, pre-event ( I go to the ACC a LOt!) drink!\n\nAll in all the best item, hands down, were the nachos. They layered the toppings and cheese (so you don't have a bunch of naked chips at the bottom), and were generous on the toppings, came out with salsa and sour cream (no extra charge for those)\n\nOH! Forgot...Sundays are \"Cesar Sundays\" ..$3.00 dollars for my fave mixed drink..Cesars..normally $7.50. They have 3 to chose from, vodka, gin or tequila.\n\n5 stars because it is an unintimidating sports bar\/bar with reasonable prices, and good food, and the service was good too.","useful":0,"funny":0,"cool":0},
{"review_id":"bdg0fMlETX8MTbUDzBa27w","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"atBul_9I4TtdozKU0mRBjg","stars":4,"date":"2013-09-25","text":"Via Allegro is the restaurant I went to on my first date with my now husband..so yes there is a soft spot in my heart for it..however let me tell you the other amazing things about this place..\n\nI've eaten here a few times over the years.\n\nThe bread they bring out comes in a variety of breads with a hummus dip..yum, easy to fill up on this alone.\n\nThe steaks are delish. \n\nThe mushroom soup is a specialty you must absolutely try!\n\nthe Napolitan Trio is passable, I've made better breciole at home on a Sunday morning..and it's a plate that is not worth it's cost in my eyes..so skip it..\n\nDesserts..the Crme Brule..it was my first date dessert and is still memorable!\n\nthere was a passionfruit \/ mango cheesecake that I tried there too..but it was a little too tart for my liking. \n\nThe entrees (steaks) come with nice sides like quiche, which makes a nice presentation.\n\nWine list is impeccable. Lots of great wines that you won't get at the LCBO.\n\nBetween courses they bring out a gelato aperitif to clean the palate. - Details are taken care of!\n\nAlso, you do not have to trek all the way downtown to get here..which is nice!\n\nIf you know someone that has not been here, and you're not close to downtown Toronto, bring them here..it makes a nice first impression!","useful":3,"funny":1,"cool":1},
{"review_id":"f6aZX4EbIVtL5yK64Tn68w","user_id":"GagjGfivWXV7y99P08VP3A","business_id":"9Jn6MJZMz2R6rcszqmXDqg","stars":2,"date":"2013-09-25","text":"To be fair, I came here for a Christmas party, so there was a large group of us.\n\nMy steak was cold (maybe because they had to serve a large party).\n\nThere was a waitress there that seemed always bothered when we asked for another drink.\n\nThe waitors we had that night were all polite though.\n\nThere was no vegetarian option on our set menu. When I asked the waitress if they had a vegetarian option for my vegetarian co-worker, she pointed to the fish option. I had to explain to her that this is not a vegetarian option, as my friend does not eat any kind of animal. \nEventually she suggested a mushroom risotto, she brought out an asparagus risotto instead..sure, why not.\n\nAnyways, I had heard good things about this place, so maybe, I might try it out another time, however, based on this experience alone, I wouldn't bother, so many other places that I can try out.\n\nThere is a delicious cheese tray with dried fruits and jams that I would suggest though.\n\nAlso, they can accommodate larger, private parties...so something to keep in mind.","useful":1,"funny":0,"cool":0},
{"review_id":"o-ZaX4CiJycvkHsZAakazQ","user_id":"rRjp0I3JHMIyMct46vQX9A","business_id":"ptQKiqqoxjJeDtyBA2nKKg","stars":5,"date":"2017-06-01","text":"Thank Michelle for a quick quote. All the information you provided helped me make a great decision! I recommend her!","useful":0,"funny":0,"cool":0},
{"review_id":"I8IMvHzNBEctxNbNzI9XgA","user_id":"KCQ8y6QVyqjYsTIYYN4BMg","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":2,"date":"2011-04-11","text":"I've stayed in many hotels in Las Vegas.  Unfortunately the Luxor was the worst one we have been in.  I know our stay may have just been an unlucky visit.  However, so many things went wrong.  There is a big difference from a 3 star hotel, and the 4 and above.\n\nWhen we got into the elevator there was an old lady trying to get to her floor.  Her card didn't work properly.  After we talked to her, she had been up and down 3 times and it kept passing her floor.  We used our card and it passed it once.  Finally it allowed us to got off on our floor.  Not sure about the old lady, because she was still on it when we left. \n\nThe room is okay.  We stayed in the original building, not the tower.  Supposedly the tower is newer.  We wanted the feel of the original building.  The bathroom is good.  The biggest problem I had with the room was that there was a table spoon size yellow stain right on top of the sheet\/comforter.  I say sheet\/comforter, because it isn't a comforter, but thicker than a sheet.  Luckily its warm enough to not need a comforter.  Any how, if I can see a stain on the comforter when I walk in, then it should have been noticed by those cleaning the room.  \n\nAfter we settled down we wanted to watch tv.  First off all hotels in Las Vegas should have a tv larger than 19 inches, and I would expect a flat screen.  Guess that's why they are not rated 4 stars.  Then again it is probably so you go out and gamble more.  We tried using the tv but that batteries didn't work.  It was too late to worry about getting batteries or using the small buttons on the tv for it to work.  \n\nThe internet is wired.  They haven't figured out technology for wireless yet.  It would cost too much to do that.  \n\nWe later used the elevators again.  Once again they didn't work properly.  Someone else was stuck on it again.  Don't follow the directions on how they tell you to use them.  It says to remove card quickly.  If you do, expect to be on there for a while.  \n\nAnyway, I would have rated it with one star, but the people at the front desk are really friendly.  Plus, the beds are really really soft.  If you like firm beds, go somewhere else.","useful":1,"funny":0,"cool":0},
{"review_id":"axI-aj7a0epTYkra5p0XQw","user_id":"YXW-E5cjsL-_BhRCCk_XpQ","business_id":"XB3TjpiaIAhAz-Jykr8qWw","stars":2,"date":"2017-10-03","text":"The service here was the biggest problem here, quickly followed by the price for what you get. There were 2 people in line, and two workers. After we put in our order we sat waiting for 10 minutes while the cashier talked to his friends and the other was MIA. 10 minutes went by with no ice cream even in process. I couldn't understand what was going on. The cashier finally got to our order and quickly made the ice cream and then stamped a mound of brownie on top (wasn't even brownie bites anymore). There was nothing special except for the fact nitrogen was involved and makes a cool spectacle while being made. Definitely the first and last experience there.","useful":0,"funny":0,"cool":0},
{"review_id":"izaXXT73RgpS7TVLIZafLA","user_id":"OHhwIMW1cT-pEvIkbrZxaA","business_id":"U6Xg4m-nCFnf0QpFjfAIKQ","stars":2,"date":"2015-12-18","text":"So annoying to make appointments there. They don't even answer the phone anymore apparently- tried calling a bunch of different times during the day and it always goes straight to voicemail telling you to \"leave a message and a guest service representative will call you back\" - like as if they've EVER done that. \n\nShould be able to just book your appointments online, or maybe hire people who are able to answer phones? really shouldn't be this hard. \n\nIn fairness, the place is actually pretty decent once you get there, the service is fine, but not definitely worth waiting on hold like an idiot for 10min every time to make an appointment just so you can leave a voicemail that will obviously never be returned. \n\nI'd rather pay more for a salon that answers their phones. #Fail.","useful":0,"funny":0,"cool":0},
{"review_id":"tqCYHE_3ciO0DhQh3oTNvQ","user_id":"OHhwIMW1cT-pEvIkbrZxaA","business_id":"O-uIEuv7JLUHajkemx_sVw","stars":2,"date":"2012-06-29","text":"Went here on a date during the summer on a patio. Kind of like a crappy version of Bier Markt. Beer was really expensive like $15 a bottle. \n\nCrowd is older like 35 - 45 type deal, all in suits. Mind you we went on a Wednesday night so that's to be expected.\n\nPatio is like a corridor, almost in an alleyway but definitely not the main attraction. The action is inside usually during the winter, but not a great patio place. This is more of the place you'd go to for a business lunch if your office is close.","useful":0,"funny":0,"cool":0},
{"review_id":"UVMQP5zHYvH_kLDt46PpHw","user_id":"CvuX8DMreb1T6LnzYm33fg","business_id":"t33qVzQ6AdSiq4lnI0KOyg","stars":4,"date":"2015-10-23","text":"We stay downtown, and Banger has become a go to place over the last year.  Coming from LA, the craft beer scene in Vegas is bleak but improving.  Banger is a solid brewery with a great location.  They make a lot of styles, and not every one is a hit for me, but I always find something I really like.  They usually have a nice fresh IPA, but they look to be committed to brewing every style possible.  Last trip I enjoyed their dark farmhouse ale.\n\nThe street tacos that made nearby are very good, and they are cool with outside food.  They had a in-house sausage vendor that was also good last time we visited.  The atmosphere is standard brewery taproom, but that is fine with me.","useful":1,"funny":0,"cool":0},
{"review_id":"4lULkyMASdvCdZdcL0rHtQ","user_id":"CvuX8DMreb1T6LnzYm33fg","business_id":"R0iz7n80-mDo2_uL_Q5ANg","stars":5,"date":"2015-10-23","text":"My favorite bar in Vegas.  I am primarily a craft beer drinker and Oak & Ivy has that covered with a small list of great choices.  However, I think the unique experience they offer is a cocktail  at their small bar.  Hand crafted cocktails to be sure, but I have never had a bartender spend so much time helping find a new drink or educating me about my choice.  Everyone in my group loved, loved, loved what they got.  \n\nIt was the only place we visited twice last trip. Saturday night there was a great band (Moonshiners) playing a the nearby stage.  I love the vibe of this place, and I did not even know about the cool roof top patio until last trip.  I hope this place stays what it is.","useful":0,"funny":0,"cool":0},
{"review_id":"tWysARHHIj-XZGuaa2CmCg","user_id":"b3QvdFJ_TWA5BWpgNh3StA","business_id":"jeTvVMOR8W_04xFsPjzOEQ","stars":5,"date":"2013-03-28","text":"When my wife and I started looking for movers to hire, I checked Yelp. It was apparent that multiple Yelpers had great experiences using Camelback Moving.\n\nAdd my name to the list of people who enjoyed using Camelback Moving! Our guys showed up to our apartment in North Phoenix when they said they'd be there. The guys were able to move all of our stuff to our Arcadia home in under two hours! Plus, the price was incredible - especially for the great service and care we received from the crew!\n\nIf I ever move again, I will definitely use Camelback Moving! If you're moving, I recommend you do the same!","useful":0,"funny":0,"cool":0},
{"review_id":"9fCq29aBdUIjJRUYuGgLmg","user_id":"b3QvdFJ_TWA5BWpgNh3StA","business_id":"wjxrA6dCaFOEAAqaZgblBQ","stars":5,"date":"2013-04-17","text":"After the recent dust storm, I wanted to get my wife's Passat clean. I usually go to a car wash in central Phoenix, but now that I live in Arcadia, I decided I would try the car wash around the corner from my home.\n\nI am very glad I did. The price was comparable to other washes, but the difference was the service. The wash was thorough and done completely by hand. Plus, the owner of the car wash was very nice and helpful at checkout.\n\nI will definitely be going back to this spot. You can try other car washes if you want something quick for the exterior...but if you're looking for a place that will give your dirty ride some TLC, than this is the place for you.","useful":3,"funny":0,"cool":0},
{"review_id":"QRTRmPqWKC-1i9yCoO69YA","user_id":"b3QvdFJ_TWA5BWpgNh3StA","business_id":"9vij1n-WqXnnEsgzmwnoXg","stars":5,"date":"2013-02-21","text":"Had lunch with my wife at Cafe Mix last week and was very surprised. This restaurant is in a Mesa strip mall and is very unassuming. However, once you step inside, you realize that you've found a gem.\n\nGreat atmosphere, excellent service and incredible food are what you'll find. Plus, the prices were great. While it's a 40 mile drive from my home, I definitely plan on making multiple return trips!","useful":0,"funny":0,"cool":0},
{"review_id":"NKyYJZ_vnZtcO75IzaAkJg","user_id":"b3QvdFJ_TWA5BWpgNh3StA","business_id":"8R_oemw4rNjJL6sd40O_oQ","stars":4,"date":"2013-04-17","text":"My wife and I stopped into Over Easy for breakfast last weekend. The place was very crowded (as we expected). After waiting for a table for about half an hour, we were seated in a very well decorated restaurant. While I wasn't too crazy about the food, I will say the service was great. Our server (known as Funnyman on the receipt) was the perfect blend of fun and responsible. I honestly wish there were more servers like him at local restaurants. The food is decent, but the service is something to remember.","useful":0,"funny":0,"cool":0},
{"review_id":"Ok_nYp9eeqV7cI_luVfYlQ","user_id":"b3QvdFJ_TWA5BWpgNh3StA","business_id":"nFR7dDedxRuBeZz_6Cdalg","stars":5,"date":"2013-02-14","text":"This is a favorite place for my wife and I to grab a margarita. This is arguably the best margarita in the Valley. We love to visit during their reverse happy hour. \n\nMost recently, my wife threw my birthday party at Cantina Laredo and their staff pulled it off without one issue. Our party of over 20 was served promptly and with a smile. \n\nWe love Cantina Laredo: their food and their wonderful service. If you're looking for great cuisine and amazing beverages, we highly recommend trying Cantina Laredo.","useful":2,"funny":1,"cool":1},
{"review_id":"5Cas81FM7NFLDJxqaXUrTA","user_id":"_R039ugzvleqrxr45UQAoQ","business_id":"TCWMgOiV0PxQkWE1SyBIWQ","stars":5,"date":"2015-03-03","text":"This place. This damn place.\nFirst off, you feel like a king just walking in and being sat down. Service unlike I've ever experienced, absolute 5 stars for sure.\nYes its insanely price, but the food and service make it worth your while.\n\nThe only thing that irritated me is when they brought out a bottle of Fiji water when you say yes to being offered water (assuming water is free!) and being charged $8 for it!!! Not OK!","useful":0,"funny":0,"cool":0},
{"review_id":"wHYWXJYQCADYFoOhm3lmcA","user_id":"_R039ugzvleqrxr45UQAoQ","business_id":"zVeW6IdmuTq81pz6s37oBA","stars":1,"date":"2015-03-02","text":"Slowest service on earth.\nGrace the pharmacist literally worked on whatever she was doing for a full 15 minutes before helping me out, even through I was the only customer there. I wanted to throw something at her.","useful":1,"funny":2,"cool":0},
{"review_id":"9qsba6hlDjwf9Rg-SeLYVA","user_id":"fGK7YaTrVO-ZC9CFcheskA","business_id":"IVKVk7ZAPdQi6S40UX0zyg","stars":5,"date":"2010-08-04","text":"Cathy and the crew are great.  My dogs have various food related allergies, and I have been able to find food here the suits both of them.  The new store is much bigger and Cathy is always looking for new products and suggestions, she only wants the best for everyone.  Even the groomers are great, now I don't have to clip nails anymore, which with my dogs is always a hastle.  \n\nYou'll always feel welcome when you go in, I recomend Barking Dogs to everyone who lives near by with dogs.","useful":1,"funny":0,"cool":0},
{"review_id":"r88oRKkeMUBqAaKEdSSObQ","user_id":"8xJrlD16tBqjWrTObfWGqg","business_id":"yt1C94WXeUokPsjyqWWaiQ","stars":4,"date":"2016-06-21","text":"Ate the Jerk chicken for lunch. Good food at a great price. The beef patty appetizer was awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"GqnqMlKIHQq8AREAyxHVVw","user_id":"5cnzc_LOv-RYHLp-8sygmQ","business_id":"uuGL8diLlHfeUeFuod3F-w","stars":5,"date":"2016-09-21","text":"Ron Chocolate is the best ever. Had the Mule Kick and it was off the chain. Changed the T.V channel to what we wanted to watch and accommodated our every need.","useful":4,"funny":0,"cool":1},
{"review_id":"PEFMReNtNZSPlRoQEvL9cA","user_id":"WyOBoJBt5S10BKWBvzh3Kw","business_id":"hoUxttJ4uNNiV6ui2Km4Pg","stars":1,"date":"2013-04-26","text":"DON'T WASTE YOUR TIME....... its an hour and a half you will never get back.\nI had free tickets, but I still wanted a refund....the best part of the show was the 10 minute looped video of actual old burlesque dancers a half hour before the show decided to start...\n\nthe show:\nI saw this show last night and it has moved to planet hollywood... this is the worst show I have ever seen here in Las Vegas, and that isn't saying much.  Apparently when it was at Aria it was a fabulous show and from the pictures on the website it looks like there is about 20 cast members, however last night there was the \"Star\" who was some REALLY high chick named Daisy from Brett Michaels Rock of Love on VH1 who was too tweaked out to remember the words to the 3 songs she \"sang\"..she sounded like a cat getting stepped on..it was so horrible the crowd, all 20 of us, actually groaned when she kept coming out...it was embarrassing.  Planet Hollywood is definitely not going to gain any positive word of mouth with that trash as their \"star\"...There was a total of 5 cast members, a man dancer, 3 female dancers, the trash \"star\" and a wonderful singer.. so I don't understand the video on the planet hollywood website that shows like 20 cast members with fire dances, acrobats, large production numbers, and men dancers..so not true...it is totally false advertising... it is a CHEAP knock off of the movie Burlesque and none of the dancers even had a burlesque type body and just danced like glorified strippers, they were incredibly skinny and out of sync.. The 1 star I gave this show was for the young lady billed as \"my singer\"\"...she was on America's Got Talent...She is an AMAZING singer, just as good as Christina Aquilera,  and is totally wasting her talent and time on this crap show.\n\nthe venue: \nthe venue was disgustingly dirty, it even smelled funny.  Before the show starts you are herded into a holding area, they call it a bar, where the tiny drinks start at $15!!  Then you watch the previous show exit down the steeeeeeeep 4 flights of stairs just waiting for someone to kill themselves on them.  You MUST enter the theater by walking up these 4 dangerous flights of stairs (I never saw an elevator, that is illegal isn't it?) and there are no assigned seat numbers, you are just placed in a row crammed next to each other, and then waitress rudely instructed me I was not allowed to put my drink in the drink holder, that was built into the arm of the chair, because it may spill. (WHAT?!?!)...my show had a total of 3 rows of patrons, maybe 20 people and now I know why..and when i picked up my tiockets the person asked me for my email and phone number and when i got home, that person had signed me up for an account which sent spam emails...I am so, so, so embarrassed for planet hollywood, not good business practices guys","useful":0,"funny":0,"cool":0},
{"review_id":"sCR1Rkcj2Snh7h3FM6k__A","user_id":"7zbzabHrHeNlM-72rnjDUA","business_id":"ry-FLqYclt7okJbdYcmOhw","stars":2,"date":"2010-03-07","text":"This place was clean and really cheap.  But it definitely doesn't look like they have changed any of the fixtures\/carpet\/etc since their heyday when Elvis visited! Lots of cigarette burns, smelly hallways, and worn out carpets. Good to stay at if you are just sleeping in the room (clean sheets!) but go somewhere else if you expect anything more than that.","useful":0,"funny":0,"cool":0},
{"review_id":"FLboIwfB2hHjUB5iEPxg4Q","user_id":"7zbzabHrHeNlM-72rnjDUA","business_id":"UpW3jyJ3_kTG7oDSflwnMA","stars":4,"date":"2010-03-07","text":"Stopped here while in Las Vegas for a trade show. The service was good, the place was clean with nice lighting, and most of the tables were full. Had the green curry and spring rolls. Food was great - I made sure to order mild after reading the reviews on here. The sticky rice wasn't exactly right - it was more like steamed rice - but it was still tasty. I agree with many other reviewers that this place is more Thai-American than purely Thai. But that's not a bad thing - the food was delicious, fresh, and fast. I definitely recommend Archi's Thai Kitchen.","useful":0,"funny":0,"cool":0},
{"review_id":"GawjL-OricL-Z8M6VWqbhQ","user_id":"7zbzabHrHeNlM-72rnjDUA","business_id":"InH8vElvAIsKRgxPfte4bA","stars":3,"date":"2010-03-07","text":"This place is alright. \n\nPros: \ncool ambiance, decoration, and music\ninteresting people working there\nsome good books, some strange\/quirky finds\n\nCons: \nLOTS of empty shelf space\nlimited selection\ncloses at six (kind of early for a book store)\na bit expensive for used books, especially those that are easily found","useful":0,"funny":0,"cool":0},
{"review_id":"Ib4qQo_93piazBNyn3-RJQ","user_id":"Cda6qxohX7H32d2RXwFYOQ","business_id":"D1BrHyiZON7u_ef-qt4_Uw","stars":5,"date":"2014-01-11","text":"Great meat quality,  came in late and it wasn't too busy so service was not a problem like in other reviews. Awesome cooooold japanese beer!","useful":0,"funny":0,"cool":0},
{"review_id":"MX2Kc9evmx8R0Qwp_aQN_Q","user_id":"IIpu9RnpXTJXd8dBY3n6vw","business_id":"son0P5-Q87v1X_75grNFEg","stars":5,"date":"2014-03-19","text":"Love the show! \nI purchased a deal for this show on Yelp. I made a reservation and had to cancel it. They were pretty nice about it and made the whole process easy for me. \nSix months later, I made another reservation. I went to see the show and enjoyed the whole 90 minutes I was there. \nThe venue is kind of shady but I didn't mind it too much. I went there for the show, not to stay. \nI like the female singer the most. She sang beautifully. I wish I had her voice! All 3 singers seemed to love what they are doing.","useful":1,"funny":0,"cool":0},
{"review_id":"dTdpgp_PbsrGoxhNJfx-Vg","user_id":"Vcgtj8dUkCKYpqUYjNMCCw","business_id":"PQER4ba8Q0zqB1G2QiXamQ","stars":1,"date":"2015-11-27","text":"The food is great that is the only reason for my 1 star\n\nHowever to the POS manager DON YOU HAVE SOME NERVE!!\n1st off hire more staffing if you know that you are hurting with the wait time and service. (Common sense)\n\nWe waited 20 mins to be seated not bad but then 45 mins to an hour more just to get our food!!! You were arrogant and rude you yelled at your poor waitress who was trying so desperately to accommodate to her full area. Everyone was upset! You them tell me nd other customers that our meal would be comped which it wasnt. Now the thing that truly upset me was our poor waitress was so upset she was crying. She was  apologizing for the service since the other waitresses were grabbing her food and she couldn't provide the service she wanted....never ever put down your staff in front of clients!!!\n\nHorrible service not because of the waitress but because of management!!!! \n\nFire DON hire someone that knows what he is doing, maybe then he can stop comping out meals!!!!!! And make it enjoyable!!!","useful":10,"funny":1,"cool":2},
{"review_id":"-9q-IbXn7tWfpvhnTreA6Q","user_id":"g0eNItk7fD9dQHFktJK1SA","business_id":"aLdMqYoHqc77JjOybdPX-A","stars":4,"date":"2011-08-26","text":"Overall, a great place to eat.  However, the one negative on JT Walkers is they serve THE WEAKEST mixed drinks we have ever had.  I seriously wonder if they even put alcohol in them.  We have experienced this on numerous occasions, both in the main dining room and upstairs with a number of different bartenders.  Its discouraging to pay $6+ for a drink and get syrup and flavored fillers.  On the positive side, they have expanded their craft beer selection and have a very nice selection both draft and bottle.  They also have a great appetizer selection and all are excellent.  Their entree selection is fair and needs rotated.  However, we have been pleased with the quality and quantity of food we have had.  If JT would take a lesson from Boltini's and serve a quality mixed drink he would deserve a 5-star rating.","useful":1,"funny":1,"cool":0},
{"review_id":"_wuyuJv6JQ5703jwQt44_A","user_id":"gy_x9557oKnN7EsXGwvFiw","business_id":"lc-yKyqfmLSrKfUuSpxRSg","stars":5,"date":"2016-10-19","text":"Very professional tattoo shop. Justin has done multiple of my tattoos and a piercing I would recommend this tattoo shop! The owner will always help you out when needed!","useful":0,"funny":0,"cool":0},
{"review_id":"J20xOHCUaG0Vzy_uamJxuA","user_id":"o-RkULLEDlt2VpzTEBSATg","business_id":"xAboCt1b_NoMjzTPOGPM8g","stars":1,"date":"2017-02-24","text":"The burger was so tiny and when I told the cook perhaps owner all he said was \"really\" no customer service. They don't care about the customer. My brother and I will never eat here again   This is not a gourmet burger establishment. Terrible","useful":0,"funny":0,"cool":0},
{"review_id":"hEbLw715y4UzsZCS_KgZSA","user_id":"f1QkNRfDWTMFKEuTY1Br4A","business_id":"_t9UFLwf-uTKq9wLatjXVQ","stars":1,"date":"2016-03-06","text":"Holly the owner lies to your face l won't be back. Plato's closet is ridiculous!!! I wish I could post negative stars.","useful":3,"funny":0,"cool":0},
{"review_id":"RIlXbV_6J59bIuGCvvTqwQ","user_id":"e7NvUKk5ofaI4e9aGPMwgA","business_id":"sLkk5In7aD-Ae0WefhroFw","stars":5,"date":"2012-09-13","text":"I had contacted this company about coming to my twin girls' 7th birthday party. My girls declared they were too old for a princess and she suggested having a \"diva\" hostess party.  I also had ponies at the party.  Everything ran smoothly and I was impressed with her outfit and hair which looked perfect as a diva hostess.  The girls were enthralled with her.  She did some games and led some dances and singing.  Afterwards she did face painting and even balloons. I have recommended her to others and will continue to do so. It really added a special and memorable experience for everyone at the party!","useful":3,"funny":0,"cool":3},
{"review_id":"jb8Pdich6h3I_yf7FdHrCw","user_id":"e7NvUKk5ofaI4e9aGPMwgA","business_id":"3SAFbn21EiQwH6a2L62wyQ","stars":5,"date":"2012-09-30","text":"We have been going there for over 2 years.  My girls only do the recreational program but they have something for girls and boys from ages 3 & up. They have a competitive team and another program that some of my friends' children have been invited to join as a fast track to preparing for competitive gymnastics. My girls have had positive coaches and lots of fun.  I like that they see the team practicing when they are there so they can see what dedication and talent those girls have. I also like that they have several levels that your child moves up so they feel a sense of accomplishment.  Every few sessions they evaluate your child and the skills they have as mastered, still working or beginning.  I feel like kids can progress and the coaches are aware of when the kids are ready to do so. My girls have moved up 4 levels since we started.  When they are ready to move up, they do, they don't have to even wait for the next session.  Since we do recreational gymmastics, I feel it has been an excellent balance of conditioning , skills, and fun that keeps my girls looking forward to going to gymnastics for over 2 years now!  We had their birthday party there and it was great.  You can choose to go 1x, 2x or 3x a week to help fit your goals for your athlete. They also offer a free trial class!","useful":14,"funny":0,"cool":1},
{"review_id":"_v4AHe5FtniMJyKFJIcwbg","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"z6puJBjp677RIcu8pQbjFA","stars":5,"date":"2015-03-12","text":"Great experience! Rhianna took great care of my wife. She is so relaxed after getting spoiled. Clean facility classy decor. Friendly staff . Gave us local discount.","useful":0,"funny":0,"cool":0},
{"review_id":"hEsAhX_ujyiEK9fW0PTN5g","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"LNOnYo13ggdoEGD-syYHIA","stars":4,"date":"2015-04-06","text":"Went for Easter brunch after church.\nWas really good lots of selections.\nLine\nMoved pretty quickly.\nOur server was Laurie she\nWas very personable .","useful":0,"funny":0,"cool":0},
{"review_id":"QEhbgC-3BbK9rDmlBl96Lw","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"3GEEy7RP6e4bT4LAiWFMFQ","stars":5,"date":"2014-11-25","text":"Love this place! We had\nCalamari ,\nPizza margherita and artichoke Joe....\nGreat with beers\nAnd good wine!!!  We come here anout once a month great place!","useful":0,"funny":0,"cool":0},
{"review_id":"D0pJOLd7QPnGbYBDIw6uIw","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"e6MbizDdtMLDMnc8LDmYrQ","stars":4,"date":"2015-01-15","text":"Great salads and sandwiches a huge variety to pick from.  Everything looks freshand clean as we entered .\nWe went basic today with a tuna hoagie and caesar salad , wife had the soup of the day said it was  very good. \nGood prices. Convenient.","useful":1,"funny":0,"cool":0},
{"review_id":"NDP_uHddvNormoVdbgsjvg","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"WpI5MZC3XzlTpcUOKXzCbA","stars":3,"date":"2015-04-07","text":"Lively place,\nNice view of city.\nServer, busser ,\nExcellent.\nNachos disappointing, came\nOut\nWell\nDone and looked\nLess\nThan appetizing.\nPork entree was good, my wifes\nVegetarian enchiladas were\nAverage. Lots of\nFood for the price .","useful":0,"funny":0,"cool":0},
{"review_id":"HmNKoJ-Ad3GYoZKVvhv0Og","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"pvPCygmcmKVZYsaV1E_MfA","stars":5,"date":"2015-06-08","text":"Our family has been coming to Dr Johnson for many years.  He is by himself not part of a group which is a definate plus. He is right on with diagnoses .... A rare breed in this part of the country.","useful":0,"funny":0,"cool":0},
{"review_id":"ej_XivnKpN40GSTyFSg_jg","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"At2bqa8emnEr5WNIosi0ow","stars":1,"date":"2014-12-01","text":"No worse customer service than having your customer ask what kind of juice do you have and the server pointing to the menu and replying it's on the menu!!\n\nSeriously?!!!! Okay food and bad server.","useful":0,"funny":0,"cool":0},
{"review_id":"6AmMTA7ca3DMIlv7Z4F2hg","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"wA1U55zALdVuk-9S4GhECg","stars":1,"date":"2015-01-21","text":"Do NOT use this company. The guy Arnie is a con artist. Look up his records.\nHe should be in jail not in business.","useful":1,"funny":0,"cool":0},
{"review_id":"bqENrVaOttQ7QI8FNCihWQ","user_id":"vyZfNyeUJGRJvFDQfvKu-g","business_id":"ymwUAvCK7Qmf3IX58XqLGw","stars":3,"date":"2015-06-02","text":"Came in for lunch. Good soup potato and chicken enchilada. Nice salads had the southwest chicken salad with quesodilla.\nFlavored teas are good too. The hostess is an older\nLady who is sweeter than pie. Perfect way to be greeted.","useful":0,"funny":0,"cool":0},
{"review_id":"xyyaKIq8KBMyukPPwsj1Pw","user_id":"aGpRI6u6xNygpcSfkFp0eQ","business_id":"r8hF3kwnZzxTo1IYNcI6rg","stars":5,"date":"2017-12-01","text":"Awesome decor in this little restaurant. Food is delicious and a little different than traditional Mexican restaurants, more like from Mexico City. Waiter was super friendly and attentive. Get the sangria!","useful":2,"funny":0,"cool":1},
{"review_id":"gu4NzDysQ2Rnrs1-q1hWZg","user_id":"VeaLdENA40cM-v_-MPYKXg","business_id":"mxQaRW6HZxXcvHSo31H-Yw","stars":5,"date":"2017-07-09","text":"The breakfast is always great. But the new angus burgers are superb. I have been coming here for years and I don't see that changing. If you want to relax and watch the world fly by you should take a seat by the window and enjoy the food and service.","useful":0,"funny":0,"cool":0},
{"review_id":"qAN5dJWGxmgWenKbLwp2MQ","user_id":"W1wXnP-_rd5Ty3WWGuzYwA","business_id":"yvqcZrHixuf_oIUW83xUcQ","stars":1,"date":"2015-06-07","text":"Bland, Plan, Boring lack of taste... If you want cheap horrible mexican food This is it.\nI was so bummed out my party of 5 all left there plates almost full Great tap water horrible food \n\n  \"MY ADVICE STAY AWAY BLAND TASTELESS FOOD YUCK  SUPER SAD\"","useful":0,"funny":0,"cool":0},
{"review_id":"ofR6iVsk_wQwRA_KBh8UKw","user_id":"YEQjU6br1w9A-ig91eCIJg","business_id":"NNzM-cgYfWGv6xp5wnwq1A","stars":4,"date":"2015-05-14","text":"I needed a haircut on the fly so I called and got in right away. He did a great job on my hair.","useful":0,"funny":0,"cool":0},
{"review_id":"IOFIV7t8CJZkuTby0dL8Yw","user_id":"MGnmAwX1YppagV8oSUdFFA","business_id":"WvT95JVFr8-j2j0KrCvdYw","stars":5,"date":"2015-01-25","text":"What a wonderful company to have do work on your vehicle.From the time that I called I was surprised at the way that this company treats you on the phone and in person. They were very  professional.I received a call the day before to confirm our appointment and Eric called when he was on his way.Eric did an excellant job and checked and double checked the car when he was done. I would recommend this company to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"ib067LAJMkmRa9_cNF94kw","user_id":"DMnL7GxaQGEB3Uibp_mxYA","business_id":"fBdj8Vzhm7UHgpr6LXqJZg","stars":5,"date":"2013-04-16","text":"I was planning a birthday party for my mother, and having recently moved back to Calgary after living in Texas for 15 years, I was unfamiliar with the local bakeries. A quick google search and a check on Yelp led me to Orchid Pastry, a locally owned shop in a strip mall on Centre street not too far from my house. Their website gave me a good idea of the types of pastries they offer, and I was sold when I saw that they make a tiramisu cake with real fresh cream. I ordered a 1\/2 sheet for $70 which could probably feed about 35 people and was very impressed when I went to go pick it up. The cake was gorgeous, and the flavour was everything I had been dreaming about since I ordered the cake a few days earlier. Light, fluffy layers of cake sandwiched between light, creamy layers of espresso flavored tiramisu goodness. Everyone at the party loved it (most importantly, my mother), and wanted to know where it came from. I was happy to refer them to Orchid. I will order from them again and can't wait to go back to try some of the other pastries they serve in the shop!","useful":3,"funny":1,"cool":2},
{"review_id":"4Z8IA8eXF1h-bxeI6ORu7w","user_id":"L4fONajwe1mhtb-uTmabWg","business_id":"TTpgjbrSyxwHHzE5bIF-Rw","stars":5,"date":"2012-10-27","text":"Myself and Wife had visited Vegas for ??? - Yes Pure fun and stumbled on Namaste Indian Cuisine. It was the best food we had in Vegas. The owner Melque was so kind and attentive and always going out of way to make us feel comfortable. The food was of course amazing and me being Vegan - I was just amazed at the choices. So we decided to go back again before we left Vegas for Buffet and the food again was just excellent. Everything was fresh and service always the best. To top off the wonderful food - Melque( the owner - a professional singer ) also sang some beautiful notes for us and made our lunch special. So what can you ask more - Good food - Good Music and Good Ambiance. We will surely be back when we are in Vegas - We miss you Melque!!!!!!! and of course the wonderful food - Please open one in Denver CO and we will be your loyal customers!! Keep up the great service and food.\n\nSairam Hiremagalur and Sinduja Raghavan\nDenver CO","useful":1,"funny":0,"cool":0},
{"review_id":"fzuLTzQ1iNB-gaeOiy6TGw","user_id":"BTHVTy0WiSQ1YVINd2jEmQ","business_id":"GOE47b3LYDpjKpFRAUsVNg","stars":4,"date":"2014-02-22","text":"Food was very good, good prices and excellent service from the staff. Located in the o2 bar which is a fun bar environment with plenty of bar games. I cery relaxed nice environment to unwind at the end of the day.","useful":0,"funny":1,"cool":0},
{"review_id":"1t_8c-gLzj22gtlF7k3U4w","user_id":"BTHVTy0WiSQ1YVINd2jEmQ","business_id":"-ZBfr1BHvArFp1d6XH8jOQ","stars":4,"date":"2014-10-09","text":"If the classic root beers and sodas don't sell you then the burgers will. Lots of choices of burgers but every one of them is great!","useful":0,"funny":0,"cool":0},
{"review_id":"clxGb20TGduuofqS1SCbug","user_id":"wNJWiN56z2kNmDXNRU0ABw","business_id":"cLeYiKG14AGURvrcaCPytw","stars":5,"date":"2014-11-12","text":"I have been their customer for years and have always received an excellent service. Not once I have seen difference in excellency of services, product prices are very competitive. I recommend this store for all the smokers and specially hookah enthusiasts.","useful":1,"funny":0,"cool":0},
{"review_id":"UfRDUmyNA3yxNPIk_dry-A","user_id":"wNJWiN56z2kNmDXNRU0ABw","business_id":"FYa3GUro-ezTM9zvKiocFw","stars":5,"date":"2015-04-28","text":"Anything in their menu is delicious, I have tried all famous Greek restaurants, this one by far is the best.","useful":0,"funny":0,"cool":0},
{"review_id":"6DJxsS0RXJSIF58MTThyzA","user_id":"wNJWiN56z2kNmDXNRU0ABw","business_id":"mR7tCPuk37W_CoFcNEI8rg","stars":3,"date":"2013-03-31","text":"Price wise good however the rice wasn't good, it was under cooked. The yogurt sauce wasn't same as I tried middle eastern or Mediterranean  sauces elsewhere. Service was good that's why it will be unfair to give them less than 3 stars ***","useful":0,"funny":0,"cool":0},
{"review_id":"XvjDoqWEbDxydpaOVY8Xbw","user_id":"4BjxEeX9a8HSGHeYtZpCcA","business_id":"XH46cVevXAwApGLVuZ3fqw","stars":3,"date":"2012-11-05","text":"I have been there many times of the last few years. I LOVE their garlic naan bread!\nI used to love their Chicken Korma, but over the last few months they have changed the recipe or use a commerical sauce. It is thinner and yellower than it used to be, and just isnt as good.  I will go back and try another dish, but miss my favorite korma!\nI was there last week and a young lady was our server. She was very attentive!","useful":0,"funny":0,"cool":0},
{"review_id":"rkztkhjlGsQcuE13rDYA3A","user_id":"NxN-cz8k7mNdpYNXAOBh2Q","business_id":"8qnPy-4QV1VGkoeu2LGa9g","stars":5,"date":"2016-01-11","text":"This review is strictly for the ICU. My father lives out of state and was rushed to the hospital in Arizona. They didn't have the resources to treat him and sent him to Sunrise. We are out of state in California and having to deal over the phone. The nursing staff was amazing and the doctors were kind and informative. He was in ICU for a week when we had to make some end of life decisions. We drove in from Los Angeles and met with Dwight, the overnight nurse. He was patient, kind, understanding, compassionate, there aren't enough adjectives. The next morning, we had to make the decision to take him off life support. It's not easy but it was made a lot less painful by having nurse Kevin there. Not only was he super supportive, caring, patient...he listened to everything, he called funeral places for me, he brought my niece and nephew apple juice in the waiting room and stayed with us until my father passed on. He is an amazing nurse and wonderful human. I hope he knows how much we appreciated him on one of the hardest days of our life.","useful":1,"funny":1,"cool":0},
{"review_id":"HvmMcGJLTpiJ3I2VAQ5Yng","user_id":"zn_N7djICfLTcbGxylKspw","business_id":"BCAw9a_kyx2RddRH9tMmKQ","stars":4,"date":"2010-11-10","text":"777 is all you need to know when visiting Mr. Lucky's.\n\nI had heard from a friend about this off the menu deal that gave me a steak, 3 shrimp skewers, and some mashed potatoes, BOMB.com for the $7.77 price tag.  AND there's nothing a little A1 and ketchup couldn't fix. \n\nFor what it is, I can't complain.  You get a whole lotta bang for not a lotta bucks.   I say you pocket the savings and go help support the local dance bars, win win for all.","useful":1,"funny":0,"cool":0},
{"review_id":"NPR3nM-CuuZrIUK5tlE7VQ","user_id":"Zn8oNvw27ODCKJj7M8lLuw","business_id":"pI7ZoZ6_ToSzMuhVk4O4-g","stars":5,"date":"2014-04-13","text":"I started the HCG program 3 months ago and I've lost 35 lbs already. The staff is so helpful and really support your weight loss. I'm half way there into my goal weight so I look forward to dropping more pounds!","useful":5,"funny":0,"cool":0},
{"review_id":"AtmUe0N6C9jk8v73pEqKTw","user_id":"Zn8oNvw27ODCKJj7M8lLuw","business_id":"hL5tldgv2eLcL-AUnPZ9gA","stars":5,"date":"2017-12-23","text":"Talk about excellent customer service! I cannot say much more about this company than that it is simply the best plumbing service I've ever received. The customer service is on point. I love how they follow up with you after the service they've done for you. The follow up calls are great bc it shows that they really about their customers and their work. I can see they take a lot of pride in their service and follow through till the end. Also, I love how they are 24\/7 for emergency needs or to simply talk to a professional on the phone to troubleshoot the problem. \nJust today I received a card from them with a Starbucks gift card and magnet from Pure Plumbing. What other company does that?? \nI recommend Pure Plumbing to anyone who wants fast and efficient service with their plumbing needs. Can't say more than that they are wonderful and has helped solved our plumbing problems!","useful":0,"funny":0,"cool":0},
{"review_id":"cB7fT0vl9o6qGKUTo47KZA","user_id":"fdX2wiM5_2lT0DT3TvoxaA","business_id":"mFU9j43H8E5DhBEMPjElsA","stars":5,"date":"2016-11-30","text":"Affordable, Responsive and Reliable. I had a good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"RQ7-jzEw_Q80UZDomds3EQ","user_id":"IoZaC29J0K3GF6A8qg6bsg","business_id":"6K59UtSTXt56F4rMo1T4tw","stars":1,"date":"2013-11-27","text":"I bought a toyota Sienna SE at Longo Toyota in Los Angeles and for the first 20k miles they have been handling the service maintenance of my minivan. They have excellent customer service at Longo. When you come in you are greeted right away by people who value their customers. They ask you what you needed done and if you have any concerns. They ask you if you need a ride somewhere incase you don't want to wait and if you are waiting they will direct you to their lounge and inform you of all the amenities that they have. If they told you it will be done in 45mins it usually gets done. But if not you usually get a call informing you of the situation and apologizing for making you wait more than you should. After your car service the service manager will approach (if waiting) and let you know your car service is done. He will CLEARLY explain everything that was done to your car  and inform you if there is something else that needed to be done right away or in the near future. \n\nAll of these things i mentioned are lacking at Centennial Toyota. Basically they just ask you what you need done and they take your info and your keys. After service is done they call you and get the payment and have you on your way. All of this is mediocre service. \n\nAt 34k miles i had my van serviced at centennial toyota which includes tire rotation. And at 39k i was having the tires replaced at discount tires and was shocked at what i saw. All 4 tires were worn out and cracked on the inside wall (not visible unless you remove tire). The steel belts were visible and protruding out. I knew they were worn out but i didnt know they were that bad. The guy at Discount Tires told me that i was lucky it didnt rupture. He also told me that this kind of damage didnt happen overnight. That if i had the car serviced 34k miles they should have noticed the problem and should have informed me. \n\nImmediately after having the tires replaced I went to Centennial Toyota to get an explanation from them. Why is it that they never informed me how seriuosly worn out my tires were. And all i got from them was this answer \"I'm sorry but we cannot bring back the past and see exactly what the person handling your service told you or didnt tell you. There are no video cameras here to substantiate your claim that you were not informed about your tires\". \n\nSo to everyone reading this, if you value your safety and the safety of your family\/passengers DO NOT BRING you car for service here!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"v9hGh4QNPJ0taiarjVAiHw","user_id":"UkmqSW27QHOL2E-wFxfrGw","business_id":"LNOnYo13ggdoEGD-syYHIA","stars":1,"date":"2016-12-31","text":"Horrible buffet and customer service! They charge a 2 year old child who doesn't eat crab $30, which is ridiculous. The quality of the food has gone down, no gelato.","useful":0,"funny":0,"cool":0},
{"review_id":"00L3LTXIqCRhYhicU4y6Hw","user_id":"UkmqSW27QHOL2E-wFxfrGw","business_id":"3vxIqhm2jCVjkUWtmDvTsw","stars":1,"date":"2017-08-18","text":"I waited for 20 minutes and still no food. I am disappointed in this location. It's suppose to be fast food not a restaurant. They aren't even busy!","useful":0,"funny":0,"cool":0},
{"review_id":"KrKm0g5IpvZhPI7r9aKVBw","user_id":"UkmqSW27QHOL2E-wFxfrGw","business_id":"h_g5HV6Fw2rinZ3xqFwygw","stars":1,"date":"2016-12-31","text":"I paid a lot of money for my whole entire family and the service was horrible. The waitress was rude and had us put on plates on her tray. When she thought that we weren't going to tip her she flipped out was very rude. They tell you to leave shortly after your visit!!!!!!!!!","useful":0,"funny":0,"cool":0}]