[{"review_id":"IivQiE_hZmdno0GSyG7t-Q","user_id":"oUJpTc3Oejrj8waW7tOxcg","business_id":"mxbHNHRrCNTjkzyLCnsHUQ","stars":1,"date":"2015-04-09","text":"I found Dr Askari to be arrogant and demeaning .. I have never felt so uncomfortable with an Obgyn before .. I will be looking for another Dr ...","useful":3,"funny":0,"cool":0},
{"review_id":"yEdNe8BujssxnE2T_LGIow","user_id":"oUJpTc3Oejrj8waW7tOxcg","business_id":"Whx8DVjPVUpldsWk8Hea8Q","stars":5,"date":"2014-04-08","text":"KALISHA  I love love love this salon ... Most of all my hair dresser :-) Kalisha has always done an amazing job on my hair from the very first time I sat in her chair 4 years ago ... From the cut to the color from light to dark or dark to light always always on point ... Kalisha thank you for making time for me today on your day off ... Your the best","useful":0,"funny":0,"cool":0},
{"review_id":"7Ty_dKh7iyiV0HnMAYLt3Q","user_id":"oUJpTc3Oejrj8waW7tOxcg","business_id":"JeDuMHq5rnUSPC39kSgEqA","stars":5,"date":"2016-06-02","text":"I was very pleased with my visit ... Dr Leibowitz was very  knowledgeable and listened to my concerns ... He explained what needed to be done and what may work and not but I know I have options.. I am looking forward to having him correct my problem... I feel very confident that he will be the one who can fix my ptosis.. Thank you Dr Leibowitz:-)","useful":1,"funny":0,"cool":0},
{"review_id":"qsWtnOiy8DFey_f-jR0DOw","user_id":"RbZyRY5IAAIHA6ni267KDg","business_id":"g_H_ylYgE74EIVSTv8aO6w","stars":3,"date":"2016-05-12","text":"I'm not sure if there's been a change in ownership or management but the quality has diminished. \n\nExample the pad thai is now watery and very limey. And no longer do they have packets of peanuts.\n\nDisappointing.","useful":0,"funny":0,"cool":0},
{"review_id":"2iV8jJ7Xx7m8_koZ6DC7NA","user_id":"TfkyUYzgGB_OD4v6N7TpRQ","business_id":"1Gg8nehKawegUHIfNihgAw","stars":5,"date":"2017-01-03","text":"My two daughters have been coming here for the past 2 years.  The facilities are comfortable, with several convenient areas (stadium seating for viewing the pool, snack bar, tables & chairs, playroom).  We've had the opportunity to experience many different instructors, all of whom seem to have a genuine interest in and a special knack for working with young kids.  The swim objectives at each level are clearly demonstrated to the kids during their lessons.  All of the staff, both in and out of the water, are very personable, helpful, and accommodating......whether it relates to fear of the water, scheduling lessons and makeups, a child having a bad day, or swim techniques and advice.  My girls started out with no swim abilities or experience, both of them crying during their lessons for the first few weeks.  Now they both can swim and love coming to class each week!","useful":0,"funny":0,"cool":0},
{"review_id":"cFKNZER6GRVtIaPseKdWNQ","user_id":"DP5euJjaNH0Ffte0-ZO8cw","business_id":"yEOu75XjwczngvWWlr0M_A","stars":1,"date":"2017-06-05","text":"I don't usually write reviews, but I felt this was necessary. Today was my first and last time coming here.\nLet's start with my experience with scheduling the appointment. I called the salon and was answered by a man's voice with a simple, \"Hello?\" I wasn't sure if I dialed the correct number since that was the only thing he said. I asked if it was Binh's Hair Salon and he replied with \"Yeah.\" As that should have been my sign to just hang up and schedule elsewhere, I proceeded to give the business the benefit of the doubt and asked if I could schedule an appointment. The man said, \"Yeah, sure,\" and hung up as soon as I said my requested date and time.\nSo, the appointment day came and I arrived early. When it was my turn, the woman at the desk told me I could sit in the next available chair. I asked if I could get my hair washed prior to my haircut and she quickly said, \"You can or you don't have to, it's five dollars extra if you want your hair washed,\" and I said yes that's fine. She responded in a way as if it were an inconvenience for her to wash my hair as she directed me to the sink.\nFast forward to the hair cut: as he was cutting my hair, he kept looking away and glancing at the door as he snipped my hair!! My hair ended up looking choppy and uneven. I was so upset with the results, but I didn't want to cause a scene and just paid quickly in order to leave asap.The woman's demeanor quickly changed and she was all of sudden super nice and polite as I pulled out my payment.\nIf you're wondering, no it has nothing to do with the language barrier, because I'm Vietnamese as well! They were just incredibly rude and unprofessional. Poor quality hair cut and poor attitudes. I thought the other reviews were more honest, but I think it's inaccurate. I probably could have gotten a better haircut and service from a student stylist.","useful":2,"funny":0,"cool":0},
{"review_id":"E-x1wgaQ2-jXHH5FFpSIUQ","user_id":"WHUjsgQTwchv4qkGawbjSg","business_id":"bRZSm_1UQdmU6QWZfO9h6w","stars":4,"date":"2016-05-21","text":"This place is awesome! I am addicted to the Save The Planet Curry! I also love the spring rolls and the Kung Pao Chicken. The service is great, the restaraunt is very clean. Really great food.","useful":1,"funny":0,"cool":1},
{"review_id":"-Rx0Yu90NZviOwkzaZqprQ","user_id":"WHUjsgQTwchv4qkGawbjSg","business_id":"-Ma5JqzuI_3xIAtpNJfQ2g","stars":5,"date":"2017-05-24","text":"This neighborhood thai restaurant has the best red curry, absolutely delicious! Very clean, great service. Love the lunch specials, and they have a big menu with lots of tasty dishes to choose from.","useful":0,"funny":1,"cool":0},
{"review_id":"yQ6P1_CvM94wMLYw1T0UWA","user_id":"sZfZGrI592euyacKUcwQYg","business_id":"-GY2fx-8udXPY8qn2HVBCg","stars":5,"date":"2016-08-30","text":"Just opened a new account today.  So far I am impressed.  Nidia was able to coordinate everything via email for my loan and new account which is great with my busy schedule.  They were able to get me a lower rate than I was expecting for my new car I also refinanced my current car.","useful":1,"funny":0,"cool":0},
{"review_id":"ATLokOBZh2jGgRBz3CAGHA","user_id":"dhKBvfZ9Q_q_Z-7Oh_JyGg","business_id":"RbPg6h4tramTsGagjfFfdA","stars":5,"date":"2012-10-17","text":"Great salon! Cindy is the owner and she has done my hair 3 times and is fantastic. She really values her clients. The rest of the staff is super nice and helpful. The great part is the consultation to get the right haircut style you desire. Beautifully decorated salon with detail to making the customer comfortable and happy.","useful":1,"funny":0,"cool":1},
{"review_id":"5qMW_GqFm9UbkD00WixAgA","user_id":"aK1srnlZPBC8b-8Rk7NGCQ","business_id":"DkLkQTDISbGdEZXlVBdLmA","stars":1,"date":"2017-02-19","text":"Charges for delivery unlike any other jimmy Johns. Chips were expired. Stay away from this one.","useful":0,"funny":0,"cool":0},
{"review_id":"77QDbmosyw-EcFPr04l1iQ","user_id":"aK1srnlZPBC8b-8Rk7NGCQ","business_id":"J5ebC7fKqrSF8KuS8d6hgw","stars":1,"date":"2017-06-03","text":"Our hotel mistakenly sent us here but we were vegetarians. Don't go here if you're a vegetarian. They were accommodating however over charged us for veggies and chips.","useful":0,"funny":1,"cool":0},
{"review_id":"ZlBDEZmTDHydmYnVH1JCxg","user_id":"VuQug_nhR6T_kiVIBT2xaA","business_id":"KUxWPlt3Y_rq4ncjzFenLA","stars":4,"date":"2014-01-06","text":"I rarely do this but I am changing my 1 * to 4* for BRL thanks to the owner, Jake, who took the time to address my concerns regarding the original outrageous quote I received from them. After getting a better understanding of my needs and revising the quote we were able to get it in-line with my expectations. They went the extra mile and was able to help me install the door on the same day. That's what I call service! I am a fan and may actually become a repeat customer if the need arises. My hats off to Jake for turning a negative into a positive!!!","useful":16,"funny":6,"cool":12},
{"review_id":"EpnVOdjDJ_yW5LViaUYC1Q","user_id":"VuQug_nhR6T_kiVIBT2xaA","business_id":"HmsCerK_rub0Ulo0aC0f9A","stars":1,"date":"2016-05-04","text":"Sashimi Salad: OVERPRICED & UNDERWHELMING!!!  I love Sashimi salads and have enjoyed many good ones in many sushi different restaurants. Since I am in town from So. Cal on business and wanted to grab a quick, healthy and light lunch between appointments I decided to Yelp Japanese restaurants in my vicinity. I was delighted to see Hanabi was close by and had a 4.5* rating by 150+ people. When I arrived at the restaurant at 12:30 pm, the peak of lunch hour, on a Wednesday I thought it was odd that a restaurant so highly rated was nearly empty except for one other table. \n After I ordered and my sashimi salad arrived I understood why the place was so empty. \nMost sashimi salads I've had are made with healthy rich greens and other vegetables and a pretty decent amount of sashimi  making for a colorful, healthy and satisfying meal. The size of these salads are usually served in plates about 8-10\" in diameter. The sashimi salad at Hanabi was made up of a small amount of ice berg lettuce, one strand of pickled carrot, a small clump of white shredded radish with about 6 small pieces of sashimi served on a small rectangular plate approx 4\"x6\". The cost of this sad salad was $15, the same as what I have paid in other restaurants where I got a lot more. After my experience at Hanabi I find their ratings and review very suspect. I know it was just one item on their menu but the fact that no other customer came in by the time I left really makes me question the reviews. Sorry no offense to those who have submitted good reviews. Glad you had a good experience but I definitely was disappointed, left hungry and very dissatisfied.","useful":2,"funny":3,"cool":0},
{"review_id":"mCmD0BC1dFU5-Ufi-S2Dhw","user_id":"VuQug_nhR6T_kiVIBT2xaA","business_id":"1ZnVfS-qP19upP_fwOhZsA","stars":5,"date":"2012-01-19","text":"I love wontons and have searched the world over for great wontons. I have hit all the top wonton cities: Hong Kong, Shenzhen, Vancouver, L.A., S.F. and found some of the best shrimp wontons at The Big Wong in Vegas, who knew??? Wonton lovers, you won't be disappointed. :D  \n\nWe also tried their fried pork chops served with a freshly made sauce,  excellent and their Roti (a sweet fried crepe Thai dessert) was to die for.\n\nOwners were very friendly, prices very fair. Overall, this will be one of my favorite Vegas eats.","useful":1,"funny":0,"cool":0},
{"review_id":"XlbC3jcTzfX3lRHHqy5LaA","user_id":"hqbxv5kGMOapOAvGoRNuZg","business_id":"xQ_1s9C7M5j_v_CUv7e-YQ","stars":1,"date":"2017-01-08","text":"I moved back to area a few months ago. I decided to try LoAnna's again because I got a gift card. It took 2 and half hours  to get done!! I had a fill and a pedicure. Nails have white tips uneven and pedicure has the polish not covering all my toe nails!! So I go up front to pay for crape service with the gift card and they want me to pay the extra charge for using  THEIR GIFT CARD because its not cash. I told the older gentleman that it's YOUR gift card. He said that it has to be cash! Will not go back!! Premier Nails is my new spot!! No extra charge for using cards!!","useful":2,"funny":0,"cool":0},
{"review_id":"MNCYfmSwGQ-eMa7Fd_M6rw","user_id":"bVn-VeGx8DVgeDgLWVGc1A","business_id":"60N91qkHqdFCsyUMd_qVLA","stars":5,"date":"2014-09-13","text":"Al at Banner Plus is a five star operation and very cost effective.  I had two signs made for our church and it took very little time for him to complete and finish the job.\nThe signs came out perfect.  GRET WORK AL!!","useful":1,"funny":0,"cool":0},
{"review_id":"kT2NNfld_lwDjqAbv5X0iA","user_id":"0KfK7Q7Xt3QSK8Ilq_4jbA","business_id":"eYE7zd30ltLAS1V3ssdtrQ","stars":5,"date":"2017-06-28","text":"Was there yesterday for lunch.  Trying to eat healthy so I ordered the sauteed vegetable sandwich (served on a french baguette - probably not real healthy but ya' gotta live a little - right?).  The sandwiches are served with chips and a side salad.  Our Server knew I was trying to eat healthy, so she offered me a double serving of the side salad and to skip the chips.  I took her up on that offer.  The sandwich was excellent.  All the ingredients were very fresh and the prices were right!  My sons each got the \"Sconnie\" sandwich and paid a small up-charge for the french fries. They said the sandwich was awesome as were the fries. Our Server was very pleasant.  We will definitely be going back!","useful":1,"funny":0,"cool":0},
{"review_id":"rax4ItwKKgsqbtbHvw68hg","user_id":"Z-l8yGuh03kVLIwg-a5CUQ","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":5,"date":"2013-07-10","text":"Stay at rio hotel Las Vegas with my husband  last July 7 2013 and stay for only 1 night, I was so surprised for the room they upgrade. It was in 20th floor  a suite room and a 2 story room for no extra charge because I bought that deal in living social for only $129 with 2 buffet and 2 passes in voodoo club...so lucky!!!","useful":1,"funny":0,"cool":0},
{"review_id":"FGmjXtXZJqq3PhxH_V_eag","user_id":"JcdtTh_7v2O-UyNAGqkqCw","business_id":"czx3G3V_f-4ZDg9YKJ0YQA","stars":1,"date":"2017-09-03","text":"The food was all over priced and took forever. We were at the table for 45 minutes before the chef came over. The manager told our server to clean a table before getting our drinks after we ordered them. Terrible service. Will not be going back","useful":1,"funny":1,"cool":0},
{"review_id":"HZWJabgjXPbykTNl_VQfMQ","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"5Jf-9U16kMW-o2k8OUvTLg","stars":4,"date":"2015-01-07","text":"This is flatbread (Afghan style) central my friends. If its not here, it does not exist. Real good flatbread styles from the other side of the world. Oh and the deserts are real good too, take them to go. In goodness they have tea and such on the house, as is custom. Moustafa runs a good operation here, along with the ladies kept in back. As custom too, lots of smoking and chatting outside, no need to rush off.","useful":0,"funny":0,"cool":0},
{"review_id":"T7RXUz7o48eiQPG4mY6v2Q","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"WfLSfwsw6iuXxpm4U6nVZQ","stars":4,"date":"2017-12-05","text":"Boy ole boy, this place rocks me every time I go there. It more than helps if you know some spanish, or do your homework. Otherwise all your questions will be answered like your partially deaf grandparents, 'head shaking yes...', by the short central american ladies.\nI had the, Pollo Catracho-Pollo Frito Estilo Hondureño, on my last venture in there with real genuine horchata. I rolled out of the place literally. They do not miss a beat with sides and fresh condiments. For the gringos, there is the typical bottles of sauces and such. But WTF you need that for when you can eat the roasted jalepeno, onions and radishes. Damn. I have yet to go there for breakfast, because I usually want to do something in the morning rather than go back to sleep. lol. Now you know why they have them images of the mexican having a siesta on the cactus. The dude just ate here!","useful":0,"funny":0,"cool":0},
{"review_id":"fZEp_sZBcXVFxHhyz4c-6g","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"4K3EHSn_DHjdxUEoYos95Q","stars":4,"date":"2017-08-12","text":"There are days, when this shit is on my mind. Then it sinks down to my stomach and I find myself heading to Popeyes. But stay focused, because its also a minimart gas station, so if your a people person, like me, its like TV, they also have one blaring too. You can also feel outlawish, by getting \"free\" refills. They also have wi-fi, so you can slow your heart and arteries with greasy chicken and gravy with lots of salt and butter and comb or stalk whatever sites you desire. Plus look at all the weirdos coming and going. Oh and for you antique people, just behind this location is a big ass antique store, so you can waddle your way over, most drive, cause we americans, and settle that chicken looking at stuff you don't need.","useful":0,"funny":0,"cool":0},
{"review_id":"iqiaLu8UZaS_72eyshy18w","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"UY13CTgUqriT-fMxT2APLw","stars":5,"date":"2015-01-07","text":"I eat here many times. I am that single guy people look at and feel sorry for cause I am reading something and ignoring them, unless she is hot ;)\nYou cannot go wrong with any of the food here. Really.\nNow that its winter, its PHO and more PHO.\nAs custom men will serve you and the women will take your money, haha.\nCheck it out.","useful":0,"funny":0,"cool":0},
{"review_id":"o_5VlZsphMLerKUpR1-7ww","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"7MNBIoGznDHhC1AfxGWOFw","stars":1,"date":"2015-07-30","text":"Well, a few years ago, I started with the \"intro\" offer for $35, since then, it has expanded to over a $100 a month for the same service. They double bill you after the intro offer and then begin to add late charges, then start a new \"start\" date from your original date. I got my service date on the 27th, then they moved it to the 10th and now its the 30th of the previous month, basically cutting me off a month. When the cut you off and you pay, its another \"reactivation\" fee, yet its all computers. I could go on further with this corporate monster, but you get the picture, yet there is not other here in tempe, some how the politicians have sold it all to two corporations, the internet. Stay away if you can. Its all a scam.","useful":0,"funny":0,"cool":0},
{"review_id":"Y214qfpRO7-eYUMWAiaL4Q","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"CvGfyePXPjKt3btUj1h9uQ","stars":2,"date":"2015-02-13","text":"OK, so I had the $8.00 lunch. My first question was, what happened to these places??? Beyond the basic food, its filthy, food everywhere and the people, wow. I mean it looks like this is where obese people go to gorge. \"Oh, have a pint of ice cream and sugar to wash down that salad\" The lady in front of me was scooping some white-yellow pasta stuff out of the serving spoon with her fingers. The decor, whats with the baby shit green color and macro shots of tomatoes sweating? Tomatoes do not sweat. Oh and then some old lady in yoga pants. I mean, baggy yoga pants??? I had my salad and soup and left, the food was ok, but the patrons, leave you feeling no so good. So, if you want cheap nutrition and some OMG moments, go here.","useful":0,"funny":0,"cool":0},
{"review_id":"3ILxEm4yL9AWGRyJ1MtxbA","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"GdPWJo3z4ySEXpF7Wkn3FA","stars":2,"date":"2016-11-16","text":"My meat was dry again. When you order a drink, they give you a cup and point you to the coke machine, so service is not this place is style. Apache Blvd has become a middle eastern mecca of food, so they will have to shape up or ship out, since better and less expensive delights are all down the street.","useful":0,"funny":0,"cool":0},
{"review_id":"YBjhz7vwfWCC96ksw3FWHA","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"tnG4_L5bZiffTbaFru9EBg","stars":4,"date":"2015-01-07","text":"These cats got it all going for them. Taste, price and coolness. If your all into the scene and need to be catered to, like your paris hilton, don't bother. It also has a great market selection, mine being the deserts and sweets. The plates have some good choice, I go the way of a main kabob, rice (mmmm), hummus and fries. They also lay on the pita bread, so its all good here. Oh, and be sure to bring someone you can converse with or something to read, its not fast food, so relax.","useful":1,"funny":0,"cool":0},
{"review_id":"ao-A4plZnNeK0cCbavTKcg","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"mJHoOJH10A-cjtRdQCV6ow","stars":5,"date":"2012-09-25","text":"First and foremost, this is pretty much TRADITIONAL Navajo food. Not any other native american or american indian type of food. It is the basics, because in the real Navajo world, not the material world of Phoenix and urban areas, there is no electricity and such. Its not food all jazzed up with spices and thick sauces, etc, like americans like and desire. Certainly not the salty taste that is american food, or passes for taste. So, in the area of actual Navajo food, the Scared Hogan does it well. As for the expense, its organic as you can get, but thats the Navajo food way, and not advertised and used as a gimmick, like the american food way, hence, its a bit more in cost. An example is, the mutton (sheep) is bought on the Navajo Nation. Navajo's know tis because we cantaste the difference, between a sheep raised on Navajo land vegetation and sheep not raised on it. \nAll in all, the Sacred Hogan, is the best traditional style Navajo food served in the greater Phoenix area, except at my house, haha.","useful":1,"funny":0,"cool":1},
{"review_id":"MkRaa5RRRrywbrVeoQ4E_Q","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"RA1Jchnz3uQDg4YVHckKXQ","stars":2,"date":"2015-01-07","text":"You never know with this place. Today it was, \"We're out of that right now.\" I mean, they only have two type of house coffee and one is out. The pumpkin chocolate chip cake was oily, yeah, oily and with the light coffee I settled for, it was all half and half nutmeg taste in my mouth.\nOh and its also one of those places, people with no wi-fi sit around at ;)","useful":0,"funny":0,"cool":0},
{"review_id":"7CsHSm5Dvy-vkXTutiHZ4A","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"6YrmJ_pxLSTabcM_FFZhlQ","stars":3,"date":"2016-04-28","text":"I go here for one thing only. CORN DOGS!\nIf you like them good and hot, fresh, then this is your place. Somedays the special is corn dogs and they can be had a for a sweet price. \nThis is the place where us fat people get fat, straight up.","useful":0,"funny":0,"cool":0},
{"review_id":"uaskQtpbL8ShE5KhhYr0OA","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"HI56ArpYEbhEUeRx9Curpw","stars":4,"date":"2015-07-16","text":"First off, if you like ambience and decor, don't go here. If you like good Asian and Pacific Rim food, then do go here. These people do not, and I mean do not, f**k around with the good food they serve. What they lack in service, sometimes you got to wait longer than it takes to grow the food, they more than make up in what they do right and thats make good food from their respective origins. To boot, you always have enough to take home, now I know its american to over eat and one serving can serve an entire Vietnam family, but its good, to have some great lunch the next day. Tip: When you go in and see one table, get it. Smile at the lady, maybe even slightly bowing and make for that table. It can get crowded. Oh, and lots and lots of TOGO orders here for those who like TV or children with their food, hence the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"edhNXzZ80gd-_pNcyduQ0w","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"aVkVDJ01OgvNwhlCUz_bng","stars":4,"date":"2015-07-16","text":"These people know how its done. I have been there a few times now and I can say with good heart and full stomach, its good. Whats even better, is they treat you with respect. Now I know that may not play out to many people, but to me, the vibe you get from the staff, sets the tone, right off that bat, and its a good vibe here. I even take others there, when i want to be nice and have some class ;)","useful":0,"funny":0,"cool":0},
{"review_id":"bztuxZtBH__f05zBdZmX2Q","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"U_x3Ryer88VwUlqa71Np-g","stars":1,"date":"2015-07-16","text":"After a good movie at near Harkins, we went to this location in shopville. I order the most basics of greek food, a \"gyro\". Now, you would think this corporation would at least get this right, no. The meat was dry and four pieces of what passes for tomatoes in america these days, were just awful. So its on to the humus and pita bread. I mean did they store the pita in a steamer? Two of the most basics, ruined and awful.","useful":0,"funny":1,"cool":0},
{"review_id":"Rmj5AnMtwKZuVNDD4AS5Xg","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"lDUMAAO00YSmMO6h_9YLCg","stars":4,"date":"2017-08-12","text":"Food City is a \"Meeh-he-co\" experience in itself. The deli is good for cerviche, burritos and the like. The bakery has those great empanadas, try the pineapple. The fruit and vegetable section is par none, with great variety and prices. Lets just say, their are always mexicans and asian folks buying fruits and vegetables there. They know this stuff. To top it all off, on somedays, they BBQ whole chicken outside on real wood coals, not that charcoal bullshit and not gringo gas, but real bonafide wood. This yardbird is good, and if your real nice, buy some green chiles and ask the person to roast them for you outside and slip them a few dollars ;) Like I said, Meeh-he-co experience.","useful":2,"funny":3,"cool":2},
{"review_id":"UvZzMiv2FPLd72J8LFMGgg","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"wl0QZqAzr1DelslQ02JGCQ","stars":3,"date":"2016-04-28","text":"I have been to the UK and this version of the pasty is as good as it gets in the Valley. Its a big deal, since its a rather easy cheap thing to make, I mean its UK, right. People there are broke and always telling you. The atmosphere is basically loud white folks drinking and drinking, loud.  If they could do it take out, they would make some more dough, but it is what it is and its good to check out the other goodies.","useful":0,"funny":0,"cool":0},
{"review_id":"AA9R0utxeZWK1ZXgqORo_w","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"6WDDksGLLehfQDIvQXzR5w","stars":4,"date":"2017-02-17","text":"One after another, so many have tried to open a food place in this very same spot. Along comes this chinese food establishment and BINGO! I have tried it a few times and the last time, it was packed, and with mostly chinese people ;) \nIn all my favorite is anything noodles. That tasty well seasoned wok in the kitchen sure makes it taste good every time.\nThe young waiter staff is at a loss every time, so you gotta take charge here, for instance, don't wait for your check. For you gringos, you gotta ask for anything more than chopsticks, cause they won't ask or provide them, but hey, get it together and learn. Food is good and consistent.","useful":0,"funny":0,"cool":0},
{"review_id":"K41A7DGsY_bO5Oo_EMsyyQ","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"6t7mlTVjDA9fhuFAZmVzAQ","stars":3,"date":"2016-04-28","text":"I like the basic burger and onion rings, which they do very well. Price wise, its also a deal. The ordeal is with the double line they always form to order is awful and likewise with the pickup area, always crowded and not functional.","useful":0,"funny":0,"cool":0},
{"review_id":"heG_2hftl0C7MV5Db4-N9w","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"KEwpIojt2zYIIt47FTlGCA","stars":5,"date":"2016-05-17","text":"Boy ole boy, this placed opened up recently and I have been back a few times to try out the menu and its all good. Amir is from Lebanon and does it all that way, with great salads and really good shawarma in beef and chicken. Try the kibbies too, wow.","useful":0,"funny":0,"cool":0},
{"review_id":"WHjMxIEUHvn516rMUh2QbQ","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"8F-CalsRSKiPjjsx8ql8Lg","stars":3,"date":"2017-08-12","text":"I go here for the fries. If you were raised on potatoes, like me, some days, all you want is fucking potatoes fried. The large portion is enough for two, so you can take some home and pull them (use a knife if your a girl) apart and fry them up with some eggs for breakfast. The other stuff is just that, nothing fancy, yet I still don't know how peanuts fit into it all. Only downside of this location is the MEGA-FLIES. I counted an average of four on my table all the time. Since I was alone, if you looked at me from afar, I looked like one of the Mill Avenue homeless, thrashing about in the corner, complete with brown bag (fries). Its worth to me.","useful":0,"funny":0,"cool":0},
{"review_id":"0Dyo3lZ1GnvmWHzMzmrfsg","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"CO8MpD1bSkBPArXKBKkIfA","stars":3,"date":"2016-11-16","text":"Its an OK place, with decent pasta dishes, a fast food type of place with awful decor, the cheap \"urban look\". The floor is always a mess with food and trash all over, almost overtime I have been there. I like the pesto dish..","useful":0,"funny":0,"cool":0},
{"review_id":"ZntiCLDuHtSikuch888v4g","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"Q3G58vv1ClvH4re9QBsVgQ","stars":4,"date":"2016-04-28","text":"Harkins is a good theater in general, but I think they switched to the cheap popcorn about a year or two ago. You know the one, the kind that is mostly unpinned corn and small. Dan does a good job over seeing his empire, and giving back to the community.","useful":0,"funny":0,"cool":0},
{"review_id":"R1To_x_yJi1fM-J5v1D38g","user_id":"UqYtHGxXJK9s4ltIm6Uw_w","business_id":"FtLibezRe7HsT13BLpR-Dg","stars":4,"date":"2015-01-07","text":"Northern Mexico food, at its best. Beans are homemade and good, have not got sick yet, so its been fresh. You do know, 9\/10 times its bad beans, when you get sick, lol.\nThey throw in some chips and salsa's to spoil your meal, buy hey, its up to you. Service is good and football (soccer in america) is always on, yeah.\nI do breakfast here sometimes and its the spot when I am hungry after work, so its a no miss for me. Posole and menudo too, not just on every other full moon when a democrat is president ;)\nThey also have small bar in the back, but alcohol is not my thing so, who knows.\nCheck it out, don't be scared.","useful":0,"funny":0,"cool":0},
{"review_id":"jBUGzhp3uZKpoVVG4vB6Bw","user_id":"00skkf5CE9UX5s2q2_9i7w","business_id":"S6DJJArAFwhrdOPHgU4LgA","stars":5,"date":"2017-08-21","text":"In June, I required emergency repairs on my vehicle.  Mimi at New Look Collision managed my repairs and was able to get special parts delivered and the repairs completed in 48 hours.  What a relief it was to get such great service in a difficult situation.  \nThank you Mimi and New Look Collision!","useful":1,"funny":0,"cool":0},
{"review_id":"J0DL0zvBzttW5DUY8COqhw","user_id":"00skkf5CE9UX5s2q2_9i7w","business_id":"9TEF-bO7o0hpZ9JctgYGhw","stars":5,"date":"2017-08-24","text":"After 11 days driving through the SW in June and in super-heat, I was in Vegas, near the airport, for 3 days (117 degrees) and wanted a massage very much.  I found Susan of Hired Hands Massage from an online search, and she was less than 10 minutes away.  I was able to get a 90 minute deep tissue massage that afternoon.  Excellent massage, great location with shaded parking, and such a reasonable price!  I highly recommend Susan for massage in Las Vegas.","useful":1,"funny":0,"cool":0},
{"review_id":"H31ZW19MtjJ8mVXLzf-kFQ","user_id":"TRrIkIb-5R-FIFYos9g8nw","business_id":"9kk5C_BW7rdBwtCJiSiBtw","stars":1,"date":"2007-08-11","text":"Simply HORRIBLE! One hour late when picking us up from home, one hour late picking us up from SFO. Phone staff is rude and never apologized once even though it was 11pm and we were waiting out in the cold weather for over an hour. The driver who eventually picked us up at SFO (after me calling seven times asking where the driver was - and the answer always being 5 minutes) never said a word, never apologized. Picking up other passengers we learned that they had waited even longer - one for TWO HOURS! The drivers going both ways were both reckless and my wife likened it to Mr. Toad's Wild Ride. In short, NEVER, EVER use Marin Door to Door!!!","useful":2,"funny":0,"cool":0},
{"review_id":"KXwz-nh5RjKKM9EJ0FQM0A","user_id":"C83TFUjO-4wwPtBOL4ZVlw","business_id":"ddPchhJK2zURVTFWyFNBgQ","stars":5,"date":"2017-05-24","text":"Hayden did a fantastic job on our patio!! It matched perfectly with our house!! Very professional and highly recommended!!","useful":1,"funny":0,"cool":0},
{"review_id":"PXNqsfwwNZhQULuAcEqepA","user_id":"tiNprDwmMECgK0SlCDfhMQ","business_id":"mYlNFkIiFY3SyDl-nPWR5g","stars":2,"date":"2011-11-22","text":"Definitely nothing to write home about. Generic Italian food.  Pizza crust wasn't bad, but the pastas we had were on the gummy side.  Also the Mozzarella Carrozza appetizer was nothing more than deep fried grilled cheese sandwich. Tomato sauce tasted like canned tomatoes heated up. Lame.","useful":0,"funny":0,"cool":0},
{"review_id":"3p8Z7aoTJJPCJBw1q1gCew","user_id":"tiNprDwmMECgK0SlCDfhMQ","business_id":"0xso8uriixDURNmHy3x42A","stars":5,"date":"2012-03-23","text":"My daughter and I really enjoy eating here. We tend to order the same thing every time because it's so good. She gets the grilled cheese and tomato soup combo and I get the grilled salmon nicoise salad. They both rock. It's cafeteria style all the way up to the point you pay, then you are served the rest of the way by a waiter who brings you your food and takes care of you. The food is always very fresh and delicious. And by the time we're out of there, it costs no more than eating in the food court but the experience and quality of the food are miles beyond. Highly recommended.","useful":2,"funny":0,"cool":0},
{"review_id":"x2pDnVKcolclsh1F289O3A","user_id":"tiNprDwmMECgK0SlCDfhMQ","business_id":"nK4PaQEpSXW6-2F_hID6pg","stars":3,"date":"2012-08-24","text":"Decent food mostly. Nothing spectacular. Scallops were gritty which is pretty off-putting . Service was not good, the waitress seemed to take issue with just about any request and forgot items on several occasions. If the service were better I'd consider returning since the location is nice, but I can spent my money better elsewhere.","useful":1,"funny":0,"cool":0},
{"review_id":"50ZdmmiCmAvvIJye_nvXWQ","user_id":"P0WG1G9s8-Y6MXjolJs3Tg","business_id":"OdX_5hvfO6gX5FVLah5njw","stars":5,"date":"2016-01-09","text":"First time patient and new to the area.  Got me in for appointment very quickly. I was so impressed with the front office staff. They can make or break your experience anywhere you go.  They were extremely professional and friendly as well as efficient. The Nurse Practitioner Kristen Branche was professional and friendly. She took her time explaining my concerns.   Lisa, her assistant was very friendly and helpful.  I had a test that was ordered and she went out of her way to make sure I knew where to go.  Just a great experience!    Highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"68e7PDswZpJE_gEVobEFug","user_id":"dl0V0z4yNo57MInUeqp-3w","business_id":"K-tKnqhblGR7K4R3roKmqA","stars":5,"date":"2015-12-06","text":"The best pie I ever had and will ever have.\nDefinitely go for traditional taste.\nI regret that I only ate one piece of it. It seemed a bit big but it was multi thin layer of pie crust made it look big, so you can actually eat a lot of them!\nIf I visit Toronto again in near future, I must stop by to try other taste like Kiwi.","useful":0,"funny":0,"cool":0},
{"review_id":"RxlWASZbtlUe5bEWyWRvTw","user_id":"K_sU_Ejdd5bQk6soeMH4Nw","business_id":"eYeFOcNJO2iTNPCPi8XAxw","stars":5,"date":"2016-11-26","text":"Amazing fresh food.   Different from the norm.   The food is very tasty and we'll seasoned,  a great place to share and catch up with friends.","useful":0,"funny":0,"cool":0},
{"review_id":"PSpicxruGCPJU12Ksk6Etw","user_id":"L1qYrPzoex6mBWQk3oaLUg","business_id":"z_m9GstWrDagyZv9lNSKjQ","stars":2,"date":"2015-03-02","text":"Pretty eh.  I've certainly had worst fast food burgers, but given the relative wealth of burger options in Tempe, I can't imagine why anyone would stop here.","useful":0,"funny":0,"cool":0},
{"review_id":"z6Hr0orCZYodvbpqynaidA","user_id":"L1qYrPzoex6mBWQk3oaLUg","business_id":"JqMjfqxTffrHMabizYbVPA","stars":2,"date":"2013-12-02","text":"Convenience is, indeed, the only reason to go here.  There are a surprising (surprised me, at least) lack of Mexican places within walking distance of this part of downtown Phoenix.  I work in the area, so I end up eating here once a month or so because I've been to the spots around it an exhaustive number of times, or I just really want some beans and rice on a particular day.\n\nSaid beans and rice are acceptable but don't rise above that level.  The entrees are meh.  I usually get the tacos because, again, they're generally acceptable if not great.  Like many I found service to be slow and, given that the sub-Filiberto's fast quality of what you get, I don't see any excuse for that.  It's never been particularly busy when I've gone in, so it wasn't that the staff were horribly pressed, either.\n\nYou can do better, is the bottom line, but if you REALLY want Mexican on a particular day, El Portal is...there.","useful":2,"funny":0,"cool":0},
{"review_id":"ExDSnA2s4RpX3EKflyAm7g","user_id":"lWj05zhILfRkn6yUqisXHw","business_id":"LvnOhs9Udhyp5adF7Cq98g","stars":5,"date":"2016-04-28","text":"I am from out of town & just happened to stumble upon this dope little sushi spot with a coworker. The place was super clean and I automatically felt a great vibe when I walked in. The sushi & salad was delicious and the staff really seems to know their stuff. I  wish I could remember my servers name but she kept me smiling and answered any question I threw her way. I WOULD DEFINITELY RECOMMEND THIS PLACE!","useful":0,"funny":0,"cool":0},
{"review_id":"B03DD42snaOU-mbDtntohw","user_id":"9zVMFFM_J51ZaS2wMzPziA","business_id":"wke61EJKd1Yw6q1BR1npZw","stars":5,"date":"2014-07-23","text":"Now this is a great bar! Bartenders were personable and they know how to make a drink. Someone suggested I try Atomic Liquors & Commonwealth. I will NOT be going back to Atomic Liquors it was the worst service and drinks. I WILL definetly  recommend Commonwealth..great bar and service!","useful":0,"funny":0,"cool":0},
{"review_id":"fZZrCjFvKl1uwD5jL-HdrQ","user_id":"9zVMFFM_J51ZaS2wMzPziA","business_id":"Z2iYtj0ybh_ovOyRD8bjMg","stars":1,"date":"2014-07-23","text":"Worst bar downtown! My girlfriend and I went there for lunch but the only food they serve is off a roach coach that's out front. Not sure if the bartender was new but it took forever to get our drinks and she couldn't even get them right. The worst part is the guy who claims to be the owner was annoying, he keep trying to pick up my friend who is married. Aside from that, he shouldn't be talking to the patrons in that sexual fashion. We will not be going back there!","useful":0,"funny":0,"cool":0},
{"review_id":"IcveZ2JFVt8bs75U_qXlHA","user_id":"_J0wLpSEBR73HqMWd84LeA","business_id":"ZalWvpZ4Tv4AMHtHG0DwrQ","stars":5,"date":"2017-01-21","text":"Absolutely nice restaurant with nice decor excellent services and a very nice menu.  I had the Walleye and my wife had the fish tacos, both were excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"Kwtp_50fLZ68rpEY9b8U9Q","user_id":"J9bQmCpo1zq6qOidIGtt0A","business_id":"CiYLq33nAyghFkUR15pP-Q","stars":5,"date":"2015-10-12","text":"YUM! How can you not like this place? We have visited at least two or three times during each of our Vegas trips and will continue to do so. Cheap, delicious, open ridiculously late (yay Vegas!) and the workers are so friendly. I am not normally a lengua fan but oh my god, the lengua fries and tacos are like an orgasm in your mouth.","useful":0,"funny":0,"cool":0},
{"review_id":"dZniII2H21_m9V3Ldh1_WQ","user_id":"W0EuBNjhbXaA7AJrAW_vvQ","business_id":"FAsxcxsHTmcBeW78pl9S7Q","stars":4,"date":"2015-03-05","text":"I'll admit I've only ever had the poutine here, but I'm a repeat poutine customer at J'm la frite as its in my neighbourhood. Usually I've gotten it to-go but one time I dined in with a friend. It's a nice restaurant, clean, nice ambiance. There are several booths that would be equally good for families or for getting lunch with a friend.\n\nI've had the poutine several times over the past two years or so and it's just right (in my opinion; your poutine preferences may vary). A good amount of fresh cheese curds, the fries aren't cut too thick or too thin, and the gravy's not too dark and heavy like at some other places I've eaten. The price is right -- I believe the small poutine (which for me is a generous enough serving) and can of pop I usually get is $9.\n\nFinally, I've always gotten polite and friendly service when I've eaten here. I've taken friends here before and I would do it again if I want to get poutine with them close to home.","useful":0,"funny":0,"cool":0},
{"review_id":"Dd0AmVak3Zt6cHza7xRleQ","user_id":"diP6dgit5poivnB3Y_ZuCw","business_id":"NhkSBVWOyf6r60zqURDNqA","stars":1,"date":"2017-05-07","text":"I went to Best Buy this morning (5\/7\/2017) to return a defective router that I purchased on 4\/13\/2017.  I had my receipt. The Customer Service Representative refused to take the product back citing the 15-day return policy.  He further indicated I had to deal with the manufacturer - Belkin.  Again, the router is \"dead\", after only 24 days.\n\nI pointed out to him that it was a Best Buy floor person that recommended the router, but he would not take the product back.\n\nBasically, I take issue with Best Buy not backing the products they sell; especially when the product fails in a short period of time.  Given that I spent a couple thousand dollars at Best Buy (two computers) over the past six months, plus I am a \"Rewards Member\", I guess I was expecting too much.\n\nI wound up going to Target to purchase a new router.  It is my intention to avoid buying anything further from Best Buy, given they do not back the products they sell.\n\nFor completeness:  Working with Belkin was no better.  it took two phone calls and three associates to get an RMA, which is going to be more of a hassle than it is worth.  I point out this interaction as a caution, because Belkin was surprised that Best Buy would not take the product back.  Again, a classic case of getting caught between two entities, blaming each other.","useful":0,"funny":0,"cool":0},
{"review_id":"rkUh1RkwZmnlf5Ou9j52ZA","user_id":"diP6dgit5poivnB3Y_ZuCw","business_id":"6pegVJW1Y8QahUZH7TCGFg","stars":2,"date":"2017-09-14","text":"Dr. Yeramilli (sic) is an excellent doctor - very thorough and efficient.  However, I cannot recommend Target Optical for purchasing frames\/glasses.  They have a limited selection and frankly, they are very expensive; even with insurance.  In addition, I found my lenses noticeably thicker, even though I ordered their high end lenses - i.e. I am not sure I received what I ordered. \n\nI can go to Costco Optical and get a superior pair of single-vision glasses (UV, Scratch Resistant, and Transition lenses) for less than half price I paid at Target Optical; plus the frame selection is better.\n\nIf I am going to continue spending the amount of money on Target classes, I might as well go to LensCrafters - they have a superior product and frame selection.","useful":0,"funny":0,"cool":0},
{"review_id":"UjWOS4jvnTVzeOk5QWAGjg","user_id":"R30wOYiQzI7CBuBagKvhMQ","business_id":"yqqXDVl7ZJaiDDbuCFXqMg","stars":5,"date":"2016-02-04","text":"This place is the spot if you looking for a low key good time. The house DJ is always playing the best tunes. Kaitlin the bartender always puts you in a great mood and is snappy with the drinks. The cocktail waitress Coli has a lot of energy and always has a smile on her face. She will bring you back if your feeling down.","useful":0,"funny":0,"cool":0},
{"review_id":"mHarbHlvLJOnRl236n2zng","user_id":"cPsAUeyBYl6EcrMAxKVWRA","business_id":"jcasci3gjbsSuTEVzvDQKg","stars":5,"date":"2016-01-28","text":"Oh My Gosh amazing!!! The Lasagna is to die for, the home made Italian sausage inside is amazing. I will be back again and again every time I come to Charlotte!!! I was here on a Weds night and the bottles of wine were half price, what a deal. My friend had the Chicken parmesan and couldn't say enough how much he enjoyed it, plus it was huge enough for  lunch tomorrow.","useful":0,"funny":0,"cool":0},
{"review_id":"qHD8Q5BlNm5M6m5ReYuXog","user_id":"EUmSHXPtV9hcWtDFRZaUeg","business_id":"lJickAvhPJ4L6wc7Epyx5A","stars":5,"date":"2014-06-21","text":"http:\/\/moonlightmoth.deviantart.com\/art\/New-Do-462321194\n\nPicture^\nI decided on this awesome place due to reviews here and the pics they've uploaded. It's obvious these ladies know color and I was fairly certain they could pull off a faux hawk with shaved sides. :P\nAfter thinking about it and pondering for over a year I finally decided I'd get my dream hair. Walked in to score an appointment for my day off and got Shannon- who penciled me in and seemed interested in what I wanted. :) Which immediately made me feel better. She was very sweet, funny and professional throughout the whole appointment, listened to what I had in mind, looked at the pics I had for vague reference and created my vision with 100% accuracy. My god. I've never been so in love with myself. Everyone- even my fairly conservative parents- say it's gorgeous and is totally ME. \nIt's been a week now and I've washed it twice- color is still a strong aqua\/teal. -love- And people are STILL complimenting me. \nThis place is as laid back as everyone says. Like a tattoo shop for your hair. Will forever come back.\nThe prices are VERY fair for the skill these women have. My particular color and style took 4 hours.","useful":2,"funny":0,"cool":2},
{"review_id":"gaD9JanVT6X98PpJXffKbA","user_id":"SZUnIg6kUVXepTBjpRMIHA","business_id":"7lNFXLUNzbRKKJR01G1Hdg","stars":2,"date":"2014-09-07","text":"We went there because of the Groupon and had an okay experience. Waitress was very pleasant, but food was nothing to write home about. It could be because that was our first time trying Mediterranean food. Of the 3 dishes we ordered (can't remember their names) we enjoyed 2 of them but they weren't exceptional. The people there are nice.","useful":1,"funny":0,"cool":0},
{"review_id":"meU6vLx_fCxVyg031bsjUA","user_id":"Hqds_FwktTNoUbu0bCbu-Q","business_id":"sFd59MhJ9VofKBkgSJkEzg","stars":5,"date":"2018-01-05","text":"I needed to get a mani-pedi before vacation and stopped by Color Nail Spa because I had received a gift certificate for Christmas. I got a Spa Plus pedicure which, I thought was great and well worth the extra money. I also got a standard manicure. My nail tech suggested I get gel because I was going to the beach and it would last longer. I didn't feel like he was trying to up-sell me on it or pushy about it. He was just very honest that my regular polish would likely chip within a few days at the beach.  I appreciated his honesty. And while I agreed about the gel, I opted to stick with regular polish knowing full well that I'll probably have to touch it up myself. At the end of the day, a regular polish manicure just isn't going to be as long lasting as a gel or acrylic manicure. That's why it's $17 instead of $37. ?\n\nThe salon itself was nice, clean and everyone was friendly enough while not being overly pushy to chat when I had my head buried in my phone scanning Facebook and checking emails. I'd recommend this salon for a standard mani-pedi situation - location is great - tons of parking and I thought reasonable prices.","useful":2,"funny":1,"cool":1},
{"review_id":"y5ilOKSvqu8CKDOLs4eHgw","user_id":"Hqds_FwktTNoUbu0bCbu-Q","business_id":"6-j0Yr8iiNAMgLAdSi70tA","stars":5,"date":"2016-02-24","text":"I have been a Cardamone's customer for many years and Have recommended it to all of my friends and family! The staff members at Cardamone's are so nice and friendly, they do their best to get you your requested appointment and all of them are so talented and good at what they do! I personally see Jojo, who is not only a fabulous stylist but is also great with color. I never come in with pictures of what I want, I just give her a general idea of what I want and I trust 100% that she will work her magic on my hair. Cardamone's is the best!!!","useful":0,"funny":0,"cool":0},
{"review_id":"XVAtxQr9wpoKUN88ul-DhQ","user_id":"_VWryFnJxRzsTRUZS0_bzg","business_id":"xPirEAysB7zTgKzCpSoqFQ","stars":5,"date":"2015-07-17","text":"I am extremely afraid of the dentist ever since I was younger and had a cavity filled while I could still feel it. That dentist didn't seem to care & told me I would be okay. It's been over 10 years since I've had any work done on my mouth. I was in constant pain this past week & could barely open my mouth to eat. I found Royal Highlands off of yelp & I'm so glad I came here. The doctor told me I had an impacted & infected wisdom tooth and I should get it removed soon. The whole front desk staff was so kind and helpful throughout everything, especially Jasmine. The day of my extraction they made me feel comfortable and did everything they could to ease my nerves. Dr. Ho let me listen to music to relax and extracted my tooth in less than 5 minutes. I would recommend Royal Highlands to anyone!! \n\nThank you all for making this dental experience better than my last one!","useful":1,"funny":0,"cool":0},
{"review_id":"10uC9akC9-G4b0IylFM5Xg","user_id":"EAJB6wjYSEUiaqYlzxkGSg","business_id":"GZONBn0K1yp2aaD-l8debQ","stars":5,"date":"2014-06-24","text":"Recommended by a friend from my hometown and thought I'd give it a try. Food and drinks were great! Potato salad was like nothing I've tasted before...so good! Highly recommend the caramel milkshake. Max, our server, was so friendly and helpful! He made sure we were enjoying our time and was very good at checking up on us. The guy refilling water and taking dishes was so sweet too. They were also able to adjust a meal to my friend's allergy and gluten free requests! If you're in Vegas go to the Venetian hotel (the restaurant is inside by the casinos) for lunch or dinner here...so worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"TuPaj32aupvjrjOWlr7mOA","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"CyKi4WgsRNpp3jgsxBEcDg","stars":5,"date":"2014-08-25","text":"Wiseys is exactly what the Leaside area needed!  The meat pies are reasonably priced and are deliciously filling (I bought some for a family brunch and they were a huge hit!).  They also have an impressive selection of sweet and savoury baked goods - i.,e  savoury and blueberry scones are very flavourful and fresh, and the cinnamon donuts are addictive.  I also tried a flat white (coffee) for the first time, and I am now a big fan.  \n\nA really lovely cafe with adorable decor and very friendly staff.  I always look forward to stopping in.","useful":0,"funny":0,"cool":0},
{"review_id":"vxd21q4EAXGi4b3lxmEHHQ","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"KEhK2LLfQ7q6xdCOpKpWmg","stars":5,"date":"2016-02-06","text":"A very friendly neighbourhood bakery that serves up some delicious pastries.  Highly recommend the almond croissant (so flaky!), apple-sour cherry pie and cinnamon sugar donut.  Looking forward to trying other items on the menu!","useful":1,"funny":0,"cool":1},
{"review_id":"SBq9ct8d4KPzsrR7dmDHVg","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"-WKQHbVgTNQVzCbVPDeMlg","stars":5,"date":"2016-08-19","text":"A really lovely, family-friendly bakery with the most wonderful staff!  I'm not normally a fan of cream puffs, but the ones at Mon K are delicious - a light pastry with a silky, creamy filling.  Not too sweet and not heavy at all.  Their sandwiches are also tasty (I tried the Croque Monsieur and the Egg salad croissant) and make for a satisfying lunch.  Prices are also very reasonable considering the exceptional quality of the goods.  Looking forward to trying some of their other creations!","useful":1,"funny":0,"cool":0},
{"review_id":"Qzqxg7HKmduCwzgZnA5s6A","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"qgB0b1SgA8TRC72bryxuhg","stars":5,"date":"2014-07-24","text":"Although the restaurant looks unremarkable from the outside, the food is fantastic and service attentive. Shared the agedashi tofu and grilled squid appetisers, spider roll , and a Tokujyo Zushi.  Appetizers were cooked to perfection.  The spider roll was made with a very generous portion of tasty soft shell crab - certainly one of the best I've had.  Sushi was very fresh and really did seem to melt in your mouth.\n\nAlthough my husband and I were stuffed, we curiously eyed the Mandarin Pie on the menu and shared that as well.  Surprisingly light and a good end to a very satisfying meal.  \n\nNext time I will order the omakase.  Can't wait!","useful":0,"funny":0,"cool":0},
{"review_id":"b21IMS1e9SPIlT5ZEbP3Fg","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"SrTFTykMa0oMUWbJxXGcQw","stars":5,"date":"2016-11-08","text":"This is by far my favourite Longos store - clean,  friendly staff and fresh produce.  I recently ordered a cake from the bakery for my daughter's birthday party and was so impressed by the quality.  It was visually appealing, fresh and delicious!  Even the pickiest eaters and harshest critics (adults and children) at the party had only wonderful things to say.  It was also very reasonably priced.","useful":0,"funny":1,"cool":0},
{"review_id":"3b7dzWESj8H1dZN1kBYlvg","user_id":"shWORGAPBiK3gesnHm3lAw","business_id":"X67a8NpGhqQWdzZt0zuCQg","stars":5,"date":"2014-07-24","text":"Tasty grilled cheese sandwiches in a friendly neighbourhood setting.  My favourites are the Rise & Shine (bacon, scrambled egg, tomato, cheese) and Green Machine (avocado, arugula, pesto, cheese).  If you have room for a little indulgence, also try the grilled banana & nutella sandwich (yum!).  \n\nThe owners are very friendly and accommodating.  The establishment is also very kid-friendly.  Board games are available, and the owners even put on a movie for my nieces as a pleasant distraction as we waited for our orders.  Wonderful!","useful":1,"funny":0,"cool":0},
{"review_id":"1BMtgQY5XZwfz_3FviumeA","user_id":"itMugyArVH36B9MjCn2fVQ","business_id":"ZRugCrjf_rKjgprhv8fAeQ","stars":2,"date":"2017-03-04","text":"Listen, we went to this place and successfully bought booze, let's not exaggerate. But I have never been in a retail establishment that smelled quite like this. I don't know if a sewage line recently ruptured, or if there's a sulfur issue, but this place smells like a dirty diaper ate a burrito and took a dump into another dirty diaper. It smells like an outhouse next to a cemetery next to an abattoir. It smells like death and sadness.\n\nBut come here for cheap booze!","useful":2,"funny":4,"cool":1},
{"review_id":"xzRShjEVRpZmiuen2WlAsA","user_id":"1oTsMG8ZPz85QlVYo94bWw","business_id":"_CEoobNepzCNHxege05A5A","stars":4,"date":"2013-09-18","text":"Longhorn has great food but I do think they are a little pricey!! Seems like their prices keep going up but I enjoy the food and atmosphere and the people are generally friendly!","useful":0,"funny":0,"cool":0},
{"review_id":"hrlGvwwoO0i7mtlJgt6tuQ","user_id":"1oTsMG8ZPz85QlVYo94bWw","business_id":"0Cqkgz8hz8sLYvSkZhBDzQ","stars":5,"date":"2013-09-18","text":"I love this place!! Small menu but it gets the people in and out which is great! Food is great and cheap and the managers are funny and friendly!!","useful":1,"funny":0,"cool":1},
{"review_id":"xZW9zByWu92vETrbX7DGMA","user_id":"1oTsMG8ZPz85QlVYo94bWw","business_id":"o_73vrhXGy07nUWxn5q58A","stars":4,"date":"2013-09-18","text":"Monday night here is the best if you like wings!! .59 cent wings but be careful the flavors are extra but they have over 75 different flavors!!","useful":1,"funny":0,"cool":0},
{"review_id":"oeIsXZJoNvfD9Nn6T-xpTA","user_id":"O7U6VrrOeyWg2541q68Xug","business_id":"Fi-2ruy5x600SX4avnrFuA","stars":1,"date":"2017-02-20","text":"During our recent trip to Las Vegas, we decided to go to the Spice Market buffet as we had coupons and we had heard good things already.We didn't know that only one coupon could be used per ticket. The front desk people were very rude to us for no reason and after everything was explained to the manager, he proceeded to ask if we were going to eat breakfast or not like his staff being rude wasn't a priority. So we left and didn't get the chance to try anything.","useful":0,"funny":0,"cool":0},
{"review_id":"uAsE39XN0eiMbRl1Ib2C-w","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"Jzth-y32SyvOhJNgbIPTqQ","stars":5,"date":"2015-02-14","text":"Amazing food! Great portion size with reasonable prices as well! Was my first time and the employee was very helpful and friendly in guiding me through the \"build your own\" process. Will definitely be returning!","useful":1,"funny":0,"cool":0},
{"review_id":"8YQQYRiF9CpgEb8e4Y7nCQ","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"xdphjWZymq-3dqOWmA_wwA","stars":5,"date":"2015-03-24","text":"Loved Henrys! Amazing tasting, very fresh, good service. Will definitely be back. Tried the beef bing appetizer (highly recommend), hand shaved noodles with shrimp, and Kung pao chicken with rice.","useful":0,"funny":0,"cool":0},
{"review_id":"UGaADNi2QR4-4cTZJreHrg","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"0vJmCY2P5rc37jSMz7Nz3Q","stars":5,"date":"2014-12-03","text":"Amazing new restaurant with excellent food and service! Chiles from Hatch, New Mexico! Would recommend to anyone craving a tamale or taste of authentic Mexican food located near 18th Ave and Van Buren St.","useful":1,"funny":0,"cool":1},
{"review_id":"JH8oZ7f1VnV97g7tMg7YPA","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"ngIcoAQTtsDIWuBQcjdHOQ","stars":5,"date":"2016-04-02","text":"Such an amazing authentic Mexican restaurant! Serving tacos, menudo, and primarily goat served with homemade corn tortillas. Fast service, clean environment, with great, fresh food! We will definitely be returning and passing along the word of Hola Cabrito!","useful":0,"funny":0,"cool":0},
{"review_id":"b85MH5rj2fftbskm25BoWg","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"4IXTkqYmAO4XH4nXnwc67w","stars":5,"date":"2015-02-15","text":"I love Amano! Small, local, pizza wine bar with great food, service, and ambiance. The fact this establishment doesn't advertise and is found based on word of mouth is my type of place! I have tried the pizza (amazing), pasta, and special of the night (a white fish). \nClosed Monday's, half price bottle of wine on Tuesdays--can't go wrong!","useful":0,"funny":0,"cool":0},
{"review_id":"3eoqB3kav1gzQYhatg6KVA","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"W4bpu9EZeynoIgJFCuo1Nw","stars":1,"date":"2015-10-12","text":"I went two days ago for a simple tire tube for my beach cruiser. We installed the tube yesterday and realized immediately it wasn't holding air. Tested the tube under water to find it had a small hole. Brought the tube and original box in today, hoping they'd be kind enough to replace due to the damaged product in which the guy working stated they wouldn't be able to replace and I would have to buy a new one. No kind customer service stating it may have been a preexisting damage from the manufacturing company or anything to keep a customer from returning. I will get my tube elsewhere where they may be friendly enough to replace.","useful":1,"funny":0,"cool":0},
{"review_id":"0pwIkVlsEM-Q_bkUA22s4w","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"r5PLDU-4mSbde5XekTXSCA","stars":5,"date":"2015-02-15","text":"Amazing food, so many choices, reasonable prices, all around great place that I can't wait to try for a second (and third) time!","useful":0,"funny":0,"cool":0},
{"review_id":"d4TPlVS_swAtIEdR0Qr8xA","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"_JZ7hXqOZ_MngjPWFgER0w","stars":4,"date":"2015-02-23","text":"I thought this was a very good place if you're in the mood for pizza, salad, or sandwiches. Pizzas are all 10\", server stated \"thin crust\" however I would say more original\/pan crust. \n\nWings were just okay, nothing to write home about. Great salad, small size is definitely big enough for a meal or to split with someone + a pizza. \n\nWill be returning when in the area for a fresh pizza and salad","useful":0,"funny":0,"cool":0},
{"review_id":"COnnbqXqvkqkAczgT3Ql2g","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"vQzGaVyGTwyKkae0z6b_fg","stars":5,"date":"2015-01-10","text":"Friendly staff, great tasting drink (tried their signature Caribou drink-iced with white mocha and fresh orange peels), seems to have good used book prices as well!","useful":1,"funny":0,"cool":0},
{"review_id":"eZImP4Hbgxu313Mr8kt_5w","user_id":"iYQTMl1ps32PWrZCOyPoAg","business_id":"NASjUYKkz6l7hQLxMf2lqg","stars":5,"date":"2015-02-15","text":"Great tucked away, hole in the wall, Thai restaurant! Was a bit skeptical based on the location and outside appearance; however, so thankful I tried it anyways! Great Pad Thai & Drunken noodles! Will be back very soon.","useful":0,"funny":0,"cool":0},
{"review_id":"DsdHl9GG_98plSOaMiS1Rw","user_id":"9T_h0GKmeB5eC5OHt5uI_w","business_id":"jGKeSXPVj5NX36aFbgNcnA","stars":5,"date":"2016-08-03","text":"Dr. Retamoza is the best!  I highly recommend his services, and his office staff are friendly and welcoming.  Do yourself a favor and go to Touch of Health!","useful":0,"funny":0,"cool":0},
{"review_id":"wB1dnBfnik94bpLzRNRtkQ","user_id":"9T_h0GKmeB5eC5OHt5uI_w","business_id":"vUpyHcStGZTLWH1d_WETDQ","stars":5,"date":"2015-11-02","text":"I came here because of the high Yelp reviews, and I wasn't disappointed.  I needed my grandfather's ring made round again, and they did it on the spot and free of charge.  They shined it up to boot!  \n\nHighly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"mn6DRBLP-Z7f26hiRn7Yng","user_id":"9T_h0GKmeB5eC5OHt5uI_w","business_id":"23PU80u2b3wodvWBqf0APw","stars":5,"date":"2016-03-10","text":"Carl is awesome, and does it at a great price.  One of the friendliest guys you'll ever meet, to boot!","useful":2,"funny":0,"cool":0},
{"review_id":"buAD44BuLXAP8yzI1VkGoA","user_id":"s1HnlNa0BWO5phvag7pN5g","business_id":"UV2Jt8slktGu14gLZeNCjA","stars":4,"date":"2015-07-02","text":"Tasty food with right amount of spices, nice presentation, friendly staff and ambeince is good..\n\nGoat curry, Andhra chicken, kavathi soup are worth tasting..\n\nMust visit for authentic indian food","useful":0,"funny":0,"cool":0},
{"review_id":"YkBswN9bEZBvGl7Go_D08A","user_id":"xUabzaW-fTrVjR5AvNGPqQ","business_id":"EEucpi6TIZQNrXw3-opSEA","stars":5,"date":"2017-02-18","text":"I Love this pharmacy. They are very personable and I feel like a loved one is filling my prescriptions.","useful":0,"funny":0,"cool":0},
{"review_id":"JtK9VrahFCSZOSOSdrEA0g","user_id":"tGocbyDnnXkuEzRNIlWQEg","business_id":"ViF5Kd7pBF1JJhlvEy1kpA","stars":5,"date":"2016-11-28","text":"Great authentic Indian food. Was very skeptical of ordering Indian food as most of Indian restaurants serve tasteless Americanized version of Indian food but this restaurant delivered food to my hotel, on time with perfect amount of masala. Tried goat biryani and dal makhni. If you are Indian looking to revive Dhaba taste buds, look no further.","useful":0,"funny":0,"cool":2},
{"review_id":"mMDDp0ZeejdLyyMwRbpOug","user_id":"EA_kZBFTFhSXu8ZV6LZ9HQ","business_id":"I4EmpNOW7zCcx7fUnQ9ixg","stars":3,"date":"2014-09-25","text":"Visited a couple of times over the last 2 years because it's close to home. The food is  okay  but on the expensive side. Service seems disorganized but I never had bad treatment.","useful":0,"funny":0,"cool":0},
{"review_id":"BRk_tV0--7bbLBj2vVbbog","user_id":"EA_kZBFTFhSXu8ZV6LZ9HQ","business_id":"Fcy6hCkemQoDXCs5ayvcxg","stars":1,"date":"2014-03-20","text":"Panels were installed within 4 months of signing contract, but system took about a year to get running. Responses to emails and calls to them would take weeks to receive a reply. There were problems with getting approvals from APS or the HOA or someone else.  After months of excuses from them, I finally  left a message to our agent to come take the panels off and to cancel the contract . The agent had someone else return my call and we decided to go ahead  and keep the system. They managed to send someone out the next day, but he was 2 hours late for the appointed time and didn't bother to call. Overall it has been a bad experience.  I should have just canceled.","useful":5,"funny":0,"cool":0},
{"review_id":"AnLp-7FrFN3ht03C3YACyg","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"1oD3ndgNI997hTEqkEh8EA","stars":4,"date":"2017-04-26","text":"Went for lunch. Had the rare beef plus beef balls pho and the boyfriend had the tomato and crab meat noodles. \nBoth bowls came steaming hot which was very nice (and rare!) but not sure if that's the reason why my rare beef came pretty well done. The soup is flavourful though! I didn't try the tomato and crab noodles, though my boyfriend said it tasted good. \nWe sat at one of the booths, so it felt spacious inside the restaurant. Service was friendly. Would come back!","useful":2,"funny":1,"cool":1},
{"review_id":"lucgrTtCrHhyP3grKpXBHg","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"4m_hApwQ054v3ue_OxFmGw","stars":3,"date":"2017-04-25","text":"Great decor. Waiter was friendly and helpful. Food delicious. Pretty expensive for the portions given (even though it's tapas, the portions are still pretty small for the price). For example, the pimentos were good but there were probably 8 little peppers in the small bowl ($9 if I remembered correctly). Tried several tapas dishes, really liked the pepper stuffed with manchego and oxtail. The assorted jamon plate is good too!  Not a big fan of the bacon wrapped dates. All in all, it was a good experience.","useful":1,"funny":0,"cool":0},
{"review_id":"a-juQbCUJBNpm3TSO-kXtA","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"0MCXyrNQGaqdYBcAwh3anQ","stars":4,"date":"2016-11-08","text":"Hip decor, reasonable prices and most importantly FRESH ingredients! What more can one ask for? \n\nThis place has more of a casual fare. You order at the cashier next to the sushi chefs; sit at a table on a stool, and they'll bring you your order along with wooden chopsticks, paper plates and paper cups of water. \n\nThe place seems pretty small and has about 4 communal tables. However, We (group of 6) went at around 2pm on a Saturday and had no trouble finding seats at all. \n\nThough casual, presentation of the food was pretty!\n\nIf you don't live around the area, this place wouldn't catch your eyes and thus harder to find (in the papa chang's plaza). \n\nI would definitely come back! Next time for their rice bowls! (All under $15!!). Would be a nice choice for a casual date night!","useful":1,"funny":0,"cool":0},
{"review_id":"102PHt7rRwzmF-ZF622aew","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"WCjznesyAn8o2z8gHghlzg","stars":4,"date":"2017-04-25","text":"Didn't have enough time to eat in, so I had to get take out fish and chips.\nOrdered the haddock and chips. Price was reasonable. \nThe fish: very crispy and tasted fresh. The batter was in the salty side but very flavourful. \nThe chips: thick cut and good. \nThe tartar sauce was the only thing I didn't like. Not sure if it was because I ordered take-out, the tartar sauce was prepackaged (like ketchup packs), and was not so good. Hopefully if I eat-in next time, they'll offer fresh house-made tartar sauce!","useful":0,"funny":0,"cool":0},
{"review_id":"IORR2rH64Jv-OAI3RH_Btg","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"sd4BuC4Om6WuvnP87ZS8Og","stars":5,"date":"2017-06-04","text":"Quaint little local cafe! I had the Dirty London latte (earl grey + espresso latte) and it was fragrant and good! The boyfriend had the espresso ice blended drink, and it was delicious! They also have sweets (eg. Cookies and cakes) and even quiche and empanadas! Will definitely come back!","useful":0,"funny":0,"cool":0},
{"review_id":"vcKwQBEpJzmJXHfRgVh5Bw","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"RADloW1UROUn4FJFU4JJNg","stars":3,"date":"2017-04-25","text":"I'm a seafood lover so I was excited to finally try buster's sea cove in the st Lawrence market! There's always a line up there every time I went to the market and this time (a Saturday) there was one as well. Seating was limited, but being there at around 2pm, I was able to find two seats. Even with a line, it didn't take long for the boyfriend to put down an order, so don't be afraid to line up!! \n\nWe recently came back from a trip to Seattle and just loved the clam chowder at pike place market. So, we ordered the New England clam chowder and the haddock fish and chips. \n\n* New England clam chowder: pike place still takes first place!! But this one at buster's is pretty good. You can taste the clams although it got kind of watery half way through. It didn't feel very hearty to me as there wasn't many chunks of clams or potatoes or what have you. Though, It's a pretty decent chowder. \n\n* Haddock and chips: I'm not a big fan of the fish and chips here at buster's. The batter is light, but it doesn't have much taste to it. The batter was also not crispy. The haddock itself, is a little dry. I was expecting it to be a tougher texture, but it shouldn't feel dry. Also not much seasoning. Kind of reminds me of fish filets\/fish sticks that come in a box in the frozen aisle. The fries, were definitely not made fresh (even with the lineup?!). They weren't crispy nor too soggy. Saving grace was their tartar sauce, it tasted home made and gave the fish some flavour. It also comes with a little container of slaw. \n\nAll in all, my experience here at buster's st Lawrence market was only so-so (food wasn't as fresh and service was a little rushed). Maybe I just had high expectations! Might give the other menu items a try next time.","useful":0,"funny":0,"cool":0},
{"review_id":"unZgci-wLwNpHeBc1jg-7Q","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"iwSKt_VNOsflxngfOJLUaw","stars":5,"date":"2017-10-05","text":"The food is very very good! The restaurant  decor and atmosphere is clean and pretty. I'm not a big meat person but the coffee brisket I loved! Everything on that dish was good: the cole slaw, the corn bread! The boyfriend had the fried honey chicken (spicy) and it was really good too. The chicken is moist on the inside and very crispy on the outside. The corn that came with it was very tasty as well! I didn't get to try the dessert because I had to leave early, but my sister had the crime brûlée and she said it was amazing! Will definitely go back!","useful":0,"funny":0,"cool":1},
{"review_id":"CB5r-PrukLKAha8Ts4MI_w","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"Cr5CLpmVrmzFyz_RfQ6rmA","stars":4,"date":"2017-05-24","text":"This is my second time at scaddabush. I remember the first time was a good experience. This time....was also good! Our waiter was very friendly and helpful. Food was yummy as well. We ordered the carbonara pasta, a pizza, and a few sides. The carbonara was pretty good. There was an egg on top, but it didn't feel like there was egg in the sauce (and thus I felt it was not creamy enough). Pizza was alright. The side dishes were good except for the rosemary fries. I thought that there could've been more rosemary flavour to it. (Note: after we finished the fries, we then realized that the seasonings were all on the bottom of the bowl the fries came with!! So, hint: toss your fries before you devour!). We also had one of the salads (the Tuscan salad?) and it was very flavourful. \nAll in all, dinner at Scaddabush was a good experience! The setting was nice and seating was comfortable. One small thing I would've liked: complimentary bread!! ;)","useful":0,"funny":0,"cool":0},
{"review_id":"mLU0xzpZQOB6GC58AAlacw","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"mOzOYgXYOmkdNfZr453PgQ","stars":4,"date":"2017-04-25","text":"Pho mi is so far the best Vietnamese restaurant I've been to. I'm not a huge pho fan, but their pho makes me crave it sometimes! No matter what noodle soup you order, it'll be full of taste with lots of ingredients. You'll leave feeling very full and satisfied for sure. Prices are also reasonable. Restaurant isn't fancy at all and service isn't extremely friendly too, but the food is what makes me come back! \nThe broth in the pho is very flavourful, but I find that the \"specialty noodles\" are the best! Recently tried the chicken curry noodles and it was so good! Doesn't taste too heavy at all!","useful":0,"funny":0,"cool":0},
{"review_id":"JHn-UcXWUC6CWH_tCOhqhw","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"UJXLtqJBa1DXcjGLeRwHkw","stars":3,"date":"2017-06-04","text":"Went during the unionville festival and although it was 10pm, there was still a long lineup. We had the mochi, taro ice cream and Sakura no-bake cheesecake.\n\nBig tip: if you're NOT getting the original flavour cheesecake, then you DO NOT need to line up. There was this lady in line that rudely accused me of butting in line, when there was a sign that clearly says that the line is only for the original cheesecake. So, remember not to be that person! ;) We're all there to have good food, no need to be rude! Just read the signs posted on their store front!\n\nOk back to the food!\n\nThe Mochi (2.50$): We ordered the black sesame Mochi but the girl gave me the red bean instead :'(. It's made with actual sticky rice! So it wasn't that sweet and kind of a little savoury in fact! Wasn't what I expected! It was interesting.\n\nThe taro ice cream ($4.50): the first spoon of taro ice cream brought me back to childhood memories of having taro ice cream in HK!! Which means it was very good, albeit a bit on the sweeter side. It comes in a plastic bowl with lid, not bad for price. \n\nSakura no-bake cheesecake ($8): it has a nice tart cheesy taste, with graham crumbs on the bottom. It tasted good, but I couldn't really taste the Sakura. It looks very pretty though!!","useful":0,"funny":0,"cool":0},
{"review_id":"GC5oiNP5DCzxd7Ml7c9W5w","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"8YG7PRoZuHeKii0rtNvJFQ","stars":4,"date":"2017-04-25","text":"this is one of my family's go-to dim sum restaurants. We don't come here often though because of the long waits for a table. What draws us back, is the cha Siu here. It's a must!! For under $9 you get fresh and tasty cha Siu, big portion with a bowl of rice on the side! Other dim sum are pretty good too. \nOther than the long waits for a table, another little nuisance is the parking here. Never turn into the little plaza where the restaurant is, because there's no space reserved for the restaurant itself! The spaces there are all reserved for other stores in the plaza. So, drive into where the keg is and park there instead, then walk up the small slope to get to the restaurant.","useful":2,"funny":0,"cool":0},
{"review_id":"ra9PztEJp5taufQfz9rC1A","user_id":"Wzsduf0vEmr-Ih1H0Stvww","business_id":"9fKYo_6qLPofBbts0JAnSw","stars":4,"date":"2016-11-08","text":"Unlike usual Greek spots, you walk into Main Street Greek and you feel comfortable. The decor is simple yet fresh. It's a small restaurant but it feels spacious, so it's nice and quaint. \n\nPrices aren't bad but not cheap. Food was fresh, which is a high priority for me. \n\nWe tried one of the dips, the pork souvlaki dinner, and the spanakopita. Warm garlic bread was served once we ordered, along with a bottle of tap water. \n\nThe pork souvlaki was the tastiest out of the three items. Very tender and juicy! The dip came with warm pita bread, yum! The spanakopita, though, was a bit cold and hard. \n\nAll in all, it was a nice experience. Food was good and service was friendly. Plus they serve some of the foods on pretty plates!!","useful":1,"funny":1,"cool":1},
{"review_id":"BL2FqY-6C5y9oFtXxaW1TA","user_id":"TkLwnul3iLIBqzCN9tr0xw","business_id":"bJcGfSif86OKI0HwvgB5xw","stars":4,"date":"2014-09-01","text":"Fantastic.  The owner remembers everyone's name and are always pleasant and efficient.  Only drawback is they usually run out of the good pastries quickly.","useful":0,"funny":0,"cool":0},
{"review_id":"lWW190IroQLmCytLTnZhWA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"5cXym2kMtJgKeaxdF2SrJA","stars":5,"date":"2015-09-21","text":"I love their all you can eat shrimp and the lobster  and crab! Every thing is fresh and great every time.  I like going even by myself.","useful":0,"funny":0,"cool":0},
{"review_id":"W1SvUCtGTtbcVROMPWGP5g","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"YM-nYIHd99qUt9n62AxIAg","stars":5,"date":"2015-09-22","text":"This is my favorite place! The salsa is great!  They are quick  and friendly and I've never had a problem!  My family and I have gone here for years.  The tamles and chimichangas are great.  The tacos are good but expensive.  The margaritas are great and cheap!","useful":1,"funny":0,"cool":1},
{"review_id":"BWiq0ICztUNuhEgZDa8g_Q","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"TeL2_oZCI-eA1NMrznG58Q","stars":2,"date":"2015-09-22","text":"Very messy store and expensive for what  you get.  I used to go  here all the time. The shoe department  is a mess it's not worth your time at all! Not going back","useful":1,"funny":0,"cool":0},
{"review_id":"Qlw5DAeVFcygPZi0h2ZWkg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"yn6KPC17lgPlrOqBNF9vUw","stars":5,"date":"2015-09-21","text":"So much better than cricket and more affordable than verizon!  The only thing is don't let them talk you into the cheaper 50.00 starter phone because it has issues but once I up graded to the better Samsung Galaxy I haven't had any more issues","useful":1,"funny":0,"cool":0},
{"review_id":"D7ZOuUF1t9qvZONP1nAp3A","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"kcpu_H4BaMY0dqHY8khoGQ","stars":5,"date":"2015-09-21","text":"A great safe place my junior goes there for study time with her friends and they even brought in a pizza! They are quick and accurate and nice","useful":0,"funny":0,"cool":0},
{"review_id":"mVGwQshHJHeB3WO2bBEsxQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"W-vHSqHnELqA0iPiHB5vQA","stars":1,"date":"2015-09-23","text":"I don't know if this is the office I delta with but I was offered a bundle for verizon and I paid century link every month  and then I found out that they weren't paying verizon. So I cancelled the bun!El and paid verizon directly and then century link tried to say I owe them over 500.00 bullshit  they didn't do anything and now I get collection letters for them cold day in hell before I pay!","useful":2,"funny":0,"cool":0},
{"review_id":"Qmuqxo1ApSN6HLUrZSCcdA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"V0sBuKW37bg7h-ICtI07aw","stars":1,"date":"2015-09-26","text":"You have the poorest selection od dress shoes for 120.00! Give me a break we bought the same thing at focus for 45.00! And they were NICE! NEVER COMMING BACK!","useful":0,"funny":0,"cool":0},
{"review_id":"PObQa94HUeo1a4_ogdP8YA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"pVrke8m3lG65WfVRJP1moA","stars":5,"date":"2015-09-21","text":"I have lived here for 7 or 8 years and never had a problem!  The manager Alison really cares and her assistant Britney is great too. Warren in maintenance is great he is fast and knows what he is doing. He even  came out on a Saturday night when the account went out and came within 15 minutes!  He brought a temporary cooler and came out early on Sunday morning and fixed it. I love Redwood place!","useful":2,"funny":0,"cool":0},
{"review_id":"HSok-1_Ez-dGMEvjH93gFg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"Ub4_g-M8ocMSrsa9RlXu4Q","stars":5,"date":"2015-09-26","text":"I've been a patient for over ten years and I started out with Dr Drury and liked him a lot but because of my diabetes is started seeing Dr Kelly and I like him! He got my A1C from a high 13 to 7.1! I also really like Mary tann and tammy O'Reilly I would recommend them to anyone with special issues and there is a wait but that seems to be a problem with most dr offices!  So cut them a break only one dr there i refuse to see Mario he's awful!","useful":0,"funny":0,"cool":0},
{"review_id":"8FLpwQDdtuTBs_IKzgIrTg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"cqJNu4gGWI99M970dd1ZBw","stars":1,"date":"2015-09-25","text":"I bought a new dress for my daughter here and the second time she tried to wear it the zipper broke on a night she was going to the Phoenix Symphony!  We had to hurry home and get a  different dress! She was almost late! I took the dress to be repaired and they wanted 55 .00 so I returned it to kohls they only gave 14.00 for it! I could do better at Walmart!  Gonna stop shopping here they rip u off fuck them!","useful":0,"funny":0,"cool":0},
{"review_id":"nBikv36sTDfmEZMJqCnuww","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"hI_WID6sP7EOgPeFFJPPwQ","stars":2,"date":"2015-09-21","text":"What a disappointment!  I hadn't been able to come for a while and they no longer have the cute decor on the walls and they took the baked potatos off the menu!  And it wasn't clean and the booths had rips and it is extremely expensive for what  you get","useful":0,"funny":0,"cool":0},
{"review_id":"hdcUT4mO7fTfmrHs1dxXTg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"rgTcICdtCXoNXc71Z7-t5g","stars":5,"date":"2015-09-21","text":"Everything is great I go here at least once a week!  I love the spring rolls and the prices are great","useful":0,"funny":0,"cool":0},
{"review_id":"g4FA7YCbMXoPJEjaGNkCxw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"n62dcL1e8BQA1_kUEYrldQ","stars":1,"date":"2015-09-22","text":"I was told it was the best and thought it was awful!  The sweet and sour chicken is just Un eatable huge chunks with a lot of green bell peppers. The fried rice is mushy and the egg drop soup is just ok but how can you mess that up. I was there as a guest but I'd never go by my self","useful":0,"funny":0,"cool":0},
{"review_id":"xM2a8ehO9nHDUPeK8t-APw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"O00LTi6SV8vCVND_8k1YVw","stars":1,"date":"2015-10-09","text":"I've been coming here here for a while and I think the manager left the salad bar sucks!  I don't like the pizza chuck e never comes out the potatoe salad was runny! No eggs no green olives ect and paid almost ten dollars!  Won't be back! Don't go to the one at bell and the 51 either!","useful":1,"funny":0,"cool":0},
{"review_id":"i5IwSmXR-svmTCdhKIdouQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"YEr6lSiAPa8ziEB0fU2cJA","stars":1,"date":"2015-09-26","text":"Went in looking for dress shoes and they hardly have any shoes ! What a joke!  The clothes looked nice though but not worth it!","useful":0,"funny":0,"cool":0},
{"review_id":"7BHrT3p-d8wId48uTzoLrQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"355zerURpj4IMs2no238_A","stars":1,"date":"2015-09-26","text":"They argued with me again as to Wethersfield or not there was broccoli in the dish I asked for none and it's in it! I thought it was just two pieces but it's loaded with it I sent it back good thing I didn't do take out! I don't think I will be back sad! Now they gave me chicken instead of shrimp that I  paid for! And he is complaining!  Give me my money back. Well I was in my car and the manager came out to apologize and give me a gift card.  Unfortunately he is the same person who argued with me and blamed everything on the cashier! I told him that this has happened before and last time it was take out. Don't think I'll be back at least to this one.","useful":0,"funny":0,"cool":0},
{"review_id":"oH-p6DZKRc00HwNWNtKgdA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"FZNUNbyB3Eh_x4Avy3D-9g","stars":1,"date":"2015-10-01","text":"My mom went to Dr todd Lincoln on n 27th Ave by jc Lincoln  hospital  north.  He was early!  I'd  give him a five and he was nice go there now let's see how long it takes dr sink to send the medical records!","useful":3,"funny":0,"cool":0},
{"review_id":"Y0npX3vZ1yp9RziQ-S-Djw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"8XZ4X5WUyM1sWscObramwQ","stars":3,"date":"2015-09-26","text":"Boy for a Saturday they sure are slow! 13 people in line and the guy taking the order got the name wrong. ..weirdest spelling of Lena I've ever seen. The 43rd and bell location doesn't seem to have the same problem. Two employees didn't wear hats or hair nets what's with that what about health code?","useful":0,"funny":0,"cool":0},
{"review_id":"HuKeqheNuQoNIKa3IpMqdg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"IdCua3C1lp0Y2VjdLJvZUw","stars":5,"date":"2015-09-26","text":"My daughter and I have looked everywhere for silver dress shoes for home  comming.  Davids bridal had a pair advertised that they didn't even have and they were rude.  I guess when she does get married we don't  need  to go there!  We went to  Dillards and the shoes were 120.00 so we're were leaving and found focus and the same shoe we wanted at Davids bridal  for 45.00! They were nice to ! Now if they last we will really give them a five and I'll update you. .","useful":0,"funny":0,"cool":0},
{"review_id":"HFGdzXNdBsLuLJPB7Fy1RQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"v8-d4GjT_sFiC2RXb3UJSg","stars":1,"date":"2015-09-24","text":"To expensive for what you get ! I'd rather go to 31 flavors!  To me they are  the best. My daughter talks me in to go once  in awhile and I'm always sorry!","useful":0,"funny":0,"cool":0},
{"review_id":"NBzc87NZ1J6Td_VGICa_oQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"4Af-CW_Dn0LxmcBbs8eA8Q","stars":5,"date":"2015-09-22","text":"Jim has always been good to me and there have been times they haven't charged me. They are about half what other shops charge.  I live at 19th and cactus so it's out of the way but worth it!  My ex husband even goes here now and my daughter.","useful":0,"funny":0,"cool":0},
{"review_id":"MVIkH3GqfOYfDdS_WjaowQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"BXSKs02psOB24y9c0OGTvA","stars":1,"date":"2015-09-21","text":"Very disappointing used to be the place to go all the good stores are gone for my teenage daughters. And there's a lot of gang bangers hanging out not a fun place to be any more  I'll make the drive to either arrowhead mall or pv mall","useful":2,"funny":0,"cool":0},
{"review_id":"goO-cujQZ4K6S1T1sJUJFw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"UqhVZYUeoBGroYpZB-9jlQ","stars":3,"date":"2015-09-21","text":"It's OK but the drinks are expensive and I've had more fun other places.  The food is good. If I were going for the bar experience I'd go somewhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"R2jt82XkbYi0f7eo0oretg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"7ALNJcSA_GRpznrDOtaOtg","stars":2,"date":"2015-09-22","text":"I hate the pharmacy you have to walk in wait in long long lines and when you call in refills you get a busy signal!  I'm going back to cvs or walgreens!","useful":0,"funny":0,"cool":0},
{"review_id":"tqlaoiBpP5cKIRzY0vLPVA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"_B3jnaQVtDXqydea1y92fQ","stars":1,"date":"2015-09-22","text":"I had heard about the new steak house and thought I'd try it. It was packed but I was alone so I thought it might not be that long. I wasn't welcomed and when I asked I was told it would be 45 minutes!  It was extremely loud and there was no where to sit I waited 15 minutes and the noise made me decide to go black Angus where I didn't have to wait and it was a much better atmosphere and after reading comments better food too!","useful":0,"funny":0,"cool":0},
{"review_id":"fA0K2d7vhwW0aGIohuP2kA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"AF-N6i0XCJRPFFOZKp1Pnw","stars":3,"date":"2015-11-22","text":"I just went back and they had put green beans back on the menu but it is still high 9.71 for 2 ck and green beans.    What happened to the green beans!  And baked beans no one wants the nasty Cole slaw! And the prices are to high haven't been to a KFC in year because of that","useful":0,"funny":0,"cool":0},
{"review_id":"c84vUkbCGMkcof5JCel5Dw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"cxlxJpw_vTzw7bXJq6Dbsg","stars":2,"date":"2015-10-04","text":"Went in for the clam chowder and they didn't have it on a Saturday night!  Give me a break! And they are still pushing that nasty all you can eat shrimp!  No thanks!","useful":1,"funny":0,"cool":0},
{"review_id":"be73cK5HBOfEzJVhHV5AAA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"h6neYN7OZVt9_ok2bAx6BA","stars":5,"date":"2015-10-30","text":"I just got here after trying to get dinner at my mother's and they were supposed to be open until 10 and they couldn't turn off the open sign fast enough so I came here   the food was good close to my house and not expensive","useful":0,"funny":0,"cool":0},
{"review_id":"HHWTp0qBNTPRHcsTwF24Cg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"oRBIgTHfNDritzEP5pvfRQ","stars":1,"date":"2015-09-25","text":"I quit banking with them yrs ago because they charged for every thing even talking to a teller and I had thousands in the bank so a balance didn't matter","useful":0,"funny":0,"cool":0},
{"review_id":"nBc0VZuz9Lr30i347KaqeA","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"d1PsrEtEdlD9Q4QtWHXrkA","stars":1,"date":"2015-09-26","text":"My daughter and I came in looking for dress shoes that they had advertised and they were rude and didn't even have them! Had better luck at focus and they were NICE and same shoes for 45.00! When my daughter gets married we won't come here!","useful":0,"funny":0,"cool":0},
{"review_id":"cL0Y01L5sU120lTY3gN-Jw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"CJZm1-WJFxNI_HE6P-n8Aw","stars":3,"date":"2015-10-09","text":"I read the reviews but I'm  stuck because of my insurance!  The wait  was bad the dr was nice I've been waiting for paper work so I can go home  for over an hr! That's why the 3 and your  correct they don't check on you!","useful":0,"funny":0,"cool":0},
{"review_id":"jCXcHkA2azzr9bKWYdw_Yw","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"ykSRyy7X8EwP92X11cA82g","stars":1,"date":"2015-09-20","text":"They tried to tell me I needed to ?eplace a new crown and then we're going to charge me more than my insurance said for a cleaning now they are billing me for a cleaning they didn't do!  I have reported them to the dental Board go to Aspen dental instead!  They are crooks","useful":0,"funny":0,"cool":0},
{"review_id":"TIvdLXA_5ph4ld4-rlc74w","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"i4hvmTd4RH9HvOyG8ndYGw","stars":5,"date":"2015-09-21","text":"Best pizza in town!  I live at 19th Ave and cactus so it's a drive for me to go but it's worth it.  I've been  coming here since I was in high school and I miss the old man  who used to run it but his son took over.  I've never had a problem here and have carried  out and eaten in its a great place!","useful":0,"funny":0,"cool":0},
{"review_id":"Hqy77FUl9dekdrPQgC9qLg","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"Do72DKBclgkSPt6jZ9-c4Q","stars":1,"date":"2015-09-21","text":"I waited forever for a table then even longer for my order. It took over thirty minutes to get my check and it was over priced!  I waited so long for my check I actually thought about just leaving!  It was the worst  experience I've ever had I will never go back!  I miss native new yorker!","useful":0,"funny":0,"cool":0},
{"review_id":"PUlnunkRcHNxCruQr5e6CQ","user_id":"uU_ol_n14rgh8kuuZ--WSQ","business_id":"jvwzhzA9vsfJHCdlbLkHZw","stars":1,"date":"2015-12-04","text":"I've been coming here for 24 years I didn't know that they changed ownership!  They took the pretty art off the wall wouldn't know where you are by looking no art at all looks like a bar and they changed the almond clicked it comes in big chunks and the vegetables too and they charged me for hot tea! Won't be back","useful":0,"funny":0,"cool":0},
{"review_id":"Ha1Y60M-wcEwrKrQhB39Rg","user_id":"0NPrqbR3r34jlLuGXNcP5A","business_id":"FxKKhsjjPNNH3KWz8TEXaw","stars":1,"date":"2012-03-05","text":"Veggie burgers suck. Decided to try something new today... I totally regret that decision.  We got two different ones and they are horrible not to mention they took 20 minutes to get out and there were only two other tables there.  I won't be visiting there again... EVER","useful":1,"funny":0,"cool":0},
{"review_id":"tKnHV56vXSrZ2TuwKaZnxQ","user_id":"zr3d9JdYSBJ0fIJefOqOsQ","business_id":"fQt4D34vcJNtEf8Q4zte3w","stars":1,"date":"2014-04-13","text":"The food is average at the best, especially for the price.  Between myself and my party we had the ribeye steak, kung pow chicken,  fried rice with pork, and the sea bass. The sea bass was the only thing good...oh and donuts dessert was Horrible!... I can't believe how many people give this place such a high rating.","useful":2,"funny":0,"cool":1},
{"review_id":"2znqu_Oe8HmO1vWrMHItdg","user_id":"zr3d9JdYSBJ0fIJefOqOsQ","business_id":"v1AE1LLWDOqe8ubOzqKADg","stars":4,"date":"2014-04-12","text":"Came here based on the yelp reviews and I have to agree. The service was great...I had the classic french toast and they were delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"BkOwlCzFB5Kmxcwr1jYmgA","user_id":"e3YM3m028zXc8ai2ZsgFgw","business_id":"TWuh1abIVPzsnYNnQyuYwQ","stars":5,"date":"2017-01-01","text":"If you are like me and prefer to support local businesses but you want expert knowledge and quality work call Ronnie at Sky Electric. \n\nFirst, the owner is such a nice guy you just want to work with him. He and his team clearly take pride in their work and enjoy what they do. They go the extra mile to make sure you are satisfied in a clean and timely manner. I would recommend them to everyone.","useful":0,"funny":0,"cool":0},
{"review_id":"kVzGZ-qJaLeDmIAs0Au-Wg","user_id":"e3YM3m028zXc8ai2ZsgFgw","business_id":"kd2kHMQTDQPjuBTO5nFHPQ","stars":1,"date":"2017-05-11","text":"FOR THE LOVE OF WHOEVER YOU BELIEVE IN .... just don't. Keep looking for a jeweler. I promise you you are not missing anything but headache. From low balling gold you want to sell or not replacing a diamond that fell out of the setting in less than 6months after we purchased it ..... to ruining 2 watches during a battery change. Oh and they do it all with an attitude. Good times","useful":1,"funny":0,"cool":0},
{"review_id":"R742cDU7ivlg0XnjEtkvZQ","user_id":"e3YM3m028zXc8ai2ZsgFgw","business_id":"9Zhiktm7_LYN_uxaT9XEhg","stars":5,"date":"2017-03-12","text":"We adore this place! We only pick up so I can't speak to the dine in service but it's great when taking away. The food is fresh and seems of higher quality. I also don't notice the excessive sodium that I do with other Asian take out. The sizes are large but not so much you waist. I also like the containers the food comes in. All in all it's our new place.","useful":0,"funny":0,"cool":0},
{"review_id":"qbfTNTXef4R-vM0lJ9ByVA","user_id":"eya7eA-85RdKSNgT9R4woQ","business_id":"trpn1eVgQdR1iWG6uLZrQg","stars":5,"date":"2014-12-04","text":"When i think of eating out in Calgary, Big Fish is all ways an option. Best Burger i have ever had is the lamb\/lobster burger. Many, and i mean MANY, great nights of service and food has come from this gem. I have had inconsistent and i have had less then my expectations........ but i have had so many good experiences here and at the joining restaurant Open Range, that i must say \" i am drawn here like the eternal Moth to the Eternal light of lights\" \n\nbig fish is worth at least 3 tries, if you are not satisfied after 3, i will buy your meal at any other restaurant in the city of Calgary you want...... minus the alcohol bill and to go orders. Just message me with your 3 receipts ready in hand, and we will go for a meal and discuss how wrong you think I am..... Jerk!!!!!\n\nBig fish makes a gourmet Shark ahhhhhhhHHHHH satisfied!!!!! x a million!","useful":0,"funny":0,"cool":0},
{"review_id":"8FUJirDXahH9DEPKQ-j3bg","user_id":"c7YlnErSRpkD7fnrCw_a6Q","business_id":"ttuEwktrkmh3TUlSFPZqAA","stars":5,"date":"2014-03-03","text":"For what this place is, it's amazing. The Banh Mi is better at other places, but the Baos, squid taco, grilled chicken papaya salad and the kimchi fries are unique items that set Banh Mi Boys apart. Try the secret menu \"Club Bao\" (with pork belly & fried chicken). Staff are always high energy and the vibe is good. (There seems to be a West Coast hip hop bias here though, I'm more of an East Coast guy but whatever) If you live or work in urban Toronto this is a place you should frequent often.","useful":0,"funny":0,"cool":0},
{"review_id":"V6Xo62LWAyNQcjg2_VR9ow","user_id":"c7YlnErSRpkD7fnrCw_a6Q","business_id":"mw2TffuWp9kEDd4EPPZ4aw","stars":2,"date":"2015-12-08","text":"Two of us ordered the brisket beef dip sandwich, advertised as a staple item at this place. The meat was too tough to eat out of the sandwich, could only be eaten with a knife and fork after a lot of chewing, the sandwich bread was burnt to a crisp... definitely not a $16 sandwich. \n\nIn combination with this the service was extremely slow, and took a really long time for us to get the bill or refills on anything.","useful":0,"funny":0,"cool":0},
{"review_id":"ihLCqRxVEcav3O9aJlYLEg","user_id":"c7YlnErSRpkD7fnrCw_a6Q","business_id":"f0zHPEwKLf3Aguf_IDemRQ","stars":4,"date":"2014-03-03","text":"This place has a lot of charm. You can tell the family that runs it is very passionate about what they do. Our server recommended the Cold Sweaty Noodle (I forget the exact name of this dish) it was my favourite of the night, good spice, light, and packed with raw veggies. The broths are definitely different from any other place you will try, but it was an interesting change... not necessarily lacking in flavour as other reviews might suggest, just different. They had a bit more of an acidic flavour. The staff there seemed generally confused and overwhelmed, but they will probably get into the groove of things in a few months. Not one of my top picks, but I look forward to coming back and trying some other items on their menu.","useful":0,"funny":0,"cool":0},
{"review_id":"i73c8fugRIorwKwYlA__5w","user_id":"c7YlnErSRpkD7fnrCw_a6Q","business_id":"wpcZOJMovnRb5zvuujtfbA","stars":3,"date":"2014-03-16","text":"Came for some drinks after seeing a movie at Yonge-Dundas. Really enjoyed the beer samples and the staff were very friendly. Wish they dimmed the lights a bit, it was very bright inside for that time of day. Unfortunately we weren't able to stay long enough because last call was 11 on a Saturday night. Hard to understand, because the place was packed and they only needed one or two staff members to keep it going. May consider this place for daytime drinks in the future, would love to come at night since I live in the neighbourhood but unfortunately they're not open to that type of business.","useful":0,"funny":0,"cool":0},
{"review_id":"gro-IODI77cuvEoXZfAAjw","user_id":"c7YlnErSRpkD7fnrCw_a6Q","business_id":"T7yKffTuhiIZclsgjfgowA","stars":4,"date":"2015-06-06","text":"The margarita pizza they have with a soprassa-stuffed crust changed my life for real. One of the best Neopolitan style pizzas in the city. The rice balls are also my jam. Staff were attentive and had lots of personality. I'm not even Italian at all - but it made me feel like I was at my Nona's house!!\n\nA homeless lady came in and stole a loaf of bread when we were in line, props to that lady! Gotta give credit to Via Mercanti as well for feeding the homeless.","useful":0,"funny":1,"cool":0},
{"review_id":"yZ19z2VsmnZaC6NxR45f9Q","user_id":"6cpo8iqgnW3jnozhmY7eAA","business_id":"y7Js-07RF8d3N_AEtaw2VQ","stars":5,"date":"2013-04-25","text":"HOLY HOT WAITRESS BATMAN!!!!!!!!! THIS PLACE IS THE SHIZZNIT!!!!!!\nSo my boy and I saw the travel channel burger special on this joint a week before we went to Vegas and we were all like \" YO CUZ WE GOTS TO EATS THESE MEATS\". So the morning after our first rage session we  were the first customers in line when it opened. There was also an obnoxious German film crew trying to shoot in their restaurant. After being rude to one of the lovely waitresses and refusing to wear the awesome patients gown we got to experience probably the greatest tongue lashing I've ever witnessed. Dr.Jon came over and told the German douche bags what they could do with the hospital gowns if they didn't like them. Dr. Jon is a true american hero in my opinion because like any good American he knows what happens if you let a pushy German get their way. His vision of american  badassness is a shining beacon of our freedom and should be commended. The burgers, fries, and shakes are  tasty, the waitresses are friendly ,beautiful and playful. If you're downtown you owe it to America to eat here.\n\n  p.s. Dr. Jon if you ever read this know that you are awesome and I am now and forever your biggest fan.  Everyone I ever speak to that is heading to vegas will hear my tale of how my hero Dr. Jon vanquished the snotty Euro film crew sent here to mock our American right to do whatever the f%#ck we want to. I will eat here every time I visit Vegas until I die.\n\n\nJust revisited this American gem and it was every bit as good as the last time. God bless America and and God bless the good men and women of the Heart attack Grill. Dr. Jon is even more baller than I remember, I'm pretty certain he is the smartest man to ever live.","useful":1,"funny":2,"cool":1},
{"review_id":"xgUz0Ck4_ciNaeIk-H8GBQ","user_id":"6cpo8iqgnW3jnozhmY7eAA","business_id":"YJ8ljUhLsz6CtT_2ORNFmg","stars":5,"date":"2013-04-25","text":"I loved this place. Easily the most hipsters per square inch of any place in Vegas.  I sat at the bar and watched the NBA playoffs and ordered some brews and a burger. The staff was attentive and engaging but not in a cheesy way. The atmosphere was cordial and inviting with some good talent in the hostess and waitress department. The burger was so outstanding I came back two and a half hours later drunk and ordered the Shepard's pie, which was a life changing experience. If you're in Vegas and want a affordable great meal you should definitely hit this place up.","useful":1,"funny":0,"cool":1},
{"review_id":"gwh7jePw2o9Eb-c5VNBYbg","user_id":"Tg77Tm9sQJRLL1M_TS2nNg","business_id":"DD4d-8-DjnnXBE7lJ6w92A","stars":1,"date":"2017-03-29","text":"Ok so this place is no good in my opinion, would give zero stars if I could.  decided to try em out and ordered delivery a while back and when the food was delivered it was cold with hardly any cheese on the pizza, You could clearly see the bread throughout the whole pie. the wings were also cold. And to top it off the salad was soggy and seemed past it's useful date. Pretty much threw out most of the food because it didn't taste good anyway. Didn't even taste the salad for fear of food poisoning. For pretty hefty prices I was definitely expecting better. Big jimmy's is way better for half the price. I felt like I was ripped off. called them, talked to a staff member she assured me a manager would call. Long story short I called and called and never received a call back. Always just an excuse. \"I'm not authorized to issue a full or even partial refund, you'll have to wait for a manager to call you\" I must have tried 5 or 6 times. I wouldn't spend your money here. Pretty bad when you get beat by $5 pizza. what disappointed me the most was their lack of concern for a paying customer. A customer who has spent lots of money and used to regularly visit philly's bar and grill, which they are affiliated with.","useful":0,"funny":0,"cool":0},
{"review_id":"Y53EyNb7ocqrQyyQLhuFnQ","user_id":"6396nltcsEdNXJaz6ACpqw","business_id":"e0CTLPxTnFEQSqQ1FJUqog","stars":5,"date":"2015-01-05","text":"The staff is really friendly and helpful,  Eduardo the manager is excellent. He made sure all my needs were met and gave me a great discount. Fox rental is awesome you can find great discounts on Priceline.com","useful":0,"funny":2,"cool":0},
{"review_id":"AGhdlyYgLlQuV9cPp0jN7w","user_id":"6396nltcsEdNXJaz6ACpqw","business_id":"Inh4zML74UuNekCzM_JP2w","stars":5,"date":"2016-11-19","text":"Legends is a local Baber shop with a home feel, every Barber is very skilled and welcoming. My Husband has been going to them since their first location. Both our boys really enjoy this shop, they are great with adults and kids. Overall it is a great Barber Shop.","useful":0,"funny":0,"cool":0},
{"review_id":"oVNfaY54M3PegeHfLRjNQA","user_id":"6396nltcsEdNXJaz6ACpqw","business_id":"JwPKxhz03yCLG7LWzJbxSQ","stars":5,"date":"2016-11-19","text":"MIB I can start by saying !!AMAZING!! extremely professional, quick and great price. Marlin and her team are great. I always recommend MIB to my friends and family. \nThank you.","useful":0,"funny":0,"cool":0},
{"review_id":"qixQN-RZpiqr5RRihEgLGQ","user_id":"HEoo4q1XNOeyEXiPOeoHQw","business_id":"l4SRHKV2XLdUR_QpvVxI1g","stars":2,"date":"2014-04-13","text":"I would not recommend this place. You never know what you'll get at this restaurant. The service is okay but they always seem irritated and pushy. I'm not sure if management understands this or cares. In my opinion I wouldn't choose this place for a party or reservation because you'll get less than what you pay for.","useful":0,"funny":0,"cool":0},
{"review_id":"03Vbx8FoliR3oQRYlsFOMw","user_id":"HEoo4q1XNOeyEXiPOeoHQw","business_id":"BctKP9BQPA7vobAUf747Pw","stars":1,"date":"2016-06-05","text":"Very expensive and poor  recommendations, they charge more for the cheap lens so you have to pay for the pointless reflective coatings etc and they say its \"a part of the package\" bs. My prescription strained my eyes and was aggressive and I can't wear my glasses then after three months of purchase they werent able to offer me anything to change out the lens. Over 150 for a lens I will never use. Insurance won't cover very much of it anyway because it's much more expensive than the 150 to begin with just for a lens.","useful":0,"funny":1,"cool":0},
{"review_id":"NQ7ouAUKCxi5m_jTUcXAaQ","user_id":"BOWKGIPSnbaUengs8HuD9w","business_id":"JF0iwM77Ee0-2jLhr4suLg","stars":5,"date":"2016-05-06","text":"I had an absolutely wonderful experience at Bridal Beginning. There is such a huge and varied collection of dresses. The ladies there were all so very nice and helpful. I lucked out getting to work with Sam, who after just a few minutes was able to explain my taste and my idea of what I wanted 10 times better than I was able to! We worked our way through a couple dresses, it all started coming together and then there it was! Sam and the other ladies were so warm, helpful and honest and seemed truly happy to have helped me find my dress. Even though I kept them there late! Thanks to you all! Sam, you're wonderful!","useful":0,"funny":0,"cool":0},
{"review_id":"6xPEixxiIIGaoj7dYK_6dQ","user_id":"NMPjAzrJJHBQNQfYcXMlXA","business_id":"tN811hdfYIYW9qJBM41klw","stars":5,"date":"2017-09-15","text":"Excess did a great job setting everything up for us.  From the Exotics Racing to Wet Republic, they took care of us and made sure everything was set up by the time we got there.  Aaron and Taylor are very personable and easy to talk to.  They pay attention to detail and made sure we had a GREAT time  Thanks Aaron and Taylor for an epic weekend!  Will definitely recommend and call you guys up again!","useful":2,"funny":0,"cool":2},
{"review_id":"YMHbXmnwJ5X-vAbckOBjTQ","user_id":"EkOZKVkzlVJ49Jr1tPBApw","business_id":"fK1oj0dk9Bc6KsBk5mMDxg","stars":5,"date":"2013-08-03","text":"As a self-proclaimed beer snob, we were in Toronto to check out the beer scene. Hungry, we finally arrived to Indie Ale House. To our dismay, the kitchen was closed from 3 to 5 pm; however, the greeter suggested Playa Cabana Cantina across the street for some good eats. What a suggestion that turned out to be.\n\nThe prices were a little higher for a typical burrito, but in my opinion, I got what I paid for. I ordered the CARNE MOLIDA PICADILLO BURRITO which is home-ground beef slow-cooked with guajillo-ancho-chipotle. The burrito had a beautiful presentation with green ancho-chili sauce poured on one half with a red, tomatoe sauce poured on the other half. Their sauces were fantastic. They also offered two house-made hot sauces. One was a habenero based hot sauce and the other was a hot sauce made from smoked chilis. Both sauces had a great spice. The smoked hot sauce went great with my dish.\n\nMy wife bought the Tres taco option - ANCHO BRAISED SHORTRIB-BRISKET CRISPY TACOS. This took traditional tacos to another level. As mentioned, Playa Cabana has their sauces down. The liquid in which they braised the short rib was no exception. This option paired extremely well with the habenero hot sauce.\n\nIf you are in the area and have no problem with $14-18 for a delicious entre, by all means, try it out. (Not to mention Indie Ale House is right across the street with tastey brews for a good night cap.) When in Toronto again, I will defintely come back.","useful":0,"funny":0,"cool":0},
{"review_id":"4B8i5kLCZsg_qSyZeSCk1Q","user_id":"1xXxQsCAhX6u89Qt0i6fzA","business_id":"bcsBGOkWxD4FtRt-kCDnHQ","stars":1,"date":"2016-10-04","text":"I went there a month ago for a refill ... i showed a picture to my nail technician (Tracy) she said it was very easy to do so i was happy and was looking forward to my new set of nails. It looked nothing like the picture, the nails were so thick and wide (they looked like the 100 layers of polish on them) i went back the next day for her to fix them, i reshowed her the picture and still never got close to what i asked, very disappointed in the quality of work. \n\nMaggie","useful":0,"funny":0,"cool":0},
{"review_id":"D5TQ1__MP9XK2TMFimt5Eg","user_id":"2zcgOl1cvOMfxX11s_QHfQ","business_id":"RhEvP5flF6KoPriMHmVYGg","stars":1,"date":"2016-12-22","text":"I booked a king bed room to celebrate my husband's birthday using Red Rock's own website.  We planned to have dinner at T-Bones and stay the night.  We are locals, so this was supposed to be a nice stay-cation for us.   Upon check-in I was advised by front desk employee Yumi that no king bed rooms were available and we'd have to be happy with a room with 2 queen beds.  Even after showing her my reservation for the king bed room, Yumi advised me that my reservation was simply a \"preference.\"  She even threatened to \"call security on us\" if we continued to express our dissatisfaction at the refusal to honor our room reservation.  Instead of taking ownership of the shortcoming, Yumi chose to blame me for \"misunderstanding\" Red Rock's online reservation system, repeatedly talking down to me as if I were too obtuse to understand that even though I booked a room with a king bed for my husband's birthday, my booking was actually only a \"preference.\"  No where was this made clear when I made my reservation using Red Rock's online system.  In addition to Yumi's refusal to simply take ownership of the problem, she then threatened us with \"calling security\" due to our insistence that Red Rock honor my reservation.  I've lived in Nevada my entire life and have stayed at multiple local and strip area hotels, and have never been treated so poorly by a front desk agent.  Even after all the unpleasantries during the check in, Yumi then placed us in a room that looked directly at the parking garage.  I suppose that was her way of \"teaching us.\"  Although we went on to have a very nice dinner at T-Bones that night, Yumi's behavior toward us soured our entire experience.  We'll go back to staying at JW Marriott for our staycations from now on.","useful":0,"funny":0,"cool":0},
{"review_id":"tkQKv16Wy96-jCERgcKAcQ","user_id":"1tc3YTz-yyHqLkkdQtJqDA","business_id":"sMzNLdhJZGzYirIWt-fMAg","stars":5,"date":"2015-07-08","text":"Sienna Mercato is now on my permanent rotation list for my frequent trips to Pittsburgh. It's three levels of great service and delicious food. \n\nI started with a craft beer and beef tartar in the beer garden. It's a cool area with a clear roof and open terrace. This would be a great place to join a group of friends, drink a little beer and watch a game on the numerous TVs.  One end is open to Penn Ave.\n\nI then moved to the middle level where I had a good red wine and a very good bacon and clam pizza.  I like this level. I really liked the pizza. \n\nAnd, sadly, I'm too full to check out the first level. I'll save that for my next trip. \n\nAll in all, it's now in my top 5 in Pittsburgh.","useful":0,"funny":0,"cool":0},
{"review_id":"q-bIPx6aMpz03L_XAMhCWA","user_id":"1tc3YTz-yyHqLkkdQtJqDA","business_id":"5REYrZfsX3m4E3FTwovp5Q","stars":4,"date":"2016-09-04","text":"I'm writing this review after about 5 meals at Seviche.  I highly recommend it to anyone looking for a deviation to the standard American fare.  I'm usually with 1 or more friends and we order a number of small plates.  It's fun to share the experience - and the beer and mixed drinks are a bonus.","useful":0,"funny":0,"cool":0},
{"review_id":"akeby8DvMvGBsU13WvtSkw","user_id":"1tc3YTz-yyHqLkkdQtJqDA","business_id":"NoF90rswXBHESSyDaWeKKA","stars":5,"date":"2015-05-28","text":"I'm in Pittsburgh at least twice a month and The Proper is my go-to place.  The pizza is very, very good and the bacon candy should be illegal  (in a good way).  The really large draft beer selection is worth the trip by itself.","useful":0,"funny":0,"cool":0},
{"review_id":"dc-wMFcGWmbtJW6-oi5_iA","user_id":"1tc3YTz-yyHqLkkdQtJqDA","business_id":"u4sTiCzVeIHZY8OlaL346Q","stars":5,"date":"2016-09-04","text":"I have been hearing about Gaucho's for the past 2 years but only recently had an opportunity to go there.  Wow!  It was delicious.  I had the fish sandwich and then, a week later, had the steak sandwich.  This is definitely in my top 5 go-to places for anyone visiting Pittsuburgh.","useful":0,"funny":0,"cool":0},
{"review_id":"lffxajd6GEirrcUDeRjW8A","user_id":"1tc3YTz-yyHqLkkdQtJqDA","business_id":"04kZ5CSh6oKhI5huU5bLdg","stars":3,"date":"2015-07-08","text":"It's not a waste of time - but I expected more.  There are a lot of Belgian beers, some craft beers and not much else. I've never tried the food so I can't comment on that.","useful":0,"funny":0,"cool":0},
{"review_id":"UCvnMF2cRpMlDRTzgpExHA","user_id":"zTACXC5j-v59WrP_3k6ZAA","business_id":"Uq-GOs9_IqweUsB5MdII9w","stars":5,"date":"2014-09-21","text":"Got a FREE breakfast!! They quoted us 15-20 minutes however the wait was around 30 minutes. So when we sat down they offered us a free meal. Great customer service :)","useful":0,"funny":0,"cool":0},
{"review_id":"rcPaa9_308DO0_fzbscH5Q","user_id":"Cth2QZcnJxH9ImPmsjSTpg","business_id":"Y_3b_YHoUkGm2nYQAB_-Rw","stars":1,"date":"2016-10-06","text":"***This review is solely for the Russian masseuse they have at this office. ***\n\nI went in for a massage yesterday because my neck and shoulders were very stiff (I got rear ended a few months ago). As I was lying down, the masseuse placed a heating pad on my lower back. And as she was working on my shoulder \/ upper back, I noticed that she kept on stopping literally every 2 - 3 seconds (I am NOT exaggerating), and was reaching for something on the heating pad. \nAfter a few minutes, I finally realized: she had placed her PHONE on my back and was playing with it while giving me a shoulder massage... !!?!?!!! \n\nAre you speechless? Because I sure was. \n\nI was in so much disbelief of her unprofessional behavior that I just simply had no idea what to do. \nI finally said \"I have somewhere to go, can we end this session short\", and got me out of the misery. \n\nShe did not help my symptoms at all whatsoever. This is the 3rd time I've gotten a massage from her, and each session kept getting worse. I have a strong feeling she doesn't like Asians very much. \n\nPlacing your phone on a client's back AND playing with your phone while giving a therapy massage is absolutely unacceptable.","useful":4,"funny":1,"cool":0},
{"review_id":"O14Sjag04IRlz6FdOKic_Q","user_id":"4xfpJTwLjWATxj1N9KvFAA","business_id":"ThNGovQZjZ5mn-ZwX_N2BQ","stars":4,"date":"2017-06-30","text":"Very nice modern rooms, good service, and great location. The only reason I would give it 4 stars is the elevators are slow and parking was a little bit of a hassle because it was frequently backed up to leave the garage. But other than that it was a good stay!","useful":0,"funny":0,"cool":0},
{"review_id":"0OOeMYrTTBazrLgpqGsqVg","user_id":"SHIysR-zKH_MzNsEzTp_-g","business_id":"16-Ne-iDt5HpHWIP9fOmhw","stars":5,"date":"2014-12-26","text":"Disclaimer: j'ai seulement goûté l'un de leurs croissants. Il était pas trop cher, à seulement 1,35 CAD.... et il était délicieux, l'un des meilleurs croissants que j'ai mangé depuis mon arrivée sur le continent américain.\n\nJe reviendrais à coup sûr!","useful":0,"funny":0,"cool":1},
{"review_id":"2JQOxbr1rTb1BAz24N-LRA","user_id":"SHIysR-zKH_MzNsEzTp_-g","business_id":"3cSe8U3u-rscNruJ6GofpQ","stars":4,"date":"2014-12-26","text":"Uniburger is a good Montréal burger joint, well deserving its 4 stars. The bulk of those stars, however, come from the abundant and delicious fries rather than the burger itself.\n\nThe burger was good, I am not denying this, HOWEVER, since moving to New York I've had my share of good burgers. Theirs was reminiscent of a lesser Shake Shack burger: it had the same feel, the same basic taste for all basic ingredients (beef patty, tomatoes, lettuce...) but it lacked the delicious Shack sauce which brings it all together and elevates the whole burger.\n\nStill, the whole was very enjoyable - I would definitively recommend it as a spot when rolling through town.","useful":0,"funny":0,"cool":0},
{"review_id":"UiINk_fmKDyn-hPAQV__ZA","user_id":"SHIysR-zKH_MzNsEzTp_-g","business_id":"ry-rcjWrzY5nygBW_zswjg","stars":5,"date":"2014-12-26","text":"J'adore Juliette & Chocolat. C'est le genre d'endroits, presque un salon de thé, qui manque à New York. Rien que la carte des chocolats chauds m'a soufflée: une petite vingtaine de choix donnés en \"single origin\" pour mieux déguster la saveur du chocolat... wow.\n\nJ'ai aussi essayé tous leurs pots de crèmes (je crois): j'ai adoré le praliné et le caramel salé. Ce dernier était peut-être un peu trop sucré, mais il était en même temps tellement bon...\n\nLeurs desserts n'ont pas la richesse de la Maison du Chocolat, ni la complexité de ceux de Hévin, mais ils sont délicieux tout de même, à leur propre façon.\n\nGros coup de coeur de Montréal.","useful":0,"funny":0,"cool":0},
{"review_id":"RCDPnc8iy0O6rbTTv_VbUQ","user_id":"SHIysR-zKH_MzNsEzTp_-g","business_id":"63qPRnFAjxtchnSTWBxwbw","stars":4,"date":"2014-12-26","text":"Frite alors! c'est la brasserie\/friterie belge typique revisitée pour les Québecquois (comprendre \"avec poutine\"). Comme d'habitude, j'étais un peu sceptique. Les frites, ça doit pouvoir se déguster sans sauce et juste briller par sa qualité en standalone. Après, ça m'empêche pas d'apprécier des sauces, mais toujours dans un petit pot à côté pour pouvoir alterner entre avec et sans sauce. Et puis, du fromage sur des frites? wtf.\n\nMais j'ai essayé une poutine avec champignons, oignons et boeuf et j'ai changé d'avis. La poutine est, en fait, une idée génial. Le problème c'est qu'elle peut servir à cacher un manque de qualité du produit (les frites par exemple) en la \"noyant\" sous une masse de trucs. Mais, à Frite alors!, chaque partie de la poutine et la poutine en son ensemble étaient de qualité.\n\nUn excellent souvenir de Montréal.","useful":0,"funny":0,"cool":0},
{"review_id":"nz3wzzr7NkGRHrbq7UdikQ","user_id":"SHIysR-zKH_MzNsEzTp_-g","business_id":"tOhRQqiupLyJdBJVQMGOEQ","stars":3,"date":"2014-12-26","text":"To be honest, I was disappointed by their bagels. I was told that Montréal bagels could not compare with NY bagels. If I could generalize from this experience, I would say it's true. Ridiculously true.\n\nPlaces like Ess-a-bagel and Murray Bagels\nhave ridiculously good sandwiches. Really, I never knew sandwiches could be this good: they are, after all, only slices of stuff between two halves of bread. Those NY bagels elevate sandwiches. By contrast, I got at Fairmount Bagel a simple sandwich. It was good, but there wasn't the the pezzaz that I've come to expect from bagels. Also, the bread was really doughy.\n\nOne of the major advantages of this place is that it's cheap: 6,5 CAD for a salmon sandwhich? Yes please! Otherwise, I'll stick to poutine.","useful":0,"funny":0,"cool":0},
{"review_id":"BeslBzNozgDMrrBiGvQ_CA","user_id":"yi0X-42W4-Xz61wDSsTLyw","business_id":"IWXMR9PsHZgFyrcrc2RYRg","stars":1,"date":"2014-11-02","text":"I would not recommend this community. The office staff is rude, abrasive and unhelpful. Also they tack on extra fees not in the lease. Upon move out we were advised that they charge a extra $80 \"standard cleaning fee\" unless we provide a receipt from a professional cleaning company. Neither one of these things are in the lease in any shape or form. They are saying that they charge every single two bedroom unit $80 unless given a receipt. We moved out, meticulously cleaned the unit, passed the move out inspection with flying colors, we were not marked down at all, we were just told we need to pay the $80 \"standard cleaning fee\" I tried to work with the complex office and advise them thy can't add extra fees that are not in the lease, they refused to help, I tried working with Corporate, they stuck to their guns, they are basically stealing and extra $80 from every tennant at move out, no madder if the unit needs cleaned or not. Stay far from this community.","useful":0,"funny":0,"cool":0},
{"review_id":"yKLlKXOcfkamnN789DkITQ","user_id":"eI9k9DORq7KyB7-oMv9WSg","business_id":"oSI3qAZI_zhd91twB-ivqA","stars":2,"date":"2010-12-27","text":"To start, I'm ONLY giving this place 2 stars because the service wasn't terrible. \n\nAlso, if more people in Phoenix reviewed we could probably avoid most of these overpriced robberies. \n\nI ordered a cocktail that was actually pretty good. Something with sparkling wine and muddled sage I believe. My Mom had a mango martini. That was also pretty good. They are apparently 'known for their martinis'. Though I find it really hard to believe that they're known for anything. \n\nAs an appetizer we had caprese. It was 12 bucks and came with four tomato slices that were not ripe, four pieces of impostor buffalo mozzarella and a flake of basil. Hands down the worst I have ever had. \n\nNext came the salads. These were made up of a few greens and half a tomato. Seriously? \n\nFor my entree I ordered a mixed veggie type pasta with oil and garlic. 20 bucks down the drain. My boyfriend had the 'special' which was Cioppino. It was 36 dollars and his stomach is feeling ever dollar of it. \n\nWe took our left overs because we just do that and don't want to be wasteful. On the way home the smell of it was so bad we had to pull over to toss it out. \n\nThis place is a crock. They couldn't get me to eat here again at fast food prices. \n\nFor 4 people (And only 2 cocktails) our bill came out to 180 bucks. What a rip off.","useful":2,"funny":1,"cool":0},
{"review_id":"BYsSFkWIfzOkc6Q1vxrutQ","user_id":"eI9k9DORq7KyB7-oMv9WSg","business_id":"B-vPVmJjYgV6E6C9FEqiWg","stars":4,"date":"2015-01-01","text":"Super surprised to go to a nail salon outside of LA that got what I wanted. It may not be that way with every technician there. But mine was super rad and spent time with me to understand. I'm really picky about my nails. That being said, if you want something super current just be really clear and bring pics. Really great price point. The owner has the most amazing customer service everrrr!!! I went in New Year's Eve.. And there wasn't a taxi that would pick me up. So she personally drove me. That's crazy. Over all it's a basic nail salon with a friendly staff and good price, able to pull off pictures.\n\nReason I didn't give 5 stars is because I waited 30 plus minutes for my scheduled appointment and they were understaffed. \n\nOverall awesome though.","useful":1,"funny":1,"cool":1},
{"review_id":"hEzHDyQjB7vi8yDSACR6Zw","user_id":"Vh3TAqb4k8KfprHXxGvTIw","business_id":"mvrWRmIrE5dLo_SXE9c1XQ","stars":5,"date":"2016-02-26","text":"I've not only found this storage facility's rates reasonable in comparison with many other facities rates, but, in my experience, the people who work their have shown a very helpful, friendly and customer-friendly attitude. Without anyone's breaking rules or requesting things that are against the rules, Rohil Patel there, at the Cubesmart Miles Road, Warrensville Hts location, have been helpfully accommodating. I am especially grateful to two young employees, Rohil Patel and Angelo Nici, for the help they gave me in a very near closing time. They were all smiles while doing their job and while helping me.\n\nI might add that this facility has been safe and secure and very clean. I've encountered no shady characters lurking around, nor have I seen any signs of storage areas having been damaged or broken into. It's very nice to feel safe and secure about one's person or belongings. Thanks, again, to the facility and to the staff.","useful":0,"funny":0,"cool":0},
{"review_id":"P9gUOwyE4wd7C7qB9VpKSg","user_id":"THtfnYMQQENAJ6Mb6GA9AA","business_id":"4OUGSeQeASZGn9nSb8Ialg","stars":2,"date":"2017-03-05","text":"Our first and our last time eating here. I had a \"Chile relleno\" the menu said light fluffy batter, I got a hard green chile in an omelet. It was NOT good at all! Our waiter was ridiculous.  We saw him 3x the entire time we were seated. I had to flag him down to get the bill. It's ashame, Lake Las Vegas is a beautiful place to visit.  Next time we'll just get some gelato and call it dinner!","useful":1,"funny":0,"cool":0},
{"review_id":"twwbap_LMA6Rz1r51g74Og","user_id":"WcLA0HbEYv8AMkslsQOnOg","business_id":"Mn6PbumS7GL2v3jPilTaeg","stars":2,"date":"2015-07-16","text":"I use to go at this restaurant. But on my last visti, I saw customer bring their used plate or bowl to get food and the employees never say any thing to customers that this is not right. Spechala got tuch their dirty plats or bowl and same Spechala every one elsa use it, Not right. I will never go here again. Taste of food is not same any more.","useful":0,"funny":0,"cool":0},
{"review_id":"lKfMeQ-rQlZJvg2ikQwlpw","user_id":"Z232N27SUsRRhKrHBhlOsg","business_id":"QzuamBC7eQx8oHlg6n_qIA","stars":1,"date":"2016-10-24","text":"This has to be the worst lounge I've ever been in. We had to clear the dishes from a table first of all so we could sit. The place was so over crowded as to be a joke for a business class perk. The food is next to non existent. The only thing it has going for it is free booze which is only good for the real boozers in the crowd. For the price you pay for business class, especially international they could do a lot better.","useful":0,"funny":0,"cool":0},
{"review_id":"GeHvs07G_E6nrq0712YH1w","user_id":"0qpDh40Kvk85Veuv4rHKQQ","business_id":"xpJEBXTCQh5Ib8BJrjt9Bg","stars":2,"date":"2016-02-06","text":"Mac and Cheese poppers look good but taste bland. Veggie pizza that's $16 is made on a thin pita bread- cheap as hell!! Come for the beer only :(  food left me craving something tasty...","useful":1,"funny":0,"cool":0},
{"review_id":"9kUk0M9AxycoBqXlSwInEA","user_id":"0qpDh40Kvk85Veuv4rHKQQ","business_id":"yOxuSjJcW7oEWYz9yb4HYA","stars":5,"date":"2016-09-21","text":"Love this place! Lovely atmosphere, top notch service! The chef made me a custom pasta dish, and I mean completely custom not just modified. I was able to sample wines before ordering a bottle and everything was beyond delicious! We had the flourless chocolate cake for dessert and oh my! Fully happy and satisfied! yum!","useful":0,"funny":0,"cool":0},
{"review_id":"HIZMA0CYIOaOZFALYHNSsw","user_id":"0qpDh40Kvk85Veuv4rHKQQ","business_id":"HWJCPFVFBoQ4-kBT7blJUQ","stars":1,"date":"2016-05-02","text":"My penne was swimming in cream when it was no supposed to be. No pesto flavour to be had as it was pesto penne advertised, mushroom was so thinly sliced could not even taste it in all that cream, no flavour at all. The waitress did not seem interested to help me out here, she was 'sorry'. No happy hour, no half litre of wine - skip this location!","useful":0,"funny":2,"cool":0},
{"review_id":"dfXCGXplE1cNQ7dU6xEquQ","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"7siEeRGqAJ730IkwAtcWAQ","stars":4,"date":"2015-02-19","text":"Love the tea here. You will not want to go back to Panera tea after you've had the brewed mint tea. Iced tea is just as good. I don't know what he does or puts in it but this man knows his tea. \n\nThe food is simple, a little plain but good. Never gotten fries here but the hummus is smooth and has a nice flavor with good quality olive oil, the pitas are warm and fresh (and you get  two so they will fill you up) and I actually like the kufta here better than Layalina's which is saying something because I love that place (but am not a fan of their kufta). Lentil soup is also tasty and filling. The  falafel does leave something to be desired.\n\nI also don't mind the guy behind the counter. If you absolutely must be kowtowed to with fake enthusiasm and mock-pleasure to serve you this is not your place. This guy smiles at you its genuine.","useful":0,"funny":0,"cool":0},
{"review_id":"Nz4Bx7gQhtmJvDxo72mjxw","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"EcgJ_PI0DBPP1UyLCF1zxQ","stars":5,"date":"2009-02-12","text":"Dom's has closed, it is true, but the word on the street is the family will be opening a new restaurant, called Butitta's (Dom's last name) at the location of the old now-closed Jillian's on Neil sometime in early 2009 (at least that's what the phonebook ad said). They said they'd still have some old familiar items on the menu but would have new stuff too. So keep an eye out for Butitta's!\n\nUPDATE 11\/20\/2009: They have a banner outside the building announcing they are now hiring servers and will be opening soon! WOO!","useful":2,"funny":0,"cool":0},
{"review_id":"JBt4PiI6Gpc9iPJ-SyByEQ","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"sy8lzojvZUcEf0qgytzznQ","stars":5,"date":"2014-03-04","text":"Rubens is back. If you are a Champaign native, this is all you need to know. If you are not or have only arrived in town in the past four or so years, know that this is the best hand-crafted chocolate you are going to get outside of Belgium.  Yes, its pricey. Its worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"DgQXyBNsBCyLhsDc7chifg","user_id":"qnMR9YDAZuWP1ufBM_pKhg","business_id":"fbQjAy7MTR8hdt4Gg2H_dA","stars":4,"date":"2015-05-06","text":"Tried this for the first time. They've added about a half dozen more tables, have some privacy screens up, decor is cute. Workers were earnest and ready to help. I had the mango green tea and it was tasty, not too sweet, hint of green tea flavor and the jelly was soft and fresh. Only three bucks for a medium too. Service only took a few minutes, no line, just steady customers, few people sitting down. No complaints here!","useful":3,"funny":0,"cool":3}]