[{"review_id":"7aHDhFkTSU4A4nkXe0A1Fg","user_id":"KlNPKn3Y8pjyQvsS9zQuyg","business_id":"HWJCPFVFBoQ4-kBT7blJUQ","stars":1,"date":"2013-06-07","text":"Come-on! What a joke. The service was some of the worst I have ever encountered. From the wait staff and the manager. \n\nMy boyfriend and I are one of three tables in the whole restaurant. \n10 minutes for anyone to acknowledge our existence.\nOur drinks come, we order: An appetizer, A pasta dish and A pizza dish.\n10 minutes later, our waitress comes by to inform us that they are out of the appetizer we ordered. We are given a menu to pick a new item, along with a very pathetic and half -assed apology. \nAnother 10 minutes go by before our waitress reappears in the dining room to ask us our new appetizer order. (Where on earth she was for 10 minutes is a mystery.) At this point, we express our annoyance that we don't want an appetizer that is going to come out after the meal. \n(Little did we know that the food would take forever). \n\nThe manager brings our food out. That was appreciated until he opens his mouth and gives an awkward sorry and blames the kitchen for not telling them about the appetizer situation. \n\nMy boyfriend eats about 1\/3 or his meal then looks at his pasta... it looks like it's missing something. It's a taco or nacho pasta or something. It had never come with the toppings. \nWe inform the waitress, who seems stunned and asks us if we want more toppings. \nI try to explain that his dinner never came with the toppings. She still doesn't get it and asks us again if we just want her to get us some \"more\" toppings. \nAnnoyed we agree and she brings them out in little containers with lids on them and plops them in front of us with a half-assed sorry. \n\nWe eat our bland, greasy food. Then we wait 15 minutes for our waitress to resurface to ask her for our bill. We pay, we leave.  \n\nMy boyfriend contacts the GM of this Boston Pizza location. He gets a response where the GM blames the manager and the waitress for being incompetent and offers us $20.00. \n\nMaybe I'm a hard audience, but $20.00 for an experience this horrible is insulting.     \n\nGoing to stick with Jack Astor's or East Side Mario's, or any other chain restaurant. At least if they screw up THEIR shitty food, they know how to treat their customers with respect.","useful":1,"funny":0,"cool":0},
{"review_id":"75fg_ouGYnJ_yUpU58AQ7g","user_id":"PYSQaWXwr6KnzHVJjLtYsA","business_id":"CtZ3HujCLTChyoad_L-nHA","stars":3,"date":"2016-07-04","text":"The vibe in this place is unwelcoming. The service was bad because most of the workers acted like they didn't want to be there. They don't portion it right and they give you attitude when you ask for anything different. The food was alright.","useful":2,"funny":0,"cool":0},
{"review_id":"hKJ_mS0HznWxCYD5UVjkTg","user_id":"PYSQaWXwr6KnzHVJjLtYsA","business_id":"BhueLLvA0k9G1Lr0WeZX9w","stars":5,"date":"2016-07-05","text":"Love this place!! Everything tastes amazing and fresh. I would recommend the mangoberry salad it's yummy","useful":1,"funny":0,"cool":0},
{"review_id":"Go_l8o-WRZS5Fr4A3q20tA","user_id":"B60121wQH6Pio3rpxRRXiw","business_id":"VwKAM8hAr1lj7Usm_79xnQ","stars":1,"date":"2013-01-12","text":"Food: Breaded shrimp was overcooked, oily, and the layer of batter was almost as thick as the shrimp. Bruschetta was stone cold , and did not taste fresh at all. I also ordered their classic hot wings which the waiter said were really spicy. Adding vineger to give the illusion of spicyness is an insult to chicken wings, and on top of that the other flavours were completely non-existent. The four cheese spinach dip with deep fried chips tasted like it was microwaved, and it looked caked and dehydrated around the corners of the bowl. \n\nService: Quick and cheerful.\n\nOverall: Would not visit this Kelsey's again.","useful":0,"funny":0,"cool":0},
{"review_id":"O7xmYdmNSoWG142rlxd68w","user_id":"B60121wQH6Pio3rpxRRXiw","business_id":"-yz0XHYoG1WOUm78K0vktQ","stars":2,"date":"2015-01-24","text":"The curried goat had too much oil, and was not tender the way goat kharai should be. The daal, chana, and rass malai were average. You would expect better quality food for the price you're paying.\n\nThe one time I bought samosas from them , they turned out to be stale. \n\nIt would seem like they just want to get a quick turnover rather than focus on quality food now, they were a reputable establishment a few years back.","useful":0,"funny":0,"cool":0},
{"review_id":"LAjd3IXqs-O6zZsw_SsMpg","user_id":"B60121wQH6Pio3rpxRRXiw","business_id":"dulgBrNtDCGjYcbQa2E6uA","stars":3,"date":"2013-01-12","text":"Food: Ordered a medium-well 16. oz bone-in tenderloin. Received it medium-rare. Delicious, except it could have used less salt as it overpowered most of the other flavours. Sad to see a prime cut go to waste because of over salting; therefore it was not worth the price paid. The wild Irish salmon was overcooked, but the flavour was exceptional.  The lobster and ravioli lacked any noticeable flavour, it was bland and the saffron sauce could have been reduced further. \n\nService: A bit slow, considering it wasn't fully booked. Servers looked like they were running around with their hair on fire. They could have been more hospitable. Hostesses were cheerful and inviting.\n\nOverall: In such a competitive area for fine dining, I expected more from Micheal's. Amazing decor, warm atmosphere, but it felt as if the chef did not care for the things coming out of the kitchen. The one thing you don't do is send out food over\/undercooked, especially in a restaurant of this caliber. Because of this, I will not be dining here again.","useful":0,"funny":0,"cool":0},
{"review_id":"OzFe7u7nt1MO_8arWcEotg","user_id":"B60121wQH6Pio3rpxRRXiw","business_id":"M3VcPBiMvhsEJSGUHvXu2w","stars":5,"date":"2016-04-27","text":"I've been coming to Mustafa's for years. Staff, service, and the food keep getting better. The spicy beef pide was excellent, maybe ask for it to be a bit spicier for people who are able to handle a lot of spice. The ambiance is unique, and the prices are reasonable. Definitely worth a try.","useful":0,"funny":0,"cool":0},
{"review_id":"hejpbhqP5KR7NQ9jjbqt8A","user_id":"ujTpWdH9fMXOULICiZo4yA","business_id":"7o2ohuxAwEh11pzXxGIYAA","stars":5,"date":"2016-02-21","text":"We had great service and great food. We were here twice in one day because the first time was so good. We were in town for a hockey game, and just had a blast. Both times the waitresses were super friendly. They had a lot of televisions, so we could watch any sport. The food was excellent and reasonably priced. There was a lot of variety, and it came out of the kitchen quick and hot. We will definitely come back to this hidden diamond.","useful":0,"funny":0,"cool":0},
{"review_id":"l17zHg69j8MPhypNoL4iVw","user_id":"0JA5cSU5ZAjzuYKhL9Phyw","business_id":"kzHSnHhYzqbTkGIdZ2oHpg","stars":3,"date":"2016-08-22","text":"No sound allowed on prelims of UFC fights - before 8:00 pm. Owner's orders. Food is decent though.","useful":0,"funny":0,"cool":0},
{"review_id":"otI_BGZbczxxXpQfZ0HKuQ","user_id":"4u0WZ9YnTyK-1Z0p4Ssx9A","business_id":"2RsLaIEnNUIzjQyCvPCNWA","stars":5,"date":"2017-04-18","text":"Dinner there tonight for the first time. Absolutely loved the place. Great atmosphere,  great service and great food! Anyone from urban back East, \"this will remind you of that perfect little restaurant with a patio! The one you went to on a perfect summer night!\" Thank you for a perfect birthday dinner. P.s. this is the only review I've ever written! Ever!","useful":1,"funny":0,"cool":0},
{"review_id":"MhJlqosLYNn3pKfb2g6-6g","user_id":"c3hdByZRnnMBEQyUyYr2Ag","business_id":"Zzl4ffV9kFY3yOSSgyRUBQ","stars":1,"date":"2013-11-05","text":"I'm a craps player, and I learned how to play in this casino 26 years ago.  It was a craps Mecca in its not too recent past.  But no more.  The box men sweat the dice and the rollers who happen to have a good run of luck.  The young ladies dealing are certainly friendly, but the box staff make up for that in a negative way.  My advice is go play at another casino mere steps away, where they actually are happy to see your action.","useful":0,"funny":0,"cool":0},
{"review_id":"CAVaYVNVFw05K5plJm2Ong","user_id":"Ry37YQ4DTeE7RjaQ12YLHw","business_id":"IT_4EEIbv6Ox1jBRMyE7pg","stars":5,"date":"2012-11-09","text":"I do not believe in god. But I do believe in Steak. There is only one other place that I have had a steak that rivals Del Frisco's but that is a different review. I recommend a special I was fond of years ago that is not mentioned anymore, but they are willing to make for you if you ask for it. It is 3 pieces of Filet (about 3 ounces ea.), each cooked to your preference and topped with 3 different sauces. 1) is a cream sauce with crab, 2) is a butter truffle sauce (my favorite) and 3) (I cannot remember, go find out weirdo).\nI also usually order a side of something green and 99% of the time it's the butter, sauteed broccoli.\nThe wine selection is great and the bar is very good. Tip the piano player, tip the excellent service and before you leave, ask about the secret JAMES BOND TABLE (it's so frakn cool)!","useful":0,"funny":0,"cool":0},
{"review_id":"_W7B0nAzY_XYLTFR_lmIag","user_id":"Ry37YQ4DTeE7RjaQ12YLHw","business_id":"qkyCuFJF2Uboh6n2Lmuwlg","stars":4,"date":"2012-11-09","text":"The best thing about being trapped working in a dark, reality-TV, control-room is that LEE's Sandwiches is ONE BLOCK AWAY! The #5 Pork Sandwich has always been a classic for me. Having been to college in the OC (CA), one of the few places that's open and crowded at 200am is LEE's! The smell of fresh Baguette's is devine.","useful":0,"funny":0,"cool":0},
{"review_id":"hHVXyqqM4e2mSmGCcyY3uQ","user_id":"JXPpGNAeV_cJ43zUjoAQNQ","business_id":"ViJjcvNH_Up1mXZ5NieApg","stars":5,"date":"2016-08-20","text":"I visited county market and the place is awesome. Also it opened the new sushi bar and the products are amazing and delicious. I'm recommend all friend to go here and try it.","useful":2,"funny":0,"cool":0},
{"review_id":"xFUQYOVduA8PlnhO8R5sAA","user_id":"V5EnXqc3zuP4NApgYDGD4w","business_id":"3XtB54REsZ402EkPAN-x7w","stars":1,"date":"2016-04-24","text":"Doesn't even deserve one star. Food was horrible. Staff was horrible. The waitress was an idiot. The cocktails were almost 20$ and not even tasty or special. What a joke of a place. Acts were cool if you want to wait forever in between to see them. Would never go back. Worst experience ever.","useful":1,"funny":0,"cool":0},
{"review_id":"2plecY2QP2Ks7yMyMdFXXw","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"colkiB9memBWXIRGw8C9MQ","stars":4,"date":"2013-12-03","text":"It's a good place to go to... It's great to have the possibility of accessing arts like this for free. You sometimes have fantastic exposition. I'd recommend for everyone to go there and not miss out. I've seen some incredible pieces of work there.","useful":0,"funny":0,"cool":0},
{"review_id":"1J_Vfln3kjxNZS6NBmbO2g","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"7SF6nn5L8djCFva8IbwRXw","stars":5,"date":"2012-10-11","text":"Un endroit génial! On y mange bien, les frites sont excellentes. On se croirait en Belgique. Les employés sont sympathiques. L'ambiance est assez agréable. Si vous êtes étudiant, c'est tout juste à côté de l'université.","useful":3,"funny":0,"cool":1},
{"review_id":"4eIIvrhtTWhUb1oCmUcnXQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"bI28nvujPldWdWsQ5sVRlQ","stars":5,"date":"2013-12-03","text":"This place opened recently and I think it's fair to say that it's the best place I've been in Montreal so far. I went there a few times, it's gaining in popularity, the place is always cracked up now and with reason. It's a fun place to go to the prices for alcohol are all right, the staff is awesome. The interior design is just magnificent and and and you have arcades inside of the bar. \n\nThe music is just fantastic, I've was subjugated by it. The first thing that was playing when I walked in was Jurassic 5 and I knew it would be a great place.","useful":5,"funny":3,"cool":5},
{"review_id":"LrtofckKKzws9reynpbL3A","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"mqSQ88UysxPX5hV7y2-MTA","stars":3,"date":"2013-12-03","text":"The first time I saw the place, I was quite impressed and amused by the place. you have very good alcohols there, but they're a bit pricey. The thing that bothered me was the absence of people in the bar... it's a bit depressing when you find yourself in a bar where there's only 3-4 persons. It does have potential though.","useful":1,"funny":0,"cool":0},
{"review_id":"d0bwFcY0KIkMB5l6RtGxGA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"zw4Legbcu018p5WcZ74iWA","stars":4,"date":"2013-12-03","text":"You have a pretty good menu over there. There's one inconvenient, the place is extremely small. However, the poutine over there is totally worth it. It's very good and probably the least greasy I've had the chance of eating so far.","useful":0,"funny":0,"cool":0},
{"review_id":"RaGyxyfTp9AC_7UFrCv3QQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"3-PuLenoA-9R4dLtBm0Gpw","stars":3,"date":"2014-01-16","text":"They have some good tea, but not the best prices. You can find some better quality tea in other place in Montreal. Coming from a family where tea is served at any time of the day, I have some pretty good knowledge on tea and it is pretty obvious that David's tea is not the best option there is in town.","useful":1,"funny":0,"cool":0},
{"review_id":"LN1g-i73DO5z6EWKD_q01g","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"17jcc6RYsSgf3NgWE0LUYw","stars":5,"date":"2013-12-03","text":"An excellent restaurant. The menu is very well chosen... A good place to go to taste and appreciate French cuisine. The plates are also designed to incorporate a Canadian\/Québécois touch to them making them unique. The staff is excellent and the place is intimate and beautiful. It's definitely a fantastic place to invite someone for dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"KtXRXfwedZSRloRyDJC22g","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"BYnmPgDK8QD5VTeUodQoZA","stars":5,"date":"2013-12-03","text":"It's Montreal's central park. It's always nice to have a bit of green in a city and that is it. haha just avoid touching the raccoon's. Great place for people to go running in a friendly environment. It's also nice to just take a walk there on long and hot summer nights. There's also THE view of Montreal that everyone knows.","useful":1,"funny":1,"cool":1},
{"review_id":"_KbaH-7cq7wrVXRn_EBGXQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"oq3X84QyoUC8tLDyOJUXRQ","stars":4,"date":"2013-12-03","text":"Great place! The interior is really causy and nice looking. It's the sort of place where you could spend hours talking and not noticing it. The staff is really nice and you can also go there to eat. You have a good selection of alcohols.","useful":0,"funny":0,"cool":0},
{"review_id":"MPs9Rt6o-AKmmD0I2FeyJQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"A5IQhhf2c9i2PwVmj92WJQ","stars":4,"date":"2013-12-03","text":"I was just walking on the street when I saw this place. The name sounded pretty cool, so I decided to stop by. And I do not regret this, the staff is incredibly cool and the doughnuts are great. It's a great place to spend time in. You should totally go there.","useful":1,"funny":1,"cool":1},
{"review_id":"0rcw5LyvpJUiaF_BCeWM_Q","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"904-MfAZ28poGitmdqoBMA","stars":4,"date":"2013-12-03","text":"This place is really good for students, very cheap sandwiches and good French products that are a bit hard to find in Montreal. The best things they have are certainly the pre-cookes meals. They're extremely good. I have friends who are French and absolutely love these plates... it's a it of a reminder of what they left. They're pretty happy when they get to eat a meal like those. The prices are really fair and the staff is absolutely lovely.","useful":1,"funny":0,"cool":1},
{"review_id":"3kFwEvK2PsNVc0ZL-cc4WQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"5T6kFKFycym_GkhgOiysIw","stars":4,"date":"2013-12-03","text":"La banquise, arguably the best place in Montreal for poutine. I believe this could be true. The staff is really great and they have a great selection of poutines there. There's nothing better than going there after a night in the bars when you're craving for a poutine. Their portions are very generous. Whenever friends from outside the country come visit, I make it an obligation to take them there.","useful":0,"funny":0,"cool":0},
{"review_id":"-Wk13_w588Cy0ICS4GvTvw","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"MmBiJCKvaJkC86ovcoEmFg","stars":5,"date":"2013-12-03","text":"Absolutely fantastic place! It's probably the best place I've been in Montreal for burgers. It's a small little restaurant and if you're in the neighborhood or on the plateau, it's worth a little walk. Great place and the 5 stars are completely worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"SzIWYZsuWMEqSj6w1oKIxg","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"6sP5Ic6hgW1Pu_TIzjQnVg","stars":2,"date":"2013-12-03","text":"It's a place you go to because it's close to the university, but it's always better to go somewhere else. If you have the choice, might as well avoid this place.","useful":1,"funny":0,"cool":0},
{"review_id":"Wm_G5ngRZlnaUAeeLjq1hw","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"LU53AhAlVgUiCsVfZy872w","stars":4,"date":"2014-01-16","text":"Dieu du ciel! The name of this beer should have made you thirsty already. They have some amazing and unique beers. They're the reason Quebec stands as the North American Belgium in terms of beers. The pub itself is nice looking. The sort of place you go to in a summer afternoon.","useful":1,"funny":1,"cool":1},
{"review_id":"TWVuWpD8O7PJdbZv1vzzrw","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"lHazo7qKEcSc62PMUW3oaw","stars":4,"date":"2013-12-03","text":"Really good place to go to with a bunch of friends. It's the sort of bar you go to for a beer and you end up spending the night there discussing nothing and everything with people. They have a great selection of beers. The background music is well-chosen and not too aggressive. The staff is lovely.","useful":1,"funny":0,"cool":1},
{"review_id":"aN7wKQQMo1A4kn5U_p7FYA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"JryHF5fxQHx-zRqfhyp8AA","stars":3,"date":"2013-12-03","text":"It's good cuisine! Spanish cuisine... It's a good place to go to, not the best in the world, but you're not paying that much for it so it's all right. Try it out!","useful":1,"funny":0,"cool":1},
{"review_id":"JsLj9FXaKzg_-Deazv4m5A","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"rWy-LybUbtPdjNAgXESArw","stars":2,"date":"2013-12-03","text":"I always walked in front of it on my way to some friend's place and I recently decided to try it out. I have to say it's not the best place, the prices are a bit high when compared to other places and the food lacks in flavour. if you're a fan of spicy food, they can go very high on the spicy scale.","useful":0,"funny":0,"cool":1},
{"review_id":"B-03iyb6769zjV7f8DZqBw","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"8eTL0O47F6VwwjKPvUB1gg","stars":3,"date":"2013-12-03","text":"I often go there on Tuesday where the pitcher is at 5$. It's certainly not a top notch place, but for what you're paying it's all right. You mostly have the international students from France going to this place... I have to say it's not very classy, I've seen some pretty odd things there, but it's a good place to go to with your friends to drink and have a good time. I always have a good story to tell. \n\nFor the music... ehh it could and should be better... Basically, you want to go there for the cheap beer.","useful":2,"funny":1,"cool":0},
{"review_id":"CRy2MI5dhcbn1IEpw9jnNA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"lg6MS4t0EDSVt9jUW_bhRw","stars":4,"date":"2014-01-16","text":"It's a good address! The only problem this places has is the music that's too loud! Other than that they have some really good price. They rang in between the prices range that are current in Montreal, but they have a really good stout! Perfect place to go to with 3-4 friends after a long day of work. It's the sort of place where you could spend 2,3, 4 hours + without noticing it.","useful":1,"funny":1,"cool":1},
{"review_id":"AgXyyAQX9TnBfDLxhTNasA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"jpF_FwRNCRqjNh7q37gLlw","stars":5,"date":"2013-12-03","text":"This has got to be one of my favourite places in Montreal. I went there 3-4 times and I always enjoyed it. The prices are very good and the music great. The decor is relly nice and unique... and and and the coolest thing in the world is present in this bar: a photo booth.","useful":1,"funny":0,"cool":1},
{"review_id":"ErI4giunmMwYn_tlP0IdmA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"o05HPzyrpcguxH9AL1Knvw","stars":4,"date":"2013-12-03","text":"It's a great place! Some friends recently moved to Saint-Henri and we found it hard finding a place to go to and the Burgundy Lion was a very cool discovery. There's a wide variety of alcohols. Great place to spend an evening.","useful":0,"funny":0,"cool":1},
{"review_id":"ZxJP_8bS_BItrPlJns5VRA","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"m1tcZ2kveqcWrDAZ4CqpNw","stars":5,"date":"2013-12-03","text":"The one thing I have to mention is the terrasse! It's a fun place to go to and have a discussion over a beer or two or three... The prices are fair for Montreal. I can't find anything else to say, it's an experience of its own. Oh yes! The background music is really well chosen.","useful":0,"funny":0,"cool":0},
{"review_id":"E4uD8X11UtZBVTuNq9kHyQ","user_id":"eWUWCTB5bKs_-rgxbcjALw","business_id":"Ux2wCjtzYHiwtbPWa892ug","stars":3,"date":"2013-12-03","text":"Well, it's a good place to take the kids. It's not that entertaining for the adults... unless you're a big fan of penguins. It's not a very impressive zoo, the only thing that's interesting in my opinion is the recreation of the habitats of the animals.","useful":0,"funny":0,"cool":0},
{"review_id":"PrY2YgqK_Pqf-82MBU3R8A","user_id":"4AMnK3_MSz8drWt76JjK5A","business_id":"FOqYmI24hSVP4EUibW-9zQ","stars":5,"date":"2016-01-22","text":"Love this place, nice and clean Valerie did an amazing job! Best place to pamper yourself, See you soon","useful":0,"funny":0,"cool":0},
{"review_id":"uFGIBwl2bWdGYnIIt7af4g","user_id":"Y93ipZTmL-V2lfw0eaKrNg","business_id":"fS9a8AGrcwWPf_9vfn5wPQ","stars":4,"date":"2013-11-01","text":"Good food.  Large soup is VERY large!!  Our first visit & we are not well acquainted with Vietnamese food but will return.","useful":0,"funny":0,"cool":0},
{"review_id":"MH3VvTMHgDVb__fg2CYIxQ","user_id":"Y93ipZTmL-V2lfw0eaKrNg","business_id":"FiG8PzWKRYehtPPcPtOStw","stars":5,"date":"2014-01-27","text":"Excellent food & people!!  Can't say enough good things - our favorite!\n\nI always eat waaay too much in spite of my best intentions!  Bowl of chips after ordering, then to salsa bar for your choice of 'heat' & texture.  Over to beverages; take your pick.  Find a booth or a table, enjoy chips\/salsa.  Staff brings food - eat!!  I suggest you leave room for one of their great desserts - my favorite is the cream cheese filled dessert chimmies drizzled with honey -- see what I mean?  Did I mention that it is easy on your pocketbook...and outdoor seating available if desired.\n\nOthers must also like them - rumor is that they have acquired more space and will expand soon!","useful":0,"funny":1,"cool":1},
{"review_id":"oKq8o2piPdqgYWPLla6ZDw","user_id":"15tAFpe3XFUSqS9uRjie8w","business_id":"7aZf5c1UNotq4MabBXMZLA","stars":5,"date":"2011-11-13","text":"I'm not planning on being overly elaborate in my praise, but this was seriously the best chinese food I have ever had. I wasn't even particularly in the mood for chinese, but my brother was in town and was craving some. This was the first time yelp played a role in my choice, and I am so glad I listened to the reviews. I'm pretty sure I have finally found the chinese place to go to in Pittsburgh.","useful":0,"funny":0,"cool":0},
{"review_id":"ZMSI-REpVaOlUbdscXYirg","user_id":"15tAFpe3XFUSqS9uRjie8w","business_id":"j37Z4LIXTH9j6KOq9aX8DQ","stars":4,"date":"2011-11-13","text":"The overall feel of the reviews here are pretty on point. The reason to go is for the beer selection, the best time to go is for happy hour, it seems a bit too pricey for my taste otherwise. The food is overall pretty average, the appetisers seem better to me than any of the entrees that I have tried. My best suggestion is to ignore any of the things that it is trying to be, it is not a particularly great restaurant but it is an awesome bar for the beer lover, and the appetisers are definitely adequate for an accompaniment to the beer.","useful":0,"funny":0,"cool":0},
{"review_id":"gRzCzvVebG66k5JmusWO5w","user_id":"15tAFpe3XFUSqS9uRjie8w","business_id":"yo6Ewp9hobvoHbIPXlpRzg","stars":4,"date":"2011-11-13","text":"I absolutely love the bagels and cream cheese here, best bagels I have had... to the point where I miss this place when I get bagels out of town. Every time I stray from the simple bagel I seem to be a bit disappointed, but the bagels themselves are worth the 4 star review.","useful":0,"funny":0,"cool":0},
{"review_id":"99fpNSmu8H69RHhre6DfOQ","user_id":"15tAFpe3XFUSqS9uRjie8w","business_id":"s-KLvUupHmeIKI8y9Nlwpw","stars":2,"date":"2011-11-13","text":"I had the lamb gyro here as well as the Turkish coffee, and both were very good, but the service was absolutely atrocious. I might be persuaded to try it again but the reviews seem to be pretty consistent.","useful":0,"funny":0,"cool":0},
{"review_id":"M7N8atwavXj9JoteBB-f8g","user_id":"15tAFpe3XFUSqS9uRjie8w","business_id":"SpDSWxO4rLUCRAa3K6wC1Q","stars":4,"date":"2011-11-13","text":"This is one of my favourite local bars, the beer selection is more than adequate and there generally is a decent special to be had. The ambiance is nothing special though I will say that they have upgraded from the stuffing flowing from the bar stools look, and have upgraded to new stools and a better overall feel. I can't say that it made a huge difference to me because the beer food and service are the real selling points. Though, they are admittedly swamped on wing nights, which negatively effects the service on the whole the bartenders there are awesome, and give you the feel that you are a regular with even a somewhat regular attendance. The food, even though it is pretty normal bar fare, is top notch in the way of quality.","useful":0,"funny":0,"cool":0},
{"review_id":"h79Fwub9MERPJe339w6Wtw","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"aYfHXWNjLNUVoQa5CMA2jg","stars":5,"date":"2015-10-29","text":"This place is awesome! great tasting juice & the employees are always nice & knowledgeable.","useful":0,"funny":0,"cool":0},
{"review_id":"0mFtAPTmInbXHqDjX9eiOg","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":5,"date":"2013-03-24","text":"this is the BEST place to grab a quick slice of pizza. It's right on your way leaving Marquee, the employees are so friendly, and the pizza tastes just as good when you're as it does when you're drunk ;)","useful":0,"funny":0,"cool":0},
{"review_id":"btYo90XQz6N_FZeDoYjuGQ","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"E67gGK8yOn9kkNzx8FzQKA","stars":1,"date":"2015-10-29","text":"This review is for takeout. I'm a lover of BWW and this location is right by my work so me & my coworkers order out of here almost every week. Customer service is usually just okay, better when you actually go in, sit down and eat, especially in the bar. Today I placed 3 separate orders over the phone. When I arrived, they forgot part of the first order so I had to wait there for them to make it, in the middle of my work day. When I got back to work, we found I was shorted a ranch that I had paid for, and my coworker found that his wing order was short about 5 wings so we called in and spoke with a helpful manager, Daniel, who offered to remake the order. \n\nMy coworker went back to the BWW to pick up his order and, when he asked for the ranch that they had forgotten, they refused to give it to him because it wasn't on that receipt.  Lol  are you kidding me? He mentioned it was on a separate order and they really wouldn't give him one side of ranch valued under a dollar. At this point it became laughably bad to just about everyone in our office. \n\nThere are plenty of other BWW locations around the valley with awesome servers & hosts who treat customers as they should be treated, unlike this one. If you feel like wings but don't want to waste your time & money at this location, just go to the one on Durange since they're always great.","useful":0,"funny":0,"cool":0},
{"review_id":"1944Mp1TRhdO3Dg_rFH6Rw","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"0pvEQRFVBjxz1W7dNpNZFg","stars":5,"date":"2015-12-01","text":"Best nail salon I've been to! It's pretty out of my way from work & home but SO worth coming here to get my nails done. \n\nI always get gel mani\/pedis and a gel mani from here will last me a month, when at other places, my nails start chipping at about 2.5-3 weeks. The gel color selection is amazing, so much to choose from - and they have a ton of OPI. It's $35 for a basic gel mani and I believe also $35 for a basic gel pedi...pretty standard prices but when you factor in how long they'll last you it's a really great deal. \n\nEvery technician who's worked with me has been great as well, they're all very accommodating. The salon is huge but it fills up pretty quickly and has always been busy when I've gone. I usually make appointments but the longest I've had to wait without one is about 30 minutes. I loveeee that they're open until 11pm, since I don't get off from work until 6 or later, it's super convenient.","useful":0,"funny":0,"cool":0},
{"review_id":"rbjk-C-xIrnF_ERL9GcOeg","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"iw9p7E4bMe1YW-APcFGjgQ","stars":4,"date":"2015-10-29","text":"Super fun atmosphere, plays the broncos games & ufc fights. The food is kind of expensive for the quality, but the happy hour is great!","useful":0,"funny":0,"cool":0},
{"review_id":"VpNDogEUoqmH59BnZZPR7g","user_id":"hBmJs49zYcXdV4wo8F5iiA","business_id":"99kGGQoig4YaRi-52VtqMA","stars":1,"date":"2012-12-01","text":"Hands-down the worst Tropical Smoothie location I've ever been to. Not once has someone greeted me as I came in, and most of the employees have an attitude problem and act like they don't want to be there. The smoothies taste good but the food sucks.They also don't apologize for the food sucking, for ringing up the wrong menu items, or for their slow service. About 7 of my friends have also had bad service here also. Honestly, I wouldn't even rate them as high as 1 star, but Yelp wouldn't let me put 0 lol.","useful":1,"funny":0,"cool":0},
{"review_id":"_i0KxnbxxKt9iLesuXX-IQ","user_id":"UgFHuf9q3BE2rPCNERhWNA","business_id":"ZyOLevFrV7Vxi0OOS3lf-w","stars":5,"date":"2016-04-08","text":"Fresh made breakfast food ready to order!!!   Fruity pebble French toast was crazy good!!!  Fresh squeezed orange juice should be served by the gallon it is that good!  Everyone is friendly and service is fast and awesome.  Chris took the time to chat with us about all the tasty specials too.  Run as fast as you can here for breakfast and lunch!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"5ubAYx2iVpPTxrMjkv3jHQ","user_id":"xrlhYto3IrxInb1zv0COZQ","business_id":"01VPJkcU0m8WzlA7dCEpVQ","stars":5,"date":"2016-09-10","text":"This was our first visit to Tea Space and we were very pleased. The service is prompt, friendly and extremely helpful. Teas are of high quality and very tasty, not to mention very reasonably priced. We all had the honey boba which was flavorful and everything a honey boba pearl should be, with the exception of being a bit on the crunchy side. I had the Iced Soy Milk Pudding, Sea Salt Latte, Brown Sugar, Hot Honey Boba and it was still under $5 with all the additions. We will return!","useful":0,"funny":0,"cool":0},
{"review_id":"HkQ8x0zVdYghLmC2xPL32Q","user_id":"xrlhYto3IrxInb1zv0COZQ","business_id":"WETHRoXB2IbixndSlOktJA","stars":5,"date":"2013-09-06","text":"Lulu's Bread and Breakfast exceeded all of our expectations. The service was stellar, we felt right at home. The husband enjoyed not one but two of those and one of these for a grand total of three pieces of heaven. If you cannot decide among the many breakfast or brunch options, the friendly counter intelligence are happy to serve up some tasty suggestions.","useful":0,"funny":0,"cool":0},
{"review_id":"exJKtoMZXEB01n1OxD_wMg","user_id":"xrlhYto3IrxInb1zv0COZQ","business_id":"bcJmbFHVAkLFqhJbUTdbyQ","stars":5,"date":"2013-09-06","text":"The regular rolls were phenomenal! The super friendly woman behind the counter reported they were nothing special, but they were light and deliciously chewy while being sweet and savory. Delectable fruit and goguma cakes! This is a lovely place to pass the time!","useful":0,"funny":0,"cool":0},
{"review_id":"OjHgFC_XmqWqwbhZa7FBQw","user_id":"YRgn6G0sTOqqW7I79XuxZw","business_id":"MYYqJ2vBs6dL-l2l_uGG6Q","stars":5,"date":"2017-07-13","text":"I took my Infiniti FX35 to AZ Automasters to get it ready for a 5-day 1,600-mile road trip from Phoenix, AZ to Yosemite National Park and back.  My car had 130,000 miles at the time.\n\nAZ Automasters performed all necessary maintenance and I had zero issues during my trip.  My car performed perfectly up and down mountains with 3 occupants and plenty of cargo.\n\nI am extremely happy with the service at AZ Automasters and recommend it wholeheartedly.  Thank you!!!","useful":1,"funny":0,"cool":0},
{"review_id":"ZSV9ky5Qv41Wnljiuxlnhw","user_id":"aAFqUegNhPQ5tvcb8BwdpQ","business_id":"aVrMKSXx6ATfjK9ga0Os8g","stars":5,"date":"2015-11-12","text":"Absolutely refreshing to work with professionals! My experience with this company far exceeded my expectations! Had my bathroom counter top refinished and oh my it transformed my bathroom! Love, Love, Love this company! If you're looking to have work done, I highly recommend you contact Tubby's Tub & Tile!","useful":0,"funny":0,"cool":0},
{"review_id":"soKIeqr8i0P8DFjIuHgZ1w","user_id":"8rth9ULF1PRcmBUCMloX0A","business_id":"dWFUKB_HPBIE87AFBHEb_w","stars":1,"date":"2015-09-25","text":"I made the mistake to not read the reviews before buying my ticket.  \nLike many cheap airlines, you get what you pay for.  \nI paid $47 for one way to LAX from Las Vegas. \nI checked in at the airport and when I was at the kiosk I went through the screens too fast and did not add one carry-on. You have to pay for one carry on and one is free. \n\nI realized later that I had to pay $100 at the gate.  I was soooo pissed and started complaining. The lady helping me was giggling at my anger while I was cursing under my tongue.  Luckily she was nice enough to tell me to call the spirit call center and pay $55 instead.  Its probably cheaper when you pay it at the kiosk. \n\nThe rep on the phone was either incompetent or couldn't hear me correctly but it was annoying that I had to repeat my reservation several times. \n\nI hope this help others. The phone number to call in case you are at the gate is 18014012222\n\n\nAvoid this airline if you can. \n\nAlso seats and everything inside the plane are super cheap.","useful":6,"funny":2,"cool":1},
{"review_id":"27-Il4CImqt81Zly232c7A","user_id":"6epnjwosT5ppRyyCXkZqoA","business_id":"pSEZrgcHkkv53OR76OxHwg","stars":5,"date":"2015-02-16","text":"Eric at Auto Renew is easy to work with.  His estimate includes everything and his shop workers do quality work completed on the expected date.","useful":0,"funny":0,"cool":0},
{"review_id":"a4mmYVgUpZtXGUV98si0TA","user_id":"6epnjwosT5ppRyyCXkZqoA","business_id":"5a_aIEnxQPL0TwHy2XeGoQ","stars":4,"date":"2011-10-16","text":"Excellent Roman Catholic Parish with a great diversity of ages and ethnicity.\nThrust stage style altar arrangement puts the priest and service at the center of the people. \nBeautiful, huge stained glass window on wall in back of altar. Beautiful modern style church overall.\nVery good formal choir at 9:00 am Mass.\nTypically very good homilies from the Priests. \nLots of programs available for participation and education.","useful":7,"funny":0,"cool":0},
{"review_id":"ackrIL_MdK4OINAO8QjStQ","user_id":"UZ1o3Hcrldv_aYQRxFBhqg","business_id":"8Zqh2jwtncA3N4fWEMTvZQ","stars":5,"date":"2013-08-05","text":"I lived in the apartments right next door to Scramble and went there every morning for coffee.  Not only is their coffee delicious, but their food is AWESOME.  The staff is young and hipster-ish, but very nice.  Never had any problems with service or food.  The coffee is a little pricey IMO ($2.61 for a cup) but other than that, this is one of the best breakfast places around!","useful":0,"funny":0,"cool":0},
{"review_id":"o0_XJJhF6hRF4p4DdRtAXg","user_id":"oO2GcGEWRowajJ5qBAbDIA","business_id":"beIMwKKAzii12mS6MY4XgQ","stars":5,"date":"2017-02-15","text":"I adore Cole Cafe! We recently moved to the area and consider this to be the \"local\" spot. Each time I have eaten here the owner comes out to chat and is very friendly. The food is always delicious!!! A great Pittsburgh Diner. Even if you're not a local it's worth checking out!","useful":0,"funny":0,"cool":0},
{"review_id":"F9UMkRqF4Z_RWAILZ5YbXQ","user_id":"7-0gCwvSDFHWpS5Goz4fug","business_id":"EF8PHciQ68dOPhgXyxefAg","stars":1,"date":"2013-03-16","text":"My boyfriend and I ate here because we had a Restaurant.com coupon, and it was possibly the most disappointing meal that I have ever eaten.  The food was bland and overpriced, it was worth maybe a third of what we paid for it (~$60 after the discount), not to mention the automatic 20% gratuity.  Could have spent $15 at In 'N Out and had a more fulfilling experience.","useful":3,"funny":0,"cool":1},
{"review_id":"DXs6-XDIR8VkuJdwbFOgGA","user_id":"7-0gCwvSDFHWpS5Goz4fug","business_id":"9N8wCt5Skd_PGlOlRIMlag","stars":5,"date":"2013-11-06","text":"I was referred here through State Farm's repair program, even though the problem with my car was not accident related.  I was worried that the problem would be horribly expensive, but turns out it was just the tread separating on my tire.  Kustom Koachworks had it figured out in under 5 minutes, slapped on the spare tire, gave me free access to their Keurig coffee maker, and sent me on my way, free of charge (which just blew me away, the Kia dealership charges $65 just to look at the damn thing).  The employees were charming and really set my mind at ease.  I'll definitely come here if I ever need serious repairs done (knock on wood).","useful":0,"funny":0,"cool":0},
{"review_id":"lFsT9h1fs7nl5iO5AC21EQ","user_id":"7-0gCwvSDFHWpS5Goz4fug","business_id":"AJ8DDFm6QaihAPZI3wFBHw","stars":5,"date":"2013-03-16","text":"I always get a blended chai tea with boba.  ~$6 for a massive drink, but I absolutely love it!  It's easily the best drink of that nature that I have ever had.  If that's not for you, they have a large variety of teas from around the world.  Really great place, in both summer and winter.","useful":0,"funny":0,"cool":0},
{"review_id":"m2oZS2pW8oJ3f10cqgVkXQ","user_id":"nIsVdmmbJuym_RhiqmMSgw","business_id":"9PIC380tmNYpIC3z5cvcNA","stars":5,"date":"2016-04-16","text":"Great service and the honey sweet toast is fantastic for our weekly sweet tooth cravings! Definitely a regular with the wifey and puppy","useful":0,"funny":0,"cool":0},
{"review_id":"wQk_AnwsQ8cWu_jR4aK6Pg","user_id":"I6TnwVKgEli6Qpq0WQW21Q","business_id":"ZTKtzIGm8Sq93beLHlzQ8A","stars":4,"date":"2012-07-14","text":"I recently stayed here for one night.  It was a convenient stop and I was pleasantly surprised.  When I was quoted the price( quite low), I wasn't sure what to expect.  The room was spotless and had been updated. The bed was great and the hotel was very quiet.  Staff was extremely friendly. I got a call from the front desk after I had been there a few hours to ask if I needed anything. The hot breakfast bar was actually hot with  good options. and instead of having breakfast in a stark breakfast room, it was in the restaurant, with table linens and servers ready to bring coffee or other drinks. If you are wiling to drive a few miles, the downtown area of Hudson has some good spots to eat and shop.  There was an outdoor concert in the park when i was there.  My only complaint is that the AC unit in the room was kind of loud.  I would not hesitate to stay here again..","useful":1,"funny":0,"cool":1},
{"review_id":"z0aamcqwUL9rtji0nYhmAw","user_id":"fZgD41emquiEaUajdpGwqg","business_id":"Pk6A3Pqs6_qPLNevdADrDg","stars":4,"date":"2017-10-27","text":"The burger practically melts in your mouth! Food and service are top notch. I will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"EmycaPEfuobNFC0w_Tvq_A","user_id":"Yvm-ZATcX16Ugij2IvpoBg","business_id":"VGWEpMEkzQopS5lUNd06Sw","stars":5,"date":"2017-01-09","text":"A young man named Devon waited on myself and my family his service was exceptional. Prompt friendly and professional at all times that being said the food was great lobster tail French onion soup and a perfectly cooked steak. I'd order the food to go anytime but Devons service will keep me coming back as often as possible.","useful":0,"funny":0,"cool":0},
{"review_id":"sCTdQnLeeclKnxa5Sm_oOA","user_id":"Yvm-ZATcX16Ugij2IvpoBg","business_id":"qFW6Tb1lpifZnbsh8yvfaA","stars":5,"date":"2017-01-12","text":"Awesome service request mark he is amazing I will only use penny electronic from now on","useful":0,"funny":0,"cool":0},
{"review_id":"0oQaojPaVuEQndVUeHVJpg","user_id":"eaWswxoEGIt1S6BIA-9fEQ","business_id":"Faz6oSHw6yhZF-myoZO_Nw","stars":1,"date":"2017-04-17","text":"It was an expensive mistake.  The operator either couldn't understand or refused to understand that my nails were different lengths and that she had smudged one of them.  It was a frustrating experience!","useful":1,"funny":0,"cool":0},
{"review_id":"S7r-k2YmjlurjDmTBtztYw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"3kO_47AdqNqPUhpHjLc2ZA","stars":5,"date":"2012-02-06","text":"I finally checked this place out and was blown away.  It's enormous and a little intimidating at first--there are thousands of swatches (I'm used to looking at bolts of fabric) and dozens of staff.  I assumed that since there were swatches on display that most of their stuff would need to be ordered.  Turns out, the swatches virtually all represent in-stock fabric.  This news almost brought a tear to my eye.  In my two hours there I probably spoke to five or six of the staff and they were universally friendly and knowledgeable.  \n\nThe place also has a really nice buzz.  There were lots of designers there, talking about client projects in private homes and on movie sets.  The customers and the staff seems to know each other and there was lots of good chit chat, sewing-related and otherwise.  There are well-placed tables and chairs where you can leave your swatches while you browse, then come back to sit down and calculate yardages.\n\nThere was a wide range of fabric qualities\/prices and I agree with other reviewers that their prices do seem to be lower than other fabric stores in the city.  Part and parcel of this is a no return policy, a 1\/2 yard minimum and some restrictions about how much they will leave on a bolt.  Also, they don't allow returns of any kind, not just cut fabric.  \n\nIt's just the kind of independent retailer that makes me bemoan the encroachment of big chains.  Based on my experience, though, these guys will be around for a long time.","useful":18,"funny":0,"cool":5},
{"review_id":"4ghpp-bGvbNr4OfCsSJ-ng","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"OMNFQuk3DfAt2oesBiDgKw","stars":5,"date":"2016-07-27","text":"Paul says he's semi-retired, so I almost hate to review him, but he really was fantastic.  He understood the quirks of my old house and made some really good recommendations.  I called him on a Friday after I closed on my new house and he was able to come Saturday to change the locks and install a new combination lock.  He's a got a great dry wit on top of being good at his job.  I was really happy with his work and his service.","useful":1,"funny":0,"cool":0},
{"review_id":"I0ocpFibRV3_RT5arhoIIw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"kaW97gZXyGMdkedZNdQuew","stars":1,"date":"2016-04-03","text":"I have eaten here several times before, and today I took seventeen family members for brunch to celebrate my daughter's first communion.  There were 12 adults and 5 kids between the ages of 1 and 8.\n\nOur server was truly wonderful.  Kind, patient, energetic, organized and generally just incredibly good at her job.  So good that I feel terrible giving one star, however...\n\nThe place was incredibly unfriendly to children.  My one year old was pretty fussy, and I did my absolute best to keep him quiet and out of everyone's way, but it was really difficult.  If we were sitting he was fussy, so we were up and about, being extremely careful not to be in anyone's way. The man who appeared to be the manager was so mean and condescending that he had me and my incredibly well-behaved 8 year old daughter near tears in separate incidents.  He seemed totally annoyed by our presence, and so did some the other patrons.\n\nThe food was mediocre.  I had a crabcake benedict that was incredibly bland.  The crabcakes tasted like saw dust and the hollandaise tasted like nothing at all.  The people who had burgers were happy.  My kids had the fish and chips and it was so-so.\n\nI left a generous tip but I won't ever go back.","useful":1,"funny":0,"cool":0},
{"review_id":"GlefvlczBSKKU6DsiEkdow","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"TFftsYkRIUtdo6ZhRwJ2lQ","stars":3,"date":"2010-02-01","text":"I've always had pretty good service at both Terroni locations.  In fact, my favorite server from Sweet Lulu on Queen West turned up at the Adelaide Street location.  He is wonderful.  And the servers really know the menu, including the wine list. I've always been impressed. \n\nI live just around the corner from Terroni on Queen and I always marvel at the line-ups when there are so many other good choices within a few blocks.  I end up there every once in a while because friends want to go, or because we want to go somewhere kid friendly with our two year old.  I have to hand it to them--they are really accommodating of kids.  They don't bat an eyelash when you come in with a stroller and ask for a high chair.  The only rudeness I've experienced is from the patrons waiting in line, who seem really put out when they need to move six inches so I can get out the door.  \n\nThe food has always been good, sometimes fantastic.  I've never had anything terrible, but last night I had a just ok dish for the first time: the spaghetti alla norma.  The pasta was perfectly al dente as always, but the tomato sauce lacked flavor and the chunks of deep fried eggplant were soggy and bland.  I started with the giuggiolosa salad, which was wonderful and kept the meal from being a loss.  \n\nThe pizzas are really tasty, and the spaghetti with lemon and capers is one of my favorites.  The pasta portions are pretty small for the money, I find.  They are just the right size, if you ask me, compared to the monstrous portions at other places, but $16 or so for a small portion of vegetarian pasta seems excessive to me.  \n\nMy biggest peeve is that the salads are all just shy of entree size, which means too large to be starters, but at entree salad prices.  It feels indulgent (and it is expensive) to get a salad and a pasta, but pasta alone isn't enough veg for me, and a salad alone isn't filling enough.\n\nActually, that's my second biggest pet peeve.  My biggest is the little note on the menu that says, \"While alterations may seem easily accommodated they compromise the unique characteristics of our food.  Please respect our menu.\"  I find that really obnoxious.  \n\nI'm sure I'll be back, not even kicking and screaming, but it just doesn't live up to the hype for me.","useful":3,"funny":0,"cool":2},
{"review_id":"DZ2cwUvbczr5klbF5snh_A","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"FH4rmSFeBOrt91ji0ZqlRQ","stars":1,"date":"2010-01-17","text":"I have to start by saying that on the night I ate here I had a reservation at Nota Bene for a long-anticipated date night with the husband, which was derailed by a last minute \"you must sign paperwork TONIGHT\" fiasco with our lawyer and mortgage broker.  So instead of dinner at Nota Bene, we signed 10 documents in triplicate at Bloor and Ossington, then wandered, starving, into the first place we saw that looked interesting. \n\nIt's definitely not fair to compare Queen of Sheba to Nota Bene, but in comparing it to other Ethiopian places I've eaten, in Toronto and elsewhere, it's really not in the same ballpark.  \n\nDo you want the good news or the bad news first?  Read bottom to top if you're a good news first kind of person.  \n\nThe decor and cleanliness were really, really sketchy.  My husband and I (who were in a surprisingly good mood given the turn of events) commented that had it not been for fairly significant dining experiences in various developing countries, we would have high-tailed it out of there.  Just inside the front door we were greeted with the stale smell of cigarettes and just damp dirtiness; fortunately as we passed the kitchen and entered the dining room the smell greatly improved.  The carpeted(!) dining room was sorely in need of a shampoo.  The bathrooms were freezing cold and let's just say not spotless.  The paint in the dining room looked half-finished, with roller marks on the ceiling and some unfortunate color choices, and patches just not finished, like the painter quit half way through the job.  One upshot was the lighting, which was mostly from wall sconces pointing upward (not bad when ceiling mounted neon lights would have fit right in with the rest of the decor choices).\n\nThe service.  Oh God the service. She was pleasant but either really ditsy or really high.  My husband asked what the premium beers mentioned on the menu were and she just shrugged and said she didn't know.  In a  nice way, though.  When we told her we don't eat red meat and asked if we could do a platter that was a mix of chicken and veg she seemed sort of confused.  She suggested we do the mixed platter, but minus the beef and lamb, about which I sought to confirm that that might mean more chicken and veg given the absence of the other items.  To which she responded, nicely, no.  Being hungry and in no mood to be difficult, we just ordered the mixed platter of chicken, beef, lamb and vegetables, and I proceeded to eat red meat for the first time in 18 months. \n\nThe food was ok.  The beef was actually a highlight.  It was stewed in a dark sauce with a hint of sweetness.  The chicken was two drum sticks in a spicy sauce and the meat was tender and flavorful.  The lamb was nice as well, though the tender meat was done a disservice by a not very flavorful sauce.  The three vegetable dishes, a split pea, a lentil and a cabbage dish, were disappointingly bland (they made me glad we hadn't gone for the vegetarian platter).  And finally, the side plate of injera was right out of the refrigerator.  That sucked, actually.\n\nThe best thing I can say is that the price was right.  For a huge platter of food for two plus three beers it was $40 plus tip.  That's a pretty good savings versus what we would have spent at Nota Bene...","useful":2,"funny":1,"cool":1},
{"review_id":"2jhZVc0aIAJMdLCtNJPRdg","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"2obBIvb5WTZbcErWSqkcOg","stars":1,"date":"2010-12-12","text":"Please do yourself a favor and do not go here, especially if you have kids.  The food is so-so at best and our server was not nice, not helpful and generally bad at her job.  The whole staff seemed indifferent and a little irritated, like they all desperately wished they were somewhere else.  This place is right around the corner from my house and my husband and I love pho but we will never go back, especially when the Golden Turtle on Ossington is near by.  The food and service are much better and they are welcoming to children.","useful":3,"funny":0,"cool":1},
{"review_id":"BbfpjwAy_zUDEGTXtgRWdA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"sRirP65Q7BSg3Lj9FdkKWQ","stars":5,"date":"2009-09-09","text":"Not just the best roti but also the best saag paneer I have ever had.  \n\nThey may be expensive, but one roti there is a LOT of food.  I don't think I've ever finished one by myself.  The perfect setup is two rotis, three people.  Just enough food and a really decent price per person.    \n\nMake sure you get a side of mango chutney.  The combination of the sweet chutney with the savory\/spicy rotis is heaven.","useful":2,"funny":0,"cool":1},
{"review_id":"m5maG1egF1CT0iq_fRsg6Q","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"hjZ5H56DgFd_j2U0FDEn7Q","stars":3,"date":"2009-09-10","text":"The first time I went worked out great. The manager was there servicing the payment machine and he gave me a mini tutorial with helpful tips (e.g., if you get the package that includes the undercarriage wash, drive slowly or you'll miss it).  It was about $10 for a wash and wax and the windows and body were left surprisingly streak-free.  They have vacuums you can use for the interior.  \n\nMy only complaint is that the second time I went the machine wouldn't accept any kind of payment.  I tried paper money, toonies and a credit card to no avail, yet the machine didn't indicate it was out of order.","useful":5,"funny":0,"cool":1},
{"review_id":"bJooeXvPdTgOsu5fxJSEJA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"N8jmyJCk-LjO9o1K9UjxNA","stars":2,"date":"2010-02-12","text":"I feel betrayed.  My second visit to Harlem Underground was a disaster, and I'd been talking it up to my dinner companion for weeks.  I actually feel embarrassed.  At first I thought maybe I'd just ordered wrong, but my friend had what I had on my first visit, fried chicken with waffles--the house specialty, and was distinctly unimpressed.  \n\nI had the turkey meatloaf, feeling in the mood for something less egregiously unhealthy than fried chicken, and it was terrible.  Dry and bland and sort of chewy.  It was improved by a nice though small side of steamed spinach with a slightly sweet (maple syrupy?), buttery sauce, but that wasn't enough to rescue it.  \n\nWe both had a side of mac and cheese, me because they were out of sweet potato fries (odd, since earlier that afternoon I bought sweet potatoes at the grocery across the street).  It was not totally awful but it tasted like it had been sitting around for a while.\n\nTwo things rescued it from one star: the service and the red velvet cake, the latter of which I doubt was made anywhere near the premises and even a bit dry, but nonetheless authentic and delicious.  Thank you Liam, our charming and on the ball server.  I hope the lackluster food doesn't screw you out of the tips you deserve.\n\nI'm eager to see what other reviewers have to say, because clearly my experiences are wildly inconsistent.","useful":2,"funny":0,"cool":1},
{"review_id":"Bw0tMFH8IRrwQQwwFzdvZQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"Cw4CAZ3t7X1S-0svpc4YWQ","stars":2,"date":"2014-04-28","text":"We had really high hopes, and while the service and ambiance were great the food just wasn't that great.  The veggies were all undercooked.  A plate of carrots had a lovely caramel color and looked fabulous but they were basically raw.  Similar issue with Brussels sprouts.  \n\nEverything seemed a little under-seasoned and lacking in flavor generally, and worse, nothing arrived especially hot, which seems odd since we were there pretty early and I believe the first table served.  A halibut entree had a totally raw squid tentacle section, which seemed unintentional.  For the money I'd be really hesitant to give them another chance when there are so many other spectacular options in the neighborhood.  \n\nMost of the 5 star reviews seem to be for brunch, so maybe we'll have better luck if we try that instead of dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"wGZRINxJuOh-CjE2_Lo44g","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"GDvt0v8f1GKNts8JMTB8Xg","stars":5,"date":"2013-03-12","text":"If I'd known about this place I'd never have set foot in a Home Depot.\n\nWith Home Depot 25 minutes away it just seemed like the thing to do.  Maybe it was the modest-sized storefront of this Home Hardware that made me think I couldn't get what I need there.  What I didn't realize is that not only is their assortment of merchandise genius-ly managed but they also have a big lumber building down the alley in the back.  There is also free parking in the back.\n\nI walked in last week with a list of six items, including drywall anchors to mount a TV on my wall, lumber to make a lollypop tree for a fun fair, and a bathroom vanity top.  The first person I saw looked like he couldn't be more than 22 but I didn't want to judge based on his youth so when he asked if he could help I just launched into my items, one by one.  He ran me through options, made recommendations and got me through all six items, including one job that after talking it through we decided together I'd be better of with a handyman.  For that he gave me the number of a good local handyman.\n\nIf you've shopped at Home Depot lately you will recognize how massively different this experience is from what happens at Home Depot.  There's just no comparison.  This Home Hardware is an absolute gem and I will never go to another hardware store again.","useful":2,"funny":0,"cool":1},
{"review_id":"7rV0XqUXu_qDXBuOwSoWyg","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"xJ8cNckXVlkvv-HbGg_r6w","stars":1,"date":"2014-12-23","text":"Downgrading from two stars to one after an abysmal car wash. The interior of my car is soaking wet and not remotely clean. There are dried leaves and dirt on surfaces that should be very easy to reach. \n\nThe outside of the car is mostly clean but covered with lint from the towels they used to try it. \n\nOne look at this place should be an indication that they do not take pride in their work. There was a huge open hole in the floor right in the past or customers walk between paying and picking up their cars, like a mechanic's pit that someone forgot to cover. The place reeks of various chemicals and it's filthy.  \n\nI'm not sure why I went back except I guess that it's so close to my house. I have learned my lesson this time.","useful":0,"funny":0,"cool":0},
{"review_id":"ZPq_8mnHvR4vFTQPau5RZA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"wnBlwynWYnU6ANJ5RY0ZPQ","stars":5,"date":"2011-07-20","text":"Heather is fab.  She gives great hair cuts at rock bottom prices ($6 for kids).  I think adult cuts are around $12.  If I weren't so vain and  chicken, I would go to her instead of my $55 lady.","useful":2,"funny":1,"cool":1},
{"review_id":"qDn0NjwJA5uthjjdB-zcXQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"ZgGg7frEjgmNMdIrRpiouw","stars":3,"date":"2010-12-12","text":"Mt. Sinai seems to be full of all manner of totally competent and even brilliant doctors, so if this were a ranking purely for medical expertise I would give them five stars.  I really do believe they are probably one of the best hospitals in North America in terms of quality of care.\n\nAlas, part of being a good hospital is having smooth operations and modern facilities, and this is where Sinai doesn't rank as well.  I once went for a pre-natal ultrasound that was scheduled for 9:15 and I wasn't seen until after 11.  When I commented to the technician that it must be a particularly crazy day she said flatly that every day was like that and that she wasn't surprised at all at my wait.  Totally unacceptable.  Patient scheduling in something as routine as prenatal ultrasound is not a complicated science.\n\nI delivered a baby at Sinai under some pretty shitty circumstances and I had one nurse in particular who was of the, \"you shut up, I'm in charge\" mentality, though the rest of the nurses were wonderful.  There was a bathroom in my room but it had the unmistakable, neon-lit, beige tile, bleak look and feel of a hospital bathroom, with only one, too-small, not at all soft bath towel.  It was clean I suppose but not in the least bit comfortable.","useful":7,"funny":5,"cool":1},
{"review_id":"Zln8LAdjFXSjmg77ZpOCtw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"CuR4Xxu_aHrYD0IGGRdm5Q","stars":4,"date":"2010-12-10","text":"I had a really good lunch here today.  The steak special was a sirloin served with crab risotto that had real chunks of crab.  The sweet potato fries were nice and crispy, some of the best I've ever had.  The blueberry bread pudding for dessert was lovely, and my lunch date, who has recently lost some weight but has a Friday cheat day, ordered it with a scoop of vanilla ice cream that turned out to be three fantastic, house-made scoops of deliciousness.  Service was good as well (if a bit of a  downtown cliche: beautiful 22 year olds in Lulu Lemon tank tops).  It's a nice, high-ceilinged space with good downtown people-watching.","useful":2,"funny":0,"cool":2},
{"review_id":"2osSjwJ_-p8i1L5ppEIDjw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"C2mFmp6lbHD41UgRynru-w","stars":5,"date":"2010-12-24","text":"I love this place.  Every year at Christmas they have Santa on a Saturday and Sunday.  We went for the second time this year.  The Santa looks perfect and is super nice and patient.   Mrs. Claus is there as a helper to hand out candy canes and take photos if you ask her.  There is no professional photographer, but as long as you have your own camera you can take all the photos you want and not pay a ridiculous sum for prints.   They had free popcorn and hot cider, two reindeer on loan from the zoo, and best of all there is no line.  \n\nThey have a huge selection of Christmas trees and Christmas decorations.  It's like a winter wonderland in there.  \n\nThe staff is knowledgeable and helpful, and while I'm not a gardener myself, I'm told their plants are great.","useful":4,"funny":0,"cool":1},
{"review_id":"XAsVzyX-dANBfkrvetzH6A","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"ILlebFUb89ZozizpVGeHdQ","stars":4,"date":"2012-01-29","text":"A  little rough around the edges, but it has potential.\n\nWe went for lunch\/brunch on a Saturday around 1 and got a table right away.\n\nOur server was attentive but a little green.  She came offering to clear our plates when we were about 80% done, with no utensils laid on the plate indicating we were done.  No big deal.  She was good otherwise.\n\nThe food was hit and miss, with really excellent and crisp sweet potato fries sharing a plate with bland, limp cole slaw.  The chicken sandwich they came with was fab.\n\nThe omelette came with a cheese-covered crostini, and when I say it came with, it came with the crostini *inside* the omelette, which didn't do the omelette or especially the crostini any justice.  \n\nThe romaine salad was delicious but a little boring.\n\nThe decor and ambiance were modern and comfortable, and I can see it being good for a group or a date in the evening.  \n\nThe open concept, communal, unisex hand-washing area in the bathroom is a lame trend that needs to die, as are the hurricane-force hand dryers that can be heard from the other side of the restaurant.  \n\nI would definitely go back, especially since it seems like the service and the food might be on an upswing.","useful":2,"funny":1,"cool":1},
{"review_id":"rDatd8QhsYSHlq14Kq7EvA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"d6O0I9dwf19VyEsrtXbUXw","stars":1,"date":"2009-10-01","text":"I have to respectfully disagree with the first reviewer.  I had dinner at Asian Monsoon tonight and the food was really not good at all.\n\nI was with my daughter so I wanted something not spicy to share with her. It was clear in my questioning of the server that their sauces come in cans\/bottles\/vats because there was no chance of adjusting spiciness.  Her advice was to stick to something with no \"chili pepper\" symbol next to it.  Fair enough.  So I ordered ginger chicken.  The saving grace was that the chicken appeared to be white meat and the veggies were fresh, but it was exceptionally bland.  No hint of ginger, not even any salt.  Just a corn-starch thickened sauce (sauce being a generous word for the gelatanous film covering my food).\n\nOne of my fellow diners has a bad reaction to MSG, and without recapping the whole conversation it was clear there could be no guarantees about the omission of MSG from any meal.  No report back from my companion on her post-meal MSG status, but she commented that her dish was quite dry and bland.  That explains all the dipping in soy sauce.\n\nThai cooking is known for its balance of flavors--a mix of savory, sweet, sour, salty.  The mango salad, which is typically sweet and sour with some vinegar, was pretty much just sweet.  It wasn't awful, just not good.\n\nThe service was good and accommodating.  My toddler made the usual mess, and I did the usual hands-and-knees routine to make sure toddlers remain welcome in restaurants, and the server was super nice in insisting she would take care of it.  \n\nIt's definitely the kind of place that has a cook, not a chef, in the kitchen.  If you're really, really hungry and it's the only place open you may find something passable.  One of my other companions was happy with his meal, though I can't recall what he ordered.","useful":2,"funny":0,"cool":1},
{"review_id":"_Kb4Je9PoUgDv1pQRMlYcw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"hm0y7QxT-UUmQcF074qV0g","stars":5,"date":"2016-08-24","text":"Great coffee (I've had lattes and iced coffee), wonderful service, extraordinary croissants, fantastic sandwiches, and the best music ever.  Miles Davis right now.  80s hits, not too cheesy, a couple of days ago.  Well, a little cheesy... Don't Stop Believing.\n\nI've been sitting here the better part of the morning on my laptop after dropping my kids off at summer camp.  It's a beautiful, sunny space.  It will be worth a special trip back even when summer camp is over. \n\nI haven't been here in the evening yet but they have a nice selection of imported and local beer, and 30 or so whiskeys (mostly scotch but also rye and bourbon).","useful":1,"funny":0,"cool":0},
{"review_id":"p6Kc-d-XNzc4JVt9OTstwA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"dtA3cJ5s_gqRoHbDEDiWYg","stars":4,"date":"2009-09-09","text":"Everyone seems to know about the brunch, but lunch and dinner at Musa are fantastic as well.  It's the perfect spot for a casual dinner or a group of friends.   They do a different chicken and fish special each week and we have always loved them.  Things like skate or halibut on sauteed greens or roasted vegetables.  Always lots of interesting and tasty vegetables, combinations and preparations I have never managed at home.  Amazing reductions and sauces.  The chicken might be a rolled up breast stuffed with cheese on top of linguine with rose sauce.  The falafel sandwich and fries are fantastic, and I think only about 9 bucks.  The staff is good and on top of things but relaxed.  The house wine is cheap and good.  Interesting beers on tap.  Great patio.  The brunch is really good, but you should check it out  for dinner.  It's kid-friendly if you go early in the evening when it's not too crowded.  They have a high chair and some nooks for parking strollers.","useful":1,"funny":0,"cool":1},
{"review_id":"B2RHP27HmsiR77Xm6DqKBQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"zhoNuaWrB125_LRRVPWMSQ","stars":4,"date":"2010-12-12","text":"I've been to the Rosewater for lunch, dinner, corporate events, a wedding and Winterlicious and I've never been disappointed.  The food is always good (though just shy of 5-star worthy) and there's a nice buzz in the atmosphere.  The decor is beautiful, with interesting art and furniture.  For a place owned by a large conglomerate I think they actually did a pretty good job of creating something unique decor-wise.  I get the \"garrish\" take some people have, but it doesn't strike me that way.  Service has always been top notch.  I've never thought the portions were small as some reviewers have mentioned.","useful":2,"funny":0,"cool":1},
{"review_id":"VqgMmTSOEBsKq1MkHK3onw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"5niWXyyRXaO35tvyXmvDIg","stars":4,"date":"2010-01-21","text":"I'm into my second 10-week session with Rainbow Songs at their Roncesvalles location) and my 2 year old and I have both enjoyed it.  Our classes are with Jessica, who is a talented singer and guitar player as well as a master at managing a room full of toddlers.  She strikes a nice balance between repeating songs, so that everyone knows the words, and introducing new songs to keep things fresh.  There are classics (Wheels on the Bus, Old MacDonald) as well as some Jessica originals.  \n\nWe always end with a jam session that includes some rowdy songs with the kids and grown ups playing along with instruments from a huge hockey bag full of tambourines, maracas, castinets, drums and other assorted percussion instruments.  My inner bongo drummer sometimes emerges, but then sometimes I'm happy to shake a maraca gently in the background. \n\nThe school is well run and organized.  The admin is a little clunky, with email being the way to reserve a spot, and a follow up phone call the payment collection method, but they make it easy under the circumstances.  I was accidentally charged twice for the first session and they corrected it and apologized promptly before I even noticed.  It was really good \"service recovery\" as they say.\n\nI recommend it to all my friends and we will definitely keep going back.  It's a great way to get out of the house in the winter and to meet other moms and kids.","useful":9,"funny":0,"cool":2},
{"review_id":"ltAG4u307tGhV_scAWH0nQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"wNL7DFH8wzP6iluQJnsA3w","stars":5,"date":"2013-08-24","text":"As one reviewer points out, if you're going for the \"cute librarian\" look, this place is for you.  I, however, am not even a teeny bit going for the cute librarian look but one day something sleek and red in the window caught my eye, so after living literally up the street from the store for many years I finally ducked in.  Amid the bright floral prints there are treasures of the monotone variety.  Across the store from the high-waisted, full-skirted dresses you will find pencil skirts in deep reds and aubergines and little black dresses that really flatter.\n\nThanks to the friendly, helpful staff I've tried on things I never would have chosen myself and it's made a big difference in how I feel about my wardrobe. Some of my favorite clothes now are funkier and\/or more colorful than I would have ever imagined.  So not only do I get my usual classic stuff here, but I also branch out a little from my comfort zone.\n\nThe store works mostly on a consignment model, where designers provide the clothes for no money up front and they only get paid when things sell.  You will often find one of the designers staffing the store.  The idea of a large percentage of the purchase price I pay going right into the pocket of a local designer, who probably sewed the item herself, makes me really happy.","useful":3,"funny":0,"cool":0},
{"review_id":"QEVGXfjlh5SvIkOAadErIA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"eoLI-MFn07WTv0baf9VLbw","stars":3,"date":"2017-03-06","text":"Perfectly adequate Thai food.  Cheap and cheerful decor.  Slightly rough and tumble strip mall location.  \n\nThe hot and sour coconut milk soup with shrimp was especially good.  A noodle dish and a stir fry were just ok.  Spring rolls with pretty good.  We were in the area and we saw the good reviews so we stopped in.  We left with full bellies and the prices were great, but even in my Yelp review philosophy of reviewing compared to similar places, not compared to the whole spectrum of restaurants, it doesn't merit more than three stars.","useful":0,"funny":0,"cool":0},
{"review_id":"suszJEa7xkmW0M6oc2VR0Q","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"TLMysu1mWiLEslCBon5W1g","stars":3,"date":"2010-04-19","text":"I wanted so badly to love Sidecar.  It's a grown-up kind of place in the midst of 20-something hangouts, the reviews have been solid, it's cute as can be, it's not too expensive and it's a short walk from my house.\n\nAlas, the service was unobtrusive to a fault.  The fault?  An empty beer glass was discreetly whisked away from my husband without the offer of another (\"yes, please\" would have been the answer).  Same for my own empty cava glass which was taken away by a waiter in a hurry, without any eye contact to give me the opportunity to ask for another.  The otherwise competent and lovely staff seemed rushed and distracted, which created some unpleasant anxiety for us.\n\nAs for the food, the Sidecar salad and the beet salad were delicious.  My mushroom risotto was, as I described at first bite, \"the best I've ever had,\" and that assessment still stands upon reflection.  My husband's salmon was perfectly adequate.  The dessert special was a goat cheese panna cotta with blueberry compote.  The texture was somewhere between cheesecake and ice cream, which is to say exquisite, if I may use such a word.  For a chocolate lover like me, it's rare to love a non-chocolate dessert so much.  \n\nThe small hair in said dessert was... amusing.  As my husband commented, \"I guess some people would be really bothered by that.\"  Us, not so much.  It could happen to anyone.  But oddly I think  it might have been that little nudge that pushed us to the \"no\" side of the \"would we ever go back\" precipice.  We left feeling satisfied and happy, and none too poor for the experience, but there was something missing--the something that would get us to choose Sidecar over the hundred other restaurants a nine iron away from our house.  If they make the panna cotta a permanent item on the dessert menu, I might be persuaded to give it another shot.\n\nNB: while described as on College \"at Bathurst\" Sidecar is actually three and a half decent blocks west of Bathurst, between Euclid and Manning.   A big difference if you're a local; maybe no so much if you just drove in from Milton.","useful":1,"funny":0,"cool":0},
{"review_id":"N_Jup1-mA0mYsYStVadZ2A","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"azsyGov8GFJswGxcqIn71g","stars":5,"date":"2010-06-09","text":"A little tiny review for a little tiny place with a little tiny menu: it's all good.  All of it.  All the time.  Lattes: all good.  Cookies: all good.  Scones: all good.","useful":0,"funny":0,"cool":0},
{"review_id":"zUc8kWkhNHzyNWSABk4ldQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"J8EO8a44OWxtgJTS8ZiLgg","stars":5,"date":"2009-08-25","text":"I love this store.  I haven't done any price comparison shopping so I can't really comment on the other posters' experiences, but that's because what's great about Kol Kid is they have unique things I can't find anywhere else. If you need basics it's probably not the best place, but if you want to treat yourself or someone you love you can't go wrong.  When my sister found out she was having twins that seemed like the perfect occasion to splurge on very adorable $20 onesies.  Usually I'm all about the Carter's outlet $12 six pack of onesies (which you won't find at Kol Kid).  \n\nThe staff is friendly, helpful and knowledgeable, and in spite of the high-end nature of their stuff they are incredibly mellow about strollers and toddlers running around.  I also love that they always have new stuff coming in, so even though I browse every week or two (I live very close to the store) there's always something new to look at. \n\nIf you tend to be a frugal person or a bargain hunter, it's definitely not the place for you.  If you want to splurge once in a while (or you're lucky enough to be rich!) it's a wonderful place.","useful":4,"funny":0,"cool":1},
{"review_id":"hQy3WWr05V1ZfSQNlSI7JA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"MnTgDc0zfzH0B6MIzVxRGg","stars":4,"date":"2009-09-09","text":"Ditto everything Sam G. said about the food, and want to add that my in-laws constantly rave about the veal sandwich.  \n\nAlso want to mention the coffee is really wonderful.  Best latte in Queen West (and goodness knows there's a lot of competition).  It's a great neighborhood spot, with lots of cab drivers, families with kids, older Portuguese gentlemen watching football.  It's family-run and the family and the whole staff are lovely.  \n\nThey have a high chair and super clean bathrooms (though no changing table).","useful":0,"funny":0,"cool":0},
{"review_id":"p-I_adzp8yaiu_V4lUDNFw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"elxslTPaO6XnCdyildYEnw","stars":5,"date":"2013-08-21","text":"What a nice addition to the neighborhood.  I stopped in the other day and bought four shirts, mostly FIG brand.  The woman working there gave me a 20% off coupon for my next visit, which was burning a hole in my pocket, so I was back two days later to buy a couple of dresses.  Julie, the owner, was there on my second visit and she was lovely.  She's done a fantastic job with the stuff and the decor--everywhere I looked I saw something I wanted and the whole space is comfortable and relaxing.  There's even a nice \"husband bench\" outside the dressing room.  The glass jewelry is stunning, and I will definitely be back for some.","useful":0,"funny":0,"cool":0},
{"review_id":"VZxlmsnPXD6lTqueKA_2qg","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"JFfZDmNAoa_MHG16K2BY6A","stars":4,"date":"2010-05-27","text":"The food was delicious, the ambiance was lovely and the service, while not the best I've ever had, was acceptable.  We were a chaotic group of eight, with people arriving in ones and twos over the course of an hour.  The staff took it all in stride.\n\nIt was, I believe, an owner who was serving us.  I chose a wine from Chinon, mentioning to my friends that I had spent time time there on vacation, and our server mentioned that that is where \"we\" are from, which I took to mean the proprietors.  Chinon is a small town in the Loire Valley, thus the restaurant's name.\n\nI had chicken liver pate, which I knew would be rich, but nothing could have prepared me for the melt in your mouth beauty of this particular plate.  And it was a massive portion.  Two sort of gelato-scoop curls, which I shared with my companions.  Said companions were my husband's work colleagues, so they were shy about sharing, but the tastiness of the pate had some of them coming back for second and third tastes, propriety be damned.  Even so, some of it went uneaten it was so insanely, devlishly rich.  \n\nMy main was salmon, which was served on what looked like stir-fried rice, as in what you'd get in a cardboard container from a Chinese takeout joint.  It didn't look especially appealing but I had high hopes, expecting that a French take on fried rice might be tasty.  Alas, it was a bit boring and a bit too salty.  The salmon, however, was fabulous.  \n\nAfter my pate starter I opted out of dessert but my companions raved about theirs.  \n\nI would definitely go back, for the interesting wine list (interesting French and non-French options, interesting and non-interesting prices), wonderful food, good service and lovely atmosphere.","useful":4,"funny":0,"cool":2},
{"review_id":"BuQMacwieVfsFp26S0c1bg","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"27_N5P9HZ86IviONPT_twg","stars":5,"date":"2013-04-18","text":"Everything from start to finish was perfect.  I went for my anniversary last night and it hit the spot.  The host was lovely and seated us right away.  We were twenty minutes late and he wasn't bothered in the least.  Told us we did him a favor since the reservation before us lingered.  \n\nWe eat meat occasionally but ended up ordering entirely from the vegetarian menu.  I had the mushroom salad which was wonderful.  My husband had the gnocchi, which I was jealous of and if I had a longer arm I would have eaten half of.  My main was the tortelloni and my husband's the tortiere.  Both were delicious.  I wouldn't change a thing.  \n\nThe Bellwoods Brewery beer from just down the road was nice and the wines by the glass were interesting.  4 oz pours may not seem like a bargain at $9 - $15 or more, but I guess the alternative is to make it 5oz pours and jack up the price by 25%.  \n\nWe got the dessert board for two, which I feared might just be a bunch of fancy sweets prepped earlier in the day by a pastry chef who was long gone by evening.  Turns out it was, but that was ok.  The madeleines were lemony with a little crispness around the edges.  A square of nougat was chewy and nutty.  \n\nThe vibe was lively though not too loud.  As luck would have it they played one of my favorite albums of all time during the second half of our dinner.  \n\nI read a lot of other reviews and my assessment is that Woodlot is a victim of its own success.  People love to find a reason to take down really popular and trendy places so they can feel good about their superior discernment.  Don't be fooled.  This is one of the best casual restaurants in Toronto and it deserves five stars on Yelp.","useful":2,"funny":0,"cool":2},
{"review_id":"cSZzGp7rMVdVyaXaa8S_bg","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"iRxYSTxCLRFu7HWiiHaxUw","stars":3,"date":"2010-02-02","text":"If I weren't a committed urbanite with a healthy appreciation for interesting characters I think I would have walked on by (my suburban friends would freak out and refuse to enter, I'm sure).  I think the first time I sat down on the swing with my baby it was really an experiment, because I'm pretty yuppie and it shows.  I don't think I expected to be chased out of there, but I think I expected at least a sideways glance.  Sometimes amongst a group so eclectic the one thing not so well tolerated is being entirely not eclectic (guilty).  But nope.  Nothing.  No one batted an eyelash.\n\nIt's a great, safe place to take your kids if you want to make sure they don't grow up to be sheltered, prissy brats who freak out at the site of a  homeless person or a group of punk teenagers with highly interesting piercings","useful":7,"funny":4,"cool":4},
{"review_id":"BBN5aw38jJsWUMxw7f1gYw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":5,"date":"2013-08-21","text":"I used to work a block away so was there soon after it opened.  It was packed from the start but it lives up to the hype and I have never been disappointed.  I stopped by with some friends from out of town after a visit to the CN Tower and it was a nice counterbalance to the touristy scene, being all full of downtown hipsters without a tourist in sight. \n\nIt was a Friday smack in the middle of the lunch rush but we got a table in about ten minutes.  The entire staff was tremendous, which alas is not all that common at popular hangouts with frequent 30-60 minute waits.  They can get a little uppity (and a little run ragged), but not here.\n\nThe kicker is that I was with my 5 year old daughter and 1 1\/2 year old son and the staff didn't flinch.  We are not their usual target audience but they brought us a high chair and generally worked around our noise and mess (my kids are not new to restaurants so aren't a total terror but still... they're kids).  \n\nI guess I should say something about the food.  I usually hate to order pad thai since it's sort of a cliche, but it's just so good I can't help myself.  And the combo is wicked and well worth the extra three bucks.  The soup blows me away every time.  How do they do that?","useful":1,"funny":1,"cool":0},
{"review_id":"C0ddytD7GaKhJ_aQmVk7Qw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"Yh8xSwsPSJgVatvXulmh5g","stars":2,"date":"2010-02-20","text":"What a disappointment.  The butter chicken was really average.  Nothing special at all, and it would not get me to go back.  The saag paneer was kind of brothy, rather than creamy, which I'm willing to chalk up to a style difference, however it was so salty it was barely edible (and I like salt a lot).\n\nThe small veggie side dishes (we had beets, eggplant and lentils) were a highlight and the naan was fantastic.  The chai was delicious but too sweet for my taste.\n\nThe main dining room space is nice and casual.  Maybe 10 tables.  There's a good size patio that I imagine is lovely in the summer.  There are two very cute two-person tables upstairs nestled in a dormer window, however I can't imagine sitting up there as you are bombarded with the aggressive, sickly sweet smell of the bathroom air freshener, and one of the seats looks directly at the urinal in the men's washroom (the door seems to be at rest in the open position when the washroom is not in use).\n\nThe service was fine and the kitchen was fast.  No complaints at all there.  It was fairly kid-friendly, although they do not have a high chair.  \n\nI've had much, much better Indian food in Toronto.  The Host and Siddhartha both blow this place away.  I probably wouldn't go back, even if I were in the neighborhood.","useful":2,"funny":0,"cool":1},
{"review_id":"ne-_Oxm8PTHQDpO-lxy-Nw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"UQpOObEgtdyi3IyBSVEntg","stars":5,"date":"2013-02-27","text":"This has been my go-to card store for years and the best part is that every time I go in to stock up there are always new products to explore.  I know the owners from around town and they are wonderful people.  Their store is such an asset to West Queen West and nice alternative to the chain stores creeping their way west from downtown.","useful":1,"funny":0,"cool":0},
{"review_id":"HmkFQusk5sEDSYuPmOQzpw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"l3BwhP-VqM-iXkY5xybQgQ","stars":5,"date":"2016-07-27","text":"This is my new favorite.  I've been in twice and both times they were able to take me right away.  Actually, last night I arrived at 7 and the manicurist was running an errand, so the woman who greeted me put me in a chair right away for a nice foot soak and apologized for the wait, which ended up being less than five minutes.\n\nLou-Anne did a very nice job.  One of the best pedicures I've ever had.  She asked lots of questions about what I wanted, and did some unobtrusive upselling.  I've been meaning to get an eyebrow wax for weeks, so i was glad she asked.  She did a lovely job on that as well.\n\nThe prices are reasonable and the store is clean.  The staff are friendly.  I really couldn't ask for more.","useful":0,"funny":0,"cool":0},
{"review_id":"oHHr2l-qxFqtRB6qtM7FBw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"hUalWNTIj6dR80xJjboJ1w","stars":4,"date":"2013-10-15","text":"The staff was excellent across the board.  Helpful and knowledgeable with none of the grumpiness you might expect from people who sit behind bullet-proof glass and help people navigate through complicated exercises in paperwork.\n\nI am American and was going to file a Consular Report of Birth Abroad.  Your experience may be different if you are going to apply for a visa to visit the U.S. The line was definitely longer for visas, and as one reviewer notes, if it's busy you may very well spend time waiting outside.\n\nA couple of things could be improved:\n\n1. The list of things you can't bring inside that's posted on the web site is different from the one posted outside the building where you get in line.  The web site specifically says no cell phones, but in fact they will allow you to check a cell phone at security and pick it up when you're done.  The web site doesn't say anything about large purses or backpacks, but the sign outside says they are prohibited (although they did let me bring in my backpack full of art supplies to keep my five year old occupied while we waited).  I should have snapped a photo of the poster outside that lists prohibited items.  It's plainly visible from the street if you want to have a look in advance.\n\n2. They have an interesting interpretation of the word \"appointment.\"  It doesn't mean come at a certain pre-agreed time and someone will see you at that time give or take a few minutes like it does in the rest of the world.  It means come at that time, take a number, and depending on how busy we are we will call you in 1-2 hours. \n\nTip: don't kill yourself getting your Express Post envelope before your appointment.  You can duck out to the Staples across the street to get it while you're waiting for your number to be called.  Just make sure you get a slip of paper giving you permission to re-enter without waiting in line again.","useful":24,"funny":1,"cool":0},
{"review_id":"ZlIgVptg3hhiL46845tlmA","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"DQf63-KJ25m-kDIMto614g","stars":5,"date":"2010-06-09","text":"Five stars for the food.  It's awesome.  I can't dock them stars for being so popular that you have to wait to get in.  I believe it was Cliff Claven who said of a bar that wasn't Cheers, \"no one goes there any more.  It's too crowded.\"  \n\nI've always had good service, and I've been about ten times.  Maybe I've just been in less of a rush than other reviewers.  Who's in a rush at brunch, anyway?\n\nTip: unless the weather sucks, get a latte and a scone from Ella's Uncle across the street while you wait for a table.  Makes the wait a pleasure.","useful":0,"funny":0,"cool":0},
{"review_id":"sWS11bV51h6h_f3u9dfS3g","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"Jm0a8xXbVvw2Gg-FwMylSw","stars":5,"date":"2014-03-23","text":"I've used Montreal Movers twice now, both times to bring things up from the U.S.  They were wonderful to deal with through the whole process.  They showed up on time, nothing got broken or damaged, and the price they quoted was the price I paid.  I did a lot of research and I was surprised how many negative reviews there are out there for movers. I've had a few really bad experiences myself.  But Montreal Movers did a wonderful job and I recommend them highly.","useful":5,"funny":0,"cool":0},
{"review_id":"6F3SdErqgug6o0t9uDM8KQ","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"OACjhgf8nnYGzFnOhA7uhg","stars":4,"date":"2016-08-09","text":"Great pitchers of magaritas and sangria.  Huge patio. Staff is friendly and competent.  Food is ok but not great.","useful":0,"funny":0,"cool":0},
{"review_id":"Q5WQch4vuSI6cH_eeRcbVw","user_id":"uWeAWWzKpOl6o7V-BdtUGg","business_id":"9ihemnM3Vy1IWAK-zzrLwg","stars":5,"date":"2009-09-09","text":"Ella and Elliot has the most wonderful baby and kid furniture (at the high-end of the price spectrum).  The store is beautiful and fun to browse, with furniture (high chairs, cribs, beds, dressers, changing tables, rocking horses, etc.) on one side and toys, books, clothing and other accessories on the other.  The staff is knowledgeable and friendly.  They were out of something I wanted and they went out of their way to order it and let me know when it came in.  \n\nIt's a great place to go if you want to furnish a nursery, but it's also good for baby gifts and occasional impulse buys and splurges for your own kids.","useful":9,"funny":2,"cool":1},
{"review_id":"u9U7o6th8FS1eI0FxooYMg","user_id":"ijFzX5UHYFD709gncOSfqw","business_id":"3xykzfVY2PbdjKCRDLdzTQ","stars":5,"date":"2014-04-23","text":"This is a solid place for sushi! They are consistent, great prices, fresh and delicious every time! Service is also good, so I keep coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"VV_pKeKAeSJ53bJghtcNng","user_id":"ijFzX5UHYFD709gncOSfqw","business_id":"zwNC-Ow4eIMan2__bS9-rg","stars":5,"date":"2014-04-23","text":"I love this place! Tacos pastor is the best in town and their salsa bar is delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"dbFNIfjHZYsEOhQZWC24zQ","user_id":"ijFzX5UHYFD709gncOSfqw","business_id":"2SbyRgHWuWNlq18eHAx95Q","stars":5,"date":"2014-04-23","text":"I absolutely love this place! I come here once a week, and always order the same thing, the bento box dinner special. It comes with a soup, salad, dumplings, rice, salmon teriyaki, shrimp and veggie tempura and one sushi roll! so much food and all delicious. Salmon is always cooked perfectly, and the tempura is the best I have had! Super crispy and tender inside! I will continue to come back weekly!","useful":0,"funny":0,"cool":0},
{"review_id":"-9y-e_XSEkTGYbu6bbxjOA","user_id":"NenBlO39SKxqakRMiwD8yQ","business_id":"3_QNAH8yVzY0sBPftWyNhQ","stars":1,"date":"2015-01-18","text":"This place was horrible. The environment was very noisy, tacky looking, and the waiting room employee offers a discount on a massage before you are even seen by a masseuse! He picked up my phone and physically guided me through the process of posting, just to make sure that I gave the location 5 stars. Needless to say, once he completed my post, I rated the location with what it deserved.","useful":0,"funny":0,"cool":0},
{"review_id":"cu7i4kC6HnBsKgnN8ISyZA","user_id":"aM4H5PWHcDnhrKSYYFd-eA","business_id":"0HpI622wnz7ePcJYmIVkTQ","stars":5,"date":"2017-06-09","text":"Wonderful service and very accommodating to our needs. Chef Gabby is amazing. The staff at the front desk...especially Trent.. above and beyond service. We will be back. \nCW. From Wyoming","useful":0,"funny":0,"cool":0},
{"review_id":"Wk_OgnVS0bSyZzGSSc4mig","user_id":"elKr4sYMOUwMYUt4gFTKEg","business_id":"I9Rw9CSZPNKvIYG0gOHOjw","stars":4,"date":"2016-07-17","text":"Absolutely loved my mocha. However I would recommend getting the large as the small is very small. The barista was very friendly! All around great environment and the shop is very cozy. Would definitely return!","useful":0,"funny":0,"cool":0},
{"review_id":"Sr1GG65xHu14gMW_fO5UIA","user_id":"elKr4sYMOUwMYUt4gFTKEg","business_id":"POw6bMXjMHPbV55xVfvAag","stars":2,"date":"2016-06-15","text":"Service was good, owner was very friendly, however I was expecting more of a coffee shop atmosphere, however this area reminds me more of a store. I drink a lot of coffee, however I ordered a latte and it was very sweet, not to my liking. Location is convenient if you work in the building.","useful":0,"funny":1,"cool":0},
{"review_id":"d34bJKLbj9J76yoPyIM54w","user_id":"elKr4sYMOUwMYUt4gFTKEg","business_id":"bMSiHjs2fbKbBNPyuTwhHA","stars":3,"date":"2016-06-15","text":"Decided to try this place last Sunday. We had a 1-1.5 hour wait, however it was absolutely beautiful outside and the environment was great. The restaurant patio is nice and it was perfect to sit with a margarita and enjoy the sun. I would not go to this place on a rainy or cloudy day however. The food was subpar. I enjoyed 1 of my 2 tacos, and the tacos are pretty tiny along with the serving of guacamole. That aside, they have happy hour everyday 3-6 (not sure of exact time), and around 4:30 that day they were out of 3\/5 happy hour drinks. All in all, you are paying for a fantastic view. I would recommend this place for happy hour and an afternoon or evening to enjoy a margarita in the sun.","useful":1,"funny":0,"cool":0},
{"review_id":"-fjy9QiT0zOjyZbCAnpDAg","user_id":"elKr4sYMOUwMYUt4gFTKEg","business_id":"63ieHAevJ5szVnClT8FzGQ","stars":5,"date":"2017-08-01","text":"I love coffee shops (without a bunch of artificial flavors or as I would call them \"syrups\") and this is one of my favorites. Everyone is friendly. I sat on the back outdoor patio (they have a small front one) and I love the plants, shade (since it's 85 degrees) and the whole atmosphere. Importantly my black pour over was great along with the chocolate vegan croissant. Good way to start my day","useful":0,"funny":0,"cool":0},
{"review_id":"zGK3Vrtc9XwuIphzWfulbA","user_id":"GiW-2-VK9q5Lagw7uZ2RiQ","business_id":"hTR5pi4Cx7AdtVTHbUJauw","stars":5,"date":"2013-11-20","text":"I had the best service today. Ana was extremely helpful and I left feeling great about my experience.  I will definitely go back to this location the next time I need a loan.  Thanks for the service and loan. Kudos!!","useful":0,"funny":0,"cool":0},
{"review_id":"UI871jiuevOx9eMrpRzHCA","user_id":"XUhpefBK3HE1XLgVVkOqhA","business_id":"l44xtAjA_D4xGk3qaaI3ew","stars":4,"date":"2017-01-25","text":"This was my first time shopping my car, and heard such horror stories. Set up was easy and Mike was very helpful. My car got to it's destination safely, and the driver transporting my car was extremely helpful as well. \n\nI would have given them 5 stars, but no one contacted me or informed me that they didn't have a driver to pick up my car during my predetermined pick-up window. I had to call them and ask what was going on and if anyone was coming for my car. They told me they didn't have a driver for that time, but they had another driver that could pick up my car the next day or the day after. Luckily, it worked with my schedule and I was still in town. \n\nBesides that, it was great service.","useful":0,"funny":0,"cool":0},
{"review_id":"ZtfM4IGUn-VcB7o5INr0Ew","user_id":"XUhpefBK3HE1XLgVVkOqhA","business_id":"r3f1UPDkKqWfRDFQQRgiaA","stars":5,"date":"2016-04-01","text":"Great chocolates made by real artists! Shanterial isn't adorable and so helpful and informative!","useful":0,"funny":0,"cool":0},
{"review_id":"htRaM5Vy5NuFfDbn4ex4Ow","user_id":"I5SdTMwpXejlRb20N_pI9Q","business_id":"3DP4oWhTgX7L9Tu1de9Y1g","stars":5,"date":"2012-09-14","text":"I can't sing enough praises for this company. I live in California and I ordered flowers for a friends opening in Ohio and the ladies at Jindra Floral Design went out of their way to meet both my budget and design needs. Debbie even texted me a picture of the final bouquet when done and they changed the vase at my request and sent another picture to make sure that I was happy with the final result. You just don't find service like this anymore and I'd recommend them to anyone for any occasion.\nSharon","useful":9,"funny":1,"cool":0},
{"review_id":"_H2oB6QMMIErqlZupQMB4w","user_id":"cURmEZw1nfdVLu8LIZvfiA","business_id":"XMMLRvV4IMxIGyc4H37LxA","stars":5,"date":"2013-10-16","text":"Amazingly fresh and delicious with lots of gluten free options. The natural beef and black rice stir fry was outrageous (not gluten free). My wife had the Panang Curry and based on the rapturous look on her face, she enjoyed hers as well.","useful":4,"funny":0,"cool":1},
{"review_id":"L1lZZbBGQmtYvgCnDlPXuw","user_id":"Md2xjgex_5IXS-jRmz4u9w","business_id":"4mnPCMQwcYleSEN9XL9VuQ","stars":1,"date":"2015-02-11","text":"Do not order from this company online. I placed an order with them for snow boots because they had the boots I wanted in stock and promised 3 - 5 day delivery.  I received confirmation promptly and then nothing.\n\nA few days later I checked my order online which said \"pending\". So I waited. After a week I called and was told the boots were backordered, would ship in 4 days. When I asked why I wasn't notified I got, \"Yea, you shoulda gotten an e-mail about that.\" I didn't (and I did check spam)\n\nFive days later, no communication from them and still \"pending\" on-line. I called again and was told that the boots were now unavailable. Again, I asked if someone thought it might have been a good idea to let me know. Again, I got \"You should have been e-mailed about it.\" Knowing that it should be in their system if I was I asked.  Nope, no e-mail ever sent but she could offer me 20% off my next order.\n\nThere will be no next order.","useful":1,"funny":0,"cool":0},
{"review_id":"vJDltu9LkeUAcAu7FW3roQ","user_id":"UpXxPvQgWNd676NwzxXXiw","business_id":"7KZAmn7C1ogJH5l6B8D8TQ","stars":1,"date":"2017-04-06","text":"I have owned five RVs through the years and dealt with a multitude of dealerships. The absolute worst, by far, is Desert Autoplex in Mesa, Arizona. First off: it takes several days and many phone calls to get someone to answer the phone. You get recorded responses such as: \"No one is available to take your call\" or, \"Hold on while I tried to connect you\" and then you get disconnected. Then when you do get someone, they are usually quite vague about whatever information you are calling for be it service, sales, or administration.\n I bought an RV from them which required some immediate maintenance. I picked it up after they handed me the signoff sheet and I trustingly drove off only to find a day later that some of the work had not been performed.\nThere are some really nice people there trying to do their job but they seem very shorthanded and very poorly managed. There are many shortcomings, i.e., the telephone service, which could be handled easily if only the owner\/manager would take an interest and do something.\nNote the BBB has a big REVOKED on its Desert Autoplex site.","useful":8,"funny":0,"cool":0},
{"review_id":"EN3Ne_RSNKfSLsHqdOsbNA","user_id":"qdCThk84RAIKfhmnZnk8RA","business_id":"PgdQrTSOX132EgNj8VPNlg","stars":3,"date":"2012-01-02","text":"Came in on Wednesday night around 9. No hostess, so I sat close to the bar. Took a long time for someone to address me. My waitress didn't seem too happy about being there. Got a beer that I didn't like. My waitress didn't inquire why I didn't finish it. The food was good. Wouldn't come back though. Service is important to me.","useful":0,"funny":0,"cool":0},
{"review_id":"dmiw0Vrnjbd_rATDog6QyQ","user_id":"cNH1JUZmWZfkjJdUtnhSFA","business_id":"yQab5dxZzgBLTEHCw9V7_w","stars":4,"date":"2016-11-17","text":"Overall a nice and clean airport, plenty of food options and some shopping as well. Clean bathrooms. Biggest dislike is the layout makes for long walks and limited charging locations... generally it's not very crowded for being a hub station.","useful":0,"funny":0,"cool":1},
{"review_id":"3PsOxPthUHYDuFsjPZiteA","user_id":"kgODITgji5ES8ZT3W9HCaw","business_id":"Yp3yuxI6hIzGP9xb5a5-bQ","stars":1,"date":"2017-03-16","text":"What is worse than driving all the way to the other side of mountains edge just to find out part of your order is missing , not getting an apology... even my 12 year old noticed that the could care less... he said \"wow, they did not even apologize...\" pretty sad but that is why the have 1 and a half stars ...","useful":0,"funny":0,"cool":0},
{"review_id":"F-X0JNkGiN_L3xx5GgJ4Mw","user_id":"kgODITgji5ES8ZT3W9HCaw","business_id":"eiTWTVThkHr-DKXxIysbgA","stars":1,"date":"2016-10-25","text":"This place started off good but the portions have gotten smaller and smaller. That would explain why I have never seen more than 2 people in the place. For what they charge I would recommend jaburritos on rainbow... kinda sad because it could be amazing but the portions control is so strict a large bowl does not fill my 8 year old...  one slice of avocado on my bowl tonight... seriously???? I will not be back....\n\nAlso... if you do not care about customer comments and you just want to say how great you are,  then keep buying your 5 star yelps with free meals... to have you argue back how great your portions etc are is just proof of how oblivious you are... your response to me is ridiculous...","useful":3,"funny":0,"cool":1},
{"review_id":"pE2QCTBNl1JtETtGmvyj9w","user_id":"CTRNCaKz-DgEGSiXVe-2RQ","business_id":"foIuy7XYn9-Epw3gfFgAAA","stars":5,"date":"2015-09-16","text":"I had Oasis Chem-Dry come out to my house and clean my carpets a few days ago. I have a difficult work schedule and I only had a small window to work with. They said that the day and time that I needed would not be a problem. They we're right on time as promised. They were also spot on with the quote that they gave me, which was very fair. I was also very pleased with the outcome of the cleaning of my carpet. I will be using Oasis Chem-Dry again and I will recommend them to my friends.","useful":0,"funny":0,"cool":0},
{"review_id":"Jrz-Odu4DYehLDBO_bcAkw","user_id":"FgYPpaFS5YkhAQRvdhjy3g","business_id":"N7j_rJ0Vlwb-Gf-6cy4uiw","stars":5,"date":"2015-11-13","text":"Last review said Qdoba served frozen guac??? This couldn't be further from the truth!!!! Qdoba ALWAYS makes fresh guac from a case or sometime two avocados, EveryDay!!!! Ask to watch them make it!!! Totally FRESH everyday!!! I believe Chipotle is the one w frozen guac and a Chipotle worker made this review","useful":1,"funny":0,"cool":0},
{"review_id":"HWvjACZ-1666RpDe5aX0aA","user_id":"-D_Gd_lVPd29H7m2nANwVA","business_id":"cstB6cn7EU9v7NwAhDipGA","stars":5,"date":"2015-02-15","text":"absolutely wonderful chocolate.  I go to chocolate shops every time I travel , but this is by far the BEST. I love there flavors and friendly staff. I give 2 thumbs up and 5 stars","useful":1,"funny":0,"cool":0},
{"review_id":"aNEOWkG4KMtwc4Af7gcMww","user_id":"xiupjWqKHAFE_F2KWIHhWw","business_id":"xNnZ5ksBY1gwwTV2Btb4Ag","stars":5,"date":"2013-05-19","text":"amazing - everything. we had the smaller dishes: asparagus, lobster cerviche, tempura veggie, gravlax. All good.","useful":0,"funny":0,"cool":0},
{"review_id":"bOTBNsrzG-ufX-HykgyfIg","user_id":"xiupjWqKHAFE_F2KWIHhWw","business_id":"ubOoMnnqm5w30gh_eRNxkA","stars":3,"date":"2013-05-19","text":"Decent diner but nothing special really. Perhaps it is a great diner with Montreal measures but, I don't think it's much to write home about.","useful":2,"funny":0,"cool":1},
{"review_id":"TvKrcWeq-L2i9kO2z5sz0g","user_id":"xiupjWqKHAFE_F2KWIHhWw","business_id":"WeWNrDARpYT_m7tnfrXRRw","stars":4,"date":"2013-05-19","text":"I had the daily special where you combine a BLT sandwich and a piece of pie. I don't have to mention that the pie was great but actually; the sandwich was not bad either. Friendly staff and a nice neighborhood adds to a great experience.","useful":0,"funny":0,"cool":0},
{"review_id":"LdV1aMpLHpbZPYTmfyQWYQ","user_id":"xiupjWqKHAFE_F2KWIHhWw","business_id":"f-cg_onJ_v-RGdCx75EZMA","stars":4,"date":"2013-05-18","text":"The food is creative and well prepared, the ambience is lovely, the wine list impressive. However, it seems like they haven't really decided if they are a tapas bar or not.","useful":1,"funny":0,"cool":0},
{"review_id":"qnwgwmq1UgsP-mGXtcz-Dg","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"LbAeNotV_LcP-BOdAncbpQ","stars":3,"date":"2013-05-12","text":"The Billingsgate Seafood Market knows how to fry a fish. I don't say this lightly; there's a lot that needs to go right in order to produce something more than the oily, thick-battered fare you're likely to find in most Calgary pubs. Their fish is fresh (the place is primarily a fish market - one of the few in the city) , their cut is ample, their batter is thin, tasty, and just a little bit crunchy. A coating of house-made tartar sauce on each flaky piece seals the deal. The accompanying fries are fine, but are typically not made to order (unlike the fish), so they can vary from fryer-fresh to a limp, luke-warm.\n\nThere's more to the menu than fried fish but I was disappointed with their bland fish tacos and their cheese-rich-but-fish-poor tuna melt.  The seafood chowder is hearty and better than most at this price-level, but the quality can vary. They clearly know their fried fish, however, and I've never been disappointed with either their cod or halibut offerings. If you're in the area and craving a proper fish fry, give this place a try.","useful":2,"funny":1,"cool":0},
{"review_id":"hv7ULP_Mu2Ak2aknBC-xyA","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"AX-FMB3oXLBht2fr-qgeZg","stars":4,"date":"2013-04-04","text":"This unassuming family-run restaurant is a terrific lunch spot and is well-worth the trip if you're looking for quality South Asian cuisine. There's plenty of Asian options if you're not interested in Malaysian food, but you really should try their Laksa, a traditional Malaysian dish which they execute extremely well. The beef rendang is  also quite good, especially when paired with coconut rice.\n\nThe restaurant itself is fairly bare-bones and somewhat stark, with old wooden tables, cheap chairs, and a dated color palette. The restaurant was fairly empty when I came for lunch - perhaps it was an off day - which makes the place seem more sombre. Importantly, the service is excellent - your teapot will never be empty and the owner (who took our order) is more than happy to explain in depth what particular dishes are all about.\n\nGive this place a try!","useful":1,"funny":0,"cool":0},
{"review_id":"t_ZXrHgQofBscNbajnN8EA","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"EHMtdSez8MdjZBUOptgWcg","stars":2,"date":"2013-04-11","text":"Marathon ticks many of the boxes for a Calgarian on the lookout for an Ethiopian food experience: plenty of different meat and vegetarian stews available individually or as shareable platters, an abundance of injera (spongy flatbread) that makes utensils optional, a distinctive, spicy coffee ($3\/person) that follows dinner, and a sparsity of service that adds - not detracts - to the pleasant laid-back atmosphere of the restaurant. And if that's all you're looking for, Marathon will not disappoint.\n\nIf you're like me, however, and expect good, African flavour for your money, I suggest you look elsewhere. The stews - I had their staple beef, chicken, lamb, and chickpea stews  - are all fairly uninteresting, many of them rich in the flavour of their tomato base and little else. If it hadn't been for the somewhat smokey lamb, I'd liken the experience to eating pasta with tomato sauce at a cheap Italian chain restaurant.  For what you are paying - e.g.: $18\/person if you do the dinner combo platter - the serving sizes are quite small and though the injera is plentiful, it is too bland to eat on its own. \n\nIt's unfortunate because there are not many options for Ethiopian\/Eritrean food in the city. Perhaps the demand just isn't there. But I can't help but wonder if Marathon's lack-luster (and expensive!) execution of the genre may be partly to blame.","useful":0,"funny":0,"cool":0},
{"review_id":"as9kvtTo9WkE8EOTNEVytg","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"_zcXCwMQns9Ca1JcaDc2bg","stars":3,"date":"2013-03-29","text":"Now called Tu Tierra, this charming restaurant still uses the Chinese style sign of the former tenant on its facade. The food is good and fairly authentic but the prices are high, even for lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"Ns-Uhm7gGFmU3Z0u1svVHQ","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"PlcZM0TyPw8JSRQqGjTdBA","stars":4,"date":"2013-04-28","text":"The Hop In Brew is is perhaps the only bar in Calgary with curb appeal: a yellow house, surrounded by a white picket fence and often overflowing with happy (or least, pleasantly calm) patrons. Crossing from the city sidewalk into the front yard you feel as if you've stumbled across a cool, but low-key house party in the middle of the suburbs. The main floor is as small as it is cozy, with old wood floors, a stairway that belongs in an old farm house, and calming, earthy tones throughout. Other than the balcony - which you'll have trouble procuring unless you come early - the 2nd story is far less interesting and not much different than your typical low-rent city bar.\n\nIf you can find a seat, you'll need to save it somehow and order from the bar.  The minimally renovated kitchen means your food options ($$) are limited (nachos or pizza - both of which good, not great) and potentially time intensive (expect at least a 45 minute wait if the bar is remotely full). The beer selection is excellent but glasses of their craft varieties (including their house beer) are typically more than $8 each. The cost is offset partly by the higher alcohol content, but unless you're an expert at nursing a beer, it is difficult to enjoy an evening of any appreciable length without ruining your wallet. As long as you're in it for unique beer in a unique place, it might just be worth it.","useful":0,"funny":0,"cool":2},
{"review_id":"gcnJuY5_cXkLXO7ESeS_VA","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"lEbOeImbAcgV2Jve4DgC0w","stars":4,"date":"2013-03-29","text":"It took some convincing for this hole-in-the-wall Chinese restaurant to serve me (a Westerner) the authentic Chinese food they were serving their Asian patrons (there is no English translation for the true Chinese menu), but once they knew I wasn't going to settle for sweet and sour chicken or ginger beef, they had some great suggestions.\n\nI ate a delicious, though expensive, Lobster Chow Mein with an egg-based cream sauce, complete with head and entrails. I was skeptical about the fried rice with salted fish I ordered to accompany it but it turned out to be wonderful. I finished the meal with a complementary red bean dessert that rounded off things nicely.\n\nThe portions are generous and you can get away with one large dish + a rice dish for 3-4 people. \n\nDon't expect to be blown away by the decor or the service but if you're looking for authentic Chinese food in Calgary this should be on your list. Be sure to make it clear to the server that you want CHINESE food, otherwise you may get stuck with the standard Western-style \"Chinese food\" you can find almost anywhere in the city.","useful":2,"funny":1,"cool":0},
{"review_id":"PeGsaUfitEfFHppIxKuRwg","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"7aSOA5TfyIH3KHdSqRoTaA","stars":4,"date":"2013-03-31","text":"We were looking for a brunch place last weekend and the notion of Japanese-Western fusion piqued our interest.\n\nThe decor feels very 'downtown', with dark colours, clean lines, high mirrors, and a trendy eye-popping ceiling piece. Sitting by the window and watching the cars go by, it almost feels like you're eating in a small downtown place, but the illusion quickly dissipates when you notice the adjacent low-rise buildings, which are fine but lack the urban charm. \n\nI had the 'Okonomi' waffles, basically a seafood-esque version of the classic Western brunch staple. I found the flavor both surprising and delicious, with the seafood elements complemented nicely by the perfectly poached egg and savory pork belly. The gluten-free bread I ordered as a side was fine but quite bland and could have used some sort of accompaniment like oil or butter.\n\nI can't speak for the other menu items, but if what I had is any indication of Carino's quality and taste, this restaurant is worth a visit.","useful":0,"funny":0,"cool":0},
{"review_id":"SAlXPY0ADFo-2y7OUl6VRg","user_id":"xOzoC81Eo76JoDpfdbNNbw","business_id":"wi3Mo5Xiq7fPWLRyzjk6Pg","stars":3,"date":"2013-04-25","text":"Whether you enjoy your Salt & Pepper experience will depend on your approach to Mexican food. If you prefer dishes like Tacos, Hot-iron chicken fajitas, or Enchiladas, S & P will deliver (it's hard to miss on these sorts of dishes), albeit at an inflated price. \n\nIt's worth the cost if you favor more traditional fare, such as their (cheap) Azteca soup, a fresh and hearty tomato-chipotle base married with chicken and avocado. Combine it with their in-house chips and salsa\/guacamole and you may not need an entree. Their Mole is also splendid, the staple sauce starting out chocolatey sweet and slowly filling the mouth with a comfortable warmth. As is typical in these smaller Mexican restaurants, the amount of meat on the plate is low but the flavors are solid and mostly worth the price.","useful":3,"funny":0,"cool":1},
{"review_id":"Q1mbM17UrA-tIoZyJ5AEew","user_id":"VQ4ujcjYISbzOT-NvQ-EIw","business_id":"eehnof3F4vRB8ydbRvd_zA","stars":1,"date":"2016-05-30","text":"Service was disappointing. Girl at counter had attitude, didn't want to serve us and said it was closed 40 minutes before closing. Although the cook was great and offered to serve us, it did not make up for the rudeness of the front of the house. Burger's  good. \nOwner may want to check who s(he)'s hiring.","useful":1,"funny":1,"cool":0},
{"review_id":"7gUWgiPUdoOgSJ3iSIpYbA","user_id":"VQ4ujcjYISbzOT-NvQ-EIw","business_id":"p2qoi-QKUs_p6QkDEKVNOg","stars":1,"date":"2017-08-22","text":"Tried them the first time. They cut my friend's cuticle till it bled. I just went today to give them a second chance based on my friend's recommendation. She said the management changed. It didn't. the lady added what I am assuming is nail polish remover in the nail polish bottle because it was running out. Needless to say my nails never dried and I had to remove the polish from my nails. Couldn't go to a client meet with half the polish wiped off.","useful":1,"funny":0,"cool":0},
{"review_id":"zFt8gTMJpCj1hjuV79c_0A","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"6K8aodsJE0BBlZ0_zlHJ1w","stars":1,"date":"2014-07-10","text":"Needed to return a package to sender, they wanted to charge me $2.00 to put one piece of tape across the box. Got the wrong item from amazon and it said to take it back to a UPS store. I had to explain to her that my wife has a PO Box there, then she rolled her eyes and told her daughter\/assistant to \"just tape it\". Poor attitude, poor service. I didn't need to buy anything so I understand I wasn't contributing to their business except for the amazon prime service I have that allowed UPS to ship me a package, but the attitude was unnecessary. Would've gladly paid $2 or more if the lady was just nicer.","useful":0,"funny":0,"cool":0},
{"review_id":"uEPcexJdMC-2_U3uu5M5QQ","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"OK0ba4X5seibH8oMWh4bhw","stars":5,"date":"2014-08-15","text":"Johnny roll, Kiss of Fire, Sun devil, Garlic Butter Special, and Yellowtail nagiri are amazing! See Randy if you sit at the bar he is awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"z6yZDwFiQ63Evdd1EHm5ow","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"JxtwVeuCBX99KEciymlYXA","stars":5,"date":"2014-07-19","text":"Ordered crab cakes eggs Benedict amazing. Had a bite of salmon eggs Benedict also amazing. Great food all around.","useful":1,"funny":0,"cool":0},
{"review_id":"WLj8gUfv4ySLtcfnLgiMlQ","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"jy_knCvSo_zGNMM7RgPQQQ","stars":5,"date":"2017-04-26","text":"I first met Lindsey at Aveda when I was desperately looking for a Brazillian place. I had searched through many companies and my last stop before her was pretty kitty. \nNeedless to say it's been almost three years and I don't go anywhere else. She is knowledgeable about sensitive skin, works with what your body needs, and even more so is accommodating! \nThe products she uses are amazing and gentle, you can access her easily through text or phone calls. There isn't anything bad I could say even if I wanted to. \nDefinitely recommend her!","useful":0,"funny":0,"cool":0},
{"review_id":"oi33xE1PMStsV1lq5itEBQ","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"4SxQLZ2EcjlFRG6BvCi0iA","stars":5,"date":"2014-09-26","text":"The new location is nice there is only one room for massages and facials so it makes appointments a bit limited for those two services. \n\nJessica and Alena at the front deal are very accommodating and I particularly liked how they have two people taking care of daily tasks because it is gets very frustrating when someone puts you on hold while they are tending to phone calls.\n\nAs for waxing Lindsey is freakishly amazing. When she waxes you she does breathing techniques so it doesn't hurt and much and she's super sweet! Best water I've ever been to!\n\nAs for hair I've only done blowouts so no reviews for haircuts from me. \n\nI wish they would put a nail salon in here to make the atmosphere complete! \nIn any case check it out!!","useful":1,"funny":0,"cool":0},
{"review_id":"sHfQfMek_-AyVoc_R-hZNg","user_id":"M8V_esp0ddkCOFiPl9iBrg","business_id":"pqZ79sFCnPMh9IBo-w_BBA","stars":5,"date":"2014-04-08","text":"I popped in to this florist at about 5:15pm (they usually close at 5pm) and they happened to still be open, I just needed a single white rose which they provided for only $3.  The rose was perfect just the amount of bloom.  I've been to many florists, but this one had a much more family atmosphere, not at all cold.  It is run by a sweet mother \/ daughter combo who are very detail oriented.  I will definitely go to them for all of my floral needs.","useful":0,"funny":0,"cool":0},
{"review_id":"k0tICpe_I_U1Rfv9lbVgJw","user_id":"fp8WFACrJuxUvrzuVQ1Stg","business_id":"rrux602t3O8aPUuOcB6i4A","stars":1,"date":"2016-08-18","text":"Let me start by saying, I have stayed at this hotel several times in the past 5 years of taking my children to Carowinds... I have recommended this hotel to several friends who are looking for a place to stay when taking their kids to Carowinds.. \n\nAfter this last stay, I WILL NEVER RECOMMEND THIS HOTEL AGAIN.\n\nok, so here is what happened. We checked in Friday afternoon, took our things to the room, changed our clothes and headed to the park for some fun.. came back around 8 p.m. and noticed our T.V. was not working.. A fine gentlemen came up tried to fix it, could not fix it, and got us a new room.. not an issue, he was prompt polite, and solved the issue quickly, switching the room was not a problem.\n\nSaturday get up, eat some breakfast, return to the room, knock on the door, it was housekeeping, i told them we would leave the room around 10, she asked if we needed service, i said yes please, just please make the beds, and new towels and amenities in the bathroom that would be great, and off to the Water Park we went.. \n\nWe came back around 2:30, room was not done by housekeeping, but we knew that someone had been in the room, because the TV channel had changed from the kids programming.. My wife wanted to take a shower so she went down to the front desk to get some towels, and was told to find housekeeping.. She asked why our room was not done, and was told housekeeping does new checkins first, and then does stay-overs second.. This sounds a little backward to me but ok.. our room was not done..\n\nNext we put our kids down for naps, since we were going to go back to the park that evening.. Our kids could not nap because housekeeping kept yelling up and down the hallway.. I asked several times for them to please be quite, and was completely ignored. I tried to call the front desk, but the phone did not work, so I went down to the front desk, and yes i was a little upset, I asked to speak with management and was told she was management, I explained the situation and was told that there was a Family Reunion in town and that was where the noise was coming from. I stated no, this was housekeeping. she proceeded to argue with me on who was causing the noise. I said I wanted to speak to the owner, she gave me an 800 number to call, I returned to my room, and called the 800# and was on hold for 20 minutes. \n\nThen for the next hour there was 4 knocks on the door, when i opened the door, there was no one there, but the housekeepers cart was right next door.. I figured it was payback for complaining. Our room never was cleaned, my children were unable to take naps, no apology was ever given.  \n\nI have to add that they did refund $27 of my $150 bill, apparently this is the appropriate refund when your room does not get serviced, you do not have any amenities, you have continuous arguments with their employees and management, and they do not let your kids nap.\n\nWE ARE DONE WITH CHOICE HOTELS, AND WILL NEVER STAY OR RECOMMEND CHOICE HOTELS AGAIN!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"M-BckkybMCHYjx_aedf98w","user_id":"pplya_6D9ElaNXhoFvpZFg","business_id":"MAuSh7NKoT__CQ4BumoayA","stars":4,"date":"2014-06-18","text":"My boyfriend and I ended up here because I mistakenly thought it was part of the $20 food & beverage coupon that you get for the Luxor\/Excalibur when you stay at one of those casinos.  That's what I get for not reading the voucher all the way through!  All the same, I'm very glad I made that mistake because otherwise I would have never thought to go to Tacos 'n' Tequila for breakfast.\n\nWe were there during the Sunday Mariachi Brunch.  I ordered the chilaquiles and my boyfriend had the albondigas.  Both dishes were wonderfully flavored and the portion sizes were more than sufficient; however the real star of our breakfast were our micheladas.  Hands down the best micheladas we've ever had.  A perfect blend of spicy and hearty.  Gave us just the pep we needed to start our day in Vegas!\n\nThe service was great.  Our waiter was very attentive and friendly and we were even serenaded by the Mariachi Band.  They were taking table-side requests and my boyfriend asked for \"Guadalajara\" because that was the song his dad used to sing all the time when he was growing up.  They did a great job and made it all a lot of fun.\n\nI would have given this place 5-stars except for two small things.  1) You have to pay extra if you want eggs in your chilaquiles.  I know chilaquiles can vary from place to place, but it's been my experience that eggs are the main staple of the dish so it seemed odd they weren't included.  However the dish did include chicken, so it was still very filling, but I did miss the eggs.  2) No menudo.  I really wished they had it available.  The albondigas was tasty, but to me when you're looking for a really good hangover breakfast, you just can't beat menudo.","useful":1,"funny":0,"cool":1},
{"review_id":"zZEMVU81SUSqiLdqKhesEg","user_id":"pplya_6D9ElaNXhoFvpZFg","business_id":"y7Js-07RF8d3N_AEtaw2VQ","stars":4,"date":"2014-06-18","text":"A stop at the Heart Attack Grill wasn't really part of our Vegas plan, but in a terrible fit of a need for dessert, we decided that a full-butter-fat milkshake would be an excellent idea and this did not disappoint!\n\nI have to admit at first I was like \"Really?  You want me to put on a hospital gown?\" , but it IS Vegas so I played along without complaint and we were promptly seated at the bar.\n\nAs a fan of terrible B-movies, I greatly appreciated the gaudy and awful decor of the place...right down to the ripped off movie posters that had been altered to suit the Heart Attack Grill theme.  It was terrible, cheesy, awful....everything a diner like this should be!\n\nOur Nurse at the bar was awesome.  She was cute, sassy, a little sarcastic, and a whole lot of fun!  They serve three classes of milkshakes: naughty, which are essentially your basic flavors, obscene with selections such as cheesecake and maple bacon, and XXX which contain flavored vodka.  We settled on the maple bacon but wanted to add the XXX element to it, so we requested an add of whipped cream vodka.  Our Nurse said no one has ever asked for that before.  I couldn't believe it!  Maple bacon milkshake with whipped cream vodka seemed like a perfect fit to me!  I think they should add it to the menu!\n\nMy boyfriend and I opted to share the milkshake, and good thing too!  Sure, it was an $11 milkshake, but they DO NOT skimp on the size!  Plus I'm pretty sure there were at least 6 slices of bacon, half a jar of maple syrup, and a double shot of vodka in the thing!  It was a beautiful masterpiece of everything you shouldn't feed to your body!  Fat, sugar, calories, booze....it was simply beautiful!\n\nIf you're truly on vacation and really wanting to do something that is completely \"Vegas\", a visit to the Heart Attack Grill is in order.  Don't expect to have any \"healthy\" options.  I've read reviews on here where people have complained about everything being fried in lard.  Duh.  If you expected anything else, you evidently didn't do your research first.  They do have a Vegan menu, 100% pure tobacco....meaning you can buy a pack of cigarettes.  We saw people getting hooked up to wine \"IVs\" and folks that didn't finish their burgers spanked with a paddle.  Was it the fanciest or highest quality meal we had while in Vegas, absolutely not, but it was the funnest!  Definitely made the list for a return trip on the next Vegas run!  Bypass burger, here I come!","useful":3,"funny":5,"cool":3},
{"review_id":"zDQAp9_BpF3GZ_jJ9bApKQ","user_id":"pplya_6D9ElaNXhoFvpZFg","business_id":"pmoIMK8zGWvKsVOPDBYfzg","stars":5,"date":"2014-06-18","text":"I'm just going to throw it all out there and say this is probably the best meal I have ever had, bar none.\n\nWe ended up here thanks to a $50 food and beverage comp I had.  If it hadn't been for that, I would have never even thought to eat at this place.  This was everything you would expect from a high-end restaurant: beautiful decor, ambiance, superior service.  I was extremely impressed that when the dining room doors were closed, you absolutely cannot hear any of the noise from the casino floor.  Quite the feat considering when were were there the table dancers were performing less than 50 steps away from the entrance to the restaurant.\n\nWe started with the escargot.  It was incredibly fantastic.  I'd had escargot before and it was always my experience that they were a little bit chewy, so that is what I expected.  That was completely not the case here.  They were warm. soft, tender, buttery, and just enough garlic to get a really good flavor but it didn't punch you in the mouth or send you running for the mouthwash.\n\nFor our entrees my boyfriend had the sauteed green-peppercorn filet of beef and I had the pan seared duck breast and duck sausage.  On my first bite I just melted.  Gave out and audible \"mmmmmm\" complete with an eyeroll....and again with the second bite....and again with the third....then I cut into the sausage and I nearly fell out of the booth.  Every bite was pure heaven.  I think my boyfriend was pretty sure he was going to have to take my upstairs for a smoke afterward!  I have never had duck so perfectly cooked.  Tender, juicy, and so full of flavor.\n\nMy boyfriend was enjoying the same out of his steak.  He sacrilegiously ordered the steak \"medium\", which in my opinion instantly kills the flavor of the meat.  However it was so wonderfully seasoned that there was zero compromise in the flavor and so perfectly cooked that I'm pretty sure it could have been cut with a spork!\n\nFor dessert we decided on the pistachio souffle with white chocolate sauce.  Completely fluffy, moist, sweet goodness in a bowl.  It stood beautifully and there was a wonderful crisp crunch to the outside, and oh-so-soft, warm, and melted inside.  The last bite where the white chocolate sauce had fused with and melted into the remains of the souffle was complete perfection.\n\nNormally I would scoff at dropping this much coin on a single meal, but this place is now going to be built into the Vegas budget.  I'm a year away from going again and already I'm craving this food.  We've already decided on the rack of lamb and Dover sole for the next round!","useful":5,"funny":1,"cool":2},
{"review_id":"iqmQyxfDIeQq22tTpBXIow","user_id":"rfTVsV7CCYqLiApeLaU3zw","business_id":"QXV3L_QFGj8r6nWX2kS2hA","stars":1,"date":"2017-01-28","text":"Second time here and still horrible service.  Food is good.  There is a lot of it but don't go if you are in a hurry.  The hostess came back three times before she seated us.  Then we waited 10 minutes before we decided to leave.","useful":0,"funny":0,"cool":0},
{"review_id":"nguTJkj5G7sFaI3pmXp04w","user_id":"rfTVsV7CCYqLiApeLaU3zw","business_id":"NMofTz1rtReWO34fLCAzyw","stars":5,"date":"2017-02-01","text":"I have to say that this was the nicest dealership that I have been to in a long time.  There were no salesmen lurking around outside to hassle you as you got out of your car.  We went inside and was greeted by LJ Harness.  What a pleasure he was.  Asked what we were looking for or what he could help us with. Then took us right out to the SRX that we had looked at online.  Explained all of the feathers that it had on it then took us for a test ride.  There was no pressure to buy or not to buy.  Gave me a great deal on my trade in.  They are even taking care of a small cut in the leather.  If you are looking for a new or used car,  go see LJ.  Great guy to work with.","useful":0,"funny":0,"cool":0},
{"review_id":"OYH0pmm6ulIZH-HXL0dpwA","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"TFdLM8R_7Pf1xVeBNKl0hg","stars":4,"date":"2017-08-06","text":"Went there to celebrate my birthday. The food was outstanding and the service was paced to my liking. I'm a sucker for soft shell crabs and theirs require a return visit. My wife had the gnocchi and they were some of the best. Their draft beer selection was good but could of catered to some of the local microbrews in the Pittsburgh region.  Other than that and overall great day.","useful":0,"funny":0,"cool":0},
{"review_id":"cKgX4hIcLzkAOlFuviUunA","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"rrysQBMgpCqhDZuM34vvwg","stars":4,"date":"2016-02-02","text":"We went for lunch and got there about 11:30.  No one was there except the owner Dan. Since we were early he was able to tell us about his business and his passion for making great pizza and other pasta dishes. He kept us mesmerized with his story of starting his pizza shop and his passion of making award winning food. Great food and an enjoyable owner. I live in West Newton so it takes awhile to get to Castle Shannon.  I will be back this time on Sunday when his mom makes her  gnocchi. Dan said to me when we're out we're out. So get there early. To bad he is not in Westmoreland county. Love Franco's.","useful":1,"funny":0,"cool":0},
{"review_id":"O4BEdv5dZeqOUZ1hAJmogQ","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"PMMp2rBcs58y5kLP96HUaw","stars":5,"date":"2015-12-15","text":"We had gone to the Frick Mansion for a tour and I told my friends we were stopping off for a lunch in Rankin. There wasn't much enthusiasm about the location but the reluctantly agreed.  We stopped in front and my wife said we aren't going in there are we? Well once the order the food and enjoyed the best Reuben,  fish sandwich and stuffed peppers they were sold. The owner came over and thanked us for stopping. She is a real asset to the place. The restrooms were spotless, which important to my wife. I have taken places where she had to hover  over the commode. I went back two days later for the hulushki. A real gem a perfect place to eat real comfort food. Don't forget the liver and onions.","useful":0,"funny":0,"cool":0},
{"review_id":"9RkHetQN9nTkVQQqIPd4-Q","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"c5CWmwh0-WFIjn8_V2DECQ","stars":4,"date":"2017-02-20","text":"I have gone to many craft brewers in Pittsburgh and in various states. What sets these guys apart is their food and beer prices. My wife goes with me but is not a fan of beer. However Mindful has great variety of food and some of their drafts are 5 bucks. Weekends are busy but don't let that discourse you. Go enjoy","useful":0,"funny":0,"cool":1},
{"review_id":"DVzIYYtTHId94xNM0WhK9A","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"ofXtrtsaKzPpVXFa8fHgiw","stars":4,"date":"2017-10-29","text":"Forget about dessert. Not that they aren't tasty it's just that you will not have room. I had the egg plant parm. Great taste and the side spaghetti was a full meal on its own. My wife had the chicken picatta she couldn't finish it. Again too big for us. They also have a nice draft brew selection. Will return and bring a few of my friends. MY meal for tomorrow will be tasty leftovers. Wish it was a bit closer.","useful":0,"funny":0,"cool":0},
{"review_id":"rjjploQzf9Epa8l0DVjVfA","user_id":"L41707T1v3-W_HvF1XEvIw","business_id":"Cu1n3m5WHwiRJBevKvhoew","stars":5,"date":"2016-09-21","text":"Let me start with\" I love this place\".When it's corn season you can't find better tasting corn. The sour cherry pie is the best ever. The other fruit pies are also outstanding.  Carolyn made me rhubarb pie when I couldn't find one anywhere.My granddaughter loves to go down with us each summer and feed the goats and get corn. She tells me \"they don't know how to grow corn in Memphis \" .Go and enjoy and take the kids.","useful":0,"funny":0,"cool":0},
{"review_id":"TfeGHzNr1PkCuDxVtA1lxg","user_id":"gij2q3IBX1QCFIqOhxGtFA","business_id":"KhntVC2lcwaS17qKxt3uHg","stars":5,"date":"2015-07-29","text":"I just had a root touch up and a few highlights added (by Courtney) - and I'm super happy! She totally took the copper\/brassiness out and blended the highlights really well. Everyone in the salon was really friendly too. And I was surprised at how reasonably priced it was :)","useful":0,"funny":0,"cool":0},
{"review_id":"W2C8KiCv-1KaooZPQDYu6Q","user_id":"cHbzoQcAaI7ZzwPJMMkA_Q","business_id":"O6obMXRKCnLMygvm2fSp0w","stars":5,"date":"2015-08-22","text":"The service at Baseline Sports Bar was exceptional. Amazing bartender! Great enviromment. I'm new to Tempe and it was a nice welcome to the area.","useful":0,"funny":0,"cool":0},
{"review_id":"WjgQTvHKRLp4xX6owiJ3ww","user_id":"jbEEK3IK8aC33Pv5rTMG1w","business_id":"_7Wp4hqOTEIk7BIpR33RDg","stars":3,"date":"2016-09-12","text":"I bought the 2016 Jetta, during signing the finance papers the finance guy told me that VW has changed their limited warranty, which is totally incorrect according to VW corporate office. Secondly he sold me the extended warranty by telling this warranty is from VW itself, but this extended warranty is not from VW but from a third party, lie after lie during signing the finance papers, extremely unhappy and dissatisfied.\n\nUPDATE: Contacted the dealership, they promised to issue the refund for the extended warranty which may take roughly 3-4 weeks, will update the review again once will receive the refund.\n\nUPDATE 2: Spoke to the General Manager Mark Mauer at the dealership, he made the big difference in customer service and excellent response, received the refund, Thank you!","useful":1,"funny":0,"cool":0},
{"review_id":"3wbTrPp5Z-heQPt0F4jECw","user_id":"jbEEK3IK8aC33Pv5rTMG1w","business_id":"nVzFz-DFp04_nlxR6VsF3A","stars":5,"date":"2016-03-04","text":"Installed Surveillance Cameras\n\nIt is very easy to work with them, techs did an outstanding job. They are very quick to respond for any customer concerns or queries. This company makes sure the job is done correctly, very satisfied with the work.","useful":0,"funny":0,"cool":0},
{"review_id":"aC3dN1rUcUjC5HXW7GtmbQ","user_id":"fMsdcEjMgI2BspxgfCK3gg","business_id":"26Kt6gQRF7S6m7crwR0tjw","stars":5,"date":"2016-07-23","text":"Excellent staff, very friendly.  Great food, had the dinner for 2 which came with soup, salad, rice, 2 spring rolls, steak, chicken, and shrimp. Everything only cost $20 and it ended up feeding 3 of us. Definitely will visit again.","useful":2,"funny":0,"cool":0},
{"review_id":"ZNjD2ZLZNI-QwsETkFItvQ","user_id":"EfFneID-Lo-5xRQDLayl8A","business_id":"eEnNw3_hBvxcFHyr23kAuA","stars":2,"date":"2014-08-21","text":"The good: great food, great people, great hardscape and pools and all. \nThe bad: we stayed in the HRH tower 1. An upgrade to a suite, 15th floor. When we entered our suite the first thing that came to mind was the term 'road hard put away wet'. Yes, the room is dated. Everything very dirty looking. Like putting lipstick on a pig. It's still a pig. On the last day as we were searching for everything possibly misplaced, my wife found a used condom under the dresser (Lol!).  Married, not ours. As far as the stains on the couches, I will let you figure that one out. Had to place towels on the couches to sit! Our saving grace was family staying at the Mandalay Bay. We spent most of our time there.","useful":6,"funny":4,"cool":0},
{"review_id":"cxfHOQfH8S6MiJWJXoMjSA","user_id":"j3HWFkN7AQUatCmVJkJxIg","business_id":"nhIWy8eXayUvDzAz3Ef-Og","stars":3,"date":"2007-01-29","text":"Casino Royale will always have a dear place in my heart.\n\nIt was where they accepted my terrible, terrible fake id when I was 19 and let me play black jack to my heart's content.\n\nIt was where I learned to play craps at the *only* sit-down craps table in all of Las Vegas (so they say).  \n\nIt was the first place I stayed inside a casino all night to stumble into the light of a new Las Vegas morning, accidentally leaving all of my chips on the table and trying to find a cab back to my hotel with two other girls who did the same.\n\nIt continues to be where I will inevitably and unapologetically end up on any given Las Vegas trip for at least a hand or two, dragging whoever is with me in there who no doubt wonders why we are going into this sad little dump (unless they are part of the original crew who also went there with their crappy fake IDs, in which case they too will proclaim the greatness of Casino Royale as we stroll down the Strip).","useful":0,"funny":2,"cool":1},
{"review_id":"3HmN1cHfZPC9lG8iZHgrHg","user_id":"sutCScsLGvUcraBM5dFBug","business_id":"9IIhExGT0f6x26hTjyBbrw","stars":5,"date":"2016-11-05","text":"I really love this place!! Great food, very clean, super friendly staff. I definitely recommend for all. My favorite is their pad Thai! The only recommendation I would suggest is having more options when it comes to drinks, of course when dining in. Over all I love it and I am glad to have another vegetarian\/vegan place to have here.","useful":0,"funny":0,"cool":0},
{"review_id":"qbI_SH7nHasTyaMQV-RElg","user_id":"sutCScsLGvUcraBM5dFBug","business_id":"m3-75UjhDHqoJpmb59NvPg","stars":1,"date":"2015-09-17","text":"Tried to do business but the owner absolutely doesn't value his customers. Poor communication, extremely unprofessional, disrespectful and rude. You're supposed to pay for the convenience of not having to bring in your own gear, and expect that the equipment that YOU ARE PAYING FOR them to provide to you to work properly and then when it doesn't, the owner assumes it's your own fault. Also you're paying $20 on average for an hourly spot to practice, but apparently they want you to be done fifteen or ten till which is bull shit. I have never in my life have experienced poor customer service than the service I got here. I do not recommend anyone to come here, if you're going to do business be sure to take your hard earn money somewhere else where they actually will value you as a customer. If I could put negative zero times a million I would. Such a terrible place!!!","useful":0,"funny":0,"cool":0},
{"review_id":"IptjnzkUctENUZVt99oLWA","user_id":"FW1v4oXaF2asX_0nJ5hShg","business_id":"RhEvP5flF6KoPriMHmVYGg","stars":1,"date":"2013-07-01","text":"Terrible service. Good rooms and convenient but continually screw up guaranteed reservations, even when you verify them earlier in the same day.\n\nManagement ignores complaints.\n\nOn a previous trip, my wife had a broken arm in a bright red cast, she had to unload her own bags because there were no bellhops in the valet parking even though she was the only guest parked in valet. There were a number of valets hanging around, but no assistance other than taking the car.\n\nAfter finally talking to management, they want us to pay for upgrade to a suite be ause they messed up our reservations on e again.","useful":0,"funny":1,"cool":0},
{"review_id":"47XjUchbUamjh-omqIzAXg","user_id":"FW1v4oXaF2asX_0nJ5hShg","business_id":"pKk7jCFIm96qDdk0laVT2w","stars":5,"date":"2017-08-29","text":"Very good steak house. They offered three kinds of flavored french fries with matching sauces while waiting. Wife had Filet Mignon and I had the Duck. Both cooked to perfection and flavorful. The broccolini was spicier than we cared for but cooked correctly. Fingerling potatoes were well prepared. My wife enjoyed the bar service and thought it was some of the best she had ever had. Great service from the staff, restaurant was busy but not disorganized, ran very efficiently. I would recommend anytime.","useful":0,"funny":0,"cool":0},
{"review_id":"D2y2d0d5ZPeLTjD4nTwPug","user_id":"FW1v4oXaF2asX_0nJ5hShg","business_id":"epETdeCmoF_-ufT5b8ACUA","stars":5,"date":"2017-08-29","text":"I am not a breakfast person but enjoyed this restaurant. Diner style experience. Very busy but well staffed and efficiently run. We were asked three times within a matter of a minute if someone had taken our drink order. Staff was knowledgeable and the owner was walking by when I placed my order and pointed out that they their potatoes are more like cottage fries than traditional hash browns when I ordered the hash browns. Friendly staff with great, fast service. A huge variety of omelets and other breakfast fare. I am interested in returning and trying lunch. My 11 year old wanted to go back the next day for breakfast once again.","useful":0,"funny":0,"cool":0},
{"review_id":"1COycFJUMTLR7vcR_GcHJQ","user_id":"FW1v4oXaF2asX_0nJ5hShg","business_id":"UNHvM2pc7AQBL22BhakNlA","stars":5,"date":"2017-09-18","text":"A New Mexican restaurant, only open 30 days at the time of our dinner. We were driving by looking for a new restaurant to try and saw the banners. We went on. Sunday night of a non-holiday weekend. Not many people in the restaurant and we were offered our choice of seating. Place was clean and neat. The family ordered chicken nachos, chicken fajitas and carnitas burrito covered with red sauce. Corn chips with salsa and spicy refried beans for dipping, while we waited for our food. The food was delivered quickly and served hot. All ingredient appeared to be of high quality and freshness. The kids devoured the nachos and declared them the best they have had. The chicken fajitas came with refried beans and rice. The chicken was plentiful with a good mix of peppers and onions. The carnitas burrito was large and had great flavor. A great experience and we look forward to returning. Great food at very reasonable prices.","useful":1,"funny":0,"cool":2},
{"review_id":"WUCxE7kWfwQ42Z0V4ozCRw","user_id":"FW1v4oXaF2asX_0nJ5hShg","business_id":"0bF6jv97Z6VbruRpepUOcw","stars":5,"date":"2017-12-16","text":"First visit to Cholla. My wife and I were looking for a steakhouse in Scottsdale. We were impressed by the reviews. This is a very small restaurant, seating for only about 50 people, including the bar. Full menu is served in the bar. We didn't have a reservation but lucked into seats at the bar. Brent, the bartender, was extremely kind and helpful. The wife had the Elk and upgraded her sides to the creamed corn casserole, I had the lamb. Both are farm bred in New Zealand and both were delicious. My sides were the brocolini and garlic mashed potatoes. Appetizer was the calamari, very good with a slightly sweet taste to the breading. Dessert was an apple galleta. We would gladly recommend the restaurant and very much recommend Brent as server and bartender. Dinner was very inexpensive, under $100 with drinks included. Definitely will return when we get the chance.","useful":0,"funny":0,"cool":0},
{"review_id":"rOJmFLr8y0RfWkyZaIONgA","user_id":"4PhkRr7vSSEA7zD-BvxOWQ","business_id":"XpWFDkRm3Hk99DbC21c3HQ","stars":1,"date":"2012-12-03","text":"Arrived at midnight, opted not to take the city bus. Nellis Cab #781 picked me up at the cab stand. Arrived Harrah's. Meter read $14.00.  Broken credit card reader hanging off the front seat - female driver told me to slide my card. The screen (which I was holding in my hand because it was broken), flashed something about a \"SURCHARGE\" of $7.00 - as I was swiping my card.  I knew then that I had been taken for a fool. But WAIT. It gets worse. The receipt, which the driver had to reach under her seat to retrieve, included this note:  CARD WILL BE CHARGED TAXIPASS PLUS $3.00 VOUCHER FEE\"\n\nTotal for the 4 mile ride to Harrahs: $21.00\n\nAVOID THIS COMPANY, AVOID using a credit card, pay ONLY THE METER RATE, or better yet take the EXCELLENT CITY BUS from lower level baggage claim area!","useful":0,"funny":0,"cool":0},
{"review_id":"dXbyhLiGQ15u-jfcGp2YbQ","user_id":"l3eE374nzT7ye__8HpEE6w","business_id":"EV3B_P-mwWlMxEUCMUDWdg","stars":2,"date":"2016-07-20","text":"Staff (both sandwich making and cashier) are poorly trained and provide a subpar customer experience. Had to repeat my order 3 times and I did not want cheese but still had to stop her after she put the first slice of cheese on my sandwich.","useful":0,"funny":0,"cool":0},
{"review_id":"A1LbQAVp_CbbwilFModbdA","user_id":"l3eE374nzT7ye__8HpEE6w","business_id":"Xtkm095And0gdPQjUGB5iA","stars":1,"date":"2014-03-09","text":"Had eaten here many time before and food was good, returned tonight for dinner we ordered bife a casa medium rate, plate came with a mountain of fries, when we finally found the steak it was small and so overdone could not chew it. I've had better steak in a sandwich from coffee trucks. Service was terrible and food even worse. This place has turned into a dive.","useful":1,"funny":0,"cool":0},
{"review_id":"HGfBWHZmkQ4JKruFxNWz8g","user_id":"l3eE374nzT7ye__8HpEE6w","business_id":"2UdoeXzcFg87O1VMCc3WGQ","stars":2,"date":"2016-02-14","text":"Food and value are good. On a cold busy day make sure you get a table towards the back because the doors are automatic and people stand by them while waiting to be seated and the cold runs right into the dinning area. Had to eat with my coat on it was so cold.","useful":0,"funny":0,"cool":0},
{"review_id":"V0j-MiofL3CTzoU4byW_3Q","user_id":"l3eE374nzT7ye__8HpEE6w","business_id":"hlrZHM4D48XiQtXh6cRg_w","stars":1,"date":"2016-09-05","text":"Our party of 5 had dinner here tonight. The food was average, one of the dishes we ordered penne arribiata w\/ sausage had so much chili peppers in the sauce that it was  inedible , had to return it and get a new one. Difference in sauce color was night and day. First one looked like the whole jar of chili pepper flakes was dumped in. Had to ask our sever Bernard 3 times to bring our bread. 3rd time we asked he said that they were in oven and not ready. Which is not true as 2 tables around us (who arrived much later then us) received their bread before their salad, but we finally received ours when we were almost done with our entrees. Bernard came walking by quickly and literally dropped off the bread and mumbled \"your bread ...(couldn't understand the rest)\" as he kept walking towards another table. It had been 10 yrs since we had eaten here, don't think we'll ever be back.","useful":1,"funny":1,"cool":0},
{"review_id":"RHJ45Bzh2vdjN13jXO59Rw","user_id":"l3eE374nzT7ye__8HpEE6w","business_id":"527O5H26A0lFtCHO6zEh8w","stars":1,"date":"2013-05-26","text":"Over-priced frozen food. My husband ask for special of the day - Shrimp Ragu with no vegetables, when the waitress brought it to the table she said \"the cook tried to take as much of the vegetables out as possible\". That was a sign right there! There were 2 huge slices of carrots and one large piece of brocoli mixed in the pasta. My \"Salmon\" also a special of the day was obviously pre-packaged frozen salmon, veggies on the side (carrots and brocoli) were very familiar - same cut as the ones we found in the pasta and also frozen. The owner sat at a table nearby with customers and started drinking wine with them. When the bill came it was a a generic hand written check bill with no indication of the restaurant name or tax number. When we asked to get a proper receipt, the waitress ran downstairs and came back with the same bill with a generic stamp of name\/address, still no tax number. You know how that bookeeping is done !!!","useful":1,"funny":0,"cool":0},
{"review_id":"ONaiTyUj2ZjmxaHMOjKYgA","user_id":"qRMjwO5t_SKZ4zF9XHtpRQ","business_id":"U_51F_edGeW9Xxg5pD_7Gw","stars":5,"date":"2013-10-25","text":"I spent 2 years looking for a barber who could give me the cut I wanted and my hair kept getting so jacked up that I was about to cut it myself! A quick explanation of what I wanted, and Darryl was like \"No problem, I got you covered.\"\n\nHis immediate confidence had me a bit skeptical, but dude NAILED IT. My head has not felt or looked this good in two years,  and Darryl is super cool and laid back. I have a new barber now and I ain't going anywhere else!","useful":0,"funny":0,"cool":0},
{"review_id":"Je8bKVMnRwkcvCAxKq_ARA","user_id":"B7cOeH4UypsRPSX8rtsiaA","business_id":"TL5Dtfnf-5hYG13lBF9N2A","stars":1,"date":"2016-09-19","text":"If I could give less than a 1 star I would. Although the food was fine. The Benihana at westgate ruined my weekend Vegas vacation by charging me a different amount than I signed for on my receipt by more than double. And when I tried to get it fixed they acted like they had no power as a manager to fix it, referred me to the hotel manager who had nothing to do with Benihanas and they kept me in a phone circle for a whole day and I have yet to be refunded the difference or offered a solution.. I will not only not recommend this place to anyone but I would say to just stay away in general. Never bringing them my money again... If I could press charges I would. Do not go here.","useful":2,"funny":0,"cool":0},
{"review_id":"_9I5m2sdaPVGawK8rQ_2hg","user_id":"f4Ely0cVPA45HxgkylSvvA","business_id":"WdXGdEGuIKtC6XGRFcT2pA","stars":1,"date":"2017-03-03","text":"visited the store purchased gifts and was sold products that they just added to my bill.  When attempting to return they advised only a 14 day policy.\n\nUnacceptable....I advise everyone to avoid this location as they will not honor or provide any real resolution for product sold.  Therefore you will need to file a dispute with your credit card company.","useful":0,"funny":0,"cool":0},
{"review_id":"cW5SVfjq8VpUUAu51FHVSQ","user_id":"f4Ely0cVPA45HxgkylSvvA","business_id":"F1PMcEIg-FHZvwhiUoFEgw","stars":3,"date":"2015-03-02","text":"Remember when it is near coal re-stoke time make sure the server does not fail to get your pizza order despite ordering on time.   This just happened yesterday.  No pizza but had a nice salad.","useful":0,"funny":0,"cool":0},
{"review_id":"_o-YhX6HW3Hc2iJlRkyMBA","user_id":"sGuGXhKGb0YuNNvJq8NJLQ","business_id":"YKPyXaEZwDJOzB5-7gbCkA","stars":4,"date":"2016-02-21","text":"We held my daughter's 5th birthday party here. \n\nPros: \n* Everything was taken care of! \n\n* Pricing for additions was VERY reasonable!\n\n* The staff was understanding and worked seemlessly with everyone. \n\n* The princess was definitely a professional party hostess, she guided the kids with great conversation and even wrote down the list of gifts each person got for my daughter!\n\n* We never had to worry about a single detail during the party!\n\n* Adults were given the opportunity to be either included or not, which from what I gathered they really enjoyed (I was with the kids the entire time).\n\n* We pretty much had the entire place to ourselves, which was really nice.\n\n* The cake and cupcakes were awesome!\n\nCons:\n* I would have preferred to get everything in writing and sign a formal, itemized contract.","useful":0,"funny":0,"cool":0},
{"review_id":"rlrVphUTyync1G6VgIkYMw","user_id":"sGuGXhKGb0YuNNvJq8NJLQ","business_id":"E7Y2XFkTdKCXZyOSuv1lHQ","stars":5,"date":"2016-01-01","text":"The facilities are always clean and very pretty. The staff is incredibly nice and accommodating. I considering getting my hair cut a treat and when I come here it is definitely a treat. I am always given kindness and respect by all of the staff. \n\nI love working with Molly. Molly is awesome at knowing when to listen and knowing when to give suggestions. I have trusted Molly with my hair, which is incredibly thick, for years because I know that going to her means I will walk out feeling beautiful. I look forward to continue to do business with MC Hair Consultants.","useful":1,"funny":0,"cool":1},
{"review_id":"EbDqHWbR3mhtdhag8u8BYg","user_id":"sGuGXhKGb0YuNNvJq8NJLQ","business_id":"6M8SwiqN_7SJml3ilv-0dg","stars":1,"date":"2014-09-15","text":"I was pleased with the work he did, but not the customer service. Also, I felt taken advantage of. He told me that my rotors needed to be replaced, but he didn't tell me why. I later found out that he potentially took advantage of my lack of automotive knowledge because my car is fairly new. It took him five hours to replace two brake pads and two rotors, which I thought was awhile. When I gave him my yelp voucher he scolded me multiple times for not telling him in advance. I felt insulted when I left. I doubt I'll ever be dealing with him again, even in an emergency situation. This guy seemed completely arrogant and entitled. I won't be going back to him.","useful":4,"funny":0,"cool":0},
{"review_id":"c7q7oyy1B3vLQXX-Yam-wQ","user_id":"lvwaGBR7AfZ-hKdlF4lbMw","business_id":"4oqfMG5x6RzLwQlvRR_1lw","stars":1,"date":"2014-02-05","text":"They get no stars from me but it won't let me post without at least one. Twice in one year they raised my rent. I moved my stuff out 10 days prior to the next month but they still billed me because their office staff is rude and  incompetent. When I went to ask for a refund the lady gave me even more attitude. She set it up to refund the wrong amount and when I tried to correct her she rolled her eyes wrote it on the paper and said \"it'll get fixed.\" I still got refunded the wrong amount and when I called about it she got even more of an attitude and said \"Well if you want to come get this little bit of money then you can come here and I'll give it to you cash.\" I have never been more disrespected by a group of office employees as a whole in my entire life. Do not go here if you do add $50 to what they originally tell you and don't expect to ever get good customer service.","useful":3,"funny":0,"cool":0},
{"review_id":"ZZC-KCqqDqRJ5hRprSKgsg","user_id":"lvwaGBR7AfZ-hKdlF4lbMw","business_id":"9U4Tqt5SkZKQ6eeH6IPSxQ","stars":5,"date":"2014-02-17","text":"This place was amazing. Don't get sucked into the \"it's better on the strip\" attitude. Had the Kobe beef and it was a lot cheaper than anywhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"8P_UBMQtbhIP1MY3VsEnaA","user_id":"J3mRNNw5CpKX2bmTpbkaSQ","business_id":"CkncJJ9tKgsGULXTTKmfdw","stars":3,"date":"2015-07-03","text":"Dhaba was probably the only Indian restaurant that was open past 10 pm in the downtown area - so for that we were grateful.  The food was ok but not \"omg! This is so awesome!\".  It was late so I think we got lucky with street parking, but that could be an issue if you came at regular hours.","useful":0,"funny":0,"cool":0},
{"review_id":"F1lKagazXgVrKOqj6XIZYA","user_id":"v8IDJd0m4QOamuvkq7N2gA","business_id":"pFuEZFl8XjRG8YMs2qY3MQ","stars":1,"date":"2016-10-02","text":"not good all the food has no flavour!!. Crispy beef is soggy with no flavour at all, the lettuce and bean sprouts in our vermicelli were all brown and rotten, pad thai is awful not an ounce of flavour and i'm pretty sure they don't know what thai style curries are because that is not what I was served at all. We will not order from here again.","useful":1,"funny":0,"cool":0}]