[{"review_id":"SI-kIuUPNVsgYYPC8GMmgw","user_id":"YZN2Pafddfp93giOiexPNg","business_id":"nepZ1HPAgBqw0TgJWbSgOA","stars":5,"date":"2015-06-30","text":"Sin City Smokers was smokin' hot!  I used the Amazing Master Chef Steve's sinfully phenominal BBQ for a company meeting and received an overwhelming \"5-star\/2-thumbs way up!\" review from the men.  This crew is not easily satisfied, so a resounding \"Well Done\" to Steve, his staff and Sin City Smokers.  You have created customers for life.","useful":2,"funny":0,"cool":1},
{"review_id":"oeRZYMMEi_G41UO795Ueig","user_id":"yRl_qaXNNX7EAhwtjgEobg","business_id":"hHe1mFDxxrtejXHfiysJJg","stars":1,"date":"2015-04-29","text":"Horrible service. Long waits even with many open tables and sketchy wait staff. We put $100 in the check fold and the waiter brought it back to us saying there was only $80 in there. I asked if he could check to see if a bill fell on the floor but he hardly looked. When i spoke to the manager he showed little interest and never called me back. DONT GO!","useful":0,"funny":0,"cool":0},
{"review_id":"B8s0mslQzg9CYeedG3Y5uw","user_id":"uGXrYnAg0u_ClYQtGqwO5w","business_id":"0VFhAXFWYdHlm6vUUsmxXQ","stars":4,"date":"2012-05-17","text":"damn fine! I was cold as hail in this place, and my fingers got nice and grubby, and the guy working was hella helpful, nice, and knowledgeable. cheap records! hipsters stay away! see you next year Resale! Hope you're still there!!","useful":0,"funny":0,"cool":0},
{"review_id":"mVUbfLMymkOY9MdKMQETTQ","user_id":"f4GXxWC8rJRedtaBGSuy3A","business_id":"VyVIneSU7XAWgMBllI6LnQ","stars":4,"date":"2010-09-19","text":"I wanted seafood & my hubby wanted steak. I found this place off my phone & it had good ratings. Let me say. The service was very good. We ordered & we had no long wait! (really fast) The food was GREAT. The atmosphere was cool & the service was on top of it. We will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"mm5EeS23JQ9C0XJ0tN4wXA","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"9miHbCftsT9vMNbRHjjQMw","stars":1,"date":"2015-02-14","text":"Those i***** advertise a free written quote on their website, so I filled out the online form, got a confirmation email with a lot of things that I certainly did not select. After almost 2 hours later instead of the written quote or an email requesting further info I received a call from a technician. On top of that they wanted to charge me $125 for opening the door of my mainstream car during daytime. I'll pass, thanks for nothing.","useful":2,"funny":1,"cool":0},
{"review_id":"eAt7e_n-OeTqkX_hG3DDvw","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"UMqfeCItzQ2glr4d9apGlA","stars":5,"date":"2015-02-26","text":"The Creme Brule latte I had was so yummy, the \"Alien Burrito\" was great as well. Very popular hangout at lunch time, all tables inside were occupied, but they do have some shaded outdoor seating as well. I'll certainly be back at some point. It's right next to Sunset Park which makes it a great destination if you're there anyway.","useful":0,"funny":0,"cool":0},
{"review_id":"g6rusDM7PZNFQDnPNKS-ow","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"uYVafd0rRxOdHzFc-2zw2A","stars":5,"date":"2015-05-05","text":"Had to look for a towing company when my starter broke down. Based on the other yelp reviews I checked their website and found things to be very transparent. They were busy on that Sunday (May-Pac weekend. Eventually Ryan came with a big towing truck shortly after the scheduled time. He knows what he's doing and we had a great conversation. Very reasonable charge for the job. I will use them again when I need my car to get towed again.","useful":0,"funny":0,"cool":0},
{"review_id":"RvmP2Wtt55ha_AbMmg_P9w","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"LUWMn6XeEDdXNsJaWJSoMw","stars":5,"date":"2015-02-28","text":"I needed to have my watch bracelet adjusted. Friendly and quick service, no scratches or anything on my new watch. Reasonable charge of $10 which is pretty standard for this type of service. 2 jewelers were on duty and they seemed to know what they were doing. Would certainly come back.","useful":1,"funny":0,"cool":1},
{"review_id":"gmWc9lFVFDPLMSeoeKKtlQ","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"7_c4d9BrjIjg3uv7Z_MmnQ","stars":5,"date":"2015-05-25","text":"I have contacted Dewain by email with some questions about getting my Stratus tinted and he quickly got back to me.\n\nI made an appointment, drove up to him, showed up a bit earlier and he started to work on my car immediately.\n\nBy watching him I can definitely tell he knows what he's doing.\n\nThe result looks great (5% limo for the back windows, 20% for the doors), he took his time and did a careful job.\n\nHe used quality film and charged me a very competitive price. Will contact him again if I need to get another car tinted.","useful":0,"funny":0,"cool":0},
{"review_id":"r-neJ4CkLpIe_IFBDiXnyg","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"PLQl-y06iPOEaqsy_nx-Eg","stars":4,"date":"2015-03-01","text":"I went on a Saturday around 4pm. Apart from me there was just a family of 3, but given the time and the fact that the intersection Tropicana\/Spencer is maybe not the most popular, I guess it's not too unusual. I received a very warm welcome by the Russian waitress. The place itself is quite large with a stage  area as well as a bar section. It's a bit darkish and quite cozy, but your mileage may vary.\n\nBecause I wasn't really hungry but I wanted to check out the restaurant anyway, I just had the JULIEN (mushrooms in cream sauce and cheese), the SOLYANKA (typical Russian soup with good chunks of sausage) as well as the NAPOLEON cake. \n\nI found all things to be very tasty.\n\nI liked their homemade KVAS as well. A little bit of a warning, even though KVAS is supposed to have like 1% alcohol, after a few refills I did feel something. This is no criticism, just to warn those who are not supposed to drink any alcohol at all.\n\nI'll be back soon to try their main courses.","useful":2,"funny":0,"cool":0},
{"review_id":"t7ybYVmbIJvJWnC-kOnNxA","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"QVK_iueRA5DNUxgu7qpSNw","stars":5,"date":"2015-01-30","text":"Friendly, fast, $2 discount immediately honored, but gave him $20 anyway. Will give them my business again next time. Thanks, keep it up!","useful":0,"funny":0,"cool":0},
{"review_id":"sS2VC9HS3N1e5_R8zLxEwA","user_id":"y5w-8aZQc1nVc82e0vXsaA","business_id":"ArzvTos0EuwOrrtEILUDcQ","stars":5,"date":"2016-05-19","text":"I brought in my Dodge Stratus because I had severe transmission issues. Hamid gave me a quote that sounded very reasonable for the work performed. Picked up my car this morning and I'm very happy with the result. A bit of a new car feeling again. He pointed out some other things that need attention but without being pushy. I'll come back!","useful":1,"funny":2,"cool":1},
{"review_id":"ExR29sZ6ktwkpBnhOxkMKA","user_id":"mNZUtwyCu4q0fsWvwPqceA","business_id":"u4IDWradF0DQSdfiUNpS2Q","stars":5,"date":"2016-08-16","text":"The best shawarma in town!!! Great pizza! Definitely a return customer I came in with friends and family great advice on food and everything we tried was great! Friendly staff and owner catered to our ever need!!","useful":1,"funny":0,"cool":0},
{"review_id":"6U0BqygunHHoZzoS4D5mhA","user_id":"mNZUtwyCu4q0fsWvwPqceA","business_id":"21sGRVR7HEs_t6PdB9tGMw","stars":5,"date":"2013-07-12","text":"I finally found a pizza that ill never get tired of... and the philly was the best in town","useful":2,"funny":2,"cool":0},
{"review_id":"xRDSMtV2RoETyVqvRlj9XQ","user_id":"mNZUtwyCu4q0fsWvwPqceA","business_id":"E5GnSqLpuPTKCChnZmD7ag","stars":5,"date":"2013-07-12","text":"I was a hot mess and dead scared of the IRS. Then I foundout about IQTaxx services and my life changed. After being chased by the IRSfor unfiled returns for two years I received a levy! David and his staff easedmy stress and gave me solutions for my tax problems. I couldn't be happier with the results! I filed four years' worth of back taxes and ended up with arefund!!! I highly recommend their services.","useful":5,"funny":1,"cool":2},
{"review_id":"4bGGpBSii64apRMEpc1kmg","user_id":"rE-XpHAYWQqTAcr__hzWlA","business_id":"vdZOiZH9sTseyll44waMuA","stars":1,"date":"2016-06-24","text":"Worst meal ever. Beans & rice had a sour taste. My husband ordered a plate w\/a tostada, enchilada, & taco. They were sampler size at a price of $9.95. We told the waiter & they reduced our bill 20% but they really didn't care what was wrong. We could have eaten at Taci Bell & had better tasting food for a lot less and regular sized food insread of minis. Even the iced tea was small size. Never going back.","useful":1,"funny":0,"cool":0},
{"review_id":"_GvJooOln7BskV3RHNKo_Q","user_id":"idYoDCzOc9p0NjiAlgsJgw","business_id":"UkWme3kwg6L9rd4tCNB15w","stars":1,"date":"2016-05-29","text":"The food was okay BUT while I was there, one of the waitresses spilt dirty leftover juice from cleaning another table over the seat of my friend's back. The liquid soaked up her dress, bag and jacket. After the incident none of the servers came to apologize and\/or offer any sort of compensation for ruining my friends belongings. At most we were met with complete indifference by the staff and some paper towels to dry her stuff off. Additionally, our dishes were suppose to come with egg but did not. When we asked, they said they had run out but failed to tell us beforehand. \n\nThe service here was extremely disappointing. I normally do not write yelp reviews but wanted to warn people about the service.","useful":1,"funny":0,"cool":0},
{"review_id":"B6Gs_h56zKgo1dU1jYXEqQ","user_id":"idYoDCzOc9p0NjiAlgsJgw","business_id":"pAQwza9U8OLY65Q73pAnxQ","stars":1,"date":"2015-12-20","text":"I don't know what the food tastes like here because after being seated in a seat in front of the door (which was freezing as it is winter), and waiting half an hour for our food, we chased the same waitress about our order twice (she didn't get back to us at the first time). After the second time, we were asked to reorder because apparently our order was never entered. When we confronted the waiter who took our order, he denied ever even taking it. If you like being served by waiting staff that excel in staring at you blankly, this place is perfect for you.\n\nWe left before reordering in both anger and dire hunger.  The service here is quite poor, I am never going again and would not recommend it to anyone.","useful":3,"funny":2,"cool":0},
{"review_id":"Gh_sdkNITxtVIwYm32NCVA","user_id":"YxBojY9-GDeAdQ2w6xE7Sw","business_id":"C9xw2AkDMtWMQ3sIDo98aA","stars":4,"date":"2015-11-03","text":"Attentive and friendly service from beginning to end. Ordered the fresh rolls (vegetarian), basil beef with fried egg, and pad kee mao (aka drunken noodles). The fresh rolls were a mix of veggies and mango served with tamarind and peanut dipping sauces. Not exceptional, but decent. The pad kee mao was quite good - slight hit of spice without being overwhelming, and the noodles weren't overly oily as other reviewers are complaining (maybe that's a pad thai problem?). The basil beef with egg was amazing. Not as spicy as it would have been in Thailand (most Canadians are spice wimps so I don't blame them for toning it down, although you can request spicier or mild) but excellent and authentic flavor. The egg was also a highlight - fried to airy crispiness on the edges but still with a runny yolk to break over the rice.  Portion sizes were just right, the prices were very reasonable (at the low end for Toronto Thai restaurants), and there's a discount for paying with cash. Glad to have another good Thai restaurant in the neighborhood.","useful":0,"funny":0,"cool":0},
{"review_id":"G6dO8BBMxod_N9CTlW6_6Q","user_id":"5HjL8eA9yxOZBrAMRDKM1A","business_id":"WbJ1LRQdOuYYlRLyTkuuxw","stars":1,"date":"2017-09-09","text":"Portions are terrible, and the price reeks of pretentiousness. \n\n4 people with no booze can't get out of there for less than 100 bucks with tip. I've never been so underwhelmed in my life. I've been to the one in Asheville and, for some reason, this one pales in comparison. \n\nI will not be returning.","useful":1,"funny":0,"cool":0},
{"review_id":"WkNx27fXc8qybzjdmdfshA","user_id":"5HjL8eA9yxOZBrAMRDKM1A","business_id":"zpGCFAt_MydbQN4EsXee6w","stars":5,"date":"2017-09-11","text":"Amazing sandwiches and starters. You can tell they're prepared with great care. Value is good, as well. Most sandwiches under 6 dollars after tax. I highly recommend this place.","useful":1,"funny":0,"cool":0},
{"review_id":"X2XIyQZ5hBs6sknqGNEC3A","user_id":"PYTDRdQ6zVF_WXk_RuT_vA","business_id":"W9y-Bl9030-rmfxSTmUD_g","stars":5,"date":"2015-03-15","text":"Great Pho! You will quickly become a regular like myself, and so many reviewers before me. The food is what keeps you coming back, but the great customer service and value are awesome perks.","useful":0,"funny":0,"cool":0},
{"review_id":"wGCL5myEXcj3XQQULBdtrA","user_id":"PYTDRdQ6zVF_WXk_RuT_vA","business_id":"cdPnRYnfKrbeEUAoSJONtw","stars":4,"date":"2014-05-31","text":"Great food, fast service, nice happy hour selection. We love that it's loud enough that we don't have to worry about bringing our toddler.","useful":0,"funny":0,"cool":0},
{"review_id":"Jjuh9vw_7mnSt3xo5uL-QQ","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"nao-DQVFd90DA37rq6HO2g","stars":5,"date":"2016-06-18","text":"My house was flooded at 4 am, ServoPro came almost immediately and vacuumed the water.  M Stellar Home SErvice, Dirk, came within house and replaced my hot water heater that had apparently burst during the night.  I cannot say enough positive about Paul and Dirk from Stellar Home Service, Both worked diligently to get my water back on in the house and replace the hot water heater. Prompt, efficient, professional and friendly.  I would recommend this company anytime to anyone. they are great and their customer service deserves more than 5 stars.","useful":1,"funny":0,"cool":0},
{"review_id":"l2xxAzv1xKM7qvx-L3YkXQ","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"lb26Toy99S0hU8oqTJFlcQ","stars":1,"date":"2016-07-08","text":"I had a package delivered to the wrong house on the wrong street. The Sheriff Deputy was doing a vacant summer house  inspection and noticed the package and that  it was addressed tome on a different street. He said if he had not seen it it would have stayed until September..\ntoday I get 6 pieces of mail addressed to someone else and with a different address than mine. .  What  is going on? What incompetence!","useful":3,"funny":0,"cool":0},
{"review_id":"Vglp7AYM8o6TDiWaDs4TtQ","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"Y6HXGGDMKiPMNPwmK3W_oQ","stars":1,"date":"2017-10-16","text":"If FOX chooses to cave to the NFL by eliminating the Anthem, we can stop watching channel 10 altogether and we can stop buying from their sponsors.  Cowards All of them. Kneelers and FOX .","useful":1,"funny":0,"cool":0},
{"review_id":"AC6FJ7Tv0e7H2zz4RQmrKg","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"AyDj2kOX7RmskT7yXIx-mw","stars":5,"date":"2017-07-29","text":"If I could give Nancy 6 stars, I would.  Her color is always perfect no matter what  mess  my hair is in. I've been  seeing her for over 5 years and love her personality , professional attitude and expertise. She has perfect knowledge about color and  hair cuts. ALWAYS PERFECT.  She has made me look good for quite sometime.","useful":0,"funny":0,"cool":0},
{"review_id":"iAv36xc51Mnv-1Js5cOb4w","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"4x242zFC9YKuos3ZeX01wg","stars":4,"date":"2015-06-09","text":"I hired Floors N More to replace my kitchen floor. After a few 'bumps in the road' my floor is beautiful.  I can only thank Richard Sr. and Richard Jr for their fine professional workmanship. also Scott for his diligent follow up with some minor problems along the way.  I give Kudos to  the 'Richards' who really know what they are doing.  You cannot go wrong with that pair on your job.  lastly, I want to thank Matt for allowing Richard  to redo my floor to perfection.","useful":7,"funny":0,"cool":2},
{"review_id":"ErbzmPjCeyRj7eK1-ehiVg","user_id":"E08Bi5dH90w2bsl7WC01Tw","business_id":"HME5y0qMKFRUbHZykncGNA","stars":1,"date":"2017-08-14","text":"I just renewed my warranty for $725.00. I went to change my filter in my AC and it was dripping wet.  MY Policy states, the AC\/heater unit is covered under the warranty. When i called OneGuard the young man said. \" OH, WE DO NOT COVER  BLOWING OUT CONDENSATION LINES.\"  iF YOU GO THROUGH US, YOU WILL BE CHARGED THE $70.00 ONEGUARD FEE AND PAY PRIVATELY TO THE COMPANY FOR BLOWING OUT YOUR LINES.  I said' Well, that would be stupid of me, I'll just call someone myself'. Which is what I did. Cost of $125.00. My complaint is; I pay over $700 to cover, or thought my AC unit was covered, my home as listed on the list provided by ONEGuard including AC\/heater. NOW, ONEGUARD tells me. OH No we don't cover that.  Have you all seen that warranty commercial about the ZOMBIE APOCALYPSE?  That's OneGuard.  I am sorry I renewed.  I might as well put that $700.00 in the bank and use it toward repairs, I have to pay additional anyway.  ZOMBIE APOCALYPSE?","useful":1,"funny":0,"cool":0},
{"review_id":"x0r66dEdlQbXayaz2HP82Q","user_id":"hMNDVOb28SdXpixI_BnftA","business_id":"ydqbNz2sHENV9XOElwyAYA","stars":5,"date":"2014-08-03","text":"Oh my goodness the food here is fantastic...I had the raspberry pork tenderloin it was to die for if this place was closer to my home I would become a regular great prices, fantastic food,wonderful atmosphere,this place has it all...make some time when you are in Scottsdale you won't regret it.","useful":2,"funny":1,"cool":1},
{"review_id":"3j_CRHvnHsiVuJonYm38Rw","user_id":"hMNDVOb28SdXpixI_BnftA","business_id":"k6pWX0v60LIRS2guzkpxqQ","stars":2,"date":"2014-09-28","text":"Food was somewhat good lots to choose from but a friend of mine had a problem with her food and asked to have something done about it... the manager on duty wasn't will to give any comps or refunds...liked this as a first time but the service for my friend has pretty much destroyed any chance of us coming back or recommending to others...","useful":2,"funny":0,"cool":0},
{"review_id":"OM_aoLO0DjxgOdrhBWb5kg","user_id":"hMNDVOb28SdXpixI_BnftA","business_id":"ztP466jMUMtqLwwHqXbk9w","stars":5,"date":"2014-02-08","text":"This is the best place for a sit down enjoy dinner restaurant...my steak was very flavorful and cooked to perfection my wife's prime rib was perfect as well...they can expect us as regulars here...Eric the manager made sure we had a great experience and he performed above and beyond...well done everyone","useful":0,"funny":1,"cool":0},
{"review_id":"qrzJrDPyfqP7djhb6sxb3A","user_id":"Y5DIwt-653VndVu53ATpLQ","business_id":"0yAJCh0TBZcnZkdZWZ6bVQ","stars":4,"date":"2016-01-18","text":"i've been going for over a year. great service from a nail salon. it's not a spa so dont expect luxury. but for what it is it's great. the girls are friendly. the services are done well.","useful":0,"funny":0,"cool":0},
{"review_id":"wKCCWbvWMpJpU5neCPKA7g","user_id":"Y4PMRvo_dYwP_apSfyRLXw","business_id":"3Wi_F3UNEJ-jUpGkc3GFIQ","stars":1,"date":"2016-07-19","text":"We liked this office at first and Dr. Brandy and her staff were friendly.  But now, I feel like a burden to this office.  They were supposed to schedule an appointment with a specialist and then call me - it never happened.  Trying to figure out insurance, a mess.  Communication on appointments was a mess with no confirmation calls.  I switched dentists and I can't even get a hold of them to get our x-rays transferred to our new dentist.  Not recommended!!","useful":5,"funny":0,"cool":0},
{"review_id":"J82eTw3o0s_1uy_voXal3w","user_id":"Y4PMRvo_dYwP_apSfyRLXw","business_id":"B9To2QK1qbHKGSMDh6IrjA","stars":5,"date":"2016-07-19","text":"Yum! Really great authentic and Mexican food! Tortillas and chips made fresh!  Love it!","useful":0,"funny":0,"cool":0},
{"review_id":"xIUP8_RGoUgqgdOzgf1aAQ","user_id":"Y4PMRvo_dYwP_apSfyRLXw","business_id":"3UScLBD2K1jdCqR-FzIRHA","stars":5,"date":"2017-02-23","text":"My husband and I have been seeing Dr. Haines for 3 years now and couldn't be happier! There is no waiting around, the staff is super friendly, the service is great!  I can trust that the work they say I need done is actually needed. They can get you in quickly when needed. I can't say enough good things about this place!\n\nMy kids have always gone to a pediatric dentist and when we moved here we struck out on several pediatric dentists so I decided to take them to see Dr Haines since my husband and I like the office so much. My kids all love it! The staff are all great about telling the kids what to expect and are friendly and gentle!","useful":1,"funny":0,"cool":0},
{"review_id":"3uU0ZV5m2fIotbyR0URWYw","user_id":"qO_Z0gC2b_tx_c2SqokZ2g","business_id":"vw81ARj4ihGzcmanHw6dUg","stars":4,"date":"2017-05-21","text":"Great place to dance, bouncers and staff always cool - balcony table hustle is a joke though especially when the place is empty...always \"reserved\" and no one shows up....of course they're happy to sell you a table with no view.","useful":2,"funny":0,"cool":0},
{"review_id":"srpwWiEGvNqyi-qBrWeJfQ","user_id":"75c5iU_Vr2zwtLnr85kTBA","business_id":"NlymcSxDnjtCLyGvmMoyFg","stars":5,"date":"2016-03-17","text":"I am from Dallas Texas, visiting my aunt and uncle and had the most enjoyable experience at Aloha Kitchen. You walk in and are immediately greater by an employee with a smile and welcoming hello. The friendliness is matched perfectly with the good portioned and delicious food. I asked a couple questions about the menu and the cashier had wonderful answers and advise. I had the teriyaki chicken and coconut shrimp and would highly recommend trying them.\n\nAwesome experience!","useful":0,"funny":0,"cool":0},
{"review_id":"L8Jc-yHG6hM_Bbwn7aq0pg","user_id":"8AuYn4ytXUYSvegf2r-LEA","business_id":"mDR12Hafvr84ctpsV6YLag","stars":5,"date":"2016-07-01","text":"My family and I are traveling from Wyoming. We had been on the road for about 12 hours and my nephew suggested Mr. Mamas based off online reviews. Before we even got to the door the staff had us smiling! We were greeted outside the restaurant and immediately seated. Our server, Claudia, was very nice and the food was great. We were pretty hangry when we pulled into the parking lot but our meal was out in less than 10 minutes and the restaurant was nearly full! Great food, great service, great price, great experience!","useful":1,"funny":0,"cool":0},
{"review_id":"J1XnfKwQyfJo3Cz16qPI8g","user_id":"BOrXC03ZwOqp_Li_Xey3xg","business_id":"XmvmYyfcTWjK5H0-Q4OG_A","stars":5,"date":"2015-12-15","text":"Uldi has been working with athletes at the high school level for several years now.  His approach is like no other, he focuses on strength, agility, and mental improvements specific to the sport or areas of focus for the athlete.  And to top it off, he has an uncanny ability to push athletes safely out of their comfort zone and build them up while in the stretch zone.  APlus is exactly that in my book!","useful":0,"funny":0,"cool":0},
{"review_id":"STqOJ4gKC9oKRCssX6HUGg","user_id":"e-st5uU5PO344vmJ9U2HTA","business_id":"r7bvNJuZHhexExLOOyQMfg","stars":4,"date":"2015-08-10","text":"I only lived there for 6 months and yes, it had some cons, but I still I liked it there. First the cons..\nMy cons: \n1. My apartment didn't have a balcony, which I would have loved. ..but I knew that when I signed my lease.\n2. After the carpet stains began resurfacing after their pre move in cleaning, it was FILTHY. Def should've been replaced. I couldn't walk barefoot in my own home. And grouping in w the carpet..the cabinets were horribly scratched. .. which only began to show, again, after the pre move in treatment wore off.\n3. This is a big one. ... BUGS. When the weather began to heat up, they made their presence known. I know it's Vegas and bugs happen no matter how nice the area . but I HATE them.  *shudders* \nPros:\n1. They spray often and any time you need them to spray indoors, they're there. As well as maintenance. \n2. The area and the neighbors were nice. Very quiet. \n3. Nice, big pool area\n4. Different layout. Nice, open space. And I love, LOVE all the windows! I think that was my favorite. I love all the natural light. I didn't have to use any lights til it got dark outside. And the location of my apartment added to all of that. Corner unit w mountain views. \n 5. The staff. From the women in the office to the maintenence guys..all nice and friendly. Esp Jill with perky her voice and attitude! \n\nI would live there again. .. in a unit w a balcony :-)","useful":1,"funny":0,"cool":0},
{"review_id":"XbGVX_9XD0-ccE_GV-xfOA","user_id":"6yofnhPLNAjYYR_SEbSjlQ","business_id":"oYMsq2Xvzw6UbrIlMWjb-A","stars":1,"date":"2014-11-20","text":"Good deals, but ridiculous delivery times. Waiting an hour every time I order isn't worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"N2VCMw70zYzKHzjFTmI2sQ","user_id":"spXDY6ddlZoZj2wXZz8Ocw","business_id":"LVfnCtdNMbDWGVcLHmijGA","stars":5,"date":"2015-01-29","text":"They saved me $1,750 on a recent repair compared to a quote from NTB.  NTB wanted to replace components unnecessarily.  Truck drives great now!  They all were very nice.","useful":0,"funny":0,"cool":0},
{"review_id":"lquokJMOLqXz9n5YCVCFHA","user_id":"5PwP3RzV0bAZmS6ZTen8Gw","business_id":"osu1j_Lg8R9brpuMMn3a3A","stars":5,"date":"2015-09-30","text":"I celebrated Brazil's Independence day, and i was very happy to get guarana soda. The meat was excellent, and cooked to perfection. I Like this Location better than the one in San Diego.","useful":0,"funny":0,"cool":0},
{"review_id":"wJj1YRhoxbdmjumjoXETZQ","user_id":"5PwP3RzV0bAZmS6ZTen8Gw","business_id":"rRXo_7JQ6LoiP5H-50FEfw","stars":3,"date":"2015-09-30","text":"I was on the first tour In the morning before it got crowed. I would recommend you get up early and stand in line early. Hoover Dam is beautiful, but the tour was kind of boring.","useful":0,"funny":0,"cool":0},
{"review_id":"Pxo4G6NqVl44ZVrr9APoYw","user_id":"5PwP3RzV0bAZmS6ZTen8Gw","business_id":"yNkOuXH7VdDjYKqV5w33PA","stars":4,"date":"2015-09-30","text":"This store has so many flip flops to choose from it was hard to pick out just one pair. I was a little upset with one of the workers in there trying to get me to buy the smaller size rather than the size that fit my foot.","useful":0,"funny":0,"cool":0},
{"review_id":"-nljd9Ig-nYvwATDcnboNA","user_id":"xasb37UFc6BOaEsyaK4wCA","business_id":"kC1x4pDkj-QU_13J-PA5Dg","stars":5,"date":"2015-06-02","text":"This is my first Yelp review, and I'm usually quite lazy about things like this, but I believe Dr. Perez deserves to be recognized.  As a physician myself, I am very particular about whom I see for health care.  \n\nPrior to moving to Arizona, I was affiliated with University hospitals, and saw only physicians I personally knew to be excellent, often leaders in their fields.  However, after moving to AZ awhile back, I did not have the connections or the knowledge of the local health care professionals to afford me this luxury.\n\nI found Dr. Perez to be the epitome of professionalism both in terms of competence and bedside manner.   \n\nHis office, internet portal, and staff are all top notch, which I consider secondary to competence and bedside manner, but it sure makes things more pleasant.\n\nI arrived 2 hours early for my appointment due to my own mistake, and I was fit in between patients within 15 minutes.  Despite this, my visit with Dr. Perez was thorough, which is difficult these days given the time restraints primary care physicians often face.\n\n\n5 stars all the way.","useful":2,"funny":0,"cool":0},
{"review_id":"vQxlMuLTwWnUUFP1Myx2qQ","user_id":"xasb37UFc6BOaEsyaK4wCA","business_id":"cn_4R61JII7Wzrbz1FdY1A","stars":5,"date":"2017-03-29","text":"Can't recommend this business enough.\n\nMichelle takes pride in her business and it shows.\n\nBob was professional, courteous and most importantly skilled.\n\nWill be using this business for all future needs.  Bob, as long as he's available, is our guy.","useful":0,"funny":0,"cool":0},
{"review_id":"3oWBytrF_NpunQbjIeD9Dg","user_id":"xasb37UFc6BOaEsyaK4wCA","business_id":"oh-HacTAgdXJ9K2oJPbtdg","stars":5,"date":"2017-11-29","text":"Dr. Villarreal is a superb doctor who takes her time to truly examine and diagnose\/treat her patients, which is quite rare in medicine these days.  \n\nNot sure about the other reviews complaining about support staff and wait times, as my son was seen promptly and the whole office was very professional.  Perhaps these were incidents that transpired secondary to the thoroughness of the diagnostic work up; this is something to applaud not criticize IMHO.  \n\nSome cases are straightforward but others are more complex and you cannot always guarantee a quick 10 minute exam will cure what ails you.  Although this can be frustrating, I'd prefer to have a physician take their time rather than churn through a list of patients to maximize profits and reduce wait times so they can get a better yelp review.  It's your health not a cheeseburger.\n\nWhen it's your turn, you can be assured that your issue will be addressed properly.  \n\nWritten by a fellow doc who appreciates the care provided to his son.","useful":0,"funny":0,"cool":0},
{"review_id":"ys-KTWSuhDglNhkLRxDxXQ","user_id":"xasb37UFc6BOaEsyaK4wCA","business_id":"zDuYYol0bddtTX5VrOB5Ww","stars":5,"date":"2017-06-14","text":"Great experience.\nSuper punctual and accommodating.\nFar less than half the price of dealership to replace my car key and cheaper than the other locksmiths I looked up as well.  \n5 stars all the way","useful":0,"funny":0,"cool":0},
{"review_id":"76YxKCwWB8Cs9s9UZ0AIaQ","user_id":"xasb37UFc6BOaEsyaK4wCA","business_id":"pQ86bqFOqprt0zKFe0VC_Q","stars":5,"date":"2017-06-15","text":"Steve and his crew did a great job on my Lexus.\nGood, honest folks.  Will return if I ever need more work done.","useful":0,"funny":0,"cool":0},
{"review_id":"G85SjTe1Zi9OrV-lX1x6YQ","user_id":"xnbdQwLPs06zPyptpZdQaA","business_id":"7S_L-3ggy4YpFr50Q08fcQ","stars":1,"date":"2016-11-26","text":"I went to the shop and previously had given them a 5 star from an issue I was having over the summer. I just moved from MN and my car was overheating. I took my car to the shop and explained the situation. They are very nice but that does not mean that the advice they gave me was right. They played the guessing game with the car looking at the water pump, temp sensor, thermostat, which were all options. They had told me that they had ruled out a blown head gasket, which I was pretty sure was not the issue as I was not leaking coolant anywhere and never needed to fill up.\n\nAfter being there almost a week they had asked me if they could take it to another shop, but would have to charge me because they were being charged. I agreed and the diagnostic came back as a blown head gasket. I found this odd and they texted me a picture of the diagnostic, which showed that they actually were not charged for the service. They had quoted me that it would be $3,100 to get it fixed, which also seemed really high. I paid the $90 diagnostic and picked my car up 7 days after delivering it.\n\nI was going through a bit of a cash flow problem and limited my driving and washed the temperature. I noticed as the temperature started to cool recently, the car would have to be under extreme stop and go traffic or if I had my a\/c on low the temp would rise to the 3\/4 mark.\n\nYesterday I took my car to another guy. He quickly determined a few issues that were causing my problem. He stated the radiator was not operating properly and the radiator fans were working intermittently, as well as they were weak when actually operating. He did this from his house. New radiator, new radiator fan motor, transmission flush, and labor it cost me $550. I put my car through a test today driving around for an hour in stop and go traffic and blasting the a\/c...... the problem has been fixed. \n\nSO the company that did the diagnostic? I thought this was a GM dealership as he had stated, I checked with the 2 dealerships within a few miles of their shop, my car was not taken to either one of them. They also stated that a blown head gasket at their shop would only run about $2,200. That was at a dealership and was $900 cheaper than this place. Plus they did not take it to either dealership, so I am not sure where they took it for the $90 they charged me and of course was a wrong diagnostic.\n\nThe trust factor with this place is now gone. I felt I should update my findings as I previously appreciated their due diligence, but now feel a bit ripped off. Thank goodness it only cost me $90 to learn my lesson.\n\nThat was just my experience","useful":2,"funny":0,"cool":0},
{"review_id":"YdD6Hj8aLZ5HOoHygbPtIw","user_id":"xnbdQwLPs06zPyptpZdQaA","business_id":"y6QP5IrOJ7_FsB51jN2_Jg","stars":5,"date":"2016-12-05","text":"I work at the property, so to be fair and transparent. The food is great, my daughter and I go there twice a month (like I said, I work at the property and I eat there with clients more often). This place is not owned or operated by GVR, so there is no reason to boast if they failed. The staff is always great. They are polite and helpful and always treat my daughter well.","useful":0,"funny":0,"cool":0},
{"review_id":"nLQoqZD52xkN1fSKDxUT1g","user_id":"1NfPzFCmYJeu3grB7woaFg","business_id":"dGFrCnwIUEdi-zxkwDoezQ","stars":1,"date":"2015-10-05","text":"Worst experience ever. I ordered online for delivery. The tracker went through all the phases and stated food was out for delivery, then changed to delivered yet no delivery made. I never received my order. I then attempted to call the store for information, they never answered the phone, I attempted to contact them for 30 mins. with no resolution.","useful":0,"funny":0,"cool":0},
{"review_id":"A47kJ-qByUd49aLSA21vXA","user_id":"1NfPzFCmYJeu3grB7woaFg","business_id":"qo4dzAKiwdN44wjexJWH4g","stars":1,"date":"2017-01-24","text":"Ordered food for delivery and all 3 meals were missing items. Both pitas were missing sides and dressing for salad was incorrect. When I called to get corrected they offered to have me drive over to pick it up.  Not  cool when I already paid for delivery. Instead of offering help the owner was just rude and hung up. Never ordering from here again.","useful":1,"funny":0,"cool":0},
{"review_id":"ymTs63nyHFaB1mUqhSSicg","user_id":"laP6_qHbWctG3AktZKR8Mw","business_id":"cbddL2q8uRA38RwycB0FJg","stars":4,"date":"2013-06-22","text":"We stopped in on a Tuesday afternoon. Service was very friendly. Ambiance is super comfortable. Food was great, the chicken pesto asparagus salad was amazing. Heavy on the pesto but that's what I love! Had a Blue Moon and it made an excellent early dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"9EAhCez3b9w1QNZP33uUrA","user_id":"laP6_qHbWctG3AktZKR8Mw","business_id":"S6T5R3BVm2JIV3E2Tvw5nQ","stars":5,"date":"2013-06-22","text":"This place is really great. I was out of town and needed a laundry place nearby to run just one load. It's clean, colorful, easy to use machines. And they're eco-friendly (dry cleaning, too)!","useful":2,"funny":0,"cool":1},
{"review_id":"s_EO9NeOPhWXet0QYjjibQ","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"tTXlg3pL7pHPHam1kL87IQ","stars":1,"date":"2014-05-22","text":"Did a fine job on the suit I guess.  Issue with them is that I told them I needed an item back by a certain day and time and they promised it would be ready. I even allowed 24 hours extra and told them I needed it one day earlier than I did just in case they screwed up.  Showed up 1 day after they promised and guess what? No suit.  I had to wear a dirty suit to the wedding.  They added insult to injury by charging me FULL price for it in spite of their screw up.  \n\nStay clear of these bozos.","useful":0,"funny":0,"cool":1},
{"review_id":"I0Yu4gp0pB6CtNLGINxplw","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"RhEvP5flF6KoPriMHmVYGg","stars":2,"date":"2015-11-12","text":"I have stayed at this hotel many times, but I think it's declined significantly lately.  This stay... Where to start?  Stayed here on business.  I Booked a King Room with a \"canyon\" view and showed up at the hotel about 10 minutes later since I booked it from the shopping center across the street. \n\nAfter waiting almost 20 minutest to check in since there was only 1 person working at the counter at what I'm assuming is the \"peak\" check in time of 445pm, was told there were no King non smoking rooms but they'd be happy to put in in a smoking king... Whatever, give me the queen rooms and no biggie, you'd think.  \n\nThe room over looked not a canyon but a beautiful parking structure and the I215 behind it which actually made plenty of noise.  To make matters worse when I pulled the covers back there was so much dust that came off the bed spread it looked like a cloud.\n\nLast straw was getting charged the $30 resort fee and being told they had a \"state of the art fitness center\" included in this, I found the fitness center under renovation and closed.  It was replaced by a conference room with 5 treadmills and TV with no remote control. Seriously?  Fraudulent!! \n\nNever staying again!","useful":7,"funny":0,"cool":0},
{"review_id":"XsTsu7FeURoLktpwGqbbbw","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"9ba2odSWsMCDqTogoqGcqQ","stars":1,"date":"2013-03-22","text":"If I could give this POS company negative stars I would.  They are awful.  I was stuck with them for a few months and they are the worst.  I agree with other reviewers that most of the morons they send out are right out of high school. The guy at my house was either high or retarded.  Probably both. I watched what they do each time they were here and it's a joke. They left trash in my yard.  The reason they are cheap is that they only balance chemicals 2x per month and in the AZ summer that wont work.  My new pool guy says \"half of my current customers came from Poolman\" and they left because Poolman sucks.  I wouldn't trust them to sevice a cess pool.  Run away from this company.","useful":4,"funny":3,"cool":1},
{"review_id":"eLZC3PE3Md3OHR4tAcu1yw","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"aQ222ydz_GSRZV66xNt4kQ","stars":4,"date":"2014-06-25","text":"Just awesome traditional and unique sushi!  Impeccable service, great Saki and menu items.  Can't wait to go back!","useful":0,"funny":0,"cool":0},
{"review_id":"lqJ5qmtc3lU8HKuMMNg7uA","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"mtRNLhCbLQhFBOK5bk1yJw","stars":1,"date":"2014-07-08","text":"Well I never Lived Here. But I got a really nice look at the place when I tracked my stolen iPhone To an apartment there.  You have to love the find my iPhone app! You could see it was in one specific section of the apartments... The police was nice enough to come out and knock on the doors, However most of the people who live there simply turn off the lights and didn't answer the door.  It's that kind of friendly place. So here's what you do if you want to live with people who will steal somebody's iPhone from a clothing store Changing room, Definitely move there.","useful":6,"funny":1,"cool":0},
{"review_id":"A_mUVnwwgAqPm-cBwAQ1Qw","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"kCEsqLtBaabQN2Z7c6eL6Q","stars":1,"date":"2015-09-15","text":"I have kept trying and trying to give this place a decent shot but they keep giving me a reason to never, ever go back.  \n\nTonight I went at 645 PM and the meat and deli counter were already closed?  I mean, WTF? People DO go shopping at 645PM still right?  I asked the cashier and she said \"Well, we are just too slow to keep the meat counter open this late.\"  Seriously?  No wonder why this place is slowly dying. \n\nThe selection here has been gradually getting worse, now no organic chicken, and outside of the closed meat counter their meat selection quite frankly sucks unless you want to buy a bunch of clearly past their prime pre packaged meat some of which is marked down a whopping $3.  Thanks Haggens, enjoy throwing that piece of Kobe beef out instead of discounting it. \n\nI will be looking forward to this place going out of business but I feel bad for their employees.  It's not their fault the managers are idiots","useful":1,"funny":1,"cool":0},
{"review_id":"nlZxXjCWLpg8hMndF0cb2w","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"lsiqMhjT6jQVRaYJf8hzhA","stars":5,"date":"2015-08-31","text":"I am very happy we went to see Duke at Your Mattress.  We went to both his Fashion Square store and also the Arcadia store and he is truly an expert in what he sells.  In addition he had a tremendous amount of patience with us as we really didn't know what we wanted.  He has a system there that estimates the exact firmness of the mattress that suits you the most and it was really accurate.  \n\nThe store is really nice, and his delivery people were very clean and professional. \n\nIn addition, the Kingsdown mattresses he carries seem very well made, and there are multiple different options that should make everyone happy. \n\nHighly recommended!!!!","useful":2,"funny":0,"cool":1},
{"review_id":"NnQH8k4XTVMz5F-tWDKIbw","user_id":"dBTHnGAZ0vwPhQ1KqJqpVQ","business_id":"8iGWR3bEYUUBOjIJRngyOQ","stars":5,"date":"2015-07-24","text":"I have been very happy and impressed with Dr. Lam and Chris.  Dr. Lam worked with me for a long time with some difficult to fit contacts and Chris ordered in some special glasses for me.  \n\nI would recommend them without hesitation.","useful":3,"funny":0,"cool":0},
{"review_id":"XBrtMPInV13iOg8cOJI-xA","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"2uGqLFmTRq4sDiGtlCg-Jw","stars":5,"date":"2017-07-01","text":"Stylish clean atmosphere, quality stylists, friendly staff, easy to book appointments, and super attention to guests.","useful":0,"funny":0,"cool":0},
{"review_id":"e6dCPcWD2IBam1xfMLk99Q","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"_Ggfchx5t3KYZOWu5N3y-A","stars":5,"date":"2017-02-23","text":"We purchased our pup Ivy from this store.  Female maltese.  Great customer service.  Caring environment.  Happy puppy.  Super customer service follow-up by the store.  I would purchase again!","useful":0,"funny":0,"cool":0},
{"review_id":"8S0m5ferJTSXqzGWc1CnmA","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"gcHhW39subqr_5_muoNYLQ","stars":5,"date":"2014-01-30","text":"Really excellent customer service!  After a full home remodel and working with a long list of contractors, subs, and construction service providers, the experience with B7D Gravel stood out far above the rest.  B&D Gravel assisted with gravel delivery for our driveway and landscaping.  They also coordinated drivers, labor to spread, pack and stabilize the exterior surfaces of our landscaping.  Diane was helpful, courteous, responsive, communicative, knowledgeable, and extraordinary to work with.  All parties involved in the process exceeded my expectations!.  Great job B&D Gravel!","useful":3,"funny":0,"cool":0},
{"review_id":"TllYZb4TLXeNhpUAhplVeA","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"ARX3uG3nLraOzkQYEdHzcg","stars":5,"date":"2017-05-25","text":"Prompt appointment, quick repair, lasting quality.  So happy I used Beyer on my clothing dryer fix.","useful":0,"funny":0,"cool":0},
{"review_id":"RTQn1dokH42RqSaOSfugSw","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"G-Dw_zbQEzJakmzASzzJ7g","stars":1,"date":"2016-05-05","text":"I just arrived home from shopping at Zara.  Store # 6422, Fashion Square Mall, Scottsdale, Arizona.Tonight was the worst experience ever there!  I am a regular Zara Customer having shopped in Chicago, California, and Arizona locations for 8 years now.  This evening, I was shopping in the store for a total of 20 minutes from start to finish.  From the moment I walked trough the door this evening, not one sales associate said a word to me.  No one helped us!  My daughter and I made quick selections for her to try on because we needed something specific, and she headed towards the dressing room.  It was 8:57 at that moment, when the cashier, Maria Marte, was the first person in the entire time I was there to say anything to me.  Here is what she said, \"We are closed.\"  I replied, \"Its 3 minutes to closing, you aren't closed yet, my daughter wants to try 3 blouses on, and then we should be able to make a purchase quickly.\"  The cashier at Zara, Fashion Square replied to me, \"Well I'm closing my register.\"  \n\nAt 9:02 pm, the cashier Maria Marte turned to me and said, \"I'm closing my register.\".  I said in return, \"We are going to make a purchase, my daughter is finishing up in the dressing room.\"  Where in she stated, \"Well we are closed.\"  I said, \"You won't let us make a purchase?\"  Maria the cashier then said, \"Well my manager said to go ahead and close my register.\"  I asked to speak to the store manager, because this didn't seem right. It was no way to treat a customer who is trying to make a purchase at 2 minutes after 9:00 pm\n\nAt that moment, the assistant store manager came over to us.  His name is Ruben Sanchez.  Ruben turned to me and said, \"We are closed.\"  I said, I realize this, but we are about to make a purchase.  He then said, \"Well our registers are closing.\"  I looked at my watch and said, \"It's 4 minutes after, won't you give us some grace and let us make a purchase?\"  Ruben the assistant store manager at the Scottsdale, AZ store turned to the cashier and said, \"Close it down.\"  Then walked away from me.  I said to Maria the Cashier, \"I come 9 years out of Retail Sales, and have worked for Nordstrom and Barney's New York.  This is never an attitude that a sales associate should have towards a customer that would like to make a purchase.  Generally, at 9:00 pm closing you close the front door, but let any customers still in the store at that time finish out their transaction, make the purchase, then allow them to leave.  This is within a reasonable amount of time, it's 9:06 now.\"  Maria the cashier then said, \"Well my manager told me to close the register.\"  I replied, \"Even if that means you won't allow me to make a purchase.\"  She said, \"Yes.\"  After begging them to take my money, I finalized my transaction at 9;06 pm, with purchasing a white blouse my daughter had selected.  I don't think I could ever shop at the Zara Scottsdale, Arizona ever again.  They treated me so meanly and made me feel as though I was being kicked out, when all I was doing was buying a blouse and being a loyal customer.","useful":7,"funny":10,"cool":1},
{"review_id":"k97zgZ4gsmyop_imJUosKw","user_id":"IWGXrVJaQI6QW-_11cqTcw","business_id":"s2FWW3HzoPHHpMmkca7maA","stars":1,"date":"2013-12-17","text":"Rude staff!  I rented two patio umbrella propane heaters for an event.  They were late on delivery the day of the event.  Then on the scheduled pick-up time, post event, they were also late.  I waited at home for 3 hours for the scheduled pick-up.  30 minutes post time block, I called and asked their status, or to reschedule.  The gentleman on the other end told me that now they needed to charge me extra money for a specific time pick-up.  I replied, I don't need a specific time, I just was hoping that you would meet the schedule you had asked for on the equipment pick-up.  I advised that the heaters were on the patio where the delivery technician had placed them the day prior.   The gentleman at A to Z said that again they needed to charge me more money as a \"set-up\" charge to get them off my patio, where they had placed them originally.  He told me that they needed to be curb side.  So, I alone, had to carry them up a steep driveway, and they were quite heavy.  It was a struggle and massive to handle.  The customer service individuals at A to Z were rude to me and non-helpful.  All they wanted to do is stick me with charges above and beyond already set contract.  I will never use them again!","useful":1,"funny":1,"cool":0},
{"review_id":"r_LG-3oA05kEiASXWs8N2A","user_id":"MQOibif4l4gX-NzTDQNxGg","business_id":"jeTvVMOR8W_04xFsPjzOEQ","stars":4,"date":"2016-07-25","text":"We contacted this company after reading the reviews here on Yelp.   The two gentlemen that did the move were very nice.   We had moved all breakable items, boxes, and small items beforehand ourselves.   Unfortunately for the guys doing the move it was over 120 degrees that day, and as such the move took longer then originally quoted.   Brad Olson was very good about only charging us for the agreed amount of time quoted.    I would certainly recommend this company based upon their customer service.","useful":1,"funny":0,"cool":0},
{"review_id":"bocRhfSZFeM_VvHRMXL6-g","user_id":"MQOibif4l4gX-NzTDQNxGg","business_id":"K0gpWF0ASHjNbyaPLYe3dw","stars":1,"date":"2016-07-22","text":"We contacted Arizona Rainfall for a proposal on remodeling a pool and entire backyard.  Tim Brown, son in law of the owner, was assigned to us.   Tim came out to look at the property and we gave him the plans for the pool that was installed as well as the Plot plan for the house.   We discussed what we wanted with Tim and left to draw an initial plan.   Days later Tim emailed a basic plan and a video of his ideas, So far So Good.   In the meantime we contacted a couple of much larger pool companies, including one that we had used before and has a very good reputation.   Its a good thing we did as the other companies check the codes and found setbacks restrictions that Tim was unaware of.   Due to the research of the other pool companies, we had Tim redraw the plan with those setbacks in mind, as well as some other ideas.   This happened on a number of plan iterations, where another pool company would have a great idea and we would share that idea with Tim to incorporate into our plan.   There were many differences in design quality such as AZ Rainfall uses Alumawood for their Ramadas as opposed to building from scratch like all other builders.   We informed Tim that we would have to check with our association as their rules required similar building materials as the original residence.   All of the sudden I get a call from Tim Brown saying they didn't have the time to send a final plan for approval by the HOA, without which we could not get approval.\nIt appears that this well over $100,000.00 job was no longer of interest to AZR.   I guess that the demand for pools and landscaping is strong enough that some builders that are not big enough to perform certain jobs find it easier at the last minute to withdraw, having wasted valuable client time.  So if you have a big job, and are a good buyer, you might want to go with a more experienced and larger pool\/spa company.","useful":1,"funny":0,"cool":0},
{"review_id":"y16oPxoMc3AagNNh2izFEw","user_id":"fdNyMU__kVS3G2wlsSs1hA","business_id":"s-YJpfR-LFRnH7qYVFuJuw","stars":5,"date":"2017-07-26","text":"Great place to eat! Great ramen and comfortable seating. nice music. good place.  nice ceiling fans.","useful":0,"funny":0,"cool":0},
{"review_id":"jko3j4UJ45tRJzA0MRLbCg","user_id":"1pbrnu8o5jmz78G1A8skmA","business_id":"NLHqpX3SwqPb5wlWwau9pw","stars":5,"date":"2017-01-20","text":"I was in Vegas for a week and needed a Muay Thai training session.  A friend referred me to Redemption Fight Team.  I can't tell you how amazing my experience was.  First, thank you Master Dayel for an UNBELIEVABLE training session.  Second, Steve Nachwalter, your gym is fabulous!  Everyone was professional, inviting and the coaching I received was second to none!\nEven the sweat shirts ROCK","useful":0,"funny":0,"cool":0},
{"review_id":"N8OiDmMY25x6BlkzUuWkSw","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"zIfCWjZ0RAe8YVMSPZdOdA","stars":2,"date":"2015-12-03","text":"Burger Wass ok just nothing special. Thort signature pasta dish as well was just ok. Over priced for what they offer. For the same price I would go to Chase or Buca. service was extremely friendly","useful":0,"funny":0,"cool":0},
{"review_id":"Fqc4RxC1CouzItoHOxUBLw","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"4MlVKZ1ZbVA__MA-7D3gYQ","stars":3,"date":"2015-12-10","text":"Had a good steak, a side and a glass of wine = $100.  If you're looking for a place to impress you guest or try to close a big deal, this is it.","useful":0,"funny":0,"cool":0},
{"review_id":"7ygUK_4BxsAQ31hsQqLJEA","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"Kgu-Ny8xoYtiUQp0wa7vwQ","stars":3,"date":"2015-12-10","text":"Hello, \n\nHello - Had the Beef vindaloo and it was great. Perfect meal for a snowy day in Calgary. The menu has some nice choices and the quality to price ratio is good. This is a chain restaurant that offers good service but if you travel a lot is just kinda what you get in all other chain restaurants, not that that is a bad thing it's just don't expect to be blown away for a \nculinary experience. It was in a nice new building just like all the other nice new buildings in that area. The service was very friendly, the meals came out fast and is exactly what I was wanted for my meeting.","useful":0,"funny":0,"cool":0},
{"review_id":"Rlg3xoalTJ3z5_r7p-N63A","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"SoiXeBUyWZQsBvjBMqkjZQ","stars":1,"date":"2015-12-10","text":"I agree with the other posts that this company is not providing the service it advertises. When you try to reserve tickets, you can not get the flight you want, you still have to pay the taxes and they request to many points for what the segment is worth.\n\nMy other issue is the way the retire points for non activity. This is a punitive and self-service policy. They retired 360,000 miles from my account for non activity but yet they left the account open. I did not get any notice they were going to retire my points. \n\nI would like to see the appetite for a class action against Aeroplan. Any lawyers want a piece of this? If you had points retired, do you want to join? \n\nWhy do they retire them? There is a financial benefit to the company to steal these points away from their members so the policy is clearly to their benefit and is punitive for their users.\n\nLet me know, I am serious about this. I want to investigate if there is enough moment and content to open a national class lawsuit against them.","useful":0,"funny":0,"cool":0},
{"review_id":"Vl3p5mKKSk2Y3D8siUcc7A","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"lShGSRdcV-xbGLvcuj0Nag","stars":1,"date":"2016-07-17","text":"I accumulated close to 400,000 miles and when  I lost my employment and stopped traveling for 1 year I lost 15 years of points. They claim it's to encourage loyalty. - as if 15 years is not loyal. The only purpose they serve is to get a better seat on the plane.","useful":1,"funny":0,"cool":0},
{"review_id":"HvJr306YJtyCCbx7yEBN2g","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"k216g_LRctaecOejbFKBgw","stars":4,"date":"2013-02-26","text":"Quelle belle trouvaille! Accueilli en franais par Christopher, l'un des propritaires, qui a pris le temps pour me faire une dgustation! Un vrai bar  vin au centre-ville dans un quartier avec plein de caractre. Choix vari et abordable avec une table trs apptissante!","useful":0,"funny":0,"cool":0},
{"review_id":"mLFDRyzTPwZiqYGz7lbCRQ","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"gYAM9MZ_s-YKIUZSZ2Evyg","stars":4,"date":"2013-03-20","text":"J'amais du! La bouff est bonne, La bire  du got et l'ambiance est bien. Il suffit d'apporter un(e) ami(e)!","useful":1,"funny":0,"cool":0},
{"review_id":"FVdCsiwK5xL3vDwG8RaI7A","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"rSwGkWTJkKfwjfOWHYr3mA","stars":2,"date":"2017-06-30","text":"Dcor correct mais le menu est lamentable. Beaucoup de combos ou forfaits imposs pas vraiment une place pour les amateurs de sushis.","useful":0,"funny":0,"cool":0},
{"review_id":"71xNE0qpjhgEz44PgbfIDA","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"0bbWKI1lA-bmEeeWOrDmSA","stars":3,"date":"2015-11-12","text":"It's an ok place. Quantities are greater than you really need. Menus are are in thick plastique like in all non de script restaurants. No reason to avoid this restaurant just no reason to go out of you way to go either.  Ordered an espresso an got a Demi tasse with no crema. They should not be selling this if they can't make it","useful":0,"funny":0,"cool":0},
{"review_id":"j95S7zmEaUjSIX_tNOXPSQ","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"G_Opi5l0rB1cWgHYv6a-Jg","stars":2,"date":"2016-09-06","text":"Ok yes it's sushi but it's the fast food of sushi nothing great counter staff were very nice. Place was clean.","useful":0,"funny":0,"cool":0},
{"review_id":"YNpNMRy08EY_Cpcgfzv70Q","user_id":"hjHrV1WzO8RDRYJ-ep2OZA","business_id":"xhCiQt_-pMp1nKDXZ7n7BQ","stars":2,"date":"2017-07-15","text":"Wine choices were middle of the road.  Tortellini was very salty with little flavour. Veal parm was just ok and waitresses killed a bug at our table. Come back? Nope\n\nOk the pizza out of the oven looks good but the rest of the menu - not sure","useful":0,"funny":0,"cool":0},
{"review_id":"jqQE7btbmv-T0vkuw8PgpA","user_id":"X2KH-PrhGNp_oLRnutEPNg","business_id":"6r0r0cJSLvh2BDir8TaxPw","stars":3,"date":"2016-04-13","text":"It's a hit or miss at this location. Sometimes the food is good and at others it's mediocre and the fish doesn't taste or smell  fresh. I always get the all you can eat buffet and the food is ok for the low pricing. However they don't have the best sushi and the servers are rude and kind of throw your food on the table. The only time they speak to you is when they bring out the debit machine for you to pay and they put a fake smile on for a tip. I once overheard the server raise her voice with the customer at the table next to us because he left her a low tip.","useful":0,"funny":0,"cool":0},
{"review_id":"EqIjalJyJDgvweJcw70aBg","user_id":"X2KH-PrhGNp_oLRnutEPNg","business_id":"jZ23B--fu21is2zrWiy4Kg","stars":5,"date":"2016-04-12","text":"Brought my dog here several times. The staff are amazing and take great care of Kilo. He always comes home happy and tired out from all of the activities. The grounds are big and I love that they offer a supervised group play to ensure his safety. He hates to have his nails cut and the groomers still find the patience to get it done. Special thanks goes out to Marie and Fiona! Definitely recommend this day care facility for anyone who is looking for a responsible kennel to leave their pets!!","useful":0,"funny":0,"cool":0},
{"review_id":"rl_8UlPHPOpMGxkciziK7Q","user_id":"gqSeIUkD5lao3z7cl57EFA","business_id":"4kjoVsi3tb-vVtFZ6WPNvg","stars":4,"date":"2011-01-28","text":"My boyfriend and I have eaten here at least eight (8) times. Here's the scoop:  the veggie pizza is amazing, brushetta is fantastic, beet salad very tasty,  satay skewers are great, the avocado dip is flavorful, the arugula & frise salad with pecans delish.  In short, every dish we have tried so far is done with a tasty twist.  They also have a great beer and wine selection.  The sorbet desserts are heavenly.  We will definitely be returning soon.","useful":0,"funny":0,"cool":0},
{"review_id":"qhSy5E2yzicSlTu9A60SmQ","user_id":"3PzZdVYJp2o-Fkx5TfcmbQ","business_id":"swi7mi1ixWpu5-tZO2mtsg","stars":1,"date":"2014-08-28","text":"Wow, where to begin?  We just moved to Anthem from Dallas Texas and were looking for a great pizza\/Italian place to eat at, but this is NOT the place.  We entered and there were only two other  dinners in the place, one was a family of 5 and the other was a family of 3, we were a party of 2.  We were seated and told that are waitress would be with us in just a minute.  Well, that minute turned out to be about 10 minutes.  Having had time to read the menu about a dozen times while we waited, when our waitress finally did show up we were ready to order but she ask us if we wanted to put in a drink order?  Really???  So we did put in an order for 2 glasses of wine and asked for water as well.  About 10 minutes later we received our wine (very small pour indeed) and no water?  As we were waiting for our food order (I'll get to that train wreck in just a minute) we noticed that the other two occupied tables were having issues with their orders and all we could hear was the waitress consistently apologizing, we also watch as the other tables food was delivered, ONE freaken plate at a time, first one child got some breadsticks, then about 4 minutes later the other child got a salad, then about 10 minutes later the father got his order, then they apparently asked for water and it was delivered ONE glass at a time by the same server (not waiter???) then we experienced the same absolutely mind numbing food delivery, with the exception that I had ordered the 10\" pizza (which was pretty good after a 20 minuet wait) but my wife had ordered a chicken pasta dish, which we never received.  The waitress brought the pizza and two plates and started to walk away and I ask where my wife's meal was and she looked stunned, walked away and came back and told us that she had turned in the order but the \"kitchen\" must have misread it, but she would re-enter the order, well that was about 2 glasses of wine each and one very small pizza later, which had already taken about 55 minutes....duh!  So we simply told her to cancel the order and we would just pay for the pizza and wine and be happy to leave.  It was one of the worst dinning experiences we have ever had.  The \"manager\" was there, tending a small bar, at which NO ONE was sitting, but he did manage to go and clean the back door glass while all of his customers were waiting for service.  It was a totally dysfunctional, totally unacceptable experience and I doubt that we will ever return, unless my wife bets me that it couldn't possible be that bad on a second visit and I might be willing to accept that \"sure bet\"!!!  Unfortunately in Anthem the dinning options are very limited and even the Legend Sports Bar (well, sort of a sports bar) is failing as it changes management???  I ordered a pizza there last  week and was told after a 15 minute wait that they had no cheese for the pizza because the whole kitchen\/management team just weren't ordering any food?  Wow, what a way to make a transition in business ownership!!! Someone please help these clueless owners\/managers!!","useful":0,"funny":0,"cool":0},
{"review_id":"-aUCxspfiYmRGi2iopGJrQ","user_id":"3PzZdVYJp2o-Fkx5TfcmbQ","business_id":"Edq3REDbBfss0WQu2Ta93w","stars":1,"date":"2015-09-04","text":"My wife and I have been eating at this Zupa's (Happy Valley) for almost a year.  When we first started eating there it was absolutely excellent.  Our last few visits, today and last week were not good at all.  First off the salad bowl used to be filled almost to the top with greens, last two visits there were a good 1 1\/2\" from the top (really?) of course the condiments are alwyas put on with a tiny baby spoon, usually not even half full of content, but I get that and am ok with that, but what also doesn't seem right is that if you get a \"large\" size salad, you still get the small size condiments?  Additionally, the honey mustard dressing must have been diluted because it has absolutely no taste and of course was minimally applied.  Another major concern is that while eating the salad, it seemd very gritty, almost like there was sand or dirt on the leaves?  Bad taste as well.  I used to get the lobster bisque but quite ordering that because it seemd that they putting more filler stuff \"celery\" etc. in it and less pieces of lobster.  The Tomato Basil is still very good so that's my go to for soup, assuming we ever go back.\nAs for customer service?  Spotty at best.  Today the server behind the counter at the soup ask if I wanted any soup, I said yes, a small Tamato Basil.  I got up to the register (very crowded) and there was no soup?  The server of the soup had this blank stare on her face like \"did you want soup\"?  Then the cash registers were not working properly and we stood at the counter with our soup getting colder by the minute and 4 to 5 minutes later we finally got to sit and eat.  Only other comment (not a good one) is that the water out of one of the soft drink dispenser tasted very bad?  Not sure why but certainly something to be concerned about.  Well, that's it folks!  We live in Anthem and don't have a lot of great resturants in the ares so we are very sad that this place is seemingly going to hell in a hand basket!!","useful":1,"funny":0,"cool":0},
{"review_id":"lBrRqtwPV9mhaa1mVwqceg","user_id":"3PzZdVYJp2o-Fkx5TfcmbQ","business_id":"kYlUfS1ncd64gWCWRmLG0w","stars":2,"date":"2016-05-23","text":"It's just too bad that a great track of two 18 hole championship courses can't Marshall their courses better.  We played yesterday and had to wait on every tee box.  For most of the round, we have 4 groups on every hole.  One approaching the green, one in the fairway and two waiting on the tee box.  I had to call the pro shop to ask them to come out and move people along.  Question is \"WHY\" should a customer have to call and ask for a Marshall?  Why aren't they pro-active in keeping the POP reasonable.  When the Marshall did come out he told us that their POP policy was 2 hours and 15 minutes a side.  Really???  Why not make it 5 hours a side so no one is ever responsible for slow play?  Too many sh*t head a mature golfers that think they are playing in a PGA tournament, lining up 4\" putts, examining they from 4 sides before setting up to putt, standing in the rough of a par 5 fairway 300 plus yards from the green, waiting for the group to clear so they can hit their second shot (of 7).  Get over it people, there are others on the course, be considerate and play ready golf.  WeKoPa professional staff, get off the chair and get out on the course and make sure that everyone is enjoying their round, not just the butt heads that can't keep pace.  Nuff said!","useful":1,"funny":0,"cool":0},
{"review_id":"lmMaSKYlB5ZdI8nEt2fzyg","user_id":"a1h2P-yLquiVwZlwxl-8aQ","business_id":"TY_kMmCM_3JSs14NFUvO_g","stars":5,"date":"2015-01-17","text":"We had dinner at this place when it opened. Absolutely fantastic. Service was great, food was killer. The friends I went to dinner with were new to Korean food, and the staff was very helpful in describing and suggesting dishes .The place is smaller, which I really dig. It's an intimate little setting with an open kitchen. The smells are amazing, it's a family atmosphere, and I left incredibly satisfied. Portions are large, and easily shared. Prices are good. For Asian in Pittsburgh- it's legit. Def a gem. Go early, it fills up quick.","useful":0,"funny":0,"cool":0},
{"review_id":"yxLUlxxnAOeV0J-nuMnysQ","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"NJGGYCkvtW8W9njq9WpMmw","stars":5,"date":"2015-03-05","text":"This place is great. The food was very good and the service was excellent. I had sushi and my little one had the chicken satay off the kids' menu. The miso soup was good, too. They have a full Thai menu, and then a similar sushi menu to the Sushi 101's on Park Rd. and in Ballantyne. The decor is very nice, also. Go check it out.","useful":2,"funny":0,"cool":0},
{"review_id":"HewkR0PHAjWjupGlX7h1Lg","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"ZsP6yF5QprRJAINRvcDntA","stars":2,"date":"2013-01-18","text":"I used to really like this store. They have neat little trinkets and just all kinds of fun items you won't find everywhere.  I go and browse fairly regularly and try to buy something every visit, because I like to support local businesses. However, after my last visit, I don't plan on going back. An employee there was so rude that I put back my items and left.  If you want to shop somewhere where the cashiers have that snobby, mean girl attitude, go here. If not, go elsewhere.","useful":2,"funny":0,"cool":0},
{"review_id":"ZlMQ7bfrYImt2vQJoGYw0Q","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"aG-QcGdP7yY7-UPyeyvNCA","stars":5,"date":"2015-05-19","text":"I finally tried this place and I am so glad I did. I had a great lunch here. The enchiladas blancas are delicious.","useful":1,"funny":0,"cool":0},
{"review_id":"VkOLhCAB21gvKH0cgv01yw","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"yyYpTY4dhfnX_-4UJEWUcg","stars":2,"date":"2016-12-13","text":"I'm not really sure what they're gong for here. When I have sold to them, I have brought in items that were brands like Calvin Klein, BCBG, Express, Limited, Gap, Forever 21, Old Navy, and bebe, but they just dig through the bag, pull out the clothes from Target, and purchase those. They reject the rest of them, claiming things like they \"never heard of those brands\" or \"those are older people brands.\" The purchasers have always been very young ladies, probably still in their teens, but I'm still surprised they are unfamiliar with these brands. If they are specifically looking to buy and sell clothing for teens, it seems they should change their marketing to reflect this, because that is not the impression I get from their online presence and store name. My suggestion to shoppers would be to just head across the parking lot and buy your  clothes directly from Target, where you'll likely pay less for them new than they are charging for them used.","useful":0,"funny":2,"cool":0},
{"review_id":"SEBriG8gKIumXSvQwyqsRQ","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"a8uQhqCsy_CA74HqNBOuUA","stars":4,"date":"2012-09-12","text":"Overall, we had a positive experience.  Baja Soul has a rather unfortunate location. Although they are in Birkdale, they are tucked in the back as opposed to on the main drag, so you will likely only see the place if you are purposefully looking for it. Once we finally found it, we went in and stood at the front and looked around and saw just a few diners, but no staff.  After a minute or two, we were about to leave, when someone came and greeted us.  After that rough start, the service was friendly. They serve complimentary chips and salsa. I did not have any of the salsa, but it looked good. The mahi mahi fish tacos were very good, but be warned that they are spicy.  The Mexican Street Corn is awesome.  I did not care for the fried plantains, but they were prepared fine. I'd just never had plantains before and found that maybe they aren't my thing.  I'd say give this place a shot if you are a fan of trying different kinds of tacos. The prices are very reasonable, but I think they could get more business if they would advertise more and let people know, \"Hey, we're back here.\"","useful":1,"funny":0,"cool":0},
{"review_id":"CHzL-8Ryz4njrSkNDT_ydg","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"qDl34ITEzEQNypLSJzTJTw","stars":3,"date":"2017-10-06","text":"I'm giving three stars because I love Chick-fil-A, in general, and until the last few months, this location has been perfectly fine. However, I haven't been going to this one lately because of how bad it was the last few times I went. I got chicken nuggets that tasted horrible. How can you ruin chicken nuggets? I got a salad that was significantly smaller than usual and contained wilted lettuce. I don't even think it was the same type of lettuce usually used in that salad. Worst of all, the service wasn't good in the drive-thru, and good service is usually a cornerstone of any Chick-fil-a. The last time I went through the drive-thru was on a weekend. It appeared that only teenagers were working and there were many of them. The restaurant wasn't crowded, but it took forever to get through the drive-thru. I've seen them get two long lines of cars through in no time, but not this time. While I was waiting in the line of cars, I suddenly heard yelling. Apparently two young employees were arguing by the open door between the ordering speaker and the window. I got to listen to that go unchecked for awhile in the slow moving line. When we finally got to the window, there were probably 10 teenagers standing around chatting about their love lives and various other things, but nobody was standing at the window to take my money or give me my order. There was one young lady who was trying to get everyone to work, but she was being ignored. Finally, the one person doing any work got our order together and took my money and gave me my food. After all that, they forgot my honey mustard sauce! My suggestion would be to have a responsible adult member of management work on the weekends, because the kiddos aren't managing themselves.","useful":0,"funny":0,"cool":0},
{"review_id":"EXzkcp_W5DqOTl8sZ6Iebg","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"ataRn8s6owt3SObGajp4KQ","stars":4,"date":"2016-12-14","text":"I haven't tried their pizza. I did try a stromboli and didn't care for it. However, their wings are fantastic! They're crispy with just the right amount of spice, or you can get them plain, if you prefer. We go here and order wings and salad for our meal. They're great and the staff is friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"HYSgz5S3rAhhYit7mqcKOA","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"ElCy74OhzHmwgpZ1RSDYsg","stars":4,"date":"2012-04-18","text":"The first cupcake I had here was the best cupcake I've ever had--a pumpkin cheesecake cupcake.  Unfortunately, they haven't had these again on any of my visits since and none of the other cupcakes I've tried have been as good, although most have been tasty.  The service is always okay--not rude but also not especially friendly.  I think if they would try to be a little more personable they could drum up more business, because they have a good product and good business idea.  I actually liked their old location better, but I can see why they moved, because the old one wasn't very visible.  I think more parents and little ones would come to the new location if they would make it easier to enter with a stroller.  Overall, they have a better space than their close competitor and a comparable product, but I think the reason their nearby competitor is always busier is because of the friendlier service.  Just Baked is definitely worth a try and I hope they stick around and keep coming up with great cupcakes.","useful":0,"funny":0,"cool":0},
{"review_id":"ZBm7k0K0YQFlcIqYJs2OMw","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"VVeT1XqQYwrB_fbp3efdUg","stars":3,"date":"2015-03-06","text":"I've been here a couple of times, but mostly forget it's there. I was reminded about the place by some reviews on here that had me wanting to try to they Chicago Dog, so I did. The remodeling looks nice, but I'm surprised they needed to expand their space, because I hardly ever see anyone in this restaurant. On this last visit, at lunchtime, I was the only customer there, but they kept me waiting for quite some time. When I finally got my Chicago Dog, I wasn't too impressed. The bun was very soft, which is a good thing, I suppose, but with all the liquidy toppings on top, the bun just got soggy and kind of dissolved underneath them. I probably won't bet getting that again, but having only tried a couple things on their menu, I may go again and try some more items.","useful":0,"funny":0,"cool":0},
{"review_id":"16jSgPTl6cdYBljr1SXWeA","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"wiPtQK7_QAkUUMQtyiaUNg","stars":1,"date":"2015-02-17","text":"I've been to this place three times. The first two times were for lunch. The food was mediocre, at best.  Their breakfast menu looked so good, though, that I decided to give it a try. Let's just say that this place really needs a management overhaul. The whole experience was shockingly bad. First, we were greeted by a young man who kept wondering off, coming back by, saying, \"hold on,\" wondering off again, and then finally seating us in a restaurant that wasn't even particularly crowded. A little unusual, but no big deal so far. A waitress came in a reasonable amount of time and took our drink orders. My ice tea was horrid. It definitely did not taste freshly brewed and had an artificial lemon flavor to it. She took our orders, and brought the children's (burnt) food quickly. Then about 15 minutes later, came back and said they were out of what I had ordered. I found something else to order, and someone eventually brought it along with our other adult meal. Our food was cold when we got it, and of course the kids were done eating by then.  We then didn't see our waitress for about 45 minutes, long after we had finished eating our cold food and were trying to entertain our children who were understandably getting restless at that point.  We were finally able to flag her down and get our bill. I never once saw any sign of management anywhere. I can't say that I would recommend the place, unless they get new management and some major staff training, which is a shame because it's a nice  looking place and has a potentially good menu.","useful":1,"funny":0,"cool":0},
{"review_id":"YZ9gKdMe2vFXut29UN1TMg","user_id":"jBh_F1Sb7nkoEz_nyyiaxw","business_id":"6HMwB2wCKezd7aKzQd5asA","stars":2,"date":"2012-06-04","text":"I've given this place several chances, but they just aren't cutting it. I haven't had any problems with their other locations, but this one consistently has issues with service. I like their location and nice view of the boardwalk and lake, and their food is good, although for some reason not as good as the other Sushi 101 locations. The inside is nice, but could be cleaner. It looks like they never clean under the tables at the couches.  I also have noticed they don't have the greatest sanitation rating, which is a little frightening for a sushi restaurant.  The main problem, though, is the service. It's just always bad.  It doesn't matter if it's crowded, not crowded, lunch, dinner, weekend, weekday. I've tried all different times and it's just consistently bad--even when the owner is there. He seems to just wander around doing nothing and not noticing that people aren't being attended to by the servers.  Refills are hard to come by and the delivery of the food is strange.  After waiting for awhile, someone at the table may receive an entree when nobody else has even been served their soup or salad.  I want to like them, but they make it very hard.","useful":0,"funny":0,"cool":0},
{"review_id":"n5ZbikKQZL8g3vnYr7kLRw","user_id":"bSnA8GWo1VYcsCdmyh5QQg","business_id":"EgW-kEqxP83MlVl06Qn21g","stars":3,"date":"2014-08-19","text":"Excellent wings - but service is poor and so slow that we will not be coming back on wing nights (Monday).  May try another night as you don't really save that much during the wing special anyway!","useful":0,"funny":0,"cool":0},
{"review_id":"Chb2EniwYpj0nen9f9c58A","user_id":"ngw7uWJXbKLdig1Y8MP8LA","business_id":"jDJQyFETc8aTm89PG2mAIA","stars":5,"date":"2017-05-06","text":"This is the best coffee shop! I have been here several times and everything has been a 10 out of 10! Also, the sweet bread is amazing. If you want some great coffee drinks, come here!","useful":0,"funny":0,"cool":0},
{"review_id":"GqVN4xcsWWB5kdSmvn8uEA","user_id":"RAqF74UgnyTGGbS3gAMtJQ","business_id":"ItqPtxnayraXSlBS0EMOgg","stars":5,"date":"2014-10-19","text":"This is the best place I've eaten in Las Vegas...the food is so tasty and fresh. The menu selection is so good -- everything looks amazing. I ended up with the poppyseed pancakes with blueberry-ginger compote. It was large enough for two meals and it was delicious. My friend got the vegan carrot-coconut pancakes so I got to try them too --- they were so fluffy and yummy too. I also ordered the green juice and it was so GOOD. I think the best I've had yet. The service was good. I wish there was a MTO's in Portland. My only regret is that I couldn't stay long enough in Vegas to try out the whole menu. If you are into fresh healthy and delicious and creative food, don't miss MTO.","useful":1,"funny":0,"cool":0},
{"review_id":"iuVHqEglBCmL1lAbw8B2Ow","user_id":"WBKGxL53Tcq2_CkPavBYQA","business_id":"_JD_U3pZDynB6l8swzVlQA","stars":5,"date":"2017-12-17","text":"Had to switch barbers because I moved and the place I used to go to didn't take appointments. Great old school barber shop that does the straight razor finish. You can make appointments online which is really convenient especially since I work a lot and don't have a lot of free time. Boris always cuts my hair and is great at what he does and also consistent. I never have to worry if it's going to be a good haircut and I'm kind of ocd about haircuts. I would definitely recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"OrbMLefXfc4qLHgyx2H_0Q","user_id":"WBKGxL53Tcq2_CkPavBYQA","business_id":"UHFh-LI876tZEp8C_hq_zA","stars":5,"date":"2015-05-02","text":"I found Shayne on Yelp. She was friendly, knowledgeable and affordable. My taxes are more than the standard 1040 and everything went very smoothly. I would definitely recommend her.","useful":1,"funny":1,"cool":1},
{"review_id":"ZohRXd2MbwJD8QAtyPWAUA","user_id":"WBKGxL53Tcq2_CkPavBYQA","business_id":"mygLP5-SCnQwIev6LU9gWg","stars":1,"date":"2015-11-08","text":"I've been coming to George's for around 3 years since I live close by. However, I will never come back after the horrible customer service today. I ordered a gyro plate over the phone for take out. When I got there to pick up my food I looked and saw that it was a gyro. I asked to make it a plate and was told that I would be charged for a gyro platter in addition to the gyro I had in front of me because I said plate and not platter. I was told, \"we don't have a gyro plate, we have a gyro platter.\" I've ordered dozens of times before and have never had a problem with the nit-picking of plate vs platter. They could have just thrown a scoop of rice in the box next to my gyro and charged me a dollar more and I would have been completely happy. Instead they chose to lose a customer of 3 years.","useful":1,"funny":0,"cool":0},
{"review_id":"EeVl3cRcX4yymTqNLOQpew","user_id":"tUxeCQ6bjkHRxXXDeebRkg","business_id":"GajYufeDfsk4CoDCs3b6UQ","stars":5,"date":"2015-05-14","text":"I had my first pedicure ever here at 25 years old. I really enjoyed their attention to detail, I feel their prices are fair, and I've been looking for a nail salon in Las Vegas to go to consistently and the Yelp reviews helped to solidify my decision. I will be returning for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"dsCMwTWG3PBsLrDE83NnYw","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"Ki8seQY5mtXc36xjoMfeDA","stars":5,"date":"2016-10-21","text":"Honestly one of my FAVORITE stops for a bite along the strip!!! We started with the meatballs, which were absolutely delicious and served with great bread!! We split the Genovese white pizza - SPECTACULAR!! Highly recommend it. We sat in the outdoor dining area and had great service. All in all, good experience and we'll likely return!!!","useful":0,"funny":0,"cool":0},
{"review_id":"jKg-KyfK_V_8qCn52KdA7w","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"foQZ6guS0l49trURKh7vlA","stars":3,"date":"2016-10-21","text":"Stopped here for a snack while roaming the main drag in Vegas - candied bacon and cornbread app was delicious. The burnt ends and strawberry daiquiri....not so much. Burnt ends were not tender at all - ultimately inedible - and the daiquiri was out of one of those machines that are so popular on the strip, but it was so sweet and not enjoyable at all. Server was great, but likely will not return with all the other options!","useful":0,"funny":0,"cool":0},
{"review_id":"mAOMI_bYBKFDQEcks-g2CQ","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"YXohNvMTCmGhFMSQsDZq1g","stars":2,"date":"2016-10-21","text":"Stopped at Sprinkles for a $4 cupcake while cruising the strip. Gals working the counter were not overly friendly, it was more like I was inconveniencing them with my order. AND the cupcake wasn't good. Cake was hard and the icing was too sweet! With all the great treat options in Vegas, this one can be skipped!","useful":0,"funny":0,"cool":0},
{"review_id":"NFKgTzVRXiOqDTFv7LLfeQ","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"qKys2eEhVt5A7NUYMn7o7Q","stars":4,"date":"2016-10-21","text":"REALLY good burgers and open late which is nice for late nights at the Aria! Like most places in the resort, it is pretty pricey and with multiple burger joints in the vicinity I will likely try another one next time. As well, seating is very limited so if you aren't lucky enough to get a seat at one of the five tables, you're eating your $30 burger and beer at a slot machine!","useful":0,"funny":0,"cool":0},
{"review_id":"F78y643X8Ln7PYfbftIg6g","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"anQSLdujUOp0sTCmIBi2Tg","stars":5,"date":"2016-10-20","text":"Great first time at Piero's! Service and food were both outstanding. Atmosphere is nice - perfect for date night or a larger party of friends. Food - excellent! Husband got veal shank feature and LOVED it. Definitely worth the $17 cab ride from the fancy resort spots!","useful":0,"funny":0,"cool":0},
{"review_id":"-oxkRDrc6OLY6Qz5NoUHYQ","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"UT6L3b7Zll_nvRidijiDSA","stars":3,"date":"2016-10-20","text":"Stopped in to grab a snack and drink at the bar mid-day during our stay at the Aria - atmosphere is 5 stars for its trendy\/modern style and super friendly bartender. Drinks were fine, but overpriced even for a Las Vegas strip resort ($15 draft beer) and the food just wasn't good. Had a few small plates, most notable the meatballs tasted odd...not recommended. All in all there are so many good little spots in Vegas....this one can be skipped!","useful":0,"funny":0,"cool":0},
{"review_id":"IDTSPIKEcKHyGPii_F9NeQ","user_id":"3Kz12-pb8UgGG6jUJwcFNA","business_id":"SMPbvZLSMMb7KU76YNYMGg","stars":4,"date":"2016-10-21","text":"All in all, very classy place in the heart of all that's good about Vegas! Rooms are clean, modern and hi-tech! The resort offers multiple restaurants so there is something for everybody, and most spots are open to at least midnight. You will indeed pay a premium for anything purchased at this resort, whether it is a bottle of water, a burger or a beer - not that this is anything different from the other higher end resorts on the strip. The staff is all EXTREMELY friendly and attentive, but I recommend if you are interested in gaming you head to one of the other close spots - maybe Monte Carlo?? Aria only offered continuous shuffle blackjack and 90% of the tables open on a Wednesday night were $100 per hand - okay if you are winning, but we had absolutely no luck at the Aria with gaming! In spite of this, I would totally stay here again! :-)","useful":0,"funny":0,"cool":0},
{"review_id":"rv3h6nS7dXGlzg0Hje4lTQ","user_id":"lYXRVN2TJDEVB39G3HzplA","business_id":"4S358eahT9dfeKpnB1U46Q","stars":5,"date":"2016-10-19","text":"The APDO team is always great. Sharon is a true jem though! She always gets our daughter through the uncomfortable procedures with a smile! I would highly recommend APDO!","useful":1,"funny":0,"cool":0},
{"review_id":"Kf9pDS9YFi8xdkvud3N0bA","user_id":"lYXRVN2TJDEVB39G3HzplA","business_id":"YaP9eUQh4Jy_bbOID7f7iw","stars":1,"date":"2015-08-22","text":"The WORST!!!! Van Chevrolet is terrible. Basically lied to us in the sales contract. We'll never return and will seriously consider Ford for our next vehicle.","useful":5,"funny":0,"cool":0},
{"review_id":"M-0AaEDTwBSIv_HJu4-pjw","user_id":"lYXRVN2TJDEVB39G3HzplA","business_id":"ynyDiLHzTdf4du9xMhscxg","stars":5,"date":"2015-10-30","text":"Rachael is an artist! I've been going to her for years now and would not trust my brows to anyone else.\n\nHer studio is warm and relaxing! I recommend Rachael highly.","useful":0,"funny":0,"cool":0},
{"review_id":"UWmX8kZPk-thSV406Z2TrQ","user_id":"lYXRVN2TJDEVB39G3HzplA","business_id":"YkbNsO7zcwqa6BM_itutMg","stars":5,"date":"2017-05-13","text":"Mike and his team at Peak One completed a major remodel of our 1970's home last year. They were patient, professional and courteous every step of the way. The team expertly guided us through several complex issues that arose. We couldn't be happier with our forever home! \n\nWe'd highly recommend Peak One to anyone considered a remodel mo matter how big or small!","useful":0,"funny":0,"cool":0},
{"review_id":"qTP0OPWtuwAruThNlqChRA","user_id":"L_P5O39K7UAdqcF9N6J2Pg","business_id":"U0HoFQjSDwvggTs7elNHrw","stars":5,"date":"2014-10-21","text":"I have always gotten cheap haircuts (+\/-$10), until my SO convinced me it really wasn't a good idea anymore and I should try something new. We found This place here on Yelp, and figured it was worth a shot. \n\nI felt comfortable as soon as I walked in. They don't take walk-ins but they had a spot open in a half hour, so they slotted me in, gave me a beer, and I sat on the patio while the time flew by. The stylist was super personal and professional and asked me enough questions to figure exactly what I wanted, and then totally delivered. Included in the experience and price and was a wash\/rinse and a hand and shoulder massage which was unexpected but sorely needed. They even lined me up for another appointment in 5 weeks, which is turning out to be right on time. Total pros. \n\nI felt completely \"taken care of\" and would recommend 10\/10. Completely worth the considerably low price in every way.","useful":1,"funny":0,"cool":0},
{"review_id":"W-lndcsHMdXVLaVCqqyXEA","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"1uPQTz5XZSWr0ti7kUpaDw","stars":5,"date":"2014-08-28","text":"Great fried dumplings! Lots of choices for those that enjoy them fried or steamed or in soup. Quick service. Well worth the walk to China town. Only wish there was one this good in London, Ontario.","useful":0,"funny":0,"cool":0},
{"review_id":"QvnwUdzHcvtiYhWcA0QG7w","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"3IQPoS4vdNwHMa5vf3b1og","stars":5,"date":"2014-08-28","text":"This was my fave mean in Montreal. They started with a mint lemonade and a platter of pita with 5 dips. Dips were a fried eggplant, garlic hummus, beets, cucumbers and onions and feta in oil and a shredded carrot and rasin coslaw. The lunch was a choice between 2 kabobs of varying types, a schnitzel sandwich and a few others for 13.50-14.50 including the dips and drinks. It was 2.50\/person for more lemonade and the baclava was under 4.00 though they were out. The returant boasts all things are made from scratch in house down to the mayo. Everything was fresh and delish. The kabob choices fyi included chicken, a Persian beef, jerk chicken, fried feta, some sort of spicy sausage, falafel and more.","useful":0,"funny":0,"cool":0},
{"review_id":"KmKCR_cHmAYA12Uy3XPHCA","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"yQUXMWSA8H7wvkLa4iCD8g","stars":2,"date":"2014-08-28","text":"Rude waitress and slow service. No offers for upgrades like cheese on pasta or check ins on the food. Paper menu doubles as the placemat and you must seat yourself as well as add your own condiments one little packet at a time. Water was warm and waiters stood around chatting while our cups were empty. When tip was low due to mutiple failings the waitress thought it was her duty to advise us she expected 15% regardless.","useful":1,"funny":0,"cool":0},
{"review_id":"12BLr57t7oeymmxPqg7Imw","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"emATeZitKueZVziZFH6VlQ","stars":5,"date":"2014-08-28","text":"We had shrimp tempoura, some ciders, a beer, an amazing strawberry cheesecake, fish and chips made into poutine and a lamb burger with mushrooms and melted cheese (gouda or brie I think ) and poutine for about $80.00 before tip. Very kind and helpful server for finding good drink pairings and helpful suggestions without being pushy. Excellent quality and service.","useful":0,"funny":0,"cool":0},
{"review_id":"SnYKVAP7dVspScLnSLmuag","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"BkIZ8UDA23qxnp_kR1Sv8Q","stars":5,"date":"2014-08-28","text":"Wonderful service in both English and French and a very long list of options. Got a Californian inspired egg omelette with salsa, sour cream, sliced avacado, peppers and onions with a side of sliced and spiced potatoes and some fruit wedges. As a drink I got a banana chocolate expresso yogurt drink that woke me up good. All together about 21$ before tip.","useful":0,"funny":0,"cool":0},
{"review_id":"H3y99YMCGAJxl54Ms52tyg","user_id":"KeYB7tU5F5PFb7X1QoWJ6Q","business_id":"vYbpodi9utup_njMK5PAfw","stars":5,"date":"2014-08-28","text":"So much fun to watch them make the noodles in the kitchen while you wait. I wish I'd known it was cash only before going though. Spring rolls were tasty and crispy and well worth the $2.50 and the pulled chicken dry noodle was absolutely amazing. Lots of people at the resturant did not delay service one bit.","useful":0,"funny":0,"cool":0},
{"review_id":"AKAGnXPoeeqYwwSlemjSwQ","user_id":"8kQfdUVCahm0fEj5D-nPHQ","business_id":"7mOWMhlibS62hedb1m5A3Q","stars":5,"date":"2016-06-14","text":"Had a wonderful dinner!  The polenta fries are crunchy and the inside creamy.\nEverything was wonderful and perfect.   My sister keeps talking about the \"Old Fashion\" drink.  Just can't wait to come back to this gem!","useful":0,"funny":0,"cool":0},
{"review_id":"y_cNQlZuZ0GCCZ91GHiZjw","user_id":"BCYQnYTvMBfyI59IZAIYDQ","business_id":"ewaB15pbGAm02Vh4cyEvkA","stars":5,"date":"2013-07-09","text":"Professional and friendly, perfectionist, clean and spacious, affordable, and most of all PAINLESS!  These are the first things that come to mind when I think about my experience with Josalyn.  It's been a over a month since getting my eyebrows corrected and a week since the touch up and I am very pleased with the results so far!  I'll be having my eyeliner done by Josalyn in a few weeks...hope it will be just as painless.","useful":3,"funny":0,"cool":1},
{"review_id":"UV9ZAJvVDxxQlRdFxrUnTA","user_id":"soeGqjyRZm4uNkwg3naF_Q","business_id":"rsjrcxOIJm9VdkSNpkXZ9Q","stars":1,"date":"2017-04-06","text":"I asked the blonde waiter for a pepper, she replied in angry tone \"its all over there no need to ask\" food below average..","useful":0,"funny":0,"cool":0},
{"review_id":"8r0uk6oTbp9SyzWNdYqwlQ","user_id":"soeGqjyRZm4uNkwg3naF_Q","business_id":"WhkbE03YDs43jOjUhWKf_Q","stars":1,"date":"2014-09-04","text":"Big shock!! Went to this saloon after checking the reviews on yelp. I have med-length hair which i wanted to shorten\/trim a bit, explained that to the so called ''barber'' (second one from the entrance), he made a face like he understood. Bottom line, i left with an inconsistent short cut hair that i cant even pull back!! No single question from the guy as to whether he was cutting too much or not and i kept quite, wanna see to what extent this recklessness could stretch, really disappointing and shame on someone whose my father's age to have such a weak performance coupled with ignorance!!! All cared for was chatting n laughing never stop with some non-customers sitting on the side.\nConclusion: this shop is busy collecting money only, afraid of using blades n scissors, obviously because of lack of skills, all cut are done solely by machine which is a scandal in the world of hair styling, good for zero degree hair cut by machine which you can do your self at home. There isn't a rating i can give lower than 1. \np.s. This is the first time i review a service in my life.","useful":0,"funny":1,"cool":1},
{"review_id":"uVVTbHM128uXeV6StzfWBQ","user_id":"soeGqjyRZm4uNkwg3naF_Q","business_id":"GdiKn-JExlIHCQUDxQ9xgQ","stars":1,"date":"2016-11-12","text":"Waste of time and effort if one of your destinations is not Toronto, they provided the highest quote amongst 4 all based in toronto..","useful":1,"funny":0,"cool":0},
{"review_id":"1ZEcXtrvNLkQWUujPj7YbQ","user_id":"soeGqjyRZm4uNkwg3naF_Q","business_id":"J64Yg3hQJXSI-ipnfJUkiw","stars":1,"date":"2016-01-01","text":"I've rechecked and yes its your Co. check your records for cancellation # 80330, there you will find he charge, you can keep it and no need for the complimentary ride.","useful":8,"funny":0,"cool":0},
{"review_id":"mYIkKd1N2m8tplfRrXv5FA","user_id":"soeGqjyRZm4uNkwg3naF_Q","business_id":"FvG1Jw70RgCYW6fH99RdZQ","stars":1,"date":"2016-03-05","text":"This dude freaked me out; i walked in last week for a trim only an confirmed it, he removed 80% of my hair, cuts so fast so damage occurred from first touch; either he's deaf or doesn't comprehend..definitely not goin back, at least for his safety...loool","useful":2,"funny":1,"cool":0},
{"review_id":"CAJeQnYv-ONj5QmtuKhr-g","user_id":"FUiYhjKpNeCFKEH5kUJqNg","business_id":"flgxUeGy8xctqiykaMVOLA","stars":2,"date":"2015-06-17","text":"I want this place to do well, I really do! Delicious food (my sandwich was incredible), great coffee, pleasant surroundings and sunny. Here's the thing: the vibe is a bit strange. The owner (?) treats the place like his living room, blasting pretty bad music and loudly singing along. I usually go to cafes to read, hang with friends and chill out, but the atmosphere was kind of aggressive with lots of dudes taking up a lot of space. Wasn't so comfortable. Still, I'll  give it another chance since the food\/drinks were so good.","useful":0,"funny":0,"cool":0},
{"review_id":"2-gx3xlluBxk7MzSoj1y3g","user_id":"FUiYhjKpNeCFKEH5kUJqNg","business_id":"seDuOOv4W3_fgFD7iMKhKw","stars":2,"date":"2016-03-18","text":"Not such sweet service! I really wanted to buy a new bike today but the guy that I asked for help from was so indifferent and dismissive that I decided to wrap up the conversation quickly and just go someplace else. It'd be a great idea to have a staff retreat focussing on customer service.","useful":3,"funny":0,"cool":0},
{"review_id":"0vyBnHrPEsBpttfXARRfUw","user_id":"FUiYhjKpNeCFKEH5kUJqNg","business_id":"sb6Pa8mzGvOYMMVnkNJMNg","stars":4,"date":"2016-06-14","text":"One of the most wonderful Thai massages I have received in Toronto. A beautiful space and my therapist was focused, attentive and very effective in relieving some back and neck pain I was having. A truly amazing experience.\n\nMy *only* complaint is that is seems strange to tip an RMT -- I consider this a medical service, and it makes the price prohibitive for some when you include tax and tip on top of the base price. Otherwise, highly recommended.","useful":3,"funny":1,"cool":0},
{"review_id":"JN4pbJwgfuMDjxRqlmSpgQ","user_id":"ow59AdJOYJ2HMCjhk9ST6A","business_id":"qW2b58OyrQ8L7YBkeXKUTg","stars":5,"date":"2012-03-07","text":"We used Bouncy Bouncy Inflatables for my son's 2nd birthday party and then again a couple weeks later for a neighborhood party.  Both times, the bounce houses were clean and in great condition.  \nIt was an easy, no hassle, and positive experience!! Would use them again in a heartbeat!","useful":0,"funny":1,"cool":0},
{"review_id":"-CM8kfK9A6fQt54SiGo6og","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"fI9ErCUGY8rXRPBbatcxMA","stars":4,"date":"2011-10-27","text":"I can't believe I haven't been here before! What a cool place, as everyone else has said, you basically cross off what you don't like and they make everyone at the table a different meal for each course. It was an excellent meal, and everyone had a great time! I would probably give it a 5 star rating, but I really didn't like the kangaroo I had for my main course.  I've had other gamey meat like ostrich, bison, etc.. but it was never tough, this was really tough meat. Started with the Cucumber Mint Refresher which was excellent!","useful":0,"funny":0,"cool":0},
{"review_id":"xP7_e9WqGUGwLB8AW1w0Kg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"NJ0RzuWd5xDqfJejYQZ65g","stars":5,"date":"2017-05-13","text":"Great place for those who are eating carb-free (low carb), got the Delux Burger with a lettuce wrap, and the tomato salad as my side.","useful":0,"funny":0,"cool":0},
{"review_id":"RUlLxa3kaM6ooT7VDibcSQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"tTR9GQbdC-rEHNsECmSWRw","stars":1,"date":"2011-05-08","text":"I can't believe anyone thinks this is the place for brunch! The food was ok, and the service was slow.  We arrived for Sunday Brunch booked on Open Table, and found out that booking brunch on Open Table actually gives you the \"breakfast\" buffet, which is really nothing special (the free hotel buffet at Hilton Garden Inn or Holiday Inn Express is just as good and fresh). You needed a steak knife to cut the over done sausages (Denny's has better pancakes and sausages at 1\/8 the price). We got a great view with our table facing the door into the hotel, not the beautiful grounds (I guess they try and jam more tables in for the brunch). The breakfast buffet at the Westin Kierland is 100 times better than Rita's, with fresher food and a much better selection. The front staff was totally apathetic and showed very poor customer service training. They blamed me, not Open Table, for booking breakfast (even though I explained I clicked on the brunch category and link).","useful":0,"funny":1,"cool":0},
{"review_id":"y0Uh8FrVVDyUrSnHyd11DQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"m5niZy68d2gTtVWz89elfA","stars":5,"date":"2010-04-29","text":"Checked out their website (www.slidinthru.com) for their location, and they were about a 5 minute drive from the strip so we headed to meet them.\n\nThe menu looked so great we ordered one of each!  They also made some custom, cheese & lettuce sliders for the kids. My favorites were the Kalbi Rib, Captain's Order, and the Barbie. But I do have to say the veg one was also a winner.   The buns were a perfect match, and they were grilled to perfection.   \n\nThis was the best (and by far the cheapest) meal we've had in Vegas (this certainly blew away the crappy lunch buffet we had on the strip). I've had sliders at many different restaurants around the country, and these were by far the best!","useful":0,"funny":0,"cool":0},
{"review_id":"uzWphBq1s2B47CXNfLGVLQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"7pGWy3mR7gjMSE6x2njqPA","stars":5,"date":"2009-08-26","text":"I've had both breakfast and lunch here (yes in the same day), both were amazing! Service was great, and fast (I went there on a Friday morning). For breakfast I had the mushroom & cheese stuffed omelet smothered with a sherry cream sauce, served with olive bread. VERY rich, but delicious.   They always give me a cup of coffee to go, love their attention to detail. For lunch I had the Arrogant Bastard Burger (local organic beef from the Stockyards), very tasty & huge.  They have free wi-fi and covered parking next door in the parkade.","useful":2,"funny":0,"cool":3},
{"review_id":"ChZz25DrnfO6KOBiEUrz5A","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"U7fZfH9C4hj5BFRYaPOo2w","stars":5,"date":"2010-12-09","text":"Had a dinner party here in one of their private dining rooms.  The food, drinks, and service were all outstanding.   Started with the calamari, Antipasto (w\/cured meats, artisan cheese, marinated olives, Marcona almonds, quince paste and flat bread), Crispy Calamari with aioli and \nLamb Merguez Sausage; followed by the Caprese; mozzarella, tomato and basil; and for the main course I had the Flat Iron steak, fingerling potatoes, shishito peppers, piperade sauce (cooked perfectly).  I finished off my meal with the Julia Baker Chocolate Mousse Cake.  I have to say everything was 5 star: food was fabulous, service was excellent, I'll  certainly be back again!","useful":0,"funny":0,"cool":0},
{"review_id":"XYb0DrC-DD9fp1yh3eQRbw","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"B8zMmUlCIX7Ts8VSgy9B-A","stars":3,"date":"2016-10-25","text":"The burgers seem smaller than I remember, and the prices are NYC prices ($18 for a burger, fries and tiny custard). As others have said, the place is way over priced. Food took way too long for the 2 people in line before me. I did like the burger, and I liked not waiting in line for an hour like you need to do in NYC, but still not doing it for me.","useful":1,"funny":0,"cool":0},
{"review_id":"cJiTZ5ld7Bt6bj9XyKJZdQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"UE3AvVnaPEBPneVahYT2eA","stars":4,"date":"2009-08-26","text":"Great place for happy hour! (4-7pm). I've had both the triple sliders and the half-rack ribs (on different days btw). If you near 101 & N. Scottsdale near happy hour, this is the best place in the area to eat!","useful":1,"funny":0,"cool":1},
{"review_id":"vp0adLbIlf3RBESXzomZrg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"-050d_XIor1NpCuWkbIVaQ","stars":5,"date":"2009-08-29","text":"One of the best breakfast places in Phoenix. Arrived for a late Thursday morning breakfast (11am) and only had to wait 5-10 minutes. Server was friendly and I had the chorizo scramble special. It was great! Very tasty and flavorful. I am one of the pickiest breakfast eaters (i.e. I don't really consider US Egg & Denny's breakfast places). I expect my eggs and all the ingredients to be fresh, and that was certainly the case at Matt's!! This is one of my two favorite breakfast places in the valley (for different reasons, I consider Matt's and the Orange Table to be complimentary).","useful":0,"funny":0,"cool":0},
{"review_id":"PJR5Q9mdFoRM-Y8vAt5npg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"aD-YA02i2xAqLBDon1tzIQ","stars":4,"date":"2009-08-26","text":"Great restaurant!  Love the Sunday set menu, and $5 wine.  Certainly one of the better restaurants in the Scottsdale\/Phoenix area. Food was great, great atmosphere, Elliot is the man! Been back twice.. with consistent service & food.","useful":4,"funny":0,"cool":4},
{"review_id":"rJnlsYplbnfyQyucVGNqsQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"QS3QxI7u5PRdtbGgI0-UsA","stars":5,"date":"2010-06-07","text":"Had the Salmon & Tuna sushi and is was amazing. Some of the best sushi I've had in the Valley.   The sushi was generous, and very fresh (can't really ask for much more at a sushi place).  The also seem to have an assortment of rolls that are on special from Sunday-Thursday night, but the sushi was so filling, I couldn't eat any more.  The place was very busy, and the staff was very attentive.","useful":1,"funny":0,"cool":0},
{"review_id":"Zbtcd8lqXmOFJycOB0dkpw","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"YPavuOh2XsnRbLfl0DH2lQ","stars":3,"date":"2010-06-07","text":"Arrived around 5pm one Wednesday evening. The place is not in a nice area of Phoenix, and it looked deserted, and I was going to leave, when I saw a Mercedes and Lexus pull up.  So I thought I'd give it a chance. The prices were somewhat reasonable, I got the Lo-Lo's for $11 (2 waffles, and 3 pieces of fried chicken). The food was tasty for what it was, but I only give it 3 *'s because its just so unhealthy.. kool-aid, waffles, syrup, and fried chicken! This is the kinda a place I may go once a year, but I just feel so guilty!  Not sure what the syrup was, but it certainly wasn't real maple syrup (I'd imagine it is some sugar based creation), and the waffles were dry. The chicken wasn't very moist, it was also a bit on the dry side.","useful":1,"funny":0,"cool":0},
{"review_id":"U56bIHG_4aERlkm1pg0zcg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"33aT8mN5sshpmNReMeuiZA","stars":5,"date":"2017-02-10","text":"Most authentic Indian food in Calgary, and best of all it's in the South! We've eaten here 4 times since December,  everything is delicious,  and generous portions. I particularly liked the paneer,  naan,  lamb, butter chicken, and vegetable dishes (haven't had any of the fish dishes,  so I can't comment on them).","useful":0,"funny":0,"cool":0},
{"review_id":"Min1d0Wn44XFEIErUKdf9g","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"89uU51kOiQXbJHVA3C6XMQ","stars":5,"date":"2010-06-07","text":"The place is a hole in the wall right behind the PHX car rental center. Arrived at dinner time, and had the best Mexican food! I had the #5 Machaca Plate w\/rice, beans, & one of their homemade tortilla's burrito style. It was just amazing, and so cheap ($5.65). The only issue I have with this place is that its very well used, and looks very dirty, I did find it a bit sticky. Maybe this is a better place for pickup.  If you want a clean restaurant, their North restaurant on Cactus Road restaurant is much cleaner.","useful":2,"funny":0,"cool":0},
{"review_id":"XvgvW58TPunE9J3sRCd17w","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"DymZ5vpm7vkSsR__-4sflw","stars":4,"date":"2010-06-07","text":"This place still rocks for happy hour which now runs from 5-11pm daily. The Kobe beef burgers are only $2 and the Roka hamachi serrano chili rolls and butterfish tataki are both amazing.  Kirin and sapporo are $5 for a small bottle, $8 for a large.","useful":2,"funny":0,"cool":2},
{"review_id":"5ORTSbv3xlpeV6_4axarKA","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"kUuJ8TDXWz8J2Tnz2sqtuA","stars":3,"date":"2011-10-27","text":"If I could do a 3.5 star review, I would, it's more than \"a-ok\" but I wouldn't say \"yah I'm a fan.\" I think the place was only opened a few days, I would also rate it higher if they had it staffed properly. Arrived at lunch, and the staff is in \"training\" mode so it took forever for them to take the two orders ahead of me, and the line behind grew very quickly.  If the service was quick, then I would certainly rate it a four.  Had the \"Bueno Burger\" with jack cheese.  I think this is something else I don't like about the place, you need to add .75 for cheese. I'd prefer if they included cheese with each type of burger. The burger was certainly good, not sure if its as good as Smash Burger, but certainly in the same league (not a comparison to Delux).  Burger was tasty, would certainly go back if I was in the neighbourhood and felt like a burger.","useful":0,"funny":0,"cool":0},
{"review_id":"7uNZxWVcmH8IUg8w33JWqw","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"rxjHvIvV_BlzKa8ftRUpGA","stars":4,"date":"2010-06-08","text":"Been to the one on South Beach, and the burgers and fries are just as good here!  My only complaint is I asked for ketchup, and they absolutely drenched the burger! (eeew).  After scraping off a 1\/4c of ketchup the burger was fantastic, much, much better than In and Out Burger.  I did remember to order the regular fries (which is enough for a family with small children).   The fries here are the BEST!  Nice to see an alternative to In and Out Burger.  I think the burger and fries at Five Guys Rock!","useful":1,"funny":0,"cool":0},
{"review_id":"jG9fhAxRM8017i_l3EWq7w","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"IsoLzudHC50oJLiEWpwV-w","stars":4,"date":"2011-05-06","text":"Just had an early dinner with the kids tonight (kids eat free from 3-6pm btw).  I had the prime rib and my wife had the fish special, kids had the mac and cheese. All were great meals. The reason to go here is to sit on the patio, it's fantastic!  Not impressed that at 5:30pm I had to valet, when I'm with the family, I'd just rather park and walk (needed to walk off the prime rib and wine anyways!).  This place is not cheap, and with $18 glasses of wine, there is no happy hour at the restaurant!","useful":1,"funny":0,"cool":0},
{"review_id":"YXIoe1ZzBtanheNoYGaApQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"TkEMlu88OZn9TKZyeY9CJg","stars":5,"date":"2010-06-07","text":"First time to this restaurant.  I think the \"steak house\" thing was over done, but I'm happy I went here.   I actually split the 8oz petite filet (mignon), it was probably one of the best steaks I've ever had.  The sides come family style, and we shared the sauteed mushrooms, asparagus and spinach, all were very good (and I'm sure loaded with butter!).   Great place, be prepared to valet.","useful":3,"funny":0,"cool":0},
{"review_id":"RDmLD_illi2Nx5tSRC9dHg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"P8IsTiHq5Hesa6UPL604ww","stars":4,"date":"2011-05-06","text":"I did catch an episode of Diners, Drive-in's, and Dives and since they did get Matt's Big Breakfast right, I was hoping for the same for this place. I have to say the Bombero burrito rocked! It was so tasteful with the right amount of heat (certainly not 5 alarm, but nice), and other Mexican spices. The kids had two $1.15 taco's each which was the right amount for them (if you're an adult, I would probably get 4). The place is tiny, not the best setup, but the line moved fairly quickly.  I'll certainly be back, it ranks up there with Carolina's as one of my ATF for Mexican in the valley.","useful":0,"funny":0,"cool":0},
{"review_id":"fzOTwVs1s6CPrKZO3la9fQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"W2CzAePJakvARgoQuohbOA","stars":4,"date":"2011-05-06","text":"I eat here a regularly, but realized I've never given them a review! The menu is simple, and if you want a \"fast food\" burger this is the only place to go.  I typically order the double-double w\/o the (thousand islands sauce) and onion (this saves not only by breathe, but about 200 calories), and have them add ketchup and mustard. I do have to say the fries are just ok (5 Guys' are much better, but then they are 1400 calories for the large, so I'll eat these ones and be happy my waist is not expanding).  Always lined up during the busy hours, but the line does move fairly quickly.  Just a great burger!","useful":0,"funny":0,"cool":0},
{"review_id":"h20p2FwX1EySABkRHbNENQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"D3dAx-QW_uuClz4MambeHA","stars":2,"date":"2011-05-06","text":"Been here many times for breakfast, the place is a zoo, but it is sort of a controlled chaos, but tonight it was just a write off. I don't know if they were short staffed, but a quick coffee, turned into 20 minutes, then we were told to go stand in line again (10 deep) at 7pm?!?  Extremely slow service, so if you want a quick coffee in the evening go somewhere else, but they seem to have morning coffee figured out!  Of course the parking is the usual :(","useful":2,"funny":0,"cool":0},
{"review_id":"zNRUHAL65GsLzAHzQusiyQ","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"-rhH9sL3XGFpoJXcxUpEWA","stars":4,"date":"2010-10-26","text":"Stopped by for quick dinner at the bar (burger arrived within 10-15 minutes which was great). I wanted to change up the cheese with Manchego instead of American, so I chose the Zinburger with Manchego Cheese & Zinfandel Braised Onions (w\/light mayo).  Overall a great burger, I just thought the onions overpowered the cheese. Great staff, very friendly,  and I will certainly come back and try out the Samburger (which I was told is one of the more popular burgers).","useful":1,"funny":0,"cool":0},
{"review_id":"pXOsppHOsoVxVvWULXdZbg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"e1i5mbYpFV8rQtfqtVwq3w","stars":2,"date":"2010-12-09","text":"I've never been here before, so I thought I'd check it out. My usual breakfast places are Matts Big Breakfast, La Grande Orange, and Orange Table which I think are all outstanding.  Had to wait a bit for the coffee pot to arrive, which was surprising since it wasn't that busy.  Coffee was terrible, typical truck stop stuff. Had the special, San Antonio Skillet (potatoes, red bell peppers, green chilies, diced chicken, jack, eggs, sour cream & cilantro. The chicken was tough and chewy, must have been left overs from yesterday.  Food took a long time to arrive, and was not hot. Service was so-so (waitress certainly wasn't enthusiastic), This place is akin to a typical tasteless truck stop breakfast joint, If you want great service, tasty, fresh food go Matt's, La Grande Orange, and Orange Table. This place is around the corner from where I live so it's very convenient, and I'll probably be back to check out one of their Benedict's since many reviewers said they were great.","useful":0,"funny":0,"cool":0},
{"review_id":"OzN5u9tv2GbhfbMxf_qCzg","user_id":"LBweMNqEoQi9_-7HhNcWQg","business_id":"luI3vBj9ciPBWT2bQ7dXXg","stars":4,"date":"2011-05-08","text":"This was a very good burger. I ordered the 1\/3lb Arizona special with a fried egg. They cook their Angus beef burger at a high heat with a crispy finish, and it tasted great!  Also ordered a side of their herb yam fries which were very good.  They also have Tazo iced tea, which was a nice touch. This location is a bit of a pain, since there is no free parking (it is in a parkade, so you can get some shade by parking in there). The burgers are $5.99 with an extra $1.99 for fries or yam fries.","useful":0,"funny":0,"cool":0},
{"review_id":"JJGeVtXAA8hy9b0CmUGMYA","user_id":"ECcwzgwJ70YKiJigkAL6tA","business_id":"ggqmML5wN5RFv5QtHQw4iA","stars":5,"date":"2016-07-11","text":"Tasty but price. Not a cheap meal, but I did eat there twice in one day. I might stop by one more time before I leave Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"8CoHbx0lS4y1GTPz5PKeFQ","user_id":"uENOUpv2xIBHWIyOUMgKJg","business_id":"cYwJA2A6I12KNkm2rtXd5g","stars":5,"date":"2017-01-22","text":"Me and my wife decided to try Ramsey burgers and let me tell you they are really good you cant put a price a excellent food. Not to mention the sue chef Daniel Takes pride on his works he make sure we where happy with our burgers. I do recommend Ramsey burgers any time of the day.","useful":0,"funny":0,"cool":0},
{"review_id":"futrihea28DtW-FWo7LFpA","user_id":"RpOr_VGfaRAKZuvbwYJFPw","business_id":"hbpqOwr5-k8qCJXHmJYkzQ","stars":5,"date":"2015-06-06","text":"I've been working out at Pure Barre Glendale for about 2 years now and it's hands down the healthiest addiction a girl can have (I've never been this toned and strong!!!) From the first class to over 500 classes it NEVER gets easy, you only get stronger and discover new ways to challenge yourself. Pure Barre targets your full body, all the areas that every girl wants to tone up. It's an hour spent working hard to amazing music with WONDERFUL teachers who motivate and inspire you to push yourself past your comfort zone. A nice bonus, ALL the clients that attend the classes are the nicest people which makes for a place you always look forward to coming back to. It's a great workout for anyone. Any age, fitness level, someone who has a lot of dance experience or absolutely none. I highly recommend Pure Barre to anyone looking for a way to tone your body, build strength, all while making lifetime friends. \n\nTip: Commit to at least a month at Pure Barre (try 4 classes a week) because it just gets better and better the more you learn the technique :)","useful":0,"funny":0,"cool":0},
{"review_id":"Ij_B9En7jAPaQQASr-kYPg","user_id":"ZS3lcqsK69pJXAwvD8fj5A","business_id":"SAIrNOB4PtDA4gziNCucwg","stars":2,"date":"2016-07-16","text":"Not impressed.  I had heard so many good things about this spot, so when an aquantience was having a \"thing\" there I took time and money out of my personal accounts to join the party. What a waist. I was very disappointed. The dinning room had way to dark \"mood\" lighting (we could barely read the menu and everyone knows dimness vails flaws), the waitress was annoyed, snarky, the crab cakes were super fishy. I had to spit them out in the bathroom to avoid food poisoning. The mashed potatoes served with the over priced surf & turf had to be instant! Although I can't be positive about the mashed potatoes, the texture and flavor definitely tasted like it. There is no outdoor smoking area, you can't take your drinks outside (laws and all). The dinning area was claustrophobic and they wouldn't split the check (understandable, but still annoying). Overall, not the best experience. My suggestion, if you're someone who prefers quality over quantity (cheap happy hour), this is not the spot for you. Save your money. Go somewhere with more integrity. Somewhere that doesn't insult the intelligence of its patrons. Really? Instant mashed potatoes with surf & turf. Tacky.","useful":0,"funny":0,"cool":0},
{"review_id":"eIO6v5UUbd01QIidtsQ-BQ","user_id":"YVBzFKNTOysdAfJtQhQD2g","business_id":"hfQWA7u_iM49E-3Ti4b2AQ","stars":5,"date":"2016-03-31","text":"I was on a girls' weekend trip to Montreal and we had one vegetarian and one vegan with our group. We were just wandering on our way to the train station and came across it. Even if you aren't a vegetarian or vegan, it's still delicious. They have soups and a salad bar, so it's perfect for a light lunch. I had a tomato soup and salad and it was delicious. They also had cooked food- like vegetarian shepherd's pie, spaghetti squash pasta, roasted veggies, along with desserts, juices and coffees. The setting was lovely, the staff were nice and it was very clean. There were also big windows, so it would probably be perfect for a sunny mid-day coffee and snack or slow, light lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"qZoukes3nyiSYeyuvzAFYw","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"dLc1d1zwd1Teu2QED5TmlA","stars":3,"date":"2014-08-26","text":"We had a solid experience here- the food was a great price, the atmosphere is great, loved the decor & I'm a fan of a simple menu. Our waitress was nice & informative but unfortunately the fact that no one at our table could enjoy their meal because of the spice level was a little bit of a damper. We all like spicy food and ordered 1's & 2's on a scale of 5 but our food was literally covered in red-pepper flakes :(  Again, I'm no wimp to spice- I'm the girl who is usually dumping tabasco on my food but this was a whole other story. \n\nWe will give it another shot because it really is a neat little spot and what we could taste of the food was definitely solid.","useful":0,"funny":0,"cool":0},
{"review_id":"y6U3MsZkHzlOdi1exexeag","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"Rwahe1zbFpw6VIjb5ngZeg","stars":4,"date":"2014-02-10","text":"A good mixed crowd age wise which is nice- mostly people who like good food and want a nice dinner out- not too fancy but nice enough. \n\nThe free bean dip\/bread is a nice unique offering. The garden side salad was yummy and different than what you'd typically get. The quinoa puff appetizer was good but nothing compared to the ginormous pork chop on top of goat cheese chive whipped potatoes I got- deliciously prepared. My hubby got the crab cakes and risotto which was equally as amazing. \n\nWe really were impressed with this place- I think it is totally flying under the radar for how solid it is. We will definitely be back but hope the menu changes up every once in awhile as there aren't a whole lot of options. \n\nMy one suggestion- educate your servers about gluten allergies- it's a pretty common question, especially in fine dinging and my server had absolutely no idea what gluten even was.","useful":0,"funny":0,"cool":0},
{"review_id":"xKK-xfA8AcdZKmWF5Z0__Q","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"GAmd3nHx5TInVN26PLZj7g","stars":2,"date":"2014-02-10","text":"I really wanted to like this place- the decor was great and the menu had some nice diversity but there were just some things that I think should have been done a lot better- especially for the price & hype that surrounds UP. For example: \n\n- The salumi & chese plate was blah blah blah. The 2 different cheeses literally tasted like...well, nothing. It's not that hard to find a good cheese in Pittsburgh- just go down to Penn Mac and get something to make it worth the $.\n\n- My scallops were tasty but cold. My husband and I were there for an early dinner and were one of the only people in the restaurant so I don't understand why it was so hard to make sure our food was hot. \n\n- Finally, I understand toddlers are hard to control but when you have parents that are literally encouraging their child to crawl around on the floor like a gorilla (their words, not mine) and screaming\/playing right next to people who are out for a nice dinner and paying a nice price, I would appreciate someone asking the parents to at least not encourage their child to treat the restaurant as their playground. \n\nWe've only been there once but unfortunately I think the hype that surrounds up be just that...hype.","useful":1,"funny":1,"cool":1},
{"review_id":"FNGnQE4yle0yL_DN3mkhaA","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"Toux3q1WwY2vNV5AhbR6wQ","stars":1,"date":"2014-08-26","text":"My husband and I decided to try Cibo as it was part of a \"discount card\" fundraiser we had signed up for & when I looked at their website\/menu online, they identified themselves as \"gluten free friendly\" and more than happy to accommodate any allergy\/dietary needs and as a GF girl, anytime an Italian place says they have GF pasta, I'm pretty happy! We dined on a Saturday evening, with reservations. \n\nI usually try and keep it pretty positive when it comes to reviewing restaurants but our experience was the complete opposite of positive and I hope some changes can be made their in the future because their food had some great elements & their owner was nice but other than that....ugh. \n\nWhen I mentioned that I am GF and asked if I could get the Chicken Parm but without breadcrumbs (which I would normally not even think to ask for but since they had identified themselves as being willing to accomodate allergies I went ahead and asked), I was told the chef \"is busy and wouldn't want to do that but that he could just put some grilled chicken on top of the pasta but she didn't want to ask him to make it \"parmesan\" style, even though I'm pretty sure that would just consist of putting some sauce and cheese on top. I can understand when things are busy it is hard to accomodate special requests (even simple ones like mine) but as a customer (who is paying $20 + for dinner), I don't think I should have to worry about if my order will stress the chef out. Either don't claim to be GF friendly or get some more kitchen help? In the end, I ended up paying a pretty high price for noodles, marinara sauce & grilled chicken :( \n\nOur waitress only smiled when she was dropping off the check & we only smiled when we could finally leave.","useful":0,"funny":0,"cool":0},
{"review_id":"ncq_qAmxiXfGIyxRLdQQSA","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"Ve6bA_jf9A7EWKXeyWf7PA","stars":3,"date":"2014-10-27","text":"My husband and I have been wanting to try this place out as we don't eat gluten or dairy and they offer gf pizza & vegan cheese, which we are thrilled about! We ordered a pizza and wings and I will say that we both agreed they tasted great- no complaints there. However, there were 2 big issues we had with our experience: 1) They only offer 1 size of gf pizza; for an average pizza place this might be understandable but when at least 1\/2 of your advertising efforts are put toward claiming to be \"allergen friendly pizza place\"- it should be expected that you offer more than one size pizza as my husband and I splitting 4 slices was pretty disappointing...so why didn't we order a 2nd pizza? Well, that leads me to the 2nd issue- the price...$24 for a small pizza (4 small slices) and 6 wings is MUCH MORE than a little on the pricey side. Again, while the food was good, with all the GF options coming available now, we will spend less $ getting more pizza elsewhere. \n\nPlease lower your prices & offer more than on sized pizza Mandy's because we'd really like to come back!","useful":3,"funny":0,"cool":1},
{"review_id":"AFSI_dqTTebrAYczbePSYQ","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"CrDHpkNGyHUgLAMynKfBZA","stars":5,"date":"2014-08-26","text":"Honestly, this has got to be one of the BEST things offered in Pittsburgh! My hubby and I have been wanting to try zip lining so when we heard about Go Ape and that it was a little more than just zip lines, we were excited...and nervous! Needless to say, it was a blast! Everything is well organized and they give you instructions that make you feel comfortable but not micro-managed. \n\nIt was the perfect length of time (about 2.5-3hrs) and had a variety of of activities that kept things interesting & fun. We seriously cannot wait to bring some of our friends here as it would be a great activity to do with a small group! \n\nMy only word of caution is that I would say if you aren't in good physical shape this could be challenging as pulling yourself up a rope ladder isn't as easy as it might seem but by no means do you have to be in peak physical condition to enjoy this. Such a great time!","useful":0,"funny":0,"cool":0},
{"review_id":"K3o8csIx3H_zx4LsiRBRsg","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"M70Jr9yUWCDfoTsZS3uq7A","stars":5,"date":"2014-02-10","text":"I. love. Eden. \n\nWhy? \n\n- Great service; they are always knowledgeable and don't look at you like you have 3 heads when you ask them about their ingredients or mention your food allergy. \n\n- It's small, intimate, clean & simple. \n\n- The food is DELICIOUS. Even my husband who is the farthest thing from GF or vegan absolutely loved everything we ordered from the raw menu. In my opinion, their chef is one of the most skilled I've ever encountered because they are making delicious dishes that you don't at all feel like you're missing out on stuff from (as you sometimes do with GF\/vegan dishes). \n\n- Everything is fairly priced for what you are getting. \n\n- Their raw desserts are AMAZING and have no added sugar! \n\nI love love love Eden- I only wish they had more hours & more locations :)","useful":2,"funny":0,"cool":1},
{"review_id":"Qz8iXAbC6G1qkTAlKO0KUw","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"4CE_jyoNwSYkorer13G5OQ","stars":4,"date":"2014-08-26","text":"We love this little Mexican joint! Much more authentic than Emilianos & we love their chorizo, carnitas & crab options! The servers are always friendly & it's a fair price. Me gusta El Toro Loco!","useful":0,"funny":0,"cool":0},
{"review_id":"1RtcR_1ifqVyLwr4loVMGQ","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"9gNko6cFCMZbvy1zhJ7-Xg","stars":3,"date":"2014-08-26","text":"- The sushi was incredibly fresh & top notch as agreed upon by everyone in our party- the best sushi we've ever had. \n- The atmosphere\/decor leaves a lot to be desired- with how good the food is (& what their prices are), they could try a little harder (and put some cushions down on their hard benches- our tushes were not happy at the end of our meal!)\n- We could tell our server was new & everyone has to learn so we gladly cut him some slack on not quite knowing what everything on the menu was.\n- Our biggest qualm was that it took FOREVER for our food to come out and it was a Thursday early evening with not that many people in the restaurant so that was a little strange. \n\nOverall, a good place to go if you want really good sushi but I think there's still lot of room for improvement as an establishment as a whole.","useful":0,"funny":0,"cool":0},
{"review_id":"AcTcXYJsEg95Rek3qUriEA","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"bm8-Kriygv-R8DVCmKzoOw","stars":4,"date":"2014-08-26","text":"- Love the layout and look of everything- bright, clean, open, modern, simple. \n- Hubby and I went on a Friday morning for breakfast and the menu was simple yet sufficient. \n- They gladly catered to our dietary\/allergy needs- THANK YOU! \n- The food was yummy & the service was great, we will definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"7lGsC4lUOPtwnRak2NbWUQ","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"XuvmzFC-_mmSymB-aYurpg","stars":2,"date":"2016-01-27","text":"First, I'll say this place does have a few good points:\n- Aesthetically it's beautiful- very posh, well decorated and a pretty relaxing atmosphere. \n- It was easy to locate and had plenty of parking. \n- It was easy to schedule and the staff were all friendly enough. \n\nHowever, the thing that brought me to write this review is the quality of the massage I received. While the therapist I saw today was super nice, I honestly feel like I just got oiled rubbed on my skin for an hour. While I can only hope that if I had requested a Deep Tissue massage over the Swedish that it would have been more worth it, honestly- the pressure was non-existent. \n\nWhat was even more upsetting to me was that the whole reason I went in for a massage was because I was having some neck issues and made sure to make it known to the therapist before the session began that was what I wanted to focus on...and she basically just did a typical body massage. I've had many massages and that's what she did- no focus on the area \/reason I went in there in the first place. And the fact that I paid $70 (not including tip) for this makes me uber regrettful. Sure, I could've complained and tried to direct her movement and pressure but you don't pay that much money to go in there and do that. \n\nI feel like this place has a lot going for it but I think it would be greatly beneficial for the therapists to do more of a \"consultation\" with the client to see what it is they want exactly and then make sure they stick to that.","useful":5,"funny":0,"cool":0},
{"review_id":"Tu05s9ydCMQ3uUNBBmeOUA","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"bdNyoXY4yJ99derJRqhP3Q","stars":5,"date":"2013-08-22","text":"I made reservations for a larger party in this small-ish restaurant for my hubby's bday; I will be honest I was a little nervous given some of the negative reviews I had read that called this place uber hipster and snobby but let me tell you, I was no disappointed with our visit! \n\nWhy Cure is hands down one of my new favorite restaurants: \n- The atmosphere is great- super rustic, unique, woodsy, creative- they have put intention into every detail and it shows. \n- The salumi plate was SO good; however, while they did great at explaining what each thing was there were so many options that our party didn't know what we were eating at any given time; maybe put little flags in each choice so people can know what they are eating...? \n- The food was DELICIOUS; in our big party we pretty much tried everything on the menu and everyone was blown away. \n- They were great about plating\/serving our cupcakes; I was a little put off that they told us (multiple times) that they were going to charge $2 per person to serve the cupcakes, which I find to be a little ridiculous when you're already bringing in a party of 7 with $30 entrees each, but in the end they didn't end up charging us for it. \n- The service was friendly, attentive and knowledgeable. \n\nNeedless to say, Cure is doing a great job and they provided for a wonderful birthday experience- I can't wait to go back again.","useful":3,"funny":0,"cool":1},
{"review_id":"2l4CQWGgs91i1mSZOmeIVA","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"vcsisb4AxeDuDFnnjLfe1A","stars":5,"date":"2015-02-23","text":"I love this place- it's everything I want in a spa. It's beautiful, calming, clean and modern without making me feel like I'm in a Buddhist temple. The therapists are always great and professional and the prices are average. My only complaint is that my last therapist talked to me the entire time and I would have preferred to just veg out but other than that, I have nothing but love for this place!","useful":0,"funny":0,"cool":0},
{"review_id":"2SZRx76MYq00rC7ZQcxdZg","user_id":"pTGVqTpsPffvwII5EsGvaw","business_id":"wdwODzBChLIh_u8V8CPpyA","stars":5,"date":"2014-03-19","text":"What a hidden GEM! \n\nWhy this is one of my new favorite restaurants in Pittsburgh: \n- It doesn't take itself too seriously but you still feel like you're getting a good quality experience and even more important, quality food. \n- Speaking of, the food....YUM. This menu is wonderful, a WIDE variety of things, many I have never seen in Pittsburgh before. We ordered some of every type of meat (the chorizo was our fav!), some wings, guac (delish!) and the plantains for dessert.\n- The waitress was great- I think it would be helpful for them to have more than 1 server for the entire restaurant because the poor girl did look a bit frantic at some points but she handled it well for being the only server there. \n- The cost is super reasonable and allows you to try multiple things on their menu which is great, because believe me, you'll want to. \n\nCan't wait to go back!","useful":2,"funny":0,"cool":1},
{"review_id":"ZOHz0PdZk7V7_VljCFHu3A","user_id":"DEAPhf50deQE5Rp_ni1hmA","business_id":"Ea3GSstXLA1GRTMPq7pgdg","stars":5,"date":"2014-03-31","text":"I went to Pretty Hair Salon for the first time two months ago with a Groupon. They are awesome! Shea did a fantastic job with my blonde highlights and was extremely personably. I'd definitely recommend her.","useful":0,"funny":0,"cool":0},
{"review_id":"GRCymMwwwX-HhEQJ8C3BQg","user_id":"YmzZg2dpLyQ8cPtpyAg9xQ","business_id":"PBEUEK39haiJhQzuW4tnYQ","stars":5,"date":"2012-02-23","text":"I am fairly new to Yelp, and the restaurant reviews, and it is more than a bit confusing.\nWhen I looked at reviews for this restaurant, I was thinking that perhaps we should not go - there were so many negative comments about the, staff and\/or the food.  But we went anyway.\nAnd, I've got to tell you that the entire evening was terrific!  We chose the full 6 course dinner with wine paring.  Not only was the food fantastic, but the staff could not have been more professional, caring, and just plain terrific.  \nThere were 8 of us for dinner, yet the kitchen turned out the food on a perfectly timed basis, and was overall an awesome evening.\nIn the future, if I use Yelp, I will only read the positive comments, those with negative comments are probably just not too happy generally......","useful":1,"funny":0,"cool":0},
{"review_id":"XhFXjd-o1pAHev_upiEcNg","user_id":"iswB1hsLXNBOKFKp5Tbyhw","business_id":"YtfQQHdcQ_bGl2V0Agxw1A","stars":4,"date":"2014-03-01","text":"Family decided to try more new restaurants for 2014 and Bindia was a great find. Wife and I enjoyed the heat and flavours of the butter chicken and vindaloo. My 7 year old enjoyed the tandoori, mango lassi and khulfi. Highly recommend for dinner. Went back later for lunch and had the lamb wrap - awesome. Can't wait for summer and the windows to open for the atmosphere from the Market.","useful":2,"funny":0,"cool":0},
{"review_id":"aPx7a6rSN9upH2BXc-drPQ","user_id":"iswB1hsLXNBOKFKp5Tbyhw","business_id":"sPPh1LJllyr5jUpKFTxxag","stars":4,"date":"2014-03-02","text":"Awesome neighborhood place with a great family at the helm. Massive burritos with fresh ingredients. Recommend the pork and chicken combo; wife loves the Asada box with shrimp and the boy will eat chicken tacos all day. Whatever you do ADD GUACAMOLE!","useful":0,"funny":0,"cool":0},
{"review_id":"yJWIZG8OLpCRVRtAHQhg7A","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"wl0QZqAzr1DelslQ02JGCQ","stars":4,"date":"2014-09-12","text":"Food is good and they have a great beer selection. Every waiter\/waitress is in skinny jeans and a vintage T-shirt showcasing how original they are. If you can get past that and the below average service it is a good place to get a bite and a pint. Also the seating inside is mostly wicked uncomfortable so have an extra pint.","useful":0,"funny":0,"cool":0},
{"review_id":"dYYxRrcd5igLfwGJQRzt3Q","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"QMI6A2H1N3SwKU69SiASJA","stars":5,"date":"2015-02-19","text":"Everything was delicious and authentic. Try a bastilla. The service is prompt and warm from the owner.","useful":2,"funny":0,"cool":1},
{"review_id":"p4m18bF5tR_JL4IgRIjALA","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"TgjB-wlAVzol6HoDpE8KYg","stars":3,"date":"2016-11-05","text":"Small but nice place in the center of Coronado. There were four of us and two of us had the daily special. The food was cooked well,However it wasn't impressive at all. We paid over $70 and my son only had a juice and a muffin. I was expecting more than mediocre food for the price. On the upside the muffin was good as was the service.","useful":0,"funny":0,"cool":0},
{"review_id":"ujwjN_5AE46p-RRckq9GAQ","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"VZa00hKCxOczpJyfFj8AOQ","stars":2,"date":"2017-01-25","text":"The restaurant has a nice vibe with a lovely outside area. The service  was attentive even though at lunch they were very busy. The specials are well priced however the food was sub par. I ordered the street tacos and the chicken tinga for starters isn't chicken tinga even for a Scottsdale version. Also the chicken was so dry it was inedible...even the tortillas were over cooked.","useful":0,"funny":0,"cool":0},
{"review_id":"qPm_QmAch2dj1jYSd4mZRg","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"1fqRRtxI7mHEXyUE80UMyQ","stars":1,"date":"2013-09-15","text":"Mgmt couldn't be bothered to open on time...fifteen after and still waiting. The employees and customers are all standing around outside. We will never come here again. \nLast time we were here for a birthday party and the pizza was an hour late. The kids didn't get to eat.","useful":1,"funny":0,"cool":0},
{"review_id":"q3rCqrCvKJB9QEUFfoXsYg","user_id":"dqsXFHc_nkSxhoph0oNdDg","business_id":"jspgVJaiyobeUq6EMhmO-w","stars":1,"date":"2016-02-10","text":"The WORST service I have encountered in a long time. The service is nonexistent and worse they are rude. I guess customers are a hassle. The food is decent but not worth the hassle. I would suggest anywhere else. I won't return.","useful":2,"funny":1,"cool":0},
{"review_id":"lmPwnVQX3JeiasXsrQz0Ng","user_id":"IefOmpQZQ8PpL5JvVqX0rg","business_id":"brswxRJTLw6gd3uK9bpeSw","stars":5,"date":"2016-10-25","text":"I came in for a sore throat, the staff was friendly and Merry handled everything with courtesy and professionalism. I was impressed with that.","useful":3,"funny":0,"cool":0},
{"review_id":"2nSGSqmIBjjYd2JjrMnCng","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"TR5Wm_kJ32Kwy3oTxTDpBQ","stars":1,"date":"2013-10-23","text":"We had Design Tree Maintenance do quite a bit of work for us last year. The bill was over $1000. When I arrived home most of the work had been done. The crew was arrogant and surly. They got in their truck to leave when I noticed they had  left a mess in the front and back yards; I asked them to clean it up and they acted like I was asking for something ridiculous.  Last week, and against our better judgement we called for an estimate to prune our 4 citrus trees. An arborist gave us a quote to have them pruned. The office called and confirmed the appointment. We came home from work and the trees weren't for trimmed. The next day I left a message at both the office and with the arborist. The arborist called back to say the trimming guys came out but said it was too much work for the amount quoted. He said he'd be have to come back and look at the trees again. So in short, they don't honor their estimates this place is the worst.","useful":9,"funny":0,"cool":0},
{"review_id":"Zulz4yX8SqDC7b0IX8pebQ","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"TS3Q62QhxVVkc2sZ0iHaRQ","stars":1,"date":"2015-05-10","text":"Never again. SK was referred to me from my insurance company. That in itself should have been a warning flag. If SK is funneled lots of business without having to do anything to earn it, they have no incentive  to do a good job. They have a problem in their painting department and quality control. They were nice enough, didn't give me a hard time, but it was a waste of my time to drive over there only to find a big list of repairs that were not done or done very badly. There are plenty of body shops to choose from, not going back there.","useful":3,"funny":0,"cool":0},
{"review_id":"heTwAmoYmzlR_zcvX_f3ww","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"CegGRK-pM9oI7wBQQHCeBA","stars":5,"date":"2016-10-06","text":"Jordan's repaired, sandblasted and powder coated a 1930's wrought iron table and chairs. To say that I'm happy is understatement. The work they did exceeded my expectations. The table and chairs look brand new. There were several weld repairs and the decorative piece on one chairs was broken out. All the repairs look fantastic and the paint is beautiful. I'm very happy!!","useful":1,"funny":0,"cool":0},
{"review_id":"aOL5HlUwxaPWE8_FFa8SRQ","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"ZkUWOdBA4T7pdUhT0dkRzQ","stars":2,"date":"2015-05-10","text":"The wait was ridiculous even though 90% of the tables were open. Tacos are tiny and $3.50 each. You have to ask for chips and salsa, they don't automatically bring it or ask if you would like it. The food is very good but I've never left a Mexican restaurant hungry, first time for everything. I've been to Barrio Not a good value for the money. Joyride, which is right down the street knocks Barrio out of the water with regards to price and a friendly, welcoming vibe.","useful":1,"funny":1,"cool":0},
{"review_id":"2rKtdLA5_ZMu-bEZYovNvA","user_id":"21iRTP9h8XI0MxbbKGCO9A","business_id":"HFILriC2cQo61fi3l_xsbA","stars":5,"date":"2017-03-04","text":"We are very happy with the quick and excellent service we received at Autopro Collision. They did an excellent job and everyone that we had contact with was so nice, helpful and professional.","useful":2,"funny":0,"cool":1}]