[{"review_id":"xjPpR0479Of69GE5MIHk0A","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"RyTKm8McePjwsL8ggEHOYA","stars":4,"date":"2016-05-18","text":"Love the food! And the location! Easy to grab a healthy dinner here before a movie. Highly recommend trying Me Va Me out!","useful":0,"funny":0,"cool":0},
{"review_id":"ZCi2isFzp37x_ZAA9WevNQ","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"dwogRZ8Vdu7Pd4qSN0UwXg","stars":4,"date":"2016-07-02","text":"Love that this is so close to home. Brand new cinemas, lots of parking and good movies! Looking forward to the summer.","useful":0,"funny":0,"cool":0},
{"review_id":"GOjW13UZ6lZKldL35jeAUw","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"vqgfQqPiLw6ghdVgpZ_vJQ","stars":3,"date":"2016-05-29","text":"Had dinner here after attending desi fest in Dundas square on Saturday night. Food was ok, and service was fine. The pull of the place is the great terrace patio overlooking Dundas square. I would go again just to sit there.","useful":0,"funny":0,"cool":0},
{"review_id":"34HSLtTg0XjMg-4K_1q28w","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"eMTE-wqpk_YWaV3mf7Ii3A","stars":4,"date":"2016-05-29","text":"Dinner with friends on Friday evening. Not too packed and service was great. Food portions were a bit small though I loved the Korean beef short ribs and the lamb in Thai red curry. Try it!","useful":0,"funny":0,"cool":0},
{"review_id":"WvFZCWozf_G7cvdPgRAOWw","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"68m1zLbNCERY2b4eQegQUg","stars":4,"date":"2016-05-18","text":"A favourite haunt of ours. Especially during the summer. Kids love the ice cream, and I personally like their chocolate ganache cupcakes. They have a huge selection of sweet stuff for those looking for a sugar rush. Enjoy!","useful":0,"funny":0,"cool":0},
{"review_id":"8WyS_dBTt33q6HItper0gw","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"__pTR2Zcmofr_1FpAaQZhA","stars":5,"date":"2016-06-20","text":"Had Iftar (breaking the daily fast during Ramadan) here on Saturday. Great food and excellent service. New menu and decor. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"iLmmnv419QHNAMU6bhs16Q","user_id":"xvbN8gaS6IqrlCOBB9jxnA","business_id":"ID7WUBLnhkdxp8QrjsssZg","stars":4,"date":"2016-06-08","text":"Great dinner on Sunday night. Nice atmosphere as they had opened up access to the patio, so you felt like you were on a patio even though sitting inside. Food and service was good. Had a large chicken salad which was delicious. Worth a visit.","useful":0,"funny":0,"cool":0},
{"review_id":"fLHm9wN_6kejewyk_PZvpA","user_id":"GM0mRYg3mMYoQdwB_BT9jw","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":2,"date":"2015-12-18","text":"When I walk into any hotel I give it 5 stars, any negative experiences after that always impacts it for me. I think 2.5 would be a fair and accurate rating to give but 2 is my only option here. \nYelp considers 2 to be \"Meh. I've experience better\" what a great way to sum this place up.\n\nOur first two negative experiences happened at check in, the receptionist were nice, some of them were hard to understand but I don't think it was any fault of there's, more age related. Anyways we got our key card and proceeded upstairs to our non-smoking room. I swear, i've walked into some rooms that might have a \"faint\" smell of cigarettes, but this 1st room was as if someone took cartons of cigarettes, put them in the middle of the room and little them all on fire before throwing them out the window just as we walked in. We both were sick with colds so could not stand the stench. We walked downstairs again and politely told the front desk what happened. She apologized and said they were trying to fix this issue (it must happen a lot) but at least they are trying to fix it. Okay fine, second times a charm, we quickly are handed a new set of keys with a different room to test out.\nOur second room smells fine, and we quickly get excited, but it was short lived as we try to turn on the lights and soon realize that not a single light switch works, including the bathroom. At this point i'm viewing the hotel as a hike to and from the front desk and consider activating my step counter.\nOur 3rd visit to the desk we are polite again and explain what happened in this room, the women now seems amazed (maybe most people give up by the 3rd try?). So she quickly walks away and mumbles something about manager, she is being nice, i honestly cannot understand what she says though. I look at my female friend for a translation and she shrugs and mumbles manager in recognition of all i understood. \nOkay so the manager comes out and starts typing a novel on the keyboard and apologizing, he is also very nice and courteous, he helped us with 1 night resort fee which we definitely appreciated and moved us into our 3rd and hopefully final room.\nUpon entering our 3rd room everything is in order, smells, electricity, running water... so i'm happy camper, my female friend collapses into the bed in exhaustion from our hike in zion park and now in Circus Circus. \nDay 1 complete at Circus Circus... why is the clown so scary looking?\n\nDay 2\nGoes fine, the building doesn't explode but watch out for the toilets, they flush so hard i swear they could suck your arm down with it. Okay not really, but they will surprise you if you're not ready for it.\nSo it's 10pm, (12\/17) I tell my friend we should watch a movie, she shrugs without thought while staring at an ipad. I think she knows i'm tempting fate at this point.. \nI click the menu and it tells me to call the front desk for movies. Okay...that's a little outdated but sure. I pickup the phone and make the call, front desk doesn't answer, instead it is the operator, who tries to connect me again... no luck, so she tells me they will call me back in a minute. I wait 5 minutes and call back, she tells me they haven't forgotten about me and hangs up again. I wait 30 minutes and call back, reminding her it has now been over 30 minutes, she apologizes and says she will personally go check on why the hotel wont accept my money for a movie (not those exact words, but seriously..) I wait another 30 minutes and start writing this review. I have now been waiting 1 hour and 15 minutes including the writing of this review.. I'm not one to give up but honestly. I give up Circus Circus, if you don't have customer service or accountability, you do not have a hotel.\n\nSincerely,\n\nRyan\nPrior customer service manager of 3 retail stores and now traveling","useful":0,"funny":3,"cool":0},
{"review_id":"ItiDks8UfIltFX0esbET4w","user_id":"wTcqvJ-eEE0t4-2PULNd3g","business_id":"G7xS3HiTKHnRhI8cNRGXpA","stars":5,"date":"2015-08-01","text":"Everything was great! awesome full bodied daily drip, nitro brew was great and refreshing. Cinnamon roll was great,  accompanied by daily drip","useful":0,"funny":0,"cool":0},
{"review_id":"phRnRB9CHKSN9GCEEOSJ6w","user_id":"GXUxdrCbI_mP7h1_8-CzsA","business_id":"p2CyF_XXYdkkdTSv6sCg0Q","stars":1,"date":"2013-02-27","text":"Went in to buy a few dollar packs and he told me I didn't have enough money to buy anything and to come back when I had more. Really terrible person.","useful":1,"funny":0,"cool":0},
{"review_id":"cO8dFafgmoh4LbDC3Ewajg","user_id":"hd262Xb3w22ju4aNnttZYw","business_id":"w5CSi-An5meLnxjKSFn0wQ","stars":5,"date":"2015-12-18","text":"Food was very tasty and just enough spice.  Definitely keeping this on my frequent ordering list","useful":0,"funny":0,"cool":0},
{"review_id":"xtwZprms2OY4wm9kFsvh3A","user_id":"i3rrZ5no0Qy7RKtX9qy7_w","business_id":"Cl5PHhHfOzimUTCWjC5yNA","stars":2,"date":"2014-11-02","text":"The pizza is pretty good. Especially at 2am. But when it takes over an hour for delivery, no thank you. I shouldn't have to call 3 times to find out where my pizza is. Then when he finally showed up he asked for a tip. That's the best way to not get a tip.","useful":0,"funny":0,"cool":0},
{"review_id":"mbk1v4lNdYjMNmNKArjCdQ","user_id":"i3rrZ5no0Qy7RKtX9qy7_w","business_id":"OZQOVZlDEpP5MPP6bvHIHA","stars":1,"date":"2015-01-19","text":"Let's start with if I could give this place negative stars I would. Honestly, this was the toughest and worst mani\/pedi I've ever got. My friend was with me and asked for a full set, there was 3 employees sitting around on their iPads and after she already waited for about 30 minutes they asked her if she could wait 30 more. They were pressuring me to pick my colors and I couldn't really enjoy myself. They were all really rude and would stack customers on top of each other without finishing. I do not recommend this place AT ALL.","useful":0,"funny":0,"cool":0},
{"review_id":"eGowssmb9hqwK6kZJT6Ffw","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"1Vlyeu45fqebatacNQLdXQ","stars":5,"date":"2015-06-25","text":"I enjoy shopping at Copps Food Center.  I have never said this about any shopping experience in my life.  I hate to shop...too many decisions, but I actually look for reasons to shop at this neighborhood store.  The place is super-clean, organized well, has wide, uncluttered aisles, and the selection is fantastic.  The check-out staff are always great and friendly.  I really enjoy their boxes of fresh-baked Mammoth Muffins!","useful":0,"funny":0,"cool":1},
{"review_id":"LPqtJhpTVDS5CGzS9-dMkw","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"qou7HXpSiGdNzSmxhf59XA","stars":5,"date":"2014-04-15","text":"This is a friendly place where the owners are onsite all o the time.  The menu is far more extensive than the name would imply.  100% of the items I have eaten here were excellent, large servings, made of very fresh items and well worth the money.  I recommend it to you highly.","useful":0,"funny":0,"cool":0},
{"review_id":"qxbQrv1bYndOmEx2b6Fk0w","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"JfGnBe_IGDV0RZjAADp4yA","stars":5,"date":"2013-07-22","text":"Excellent waffles.  Excellent place to visit, especially kid-friendly.  Huge selection of Herbal Teas and Coffee is great.","useful":1,"funny":0,"cool":0},
{"review_id":"E66vizyMIek5i4fIBNzPOg","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"RG2IGb4LwbxUwCW3iooYDA","stars":5,"date":"2013-10-19","text":"There is no doubt that Otto's is a great, classic, establishment.  I have met a number of outstanding, classy, sophisticated, women in the lower level bar.  Bartenders are absolutely excellent.  The bar menu is outstanding & features quality items (not your routine \"Bar Food\").\nUpstairs, where the true spirit of Otto's really shines.\nBy far, the finest dining experience on the West side of Madison.  Quite often I drive by and don't stop, simply because I'm \"under-dressed\" (Blue Jeans).  Honestly, take a date for drinks and Appetizers in the lower level.  If the date is going well...take her upstairs to demonstrate your level of sophistication.","useful":0,"funny":1,"cool":1},
{"review_id":"-ioOPDj_XC8eJuoNFIvNmg","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"YSUPAkyni4qpcHfrMOAEww","stars":5,"date":"2015-12-29","text":"Great first-time visit.  The owner was on premises & personally welcomed me.  Very comfortable seating with fireplace.  Great choice in Tea & Bakery items.  I will be back!  Friendly neighborhood feel.","useful":0,"funny":0,"cool":0},
{"review_id":"NBq5v_ryCvnoL01R3UW3uw","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"G65yipCa-UKCcZTH135IAw","stars":5,"date":"2015-06-25","text":"Insurance agent negotiated for an excellent price.  No hassles.  Excellent, helpful and friendly staff.  Completed work in excellent time.  Great waiting room experience.   Attention to detail was obvious.","useful":1,"funny":0,"cool":0},
{"review_id":"asC7IKAVzrgu90qT_3hQ5g","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"q7O9lH4PaBZj3FTIhRYnkQ","stars":5,"date":"2013-06-23","text":"I really enjoyed Joyce G's review.  It got me out of bed, off my can, and without Pre-ordering, went there to experience the place.  I can not recall a more honest, down-to-earth place to get freshly prepared, excellent chicken.  If you expect fast-food speeds, go get your hormone-infused chicken at a national chain.\n\nThe people here are excellent!  Not a chain!  If you don't have 15 minutes to wait for excellent chicken, please call in your order in advance.  I am willing to invest in this establishment...based upon the quality of the food & the atmosphere.\n\nThe customers that came in while I waited for my order were acknowledged, and welcomed.  The staff actually cared about their customers, and the quality of the meal.  I opted to skip the wings included with my order, and they actually reduced my total bill to reflect this change.\n\nNowhere, will you find better chicken and staff honesty than at Harold's!\n\nPlease realize that this is a small, owner-operated establishment that will give you exactly what you desire...if you can give them a bit of time to prepare your meal, only after you place your order.  Anybody that has been raised on chain-food, will be excused for their impatience...at their loss.\n\nPLEASE...call in your order...and enjoy a great chicken meal...in the store or to take-out.\n\nRick Scollon","useful":6,"funny":0,"cool":3},
{"review_id":"fDW3r-ra2Nsg2Z6Z-HHNpw","user_id":"jfGxnTX9aYA5FtSdMXdHHg","business_id":"CyUR1uFKpFcIP3NPGbFSwA","stars":5,"date":"2015-10-20","text":"Honestly, I could live almost anywhere & I have chosen Countryside Corporate Apartments.  I moved in here with my son last January, my son is now away at the University of Iowa.  I like it here so much I have continued my stay.  The staff, management, Maintenance, and Housekeeping is excellent, and trustworthy.\n\nHonestly, when they say that your unit is \"furnished\", they are not kidding.  They furnish everything you could ever need, except a toothbrush.  All dinnerware, silverware, appliances, laundry facilities on premises, large flat-screened TV's with programming and WiFi is included in the rent.  There is a well-maintained, fenced-in pool & plenty of BBQ pits around.  Great big parking lot guarantees plenty of room for your car.","useful":1,"funny":0,"cool":0},
{"review_id":"GO3YUYyobe8J6XPm4k9Nbg","user_id":"rIReDhGo_dDZGVUN4SOB_A","business_id":"aJByuRaBMEyNlhc6WywC9A","stars":5,"date":"2014-08-11","text":"Yoni and all the gang at Balancing Paws are awesome, I cannot say enough good things. I send my puppy Ruby there for socializing and training, she loves it and so do I.  Yoni is patient with both Ruby and I, he explains everything so that you have a better understanding of your dog and why they behave the way they do. I wholeheartedly recommend Balancing Paws for whatever issues you are having with your dog. And even if you don't have any issues, I recommend you take your dog for a doggy day camp. I swear Ruby knows in the morning if she is going to day camp or not and she is soooo excited when she goes. Thanks Yoni for taking such good care of my girl.","useful":0,"funny":0,"cool":0},
{"review_id":"m3LyyVxeLVJtVAg-Ab4Cjg","user_id":"rIReDhGo_dDZGVUN4SOB_A","business_id":"CeQao36m9BWddyeOP4AJrA","stars":5,"date":"2015-12-04","text":"Just finished a floor install for my entire house, Rustin and the crew were awesome, very professional. My floors look great.","useful":0,"funny":0,"cool":0},
{"review_id":"YrFQk7ZNu0rYwBFkolj2BA","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"rvnTFEq7R2ZHg0_CYbBNFw","stars":2,"date":"2014-06-19","text":"I was so excited to try this buffet, but alas, it left much to be desired. \nPerhaps it's because I'm from Boston, so I'm spoiled when it comes to fresh seafood, but I found it difficult to find any appetizing seafood here.\nI started with the crab legs, which weren't bad, but were a bit stringy. I moved onto the cajan shrimp and calamari.. The shrimp wasn't edible, beyond fishy(YUCK!), the calamari was passable. Finally I made it to the lobster tails... ummm... I've had lobster countless times, I wouldn't call these lobster tails. They had a greyish tint, tasted like rubber, and left a very unsettling feeling in my stomach. \nAgain, perhaps I'm spoiled by the fresh seafood of the east coast, or perhaps I was perturbed to have paid for a buffet of buffet pass, and paid an additional $15 for this seafood travesty, but I will not be back.","useful":5,"funny":1,"cool":1},
{"review_id":"BKjlzorezS-FceEWhUkpqA","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"_kb6GT4qawjwq47OsQ52xw","stars":3,"date":"2014-06-19","text":"This buffet is smaller compared to it's Vegas counter parts, if we weren't staying here I'm not sure if we would have bothered. The food itself was good, made to order eggs, corned beef hash, real hash browns, bagels & bread for toasting,  and a carving station, but nothing that really stands out. \nIf you are staying at Flamingo or the Quad and it is within stumbling distance, and you are just looking for breakfast, it's worth the try... otherwise there are many other suitable choices that will bring you more quality.","useful":0,"funny":0,"cool":0},
{"review_id":"lO1V7O7Gn-AU0-C2VS1qAQ","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"AT_xDv2Lm5K7VtER1fp-SA","stars":4,"date":"2014-06-19","text":"Found this place on Yelp, decided to give it a try. We were a bit wary at first because the place was pretty empty, but we decided to give it a try, and I'm glad we did. \nOur waiter promptly greeted us and went over the menu. \nWe ordered a bottle of wine, which was kept chilled at our table, which was nice. My boyfriend and I ordered the porter house for 2, and a couple of sides. Our steak was cooked perfectly, and the truffle spinach was delicious!\nHad we had more room, we would have tried dessert, but we were stuffed! Prices are high, but it is a steak house, so that being said, prices are not out of line for the service and quality.","useful":1,"funny":0,"cool":0},
{"review_id":"OQwHFu9Dk35w1dbWrQJXsg","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"0S4WFZJZhVeM3aAqKjLz1w","stars":4,"date":"2013-06-19","text":"The View is amazing, and adds a romantic ambiance to the overall dinning experience. Our servers were very attentive without hovering, we got a bottle of wine, which they kept chilled at the bar for us. We got the lump crab & artichoke dip, which was delicious, and a very ample portion, so much so I opted for a salad and soup for dinner (pathetic I know while at a steak house, but the boyfriend let me try some of his steak). The wedge salad was pretty standard, good dressing, but had 2 pieces of almost whole bacon, not crumbled. The French onion soup was fabulous, cheese was nice and crispy on top, and a good amount of onions. The boyfriend got the Ribeye, perfectly cooked to medium, and nice grill marks and a juicy center. We will be back.","useful":2,"funny":0,"cool":0},
{"review_id":"LCtKiFEEAlgAUjzIK0Kfhg","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"AjWFFZN8KwyqJzzi0DyEsw","stars":2,"date":"2012-08-05","text":"$13 for sliders that were the same size as the pickle put on them, waitress never came over once to check on us, combo plate was pathetically small. No wonder there was no wait, go somewhere else.","useful":1,"funny":0,"cool":0},
{"review_id":"T1fQ32Wn3cg_Y7MIvRyuDA","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"OETh78qcgDltvHULowwhJg","stars":3,"date":"2016-08-07","text":"I haven't been here for about four years, so when the opportunity to return came up, I jumped at the chance. Alas, it appears certain things have taken a dive. Our waitress started off great, bringing us water, taking our cocktail and wine order, then brought over the steak centerpiece and went over each steak. Cocktails and wine came out, our wine server was prompt in refilling our wine glasses and gracious. Our meals came out, and the steaks were cooked perfectly, but I wasn't wowed like I was the 1st time. Also, one of my friend's had an issue with his crab legs, there were 2 tendents attached, and the ends were rough. For $55, this is unacceptable, our waitress didn't come over for 15-20 mins, when she finally came over she took it off the bill, but she should have checked on us sooner to make sure our steaks were cooked properly. The steaks and sides were good, but you are paying a premium for the experience, and the experience was off and not worth the money.","useful":0,"funny":0,"cool":0},
{"review_id":"X2JzsQlFt27soxORAsgeqw","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"Fi-2ruy5x600SX4avnrFuA","stars":4,"date":"2015-06-02","text":"Got the buffet of Buffet pass with our bridal party, and this was our final stop for dinner. There was a lot to choose from, quality was good and desserts were plentiful. (my only gripe was the soft serve machine was broken).  Service was prompt and friendly, would try again.","useful":0,"funny":0,"cool":0},
{"review_id":"rT5ZfkSy8e0oux0VDpsJoA","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":5,"date":"2016-08-15","text":"Breakfast served 24 hours, waitstaff is efficient and friendly, drinks are a good pour, what more do you need?","useful":0,"funny":0,"cool":0},
{"review_id":"2kLDaM2LFlrrapnnGrBVLw","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"G5or_Fra4-6IYOVlm_dI2Q","stars":1,"date":"2013-06-19","text":"My boyfriend and I stopped in here for dinner. First we went to the bar directly off of the casino, where we waited about 5 minutes and were not acknowledged once. We figured maybe we would have better luck getting a table. We stood in line at the hostess center, where there was one party of about 6 ahead of us. I'm not sure what was going on, there was a lot of back and forth between the party(who I don't think spoke great English) and the hostess, but we waited our turn for 5 minutes or so, while doing so the line behind us grew even longer of people waiting. At no point did the hostess even look up at any of use, and since the party of 6 was still in front of us, we waited. From the other door a couple walked up around the waiting party, and asked the hostess about seating, and she put them down!!! UMMM Excuse me??? You have a line of people waiting honey, why don't you try looking up! \nNeedless to say we left, plenty of other choices in Vegas, although I think it's important to point out, we looked in the windows after leaving, and there were plenty of open tables. REALLY?","useful":1,"funny":0,"cool":0},
{"review_id":"4Vd0NlZ4JlKUVMQe5nnj4w","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"OVTZNSkSfbl3gVB9XQIJfw","stars":4,"date":"2013-06-19","text":"Love this place! The boy and I came here for brunch this past Monday, and were pleasantly surprised. The omelet bar offers made to order omelets and eggs with a variety of filling choices, which we both opted for bacon and cheese and were cooked perfectly. There are a lot of different choices, which is great if your with a group or a picky eater, everything from pizza, Mexican to Asian cuisine and sushi. I only wish we more hungry when we came here.","useful":0,"funny":0,"cool":0},
{"review_id":"-B5tS69kOF5eHddmmgtfDA","user_id":"cwmozH0btTWP1a84TLoSJQ","business_id":"dYMhfzyZyklXELmYq_wfKg","stars":4,"date":"2014-06-19","text":"Came here for breakfast on Saturday morning for the mimosa brunch, and happy we did :). They had a lot of breakfast options including a prime rib carving station, which was awesome. They had eggs to order, crispy bacon and juicy sausages. I was also excited they had gelato, the cookies & cream is a must try.\nOur server was very nice and took very good care of us making sure our mimosas were always filled. I can't really comment on lunch, they only thing I tried was the fried chicken and mac & cheese that they had just put out for the start of lunch dishes, but I enjoyed both.","useful":0,"funny":0,"cool":0},
{"review_id":"p2drStcVVYNdiiRCP_utNg","user_id":"BJ5IXk9c_gkGVUOaWGrSgw","business_id":"DN7fUnbXuvasM0JU8Ii7aQ","stars":1,"date":"2014-11-30","text":"It unfortunate that this is so close and convenient to me. The food is fresh, which is the only reasom I go. The employees have such an attitude EVERY time I go. I have never been there and had a good experience with the workers. They are incredibly rude. Also during times that are busy, especially lunch, they only have one employee in the building. So the line will go to the door. I was in there when that has happened and 3 people came in and waited for a minute then walked right out. Something needs to be done on how rude they are.","useful":0,"funny":0,"cool":0},
{"review_id":"Tk70CRzh83fqmsFx70RMzQ","user_id":"Y7DoqiW7wOsOUgApFrhFVQ","business_id":"XMMLRvV4IMxIGyc4H37LxA","stars":2,"date":"2011-09-27","text":"I got the ahi sliders and they had a lot of inedible sinew in the them...yuck.  The server was very friendly and attentive, but surprisingly unconcerned about the poor quality of my fish.  My dining partners had the tempeh and turkey burger and enjoyed their selections.","useful":0,"funny":0,"cool":0},
{"review_id":"xn8zkyzmtxU-jwG3tjVeKQ","user_id":"Y7DoqiW7wOsOUgApFrhFVQ","business_id":"w8cKLWoulCsuf_AD2mQ-jw","stars":3,"date":"2010-08-30","text":"We were excited to try this new cupcake store near our home.  We bought peanut butter and red velvet cupcakes.  My first thought was that they are way too expensive.  The cupcakes are $3.50 each and quite small (smaller than Sprinkles where they are $3.25 or $3 if you buy a dozen) and plain looking - no decoration.  Given the price, the presentation\/packaging added insult to injury - they didn't even put them in a cute box or anything.  They put them in a little paper bag in which they could easily get smushed on the way home.  At first, the amount of frosting looked chintzy, but it turned out to be enough.  I was excited about the \"filling\" in the middle of these, but there was barely any in them.  The filling in the red velvet was a little strange - pretty straight cream cheese.  Both cakes were too dry around the edges.  Overall, they were tasty (especially the peanut butter) but the price for what you get will keep us from going back.","useful":8,"funny":0,"cool":0},
{"review_id":"FufpD_wMQ5Jxap5FZk4hJQ","user_id":"Y7DoqiW7wOsOUgApFrhFVQ","business_id":"IzdLLebxhDjnugxAMc-4EA","stars":2,"date":"2010-01-24","text":"I've been here probably five times for pedicures.  I was mostly happy with my nails, but I find the front desk staff unfriendly and think that's inexcusable.  No smiles or warm greetings.  I get the feeling they don't appreciate their customers.  I won't go back anymore.  It's a shame because it's such a cute place and I like their emphasis on cleanliness.","useful":1,"funny":0,"cool":0},
{"review_id":"k4sQMG4RTgJ54k2IonDpYQ","user_id":"Y7DoqiW7wOsOUgApFrhFVQ","business_id":"p3EiKlzllwI7Lwd3QYNGCA","stars":5,"date":"2014-02-07","text":"Lana does a beautiful job on alterations. I have been bringing things to her for years. I have full confidence that she'll know how to do the job right at a reasonable price and within a reasonable (if not quick) timeframe. She's wonderful to work with too. She's very nice, accommodating and customer-service oriented. Thank you, Lana!","useful":0,"funny":1,"cool":0},
{"review_id":"6hPpCrnOrPwVb2v3XUHkLw","user_id":"Y7DoqiW7wOsOUgApFrhFVQ","business_id":"EUQoB_ph7_xIyj7JZGI3bg","stars":2,"date":"2016-04-10","text":"The eggplant parmigiana was heavy and not fresh. The pasta on the side was similar to frozen Reames egg noodles. A waste of $14. I will not be returning.","useful":1,"funny":0,"cool":0},
{"review_id":"tOcgjf0iWhKcJ8CpJm3Ftw","user_id":"N7EaJ4fjIbCANPGhNSXudw","business_id":"IvWiFeA-Pkc-ntaz4bMHSw","stars":5,"date":"2017-08-05","text":"Had such a blast here for our two private couples lessons. We got the private lessons from groupon and would have easily signed up for the beginner class sessions if we weren't leaving town. Perla and Bruce were such awesome teachers! They went above & beyond for helping us learn enough moves for our upcoming wedding. Thanks again!","useful":0,"funny":0,"cool":0},
{"review_id":"FBDiVKz6QIZo6FOjZxSQEA","user_id":"N7EaJ4fjIbCANPGhNSXudw","business_id":"nMoNrpsMqW5099mEevNJ-w","stars":5,"date":"2017-06-15","text":"One of the best coffee shops I have been to in this area! The coffee is great, but the ambiance is amazing. I have been coming here almost day while I study for a huge exam and this place cannot have better vibes for studying or even just hanging out. Everyone who works here is super friendly and I absolutely love the feel.","useful":0,"funny":0,"cool":0},
{"review_id":"yfKeHKPrM8CR-ofQ4_1h9g","user_id":"N7EaJ4fjIbCANPGhNSXudw","business_id":"BjbokieOGk2CCq2t8wV6MA","stars":5,"date":"2017-08-11","text":"Great modern Italian space with delicious pizza. My in laws are vegan and Spiga always accommodates! Also, love that pesto hummus that comes with the bread!","useful":0,"funny":0,"cool":0},
{"review_id":"CVdxFuGsXHsaN9fk4azkUQ","user_id":"N7EaJ4fjIbCANPGhNSXudw","business_id":"9zqrKGYRdt1_lZZT5FWf2g","stars":5,"date":"2017-08-11","text":"Had a great experience for a cleaning and exam. The whole staff-including the hygienist,dentist, and receptionists-were exceptional. Felt super comfortable immediately, which is always tough at the dentists. Thank you!!","useful":0,"funny":0,"cool":0},
{"review_id":"FEtN_aawKKR_N5WlDRqmYQ","user_id":"N7EaJ4fjIbCANPGhNSXudw","business_id":"vA7gCRT0JsgSYy0U8NY0nA","stars":5,"date":"2017-06-15","text":"Amazing. Always craving Poke and this place does not disappoint. The small size is super filling because they have soo many vegetables and toppings with no restrictions on how much you can fill in your bowl. Prices are very reasonable! I love how they have kimchi too. Everyone who works there is super friendly as well. My new lunch spot!","useful":0,"funny":0,"cool":0},
{"review_id":"h4EuaOWtO3fU0MMr0lANtA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"W-YhRJOSezqESSas-oLArw","stars":1,"date":"2007-10-06","text":"Was so hungry for breakfast but everything was so pricey, ended up getting an apple danish which costs $4 and it wasn't even good! Too much flour and was chewy. A colleague mentioned that he had a burger which costs $20 of which he took a bite and left everything behind coz it was overly dry. Another colleague had a $25 salad which was similarly disappointing as well. \nI'm sorry, my apple danish was enough to leave me with little or no desire to return to try anything else and since many others described their disappointment of lunch and dinner items!","useful":0,"funny":0,"cool":0},
{"review_id":"U8QA_6LKzpkUUbUCguTmDQ","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"TCWMgOiV0PxQkWE1SyBIWQ","stars":4,"date":"2007-10-06","text":"YES! I finally dined at Nobu, considering it was Iron Chef, Masaharu Morimoto's restaurants when he won the challenge. Ok, this is not the original restaurant where he worked (that is in NYC) but this is a branch of it. According to Wikipedia, he left Nobu in 1999, eventually opening his own Morimoto restaurant in Philadelphia in 2001. So I will eventually eat at Morimoto.\nNobu was a good experience, although as other yelpers pointed out, why was this in Hard Rock Cafe (seemed kinda out of place) and the kitchy Hawaiian decor, the decor lost one star in my books.\n\nThe miso cod was heavenly and so was the tuna tartare with caviar. The roll we had was good as well. Pricey but definitely quality sushi.","useful":1,"funny":1,"cool":1},
{"review_id":"Kl2yVrGdpmIo2N5J1jYc0w","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"ropJyZdmv6NeDU2Vz1I_Hg","stars":4,"date":"2007-01-10","text":"I reunited with two high school friends in Phoenix, Arizona last Spring! Thank goodness not in the extreme summer heat! The other girlfriend flew in from Maryland and we both met up with our friend who gave birth to a baby girl who now lives in Phoenix. Phoenix girl suggested dim sum and to go to this decent chinese restaurant across town. I was hesitant since coming from bay area, we have really good dim sum in the area but nevertheless Maryland girl was craving some chinese food hence dim sum was it. We arrived at 11am and secured a table for 3. As we started indulging in our food, we noticed the stream of people coming in....suprisingly the food was fresh, tasty and decently priced. It was a memorable reunion nonetheless. :)","useful":1,"funny":0,"cool":3},
{"review_id":"VVvdbMIOoknQ-7NczYMrMA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"na4Th5DrNauOv-c43QQFvA","stars":5,"date":"2006-03-02","text":"Love the O show and theatre at this hotel. Beautiful restaurants, romantic garden during all seasons (they change the arrangement and setting every season, Spring, summer, fall, winter - how trendy!) and fountain area, everything is just perfect. Exquisite and extravangant, after all it's Vegas, everything has to be over the top. This hotel has style and it's not cheesy. So much attention to details, from furniture to tapestry and definitely check out the details in the ceilings as well. Who is not to like this hotel??? It's creme de la creme of the entire crop in Sin City!","useful":2,"funny":0,"cool":2},
{"review_id":"hRfGZ0xpuRVNV_STVUYNfA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"Uut2Y-n5eMO6qIn7tvEYKA","stars":4,"date":"2007-10-06","text":"I've been here for several conferences in the past and just returned recently. The conference\/convention area is very spacious (everything is extra large and spacious in VEGAS!) so you tend to walk a lot. The rooms are spacious, the audio system seems decent but the AC is turned up way too high! Well, then again, I guess they don't want everyone to be stuffy or falling asleep at sessions. :)\n\nThe lunch offering were ok although several ppl did not favor it too much, I liked the dessert on the 2nd last day (key lime chocolate chip cheesecake and pineapple cake, so moist and delicious!) I thought the snacks and fruits during the breaks were pretty good. \n\nWatched Goo Goo Dolls perform as part of the convention and the ballroom was a decent size with pretty good acoustic.","useful":1,"funny":0,"cool":1},
{"review_id":"7PB2GYzrQkr8C6VIEGn5NA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"p7NkZWqisweiNsr3XwKxbg","stars":4,"date":"2007-10-06","text":"Been eyeing this one bag and surprise surprise, they have two left! Staff was extremely friendly and helpful. Great selection but I was just informed that the US collection is made in US and not France. Sigh....so their prices is definitely a lil lower compared to Gucci, Dior, Chanel, etc.","useful":1,"funny":1,"cool":1},
{"review_id":"u87JH1M8rAxwuY6gWVmZtA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"ZuCKwbWUNUu5Ri0IN5dUQw","stars":4,"date":"2007-10-10","text":"Great location right smack in the middle of the strip. Came in here after watching Mystere and hunted down some water since we were parched from the dry weather! Colleague found some stomach medicine to heal his unsettling tummy apparently from some bad food the day before...\nFriendly staff and quick turnover at the lines.","useful":3,"funny":0,"cool":0},
{"review_id":"1DJp9gXpgr217xS4_seSdw","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"eEnNw3_hBvxcFHyr23kAuA","stars":3,"date":"2007-10-06","text":"This was far from the strip and certainly not very walk-able, depending on where you are coming from. We were coming from Mandalay Bay so this was definitely not walk-able! We were dining at Nobu but upon entering HRC hotel, it's very typical to be filled with rock and biker memorabilia or collective items! It's just not my style, we wanted to eat at Nobu so we had to end up here. I have to admit that I've never been to the hotel and even so when it's far off the strip. Not sure if I'll ever return....sorry, just not my thing....","useful":0,"funny":0,"cool":0},
{"review_id":"gOAmIHMtb-DmdwOBhjaJ-g","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"DxgSVufr_6y_Rc63CC17Zg","stars":4,"date":"2007-10-06","text":"I must say that the selection of shops here are better than the Fashion Show Mall or the Miracle Mile Shops at Planet Hollywood. Have to like the Gucci, LV, D&G, Theory stores here which usually carries a better selection in these specialty stores. If you get tired from shopping, just stop and watch the statues \"talk\" at the Atlantis fountain show. \n\nI just witnessed first hand, the new 175,000-square-foot, three-level addition includes more upscale shops and several new restaurants, as well as a spiral escalator!","useful":0,"funny":0,"cool":0},
{"review_id":"FAO-bL9r6YPujMMNXGkWfA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"3fdtp-bzoE4ZgTakkcEBzQ","stars":4,"date":"2007-10-10","text":"From the slot machines upon arrival at the airport to the larger than life variety buffets, everything is just over the top. I guess everyone has to visit at least once in their lifetime and you'll be amazed or totally disgusted? :)\n\nThe hotel setup that mimics everything, you can have a little piece of Italy, France, New York, Egypt, pirates, classy to ghetto fabulous, you name it, you can and will have it. Btw, Elvis, Marilyn, everyone is in Vegas! \n\nWhat happens in Vegas, stays in Vegas + Ka-ching $$$$ !","useful":0,"funny":2,"cool":2},
{"review_id":"HOZ0gdt8IkaVXDH2EIVWow","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"gBfPyzPRmeOaj3SdcIj0Rw","stars":4,"date":"2007-10-06","text":"Made reservations on Opentable but like others have pointed out, it wasn't necessary but still, it was better to be safe than sorry esp on a Thursday night in Las Vegas. \nWe were seated by the windows which had a gorgeous view of the strip overlooking the neon lights of Harrah's, Imperial Palace Hotel and Paris in the close distant. \nWe started with edamame, closely followed by a tuna tataki salad which had a hinge of too much vinegar but the tuna was good. Then we tried the toro with scallion roll - excellent, melted in the mouth, Roku and roll roll which had combination of 3 fishes, unagi sushi and toro sushi. Then we finished with the Chocolate Volcano which was a warm chocolate cake oozing with chocolate sauce in the center with vanilla bean ice-cream, it was delicious! 3.5 stars. I thought the sushi at Nobu was a tad better. But service was impeccable considering other prime restaurants with very poor and s-l-o-w services in the last few nights!","useful":0,"funny":0,"cool":0},
{"review_id":"T_6l84G09l4XtBafmOUhHA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"EhIMjTklf4QPvRvMIhoQiA","stars":3,"date":"2007-10-10","text":"Well, it is a regular mall with regular stores, however it was my first time in a Clinique store, since when did they have their own store?! Only in Vegas, I suppose. \nIt has a nice facade, big silver and round button-like decor, very shiny, very Vegas-Hollywood, after all, it is next to Planet Hollywood Hotel.\nOverall 3.5 stars since I found what I was looking for, to heal my chapped lips. \n\nFYI Saw the billboard that H&M opened their doors in this mall last Thurs, Oct 4.","useful":1,"funny":0,"cool":0},
{"review_id":"Z8nZTrhBBTg6YF37rUkPNw","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"-nKIDHXa5H23rq8d6KGT_Q","stars":2,"date":"2007-10-06","text":"We had a great team event (getting to know other team members) here but not much can be said abt the food. I had the ahi tuna with cold soba noodles, the soba wasn't bad but the tuna had some funky taste to it. The sauce did not go well and it was just undesirable. I left half of it behind. First time that I did not fish ahi tuna! We had a big group for dinner, abt 20 but the entire restaurant was empty but it took ages before we received the food. They were certainly not understaffed since there were at least 20 servers running around but no idea why. \n\nI'm sorry but two star is being generous; 1 for the great group camaderie and networking event we had and 2 for the somewhat nice interior decor.","useful":0,"funny":0,"cool":0},
{"review_id":"3ptmAm7jW7N00rNxvLkDAA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"1xO2LvScpcMfl2BNm1aISg","stars":5,"date":"2007-10-06","text":"After reading all the rave reviews of this spa, I couldn't resist but booked myself for a massage there after a long week of convention activities. The facility was impeccable and it was great since it was earlier part of the morning. \nThe classic massage ($140) by Aaron was heavenly, he had strong hands but definitely helped eased the knots away from the tight shoulders and also exhausted feet. \n\nThe roman baths were great since I was the only person there. The steam room, the arctic snow room was different with tiny snow flakes failing from the ceiling...in a spa, that's a first time! :)\n\nThe entire facility was top notch, clean and sanitized and definitely comparable to Burke Williams. I would definitely return for a masage again or facial if I return to sin city. \n\nHappy ending, yes! Not that way, silly!","useful":0,"funny":0,"cool":0},
{"review_id":"OK2NOF47XDHsqfUmV-iWyg","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"yhYhK7tb3la5KcLlVzG5Lw","stars":2,"date":"2007-10-06","text":"Wow, one must seriously wonder why Britney Spears or Nicky Hilton or the likes of them would want to hang out here? Perhaps celebs get better treatment or perhaps this is a new spot? \nThe space was not much of an expansion from the previous Ra Club although they changed the entrance walkway and we were certainly not wow'ed by the interior or the music. For a Thurs evening with a rather full crowd, the DJ was playing old Usher, Michael Jackson and Madonna's Like a Virgin. We were glad not to have to pay the cover charge since we had free passes, thank gawd! Certainly not impressed, perhaps it's better on Fridays or Saturdays but I would certainly check out Mix or Pure or Tryst which are supposedly some hotter clubs...","useful":0,"funny":0,"cool":0},
{"review_id":"3PfKnMz9C6WLDfi46jCW2g","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"oVrvzUJczq0e2JzVxSTyag","stars":5,"date":"2007-10-06","text":"The sensual offering of Cirque du Soleil show series! :) Yes indeed and esp the wine glass bowl act! Who is to complain when we got free tickets to the show. Being at the right place and the right time. \nDefinitely a great show with a happy ending! :)","useful":1,"funny":1,"cool":2},
{"review_id":"zBG6OySKlzR_jTMpO18jKA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"IN4hkan9R09OSaBR83OULw","stars":4,"date":"2007-10-10","text":"I was about to purchase the lip balm treatment but found out at the cashier that there were other lip product offerings too so the very helpful and friendly staff patiently worked with me to help me find the best fit. Vegas sure is dry and everyone suffered from chapped lips and dry skin during the convention. A colleague commented that we might all be turning into flies (not sure why), chapped lips, sorethroat, headaches....sigh....\n\nIn any case, I found my lip product here when it was out of stock at nearby Sephora. Wow, an entire store of Clinique products. I don't really use their products except for the Super lip balm and they have it here. :)","useful":1,"funny":0,"cool":1},
{"review_id":"aUEVvD2giEOz4jfPwRb_hg","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"Wxxvi3LZbHNIDwJ-ZimtnA","stars":4,"date":"2007-10-06","text":"Friends and colleagues rave about the suite-type rooms here. Yes, it's bigger than regular\/standard rooms and ok, the bathrooms are spacious but I thought the fake gold over the fixtures and furnishings were a lil tacky. It's definitely a nice option and no doubt, the entire Venetian theme setting is grandeur at its best, again, it's Vegas and everything is possible, even a gondola ride!","useful":0,"funny":0,"cool":0},
{"review_id":"nlQZnfjdkk4uIxFlr5fypQ","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"FaHADZARwnY4yvlvpnsfGA","stars":3,"date":"2007-10-06","text":"The lines are insanely long despite of the hours you fly in and out. Perhaps I've just been flying in and out at the wrong times?!! \nThe only comforting factor perhaps is that they have TCBY. For some reason, TCBY is not in SF or am I missing out? Love the chocolate yoghurt(?) with mixed nuts, YUM! Line, what line? Wait, what wait?","useful":0,"funny":0,"cool":0},
{"review_id":"g0EslpD5q8aMK5Gjxesi6Q","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"28MoceEv54TgNDsmGxokPw","stars":4,"date":"2007-10-10","text":"I was greeted by a very friendly and helpful staff. She was wide eyed and chirpy! \nI came in here looking for Clinique Super Lip Balm treatment cream however, they were sold out. She was kind enough to let me know that just around the corner is the Clinique store itself and I can probably find what I'm looking for out there. Thank goodness so I don't have to hike over to the Fashion Show Mall. Every step you save walking in Vegas is a big deal!","useful":1,"funny":0,"cool":0},
{"review_id":"XamSv4DXLSqYHjhu7qOS6Q","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"SvHAczHxIJ00QlJ9ovQR8g","stars":5,"date":"2006-02-16","text":"Ultra cool and trendy bar atop Palm Hotel. However, lines are long and unless you do the \"hand-shake\", it's rather difficult getting in. Our friend \"tipped\" the bouncer and 8 of us got ahead of the line and went in with no wait! Those in line told us they had been waiting over an hour! Phew...","useful":0,"funny":0,"cool":0},
{"review_id":"qLA7rg5ng_qz5RwnuGEOEg","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"_PVqHUwjev4oOXomC7pk3w","stars":3,"date":"2007-10-06","text":"I visited two yrs ago and personally thought it was ok, not the best aquarium but definitely not the worst. It's fun and if you have some time to burn and since you are already in Mandalay, it's worth a shot. $16 is steep but then again, everything is pricey in Vegas.","useful":1,"funny":0,"cool":0},
{"review_id":"ih8GBnrowj70qMFYqT0McQ","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"Cr4ipI-tr-R8Q0NilkWNkA","stars":4,"date":"2007-10-06","text":"After reading about the lounge on the Vegas 24\/7 lil booklet, I had to go catch a glimpse of what it's all about. \nAfter the conference ended for the day, I managed to squeeze in some time to check it out before dinner time at another locale. It was empty at 6pm although some folks were enjoying their drinks! By golly, the view is fantastic! It is definitely at par with that of Aqua in Hong Kong, wide open view beyond miles of the strip and the surrounding desert! \nI have to return on a regular night to experience the action but the view and the setup and the semi open-air lounge area is killer! \n\nThe women's bathrooms each opened up to the view below! I hope it's one way mirrors but you can go about your business and enjoy the view outside! Will post photos soon! \n\nThe dining area is white and has a great setup! Perhaps to return and try dining there at some point....Mix in THEHotel is one fineeee place, ambience-wise!","useful":0,"funny":0,"cool":0},
{"review_id":"B8po4Y1QBsc1ZsZz4FnSBg","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"ByFMv3p5X1aNeZhU61rDcA","stars":4,"date":"2006-02-16","text":"Definitely check out the rides atop Strastosphere, the Screamer ride and the roller coaster! Amazing view and check out the observation deck too for $8 and $4 for hotel guests.","useful":0,"funny":0,"cool":1},
{"review_id":"B96frMcPZuYAKJYxW_WaHQ","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"KmuLLSyZJdNoarwcIERHcw","stars":4,"date":"2007-10-06","text":"My personal favorite is still \"O\" and followed by Zumanity that deserved 5 stars. Mystere wasn't bad and I'm glad I picked this over Ka since Ka did not have very good reviews or it being mediocre. \nMystere was very engaging but certain acts seemed to have been done at other shows. However, the costumes were colorful and definitely fabulous but they did put in a lot of fillers (adult baby and this clown-like character) a few times throughout the show, I guess to fill in the slot while the other characters change into something else or when the production crew prepares the stage. \n\nOverall, a good time, cheaper tickets compared to Ka and suitable for children as well.","useful":1,"funny":0,"cool":0},
{"review_id":"T2kchDPu3eHlRH3kdn3wxw","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":4,"date":"2006-02-16","text":"Definitely cheaper priced rooms at this hotel. Fairly basic and no-fuss room but nothing luxurious, after all, you only pay about $50-60 during off-peak times. Rather quiet and laid-back atmosphere and very spacey lobby area.","useful":0,"funny":0,"cool":0},
{"review_id":"lW5dGd2yzmhMVG1hSg-xPw","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"BH9z7IJ4zydAqgwsbqoVZQ","stars":5,"date":"2006-02-16","text":"Deserve a 10 star for this outstanding performance and stage props and all the acts! Amazing million dollar stage with 6 feet deep water that turns into a flat\/walk-able stage within seconds! Loved it! Buy tickets ahead of time, constant sold-out performance! Definitely go see it, it's by far, my favorite Cirque production!","useful":0,"funny":0,"cool":1},
{"review_id":"i1skAfC0a0mjvCVjOSJOKg","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"El4FC8jcawUVgw_0EIcbaQ","stars":4,"date":"2007-10-06","text":"My memorable hotel experience entails a certain penthouse suite in this hotel several yrs ago. We were treated to some serious VIP treatment since things were being comped. We had a 3 bedroom suite, living room, limo service, show tickets, the whole nine yards. It was definitely a fun time and not forgetting the James Bond themed party on New Year's eve. \n\nThe lion's den is worth a visit as well!","useful":0,"funny":0,"cool":0},
{"review_id":"zNZXiSli4yIJsrobCjglgA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"MqYYYNA-ZYvV-1w5qcmMoA","stars":4,"date":"2006-02-16","text":"The wine-angel ala Mission Impossible act hanging from a wire within the wine chamber is intriguing....Interesting, after all, it's Vegas, baby! Anything can happen and only in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"9-a-mgCeq5UHJvwaVx76ow","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"PwpSY0vO3XlQXKOuqiqZMQ","stars":3,"date":"2007-10-06","text":"Colleague's friend raved about this place so we made reservations for a party of 5 to try this place out. It was packed on the \"outdoor\" seating area so we sat inside. Service was tremendously slow, is this Vegas type of deal? All these supposedly fancy and upmarket restaurants have mediocre food and super slow service for some odd reason! I had the seafood boulabaisse which was ordinary, certainly not wow, was kinda similar to other ordinary Italian places that I've been too. It wasn't bad but it certainly wasn't off the wall good!\nColleagues said their ahi tuna dishes were moderate but supposedly the steak was not to be missed.\n\nI had to leave early for the Cirque show at Treasure Island so apparently, I missed out on a good chocolate dessert. I've tried other Wolfgang's restaurants but this did not stand out.","useful":0,"funny":0,"cool":0},
{"review_id":"7vPf9Jmht3FMiPlfGsowNA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"bWJdRgTROygw8qX1oVfx9A","stars":4,"date":"2007-10-06","text":"This tram rocked! Definitely the fastest way to get from Excalibur to Mandalay with the Express tram to get away from the crowd and the heat! :)\n\nPerfect especially after a long day of walking from either hotels and it's free!","useful":1,"funny":0,"cool":1},
{"review_id":"HP0LmeYYBR0sJbRyKh6C0g","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"o7AiTlyWUrBSzdz6oMHj5w","stars":3,"date":"2007-10-06","text":"OMG, what a horrifying experience! Well, the work convention was at Mandalay and due to last minute registration, I couldn't get into Luxor or Mandalay so instead of hiking from other hotels, I decided to stay on the same side of the block and figured there was the tram to ease the walk a lil. Tower 1 is beyond old, it's ancient dinosaur, a glimpse into a cheap and bad Motel 6!! My gawd, how can they not do anything with it soon?!! Fortunately, with a $20 upgrade, Tower 2 was much newer and nicer with flat screen TV and new carpet and solid mattress and new bedding and sheets!","useful":0,"funny":0,"cool":0},
{"review_id":"QM4w8DmCiMYIst1_PpKoiA","user_id":"Ud6j2HN40qEhycq2PuwcBA","business_id":"VyjyHoBg3KC5BSFRlD0ZPQ","stars":5,"date":"2006-02-16","text":"Caesars Palace host a great mall area with the skyline effect that ultimately changes throughout the day, from morning to night with stars in the sky and mind you, this is indoor! Amazing huge Trojan Horse outside the FAO Schwarz toy store! Love the swimming pool, you can lounge like Caesar and Cleopatra. :)","useful":0,"funny":0,"cool":0},
{"review_id":"gdulwDj84FsvHulcpwMOCw","user_id":"aLuXLZn0xd3HwkNugq3QWw","business_id":"hvridAom9cjx4mfFYasVrA","stars":5,"date":"2015-08-31","text":"I gotta say that I have never been so satisfied with an auto repair service center. I'll say upfront that I know little to nothing about cars or their upkeep. I took my 19 year old Caravan in because there was a major leak from under the hood. Not only was Damien courteous but he didn't make me feel like an idiot for not knowing more about my vehicle. I have literally been scoffed at, looked down upon and taken advantage of by other service centers but not here. Pep Boys was honest in their assessment and totally understood why I would not have the costly repair done. I have FINALLY found my auto repair guys (for at least as long as Damien stays there) and would highly recommend this shop to anyone who, like me, knows nothing about cars and is tired of feeling that they are being taken advantage of and looked down on. AND to top it off they're charge for a quote was beyond reasonable. They could have dinged me to death with fixing one thing and then saying that they found another, and another, and another like I have experienced over the years from other auto repair places. What a relief to know that the next time I have a car that needs something done, I do not have to go through that nervousness and fear, I just have to got to Pep Boys on E. Sahara!","useful":0,"funny":0,"cool":0},
{"review_id":"0RvriQ8_oEoNGJL3NpHoqg","user_id":"aLuXLZn0xd3HwkNugq3QWw","business_id":"_yw7ZIiJGpzLDiFbnLIfEA","stars":1,"date":"2015-10-16","text":"I had an appointment from a referral and after having to call their office to find them (when they called to make my appointment they failed to mention the address is 7785 W. Sahara but the building sits behind a mini complex and sits far back from the street it is actually on, which is Buffalo) and even though I had had to travel by bus appx an hour and a half from East Desert Inn and Sandhill, I made it on time. I filled out the required pages of medical history etc and the final page was a document that was a \"Consent for Treatment\" form. It listed various types of treatment that could be required and many statements of the possible problems (loss of the use of hand, etc) that could arise. At each of these I had to initial that I had been informed (He is definitely attempting to cover his butt!) At the bottom of the form I was to sign over my consent. I did not sign and asked the receptionist if I could hold off signing until I had at least MET the Dr. She informed me that the Dr. would not even speak to me until the form was signed. So I informed her that I would not be staying for the appt (even though it meant another hour and a half home by bus and starting all over again with a different Dr.) I can't believe people actually sign something like that having never met the Dr. It is like having a 'friend' set up a blind date and the date calls and says I'll pick you up Friday at 7:00. Then you ask \"Where are we going, what are we going to do?\" And he answers: \"It's a surprise.\" Would YOU get in his car?????","useful":0,"funny":2,"cool":0},
{"review_id":"5jEIFqyKfjLbU6RzIph7pg","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"q5sa3zjAwIYMAgfPVxOdHw","stars":5,"date":"2014-07-22","text":"Premium place with premium qualities.best food of my life.So generous,and real lebanese food.Simply the best man'oushe in town.the whole idea is just homey and authentic,from location itself to the smell and taste to the friendly welcoming ,I just love it.","useful":1,"funny":0,"cool":0},
{"review_id":"DrYgnHtfbzZhlXwp8-cDrA","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"3kdSl5mo9dWC4clrQjEDGg","stars":4,"date":"2016-06-17","text":"this little place been one of my favorite place to have breakfast on special occasions,what I like about this place,is the staff,they are very friendly,the place is very gozy,I love the orange juice they serve,and the coffee of course,plus,I love their omelettes.they make it how ever you like.so glad I don't have to go to a casino to get a breakfast .for me and my family.","useful":0,"funny":0,"cool":0},
{"review_id":"kM8QhCNDyrlHUKBG_P8RTw","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"v0byOL8VL6v6muGa1anxFA","stars":5,"date":"2016-06-11","text":"Best Middle Eastern Restaurant in town. This is the place to go and eat, the food is excellent the portion is good, The hot bread is out of this world. The most important thing is the food is always the same, Not like other restaurant some times it is good and other times no so good. \n\nTry the fattoush salad with chicken shawarma. Don't forget the garlic! \nand for some of you who likes spicy food, try the sujuk,it's my favorite. we will be back.","useful":0,"funny":0,"cool":1},
{"review_id":"0q3q1qKgv4EVXeh-4iQy6Q","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"eZcCFV-8X91ZSnmB9807bw","stars":3,"date":"2016-06-17","text":"I am a regular customer there,and I always get the same thing.which is the luau chicken salad.I realized that they had added pineapple to it,and it didn't have a flavor to it.plus I use to love the dressing ,but i realize that the dressing was too vinegry....and I realized that they put the complimentary bread in the microwave........\n\nI honestly didn't want to make a scene,but I realize that ,something changed in that place,even though the food came out very quick,but I just felt ,who ever made that salad,did a sloppy job.by the way,it have been more then a week since i ate there.I honestly love the cheese cake factory,I will always come back,cause,they have stuff on their menu,that you can't find any where,but i just wish,the luau salad, didn't have the pineapple.plus it wasn't too appetiting.","useful":0,"funny":0,"cool":0},
{"review_id":"gjT8w4dYVs5sfYHqouczPQ","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"j2w6wlRmlaZaaErQus8ElQ","stars":4,"date":"2014-12-15","text":"we came in as 4 of us.once we saw the menu on the wall,we wanted to order almost everything.their size of the lahm el ajiin,is WOW.their manakeesh sandwich,is awesome.the tabulli is amazing.\n\nthe prices are WOW also.I had trouble finding the place,but at the end,it was in a good area,plenty of parking space.everyone was nice.especially charlie.he came out and brought us the food himself.I love charlie's garlic.thank you.we will be back, for some lebanese kibbi.WOW.","useful":0,"funny":0,"cool":0},
{"review_id":"TwjojOGulBootk8Ycw4Ivg","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"AE-1mzUBcBuC5QkwlX24BQ","stars":4,"date":"2014-12-15","text":"i drive all the way from the east side, just to get the boba tea.everytime i come in,i end up getting the same thing.even though there is a lot of choices.\nthe lady that works there is very nice,and she's very fast.i don't know what is my favorite is,but i love boba.so i end up getting boba milk tea.\n\nthank  you for introducing the boba tea in US.","useful":0,"funny":0,"cool":0},
{"review_id":"WsrMpqR3-22C-EX_u9LbaA","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"tS65WnHV0QSJvjy9zHS8rg","stars":5,"date":"2014-04-03","text":"waiting for my order was worth the wait.the food is awesome.we tried almost every sandwich they had on the menu.the sliders,the gyro,the kebobs.I mean the food is heaven.","useful":0,"funny":0,"cool":0},
{"review_id":"uAR7v3PY8loLFA8y5zxvIA","user_id":"xWJFV5DQIC38_cEiq-FXUg","business_id":"GdHMZn1gEeVvz5-4u5TTug","stars":5,"date":"2016-07-16","text":"we checked out a car from enterprise on july 12,13,2016.\n\nREF 4ztrnn .Hoping this is the young man that helped us,really Nice guy,he was very helpful,he showed us how to operate things on the car.\n\nwe will be back .thank you .","useful":0,"funny":0,"cool":0},
{"review_id":"Xd171q-n5S8-NCK7YlfBFg","user_id":"OKvH5ACjMslZYSuP9uAdHw","business_id":"t-DxcWFBnd4m0wOxVnDRow","stars":5,"date":"2016-02-24","text":"I'm so happy that I was introduced to the McHenry's martial arts studio. My son has grown over the past few years and I have also grown since starting my training again. I would recommend this place to anyone who is looking for a place to train.","useful":1,"funny":0,"cool":0},
{"review_id":"nFX-Qbciem8isd5yh_AmZw","user_id":"OKvH5ACjMslZYSuP9uAdHw","business_id":"UsDRCbDndzVGLXrAylnxnQ","stars":5,"date":"2016-03-21","text":"Love coming here. Nicole has been doing my hair and my son's hair for about 5 years now. She is very polite and takes her time. I will continue on coming here.","useful":0,"funny":0,"cool":0},
{"review_id":"0Robys9b0Nn28bbV5ay-4Q","user_id":"XxGqSzuNu1JYjHyU38h7pQ","business_id":"awI4hHMfa7H0Xf0-ChU5hg","stars":5,"date":"2014-04-25","text":"As noted by all of the other reviews,  there WILL BE a wait as this place has only 18 seats and a limited number of cooking kettles, but your tastebuds will be so delighted that the wait will be well worth it! Upon approaching the Oyster Bar inside the Palace Station Casino you could smell the cajun spices and heat in the air.. just follow your nose! Fortunately there were only 3 people in front of us at 4pm on a Wed, so we only waited approx 15-20 mind for seats. Upon sitting down you can see the authentic kettles and masses of incredible seafood being prepared deftly by one chef. Lobster, crab, mussels, clam, brandy, garlic - ever delicious Cajun ingredient being expertly boiled, simmered, seasoned and prepared to perfection. I have only had seafood as flavorful as this on my one trip to New Orleans. Though we didn't have the oysters, they were being shucked right in front of us and they looked SO incredible! Huge and plump and looking so fresh, we will definitely be ordering a dozen to share next time! \nI had the combo pan roast level 6 of spiciness and JJ, the chef that prepared our food, cooked and spiced it to perfection.  It definitely had a kick and every piece of seafood was cooked perfectly - lobster, shrimp and crab. My girlfriend had the shrimp and lobster fra diavolo and it was spicy, brothy, and delicious. The pasta seemed very fresh and drank in the smoky, spicy broth amazingly.  The portions were huge and we left with enough food to eat for at least a meal or two later.  If you aren't grumpy hungry and are willing to wait a little while for genuine flavors and quality this is the place to go!","useful":1,"funny":0,"cool":1},
{"review_id":"IPwYeG2CE8JMrUiGgz_xzg","user_id":"XxGqSzuNu1JYjHyU38h7pQ","business_id":"XjepvTIfp4iqGq1orODedg","stars":5,"date":"2014-04-25","text":"Found this hidden gem via other yelp reviews and it lived up to the expectations and more! The bolis are as delicious as promised and the lunch cheese steak special was a fantastic deal (Included a soad\/tea and fries for about 7 bucks) . The dough on the bolis is just heaven. You can taste the homemade authenticity and care that goes into the preparation of each boli. Four Kegs is a bit of a dive, with only about ten tables but with food like this you will definitely want to venture away from the buffets and pricey fare of the Strip.\n\nEqually as amazing as the food was the cheery and friendly service we received from Kelly. She was sweet, knowledgeable,  helpful and fun! She made the experience even better by cracking jokes and just being relatable and friendly.  We left feeling like friends and definitely will be back next time we're visiting Vegas. I couldn't recommend this joint any more highly if you're looking for great food, reasonable prices, amazing service and a Cheers-like feeling in the heart of Sin City.  Kelly rocks!! Go visit her and enjoy some amazing food while you're at it! \n\nSide note: a lot of people have been confused by the directions\/location. We saw a sign for Four Kegs near a vacant McDonald's building and were a bit confused at first but with just a quick spin around the parking lot we found it with no problems.","useful":3,"funny":0,"cool":0},
{"review_id":"vY5S0gOQFAPPrWcP9Km-3A","user_id":"5G_9zVWPRtXjbx85GjiEtg","business_id":"R-XlTnuAH4E53QUgFPJAkg","stars":5,"date":"2009-02-21","text":"Dooby's Grill is a great find! The food is prepared with fresh and healthful ingredients, the presentation is attractive, and the service is the best. We dined here a couple of weeks ago with another couple, and then again last night; it was stellar both times. The owner is usually on-site and it is clear that he takes pride in his restaurant and providing a nice dining experience for his customers. This is the type of small, owner-run, quality restaurant that we should go out of our way to patronize, especially during these tough economic times.","useful":0,"funny":0,"cool":0},
{"review_id":"tRrFy8258iiVRrH6ZaDNSA","user_id":"YC-XkEhDMXpOmytCTpDZtA","business_id":"tAztGg5b6f4T4x1KbKy4fQ","stars":5,"date":"2015-08-26","text":"Awesome interior design resource for the most discriminating high end clientele.   From custom bedding and upholstery to the finest accessories,  Celia is the authority.  Trust you will get the results your home deserves.  5 stars for the \"WOW\" factor!!!  Strongly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"NiGdaWXLhyF_9pl0AA9R_w","user_id":"XxLrUorlzcoPtN18R9AI5w","business_id":"7Ny2GHLw8xl_kXfhfrvh5w","stars":5,"date":"2012-12-02","text":"JULYs are HOT HOT HOT.  just like the people here lol.  Interesting hip mod ambience.  easy to relax and unwind for a drink.  their burgers are super delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"sMfjHmdgEJ8atzL11SWkWg","user_id":"DyllEmNvshuCxDXiiG00RQ","business_id":"qdc_pmdSUF2gQ4QFww9gJw","stars":1,"date":"2017-11-22","text":"Went to upgrade three phones, add a line, the works.  Josh the store manager and Alex were very helpful, friendly and knowledgeable.  Took a little time but left very happy.  Thanks guys, good work.\n\nI went back a couple weeks later to return one of the phones I upgraded, lease was up and had no need to purchase the phone outright.  I talked to Josh again and he directed me to Jackie, a sales rep who could help.\nAll I said to Jackie was \"I want to turn this phone in, the lease is up and have no reason to own it outright, can I turn in to you or do I need to ship it back to Sprint?\"  Jackie, chewing and popping her gum like a 12 year old replied, \"You needed to make that decision when you upgraded your phone.\"  Followed by a big sigh and a slight eye roll.  Thankfully Josh was standing next to her while she was still sitting on her ass.  Josh jumped in and said I needed to return it to the store on W. Sahara and gave me the address.  Good thing my girlfriend was with me or would I have snapped on piercing in her face, crap attitude, unprofessional little miss thing Jackie. \nToo bad one awful employee\/experience can far outweigh the good ones.  I don't mind the store, Josh and Alex were great but if you get stuck with Jackie ask, beg, plead for anyone else to help you.  I think the door was more polite than Jackie.","useful":1,"funny":0,"cool":0},
{"review_id":"f6EOemx7YlGGoG-wjlZWkQ","user_id":"DyllEmNvshuCxDXiiG00RQ","business_id":"5nRJg6TN0k4AIh1NcCWiYA","stars":5,"date":"2015-07-07","text":"The last few years my health has put me on the brink of seeing the great white light. Now that I'm healthy I have been pondering a tattoo to remind me of how lucky I am to be breathing, and wake up to see the sun everyday.\n\nAfter 6 months of searching for the right design and tattoo shop I went to Skin Design. I was a walk in customer and the staff were welcoming, fantastic and put me at ease. I had a consultation with David Ruiz, the shops master \"Script Artist\". I gave him my idea and we made an appointment a couple days later.  David nailed it!!!!!!!!! I couldn't be happier.\nMy guess is this is Robert Pho's shop and his status in the tattoo world is top notch, and I'm sure he isn't going put people on his staff who don't meet his standards. Great staff, clean, sterile studio, the lobby is plastered with awards, trophies, and endless news and magazine write ups. \nIf you want a custom tattoo, don't look anywhere else.","useful":0,"funny":0,"cool":0},
{"review_id":"ib_RbSb2pn0t_MFeErg_uA","user_id":"hOwuzgwqQEIvxemOox19aw","business_id":"QP32Y5bCzSYKHR3cAMzemg","stars":5,"date":"2017-11-08","text":"Mike at ULTIMATE is the ONLY place to go in Scottsdale to add some \"FUN FACTOR\" to your 4X4, JEEP and\/or ANY SUV!! Tires, Wheels, Lift Kit or Total CUSTOM LOOK...\nHe's the ULTIMATE 1 stop shop!!!\nBeen doing business with Mike for 10yrs...","useful":0,"funny":0,"cool":0},
{"review_id":"N53f0hoYyy_ACv_UZP3FpQ","user_id":"hOwuzgwqQEIvxemOox19aw","business_id":"LLkMvt5vgc-7MDBAIPtbJA","stars":1,"date":"2017-07-08","text":"My 6mo Experience as a Client. \nChad the owner came to my winter home in N Scottsdale. Assured me that hiring AQUAMAN POOLS to maintain my pool with a visit every 2 weeks. To expect a clean, swim-able pool whenever we arrived...\nThings seemed fine for a few months although the \"Up Charges\" for Chemicals EACH VISIT seemed unusually excessive? Then my Landscaper started calling me saying the Pool looked terrible. Dirt on the bottom, Alge on the edges??\nSeemed strange since AUQAMAN POOLS just hammered my AMEX $179.00 two days prior?\nHad my next door neighbor check on the Pool and he confirmed it was unusable and hadn't looked like my Pool had been maintained in many weeks?\nI immediately called Chad the owner of AUQAMAN POOLS this Saturday morning. All I received (Twice) was his company's offsite answering service. No-one from AUQAMAN POOLS ever returned my phone calls this day?\nSent an email to Chad Firing him and his Company. Still no reply...\nIn my experience with 13ys home ownership in Scottsdale AZ and Pool Companies for part time residence or seasonal visitors. It's a constant SCAM where they continue to ask for your trust, bill your Credit Card every 2 weeks and NEVER live up to what is promised knowing that your not on site to make sure the work was done as invoiced.\nAQUAMAN POOLS and Chad the owner... Just another company with a nice Brochure. Over commit and under deliver.\nA Pool Company to AVOID!!!","useful":6,"funny":0,"cool":0},
{"review_id":"SIYq-41wMnhoB4SxFjN8Xw","user_id":"hOwuzgwqQEIvxemOox19aw","business_id":"0rFhC57cPyA6aU0Iz7cVIA","stars":5,"date":"2017-01-28","text":"Barbara has been an integral part of our business bookkeeping and accounting for many years in Scottsdale AZ. We currently opened a 2nd branch in SF California where she continues to offer remote service to the highest standards both in state and out of state. HIGHLY recommend her services!!! John M. Miraglia President","useful":0,"funny":0,"cool":0},
{"review_id":"gJzAjLQE_ToM_SYTEt764w","user_id":"dQRuAMoza2lPOq3ymgERbA","business_id":"evbEh0qRFWlqliHOy62c0A","stars":5,"date":"2013-12-30","text":"This salon had good reviews so I decided to take a chance and I'm glad that I did! I have had gel nails before but had a bad experience so I wanted to try again. They has the biggest get colors available that I have ever seen. I was very impressed. I got a gel French manicure and Tina was great! They turned out so well I couldn't be happier with the result. Every time I come back to Vegas for break I will make sure to come back to the salon!","useful":0,"funny":0,"cool":0},
{"review_id":"L0AUxGQNQUAoVWwj8OeilQ","user_id":"xwKA_dtSGDIJ6XwlUbF1yQ","business_id":"WzHvNjObVl3LqbG10JouIg","stars":5,"date":"2016-01-05","text":"Highly Recommended\nIf you have an Issue with your landlord Call them first, I had a dispute with the Property management after moving out and cleaning as much as i can on the property this company decided that not only that they will not give me my security deposit back but instead charge me for paint, to sum it up i have to pay an additional $1000. I called around most lawyers turn me down and some charge a lot just for a consultation unlike Cronus law they immediately accommodated me and schedule a Free consultation. \nThe staff and lawyers were polite and professional, I hired them on and the end result was i did not have to pay the property management company and even got a portion of my security deposit back.","useful":0,"funny":0,"cool":1},
{"review_id":"6LrLDfdGlW8NHDlgSu1dWA","user_id":"xwKA_dtSGDIJ6XwlUbF1yQ","business_id":"Kv_5f0DVSRZASJfhM7oiHA","stars":1,"date":"2015-12-03","text":"i had my whole car painted here at first glance the paint was ok, but a closer look reveals paint runs and over spray all over the car, he said he will repair the dents but he didn't, he replaced the front bumper which is misaligned he also replaced the hood which will not open now, not sure if he install the hood wrong or he broke my latch. bad experience with this shop, don't ever bring your car to this place they do crappy job.","useful":2,"funny":0,"cool":0},
{"review_id":"1oFnUh88uRJENQc9gP7dMQ","user_id":"lpORe6-W_5GSw40u6Zaj2A","business_id":"aOtP9VgdN6ZoxwjWY3TJeA","stars":1,"date":"2012-09-17","text":"We are ready to look for a vet that treats the animals with more compassion and respect for the owners. We have 2 x 5 months old puppies that  are now sick with diarrhea as a result of the vaccination. After several visits paying for lab fees and recommended food and follow up visits, the puppies are not getting better. Every time they recommend another treatment, the dogs get sick. Their approach is not with diagnosis but rather the shotgun approach even though we paid handsomely for the diagnosis.\nA quick update, since we stopped coming here, our dogs are now healthy as we're provided with solid information from our new Vet. I am very upset at this clinic because I feel they took advantage of our ignorance being new to dog ownership. It seems all they saw was dollar signs. Sad really.....stay away if you love your pet.","useful":1,"funny":0,"cool":0},
{"review_id":"AkB1nYHT-i-XNmkMIQNinw","user_id":"0JOKqe8cXZsvmYBejKZ_gw","business_id":"vpBwJ46ubkaaXyEPiHqCZA","stars":1,"date":"2017-01-15","text":"If I could give this place 0 stars I would. \n\nEveryone beware, we ordered take out for a party and when we opened the package at home only 2\/3rds of the amount of wings we ordered were there. This place is an absolute joke. The wings they give you are tiny and they cheat you on order size. Even after calling the store to complain the owner got on the phone and rudely told us we were wrong and he was right.  We paid over $120 dollars and got 50 wings when we should of received 80. Save your hard earned money and get your wings from duffs or all star. Do not be scammed by this wild wings and the dishonest owner\/management.","useful":0,"funny":0,"cool":0},
{"review_id":"KBLU67MOImbzE98iZcUWPQ","user_id":"Qy1UICsVBVbhAFuImloYyg","business_id":"QGAv-8tj5i4m4G-HDMnIbA","stars":5,"date":"2014-10-26","text":"This place has great french press coffee and O-Worthy french toast. The decor leaves a little to be desired, but the buttery, sugary goodness makes up for it. Come early or be prepared to wait in line. It's worth it!","useful":0,"funny":0,"cool":0},
{"review_id":"G36Roq2T8k9zcPXa9-ShTw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"bgBCvYf7wM2HdbzLad897A","stars":1,"date":"2015-03-03","text":"First time customer. Won't be a repeat that's for sure. Way too much to write, but I will say terrible service and incredibly overpriced. Payed $37 for 3 sandwiches. What the heck?! Easy on the mayo, guys. Sheesh.","useful":1,"funny":1,"cool":0},
{"review_id":"XL8AS7SFubvGQzyLaVFJXQ","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"bQ2uuNkOxgUQRM7Y7RJDXQ","stars":4,"date":"2014-04-15","text":"Such a cute little place! Awesome bar. Great ambiance. Small but has a nice patio. Was recommended the fish but wasn't the biggest fan. My friend ordered the carnitas.. Sooo yummy. Loved their tortillas. Friendly bartender who provided great service. Would definitely recommend.","useful":1,"funny":0,"cool":0},
{"review_id":"SpDkvMrv-RkxFf9Ttj79Fw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"aiX_WP7NKPTdF9CfI-M-wg","stars":4,"date":"2015-03-03","text":"Omgosh a million times over YES. Such good everything. Great for groups. A little pricey, but.... worth it. I want to live in the kale salad. As well as the pretzels and all the cheeses\/meats (even though they can be a bit stingy with some of their portions). New favorite bar in Tempe. Fox Concepts, you guys are so innovative and awesome.","useful":0,"funny":1,"cool":0},
{"review_id":"6Nj3jIOP5Tn0537zORafZA","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"MgHWbwuxxb_txhI3lK_bKg","stars":4,"date":"2014-04-22","text":"Love this place. Such a cute location - an old house w wooden floors and a fireplace. Lots of urban art. It gets really busy around noon, but if you take a later lunch, it's perfect. They play awesome music. I think it's geared to a younger crowd but good for anyone really. Definitely has the hipster touch, but it's not overwhelming. Food is suuuper yummy. I usually stick with the hot sandwiches. The BLT is TO. DIE. FOR. The North Beach is also very good. If you're looking for very attentive service, you're looking at the wrong place, but if you're looking for a nice place to chat w friends and not be bothered by someone refilling your water glass every thirty seconds, then this is a great choice.","useful":0,"funny":0,"cool":0},
{"review_id":"t3jDkNftUEnS2VCLmdFkvw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"ElWzx5_fU8S2G45OnM-HpA","stars":4,"date":"2016-01-13","text":"Food and atmosphere here is amazing. I've been twice and everything I've ordered and friends have ordered has been across the board delicious. Service could be improved but not a major issue. Called about happy hour today. They only offer 1 drink for $5 from 4:30-5:30 PM during the week. That's their happy hour. This place probably would have gotten 5 stars from me if they offered a normal happy hour and I probably would be coming in more often. Too bad.","useful":0,"funny":0,"cool":1},
{"review_id":"JZ6Hpwgtc-33wNfqpi_G7w","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"5VXsbrqyJx0a4iaa43RNFA","stars":4,"date":"2015-05-05","text":"I've been here on several occasions. The food is always so yummy. I like to get The Over Easy. So flavorful. The french toast is amazing (both versions), and to top it all off, they have FRESH SQUEEZED OJ!! Omg. I love fresh juice (This also makes for excellent mimosas). The ambiance is nice and casual. They play great music and if you can avoid their busy hour, the wait is never long. I've felt unsure about the service in the past, but had a great experience the last time. Wish I could remember the servers name, but he was very attentive. Overall, definitely recommend for breakfast\/brunch","useful":1,"funny":0,"cool":1},
{"review_id":"fJPgxPOMY60VMw5i5gOx0A","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"vC23Fq8lMkNiZ4F8yh3ukQ","stars":5,"date":"2014-06-09","text":"The most amazing sushi. Definitely one of my favorite restaurants in the valley. The jade and tiger rolls are amazing. The Hama chili is a great app. The mochi is to die for. I've never had a problem with the service either. I recommend this place to any sushi lover a million times over.","useful":0,"funny":0,"cool":0},
{"review_id":"pmu8bdNN_0L6d4JpMzULfw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"K-uQkfSUTwu5LIwPB4b_vg","stars":5,"date":"2015-07-25","text":"Had the best experience here for my birthday. Service was incredible (our server was Kyle - very knowledgeable about the food. We never lacked anything). The food is ridiculous. I shared the chorizo porchetta. TO DIE FOR. Everyone loved their tacos which were recommended by our server. We had a small incident involving one of our drinks, but both our server and the manager\/gm\/owner (?) went above and beyond to make up for it. Not only did the manager apologize, but he also brought out a round of delicious tequila for myself and 9 guests which everyone loved. If that was not enough, our server brought us (I'm pretty sure) every dessert they have on the menu. Both the tequila and 6 desserts were comped. I'm so incredibly impressed by our service here. They made my birthday dinner so special. I will definitely be back and recommend this place.","useful":1,"funny":1,"cool":0},
{"review_id":"OfMSO3iEj9L3I5zr69QjZQ","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"TVYJx5iUkLJFiuiXc8rxEQ","stars":2,"date":"2017-06-03","text":"Foods ok. Nothing to write home about. Service is definitely lacking. Probably won't be back. Too long of a trek, too much money for crappy service, and too many other, better pizza places to spend money.","useful":0,"funny":0,"cool":0},
{"review_id":"ax3A4yb6t_OMnptVGp2ifw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"OtGSQQzV7uF8XPAsNIh7Bw","stars":5,"date":"2014-04-15","text":"Unbelievable. No words to describe the magnitude of this place. Food's divine. View's divine. So romantic. Expensive, yes, but sooo worth it. Try the Chilean Sea Bass if you ever get the chance. OMG. Almost brought me to tears.","useful":0,"funny":0,"cool":0},
{"review_id":"f8rA_WaNBruvfZEjWbL6Yw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"yNPh5SO-7wr8HPpVCDPbXQ","stars":3,"date":"2014-06-10","text":"Was told great things about this place but was left disappointed. We started out with oysters on the half shell, and a cheese and meat platter. Can't really go wrong with those (as long as everything is fresh, which it was). For dinner, we asked our server what she recommended. The sea bass was so highly recommended by our server (Amber) that 3 out of 7 guests ordered it. When we started eating it, the 3 of us were shocked by how flavorless the fish was and the side \"salad\" it came with was a mystery to all of us. We weren't sure if we were eating corn or noodles or weird oats. We all returned our nearly $40 dishes and ordered new things. The waitress messed up the order and split the scallop ravioli between the three of us. The scallops were chewy and the thick cream of the sauce left me feeling nauseous. The server had a really hard time remember our requests throughout the entire dinner. The only reason I gave this restaurant 3 stars is because they took off the sea bass charges, comped our split ravioli and had good apps. Don't think I'll be returning any time soon. :(","useful":0,"funny":0,"cool":0},
{"review_id":"8yLRToob6Dyuk39jqiUR-Q","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"pHpU8lnnxMuPWRHOysuMIQ","stars":3,"date":"2014-06-30","text":"This is one of my best friend's favorite places to go to happy hour. Went there for the first time this week for reverse happy hour. Our server, Daniel, was very attentive and cheerful. The food we had was very good (brie sandwich and chicken fettuccini) and the ambiance was really nice. I liked it so much that I went back the next day with my boyfriend. I had the most delicious lavender fizz cocktail. My boyfriend was a big fan of his burger. Our service was definitely not as great though. I liked this place and I will probably go back, but I wasn't a big fan of the inconsistent service and the prices were a bit steep even during happy hour.","useful":0,"funny":0,"cool":0},
{"review_id":"YLK7aw2xquhszk_cGt4Ixg","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"-bMZCfTK7fxFaURynKpBMA","stars":4,"date":"2014-06-11","text":"One of my favorite mariscos (seafood) places in the valley. Their avocado salsa is amazing. They make incredible micheladas (which is surprisingly difficult for a lot of Mexican restaurants). Their cocktails are delicious. The restaurant is very clean. My only complaint is that parking can be difficult to find, but still, if you're craving refreshing sea food, I would highly recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"IRL4v8QaQApJJsqJH33N-w","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"jJDKPJLzkoPeytWIzstJrA","stars":2,"date":"2016-06-17","text":"This place is so cute. Good food and good beer but THE SERVICE SUUUUUCKS SO BAD. Want water for the table? Too bad. Want change? Too bad. Want your food quickly? TOO BAD. Hannah was our server. Awful. Just awful.","useful":0,"funny":1,"cool":0},
{"review_id":"WJ587I0Fv5N5UAodStS6GQ","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"X2EbcQ0VViUMmx5we0BM1A","stars":5,"date":"2017-03-05","text":"HOLY MOLY!! James is literally the best. Booked his service last minute for a 30 minute ride for a wedding. Not only was he the only company that was willing to accommodate such a short ride on a very busy day but he was on time and answered every call\/text\/question. I would absolutely recommend Arizona Bus Company. Their party bus was clean, new, and fit almost 20 people very comfortably. Thank you, James. I'll be sure to use your service whenever I need a party bus in the future. Oh! And the price was INCREDIBLY reasonable. The whole bridal party was thrilled that we could drink and dance for about $5 a person!!","useful":2,"funny":0,"cool":0},
{"review_id":"jaG6wYsnOQqdSLBeIOO_yw","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"MC3Dmq3HVKAkG6lWl6stKA","stars":1,"date":"2015-05-22","text":"What a horrendous place.  Went in for a spider bite. They made me wait 30 minutes when NO ONE ELSE WAS THERE. I was actually the only person in the office beside staff (2 people). Went in because I'm paranoid about bug bites. The \"doctor\" told me there was no sign of infection but as a \"precautionary\" measure gave me THREE prescriptions for \"preventative\" purposes - including antibiotics. Needless to say I won't be back.","useful":3,"funny":4,"cool":0},
{"review_id":"V1-5Ez2C5KLwwdiwI4yYqA","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"cdPnRYnfKrbeEUAoSJONtw","stars":4,"date":"2015-04-07","text":"Such a cute place. Really hope it doesn't go out of business. Definitely a \"hidden\" gem. Great service. Met the GM - he was super friendly and welcoming. Our server was upbeat, pleasant and answered all of our questions. They have an amazing happy hour. Half off apps and great drink specials. Their house margarita (on the rocks with salt) is deceivingly strong and delicious. They have the only tequila tap in the United States!!Their apps are awesome. The wild mushroom tamale is ridiculous. Highly recommend. The ceviche is amazing especially if you're a fan of lime. And their carne asada plates are impressive. Basically if you're looking for some gourmet Mexican food (I know that sounds lame, but it's true) and some great drinks, give this place a try.","useful":0,"funny":0,"cool":0},
{"review_id":"0aH-E_0T5bkTRAQdZ3HVTQ","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"TT68Q6iHmIe3zdETNKRC6A","stars":1,"date":"2015-11-16","text":"Actually the worst Panera I've ever been to. Went the first time. Told myself to never go back. Was craving a warm sandwich and I always go to the Subway a few doors down, so I thought I'd give Panera one more shot. Bad idea. Paid $10 for a sandwich, waited 15+ minutes for that sandwich (where they make you line up in a hallway - people sneezing right where the food is) The guy behind me was cussing bc he had to wait so long. When I finally got my food, found a cold sandwich that might as well been slapped together, wrapped in paper that looked like someone was crinkling paper to throw in the trash. To top it all off the sandwich STINKS - like smells terrible. Going right in the garbage. I'll never be back.","useful":3,"funny":1,"cool":0},
{"review_id":"Z9Im9Gd52AH4PXxAZz6SMg","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"C6KJ0L2BMc4o9vfbSsh8YQ","stars":1,"date":"2014-03-26","text":"Stayed here for my sister's wedding. Honestly one of the worst experiences I've had at a hotel. Front desk staff was shockingly incompetent and rude. Sat staring at their computers while we stood in front of them for five minutes without acknowledging us. They didn't even look up to tell us they needed a second. Took us forever to get our rooms and once we did get our rooms, they put us in the wrong one. We thought we lost all of my sister's baggage. Talk about unnecessary stress the day if your wedding. When we came down to try to fix the situation, they tried to blame it on us. The list of head aches they gave us and pretty much all the guests that stayed there for the wedding is too long to go through. It's only saving grace was the exceptionally kind maid staff. Still.. would never, EVERRR recommend this place to anyone. LIKE EVER.","useful":0,"funny":0,"cool":0},
{"review_id":"YvOpffZYX0678Ld2lOY15w","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"_5BaYz2A3l2SJvA9Hv6POQ","stars":4,"date":"2015-03-08","text":"This place is SO much fun. The customer service is amazing. Very accommodating. The bar is suuuper nice and they have these amazing 100 ounce personal beer dispensers that are great for a large group. Highly recommend for a night out.","useful":0,"funny":0,"cool":0},
{"review_id":"p0jrBe3CafVVyK31gqt9_A","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"1zsM7weLS8fNHomDAqCh4Q","stars":3,"date":"2015-03-03","text":"Had a horrible first experience at this place (during lunch) and thought I'd never be back, but since that was during their opening week, I thought I'd try it out one more time. Have been back twice since (both times at night) and have actually had a nice time. The ambiance is really warm and inviting, the music choice is pretty great and the bartenders are knowledgeable and attentive. I'm glad I decided to give this place another shot","useful":0,"funny":0,"cool":0},
{"review_id":"Rg0Ihyf01lT3ibRBedjsjQ","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"jiOREht1_iH8BPDBe9kerw","stars":2,"date":"2014-05-02","text":"I've tried this place on two occasions and was disappointed both times. I ordered the Gobbler and the Smokey Mountain (they got my order wrong) and both were just not that great to me. My boyfriend really likes this place, but I just don't see it. Idk if I'm ordering the wrong things, but it can't be that hard to make a good sandwich. Le sigh.","useful":0,"funny":0,"cool":0},
{"review_id":"hGcayMUK3HT4hHrq_wWvTg","user_id":"6oA8D7W2x2ECcUXMtAe6MA","business_id":"HjXI6lKGPVNQ8dYJPtaOCg","stars":3,"date":"2014-11-15","text":"I've been here several times. Beer selection is amazing. They have a great happy hour - probably one of the best on Mill. Pizza is really tasty. I think my issue with this place is their non-pizza food items. First time I ate there, got the Caesar salad - definitely not what I was expecting and I was not a fan. Also ordered the \"soft\" pretzel with salt - never again. Holy salt and hold the soft. The next time I ate there, I got the spinach artichoke dip, which was tasty while hot, but if you decide to not gobble it down, the texture gets kinda funky as it cools. Also ordered the Capri - mozzarella, basil and balsamic. Probably my favorite non-pizza item but it was still lacking something - more balsamic or some crackers... Idk. All in all... I will be back at least for drinks and happy hour. Jury is still out on the food.","useful":0,"funny":0,"cool":0},
{"review_id":"PEuEWAAglN2yKM6E3Soqiw","user_id":"VOXHZMoAwyQpSF2VDhpNfw","business_id":"GT1zMQJVc99gafri_wakKA","stars":5,"date":"2017-05-31","text":"I needed a new air conditioner and air handler, and I wanted a second opinion to compare against a company I have been using for 15 years. My wife suggested I try Bradham Brothers because she has seen their trucks advertising that they have been in business since 1975, and I also went on your website to look at the positive reviews. Not only were they less money, and Randy's presentation and explanations were extremely professional, my original company never followed up. The installation went extremely well, everyone followed up, the office staff has been very accommodating, and a serviceman just left who was wonderful. I strongly recommend that anyone who needs a heating and air conditioning company call Bradham Brothers.\nMatt L\nCharlotte, NC","useful":1,"funny":0,"cool":0},
{"review_id":"bBZM1q9EfXYutffrEL-xpw","user_id":"s6pVQ63SaNlhuYcZR21VIw","business_id":"GhvNgTOtCQQ1rXg-bh1WEg","stars":5,"date":"2017-05-02","text":"I contacted Wayne with very short notice asking for a professional photo session with head shots for 6 people. Wayne was able to accommodate and we scheduled the session at the time that worked best for my team just a few days later. Wayne was communicative, accommodating, payment was easy, and he made the team feel at ease during the shoot, the quality of the photos were also very good, and receiving the final photos was quick and easy to access. All round I thought Wayne did a great job and I would recommend his services to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"esnP1Of0KDp_8EG17VDYzw","user_id":"R5p2iFSrj2JlZ2H_xNg6tg","business_id":"hihud--QRriCYZw1zZvW4g","stars":5,"date":"2016-06-19","text":"Come to this place! You get to grill your own beef (which is a lot of fun) and the staff is very friendly and attentive. They also have lit music","useful":0,"funny":0,"cool":0},
{"review_id":"enOkW9mM7koPQzuB5Nspyw","user_id":"R5p2iFSrj2JlZ2H_xNg6tg","business_id":"5ma1OUQWy_Ds80xUiP7JPQ","stars":1,"date":"2017-04-23","text":"People made this place seem like the best place to get a burger but honestly... it doesn't live up to the hype. Not groundbreaking at all. My boyfriend and I left really disappointed, especially after spending $30 here (2 burgers, fries, and a drink). Definitely not worth the money. It took forever to get our food, and when we did get it, my burger came out wet and soggy? Literally there was water at the bottom of my plate and it was just so unappetizing I couldn't get past three bites (coming from someone who doesn't lose their appetite easily). On top of that, the cashier who was taking my order was giving me dirty looks when I was nothing but polite. Not really sure how I offended her but ok..... \n\nBottom line - I don't get annoyed easily but this place is the one exception. Please don't waste your hard earned cash here when there are about a billion other burger joints in this town. So not worth it!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"-jdwkXDO5YlZM7m0pa9OpA","user_id":"R5p2iFSrj2JlZ2H_xNg6tg","business_id":"755yRLsWBQFh2fdaIfKy1A","stars":5,"date":"2017-02-10","text":"Enrique is the best he's so nice and helpful and never gives attitude!!!! He always helps me find everything I need and he's a very attentive and friendly worker that's why I love coming here!!!","useful":0,"funny":0,"cool":0},
{"review_id":"ED2N7DfmStI2bdXkKTpbZg","user_id":"umnwRdzpzHPr8jHxgaHFlA","business_id":"oWh3TnsN5WrmPn7VgQNsWA","stars":2,"date":"2015-02-22","text":"Always have to check the car before I pull away or bring it back. Only reason I give 2 stars is they are always quick to fix but how many times should that have to happen.","useful":1,"funny":0,"cool":0},
{"review_id":"RmalxKCtyjMDdzaGj-lcig","user_id":"umnwRdzpzHPr8jHxgaHFlA","business_id":"tq2B9UpvdLNUW7tdVm-FrA","stars":5,"date":"2014-11-14","text":"Super nice guys. Hooked me up with all kinds of samples and advice. This will be my new go to for my nutritional needs.","useful":0,"funny":0,"cool":0},
{"review_id":"A2FCNIVwSY9MnBH7cnNAxQ","user_id":"umnwRdzpzHPr8jHxgaHFlA","business_id":"b3izhXwG2O3CagK_r8S6uA","stars":5,"date":"2014-08-29","text":"Great coaches, great members and a great facility. PIM is more than a Crossfit box, it's a community. Stay out of the Globogyms and get into Power In Motion, you'll know the difference right away.","useful":0,"funny":0,"cool":0},
{"review_id":"C5oHZXQJjj2EWSO8I3YGOg","user_id":"yu6WiYbS5fXIi16oD4tLiA","business_id":"-Mg-Ck6HITsRVPSUAa829A","stars":5,"date":"2015-04-10","text":"Everyone here is great! It is a friendly, nice environment where you don't have to \"hate\" going to the dentist. Every time I have gone, everyone was very nice and made my experience happy and pain free. Definitely would recommend this to anyone that is looking for a dentist!","useful":0,"funny":0,"cool":0},
{"review_id":"YR75apucebUB4XSUG6jEBg","user_id":"0XtXIBk4PQvjemWenll2Gw","business_id":"LtSJn2xwn6ykQBpGBw2WyQ","stars":4,"date":"2012-03-16","text":"I'm not an expert on Thai cuisine, but I visited this establishment using a group coupon voucher.  The starters were shrimp wrapped in a taquito-like shell, and a mango salad.  I enjoyed the shrimp, but I found the mango salad was too sweet to be a good appetizer.  For the mains my companion and I ordered a tofu curry and chicken in a cashew sauce with noodles, respectively.  \n\nNothing unusually striking with my chicken dish.  The flavor was quite acceptable and portion size was good.  My companion didn't have any complaints about the curry dish, and she even brought home the leftovers.  Dessert consisted of two pieces of fried banana and a scoop of coconut ice cream.  Both were quite appealing, though I accidentally got some of the fried banana syrup on my finger.  The syrup was incredibly sticky and I had to wash it off at a sink as merely using a napkin was not enough.\n\nThe dining area is small (under 10 tables), and the service was excellent.  I did not see a picture of the Thai king on the wall, which to my understanding every Thai restuarant ought to have.  But it certainly seems like a nice neighborhood place to go to as a repeat customer.","useful":0,"funny":0,"cool":0},
{"review_id":"1VH3cDm_oAo8RGvvWMGgmA","user_id":"EENi5iWbYEvC2oeuldLTZQ","business_id":"LQFmktF43j2NPncKdNd9mg","stars":5,"date":"2015-06-18","text":"quesadillas (jalapenos), smokehouse (chargrilled) whole wings, Mighty Fine Bovine - highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"XWQs0wSRMkxgDTnekwVwjA","user_id":"Z-FZ9gLg0EVYfZKVRClcNg","business_id":"uEx5j9wrtKldFBI8NBifzQ","stars":5,"date":"2016-01-29","text":"First time at the Nail Room and I must say they are quite awesome! Came in for a full set of Acylics w\/ gel and a design. The whole experience from beginning to end was amazing. They do exceptional work and are really caring. What I like the most is I had a couple nails where the gel chipped a little. They got me right in to fix them even though I got my nails done 3 days prior. Excellent customer service and such a cute spot!!","useful":0,"funny":0,"cool":0},
{"review_id":"X2BMC6h1LJxfs9-sEIWV5A","user_id":"TToSvjkVgMSZL0O7REkthw","business_id":"6z3cgIE9dJ01wUm43f0yBQ","stars":4,"date":"2015-06-08","text":"This is a great place to enjoy hand made Chinese boiled and steamed dumplings! I will definitely come again ^_^","useful":0,"funny":0,"cool":0},
{"review_id":"LcLNLIwhnMu1KlQ3EbtQRA","user_id":"B2rZgeVhMP_Ql3NP1QZOjg","business_id":"hTn7q68tdmFeCXoIdQG9JQ","stars":5,"date":"2016-11-04","text":"If you are looking for a Dr. with an amazing beside manner, who will say it like it is Dr. Iriye and the High Risk Pregnancy Center is the place to go.  From my first visit, I knew how fortunate I was to have found such a dedicated, and meticulous Dr.  \n\nHe immediately embraced me and my family with his good nature and straight forward approach.  Together we mapped out a plan that would protect both me and my baby and put me in a position for a successful and healthy pregnancy.  I am so grateful to have found a Dr. who is not only THE expert in his field, but also honest, direct, and tremendously knowledgeable and skilled.\n\nWithout hesitation I give the highest recommendation that I could possibly give for this fantastic Dr and his staff.  I wish only that there were more stars available for this review!","useful":0,"funny":0,"cool":0},
{"review_id":"wYxmoJNU072ppQV48MKEmw","user_id":"B2rZgeVhMP_Ql3NP1QZOjg","business_id":"4RfLQ8p6kxZIU-A6_bKG0A","stars":5,"date":"2013-04-21","text":"I'm so happy I found Smart Fix! My screen shattered on my galaxy note 2. Robert took care of my phone and it was replaced within a few hours! Great Prices and excellent service! I would definitely recommend them to anyone who needs repairs on phones or computers!","useful":0,"funny":0,"cool":0},
{"review_id":"7JmHD3xsvWIGlC5D11UJrA","user_id":"B2rZgeVhMP_Ql3NP1QZOjg","business_id":"90AbSkIrgfcsqeh2Hefa_Q","stars":1,"date":"2015-08-02","text":"I've been tanning for many years, so I know the quality of beds that work well with my skin and this salon does not have any. A few are outdated and still the owner insisted on over charging. Although I'm very disappointed with Custom Tan & Spas tanning beds I know a very good friend who loves the spray tans. Just this week I've referred three potential loyal spray tan customers. Just earlier I witnessed yet another side of Custom Tan & Spas unprofessional customer service from none other than the owner herself Paula Burr.\nPaula had shared her personal phone number with me earlier this year so I felt very comfortable texting her at 6pm tonight requesting a spray tan before a vacation tomorrow. Paula responded, \" Seriously, I'm off of work. I requested if there was another employee available. She replied, \" Seriously, this is my personal phone.\" Then proceeded to scold me with vulgar language and the most unprofessional attitude I've ever witnessed from a business owner. \nI will not send Custom Spa & Tan anymore business and I strongly urge everyone who considers going to this salon to think twice.","useful":1,"funny":0,"cool":0},
{"review_id":"4IqGkyZprNLWtOi8cSsbSA","user_id":"w5y0IskkO9-uJaQ0ldQpDg","business_id":"EVxY3Vcc-4uavsq2CQsk3g","stars":3,"date":"2009-09-02","text":"I had a good time but it didn't stand out. The music was good and it was very crowded (on a Thursday). I would go back.","useful":0,"funny":0,"cool":0},
{"review_id":"edgKZsxqcnozIkkJUX7-Ww","user_id":"w5y0IskkO9-uJaQ0ldQpDg","business_id":"w8zw4-3Ns2M4CQxeW9Bszw","stars":4,"date":"2009-09-02","text":"I've been here twice and it was fun both times. The stripper pole and free drink passes help. My friends and I will probably go back next year. The only downside is the bouncers give me a really hard time with my ID. I didn't get the third degree anywhere else, just JET.","useful":0,"funny":0,"cool":0},
{"review_id":"pGuc_AZrFc0RcSBxFY6dlQ","user_id":"sg8BADhXIHGpfnwfgPH5Rg","business_id":"woXlprCuowrLJswWere3TQ","stars":5,"date":"2016-05-03","text":"I went with the chorizo tacos. Very respectable tacos: good size, the chorizo is on point, served with a sunny side up egg on top. I'll go again.","useful":1,"funny":0,"cool":1},
{"review_id":"nLBb5SPDeXUazNnLxOHimg","user_id":"wcpOWvfD29fhKz4jIYu-eA","business_id":"6zZDTZ4ZZEYfN268iPz0uQ","stars":5,"date":"2017-02-05","text":"What a great meal, celebrated my daughters birthday and she begged to go to Red for their sashimi. Third time at the restaurant and all the food prep was beautifully presented and tasted fresh. Ryan was our waiter and was excellent, attentive but not hovering and chose the perfect wine for my wife.  His service completed a great evening!","useful":0,"funny":0,"cool":0},
{"review_id":"z8phDw6HNUHSFAc-jxG0ZA","user_id":"XyDC2jQvUHzFjl-x6hUyCA","business_id":"iJCI80Nwp514xIqBOgjhCA","stars":5,"date":"2017-11-26","text":"One of my favourite brunch spots for under $20! Fat Pasha is one Anthony Rose's well-known cohort of restaurants on Dupont. I've never been for meals besides brunch, but the restaurant is definitely worth it alone for brunch. \n\nFor 2, I like to order a Salatim (3 for $18) and an entre (one for less than $20). The red lentil spread with Moroccan spices is divine, and so is the chopper eggplant and tahini. The Liver and Verscht on rye mini sandwich is amazing if you like chopped liver. I'd definitely return to try even more of the appetizers and salatim.","useful":0,"funny":0,"cool":0},
{"review_id":"R1gYeYEsFvLqU3gUcHyLWA","user_id":"XyDC2jQvUHzFjl-x6hUyCA","business_id":"qaNt4vtVdge_S68DVjw5Jg","stars":3,"date":"2017-11-26","text":"I came in for brunch, really looking forward to the full English breakfast, especially blood pudding! But when I arrived they informed me they've been out of blood pudding for almost two months (something about suppliers). I was definitely disappointed but I still opted to try the full English breakfast set. The set came with a regular sausage, bacon, your choice of eggs, beans, mushrooms, and your choice of bread. The fried toast really stood out to me, great flavour. Unfortunately everything else was all quite bland.","useful":0,"funny":0,"cool":0},
{"review_id":"jr_CeHI_az7bWmy2_tic5g","user_id":"HPe9OdfkGlkasld7PkmUFw","business_id":"TYkfgh9-QWV0pDbHYg7x1Q","stars":5,"date":"2015-08-14","text":"I discovered this place as soon as it opened. It's clean, new, and the owner Brandon is always on site. They washed literally every crevice of my car. The staff is super friendly, hospitable and efficient. I will definitely be back and would highly recommend their services.","useful":2,"funny":0,"cool":0},
{"review_id":"8KXJfEWqng3rhxuXLrxD-Q","user_id":"tTajIvLjDsR08udF4OifrQ","business_id":"niw6_ZGlkl3ryYFuSBfaBw","stars":5,"date":"2012-01-03","text":"Fantastic little shop with outstanding customer service. I recently obtained a used violin and took it to Music & Arts Center. The staff was super helpful. They checked out my violin for free, showed me how to apply rosin to the bow, and recommended an inexpensive book to get me started. I'll definitely go back there for my musical needs.","useful":0,"funny":0,"cool":0},
{"review_id":"w5mPsFiX99awkYhvP7iVCA","user_id":"tTajIvLjDsR08udF4OifrQ","business_id":"sS2IKdaUne_8QwiAl6iyfg","stars":5,"date":"2011-12-30","text":"Always excellent food and service. My boyfriend and I eat here on nearly a weekly basis and have never been disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"uLWgg-3AXfZej-NsVXnEdQ","user_id":"tTajIvLjDsR08udF4OifrQ","business_id":"b-0q4xbL6EWYUqnwqcYM4Q","stars":2,"date":"2012-01-03","text":"Service is decent but food is highly overpriced for what it is. Will not eat here again.","useful":0,"funny":0,"cool":0},
{"review_id":"bNq_jkG00mBilMXbMY0l9A","user_id":"ecDzwMulljpElza_1ENcGw","business_id":"1PQzTopufAMDpx0HHBFeRA","stars":2,"date":"2015-08-12","text":"The only reason The Real Jerk received two stars is because the soup \nis tasty. If it wasn't I would give them 1 star for the UNACCEPTABLE service.\nI no longer live in Toronto and after a long day working on a film down the street I craved \nJamaican soup. I am Jamaican and can cook my own soup but after a 14 hour day\nI remembered The Real Jerk was now up the street. I just wanted take out!\nI was directed to the bar by the hostess and saw that someone else was waiting.\nWe were not acknowledged or spoken to except the \" woman \" behind the bar\nyelling to the hostess to come take our order because her PAD was not working.\nThis was after some time of just standing wondering if their was a policy I was not \naware of. A simple greeting, a hello please give me a moment something is wrong with my \npad and I cannot take your order. Nothing, we waited and waited. Then the young hostess \ncame over and I said the other customer was there first. She apologized for keeping us \nwaiting. STILL NOTHING FROM THE DISGRUNTLED BARTENDER, the \" woman \" \nI said, I don't have a problem with having to wait but I do have a problem with attitude.\nAbsolutely hate when my community, my fellow countrymen are tarnished with the \nsame brush as those who have bad manners. There is no reason to be rude in the \nservice industry, absolutely no excuse. We are the customer and a simple Hello\nwould have gone a long way. Oh did I mention a kiss teeth! when I stated the entire \nrestaurant did not to be a part of the drama over a key PAD. My LAST Visit.\n#Unacceptable #badservice #giveJamaicansbadname","useful":1,"funny":0,"cool":0},
{"review_id":"j4eUi45RB4J6rDhczMDOJA","user_id":"ecDzwMulljpElza_1ENcGw","business_id":"tvTx8Xk7_8iXWppq-ayxpg","stars":2,"date":"2017-07-08","text":"My 2 stars are for my most recent expeerience with Quince Flowers. I have used them many times for conveniance and for their selection on non traditional floral arrangements and plants. Yes their customer service is sometimes sketchy but whatever, I am pretty good at knowing exactly what I want in person and long distance ordering. This time it was a very special occassion and it wasn't about size or grandour but the right choice. I needed their help because it was a call in order and to say I was disppointed at how my very clear request was interpretated is an understatement. What made the lazy choice for a big birthday and specail occassion even worse was the response. Sorry it was not to your taste.......no how about your associate didn't listen and missed the boat entirely on what I asked for. The 2 stars are for past gifts that were bang on. You have lost a long standing customer QUINCE.","useful":0,"funny":0,"cool":0},
{"review_id":"U3T_DJ-QvK94Llp0O9p43w","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"oAq3-dXyDT3k4Mluc1ftTA","stars":4,"date":"2014-01-20","text":"I am giving this place a 4 star because the food is great and they do it in a very special way. I mean they cooked the food in front of you and they do it according to your preference. The staff are very welcoming and they made sure that you are very comfortable. They offer you right away something to start and not make you wait. The only thing that made me not go there more often is the price. This place is not really for people who are a bit tight but rest assured that you get what you spent.","useful":0,"funny":0,"cool":0},
{"review_id":"ZlBFlOI53EHUId2MYsENzg","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"NGr7u6mAhcEcjFu8r9njSg","stars":5,"date":"2015-01-16","text":"This place has the best roman-style pizza in Toronto, by far. Hard crust, all natural flour, without sweeteners. Truly, an authentic slice of Italy in the heart of Yorkville! Goes well with their birra artigianale!","useful":0,"funny":0,"cool":0},
{"review_id":"XtqvuximsZ3se4NvFuGIgQ","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"BJ9GwNMo8vIgSuKc6B_mOw","stars":5,"date":"2015-06-04","text":"I've been to this place many times as I work nearby but that is not the reason why I go there. Guess what, the food is great even though it is expensive. The staff are super nice and they made sure that they get you seated right away. The location is very convenient as it is located in the heart of Yorkville. I've been to different Chinese restaurant but nothing compares to Dynasty. I will definitely keep coming back to this place. Folks check this out and you will never be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"bWNcNPTa_vE-50ZT77UbCQ","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"2IKkooPTSW4YdrdptyBKbg","stars":5,"date":"2017-02-09","text":"I had an amazing experience with this place. The staff are too friendly and very helpful. The coffee is great and I think this place would be my new hub. The ambience are spectacular and I would say the owner really paid attention to details. I would highly recommend this place to everyone.","useful":1,"funny":0,"cool":0},
{"review_id":"6pR68sWxZw5HSb6CgzLuag","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"js9rQZAlA5rr7oSBRRcCDw","stars":4,"date":"2015-06-03","text":"I visited the place during lunch time and ordered their best pasta. I was never disappointed. Service is great and the ambiance is awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"KNWoLfMdExrimdizQZuW-g","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"GTwQgfi8DN23D9fMURYUdw","stars":4,"date":"2015-01-15","text":"The place is awesome, the service is unbelievable, thanks to the management for a job well done. \n\nI only give 4 stars because it is too impossible to be perfect. The food is great except for some that I don't like. The ambience is perfect for everyone except if you have kids because it is a little too loud but I don't discredit them for that. The crablet is my favorite, the rolls, and the fish are beyond expectation.\n\nI did take out orders and by the way, I have to pick it up because they don't do delivery. I can't believe how fast they are in preparing my orders especially I did it on holidays. Good job guys and I would definitely recommend you to all of my friends to get the chance to know how impeccable the service and  how mouth watering are the foods. \n\nThe only problem here is the parking. It is very limited as it is located along the street. I am always lucky to get one everytime I visited this place.","useful":0,"funny":0,"cool":0},
{"review_id":"6hpllVcMgmK2wVayoCEiZA","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"RdwHiTJzpCU4Q8pgsJhiKg","stars":3,"date":"2015-06-03","text":"I've been to this place for  quite sometime now and I find it very busy especially on the weekends. I tried their chicken and I can say it is one of the best I've ever tasted. The pansit also is mouth watering and the kare-kare is worth the drive.\n\nThe place is a little bit small considering that a lot of people goes there for lunch or dinner. The ambiance is quite off. The crews are great and very helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"DrdNuwGK1CQHY3TP0i0t8w","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"okQw1wEERhes49YCuBR9gA","stars":1,"date":"2015-11-09","text":"This clinic is horrible and insensitive. They only care about money and nothing more. Did several treatments trying to give them a chance but results aren't to satisfaction. The only thing they're good at is selling you package. I told them that I am not seeing results but they keep on selling me still and trying to convince me that I need more session which I already did. Don't go to this place. Money grab!!!!!","useful":3,"funny":0,"cool":0},
{"review_id":"PpC8GA2h9pHCtjdrdUY43Q","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"F7J7p6IYmvKqMiJQIvW3jA","stars":5,"date":"2015-06-05","text":"10 months ago I experienced sudden shedding of my hair but I just ignored it knowing that it is part of my stress at work. Day by day, I've been trying to check my hair line and receding area and I noticed that it is slowly going until to my surprise that my shedding is getting worst. \n\nI did some research and consulted a dermatologist but only advised me to take some medications which i did followed for a month with no results at all. I opted to consult a naturopathic doctor and same thing happened. I almost lost hope until I found this clinic. I went there for a consultation and the consultant did a visual analysis of my scalp to find out if my follicle is still active or not. He was very informative and detailed as he knew that I am very anxious about my condition. After the assessment he advised me to do the treatment and I quickly signed up for everything that he offered although I dont know if this will help me or not. I am so desperate at that time but he make me feel at ease.\n\n4months after I started the program to my delight, my hair loss stopped and I started noticing some regrowth. I didn't expected such a short time I will notice the difference. He again did the follow up and suggested to do the PRP which I decided to go right away as he is the guy that don't lie but only look after the best for you. I am very pleased with the service and I will update you folks again in 3 months time as he will do my follow up again.\n\nThe place is very clean and the staff are very helpful and great.","useful":0,"funny":0,"cool":0},
{"review_id":"AI8qfHSM4y8n-8UNSUzSvw","user_id":"lOgAPUhluhodv5eMD_MRRw","business_id":"ST6-qv5rLDsahp5w_Uyufg","stars":5,"date":"2014-01-20","text":"As far as laser clinics go , bellair is great. Remember these places open and close daily. I was surprised to learn theyve been around for 9 yrs. great! So far my treatments have been successful. After my third laser hair removal treatment results are great. That may change, but good so far. I will update with my fifth treatment. Place is clean and comfortable. I look forward to seeing what happens next. \nAll indications are good, and if thats the case i may try some other services","useful":4,"funny":2,"cool":2},
{"review_id":"NeoySA0lR7280_b57tzzeA","user_id":"413YzVqqXfbpTAGvczc-dg","business_id":"mIlQi6nZdFbEAjZuQ6pFfQ","stars":5,"date":"2017-05-19","text":"First time there got take out Pizza was very  and my boyfriend got the calzone was good will be going back in the near future.... My veggie pizza had the perfect amount of crispy crust. Will let my friends know thanks also for the best costumer service that anyone can ask fot6","useful":0,"funny":0,"cool":0},
{"review_id":"z9GtJJDHBQH69KkwN844bA","user_id":"413YzVqqXfbpTAGvczc-dg","business_id":"Qn_mBXvKnn9VeOKym0Ussw","stars":5,"date":"2017-05-22","text":"My family eats there all the time it is hard to find a good wholesome place to eat! the wait staff is AWESOME! we walk in and the waitress is ready is getting our drinks and pretty much knows what everyone is going to order and we have pretty much tried everything on the menu but we have our FAVS!!!!!!!!!!! I can't just pick one thing  off the menu to talk about because it is all good try it for yourselves we will keep on going back..... the food is good and prices are good and the great wait staff","useful":0,"funny":0,"cool":0},
{"review_id":"UlU3OFCcDFEtInV6BWDomw","user_id":"qEYymn-qAM-2pQy-L6q3Cw","business_id":"sMzNLdhJZGzYirIWt-fMAg","stars":4,"date":"2015-12-23","text":"We stopped by Mezzo (the second floor) on a Saturday night. Even without a reservation (probably advised), we were seated right away. We really enjoyed our server, who really wowed us by describing and recommending a wine, and weeks later we're still raving about the pistachio and porchetta pizza.","useful":0,"funny":0,"cool":0},
{"review_id":"440h6xRpL7x1vf0KmyJepA","user_id":"qEYymn-qAM-2pQy-L6q3Cw","business_id":"xN4d1pftLwL2k0FDeFX2_g","stars":5,"date":"2015-12-23","text":"I love Sara and all the gals at Motive. The atmosphere is welcoming and laid-back (not something you can say about all salons this good!) and no one picks up the scissors -- even for just a trim -- without a conversation about what you want. I recently went from shoulder-length to a long pixie and I've never been happier.","useful":0,"funny":0,"cool":0},
{"review_id":"qnA14ZfivqDUrtXS24CETg","user_id":"qEYymn-qAM-2pQy-L6q3Cw","business_id":"oRKyGtUsN5IcRReN7ScUwQ","stars":4,"date":"2014-01-29","text":"Like an earlier reviewer, I live in Observatory Hill where there's a dearth of delivery options. We were very grateful to find Riviera Pizza! Yummy pies, fast delivery and friendly service.","useful":0,"funny":0,"cool":0},
{"review_id":"tWwEk8-Fz-D9DYMVFtK0Og","user_id":"qEYymn-qAM-2pQy-L6q3Cw","business_id":"u9TShE-DgHKAeLOLVez_Fw","stars":5,"date":"2015-12-23","text":"So I did a very stupid thing and accidentally topped off my oil with antifreeze (It was dark! The containers are very similar!). I discovered YourMechanic while trying to figure out how to get my oil changed without starting the engine and driving somewhere. It was easy and convenient to make a next-day appointment online. I knew right up front what the cost would be (and was delighted to find it was even bit *cheaper* than my usual mechanic). Josh called to confirm and follow-up on my specific problem. He arrived right on time and was professional, friendly and efficient. He didn't try to upsell me on anything or talk down to me (ladies, you know this feeling at the garage, amiright?). The whole thing took less than an hour and was basically like having a really competent gear-head friend whom you could ask to come fix things for you. It doesn't get any better than this!","useful":3,"funny":2,"cool":1},
{"review_id":"q0iRkccEMpS9FFfMXGNiMA","user_id":"V-5y-_oc2-w6mG_lWjWN4w","business_id":"sOs9goJyHT5Ggu1hTsp3kg","stars":4,"date":"2017-03-21","text":"Update - returned to the Great Dane in Fitchburg.  Had the Mayan chicken wrap, spinach tortilla wrap with lettuce and grilled chicken and a nice ranch-based dressing.  Asked for chipotle mayo on the side, was not needed.  New chef or just hit them on the right night.  Anyway, far superior to my last visit here.  Very nicely done.","useful":0,"funny":0,"cool":1},
{"review_id":"BDVTGC3LPtIsEdT5lwqxjQ","user_id":"V-5y-_oc2-w6mG_lWjWN4w","business_id":"oIVc4K0jQNRtBKbIQmEqcQ","stars":2,"date":"2016-09-18","text":"I wanted to like this place, I really did.  In town from CA to help some family members move, and the Great Dane is right down the street.  Went there Fri and Sat nights for a few pints and carry out.  Fri night - nice atmosphere, nice time, and a very good steak salad to go.  Sat night - ruined by an entire soccer team of 10 year old kids coming in during the Michigan football game and sitting at the bar.  On college football Saturday at 6:45pm?  Really?  What \"pub\" allows kids to sit at the bar on a Saturday night?  And we're talking 15 kids, I counted.  Hello, manager?  How do the 10 year old boys sitting around the bar on Saturday night help your bottom line?  Totally ruined my experience there.  Oh, and the cheddar mac w\/ buffalo chicken that I ordered to go basically sucked.  Should've stuck w\/ the steak salad.","useful":0,"funny":0,"cool":0},
{"review_id":"qVnnNVYyB_bXGoiP5LO2BA","user_id":"X3EoCzwcADB6YplnAANSfg","business_id":"olmCDBoMF-EhN8U2livBSg","stars":5,"date":"2014-05-08","text":"Excellent selection of cookie's price is right spending $60 dlrs on cheat day priceless .","useful":0,"funny":0,"cool":0},
{"review_id":"62BtZS-1a_RnJ5v0qsYf0A","user_id":"X3EoCzwcADB6YplnAANSfg","business_id":"iSQwKRrLYYi-dI2PpJmJJg","stars":2,"date":"2016-04-04","text":"Don't order shrimp tempura  in all you can eat . Under staff during lunch time other wise  the rest is average","useful":0,"funny":0,"cool":0},
{"review_id":"3CYH_03G3ZtIHoA3gIWpLA","user_id":"ETmpBain2s02PqHGwSr7hQ","business_id":"VRTfAP2DjvUYxRY3dw37hA","stars":4,"date":"2014-01-08","text":"Luxurious. But of course, you'd expect that from the Bellagio.\n\nChi, my pedicurist, was wonderful. Super sweet and very attentive. She took her time with the scrub and massage; after a couple of days in Vegas, it was heavenly. When it was all over, I was kicking myself for not scheduling additional services - I didn't want to leave!\n\nFour stars instead of five because:\n- The ladies in reception were a bit rude, both over the phone and more so in person. \n- My pedicure only lasted two days! A pedicure from anywhere else easily lasts me 2, even 3 weeks without a single chip.","useful":7,"funny":0,"cool":0},
{"review_id":"iR0CTy7yDzjDZzzDhOhmew","user_id":"gVmsL-FroEEx5mZSRqEa4Q","business_id":"sgeH1aWYynK1BQiouCTMtw","stars":5,"date":"2013-01-14","text":"Great place for breakfast and lunch. Friendly service and ample menu. One important must for me is real cream for my coffee and they have it in the individual servings so you know it's the real thing. Also big points for using Breadworks bread. Great place to become a regular!","useful":1,"funny":0,"cool":1},
{"review_id":"4iaUljrj9bPeNq_IjNN0YQ","user_id":"gVmsL-FroEEx5mZSRqEa4Q","business_id":"tPHYc6rKiA0zrXOcLaX7kQ","stars":1,"date":"2017-07-15","text":"I was sorely disappointed after making a special trip to this place after reading the reviews. Very chaotic and limited selection most of which were filthy and haphazardly placed about. Price tags on items were ridiculously over the top. Of course \"some items\" were on sale according to the owner, but we found him to be rude and aloof. Not worth going if you're looking for anything special.","useful":1,"funny":0,"cool":0},
{"review_id":"u4rP4bA41ZHlBFapFoAd0w","user_id":"gVmsL-FroEEx5mZSRqEa4Q","business_id":"uEzodpjckhsVQFfsXpFR0w","stars":1,"date":"2013-01-14","text":"Needed to try the new place but won't be back. Don't think it will survive long on the mount. Small inside and cold!!!!! Asked specifically if they used Breadworks bread and was told they did, but when I goy my sandwich it was on plain old square bland wheat bread. Very disappointing. Also the pepsi tasted flat and\/or diluted. May be a good place to go after bars close and you're so drunk you can't tell what you're eating but I wouldn't recommend it.","useful":4,"funny":2,"cool":0},
{"review_id":"HasdWUHX1M7Fxog2fCgsJA","user_id":"gVmsL-FroEEx5mZSRqEa4Q","business_id":"zZuDZscQgFS8cgjK76t7WQ","stars":5,"date":"2017-07-15","text":"This was a lovely gem to find with a huge selection of items. Several rooms and things laid out invitingly to peruse through.  One of the owners spoke with us and was very personable and helpful. While pricey the items were interesting and unique.","useful":0,"funny":0,"cool":0},
{"review_id":"Wctr0grWV3FuQ8JKZmMomg","user_id":"gVmsL-FroEEx5mZSRqEa4Q","business_id":"nlVjdQq9FzdQ3bfy-8y80g","stars":2,"date":"2012-06-07","text":"While the Dor-Stop is a cute place on a nice tree lined street, I'm not sure what the big fuss is all about. The food was only fair and they don't even have real cream for your coffee. It's that nasty fake nondairy crap. It also gave me the heebeegeebees due to the \"Christianesgue\" motif.","useful":1,"funny":0,"cool":0},
{"review_id":"ydiV3vtGorz0AqV5Ic-u7A","user_id":"VcGRlOctwTS-ZFXwVK211A","business_id":"lyIHmlIK7PKwQeGyR8svJQ","stars":5,"date":"2014-05-02","text":"I was just so pleased and satisfied with my meal I had to write about it! Initially I meant to get one of this restaurants famous crepes, however after learning they served breakfast until 2pm and spying their new breakfast menu, I found I simply could not resist their house omelette with prosciutto & Brie!! Two of my favorite special foods in one perfect omelette. \nI arrived at what must be one of their busiest times, and after some initial confusion as to who was lining up for take out and who was lining up to be seated I joined the correct line and waited only about 4-5 mins before a very pleasant hostess greeted me. \nI was on my own and was seated immediately at a lovely, comfortable corner booth\/table. Guessing they would be too busy to make it to me quickly I put my coffee order in with her. By the time I returned from the bathroom (v well kept!) a server was bringing my coffee order. \nI had had a chance to review the menu while waiting and put my order in immediately.  The male server was friendly and efficient and I was left to my own devices to wait for my food. I watched the staff moving back and forth in this small establishment with ease and dexterity realizing they had a well oiled machine! I looked around and appreciated the simple decor was very clean & well maintained. \nMy server came over with more coffee apologizing for the delay (a party of 6 had been seated just before me, but after he returned to my table with more cream another server brought my dish out! (Also apologizing) I should note that I did not feel like I had been waiting long at all. \nIt was beautifully plated with a very fresh spinach and mixed greens salad and the gorgeous, thick balsamic dressing in a tiny metal dispenser on the side. My choice of toast was also served up, perfectly toasted and buttered just slightly so as to also enjoy a side of jam. \nMy meal was excellent and very well priced at $11.50, and, as only a good meal can I left with a big smile on my face despite the rainy day I walked out to.","useful":0,"funny":0,"cool":0},
{"review_id":"Z0YVpuuVVDBNhf4mCiEiZw","user_id":"eeSdZhqaYBS8hho2JpXFYg","business_id":"2AcO-aHnBqx94dU2Z4Em2Q","stars":5,"date":"2014-06-14","text":"Trying the new Brunch menu today with the TMD Bridgeland Benny. They even offer it with the option of gluten free bread. It was Yummy. New menu has lots of the favorites plus a bunch of new dishes for me to try. Looking forward to my next brunch.","useful":2,"funny":0,"cool":0},
{"review_id":"YbZDS_RQJYJukhpISlMt1Q","user_id":"UHSLX62LF-49QQRqpkhlyw","business_id":"ezorqG4R6QCaIMVVMfTAoQ","stars":1,"date":"2016-05-06","text":"Rude. Called with a question, and before I could even say 2 words of it, she interrupted me with \"I don't know.\" Funny thing is, I know what question she thought she was answering, and that wasn't my question at all. I chose not to clarify as there was no point, I wouldn't do business here after that encounter.","useful":0,"funny":0,"cool":1},
{"review_id":"n6MFZa9O5qMlsEsWZEohzA","user_id":"BmhGMBuTah-Cireo9xl_ZQ","business_id":"1p76_EWPbPcTprNrEVw3-g","stars":2,"date":"2016-05-13","text":"RUDE. SKIP THIS PLACE. I've tried to call in togo food 3+ times (separate times). They never pick up! EVER!! Their phone may as well be disconnected.","useful":0,"funny":0,"cool":0},
{"review_id":"jCwkQFHZ-3iJd8CPeYhntg","user_id":"BmhGMBuTah-Cireo9xl_ZQ","business_id":"-IZvuqxekWEvJqDw308daQ","stars":3,"date":"2014-11-16","text":"If the staff isn't over flooded with orders the food and service is fine. If they are busy they ignore call in orders and the burritos kinda of suffer.","useful":0,"funny":0,"cool":0},
{"review_id":"uEzWNzeR1y3mpVOfMNGb1A","user_id":"BmhGMBuTah-Cireo9xl_ZQ","business_id":"lH8cGkcpBIz4KX_zwLjKCA","stars":2,"date":"2016-03-15","text":"Disappointed! Been coming here for years for my hair but lately they've been mixing up my appointments. Saying it'll be 45 min to 2 hours wait time for something I was told I booked. It's sad that the stylists lose business because of reception.","useful":2,"funny":0,"cool":1},
{"review_id":"Oxx-ea1TBdo0nasXCRUYxA","user_id":"R10Z-cARRfKIffd10_h0kw","business_id":"Bk3yUv6mJqSCTbyFNbgeSw","stars":1,"date":"2014-06-05","text":"Equity Trust was my FIRST AND LAST experience with a self-directed IRA account.    If I could give Equity Trust  zero stars, or less than that, I would.  After deciding to close my account,  Equity Trust sat on my transfer request for more than 2 months!\nBecause I had liquidated the majority of my stock holdings intending to purchase real estate, most of my account was in cash.  Equity Trust MADE EXCUSES AND LIED  about having to check an issue with the IRS before transferring my  cash from my IRA account to my IRA account at another firm.  I threatened to contact the OH State Attorney General Office.  Even the other firm, one of the largest, most reputable firms in the business, said Equity Trust is one of the \"most challenging smaller firms.\"\nDo yourself a favor and invest elsewhere!","useful":11,"funny":0,"cool":0},
{"review_id":"L5f_HuWFzyH3JJlwMg8Yug","user_id":"R10Z-cARRfKIffd10_h0kw","business_id":"2aVQu4wnptrFM_kxDhhPIg","stars":1,"date":"2016-06-19","text":"Food quality is poor, nutritional value is  worse and customer service, non existent.  Frozen dinners at any local supermarket are superior to Freshly.com, and 1\/2 the cost!","useful":1,"funny":0,"cool":0},
{"review_id":"LsbSwB2ok2BsR9fCp8qoAg","user_id":"jHJ8VwljKDrU7O1aL_hQ5w","business_id":"7UCj5fj-aETTn3johW1LRw","stars":5,"date":"2017-02-27","text":"Great food at reasonable price. Our favourite is the chicken tikka kabob.","useful":0,"funny":0,"cool":0},
{"review_id":"bfzWC6PqTxlVJJvEDw0rgA","user_id":"jHJ8VwljKDrU7O1aL_hQ5w","business_id":"OFGG2L6VB_FFKLgInoE2vQ","stars":5,"date":"2017-02-27","text":"Great food at affordable prices. Our favourite is the vegetable Manchurian.\nGood variety, however, be forewarned that spicy really means spicy here.","useful":0,"funny":0,"cool":0},
{"review_id":"aHdUz7aEXg-s2SEzOCMzHw","user_id":"jHJ8VwljKDrU7O1aL_hQ5w","business_id":"u9I76w2uQ8QwYfriy02E1g","stars":5,"date":"2017-02-27","text":"Great food, great coffee. \nWe had a grilled veggie panini and banana zucchini chocolate chip muffin with macchiato.","useful":0,"funny":0,"cool":0},
{"review_id":"Oyv8SEOhOVMz6IZ1ONZp2w","user_id":"jHJ8VwljKDrU7O1aL_hQ5w","business_id":"Kpk1wm96lLQV3gJWNumfbg","stars":5,"date":"2017-02-27","text":"It was a great experience as George was able to prepare us for our wedding dance in just five lessons. We were impressed with his talent as he choreographed a ballroom routine to a Punjabi song.","useful":0,"funny":0,"cool":0},
{"review_id":"82-hyRCPh4vExk00HoCEUw","user_id":"jHJ8VwljKDrU7O1aL_hQ5w","business_id":"Sk0Ycurq7D083Qs8x65b_Q","stars":5,"date":"2017-02-27","text":"Great food, great presentation.\nWe tried the 5 course dinner tasting menu. On average it takes around 2.5 hours. Small portions but with 5 different items it was very filling.\nThe servers explained each dish.","useful":0,"funny":0,"cool":0},
{"review_id":"jKwukn8PLvK1yncwBqZNXA","user_id":"ZGubwHGHEm1QNgu82MCGrA","business_id":"lxPWvoHDxgxBXIwfRjtLwg","stars":5,"date":"2011-01-12","text":"One of my favs spot to chill whenever I'm in Vegas. It's away from the main but yet close enough.  The price is fair on the cheap side with decent services.","useful":0,"funny":0,"cool":0},
{"review_id":"HZtRwQdWWwhza7yx2dUIbw","user_id":"ZGubwHGHEm1QNgu82MCGrA","business_id":"TVbVii4EUQt9DG7y698zIw","stars":2,"date":"2011-01-12","text":"Services is ok, buy need mucho helps. Very unorganized. Food is average.","useful":0,"funny":0,"cool":0},
{"review_id":"D3m2dCaSSVEMqSkIsauvUQ","user_id":"dQGHCseN1-2N0pYiQuw1mg","business_id":"RnxgXS5iAxVvP9gHgvagGw","stars":1,"date":"2012-07-22","text":"HORRIBLE(but read on for the details). Ok, this one is a bit long winded, but a definite MUST READ. My AC went out over night on a Saturday. I called One Hour when I woke up at 5:00 a.m. to see the ac wasn't working. They said the earliest they could get to me was from 12 a.m. to 4 a.m early Monday! Well, I guess I had no choice. Lucky for me Sunday was filled with Thunderstorms so the high was only 95.\n\nGuy ends up coming at 1 a.m. making Monday's work day awesome....\n\nFlash forward to Monday afternoon when I get off and come home. The AC wont go down below 77 now. Call back, they come see me Tuesday between 6-10. \n\nEverything seems to be working fine when now come Saturday again, the AC stops working again, turning on for 15 seconds, then off for 15 seconds, and over and over, not going below 77 again!\n\nBottom Line: It is impossible to get a time for them to come out. They are can get nasty on the phone when you tell them their service is unacceptable. Plus, nobody can tell me why the heck they have \"One-Hour\" in their name! \n\nSide note, I paid $7,800 for the A\/C unit from them and it isn't even 4 years old and I am having these issues. Plus, I get my vents cleaned by them and all.","useful":8,"funny":0,"cool":0},
{"review_id":"pooO4zBfagKYN_ORL2PkTg","user_id":"AltqUdNcUu2ZT0cb7Y2TYg","business_id":"gFjHMjQXn5pbObxJupiuPA","stars":5,"date":"2009-04-16","text":"One of the most amazing meals I've had the pleasure to enjoy.  As you've read, this is a tasting meal, we didn't have any of the dishes previously mentioned as they have a rotating menu.  \n\nYou get to see the chefs at work and they are also very nice and as we learned a lot of fun.  The service is impeccable and incredibly knowledgeable.\n\nThis is not  priced for the faint of heart - $100 for the 5-course menu \/ $175 for the 8-course and $250 for the 14-course menu.  I will say as others have posted, don't think that you'll be hungry after this meal, we ordered the 5-course and were full.  The dessert was AMAZING and was accompanied by a chocolate flight.\n\nSide Note - Conrad is - I believe - the Manager - and he was sensational - a great host and ambassador for the restaurant!","useful":2,"funny":1,"cool":2}]
