[{"review_id":"a8uWQJQMq14CJf-QDQPNTQ","user_id":"g93o6YThieCI3zlknkNZaw","business_id":"h4ySBm8Lh3Wi1UDmIApy0Q","stars":4,"date":"2014-01-22","text":"I went to this store not expecting much because I know it is owned by Kroger which is associated w. Food 4 less n Ralph's which are very dirty stores. I usually only shop at like fresh n easy or trader joes but I've been trying to cut my grocery bill down. So I decided to go to Smiths n check it out. I was surprised. It was fairly clean n they had a pretty decent health food section for reasonable prices. Idk if all of them are like this but I would shop here again.","useful":1,"funny":0,"cool":0},
{"review_id":"72ttocqoxcSGkhvWoLSkCw","user_id":"IDpkarNF0R-JPOA8YfgUnw","business_id":"LXd_baf-l2NeQtb3txqEhw","stars":5,"date":"2016-11-21","text":"My spouse and I did relocate from coastal North Carolina to Summerlin. Being very unfamiliar with the area, the local building structure and the dry weather landscape, we definitely needed a buyer's agent. We researched on Yelp and came across Faith Harmer from Urban Nest Realty with excellent reviews. We called Faith and described our situation. Even when we were still in NC, Faith set up a MLS page for us with houses meeting our requirements. As soon as a new listing came out, we received an e-mail message. When we made the move in our RV to Las Vegas, we met Faith and Heidi Tuai in the office. They gave us a very detailed overview about the current market and answered all our questions about the different areas in Summerlin. Then we went house hunting for 1 1\/2 weeks, changing our mind about the ideal house several times. Seeing the houses, yards, neighborhoods in reality is a much different experience then just exploring them on the computer. Heidi and Faith guided us through this very emotional decision process. We had always experienced that they put our personal interest first. Heidi and Faith never tried to push us in any direction or to higher priced properties. When we finally made our offer, they guided us through the buying process, helped with the inspection and any outstanding repairs. Now we have a house where we feel at home again and in an area that fits our needs.\nI highly recommend Faith and her team for all your real estate business.","useful":0,"funny":0,"cool":0},
{"review_id":"IotEqPlWnC-I-NMmSNqhUA","user_id":"ftlcDO2lLU31zDc5OvvD9Q","business_id":"bpRo8L8dkhgbJhdIKa9mwA","stars":5,"date":"2012-10-12","text":"pretty trendy atmosphere. everything I ate was incredible. ordered the 10oz filet with grilled onions. TO.DIE.FOR. every single bite. \n\nwe (7 girls) shared the:\nmac & cheese: incredible. big pasta, browned over.\nparmesan truffle fries: big steak fries. nice and truffley and salty. \nasparagus spears(don't see them on the menu right now): creamy and big spears.\n\nmy friends got the sirloin. it was tasty, but i preferred my filet.","useful":0,"funny":0,"cool":1},
{"review_id":"z8iXGVE_eu9fAw11HzVphQ","user_id":"06cmevZ_UdZnSgDNeNTfiA","business_id":"yNPh5SO-7wr8HPpVCDPbXQ","stars":5,"date":"2016-04-07","text":"Jambalaya in Phoenix?  Just had a great bowl of jambalaya. I lived in Cajun country for three years, so I know it when I taste it.  Fresh ingredients and a great local beer to wash it down. Chef even delivered it and stopped by after to give me the scoop. Now I see why 1000+ rate this 4+ stars. Thanks ROBERT!","useful":0,"funny":0,"cool":0},
{"review_id":"Rq5huu1OzLx4RYHUTpDTFw","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"MwCai0x6GILtK4KkwufZig","stars":1,"date":"2014-03-20","text":"They overcooked 2 steaks in a row, then the manager said \"I'm not going to argue with you\" after she was arguing with us for 3-4 minutes. Do I need to even say anymore about our experience there. You couldn't drag us back in their doors.","useful":2,"funny":3,"cool":0},
{"review_id":"JTT-csMClVKmRR_AKXORtg","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"BjH8Xepc10i6OhCDQdX6og","stars":5,"date":"2015-06-17","text":"A+++. We started with gumbo and a shrimp salad. Both excellent. My wife had the scallops which were done perfectly and had a nice flavor to them. She really enjoyed the succotash too which was surprising since she normally doesn't care for it very much. I had a plump piece of butterfish which was melt in your mouth along with some spicy veggies. Of course you can't leave without a piece of Emeril's banana cream pie which is as good as it gets. \n\nThe service was absolutely top notch in every way and we left full and extremely satisfied. I'm certain we'll return.","useful":0,"funny":0,"cool":0},
{"review_id":"vicWy3UWyv_BzVIoPeRGDw","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"g62SlImzhs6_1t-knPjd8w","stars":5,"date":"2015-06-23","text":"We went in for Restaurant Week and it was fantastic. We were both happy with the caesar and the mixed green salads. The steak and lobster was a really good deal plus you get a sizable loaded baked potato to go with it. The lobster tail was also larger than either of us anticipated. \n\nOur server was extremely helpful and as good as it gets. The bar service was very good as well as we had a couple drinks there first during happy hour ($7 off regular price). \nI'm sure we'll return.","useful":0,"funny":0,"cool":0},
{"review_id":"8eEp26oqTXmuIjVUJpLXHw","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"--9e1ONYQuAa-CB_Rrw7Tw","stars":3,"date":"2014-02-25","text":"It was a real up and down evening.\nApps - BBQ shrimp were great but there's only 4 of them so don't expect to get filled up.\nEntrees - my wife had the filet medallions and they were basically disgusting. They were terrible cuts of meat and she was only able to eat about half of it. I had the bone in ribeye which was fine but nothing spectacular.\nSides - we had the creamed corn which I thought was terrific, my wife not so much. The potatoes gratin were good but you better like parmesan if you order them. \nDessert - the greatest piece of banana creme pie I've ever had, and it's monsterous!! \nDrinks - They didn't have the bacon and bourbon manhattan but the bartender said we weren't missing anything....so why keep it on the menu? Anyway, to finish off the night I had a Dusk in the Burroughs which is just about the perfect after dinner drink. That and the banana creme pie were easily the best things we had the entire evening. \n\nThe service was top notch and they took the medallions off the bill and also comped the pie, all without my wife saying anything more than she wasn't impressed with the steak. \nIn the end the start was good and finish was fantastic, but with the steaks being so bad it really took away from the whole experience. At roughly $50 a steak we just expect way way better, and with so many fine dining options in Vegas it's tough to see us going back anytime soon. Maybe eventually, but it'll be a while if we do.","useful":0,"funny":0,"cool":0},
{"review_id":"rZRnk-3s6rlqeu5JrBGKKQ","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"IT_4EEIbv6Ox1jBRMyE7pg","stars":4,"date":"2014-07-24","text":"I'd give it 3.5 stars. \n\nThe prix fixe menu is a pretty good value unless you want their 24oz prime porterhouse. I'm OK with an upcharge since that's much different from the 8oz filet it normally comes with. What I have a problem with is getting charged $30 more for a steak that's only $20 more on the menu. When the manager's answer is \"that's a corporate decision\" and offers no other explanation, I think that's a really really poor answer (if I can even call it an answer). \n\nThe food was really good. I had very little waste on my porterhouse and it was very flavorful. My wife's filet was just right. The shrimp that it came with were huge and had a great bbq type sauce to go with them. \n\nThe service was very good with one glaring exception. They forgot our au gratins. When asked about it she had a blank look in her eyes. About 5 minutes later they were brought out to us and we were told our order had been burned so they made us new ones. No, they weren't. They were simply forgotten. Just say so and we'll move on, do not lie to us. \n\nA few glitches but the food was stellar. Will we be back......I'm not sure.","useful":0,"funny":0,"cool":0},
{"review_id":"d6NilPyyl9JcHgoNoSbxyQ","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"0S4WFZJZhVeM3aAqKjLz1w","stars":3,"date":"2014-08-19","text":"I'd probably say 3.5 stars.\nThe food was pretty average. The lobster bisque despite the hype was merely OK. The crab cakes were good. Our steaks were cooked properly, but again, were really nothing special. \nThey couldn't serve me a witch doctor (supposedly a specialty drink of theirs) because they were all in use at the nightclub. What, special glasses or something???? I didn't understand that very much. Anyway, that was a con and we both felt the prices were too high for the quality presented. \n\nWe did walk out on the roof top and the view is amazing so that was a plus. \nOverall is was a decent experience, but except for the view nothing was even close to spectacular.","useful":0,"funny":0,"cool":0},
{"review_id":"A93A1zYLDad9rQxUzNVQ7g","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"bjSC_jbrypke0l-bXXBmwQ","stars":5,"date":"2014-08-16","text":"Simply awesome. As good as it gets. I had the 32 oz porterhouse.....can it get better than that??? My wife had the 12 oz filet....awesome as well. We both did the au gratins. They were extremely cheesy in a good way, and also very big. We've been told so many times \"it's big enough to share\"  only to be totally disappointed. These are! No worries though as they were so good we ate most of them and took the meager amount left home. \n\nWe had the creme brulee and chocolate mousse for dessert. Both were very good and the creme brulee in particular was large enough for two. \n\nThe bill was over $200 and I didn't bat an eye because everything was so good. That's what I expect in a high end steakhouse. Vic and Anthony's completely delivered in every aspect from food to service.","useful":0,"funny":1,"cool":0},
{"review_id":"uCBpHq9TPEwhNztfm5oXxA","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"IRbgMt0cVuzK1KSppU16_Q","stars":5,"date":"2014-03-12","text":"A+ all the way around. The main area is very open but for a much more intimate feel the booth we were in was perfect and you feel totally secluded. The service was exceptional as was the food. The salmon tartare was just right. The New York with the wasabi demi glace was cooked perfectly. The sauce was so good my wife was scraping up what was left with a fork! \nIt'll cost you to go here but I don't mind paying as long as the food and service are superb, and Andrea's delivered a great dining experience in all areas.","useful":1,"funny":0,"cool":1},
{"review_id":"EetngkeT9ySBGnjms93peg","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"Rd11Bosr8JkfoUhZLzpuxg","stars":5,"date":"2016-06-10","text":"First time trying this restaurant after driving by it countless times. Why did we wait so long. We were there early on a Wednesday and the place was packed so I'd definitely suggest a reservation.\n\nWe started with wedge salads where you get almost a whole head of lettuce. Excellent bleu cheese dressing with hunks of bacon to go with it almost fills you up right there. \nWe both had steaks and both were cooked perfectly. My wife's filet melted in her mouth. My kona crusted NY strip had tons of flavor and very little waste. We both thought the mashed potatoes were really good but were starting to run out of room and we couldn't skip dessert. \nThe flourless chocolate cake is a winner but I suspect anything you get here will satisfy you. \n\nChuck, our server, was awesome and the service from everyone all night was perfect.\nWe won't wait so long for a return visit.","useful":0,"funny":0,"cool":0},
{"review_id":"2RUZZZWiy0-6r1KzeP6dmw","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"y6QP5IrOJ7_FsB51jN2_Jg","stars":4,"date":"2015-06-17","text":"It's good pizza. Happy hour from 3-6 has good prices on both food and drinks. However I have to take a star away for the regular menu prices. We both felt our sicilian pizza was good but certainly not worth $32. We will probably return for strictly happy hour food and drinks but I doubt we'd go back at night.","useful":0,"funny":0,"cool":0},
{"review_id":"60uWokdStGWUMxflM0PuOg","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"q3dJQtwZQrrurNT-1bNKgQ","stars":3,"date":"2016-06-10","text":"Probably 3.5 stars. We went for lunch and it was pretty good. The entrance is a cool little starting touch. It was very quiet in there, maybe 5-6 tables total. The service was good albeit not exceptional. Still, no complaints there. \nWe had the house and Caesar salads and both were good but nothing really special. \nMy wife had the chicken parm which she enjoyed. \nMy pasta was decent enough and you can tell they make it on the spot which is nice. I was disappointed with the sauce though. For all the hype I heard from the servers about it I found it to be rather boring. Too bad. They also didn't have any pasta salad available for a side dish which I found odd at a pasta place. On a positive note the meatballs themselves were delicious.\nIt's certainly not a bad place and we may try for dinner one night and hope for a little better.","useful":0,"funny":0,"cool":0},
{"review_id":"AxGN0N60AhoDMtXT0vehxQ","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"km5aBHRss5ir_B0jvEErzQ","stars":1,"date":"2016-05-31","text":"The worst. \nFirst off don't bother getting the Groupon, you can't use it in conjunction with any other special of any type despite the fact they don't have anything in writing stating that. \nMainly though the food was terrible. Fish and chips with extra grease, chicken club sandwich with hardly any chicken, a $5 side of fries was a whopping 17 fries. Yes, there so few I counted them quite easily. \nThe service wasn't any good either. It was us and one other table and it probably took 10-15 minutes to first take our order. She never even came back to ask how things were after serving our pathetic dishes. She tried to be nice after we told her it was really bad but didn't offer to do anything about it. \nWeak drinks too just for a kicker.","useful":2,"funny":0,"cool":0},
{"review_id":"PyOqQfXAIDGpM1S759W0Xg","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"nUpz0YiBsOK7ff9k3vUJ3A","stars":2,"date":"2014-03-20","text":"All the food we had was spectacularly....meh. Nothing was horrible, but nothing was even above ordinary from what you'd find at most italian chains. We had the spaghetti bolognese and chicken parm. \nOur waiter was beyond terrible though. It wasn't one specific thing, just a lot of little things that added up to a poor experience. \nThe bus boy\/bread deliverer\/water guy was great, and that's the only thing I can say positively about the place. At these prices, we definitely won't be back.","useful":1,"funny":0,"cool":0},
{"review_id":"DAsX330oSl56jtt5OcnB6Q","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"klddGAcNIpE_aB5sd1hNXw","stars":3,"date":"2015-06-23","text":"Everything was fine, but nothing special. The bread was good, the salads were OK. My prime rib had a good flavor but it wasn't an especially great cut of meat. My wife's salmon left a little to be desired in the fact it was so incredibly bland, so she wasn't very impressed. \n\nWe did have very good service so that was a plus and the Showstopper cocktail was really really good. However, the merely average food for the price makes me feel we wouldn't return, especially with so many other fantastic places to eat at Wynn\/Encore.","useful":0,"funny":0,"cool":0},
{"review_id":"BULqOyVuZKE-mdgNzXVEgg","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"GC5wcui5uejRZTi8OCNPkQ","stars":4,"date":"2014-08-15","text":"We've been here several times over the years. The food is always solid. I don't think I would call any of it exceptional or over the top awesome, but we've never had a bad meal there. We will continue to go back when in the mood for good burritos, or fajitas, or whatever looks good on the menu to us that day. \nI'm also a fan of their hot sauce that comes with the chips, and if you're there early enough a few half price margaritas for happy hour always hits the spot!","useful":0,"funny":0,"cool":0},
{"review_id":"xjTwY6kCwg734dVEkRnDVQ","user_id":"AdxhlxXSGjRsCQxG6ZjfTw","business_id":"nnDLapJk1z2NJE0-XzwMlQ","stars":4,"date":"2014-03-09","text":"I'd actually give them 3.5 stars. We showed up right on time for our reservation but still had to wait 10 minutes for our table. There was no room at the bar so we just had to wait around. The place was packed on a Friday night so I'm sure a reservation is necessary. \nMy wife's heirloom tomato salad really wasn't as the menu described it. My caesar was good.\nBoth of our entrees were wonderful. My prime rib was bigger than advertised and full of flavor. Her filet and lobster were both to her liking. The lobster was especially good. \nThe reason for taking a star away was the overall service. My wife's water glass was frequently empty and we rarely saw our server. Our bread basket was empty and just left on the small 2 top table after the salads were delivered and then taken away.  Either take it away or ask us if we want more. I was never asked if I wanted another drink either, and by the end we figured we'd just head out to the casino to get another one. \nThe food was great but even on a busy night neither of us felt like we had a great overall experience, and when we're paying these prices, we simply expect better service, and they fell short.","useful":0,"funny":0,"cool":0},
{"review_id":"FjTR30oHAzvgaIwvRJNMfg","user_id":"MMaOtD43FD55MIMC9NdgxQ","business_id":"-ipc5f0XiXwH3hbNnro54Q","stars":4,"date":"2010-07-05","text":"First off I want to start off by saying this is a very nice theater. It has comfy\/no suprise stickyness chairs and is very clean. Germ-a-phobs like me will appreciate the nicely taken care of ladies room as well. \nNow on to the interesting part. I decided to watch Twilight there last week during a matinee showing. Matinee was the best way to avoiding wrist cutting emo kids and adults that wish they were 12 again. The theater was 75 percent full and I got an awesome seat even when I arrived right when the movie started. So the movie starts and ten minutes in there is a crackle and the ENTIRE theater shuts down...black. Which means... Twilight shut down. For those of you who know the fans you can imagine that hysteria ensued and I got laugh my butt off for 25 minutes while the fans where crying about being cutoff from thier sparkly vampires. Apparantly, the theater had a \"power surge\" which knocked out the ENTIRE theater. I am talking every single screen. Even the manager coming in 5 times to explain what was happening couldn't save this theater from angry vamp kids. The experience was hilarious and it made me not regret paying money to see the film. Next time, I hope they have a generator cause those fans are scary in the dark. :\/","useful":0,"funny":0,"cool":0},
{"review_id":"n0CFSncm0PhzQ53z54IcrQ","user_id":"MNFXaG-jB8UfgZe8ztQTbg","business_id":"nu0lQLzR3kQUXO_HLiNCpg","stars":1,"date":"2014-07-02","text":"DO NOT RENT HERE!!! They are rip off artists......... Rock chipped my rentals windshield,  I phoned them to see if I could repair it, they said they will do it for $60. On return they said the whole windshield had to be replaced. Took $350 from my initial deposit. Terrible service, garbage RV s, also down right criminal. Do your self a favor and rent somewhere else.","useful":12,"funny":3,"cool":1},
{"review_id":"sGLcaiNtxnsVYZlVGZmZaQ","user_id":"7evWV0kYPHrOEF4nqAK4Ng","business_id":"qNGexUR4IG8eSfs7USrRtA","stars":5,"date":"2015-12-04","text":"I went here in mid November for my 40th birthday with my 70 year old mother. I thought, what is the wildest thing I can do in Vegas. We were not in the best of spirits when the nice man picked us up at the hotel in a humvee. He turned that around fast! I wish I remembered his name. \n\nWe signed in and they accepted our groupons with ease. We looked around the shop while they got the guns ready for us. I admit, I was a more than a bit nervous. While my family had guns for hunting growing up, I wasn't involved in that and tend to think full auto weapons are crazy. \n\nWhen it was time for us to shoot, my mother went first. She has more firearm experience and goes to a range with my brother on occasion. She was spot on with the Glock and informed me that she had been shooting pistols with my brother for mother's day. \n\nI cannot stress how safe this place seems. No one is shooting on their own and everyone has a range safety officer. The people who work here are military. My mother told me that it was safer here than at the range she goes to in Iowa, even with the large automatic weapons here.\n\nThis is getting to be a long story, but I loved it! The safety officer noticed I was left eye dominant, changed how I was shooting and then I was hitting the bullseye with an Uzi! \n\nI convinced my wife to go with me on our next trip to Vegas later this month!","useful":3,"funny":0,"cool":0},
{"review_id":"94xdin0q1xsiWQ2FtnFHEw","user_id":"z7z41yh9H2gSjndC5DtnYw","business_id":"8vK20o55ytgqyTPJJn_oMw","stars":5,"date":"2017-09-21","text":"Go show the lovely ladies at this family owned local coffee shop some love. It's a coffee shop AND a roastery. Right on Sunset road across from McCarran Airport. The staff are wonderful. The ambiance and decor are great. Welcome to #lasvegas #magnumcoffee ! \n.\nGot me a beautiful #nitro #coldbrew, and an Exotic Escape Latte with #espresso #nutella #coconut #hazelnut #whippedcream \n.\n@magnumcoffee \n@magnumcoffee\n.\n#boycottstarbucks #supportlocal #coffee #roastery #tasteoftheexotic #covfefe #exoticescape #kona #jamaica #cafe","useful":0,"funny":0,"cool":0},
{"review_id":"gzHm8njWrBQ7rHvu2cxoWQ","user_id":"z7z41yh9H2gSjndC5DtnYw","business_id":"SsN-SaGGkJn2Qm-jSDQ4aQ","stars":5,"date":"2016-09-30","text":"Had a wonderful dinner tonight with my wonderful team mates at Trevi. Chef Paul created an amazing menu for us and Rafael took great care of us. Thank you, Trevi!","useful":0,"funny":0,"cool":0},
{"review_id":"X70Wg8__9gV8v60hLrKjYg","user_id":"z7z41yh9H2gSjndC5DtnYw","business_id":"8R7jI_E1QQjLwTfkU4V8DQ","stars":5,"date":"2016-02-20","text":"I love Nomad Krav Maga. The instructor, Shannon, is amazing. I feel as though I'm actually learning, and you always feel welcome in class. As well as learning the best self defense out there, you also get a kick butt work out! Also, Syndicate Gym is super clean and has all the proper equipment. I've got my membership and I will be in class as much as possible. Great job, Nomad!","useful":2,"funny":0,"cool":0},
{"review_id":"tMiN5z2fqrcxuLTjsLxKNw","user_id":"z7z41yh9H2gSjndC5DtnYw","business_id":"-ez0kwy7QuAEgSMxMLJKsg","stars":5,"date":"2016-09-21","text":"I love this place! Every juice, milk, and smoothie I have tried so far were delicious and fresh, and the assistant manager Stacie is amazing. She's extremely intelligent and we'll versed as a wellness coach, and had helped me with some health issues I've had. I go in there just to see her!","useful":0,"funny":0,"cool":0},
{"review_id":"ORwoUvChu85Rpt_tGi5_pw","user_id":"1ArJuSXseXXnMBNtfKyGlw","business_id":"75_XwDlwhc_LBJn8zG2z1w","stars":1,"date":"2014-09-27","text":"Derek Lether was very responsive... until we paid the application fees for a property on Dorothy Street. \n\nWe were approved, and it took him several days to email a lease to us. When we received it, the address was wrong, and the pet deposit info was completely different than what he had told us.  We tried contacting him to correct it, but he wouldn't respond to texts and his voice mail was full. A week and a half later, he texts my husband to see if we still want the property.  Hubby said \"Yes, but you have to send us the correct lease.\" We haven't heard from him since.\n\nWe wasted $100 worth of application fees and 2 weeks on this loser. Now we have to pay extra for the apartment we're in now to go month-to-month.\n\nAvoid dealing with this person and the company.","useful":5,"funny":0,"cool":0},
{"review_id":"OyGBUmZakcc4NJk0u7Fz0A","user_id":"tQe4g2DHG6hyt_gIjy2mKg","business_id":"YGp1TE9uZ5oKt-HKqWJLDw","stars":5,"date":"2014-02-02","text":"5 stars because VOSS is boss, when it comes to his tattoo artist expertise and outstanding service and so much more. Got 2 tattoos here so far (September 30, 2013 and back on January 30). Definitely book your next appointment with him.  Biggups! Minimizes the level of pain from the tattoo guns that he uses.","useful":0,"funny":0,"cool":0},
{"review_id":"PFkHy1X8UiL_mE65FSABYg","user_id":"tQe4g2DHG6hyt_gIjy2mKg","business_id":"ADyBxiY1BBR8149h9TVi5A","stars":2,"date":"2013-12-12","text":"I don't know where to start about this place. Friggin \"Jonny\" needs to be around more. I know this much, after Kim got off the phone with me, I felt that she was trying to blow me off to get back to customers. I could name some more cons about that place but it would be like trying to beat a dead horse. When it comes to prices, stay away from this place like the plague. I'm dead serious.","useful":7,"funny":3,"cool":2},
{"review_id":"i28EMHZllpfG816Jo7pSJg","user_id":"0gCNnQ4bPfbQ4lSaAXRwdQ","business_id":"TfabYPasZ1oOMN6JLa-yvw","stars":5,"date":"2016-10-17","text":"best food in vegas. our server anthony was awesome. great service and best indian food in LV","useful":0,"funny":0,"cool":0},
{"review_id":"cY1_AgnMOnTPuFJgPuGDIw","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"V-0qRzBHKixmQgon_fW_AA","stars":5,"date":"2017-03-09","text":"The food is consistently fresh and yummy. I always get the teriyaki chicken. We love it and are repeat customers!","useful":1,"funny":0,"cool":1},
{"review_id":"ExrEDOyze8ambDYXeat0Jg","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"U2eT17Pf0LQTPGMXN9idxA","stars":1,"date":"2016-09-27","text":"I came here last night to try to get a smog check done on my car. There were 4 employees \"working\" on one car. They were mostly just standing around while one worked underneath the car. I tried to flag them down while standing in the lobby to get some help but was ignored. Finally an employee walked in to the lobby - Luis. He completely skipped over me and asked the gentleman behind me how he could help. The gentleman motioned to me as I was there first. I told Luis I needed a smog check and he abruptly said their smog check machine was down and again quickly asked the gentleman behind me what he needed. I asked Luis for additional assistance (where was another Jiffy Lube that could help? Would the machine be fixed by tomorrow?) but was met with no additional information and no willingness to help. I expressed frustration about standing there for 10 minutes with no one acknowledging me just to have the machine broken and he said he was working under a car in the shop, didn't see me and rudely and sarcastically told me to have a good day. I Walked out and will never be back again. I'd rather go to another business for this service and pay double Than be treated so rudely. And the icing on the cake? Luis was the assistant \"manager\"!! Some manager he is.","useful":0,"funny":0,"cool":0},
{"review_id":"xNc2bDowVGptIf-xoGmKHg","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"eTBNs0QYa9fUOrNsZEllAA","stars":2,"date":"2016-09-27","text":"We loved our old day care but had to find a new one as we moved across town. When I took a tour I was very impressed and excited to enroll my daughter here. The lady doing the tour (Kirstin I think?) was so nice and friendly. The first few weeks were just \"okay\". I wasn't impressed at all and was already looking for a new place to take my daughter. The teachers were not very attentive. They were often found sitting around talking rather than tending to the kids. My 2 year potty trained daughter very often came home with dirty underwear as though they hadn't helped her after using the bathroom. The teachers were nice enough but seemed inexperienced and uneducated. I never really connected with them or the director or the front girls. The school didn't feel very secure and anyone could easily walk in at any time. The doors were never locked. I found a new school for my daughter but it didn't open till August (at this point it was April). We were just going to leave my daughter until then but then they had a 4 year old kid walk out of the facility through an unlocked door without anyone noticing. It wasnt until a Good Samaritan found the little girl at a busy intersection that they realized she was missing. The families were never told about this incident. I found out by reading the news on break at work. I was very upset and immediately drove down there to talk to the owner. I was not at all satisfied with the way she handled the situation and couldn't bear the thought of dropping my daughter off here each day, wondering if she'd slip out too. I immediately pulled my daughter out and enrolled her back in our old day care. Even though it meant commuting 40 additional minutes, it was worth the piece of mind knowing my daughter was safe. \n\nThere were some positives - This facility does provide meals each day which I liked. The facility is clean and the tuition is fair. They have a nice curriculum. I just couldn't get past a kid walking out without anyone noticing. I had to pull my daughter out.","useful":1,"funny":0,"cool":1},
{"review_id":"JVRQGOerGzc3f5Bln0P7pQ","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"8KEB1lcjKlIVSd6uA8JB9w","stars":1,"date":"2017-09-28","text":"This location has the worst service. Every. Single. Time. They are impressively slow. They never have whip cream for the desserts. The machine is always broken or they're out. We've complained to corporate so many times about this and *surprise surprise* nothing ever changes. The food is still decent for the most part but this location in particular makes me want to stop coming to cafe rio.","useful":0,"funny":0,"cool":0},
{"review_id":"BydCwhQCHcvmV0cWuf1v9Q","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"dYDuaXVyIXMXlmeMYf2ktw","stars":5,"date":"2017-03-09","text":"So yummy! Cookies are so soft. Ice cream is to die for! Customer service was great too. We'll definitely be coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"8it3tYMNyNdxjc-HPX7fdQ","user_id":"Na__TWiSv91vVp8N9iA4Ag","business_id":"Fx6zp-ZhuhuJVI10w_QyPQ","stars":5,"date":"2016-07-29","text":"We are so fortunate to have found a school as amazing as The Goddard. The teachers are top notch. They are genuine, well spoken, organized and most importantly, so loving and sweet with my daughter. My daughter loves her teachers and talks about them even after school. She is always so excited to see them in the mornings as are the teachers excited to see her. \n\nThe owner Jyoti is so amazing. She is very involved and always present. She has an open door policy and is always available to discuss your child's needs. She can always be found greeting each of the children by name as they are dropped off and picked up. The facility is very secure and I feel at ease knowing my child is safe each and every day. The curriculum is great and well thought out and my daughter has learned so much from her time there. They taught her sign language before she could even speak and as she got older, she learned yoga, Spanish, colors and alphabet while she was still in diapers! The teachers have a loving way of teaching respect and accountability and the kids are very well behaved. They have two great outdoor spaces and separate the kids based on age.\n\nWe moved at the beginning of the year to the other side of town and still commute an hour round trip twice a day just to bring our daughter to The Goddard. That's how amazing this school is! We are moving her to a closer school in the fall and I know we will miss The Goddard greatly. All of the teachers and directors and the owner Jyoti are amazing and they all feel like family. There is no other school that compares to the experience we've had here. They have made a lasting impression on me and I will always remember how great our time was here.","useful":0,"funny":0,"cool":0},
{"review_id":"0tml9Jd9NG7GBW4789fYHA","user_id":"REkC-1LrQZftEjPlx5518g","business_id":"6Hnf8Vk2BOuyDf11PZdvSw","stars":5,"date":"2016-02-16","text":"Great Burger and atmosphere!  Friendly staff and impressive beer list.  Two huge TV's at the bar for great sports watching.","useful":0,"funny":0,"cool":0},
{"review_id":"OXQfMB8FbUT4QMHXilFq3A","user_id":"DOMtqbMJMNZeJG2zzL1rzQ","business_id":"rJAT0A_hP7l91FT00kixwg","stars":5,"date":"2016-08-29","text":"First off, I never review offices\/restaurants because I don't feel like I need to. I decided to write this review because the last appointment I had reminded me why I love this office.\n\nOffice? Beautiful. Staff? Friendly. \n\nThe dentists are thorough and the hygienist is probably the nicest hygienist you will ever meet. The Doctors are great. You can always depend on them to be honest with you. Options are always given. Sometimes appointments start a little late but when they do take you in you are out just as quickly. I have only met the lady doctor once before and it was pleasant but Dr.Michael is usually the one I see when I get a check up and he is quick and efficient.\n\nThe hygienist is very honest, patient and thorough. She wants to know how she can make your experience better throughout the appointment. She always welcomes you with a smile and leaves you with the receptionist with a smile. The experience is completely different from dental offices 15-20 years ago. My whole family, including my kids, love her. You can see the difference when you sit with Karen because she cares. My first appointment with the office several years ago started with her. I used to hate dental offices and Karen completely reassured that dental offices are not something to fear. She actually said to my son \"Am I scary?\" which she is not, she knew how to diffuse a \"scary\" moment. She is gentle when cleaning and thorough. \n\nOverall atmosphere is great. The Receptionist is friendly and experience is well worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"uo5Qauj1r0MMc87k8o8wWg","user_id":"mrwfFGAcWm_hRx3EHiA6Jw","business_id":"wP4xCcGjeWFJcqmSyau5VA","stars":1,"date":"2016-12-14","text":"I had high hopes obviously for this company. Jason is an old family friend. Even with that, my yard took longer than usual to complete, it was a CRAPPY job (pavers uneven, bushes started dying right away, problems with sprinker system) AND it wasn't even cheap!! When the guys came back to fix issues, they left the water off and more plants died! I called a couple more times to try to get them back (still missing one plant, unsure about water), my calls and messages were completely ignored. I would definitely NOT recommend this company.","useful":0,"funny":0,"cool":0},
{"review_id":"lq_kIoJ7GEKsEulUTUwe8w","user_id":"OKGHiV05njcLVN5PNq6y_Q","business_id":"b0gOrbE022_76PVWhvNBCg","stars":2,"date":"2016-09-08","text":"Veterans was quick to respond to our property for our home warranty claim on a leakimg water heater. Jose & his partner were quick to diagnose the problem. Which resulted in needing a new water heater. Jose called our Warranty conpany then told me about the water damage to the exterior of the house and recommend a restoration company. He told me to pay the trade fee and he was moving to the next job until he receives a phone call back if water heater was covered or not. Told me its be about 1.5hrs, if its not covered he'll let me know so we can install a new one regardless. . 3hrs later i did not hear from Jose.  I called warrenty direcrly. They told me it was not covered, they told the tech that 3 hrs ago. Jose pretty much new it wasnt covered and wanting to move to the next job w\/o me deciding if i wanted to proceed regardless. Poor poor customer service and will not recommend them. Horrible expirence that you can leave a customer hanging like that.","useful":1,"funny":0,"cool":0},
{"review_id":"Wwc2ev3jiYN28nUUjV3iCw","user_id":"OKGHiV05njcLVN5PNq6y_Q","business_id":"H9mqDelZUnCWqYixEZQYww","stars":4,"date":"2015-06-10","text":"I visit Yelp alot when looking for different companies. AMS received alot of positive reviews. I sent a email late sunday night, Eli was quick to return my email the next morning. His crew came out quoted me a price and was able to clean up my landscaling in the back yard that same day. Only took about an hour maybe and hour and a half. They worked fast and together to get everything done. I will be recommending this company to other people. Thank you, for your service AMS!","useful":6,"funny":1,"cool":0},
{"review_id":"EmdvZqdJQXQf9lzsRV_kNA","user_id":"OKGHiV05njcLVN5PNq6y_Q","business_id":"YnfCyhbzwUTaGUtSzUeozg","stars":5,"date":"2016-06-22","text":"Absolutely impressed! \n\nChris is a professional Small Business Owner. I was looking good for a company to watch our property and our animals while we were out of town. Very short notice keep in mind and Chris was able to adjust his schedule to mine. When meeting with him in  person he was very informative about himself & his business. He went over what we can expect as his client. \n\nI would recommend Property Concierge Services LLC to anyone. Very trust worthy, reliable and professional Small Business.\n\nThank you, Chris! I'll give you a call next time.\n\n-J.Bruce","useful":0,"funny":0,"cool":0},
{"review_id":"Xw-Zn_NNV3j_JkCG2xZkpQ","user_id":"OKGHiV05njcLVN5PNq6y_Q","business_id":"5g1RoAVRN0H9xSE3GH1ODA","stars":5,"date":"2017-01-22","text":"Midway Chevy was great to work! The saleman Joe & finance Mika were amazing to work. I recommend the dealership & Joe\/Mika to work with in future deals.\n\n-Thanks Midway!","useful":0,"funny":0,"cool":0},
{"review_id":"5k84gxEBW0zaZ4v-4JFtig","user_id":"FTHxTxVfwOl5uYyMrzI3Uw","business_id":"qTmuW0C9XXuxWwumvn89sw","stars":5,"date":"2016-06-06","text":"He was GREAT!!!  This was the first time that I saw his show and couldn't stop raving about it.  Mac works with the audience and is such a talented magician.  I will definitely see the show again.","useful":0,"funny":0,"cool":0},
{"review_id":"6qxDBKG-ncre2x4KMSpauw","user_id":"iY13a1bfqWcmJY2psNj-mw","business_id":"hAYS_9TBdZfS_KIxQFLffg","stars":5,"date":"2017-06-09","text":"17 December 2017\n\nI am changing my rating to Five Stars after dealing with Shawn.  He had taken time off to help a friend and was gone when I was having all the problems with the pebblestone coming up on my driveway and dealing with Kurt.  When Shawn returned and saw my complaint, he and Kurt came back out to my home.  He told me that he was going to put two spacers in the area that was coming up but if that did not fix the problem, he would keep trying until it was fixed.  g was done on September 8th and the problem seems to be solved.  I am planning on using them again for a sidewalk from the front driveway to the back patio, including the patio and then my pool.  Shawn is a man of his word and knows how to treat his costumers.  The driveway is now everything I had hope for and wanted.  It is absolutely beautiful!","useful":2,"funny":1,"cool":1},
{"review_id":"gIcoVRlhg3YJtMAgvL8hqA","user_id":"iY13a1bfqWcmJY2psNj-mw","business_id":"INzI3zEScyAWujsCqyIXoQ","stars":5,"date":"2017-05-15","text":"Melissa is fantastic!!! Is she professional, friendly, and knowledgeable. I went in looking for a mattress for a guest room and my room. Melissa asked a few questions and then showed me the perfect one. Then it was off to mine, again she delivered because she listened to my needs and wants. We set up two different delivery dates. The first was delivered on time but the second there was a problem. Melissa called and let me know right away. Second delivery was as excellent as the first. I love my new mattress!!!","useful":0,"funny":0,"cool":0},
{"review_id":"tqrQOTEMC0gTRxI6qYlmOg","user_id":"zz5EBiX0vdlgxzu9toDFtQ","business_id":"WG8tt7i2khmv8a9xICNvfA","stars":5,"date":"2017-05-14","text":"My best friend and I are launching a backless bra company globally. I had to get something notarized in Peru of all places. I was in a real pinch. It was Sunday night at 7 PM on Mother's Day!!! They were super sweet, professional, and personable.   Thanks to them we will have patent protection in Peru. Otherwise we would not. I would definitely use them again.","useful":0,"funny":0,"cool":0},
{"review_id":"K8UKgOwQ8sngEXFqDSU9Jw","user_id":"e7lbnKmP7o8P2BfYjXaoTw","business_id":"tSwiWYoDBZajtwy3A_ooKg","stars":5,"date":"2017-05-31","text":"Moon valley nurseries on south eastern is amazing. Dan (the man) was great at helping pick out plants for our yard. He knows quite a bit about any plant you point out. We're very anxious for our plants to be put in by moon valley next month. Dan thank you for your help!","useful":0,"funny":0,"cool":0},
{"review_id":"pAoBdU-29ecx0OKQyeUrfw","user_id":"U9BbtOpA4zn6-Go8QPsL2g","business_id":"uOfXyUQLtJFUvxGjiBUPoA","stars":5,"date":"2015-01-31","text":"Great service. My clothing always comes back clean and nicely pressed. The alterations are also great. Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"WIEths2L_GMJhl47yqhgEA","user_id":"AciKE5kjfbPlJWuj9YXATQ","business_id":"vHWeSuhaAhvJuWR7-kuXqg","stars":5,"date":"2017-11-02","text":"Just got my father's vintage Air Force issue sunglasses repaired by Glen and I couldn't be happier.  It was great, fast and inexpensive service.\nI'll be returning for all of my eye glass needs - and you should too!","useful":0,"funny":0,"cool":0},
{"review_id":"Pj4plUhWBjX0L56cSfMlaA","user_id":"AciKE5kjfbPlJWuj9YXATQ","business_id":"loze9bM2c5NgXhQLG54YDQ","stars":5,"date":"2017-07-16","text":"It's so nice to experience service like Harpers provides.  I contacted Tracye with some storm damage and by the next day my roof was as good as new.  Chris had to come out and access the damage, confirm the color of my roof tiles, trim part of my tree, cut the tiles and install them... all while I was at work!\nGreat service.  Great price.  Peace of mind in an age of not being sure.\nBe sure.  Use Harper's Roofing!","useful":1,"funny":0,"cool":0},
{"review_id":"VhHplq0XL30hhJ1UIOcqBA","user_id":"WUdYoX5GnDRo4wON1uVL4g","business_id":"7VAcRL0y7Arthf7YkDnrDg","stars":5,"date":"2017-05-01","text":"I'm writing from South Florida and I am very satisfied with my service. My technician explained everything thoroughly and answered all my questions. Since the first treatment, I noticed the lack of ants on the outside of my house.","useful":8,"funny":0,"cool":8},
{"review_id":"oixs7xRMo1OoXhwdMaiatA","user_id":"-cYTn0r1JyUE9cxzaMlytw","business_id":"0d0i0FaJq1GIeW1rS2D-5w","stars":5,"date":"2017-09-06","text":"Best chicken and waffles. I had the Nashville spicy chicken with the bacon maple syrup waffles. Really awesome. The regular waffles with berries and whipped cream we're delicious too. Free refills on strawberry lemonade and Palmer iced teas.","useful":0,"funny":0,"cool":0},
{"review_id":"qJqv095XmB-08TjlJQJF-Q","user_id":"-cYTn0r1JyUE9cxzaMlytw","business_id":"IWN2heYitkg-D4UdqfxcMA","stars":5,"date":"2017-08-30","text":"My daughter and I went there for breakfast. Sean our waiter was the best. He special ordered chocolate chip pancakes for my daughter and was very accommodating. My corned beef hash was awesome too.","useful":0,"funny":0,"cool":0},
{"review_id":"TbhpB4y-71BlD6K-d-NFmg","user_id":"jS2q9zVSvRLJRwy5sbZn4w","business_id":"TCWMgOiV0PxQkWE1SyBIWQ","stars":5,"date":"2011-05-27","text":"The staff was well trained, our waiters knew every ingredient and its sole contribution to the dish.  \nI have been attempting to word this review and I can't seem to express my satisfaction.  \nToday, I have tasted and experienced the better things in life","useful":1,"funny":0,"cool":1},
{"review_id":"-Xv9UkDjV_gwudBT_bDSfg","user_id":"jS2q9zVSvRLJRwy5sbZn4w","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2011-03-15","text":"My wife wanted Paris, I wanted brunch, so we settled for Mon Ami Gabi, in the Paris Hotel in Las Vegas.  With a little bit of patients (about 20 minutes for a patio table), we where able to have a lovely brunch overlooking the fountain show at the Bellagio.  I truly feel that the setting made the food a bit better then it really was. it is more like a 3.5 star review but WTF","useful":1,"funny":2,"cool":1},
{"review_id":"P1vhn4W5B79KVEub7EdBqA","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"GhM6y2RX1zU-Gc0ustXsqw","stars":5,"date":"2014-08-27","text":"I had avoided the dentist for too long & was nervous about making an appointment.. I am so so incredibly thankful that we found Dr Parsanko! He is so gentle, calm, friendly and just overall amazing! I actually enjoy going in to see him now! We even took my 2 year old son there today for a \"happy visit\" to get him acclimated for future visits.. I cannot thank him & his staff enough! You have all been amazing :-)","useful":0,"funny":0,"cool":0},
{"review_id":"eNUBob9RLC0fG8olAgSdug","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"qw1Cqay7KnK_VK5IJh7QHw","stars":5,"date":"2017-09-20","text":"Stopped in tonight with my boys after school. The young man behind the counter was very friendly & the froyo was good! We'll be back for sure :-)","useful":0,"funny":0,"cool":0},
{"review_id":"JZ62RANTY7q8Tgdr9VjhIQ","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"Xg5qEQiB-7L6kGJ5F4K3bQ","stars":5,"date":"2015-04-23","text":"This GEM was recommended to us by a friend & after seeing all these photos, we had to try it! Today was our first (of many) trips! We arrived early (10am, 3rd in line) & were greeted like family! We got a tour of the establishment, we were shown the smokers & explained their amazing process and even offered water.. We could not feel more welcome! That is, until we were in the door 11 o'clock on the dot and given samples of the fresh first cut brisket that had been smoking over night! We ordered a meat platter, el hefe, pecan pie & we were so lucky to be the first to try Travis's brisket pot pie which was amazing & had the most perfect amount of flavorful heat! During our meal Travis came by asking about the pot pie & another gentleman came a couple times to chat & make sure things were all good! \nWe have been industry peeps in the valley for over 15 years & I have to say this may have been one of the most delightful dining experiences we've ever had! We're so thankful & will be back regularly! Thanks guys for an incredible experience!","useful":1,"funny":0,"cool":0},
{"review_id":"FWFF4yAe1fHb-mqwJSpt3w","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"YpnvKqeVD7dqZ9Mr0SGw6A","stars":2,"date":"2014-02-14","text":"I absolutely love Pei Wei but tonight I ordered a salad & a children's meal over the phone at 6:03 & I literally didn't have my salad in hand until 7:04... The place was crazy busy and everyone seemed so frazzled! It seems that when you cant get anyone's attention, they are most likely understaffed..  \nWhile waiting outside with my son for about 30 minutes I learned from another angry guest waiting that they had a coupon out that expires today.. Cool, I get it, but please staff accordingly at times like this.. A lot of people seemed very very frustrated and if they hadn't already paid, people talked about how they would've just left (I may have too considering I order take out because I have a two year old & it is usually more convenient, but in this case I waited over 30 minutes after it should have already been done)..\nI love your place, so Im just trying to give management some feedback on how the night was tonight.","useful":0,"funny":0,"cool":0},
{"review_id":"GRdGYJwKOLHzVzseNcrk1Q","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"j9JiNl86XCk4BLqIo1OI8A","stars":5,"date":"2013-02-23","text":"I frequent the Bashas on Mcdonald in Scottsdale quit often & had exceptional service the other day. It was about a month ago & I feel bad for writing this so late, but better late than never =)\nThere was a young man working in produce when I came in with my 1 year old. I asked him which type of pear he would recommend for my son & he was super kind, explaining the pears & then offered to go cut a few up so that my son Nolan could try them. He was the nicest employee I've ever encountered in a grocery store especially since customer service is pretty much a thing of the past these days! I wish I had his name, but I'm sure if you ask the employees who helped the lady find a pear for her little boy, he would remember & you should definitely praise him for his manners & great service! \nI've worked in the restaurant business for 15 years out here & rarely do I even find someone working for tips that kind & professional! Please find out who this was & give him endless thanks for representing your business well! Thanks\nbtw, he was more kind than most of your employees are while I'm checking out =)","useful":1,"funny":0,"cool":0},
{"review_id":"jfY4JPGILxI0OsIxulnk0g","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"CZKHXlDuy3IagC2W881fyA","stars":5,"date":"2017-11-01","text":"We just moved from Scottsdale to chandler a couple months ago and finding a great spot to frequent has been a major struggle. Thank goodness for the Brickyard! Amazing food, amazing service, amazing drinks.. Not one detail is ever overlooked.. Very attentive staff from the girls up front to the bartenders, expos & management.. We have been in this industry for YEARS and appreciate when you can find a place that runs so smoothly where you can actually relax & enjoy yourself;-) We're beyond stoked to have found this place and whenever we get a break, we are bellied up at the bar eating those delicious tacos! Thanks to everyone for making this a great spot!","useful":0,"funny":0,"cool":0},
{"review_id":"qPktPcgZeVz8oZDfcfBAfA","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"KnBguBHHAwr8yjQMzdeFLQ","stars":5,"date":"2016-03-31","text":"We toured many preschools before selecting CASY & nothing compared to the feeling you get the moment you step onto their campus.  One of my main things when looking for a school was the stability of the teachers and staff and CASY exceeded my expectations!  I love seeing the same smiling faces day after day & year after year, it truly gives you a sense of family.. The teachers are not only amazing at teaching but give you a safe sense of comfort and reassurance when you leave your child with them.  I can't say enough positive things about the owners (Mr. & Mrs. Spero) and their daughter Lisa.  They have done so much for my son in his last two years there.  They have been so kind and extraordinary with my son and his education.  Every child is treated as an 'individual' and they are encouraged to play and express themselves.  We are so excited for him to spend another year at CASY for preK!  I know they may not have many reviews, but if you're looking for a school for your little, tour CASY. I can guarantee you'll be happy with them.","useful":1,"funny":0,"cool":0},
{"review_id":"ex2dpCTenbYm8xsYZre6wQ","user_id":"Awk2iVyIHVB_7TG5dQrIQw","business_id":"zxEM4PlKonUpuqe7huFiOA","stars":1,"date":"2014-08-08","text":"After one bad haircut for my 2 year old, I tried this place again.. The next was a little better, but still not awesome.. (yes he is two, but he stays very still & is VERY cooperative while getting his hair cut, in fact he loves it) I tried once more because its 5 minutes away from my house & LUCKILY there was a sweet lady named Jessica there that did a wonderful job.  I went back today hoping to see Jessica and she wasn't there & the staff was so rude.  Almost like if you \"walk-in\" its such an inconvenience & they treat you that way..  If you accept walk-ins, you should have more than one person working so that there's not a 45 min wait.. Luckily I have Jessica's number & made an appt for tomorrow with her 30 minutes from my home..","useful":0,"funny":0,"cool":0},
{"review_id":"Dm8LnNMUZwWfvy81C3nOQQ","user_id":"PqEmow11jAnHeUQj8diwow","business_id":"OXEtIZtob0hY9Hnd8WMUdA","stars":1,"date":"2016-12-08","text":"The dispatcher on the phone was polite but not skilled at trying to help me.  I attempted to explain that I wanted to know pricing on a service call for my fridge. He just kept repeating that they charge $120 for a visit to diagnose the problem. No attempts to ask questions or try at all to understand my needs.  His skills and knowledge seemed so limited I asked him if maybe there was someone else I should speak to....nope.  I would suggest you train your people better--these folks are our first point of contact. I ended hanging up the phone just shaking my head. You have 1 chance to make a first impression and mine is bitter. I saw 5 stars and had high expectations.","useful":1,"funny":0,"cool":0},
{"review_id":"T7P2rteaJZEDcFb8rlOAUQ","user_id":"YbVLjcShLesvgo7Th5lwzQ","business_id":"glkEaoxbewiSMBiXs945JA","stars":4,"date":"2015-10-23","text":"Boa Pizza! Nada para se comparar com as do Brasil, mas como vc pode fazer sua propria pizza, sua critividade  limite!","useful":0,"funny":0,"cool":0},
{"review_id":"wXoa2WmHsAYtRt6Sm6Rfkg","user_id":"asObJhsz8qTe_rhHu2Vr8w","business_id":"b1WGIdd_oSwGYZtC769Shw","stars":5,"date":"2015-08-02","text":"The juice bar was just what I needed after a great Vegas night! Invigorating and delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"muoP-631uBd0hdfe7jh7fg","user_id":"TFMi9Dp95sCuyADFB9sTTA","business_id":"BvyUXno0grQerd5cZGDFPw","stars":5,"date":"2015-01-27","text":"Oh man this bar is great. Drinks are cheap and strong. The place is a local dive and I keep on going to make sure I become one of those locals. No tables - only seating is at the bar and stools along wall.","useful":0,"funny":0,"cool":0},
{"review_id":"0gLER_ItW274nSrpVjwAEw","user_id":"TFMi9Dp95sCuyADFB9sTTA","business_id":"GjkgXXicSJokejRge-g3xA","stars":5,"date":"2015-01-27","text":"Drinks are cheap and strong. Bartenders are nice, lots of seats without sacrificing the corner bar feel. Dancing happens sometimes and it is great when it does. The sidewalk tables are great for warmer months.","useful":0,"funny":0,"cool":0},
{"review_id":"n9b1TbSR-3LWzFr8aD1aEQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"wSgMEiuEhNyfBPAKjLuRgw","stars":5,"date":"2012-12-13","text":"Every time my best friend is back in town we always come here for a bite to eat. the atmosphere is so gret, the staff is friendly, there is a variety of yogurt to choose from and the establishment is always clean. My BFF and I love coming here mainly because it is mid point from where we both live and since we're both working on our weight it helps. Occasionally we go to eat lunch at the next door subway and then come into U-Swirl for dessert which is always fun because we get the best of both worlds. U-Swirl frozen yogurt can be eaten in hot or cold weather.","useful":1,"funny":0,"cool":0},
{"review_id":"8BLowK0nn5hmeFIXyDH_qA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"Oj3cjTHwVU660DFkk7FVLg","stars":5,"date":"2013-05-10","text":"I normally used to go to albertsons or smiths to buy fresh food but for the last 7-8 years my family now shops here. We find most of what we need in fresh produce right here. Not only that but we also find other items such as canned goods, scrap booking items, school materials etc. \n\nOn multiple occasions you can find produce that they don't normally sell. One such occasion my mom and I were shopping and we were browsing through the frozens and we found quite a few bags of Trader Joes organic pre cut mangos imported from peru. Which they never sell. As for drinks they recently sold 2 liter bottles of Dr Pepper (my dads favorite soda) so he bought three or for of them but when we got to the register the cashier tried to ring it up and neither of the bottles would ring up so she sold them as a miscellaneous item. Crazy, right?\n\nThey have also sold items such as SIlk Chocolate almond milk in the little box with a straw, brand name sodas, shampoos, pens, cleaning supplies the list goes on.\n\nIf you go on a good day you never know what you might find. Happy Shopping!!","useful":1,"funny":1,"cool":0},
{"review_id":"lRocDplWla8OunIdWyvtjg","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"mzu1_Vcg_iYjX0FvB6-UNA","stars":5,"date":"2016-02-20","text":"I came here, as a hair model for a friend, I have to say she did a great job. I got a shoulder rub, hair shampooed, hand massage. They were very knowledgeable and gentle. When I had a question my stylist was able to answer it. I had never experienced things done by Aveda, I am used to just having the haircut and pay $20 for it. \nI definitely will be going back.","useful":0,"funny":0,"cool":0},
{"review_id":"hwPqhfZ1Sl-1RVMKNmJOMQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"W7DwXa_7LNmETFHSQJZ2Lg","stars":1,"date":"2014-11-03","text":"I came here once and never again.\n\nAs good as the sushi was, there were roaches crawling up the walls and the employees were aware of the roaches on the walls and stood idly by doing nothing. I call health hazard because now I wonder if those creepy critters actually got into the food and could potentially get customers sick. \n\nIf you want to eat sushi go elsewhere. DO NOT COME HERE!!!","useful":1,"funny":1,"cool":1},
{"review_id":"W1WtjYu6zhXRNaaSFa4mNw","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"4VXIS8vpNzEysXZVN5xGDA","stars":5,"date":"2012-12-12","text":"Authentic. \n\nThe word I would use first to describe this restaurant. Its food is so very close to the flavors found in Peru. This is not to say that Inka or Lima Limon are bad restuarants but the flavors I find are not as authentic as Las Americas. They have food for just about everyone there. Whenever I go the smell of the food brings me back to peru when I am on the beach with my late Grandfather.\n\nFriendly\n\nThe word I would use to describe the staff. They are always so friendly and they are always around to ask you how everything is going. Other restaurants have that kind of service but I personally have found it hard to find service like that in that location.\n\nThe only con I would give it is its location. Because its location is on Sahara and Eastern it makes it hard for me to drive down there all the time because I live in the opposite direction from it.","useful":1,"funny":0,"cool":1},
{"review_id":"jwthz-GdJ1Dp_ZSbqYjYyw","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"U1cXgftMjQheZfY8QKoXmA","stars":5,"date":"2012-11-30","text":"You know I love going back and reminiscing on my childhood. Back when things were carefree and I didn't have to worry about paying a phone bill or for my car insurance. It is such a joy to always go back to Magical Forest and see all these different people putting in their time and effort to make this happen. They always have beautiful decorations up and the giant polar bears with a coke bottle, the santas, the train ride and the christmas music always make it all the more special.","useful":1,"funny":0,"cool":0},
{"review_id":"Rflaow-2mvliPF8sJoI5Ug","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"AUOlDSQ8R2wIkN4lQ4kVDg","stars":5,"date":"2013-02-08","text":"WOW!!! \n\nThis restaurant is A-M-A-Z-I-N-G!!! Don't get me wrong the other restaurant is still my favorite peruvian restaurant to go to with family but this place is a definite close second and much closer. \n\nI came here with my mom to try it out because we have heard such good things about it. Boy were those people right, this place has the makings to be a very sucessful restaurant. The inside of this restaurant reminds me of a 50s diner with its layout.\n\nThe food very very good. The only thing missing was a traditional chicken dish, but that was the least of my worries. \n\nThe employees were even kind and helpful when it came to deciding what to choose from ( from what i saw tonight) they even came from time to time to check up on the customers.\n\n\nThe Best Peruvian Food in Las Vegas? Hell yea!\nWill I come back? No doubt about it.\n\n**Congratulations**","useful":2,"funny":1,"cool":0},
{"review_id":"yVroYdCpACGzB0_sEbeT4Q","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"lXpa2Td7cWTku0KeeKKwrA","stars":5,"date":"2013-03-15","text":"Yesterday As I was leaving my house with my mom to begin our round of errands she told me she was in the mood for Jamba Juice. I on the other hand have  been a loyal Tropical Smoothie goer. I had never had Jamba Juice before but now I can say I have tried Jamba Juice. I still love Tropical smoothie but Jamba Juice is SOOOO GOOD that I could not complain. Also taking into account that It was so hot out yesterday that this was a nice way to cool down.\n\nThe atmosphere is nice the staff is so beyond nice and always making sure you are comfortable. The staff also ensures that you are enjoying your drink from start to finish. I would recommend to any skeptics or non believers of Jamba to just try it to see if it meets your expectations.","useful":1,"funny":0,"cool":0},
{"review_id":"wEJol3TeYK8y1bLlg7GqsA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"7BK6vckOh2Ywq8ryy8P7Ow","stars":5,"date":"2015-02-12","text":"With my school and work schedule I don't go off school grounds to eat just because I don't always have the money to eat there. Well I had finally made the walk with a few people I am working on a group project with; BEST FOOD EVER\n       All of my friends, well most of them, have been here and have only ever had good things to say about it. I was skeptical but I love food so I went to try it and it was by far on of the better decisions I made. I got more food for the money I paid. The luau pork rice bowl with teriyaki sauce was so good.\n       If you are looking for good food Come here you won't be sorry.","useful":0,"funny":0,"cool":0},
{"review_id":"FNs9mZcIo19D0lP--sZ5Bg","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"s5fGo1Nieiy6M-fhk_Ywnw","stars":5,"date":"2013-12-20","text":"This place has THE BEST and most DELICIOUSLY INSANE Chinese food. It is so inexpensive as well and brought back so many memories for me. My family and I used to come here when we wanted a quick fix for Chinese food and it tastes so much better than Panda express.\n\nI have been around trying other Chinese food joints and restaurants but nothing truly compares to what they have here. Its even remotely close to a Bank Of America, a food for less, stop and shop and not too far from trader joes so if you're grocery shopping in the area or need a bank those would also be the places to hit up.\n\nThe food is definitely worth the money that you pay for it. Its cheap but the food is AMAZING for the price its at.","useful":0,"funny":1,"cool":0},
{"review_id":"9HzL_JZTjiXZLy9lxVjnHQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"cAozV21tOLUZBbYU1mwMdQ","stars":5,"date":"2013-06-04","text":"I used to come here often for mass on saturday because it fulfilled the obligation for sunday. It looks relatively small on the outside but don't let that fool you. Like they say don't judge a book by its cover. The inside of this beautiful cathedral is OUTSTANDING. The murals, stain glass, the cross, the two stories. \n\nMy family and I took a trip down here on friday night for the Ordination of the Diaconate in other words the Bishop ordained Permanent deacons into the Diocese. It was a 2.5 hour long service with a beautiful reception afterwards. At least two priests from each parish around  the diocese was present and 6 men were ordained.\n\nThe church is located on the strip and is within walking distance of the nearest hotel so if you are a tourist that is good because you won't have to deal with traffic. If you are a local AVOID ENTERING AND EXITING from the strip uses smaller streets if you can. It helps to avoid the mess of traffic that there is on the strip.\n\nLocals or tourists PLEASE TURN OFF your cell phones it really is bothersome when it goes off in church. it disrupts from what we are truly there for.","useful":7,"funny":0,"cool":0},
{"review_id":"LyqTxQbzX4sL_mKgFLZeqA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"nYzCr8fcJ2ci4aiB1-hB6w","stars":5,"date":"2012-12-20","text":"You know I love trying new things around town (well, near me anyway). I came here today with my best friend and I wasn't quite sure what to expect. I expected good food because of the reviews i read but to be honest I still wasn't sure what to expect.\n\nI ordered the braised chicken with vegetables and rice and it was AMAZING!! my friend ordered a panini with cranberry sauce and caramalized onions and it was INSANELY GOOD!!! I couldn't believe it.\n\nthe atmosphere was so lovely too. It was so comfortable there: they had couches, tables, a breakfast bar table like thing, benches with tables. Oh it was adorable and I loved it there. what could be more great besides the lunch items and the Nutella crem brule. one of the best deserts i have ever had....\n\nEvery 10-15 minutes one of the employees came out and wiped down the empty tables and picked up the up the dirty plates and cups from their spot to get washed and squeaky clean.\n\nif you plan to go to a bakery try this one first. It will knock your socks off.","useful":1,"funny":0,"cool":1},
{"review_id":"7ZI9bdnSOLcK5f3skbvWxg","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"DXn79Dzv8kpsMcNNKZHuRA","stars":3,"date":"2013-02-08","text":"Rate=3\n\nThis place is super busy. When I mean busy I mean busier than Mariannas Super Market, Marketon or other latin american stores. \n\nThe parking? Umm no one could find a spot because it was far too busy and no one wanted to move in fear of causing an accident in the parking lot. \n\nThe prices were ridiculous as well. If you want fresh produce and I do mean fresh the 99 cents store offers fresh produce. On occasion you can find imported fresh fruits and veggies for much cheaper prices.\n\nThe employees? yeah they were nice enough but regardless of how nice they were my experience wasn't all that good and I have had better.","useful":0,"funny":0,"cool":0},
{"review_id":"YLUyRShn4z3U7xyKxlldKQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"krPKgiC0EolDhSHz3kLp6g","stars":5,"date":"2013-02-20","text":"I always love coming here to shop. This place has everything you need for your shopping needs. The fish smell is to be expected upon walking in because they do sell fresh fish and live fish so thats the deal with the smell. They have foods from countries I have only ever dreamed of trying when i go to visit.\n\nthe only con i have is how far away it is from where i live but i think its not really even a con for most people. This is the one stop shop for anyone who wants to try out some foreign foods or to just look around. This place s also HUGE!!! its like the size of 2 or 3 food 4 less or albertsons..","useful":0,"funny":0,"cool":0},
{"review_id":"QjOMeHU6z73_c41k7Ndt9A","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"0p0PqX7Zsm_0lvXzEWpwWA","stars":5,"date":"2012-11-30","text":"I come to this library so often for school. It is such a patron friendly place to go, its so clean and it has free wi-fi. The children's section of their library has a little play area for those parents with younger kids and the staff is so insanely helpful when you need to find a book in a hurry.","useful":0,"funny":0,"cool":0},
{"review_id":"hv92wztmT2xdlBw7mIF89w","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"WFjQGnDFO1VPbKXU_FUOew","stars":5,"date":"2013-05-24","text":"Although this isn't my home parish this is one of the few parishes around the dioceses of Las Vegas that offers Spanish mass. It is a little bit of an older church but it, like all the other churches around, is very welcoming. I believe my favorite thing is when they do their taco nights. Those tacos are the BOMB DIGGITY!!! Not even taco bell compares to what they sell. The church has floor seating but there is also a second story that offers extra seating.","useful":1,"funny":0,"cool":2},
{"review_id":"5frQI_RWwy_ZzH3lZX-Z_A","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"Tk2TfNOwEJFJacbqYisIwQ","stars":5,"date":"2012-11-30","text":"on monday after i got home from school I talked my mom into going shopping with me because it had been a long while since we had gone shopping. We came to Rhapsodielle (Fashion Q before) and like always the service was great. The staff was always so friendly and they are constantly around the store to ensure that all the customers get the proper help.\n\nthere is always music playing in the background making your visit to the store a little bit more soothing. The pricing on their clothing is so much more affordable than that of Wetseal or Forever21.\n\nWhat i have seen in those stores I found for a cheaper price at this store.","useful":1,"funny":0,"cool":1},
{"review_id":"Cf771Sqas1MZWSAUDH5t8w","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"0WoQQlMXVIDEgI0xNdENKA","stars":4,"date":"2015-08-22","text":"My most recent trip here was at the beginning of July for my dad's birthday. My little sister and I were treating my dad to dinner at the buffet, a movie and we even split the cost of a gift for my dad.\nThis is not the first time I have been to this buffet, and it isn't too bad. It may not be the best buffet in the world but if you go with 5 or less people you have a higher chance of finding a table. Oh, make sure you have your players card on you so that you can take advantage of the discounts to get inside.\nHonestly, I would come back here again. Mostly because it is close to where I live. They were well staffed and tried to get everyone seated as quickly as possible.","useful":0,"funny":0,"cool":0},
{"review_id":"b_c7-c0_CG4-2x1Uq189xg","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"if59L5DHM4pPMrCx9HuD8A","stars":5,"date":"2013-01-21","text":"Now Typically when you are in a casino such as main street you are probably visiting vegas and you gamble, eat, drink, sleep, etc until its time for you to leave. I was actually attending a church retreat this weekend in the Pullman Bar and Grille restaurant (I hope I got this right because thats what it said on a sign) anyway it was very interesting. There was a train car inside the Restaurant and the staff I must say are the friendliest staff I've met all the years I have lived in vegas.  There is a cute little gift shop across the way of the Pullman by the hotel lobby. Cute little items on sale for those who want shirts, necklaces, earings, cups, food, drinks, reusable totes.","useful":0,"funny":0,"cool":0},
{"review_id":"KncQPMnC8QczI-52YKnQ5g","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"WI4_e2nbKHH-g-5TZ2SvpA","stars":5,"date":"2015-01-19","text":"I came down here 5 times in the last month with a friend. we spent several hours each time here but until our final more recent visit we didnt finish the entire mall. I love how in comparison to meadows mall or town square even galleria the stores are not as packed. Growing up the closest mall I had was meadows which was a 20 minute drive from my house. \nThis mall has some eateries like Red Robin, CPK, Five Guys but there are some other higher end restaurants there. They have rice republic (which is insane good), sushi loca, grapestreet cafe and winery, just to name a few. As for stores it has an apple store (for all you apple lovers out there), nordstrom rack, trader joes, dillards, macy's, michael kors. \n\nDefinitely a place worth checking out. They have an ice rink and a movie theater there too.","useful":0,"funny":0,"cool":0},
{"review_id":"zj7RndA7vxiC0iCbxSSR_A","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"EZkKDq4hMZ6XnF6sMKcH1Q","stars":5,"date":"2015-05-08","text":"I came here a few times after it opened. my first experience in this store was with a friend from church. she only had good things to say about this store and I was honestly impressed. Since then I have gotten a few pens and some decorative paper and started putting together my own scrap book. The pens, well I use them more for my drawing than I do for letter writing but when I do write letters I use the beautiful calligraphy pen that I bought for 4 dollars. \n\nIt is such a cute store and I would recommend going over and taking a gander. I am sure you will not regret the visit.","useful":0,"funny":0,"cool":0},
{"review_id":"Xr5-C_qyfsHEh-4HVC8CLQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"e1qIWEYgYjTJG1zHr4rwxg","stars":5,"date":"2012-12-16","text":"So on Tuesday December 11th, my dad had some errands to run and I had naturally agreed since on occasion I don't like staying home alone. So we were off running here and there for errands and I had a coupon for a buy one get one free whopper. We don't live far from this location  and we ran the errands needed in this side and it was about lunch time and my dad's like \"hey if you still have that coupon we can eat lunch here\" and I said sure I mean two whoppers for the price of one....thats a good deal there. We walked in and we were greeted with a smile and I felt like a VIP with how I was treated. The employees even came over and asked us if everything was going fine and if we needed anything. \n\nThis is one Burger King I will be coming back to in the future, even though I don't eat out on a daily basis","useful":0,"funny":0,"cool":0},
{"review_id":"cQ1OsoJtvlAgOvMFDuJKVA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"-boNHP3clSwzToiLWQrBUQ","stars":5,"date":"2012-11-30","text":"So today I decided I would treat my mom and myself to get a long deserved haircut. We both want to grow out our hair but the ends of our hair was so dry that it made it so difficult to comb out. I have been going to supercuts for years but never at the same location. \n\nThis location has the friendliest service I have seen in the last 18 months. The young lady who cut my hair she was talking me through what she was doing and then we talked about other things throughout the time she was cutting my hair. I am so pleased with the service.","useful":2,"funny":0,"cool":0},
{"review_id":"rPN6v1sNLgoLq7sJXZMvUA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"H_eO04NZAQIDcbtFQ4BUag","stars":2,"date":"2013-02-18","text":"This place has the worst chinese food I've ever eaten. I have been to quite a few chinese restaurants and have chinese friends who often let me sample their food. This food does not even begin to compare. The flavors were all over the place. Its a nice place with nice service but when it comes down to it I think the food plays a big part in the review of a restuarant.","useful":2,"funny":0,"cool":0},
{"review_id":"3V5H_AOAOVRSHE4j8uqB3w","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"Z5OoLZ_gKDHZGKs6gtR28w","stars":4,"date":"2013-02-14","text":"So a good friend and myself decided to eat out today while on break from class. I remember her telling me once that she had never eaten at a Panda before so I recommended we eat at the one near campus. She agreed. I had anticipated that there would be 1 or 2 people in front of us ordering their food.\n\nWas I right?\n\nNo\n\nThis restaurant was dead. Absolutely dead, no one except those working there was there. I gave it a 4 because of that. Overall, as always I love the food. But being today was a religious holiday I couldn't eat certain foods. that was the only down side but nothing that would bring me down or stop me from eating panda.","useful":0,"funny":0,"cool":0},
{"review_id":"tRbsJE9aDxX9vnYHWKty4A","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"upBVCVmIEi7H-JD8OU_gxw","stars":5,"date":"2013-06-04","text":"Every time I have been to a church social, mainly for dinners that were put together for the catechists (religious education teacher for those of you who don't know) this was the catering service used. I cannot begin to describe the food to you. It is so good (not as good as a nice home cooked meal) but it sure comes close.\n\nThe eggplant Parmesan is to die for. I had it for the first time about a week and a half ago. I never had eggplant so I was not sure what to expect.  More recently though I was privileged to eat there food again on Friday when I went to the Ordination of the Diaconate at the cathedral. The reception was afterward and they had food that represented the large majority of cultures which I though was good.","useful":0,"funny":0,"cool":0},
{"review_id":"lvpacVzqCEUzc2hgzwbvEw","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"60zmhS-MTHrhKIXxhSWJ4g","stars":5,"date":"2013-01-11","text":"So today the weather wasn't exactly the best. Partly cloudy with a freeze warning that will be sweeping the valley tonight until the early morning hours of the 14th.  I came here today with a friend to grab a bite to eat and something  to drink.\n\nWhat can I say the service was incredible as was what i could afford which was one drink. Even the person who handed me my drink was so kind and smiled as she handed me my drink as she said \"Iced Mocha for Catherine. Here you go, enjoy your drink Catherine\"  \n\nTheir wi-fi was actually pretty fast and the music- relaxing. I don't always go to starbucks often but of all the ones I have been to this one by far had the best service I had ever seen. It was very relaxing and a great way to bring warmth to a cold windy day.","useful":1,"funny":0,"cool":0},
{"review_id":"U8uTdtb9cWs2M5v4vqAN0A","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"OlWWHMKPSroPqnLd1I5ujg","stars":5,"date":"2012-12-13","text":"I gave this denny's a five for a few reasons. \n\n1- This dennys is walking distance from CSN making it convenient to go to.\n\n2- The free wifi it helps when I am hungry and need to do work on the computer to do it right there and the food is moderately priced.\n\n3- the service is amazing. the staff members are always checking up on you to ensure that everthing is to your satisfaction.\n\n4- The food is always so good like the saying goes \"you get what you pay for\" here you pay and you get good quality food.","useful":1,"funny":0,"cool":0},
{"review_id":"MLngZ2ygB1FLBrXBtAI4Ug","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"O1ei-QBkQT-Kzlp7SxWgVA","stars":4,"date":"2013-04-28","text":"The only thing I love to drink more than tea or silk chocolate almond milk is vitamin water. Normally I would go to ALbertsons or Smiths to buy my vitamin water because one or the other will have it on sale for cheaper but it is the normal size drink. Whenever I go to other stores like costco, sams club, walmart or even target I look to see if they have a bigger size bottle of it so it will last me a little longer. Sadly no they do not.\n\nthe point I am trying to get at here is that this place offers the huge bottle for a little more than the regular size bottle at the store, only this will last you probably for two days if you ration it carefully. Now if you are me it will likely be gone by the end of the day but I can fill it with water which is more than the16.9 fl oz bottle water","useful":0,"funny":0,"cool":0},
{"review_id":"ciR_TVq7Fyoy6qrl-ZVz9Q","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"HY8UfWpwlsNXfJ7QEmLvfQ","stars":5,"date":"2013-03-30","text":"Twice a year I come here for a leadership camp  for high schoolers at lee canyon. It is so beautiful up there and it is always so nice because I can get away from all the stress off school, work and other things.\n\nMy favorite thing to do is to hang out at the picnice table talking with the other counselors but I also enjoy the night we spend under the stars by the camp fire, making smores and the kids have a chance to show off their talents. Whether it is singing, dancing, playing an instrument. It is so much fun.","useful":2,"funny":0,"cool":0},
{"review_id":"90bO-PfVxhwxSzINkpmOyg","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"4RoTEeqB_MNn6yaqZmlZHg","stars":5,"date":"2012-11-30","text":"so yesterday night I went to see a movie with my friend. I naturally have always been coming to this theater since i was a little girl. I love so many things about this theater for example it is NOT in a casino so for those who have asthma or don't like breathing in the smoke like me it is a nice place to go. Another benefit is that there are restaurants and candy shops you can go to. Its a Regal theater so it is good to go and have the card because for certain amount of points you get you can receive a free soda or popcorn.","useful":2,"funny":0,"cool":0},
{"review_id":"qJ-YGzdLNFtOowcbtEiKhQ","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"pC-_rPkp3mMZqvBJO1Yyaw","stars":5,"date":"2012-12-05","text":"Well I've been at CSN for almost two years and I love it. There are so many pros and cons about this campus though.\n\nCons:\nadministration\ndifficult parking (free)\ncounselors\nregistration is a pain\n\nPros:\nyou have actual professors teaching not a Grad student\nstudent life \nrestaurants right across the street\non site cafeteria\nso much cheaper than UNLV\n\n\nIf you come here to get your prereqs done you will not regret it at all. the class sizes are decent and more teacher student interaction.","useful":4,"funny":0,"cool":1},
{"review_id":"6YBZQ0qeb3B4zDQaXAF4nA","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"tro-hrljuY1cUAVFYauTlQ","stars":5,"date":"2013-03-15","text":"I was in the area running errands with my mom. We were both hungry and it was around 6 and I asked her if we could stop here. My mom and I are on a more healthy diet and coming here kind of threw us off but you know it would have been longer going home and preparing something ourselves. \n\nI don't always have my mom pay for my food but without her saying anything I had a feeling she wanted to do it because I had bought breakfast, lunch and dinner for her several times within the last few weeks (all spaced out of course). It was a great night because I got to spend some quality time with just my mom. I truly enjoy it but the burgers are INSANE good and the fries well I think they are healthier than McDonalds or Burger King.","useful":0,"funny":0,"cool":0},
{"review_id":"1FhAW3ItGiSpCyvGgaS2qw","user_id":"7QRec81IeLgHcG6Tln0D8w","business_id":"Ea3BblvC4zzagYI_1cNumA","stars":5,"date":"2013-01-29","text":"Growing up when i was left at home with my dad he would always take me to the capriottis sandwich shop. My favorite sandwich to get was the tuna sandwich with lettuce tomatoes and onions with light mayo and pepper no cheese. This cappriottis brings back these memories and the service never ceases to amaze me.\n\nthe staff is quick and friendly. the cashier saw that everyone was doing well and was given the personal treatment he or she deserved. How else do i describe such a wonderful atmosphere. It gets better for me because it is an easy walk from my school when i finish.","useful":0,"funny":0,"cool":0},
{"review_id":"QI92nYgHMeIMu1CJGkhBqw","user_id":"OHLS419uPp0pzBZpKdVBoA","business_id":"2d_3IaJlJWUJsWGHhuvcbQ","stars":5,"date":"2016-08-20","text":"I've been buying my semiprecious gemstones from Scottsdale Bead Supply for the past nine years, and their service and selection are wonderful! Talented artisans Mike and Kelly, are always helpful - and their own designs are gorgeous. Kelly creates some of the most intricate and lovely necklaces and unique clasps, and their Old World Bronze() handwrought beads are unique, beautiful, and go wonderfully with a variety of gemstones. The recipe used to create the bronze was developed by the Charveaux family. Mike (under the name Michael Andrew) uses the bronze to custom design pendants and rings that are sensational!","useful":0,"funny":0,"cool":0},
{"review_id":"F7xsvV6txabXGT4Mrzb-oQ","user_id":"OHLS419uPp0pzBZpKdVBoA","business_id":"9enGPCcn8bUxFf9qSOMj1w","stars":5,"date":"2017-05-05","text":"Just purchased a 2017 iMac and related products, and had lots and lots of questions - since my \"old\" iMac is a late 2007 model running Mt. Lion! The service was excellent - emailed questions promptly answered both by email, and with follow-up phone calls. The \"guys\" were patient, carefully explained everything, and I never felt pressured to buy. They were pleasant and eager to be helpful. Can't wait for my new iMac to be installed - and have every expectation that the service that day will be just as good.","useful":0,"funny":0,"cool":0},
{"review_id":"_63GAnZsaEZuQUuPa_e3Qw","user_id":"OHLS419uPp0pzBZpKdVBoA","business_id":"UOtoOybZ5vAB4aXBLc57vA","stars":5,"date":"2016-07-29","text":"The best barbecued brisket! I've been to Houston, Dallas, San Francisco, New York, Chicago, and other major cities - and the barbecued brisket at Bootleggers outranks them all! Excellent service, healthy servings, comfortable seating, and a warm and friendly atmosphere for people of all ages. I've enjoyed Bootleggers for lunch and dinner several times and it is one of my Downtown Scottsdale favorites!","useful":0,"funny":0,"cool":0},
{"review_id":"2-bzLUuHEM1gmMbZaTq6Wg","user_id":"OHLS419uPp0pzBZpKdVBoA","business_id":"WBt2pa7k_K2LKW2OJuXG9Q","stars":4,"date":"2016-04-08","text":"Food and service are excellent! The restaurant is charming and we will definitely return. The menu is so inviting, I'm making a reservation for May and taking a friend for her birthday, so we can try more of the wonderful offerings. Our server was delightful and efficient. She easily answered every question and always came to the table with a friendly smile and attitude. The only reason I did not give Arcadia a 5-star rating, is that the tables for two are too small, too small for the healthy array of food that two people order!","useful":0,"funny":0,"cool":0},
{"review_id":"RIBodu5r6JqMOoxt6r7Z0g","user_id":"gGc6W568FzhFUew8gvKoGw","business_id":"UbR66ZuFMQX2SrUkQDi3DA","stars":1,"date":"2011-01-20","text":"Fuzzy math? Don't bother renting with Dollar, its a sham and their counter people are poorly trained snake oil sales people.\n\nHere's my scenario: mid-sized rental through Expedia, 4 day rental.\n\nBase price:  $175.80\nTaxes & Fees:  $62.82\nCar total:  $238.62\n\nArrived at counter; \"Sorry sir, all we have for you at this rate is an economy car. But I can upgrade you to an SUV for ONLY $66 a day.\" I said no. \"Ok, how about X for $44.\" Again, I declined. \"Okay, $28.\" The guy wouldn't stop. \n\nI finally got him to stop trying to up-sell me. I agreed to take the stupid economy, then agreed to pre-fueling. The charge was $72 for 20 gallons of gas in an economy car with a tank probably less than 14 gallons. I threw a fit. Then he told me I would be charged $250 if I smoked in the car. It's 20 degrees out and I smoke - deal breaker.\n\nI asked him to cancel the reservation.\n\nThe National Rent A Car deal was not honored from Expedia. The mid-sized car price was actually $332 not the $175 in the reservation by Expedia. National Rent A Car had no interest in honoring the arrangement. Plus they still held the funds.\n\nThis is not the first time I've had to deal with this. Dollar Rent A Car isn't cheap, just their training program and stupid sales tactics at the counter. I waltzed over to National (my first business choice) and rented from the Emerald Aisle for $323. I drove off with a AWD cross-over with 6000 miles on it in pristine shape.\n\nScrew Dollar Rent A Car and their cruddy mentality and sales gimmicks. Shame on Expedia for even listing their car offers when they obviously won't honor them. It was a huge waste of time that reflects poorly on both companies.\n\nFlying into Cleveland? Go to Alamo or National. You pay more than the cheapo-rents, but you get a whole lot less haggle and a lot more car.","useful":5,"funny":0,"cool":0},
{"review_id":"uyYYOjsqu4LN5pVWBzGOiA","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"gCfY1kuGQ4dh1Hw3IEEelw","stars":4,"date":"2012-12-20","text":"Beautiful Japanese patterns and a wide selection of paper available.  I loved all their greeting cards and ceramics especially. I could spend a long time in the store just looking at all the different designs. Definitely a bit of a splurge on stationary but for something extra special it may be worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"IBaQsNmGp4EEoKiD5bBehw","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"vw2KJ_5tlFIALaHfziqnbg","stars":4,"date":"2013-01-09","text":"On a snowy wintry day, Kahwa is my type of cafe. Wooden chairs and tables, couches in the back corner, string lights, enough space to move around comfortably--but small enough enough to still feel cozy. There's a big window to let enough light in the day, and fogs up just right to make you happy to be inside.\n\nI find their coffee to be a bit weak and watery. Last time I decided to give a latte a go here, but I was disappointed. It  felt like I was just drinking a big bowl of warm milk. No thanks. Their date pastry and baklava is pretty good, it's a nice change of pastry options which I really like.\n\nThey have a pretty decent selection of Kusmi teas, drinks and desserts. Although I often visit the cafe, I make an exception for mediocre coffee because of the nice ambiance, reliable wifi and friendly barista.","useful":1,"funny":0,"cool":0},
{"review_id":"xhbSjtN4wIVeUOPwoK3gwA","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"3f0-EXRF0oy6NDsFh9TJKA","stars":4,"date":"2014-01-11","text":"Visited the restaurant after reading all the rave reviews and I was not disappointed. I arrived around dinner time, so it was no surprise that it was very packed. While there was a small line up, we were able to grab a table  for 2 within 15 minutes. \n\nEvery dish looked amazing. They start you off with a small appetizer of kimchi and pickled vegetables, as do most Korean restaurants. We ordered the bibimbap,Dongatsu and the ham kimbap which all arrived very quickly. The bibimbap was by far my favourite, with super fresh crispy veggies and flavourful beef. Personally, I like my dishes on the spicy side so it was nice for them to give you a sauce bottle( not sure what exactly it was, spicy bean sauce, I presume). Though I wish it could have been hotter, I guess next time I'll go with the bibimbap in the stone bowl to keep it hot throughout the meal. \n\n\nI would definitely recommend this place, and it looks like there are plenty of regulars who stop here for a quick meal. It's a bit tricky to maneuver around the tables though, especially when it's around dinner time as the restaurant is very small.","useful":0,"funny":0,"cool":0},
{"review_id":"UH837AJ0MqnJXz8OdeDd9g","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"_tcc4vxDoAjw0B__no0Xqg","stars":4,"date":"2013-02-09","text":"Before Au Pain Perdu, I wasn't a fan of eating out for breakfast. I ordered the le gros t'ouef (2 eggs, bacon, ham, sausage, potatoes, beans and fruits), and it blew my mind. My taste buds died and went to heaven. Yea, that's how much I loved it. Even though they forgot my ham and beans I couldn't even be annoyed because the food was distracting me. Coffee was good, and staff was friendly. \n\nI'd give it the full 5 stars (gladly) for its food and ambiance, but the entrance\/waiting area is awful. I mean, there isn't one. You walk in the door and you're standing and blocking the path to the exit\/entrance and the upstairs which is so inconvenient because people are coming and going non stop, including staff who are carrying lots of food up the stairs.","useful":2,"funny":0,"cool":1},
{"review_id":"H6z3Qk4ACgzRNwfo8AA83A","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"FugJPYpYOL6O1w7AbJ2cag","stars":4,"date":"2013-01-09","text":"Not just your typical cafe. While there are some pastries, they mainly focus on breads. My friend ordered the chocolate croissant which was flaky, and delicious and I ordered the smoked salmon quiche which I found quite good as well. We both ordered coffee, which was offered in dark or mild roast. The dark roast was delicious and full bodied. They offer an extensive selection of Kusmi teas though some are priced differently than others. \n\nThe open concept kitchen is refreshing to see and overall the whole place is pretty spacious.","useful":4,"funny":0,"cool":0},
{"review_id":"o6hMkJ_-DW5bbQu9Ty-gPg","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"wzugmCevnXuCMCF4upAf0w","stars":5,"date":"2013-02-10","text":"Tuna and Salmon Bowl. Oh my god. The handful of fried radish on top of the dish is killer. The longer the flavours sat in the bowl the better it tasted. I was so sad when it got to the last bite I didn't want it to ever end. Everything looked so delicious if I had the stomach capacity to eat everything on the menu I'd never leave. If you won't be able to go back I'd suggest sharing multiple dishes so you can experience everything there. \n\nDon't be intimidated by the line. It's nothing compared to the food you will taste inside. Sitting at the bar, I was tempted to reach other and eat the dishes prepared by the chefs. Don't fall into temptation, but I assure you it will be hard.","useful":3,"funny":0,"cool":1},
{"review_id":"gi0Uig3lLhsbA4gST1IAcw","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"cnLQD1gaoOtKAC1QgAWa8g","stars":4,"date":"2012-12-20","text":"Kafein's food is good but coffee not so good; however, they make a mean cup of mocha. I really liked their squash soup, and the size was pretty generous for a small. Not sure if they bake their own pastries, but their croissants were delicious. \n\nEvery time I've gone my wifi was unreliable, but if you don't need wifi, the space is actually pretty nice. Its got the right balance of coziness with quite a bit of space.","useful":1,"funny":0,"cool":2},
{"review_id":"zgSFqeabddANuPB2ulqW_A","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"UAu7t2ePn47vkgNI9oGEcA","stars":5,"date":"2013-02-10","text":"Without warning, one of my favourite cafes in the city is CLOSED?! Anyone have more information on this? There was a lease sign on the window. \n\nI'll still finish my review though:\n\nIn a city with so many cafes, it can be easy to overlook this cafe. Heck if I wasn't brought here by my roommate I would too. But you'll appreciate this cafe as much as I've come to love it. It's cozy with low warm lighting and unpretentious to the bone. \n\nSad news that people aren't able to enjoy this cafe anymore unless it's taken over and business continues as usual. Still, the owners won't be the same and....it'll never be the same!","useful":5,"funny":0,"cool":1},
{"review_id":"uwygbPmVJcMIy0RFjNOtEw","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"6-Q2bcA43ksojhp9MBL1cA","stars":5,"date":"2014-03-12","text":"Who said food court food can't be good? Me. I said that. I said that BEFORE Caravelle. Their Tonkinese soup is delicious, hot, and the service is FAST. How many people do you need behind the counter for this tiny place?! Apparently just enough so you can join the line and get out of their before you can even decide what you really want. \n\nYou want the Tokinese soup. Join the line.","useful":2,"funny":1,"cool":2},
{"review_id":"AnLJ15U-tCjRlmiOKgmQcA","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"pkO54EbPl6E57Q0yu2XYRA","stars":3,"date":"2014-03-12","text":"Short and sweet: Beautifully presented latte, but weak. Lukewarm latte, when I requested hot. Music was terrible. At some point the couple next to me started to rave dance to the music. I almost wanted to join in if I wasn't so busy yell-versing. I like the variety of clientele though.","useful":1,"funny":0,"cool":0},
{"review_id":"XnQQ-pEaTYmK3l5fJkrH8g","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"vlKAEQ1ftb8x_e3dtvyiqg","stars":4,"date":"2013-03-16","text":"Gave this cafe a second chance and you know what....it redeemed itself in my book. I won't say why I was disappointed the first time because it's all about second chances here. Here's why I revoked my downvote: I can't deny that this place is cozy. To me, it feels like a 50's hobbit hole. It's warmly lit, and there's a connecting kitchen that sits between Norah's vintage shop, so naturally it feels very homey. \n\nI ordered the keylime pie and chocolate croissant and both were down right excellent.  The pie was made fresh that day in the cafe which was a plus. With the dessert, I ordered an Americano misto that was smooth and well-rounded.","useful":1,"funny":0,"cool":2},
{"review_id":"8h9RCRDulA2W8XYF0UjRoQ","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"3bVc_IDRyAXpg__qkEEXyw","stars":5,"date":"2013-03-09","text":"First off  I just want to say how interesting it is that Crudessence is situated next door to Green Panther ( another vegan, organic restaurant) albeit with different menu variety and much cheaper. If you want a more \"sophisticated\" vegan restaurant, Crudessence is the way to go. I tried the OM burger and had no idea what to expect. The texture and flavor combination of the burger was crazy good, never had I tasted these flavors in that way. The sun-dried tomato I think is what really made it. \n\nI couldn't finish the meal without ordering their blueberry uncheesecake. Holy. So. good. So refreshing. It was the perfect palate cleanser.","useful":4,"funny":1,"cool":2},
{"review_id":"iyhunjZFIbaP-itS02OS7g","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"A5IQhhf2c9i2PwVmj92WJQ","stars":5,"date":"2012-12-15","text":"I was introduced to Chez Boris by my friend and I'm glad he did because it's one of the top cafes on my list. Great ambiance and space with delicious coffee and tasty snacks. Crowded on a weekend morning\/afternoon but if you're willing to wait a bit it may be worth it. It's calmer on a week day afternoon\/evening which makes for an excellent study\/work place. \n\nWifi is unlocked and reliable and the music blends in with the environment. Take a book, leave a book, walk in, check it out, order to go or sit for a while.","useful":4,"funny":0,"cool":2},
{"review_id":"SLpoEbYN70zULadYdYrXTQ","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"-kNcuhLw790MQFLYpwzfKw","stars":5,"date":"2015-02-20","text":"This is my go-to sushi place, not just because it's close to my place, but because it's actually good quality, authentic and Japanese owned.\n\nI've been there several of times and the service has always been exceptional. From what I can tell it's run by a couple; one serves while the other preparing the order.  They are always attentive and polite even when business picks up and orders pile on.\n\nThe sushi rice is always perfect; not too sticky and just the right temperature. The fillings are always proportionate and fresh. Their sashimi plate is delicious and well priced too.\n\nIt is overall an excellent price for the value.","useful":6,"funny":0,"cool":2},
{"review_id":"2FNqDcMbi0IVcNw1137Tvg","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"7x5pDqeLhA8Ezdsz_3JTMQ","stars":4,"date":"2014-01-12","text":"I'll keep it simple. It's winter, it's cold... I want soup, and Pho Bac 97 is my go-to pho place. Go for the beef pho with tribe with the classic ingredients: tendon, tripe, &meatballs. Because I only go there with one dish in mind, I am always satisfied.","useful":1,"funny":0,"cool":0},
{"review_id":"wy5vL8HaNwVB7tbOMN-3kQ","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"NQBhCRbFKQOfyAY8kRYP8g","stars":4,"date":"2014-03-12","text":"I can't remember what I thought of my chai latte. It doesn't matter because I obviously had nothing to complain about because... all I can remember is how my mind was blown from the tahini roll. \n\nThe 4 stars is for the tahini roll and beautiful space. There will be a next time.","useful":2,"funny":0,"cool":1},
{"review_id":"tyjbLCtLXl4OZ0_M33N4mg","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"yEZn1XpLsEC9uBa-X4xAZw","stars":5,"date":"2013-03-09","text":"Walked in, walked out with an excellent sandwich in about 5 minutes. So affordable. You wonder why you ever pay double for subway. Ordered the sardine bahn mi and couldn't stop smiling. So good. So worth going. I want to eat everything there.","useful":2,"funny":1,"cool":2},
{"review_id":"sp3sirXThAHVWUviFyUQDA","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"7wgKazvblPECOzBrd6N50Q","stars":1,"date":"2014-02-09","text":"Blegh. \n\nHow do I even begin. While good customer service shouldn't be expected in Chinese restaurants, I don't expect aggressiveness.\n\nAfter hearing so many great reviews for peking duck, I expected nothing less; however what we were served was in the pits of what we expected. First, for $34 dollars, it comes with a whole duck, 8 pancakes and what looked like a random vegetable satay with pieces of duck thrown in. \n\nI found it very odd that the waiter came out with whole duck sitting on the plate and immediately turned around and went back to the kitchen. 5 minutes later, the duck is \"cut\", and plated on top of extremely stale and greasy shrimp chips. \n\nThe duck skin was scorched black and there were barely any meat. This led us to question if they really gave us the whole duck, and exactly how old the duck was. Judging by its skin, it looked like it was ready to thrown out anyway. We were surprised they would have the gall to serve this. \n\nThe picked radish and carrots looked  like it had been cut by a 3 year old--uneven, chucky, hideous slices that had discoloured tips. \n\nWhen we complained about the duck, the waiter had a smug look on his face and said, \"Oh, you want shrimp chips? No problem, we'll bring you more\". Are you kidding? NO THANK YOU.\n\nWe left the restaurant happy to not have supported such a terrible establishment.","useful":0,"funny":2,"cool":0},
{"review_id":"tQgQrpvtFmUhQ15oh_mo0g","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"lFIQNKHSeAOfuUAghxP_Cg","stars":4,"date":"2012-12-15","text":"I love Shaika for their comfortable chairs, the choice of drinks, the mix of people who hang out there, the seating capacity,the numerous electronic outlets, the decorated walls of local art and the events that they host. It's a very homey type of cafe which is the type I gravitate towards. Just look for the string lights outside if you're looking for this place at night. \n\nJust as a warning: If your intention is to get work done, it can get quite loud in the evening when they have events, so I'd recommend bringing your headphones.","useful":1,"funny":0,"cool":1},
{"review_id":"OTTMyavvXb3_rF5m-gkM0Q","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"ZsrQbYusDGkNqXMnxBhqlQ","stars":5,"date":"2012-12-15","text":"Good coffee doesn't necessarily need good space... but in most cases they go hand in hand. Cafe Falco is just a delight to sit in. Spacious, and minimalist but still warm-- now that's a good combination.  When I visited it was quiet and calm which provided an ideal environment for me to do some work. However, I did visit an hour before closing time, so I have no doubt that was the reason. \n\nI ordered a large coffee ( I was given 2 choices, a small or large) and it was served in a Japanese ceramic cup which was a nice change. I ordered the coffee of the day and it was strong but not overwhelming.  \n\nCoffee is brewed with Siphon Coffee Makers or vac pots which I had never seen before and because it was my first time having coffee made that way I can't really say how it particularly changes the flavor of the coffee. Regardless, the coffee was great. \n\nDidn't get to try their food (which I hear is really delicious) but they had small snacks like cookies at the counter. Overall, a cafe that I hope will stay around for a very long time.","useful":1,"funny":0,"cool":1},
{"review_id":"txosDkZcgPSkTJxcuiB9pw","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"83Z5ssEW0LGZmtgKaLBT9w","stars":4,"date":"2015-02-08","text":"I worked down the street from Kuu and for months this place was FULL during lunch time. So when my colleagues and I finally got a seat we were so ready to review this place ourselves.\n\nAfter 20-25 minutes of waiting, the first 2 dishes arrived but the 2 orders of ramen were no where to be seen. 5 Minutes later, our waiter brings us a bowl of free bowl of  ramen because they had an extra order and didn't want to waste it. AWESOME!\n\n5 minutes later he comes to apologize because the second half of the order didn't make it through(?) and offered us complimentary drinks. I wasn't even mad because the free bowl of ramen was delicious.\n\nWhen my ramen came, I already knew what to expect. Perfect noodles, flavourful broth and the portion size was just right. $10 for a large bowl of delicious ramen. I'm happy with that.\n\nThough they lost our order, the waiter was courteous, admitted the mistake and offered something in return. \n\nWould definitely come back and try other items on the menu... if I can get a seat.","useful":1,"funny":0,"cool":0},
{"review_id":"A09KkQQdHUZtCBozTqocww","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"52-omTjba8j2Zo6Eg6_jgw","stars":3,"date":"2012-12-20","text":"I honestly wasn't expecting much from this place. There was nothing about the interior that made me beam and when a menu has about a trillion things on it, you know that everything might be mediocre at best since they don't really specialize in anything. \n\nI ordered \"The Pacific\" omelette with smoked salmon. Omelette entries come with potatoes, toast and coffee. Service was quick, though we came on weekday morning. Holy. Huge. How many eggs did it take to make the omelette? I don't even want to know. My omelette was quite good but near the end I started to get bored (partially my own fault because I kept eating it after I was already quite full). I wondered what else could be in the omelette...is that something I should even be asking..? I could be wrong but the omelette definitely tasted like it had some sort of filler which I think is why it was so big. Is this standard practice in restaurants? \n\nNext, let's talk about coffee. Well, there's nothing to really talk about. Diner style refillable, weak coffee. But you know what? I didn't even mind because crappy coffee fit pretty well with the overall ambiance. \n\nI wouldn't mind coming back for brunch if someone wanted to go. Otherwise, it wouldn't be a place I'd bring someone to.","useful":1,"funny":0,"cool":0},
{"review_id":"WtLu3ala8Plal_dC12BPXg","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"LtyoPfxpvcF_9e9wMoUi0w","stars":5,"date":"2013-09-14","text":"Sometimes when a new business opens in Westmount I feel a little nervous for them, but I think Mandy's will do well. I like how Mandy's focuses on salads. Mandy's does it well and it fills you up like a well thought out salad should. \n\nI had the Tokyo Salad and what stood out the most was the tofu and the dressing. Tofu is not easy to get right in a salad--at least in my experience anyways. The Tokyo salad was delicious and the ingredients were really fresh. \n\nI was skeptical about the seating at first because it is such a small place, but since they serve the salad all in plastic containers, many people get it to go . The seating arrangement outside was just enough for those who wanted to stay.\n\nWould definitely go back again and try other salads.","useful":2,"funny":0,"cool":1},
{"review_id":"TGH_pl2RbBUn4x8sVxR01w","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"VqT-IURXmVS_fVRLTKxTFQ","stars":2,"date":"2012-12-07","text":"To preface, I must admit that the reason why I'm about to give Cacao 70 such a blah review is because I built my expectations up so high from reading all the wonderful reviews on urbanspoon and yelp. \n\nSo I have to say I was pleasantly surprised by how warm the ambiance was. I liked the large open kitchen and the wooden counters. I liked the fairy lights and the spacious seating area. \n\nMy friend and I were lethargically greeted and seated by a guy who looked like he wanted to just get out of there. My friend got the Cioccolata Calda (Italian-style Hot Chocolate) and I got the %70 Fleur de Cao which was different than her's which was hot chocolate where as mine was cocoa based. We also ordered the Cacao 70's Cheesecake. \n\nThe drinks came and they were actually really delicious. I have to say that I've never had hot chocolate\/cocoa this good. They were rich and thick and creamy. If anyone has seen that scene in the film Chocolat when Vianne is pouring cocoa into the cup for Armande and it's perfectly dense and rich... well that's how our hot cocoa\/chocolate was. I liked her's more, it did have quite a thicker consistency, allowing her to drink with a spoon. I wish mine also came in a cup instead of a  fishbowl-like glass which made it hard to drink from since it was quite hot after pouring in the cocoa. It also detracted from the warmness that you should feel from drinking cocoa, I feel. \n\nBut what I didn't like...well a lot actually. First the price. I'm sorry but $8-10 for hot chocolate? Really? Sure it was really good, but I'm not used to paying so much for hot chocolate. Secondly, the cheesecake. Presentation wise, I'd give it a 1.  It gets 1 point for drizzling red raspberry sauce on the plate, ok fine another point for nice cut strawberries. Otherwise, it really seemed like they scooped (yes scooped) the rest of the cheesecake that was left and plopped in on our plate, smothered it with whipped cream and called it a night. It must have been some excellent quality whipped cream that we were paying for then because that's mostly what we ate. The little bit of cheesecake I guess was okay.\n\nWe couldn't finish our drinks because we were too full. I don't think there will be a next time for me but I'd recommend just getting either a dessert or drink. The drink would've been satisfactory for me. Whatever you do, just don't get the cheesecake.","useful":1,"funny":0,"cool":0},
{"review_id":"R2qEaIHRoTf5RdwXcO7JPw","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"AKWIGsdVHHjz7RLOPg2Pcw","stars":1,"date":"2017-08-26","text":"The wall art outside had me fooled. It said 5000 ans, but inside it's  C'est si bon. My friend and I waited for 10 minute before anyone acknowledged us. After we were seated, we waited another 10 minutes for the waiter to come take our orders. We then had to ask for water. Service was slow, waited about 40 minutes for food. Food itself was not bad. The kimchi Jigae 5\/10, the japchae noodles =7\/10, then again you can't really screw up japchae. The side dish that all korean restos give was nasty. The potatoes tasted like frozen cut potatoes deep fried again. Not at all like the korean sweet potatoes usually given. The pickled cucumber was limp and tasted super old . The radish was fine.\n\nThe interior looks like an old Italian restaurant. I asked for a water refill which never came. Ended up paying up front because we didn't want to wait another 30 minutes for the waiters to come by. They had to ask where we sat.\n\nSuffice to say, yea. no thanks.","useful":0,"funny":0,"cool":0},
{"review_id":"ep8RCqvG3nANeguo9HZI3Q","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"m1tcZ2kveqcWrDAZ4CqpNw","stars":5,"date":"2013-02-09","text":"Didn't know what to expect, but I was impressed. Couches, booths, small seating areas, fireplace downstairs and more room and bar service upstairs. There are also smaller rooms upstairs which looked super cozy. \n\nGood but loud music, so I wouldn't go there if you want to have intimate conversation. Great for big groups even though the tables are small It was no problem to move things around to accommodate for more people. Fantastic selection of beer, friendly staff, and good crowd of people.","useful":0,"funny":2,"cool":1},
{"review_id":"Ac4lqe6CQ0ydvZd45oeh4A","user_id":"ddUsCHQmQr-N4cHMl3S3fg","business_id":"TOv8WIsa_lFC9i0NJUJK_Q","stars":5,"date":"2012-12-15","text":"Having tried St-Henri Emery first, I expected no less from this St-Henri establishment. \n\nI visited the cafe on a sunny Saturday and it was quite full but I found just enough space to settle down. The coffee is damn fine. I had an Americano which was medium bodied and soft on the buds. I was anticipating pretentiousness since I hear they take their coffee seriously, but none at all! Lots of different people flowing through from students, chatting couples, you name it.\n\nI love the space, although tables are small and bar tops along windows are narrow, it is compensated by the large windows--which on a sunny day fills the cafe with tons of light which is a huge factor for me-- friendly service, well spaced out interior, nice decor, good music that doesn't try and compete with your thoughts or own music, and old pews for extra seating= excellent.","useful":1,"funny":0,"cool":1},
{"review_id":"4a7U_pf0hiMpjfUCxxj-aw","user_id":"3MkZeAXOxMHnA7QNY0OO4w","business_id":"1hfYBwAI7pFz50l5n4JpqQ","stars":5,"date":"2014-07-29","text":"Great lunch spot! The menu is mostly sandwiches, salads, wine, & craft beer. The employees are really friendly and helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"v-t-OewFJDZoZXkw0R6GjA","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"qSP6RqBJUyJRsQKTarlo6g","stars":4,"date":"2014-06-21","text":"Stayed here last night and had a pleasant stay. From valets to front desk to bartenders, everyone was very friendly. 21+ hotel, so most people staying here were just looking to party. Great place for young people looking to party. They did have a few problems with the plumbing which caused a fire during our stay, so -1 star. Very eccentric and unique hotel to stay at, and they have relatively low rates. If you don't have a car, I would skip on the artisan because there aren't very many places to eat or party nearby. Also, the pool is a topless(optional) pool.","useful":0,"funny":0,"cool":0},
{"review_id":"Y72ODywxtfrusjDmQiGrNg","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"pFQaji0idkrzv5J-qTQ82Q","stars":3,"date":"2012-11-12","text":"i was soo disappointed the second time i went.  The first time i went i thought it was great they had shrimp scampi, alfredo sauce, etc but the line was just horrendous. just went again for lunch and it was gross.  Y'know how your first bite is supposed to taste the best?  It already tasted bad.  The liver steak was disgusting; hard, overcooked, and just a peculiar taste in general.  The asian food was gross, mexican food was alright, and the southern style food was just too fried for me.  The only hot food i enjoyed was corn and the mini steakk burger with grilled onions.  However, i did enjoy the fresh salad bar and the ice cream bar.  All the cupcakes and cake had way too much icing on it, and i love icing!","useful":0,"funny":0,"cool":0},
{"review_id":"CENuW1pIPPQyFeUOQNs21A","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"6Q7-wkCPc1KF75jZLOTcMw","stars":2,"date":"2014-06-21","text":"I had stayed at circus circus before and had low expectations to begin with. I chose to stay here because it had the lowest prices on the strip. However, this stay, we weren't even in the hotel!! We got rooms in the circus circus manor, which is an even further walk from the strip and about 10 mins walking to the main casino and game place. Absolutely SUCKED! The manors are behind the circus circus building and look like old, run-down motels. Even a walk to the main lobby was quite far and we were even further from the strip!! Not to mention, our faucet wouldn't shut off, it kept dripping our whole stay!! Circus circus usually isn't that bad, but if they place you in the manors, I would suggest going someplace else!","useful":2,"funny":0,"cool":0},
{"review_id":"ME_6ZkJteXNZS_yExWwVHQ","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"ku6NGJSMJ5RwKnHrzVBQcA","stars":2,"date":"2014-07-19","text":"Got the pad see ew and a couple drinks. Bartender was friendly and food tasted delicious. Reason for two stars is because they seemed disorganized, and the bartender told me that ordering food was separate from the bar so they had us open two tabs. Waitress from Thai food place did not honor the 50% off one entree offer on yelp. She dropped off the check and never came to pick it back up, nor did she ever check up on us. Thankfully, the bartender grabbed utensils and took care of us even though it was the other waitresses job","useful":2,"funny":1,"cool":0},
{"review_id":"pRQtILi3LLbCMDbaHXTkHA","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"yGqvmPtlFZMPhLBlNQyggg","stars":4,"date":"2014-06-21","text":"For tourists like myself, this place was a godsend!! I had not eaten a real meal(instead consuming fast food, chips, and alcohol) in three days and my first bite of the BBQ beef combination was amazing! I really liked the macaroni salad and the dressing for the salad. Definitely better than all the fast food around and way cheaper( and tastier) than anything on the strip","useful":0,"funny":0,"cool":0},
{"review_id":"4n5uRg3FtlruOhzXvZuPFw","user_id":"2J1HhwWULZASkyx1wUCAJA","business_id":"kc5JPu8lkg64yUbrheJxng","stars":4,"date":"2014-06-21","text":"Cheap compared to food prices on the strip! I was so happy they had this here, as I was sick of eating fast food everyday. Place is kind of hidden and run-down, but seems like a nice family owned restaurant. The cashier was friendly and they had an incredibly wide menu selection. I ordered the garden salad with ranch and added avocado. It was delicious and way better than anything the strip had to offer for under $10","useful":0,"funny":0,"cool":0},
{"review_id":"C_LV16qg6blRmFlXkenTqw","user_id":"a-iIJyCriw3L3gZqtqzHPg","business_id":"R4lfw5h8TX3RQ4L0l0TG4A","stars":5,"date":"2016-01-30","text":"I had David do my gel nails and it was awesome! The lady at the front was also very welcoming, while David was also very detailed with the entire nail process. The price was definitely worth it! Also there was barely any wait :) will be going back regularly!","useful":0,"funny":0,"cool":0},
{"review_id":"TZ0tPNJlJpTD2up-PC0Tng","user_id":"eeuY13CBdLPmJNzg0qYhNA","business_id":"_V_DIoILUxJX2dr3cqB4Yg","stars":5,"date":"2017-12-23","text":"The Salon owner, Aly, was super helpful and informative. She answers the phone when you call to book an appointment and she's wonderful. I sent her some pictures to show her just how damaged and outgrown my hair was before the appointment.  She immediately contacted Maria and got me in to see her within a couple days. Aly is excellent in customer service and hospitality. I enjoyed every minute at her Salon. Very clean and well maintained. They even have fashionable clothing for sale! Very cute stuff! What a nice touch! I will forever love my new highlights, color, and cut! The best ever! Thanks again to the Glam Salon and Parlor! You truly made my holiday!","useful":0,"funny":0,"cool":0},
{"review_id":"TLHEspZ1dBx2PtciUoUWog","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"Cm-BH_7VPLP63FdI9ML6vA","stars":2,"date":"2014-07-23","text":"This location is extremely slow, the order is usually wrong, and the food taste old. They obviously don't change their fryer oil often enough. They also need to find a better way to count their tills. I don't have 15 minutes in the morning to sit at a window and wait. I would skip this place. There are better ones around.","useful":1,"funny":0,"cool":0},
{"review_id":"wVU00v1xLXOWL0Fg1qJUzw","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"9SHoWGXsGOCa5hOjBOzPtg","stars":1,"date":"2014-08-08","text":"Gross gross gross gross. \n\nMy food tasted as if it were a few days old. The noodles were like spaghetti noodles and waayyy over cooked and the sauce tasted sour. I will never come back here. I am incredibly disappointed. I should have asked for a refund but I really did not want to bother.","useful":3,"funny":0,"cool":0},
{"review_id":"2Rjs7CPKi15xYU8H5zDACA","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"elqbBhBfElMNSrjFqW3now","stars":5,"date":"2014-07-23","text":"This place is delicious!! The pad Thai was the best I have ever had! It has the perfect amount if spice! The spring rolls are to die for! I got my food to go and cannot wait to have it again!!!","useful":0,"funny":0,"cool":0},
{"review_id":"9c7rplxixiKgGPKjWLKQ6w","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"1jpYP-JNOEYCMIzP4OlGuQ","stars":5,"date":"2014-07-23","text":"COCONUT BARK! It is an absolute must. I could eat that every day all day if I could. I love that everything is so fresh! \n\n My current obsession is the chicken with the pineapple Verde sauce and all the veggies. \n\nThere is always a Groupon or special so it fits right in any budget.","useful":0,"funny":0,"cool":1},
{"review_id":"_zJ8iai_D86baDuCcq4tQg","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"2JUNJzagYiyWA6G_oxKJ0w","stars":5,"date":"2014-07-24","text":"Very friendly, you get what you pay for. Great cardio equipment. Good weight machines. Friendly staff. Not too busy","useful":1,"funny":0,"cool":0},
{"review_id":"F5sQaxVcGXbtDkUFhnnQvw","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"ed-iUPuffMZsni_4AAN61w","stars":5,"date":"2014-08-08","text":"Sweetest people ever!! They work hard, work to make you happy, and very knowledgeable. I refuse to go any place else. I cant seem to find the same amazing customer service anywhere else. The open hours are perfect, the location is convenient.  I just love it here!","useful":6,"funny":0,"cool":0},
{"review_id":"qSxwgshD8eI59kSmNVXgjQ","user_id":"0L1v-XnTfzUmY-TbfdiZ2w","business_id":"0zeQRzpO06evIZfcR_aZ5w","stars":2,"date":"2014-11-09","text":"Great Concept. Poor execution. \n\nThere were several games, popular games, that were out of order. I would love to have played pac man, but I couldn't. The music was slightly depressing. I was hoping for something more up tempo. Nothing is more inviting than an empty dance floor. I didn't bother ordering a drink. I preferred to just walk fremont street, in stilettos, instead of spend any more time here. It was a very disappointing experience. I will not be going back.","useful":0,"funny":1,"cool":0},
{"review_id":"tbFIpOraCKz3eUQEjmUKYg","user_id":"AT-tDRaviA7alszwI7Fx4g","business_id":"-7H-oXvCxJzuT42ky6Db0g","stars":2,"date":"2017-09-04","text":"Not worth the money. This is my 4th time here and each time I've been unimpressed. The large pretzel for appetizer was completely cold. The Farmhouse burger I ordered (over $10 in price) didn't come with lettuce, tomato, or onion. My brother's falafel was like mush and had to send it back. The waiter also seemed overwhelmed for lunch hour with barely tables filled. Every single time I've been here, it just hasn't been worth it. Did I mention it's $2.00 extra for a neat or rocks pour of liquor? When I asked how else you would order a drink, the waiter said it's a 2.0 oz pour verses a 1.5 pour and they have \"fancy ice cubes\" that take a lot of labor. When we ordered a rocks drink, it didn't even come with this so called fancy ice cube. I don't recommend this place. Maybe for a drink but definitely not food.","useful":0,"funny":0,"cool":0},
{"review_id":"_JnJ14nWBnz2hCVhcxLBiA","user_id":"AT-tDRaviA7alszwI7Fx4g","business_id":"LQFmktF43j2NPncKdNd9mg","stars":4,"date":"2017-08-13","text":"Love Fat Heads, but no restaurant establishment should ever charge for a side of ranch. It's a condiment. That'd be like charging for ketchup that's already sitting at the table.","useful":0,"funny":0,"cool":0},
{"review_id":"HROCCqlO545Nq2Jh8oEyIg","user_id":"AT-tDRaviA7alszwI7Fx4g","business_id":"Dz48AHU652_zg43sBPRb9w","stars":5,"date":"2017-07-28","text":"I'm 8 mo the pregnant and NEED ice cream all the time. Antney's was so friendly and delicious. I love that everything is handmade. We brought my dog along for one of their pup cups and he loved it! I can't wait to take my friends here.","useful":1,"funny":0,"cool":0},
{"review_id":"Dq5Ymgp5WVwA0sf3fb4oTQ","user_id":"dPFPFLsC4SoT6poNIU0USQ","business_id":"mIJO9f2A3gfj4ahAM0QBQw","stars":5,"date":"2014-05-16","text":"I experienced and electrical problem this morning and called Melissa at Eco. I'll cut to the chase: I would not go anywhere else or consider anyone else because from the initial request for help to the completed work, everything went to perfection! Bill arrived on time and even called to say he might be running a bit late. His work was flawless and he did more than expected. He explained everything he did, went about his work as a true professional and completed the billing transaction effortlessly. This is my second experience with these great folks and if I could rate ALL ASPECTS of the service higher I certainly would. Eco is simply an outstanding company with a superb group of people.","useful":0,"funny":0,"cool":0},
{"review_id":"X_XU0msTiq-IE3IfyVT8DA","user_id":"dPFPFLsC4SoT6poNIU0USQ","business_id":"d3zW_b-JWlxMneNn7K9xew","stars":5,"date":"2013-08-12","text":"We dined here after receiving a coupon mailer. Having eaten pizza from the time I was a kid back east, good pizza, then suffering once in a while from that cardboard crap from the major take out joints which advertise on TV, I was pleasantly surprised and then thrilled with our experience here. The store is located in a neat strip mall on Fort Apache near Russell Road. The inside was spotless and it was clear that someone takes a great deal of pride in the appearance. Our server came promptly, answered questions, and took our order. She brought some rolls and marinara sauce as we waited, which was great. Our pizza arrived and it not only looked great but tasted great as well, hot and delicious. We took two slices home and even after resting for a day, the taste and texture of the crust and toppings was superb. We opted for the New York Combo and it's one of the best pizzas I've ever eaten and we will certainly return. Thanks very much for proving that a traditional pizza restaurant can still exist and more than successfully compete with the best.","useful":0,"funny":0,"cool":0},
{"review_id":"0UDtZGWxJTqxiT-dXqT5Kw","user_id":"AeONlsZSC8fmOumdAnMiUA","business_id":"9MnbQg7kfb_WgxoV0hXKSQ","stars":3,"date":"2014-02-28","text":"My biggest problem here was expectations everyone had set the bar so high. So I was expecting something much better than I was. Wasn't terrible. But wouldn't  say it's the best second-best in the nation \n\nI had the Two meet combo with pork ribs and pulled pork. The ribs were okay. Nothing special. And the meat involved on. I'm not a fan of vinegar barbecue sauce. So the Georgia peach was my favorite. The cornbread was good. The atmosphere was really cool. Overall Its too bad the expectations were so high I think I would've liked it better.","useful":3,"funny":0,"cool":0},
{"review_id":"NsJjCu5LD5btKVdCSJ71uw","user_id":"6GA2hq55KqDyxET6SgDtjg","business_id":"X-U51yD8W1dQgyClxgjLEg","stars":5,"date":"2013-09-10","text":"Thank you for a wonderful experience. My friend and I felt completely pampered by the staff and they got the scheduling down to an art so we did not feel rushed as we basked in total relaxation. Thanks to Lita and Vivian for your wonderful company. Would definitely come back.","useful":0,"funny":0,"cool":0},
{"review_id":"25YiwX7DwcjmDJAMZ3frPw","user_id":"L2Soo7XJmQUCw8AFw1aTbA","business_id":"2ompyGP88KzsQ6SY01d3tg","stars":5,"date":"2016-05-04","text":"In a city of sign flippers and first timer discounts it would be easy to let this hidden gem pass you by -- but it's the small things that make this place great. Multiple TVs, free beverages, and lots of laughs. I've been here a few times and will always be back when I'm in PHX. I've had good haircuts every time I've been. My most recent was with Boris who cleaned me up nice before a trip on short notice (I got in there 20 minutes before close, but wasn't treated like it was an inconvenience).\n\nIf you're good at planning (read: not me) make an appointment online.. They can get busy.","useful":1,"funny":0,"cool":0},
{"review_id":"OA1EKYKw95Xqh4Px64z9IQ","user_id":"L2Soo7XJmQUCw8AFw1aTbA","business_id":"n0LfBrR1U69VU9zFj1kSLA","stars":5,"date":"2013-12-03","text":"After relocating from Boston I was told that AZ was a great place for finding cheap, reliable mechanics. Thankfully I've yet to need any significant work done, however I will say this was one of the more positive oil change experiences I've had. The worst thing about going to a chain is that they will try to upsell you -- $30 markup for a new air filter? No thanks. Not so here, and they go above and beyond -- even offering to check the tire pressure on my spare. I will be back!","useful":1,"funny":0,"cool":0},
{"review_id":"E_cJODbvajI-2lGtiOLF4A","user_id":"L2Soo7XJmQUCw8AFw1aTbA","business_id":"1lAV0CZdveG9tYlZZfWjCA","stars":2,"date":"2013-12-03","text":"Bummed I didn't read the reviews prior to making the drive, this is not the real deal. The original glazed seemed like a store bought donut put in the microwave. I'm giving +1 because the iced coffee wasn't bad - however their large iced is smaller than a Dunkin' medium iced.","useful":0,"funny":0,"cool":0},
{"review_id":"_9MftU42DLIjJla2wsYDiw","user_id":"JoKlIXsU-W-zwBIPi6nNGA","business_id":"FLMxWQO-ckCQmGZhU9OQgw","stars":1,"date":"2013-01-04","text":"Uhm... I recall hearing that this place is supposed to be good. Maybe that was decades ago.\n\nThe pho noodles weren't completely cooked & was flavorless.\n\nHubby said roast beef dry.  Although the mongolian fresh food was decent along with the beets salad.\n\nCoconut & tiramisu gelato was good as with the tres leches.  \n\nWhy only 2 stars? The food wasnt fresh enough in a large enough quantity to make it appealing to me.\n\n5 stars for the wait staff service, but that alone nor the desserts will get me back in that place...","useful":1,"funny":1,"cool":0},
{"review_id":"gwK8paWLesj8e9OB82sjKg","user_id":"JoKlIXsU-W-zwBIPi6nNGA","business_id":"xtYiHTmunjfCN2sUaQxBjA","stars":5,"date":"2013-01-04","text":"Theee best $27 we spent for a hotel suite through Hotel Tonight APP. Sister in law paid only $17 for completing a survey.","useful":0,"funny":0,"cool":0},
{"review_id":"G0TaySbDn_ezOjwQOlz6Hw","user_id":"TvOobI061ZQCZJFr0ENgyg","business_id":"p1eUTUB_5hf1enoKYBV3DA","stars":3,"date":"2011-09-07","text":"Always listen to your server. Always listen to your server, ALWAYS listen to your server - especially when you are in the capable hands of one of Ken's highly trained wait-staff. We broke the rule and regretted it.\n\nThe 5-star moments: Bellini cocktail made with real peach puree and real Prosecco, Asparagus wrapped with Parmesan and prosciutto, Watermelon-Cucumber salad with mint and balsamic.\n\nThe Good: Great server, very conscientious and accommodating, knew his menu and knew what the kitchen would do (almost anything you request if they have it in the house), attentive to our fellow-diner with mobility impairment. Also good - the service was attentive but not rushed, the Chicken picatta rivals my favorite all time version and the sauce on this one was thickened just a little so it would cling to the pasta. The chicken was flavorful and perfectly cooked.\n\nThe Bad: They served a dry gin Gimlet with blue cheese olives instead of lime (eww). The table was in outer Solbovia from where we came in the front door. (They need some low-tops in the first room by the front door.) The server did not offer prices for the menu specials - which upon receiving the bill created a bit of a shock - the $30 entree salad was lovely with it's 5 sea scallops and mound of fancy greens, but it wasn't $30 good, even at a Ken Stewart restaurant.\n\nThe Awful: (here is where we broke the rule) The decision was between a pizza and the lasagna for one of our party. After much discussion and consultation with the waiter the lasagna was chosen. BAD DECISION. It was not \"Bolognese\" as there was not enough cream in the sauce to even begin to color it and WHERE was the meat???!!! The large serving of undercooked layers of pasta and scant fillings was covered with what I would call Marinara at best and pureed tomatoes at worst. Do NOT order the lasagna. To be fair - they offered to take it off the bill for us and the waiter did remind us that he had \"tried to steer us away from it\" and toward the pizza without ever coming out and saying - \"you won't like it\". We laughingly had to admit he did in fact try to save us from ourselves.\n\nThe Unforgivable: As I mentioned earlier, one of our diners that evening is mobility impaired. She had carefully descended to the dining room down a set of 5 rather steep steps, but to go to the restroom she decided to take \"the ramp\" (a long switchback of ADA required wheelchair access). \"The Ramp\" winds its way through the back areas of the restaurant and our diner saw things on her journey she should never have seen: carts and tubs of dirty dishes and table cleanings lined the entire ramp making it impossible to use the hand rails (required for someone in our amica's situation), the floor of the ramp was littered with lettuce shards and a slice of lemon. The topper of the entire trek was to be assaulted from above by someone throwing something over the upper railing down into one of the bins of garbage below. Fortunately, for all involved, the detritus missed our guest, but did land on the floor near her feet.\n\nTo be fair, as we were leaving Ken was coming in. He listened attentively to our \"teachable moment\" about the ramp situation and was clearly not pleased. He dashed off to have a look himself and I am sure we will not see this particular issue again. We neglected to fully disclose the lasagna problem but will let him know via phone.\n\nThe bottom line: as with many owner-named restaurants, if the owner is on-site the place is amazing. This is true of all of Ken Stewart's establishments. Since he can't be at all three at once, he needs to rely on the most exacting mangers to be his 2nd in his stead. Tre Belle failed this test. I will try them again for lunch or maybe check out the \"rustic brunch\" on Sunday. I would certainly go back for Bellinis and appetizers. Not so much on the special birthday\/anniversary dinner occasions. And next time I will listen to my server.","useful":2,"funny":0,"cool":0},
{"review_id":"245BNP-z2RDoAx66L0tWAQ","user_id":"quva32OR0aKR_FH3RLCCHA","business_id":"oeRLD870Z76FD1OYW8jbSQ","stars":5,"date":"2010-07-14","text":"I attended a pole certification course with Fawnia. She was amazing! A phenomenal instructor, patient, knowledgeable, gracious and classy in every way. The certification course helped me so much in the formatting of classes for my studio, also giving the knowledge I need to ensure my success. I would recommend any of her pole or dance classes, as well as the certification.  Her instructor were all fun, energetic and awesome instructors. She is always available and very helpful. A really sweet person. :)","useful":0,"funny":0,"cool":0},
{"review_id":"rJbob_9ttFtoKy36LNOGEQ","user_id":"etPXsEu2zjq7_RoIZFPtxg","business_id":"qFZ7ReYNpjHuvSxOqXqHMg","stars":5,"date":"2017-06-04","text":"Came for lunch and did the AYCE. Wasn't busy and got seated right away. The chefs made the sushi and gave your order to you. The food was delicious and the service was great!","useful":0,"funny":0,"cool":0},
{"review_id":"PpT5vmWqhaZ_gdx4Nx9DBQ","user_id":"etPXsEu2zjq7_RoIZFPtxg","business_id":"mZZpoSSg9-PteV7EV-Keqg","stars":5,"date":"2017-06-10","text":"originally tried the chamango at first friday this month and fell in love! the staff is also very friendly. went to their store today because i wanted more!!! will be coming back on my next visit to vegas! wish they had this in Hawaii!","useful":0,"funny":0,"cool":0},
{"review_id":"Pn7ousMmnpkLEs-X_da-QA","user_id":"etPXsEu2zjq7_RoIZFPtxg","business_id":"eKVCZlOkvf7gsHazOX_dLQ","stars":5,"date":"2017-06-11","text":"Came in to get a new tragus jewelry because the stud I had fell out. Being on vacation and not wanting my hole to close, I found this shop online. The lady that helped me was so nice and went above and beyond showing me all the jewelry and explained how each one worked. Ended up leaving with two new tragus earrings! Thank you so much!","useful":0,"funny":0,"cool":0},
{"review_id":"1aBtHIZbfFxOgqOcayv6VA","user_id":"70RR4DtLToWkO-N-6RsGEA","business_id":"R-DCYO_bEIPskFvhNLfeAw","stars":5,"date":"2014-10-17","text":"Excellent customer service.  My wife and I felt welcomed as if we were family. Dan dropped everything as soon as we came in. He helped me chose some reasonably priced but delicious cigars.  He also recommended some nice pipe tobacco. Thanks guys.","useful":0,"funny":0,"cool":0},
{"review_id":"lQEBOEz4GW_AIEH6K4GayQ","user_id":"eFCUxEy4g-FMCsxZ2YJWkQ","business_id":"nrwKiDMr4odCkjx78e5IfQ","stars":5,"date":"2017-06-18","text":"This place was really nice. Everybody was so attentive and the food was great too. I love the plantains and the yuca frita. I recommend this place for people who likes flavorful food. Pleasant ambiance.","useful":0,"funny":0,"cool":0},
{"review_id":"7WU-EvBSwZq9m8vpb93fmg","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"VoXUt6TIJWyIf_lihbN5xQ","stars":5,"date":"2011-09-26","text":"I came here with some co-workers while in Arizona on business. We had a reservation for seven people at 6pm.\n\nWe got there in a large group, and our table was ready to go. Our waters were given to us right away and our drink orders were quickly taken. I ordered the Riesling, which I have had before and it didn't disappoint.\n\nFor starters, we ordered the fried zucchini and the calamari. Both were quite tasty. Extra points from me because the calamari was perfectly cooked, and not at all rubbery or chewy.\n\nI will admit, the server took a while to come take our orders, but with our large group, we were in no hurry. I ordered the turkey and brie pannini, and it did not disappoint. In fact, it was one of the best sandwiches I'd ever had. There was thinly sliced turkey, brie, grilled apples, and some sort of cranberry sauce that made it taste incredible. \n\nI traded half of my pannini for half a proscuitto pannini, and that sandwich was good too. In my opinion, not as good as the turkey one, but really close. There was real proscuitto di parma (not the cheap domestic stuff), fresh mozzarella, arugula, tomato, and some balsamic vinegar. \n\nWe were too stuffed for dessert, so I can't comment there.\n\nOverall, I would recommend this place. It was always busy, but never too crowded and the staff were very nice.","useful":4,"funny":0,"cool":0},
{"review_id":"G2RMLlLbt4MoVAKk5OQcCQ","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"C6cZf419zes2W1S7MfRV6A","stars":2,"date":"2014-09-29","text":"We stopped here at my husband's request while driving home to Chicago from Niagara Falls. The review is mixed - he liked it, I thought it would be OK to skip.\n\nWe got through the museum in just a couple hours. There is a lot of focus on the history of music and how it evolved, which my husband really liked.\n\nOverall, there was mostly different displays that paid tribute to different bands in different eras\/musical styles. For example, the British Invasion section had 2 big displays - not surprisingly one for the Beatles and one for the Rolling Stones, and then a smaller section for a bunch of bands like the Clash.\n\nThere were a few special exhibits, like the musical experience of attending a music festival (Lalapalooza, Woodstock, etc).\n\nThe place is mostly  odd relics of musical stars, like a guitar used by Elvis, Beyonce's Superbowl halftime outfit, Kurt Cobain's death certificate, and Jim Morrison's boy scout uniform, for example.\n\nI didn't think it was worth it, but my husband did. I wouldn't go back.","useful":3,"funny":2,"cool":2},
{"review_id":"ld5BetgTvu9OlAMqYsELew","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"w4a6TuFWArSc29dB51rPNA","stars":2,"date":"2014-09-22","text":"I was definitely disappointed after reading so many glowing reviews.\n\nI came here on a Wednesday evening for a late dinner. We arrived around 9pm, and waited to be seated, as the sign said to do. After a bit, a guy came from behind the bar to see why we were waiting, and didn't know why the sign was still up. He told us to sit anywhere. No small talk, no chatting, all business.\n\nWe chose a spot and waited a bit for our menus to arrive. While they have a pretty good beer list, I thought they were all really expensive, especially for a Wednesday night. No specials were running, as happy hour clearly had come and gone.\n\nMy husband ordered a beer, but I stuck with water. Not once were our water glasses filled while we were there, so I had nothing to drink with dinner. It seemed like they were short-staffed or something, as there wasn't anyone to flag down. The one guy who seated us was behind the bar and serving other tables, so we were not checked on during our whole dinner.\n\nWe ordered 2 pizzas - a blanco and an arugula. The blanco was nothing special to me. Yes, I'm from Chicago and prefer deep dish, but the think crust had barely anything on it. The cheese was lacking, as was the garlic. My husband's arugula pizza had the opposite problem. Bar Cento cures their meat in house, and the prosciutto on the pizza was the saltiest meat I have ever tasted. We love our Italian meats, but my husband summed it up when he said he actually preferred the pizza without the prosciutto. That's a problem.\n\nI will say the server brought our bill quickly and returned it quickly.  It was just as well - we wanted to leave.","useful":2,"funny":0,"cool":0},
{"review_id":"5vM-SlcFW4P8pWKSHpaqBw","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"-Eu04UHRqmGGyvYRDY8-tg","stars":4,"date":"2014-09-26","text":"We popped in right before closing time while visiting Cleveland because we'd read good things. \n\nFor a local, I could see this place being amazing. Tons of meat, fruit, veggies, cheeses, etc. on sale at great prices. As we arrived, the shops were all closing up for the day. I was kind of bummed. I would have loved to purchase some tasty treats, but I knew the meat probably wouldn't sit well unrefrigerated on the drive home to Chicago.\n\nIf you're a local, don't miss out!","useful":0,"funny":0,"cool":0},
{"review_id":"4QLZulpzpGj2UzBK7r0Mhw","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"Ycn-l-X6joxbVQzgxjXpRQ","stars":5,"date":"2011-09-26","text":"I stayed here while in Arizona on business, and this place is awesome. I could not be happier with my stay.\n\nFrom check in to check out, I had no issues. The staff is very friendly, helpful, and accommodating.\n\nI had a chance to eat breakfast at the hotel one of the days I was there, and the food was delicious. I had a breakfast burrito and really enjoyed it. Warning: the coffee is strong - just the way I like it!\n\nThe grounds themselves are beautiful, especially the pools. Yes, I say pools because the pool is actually made up of a bunch of smaller pools that seem to flow all around the grounds of the hotel. There's a water slide, kid's \"beach\" area, a hot tub, and an adult only pool. Unfortunately, I didn't have much time to spend there, but I snuck out to the pool every chance that I had. An added bonus: the pool doesn't close until 11pm, so I was able to go after getting back from work meetings, and was able to enjoy the sounds of live music while there.\n\nThe room itself was great. I had a large king bed, a great balcony with a view, and the bathroom was gorgeous. The rain shower hear is making me seriously want to upgrade mine at home.\n\nEverything was perfect, and I was very pleased with my stay. I would recommend this hotel to anyone.","useful":3,"funny":0,"cool":0},
{"review_id":"D0j7cjHH09csxxINSteOvQ","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"7ONkTrReRsz9TN6ThjTBlw","stars":4,"date":"2014-10-20","text":"Such a cute B&B that makes you feel right at home.\n\nWe stayed here for one night while driving back to Chicago from Niagara Falls. We wanted to break up the drive, and my husband thought we should stop in Cleveland. From making the reservation to checking in to scheduling breakfast, everything was easy.\n\nWe stayed in a separate apartment attached to the B&B, and was way more than we needed for our one night stay. We had a full kitchen, half bath, dining room, and living room downstairs and then upstairs was the master bedroom and full bath. Just a ton of space to spread out.\n\nJim decorated the walls with his original paintings, which were really nice. He has everything you can possibly need ready and waiting for you - pots and pans, dishes, board games, toiletries, and tons of books.\n\nBreakfast was delicious too. We had asparagus omelettes with fresh sausage that he had just purchased from the market nearby. Jim was great to talk to, and even shared some of his stories with us during breakfast.\n\nThis review wouldn't be complete without mentioning Sherlock, the resident B&B pup. What a well-behaved cutie.\n\nFinally, the B&B is well situated in that it is walking distance to some great food and the market just a few blocks away. We had lunch at Great Lakes Brewing Company, which was maybe a 5 minute walk. \n\nI would recommend anyone stay here!","useful":0,"funny":0,"cool":0},
{"review_id":"lgGz02QjawZy5NRohvbPZA","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"meXjqyhTNLFmknY39y2sMg","stars":4,"date":"2014-10-07","text":"A great spot for food and beers - I'd go again if I was in town.\n\nWe headed here for a late lunch on a Wednesday. I was happy to see they make the most of their outdoor space with a ton of tables outside along the street and in a covered beer garden kind of area. We were seated immediately.\n\nBeing fans of Great Lakes beer, we decided to get a bunch of smaller tasting sizes. Our waitress was very knowledgeable about the beer and food menu and made great suggestions.\n\nTo eat, i had the Cuban sandwich and ordered sweet potato waffle fries for a slight upcharge. Both the sandwich and the fries were great - definitely worth it. My husband ordered the fish and chips, and it sort of missed the mark for me. I thought the portion was small, with only 2 small cod filets on the plate. The batter was good though - nice and crispy.\n\nWe were too stuffed for dessert, but we did order an Edmund Fitzgerald to sip while we let our food digest.\n\nAfter lunch, we walked over to the store and made a mix your own 6 pack to take home with us. We were there in mid September, so I was glad to snag some Nosferatu.\n\nI'm not sure if brewery tours are offered, but if so, I'd go. The brewery is just down the street from the brewpub.","useful":0,"funny":0,"cool":0},
{"review_id":"U2k7L-gvCpR5-xYz_hdbqQ","user_id":"kmrK4LByvnX3SgU2tIDmOw","business_id":"zrDi4gEaUi64lAMfJU51dw","stars":4,"date":"2011-09-26","text":"This place has a totally laid back atmosphere and some great food. I went there with two co-workers while I was in Arizona for business. We all couldn't resist the temptation of the cheeseburger. Mine was cooked and seasoned to perfection, and the portion was huge. The fries were kind of like shoe string ones and very thin, which is why I knocked a star off the top. I prefer big steak fries.\n\nThe beer list was pretty impressive too. I had a Pacifico and a Heineken Light while we were there.\n\nOne warning, the prices can be a little steep. A cheeseburger is $14 and it was the cheapest thing on the menu. The servers were very attentive and I had a great time.","useful":1,"funny":0,"cool":0},
{"review_id":"yJhi_NlN0hQDw0iBaT1XAg","user_id":"rSJDn4iHpCkayWb4nuP1Tg","business_id":"CWlQcOcpSMRrHeaZkWoeJA","stars":1,"date":"2015-09-12","text":"Waited an hour to be seated after being told 20-30 minutes. Then it took another hour from being asked for drinks to receiving our food. The waiter seems to be overwhelmed with work while the 5 greeters just just fooled around. First and last time at this location.","useful":2,"funny":0,"cool":0},
{"review_id":"hOqW2nHtTQl7OrE9yjUtxg","user_id":"bQBOc2jWcwj5BOMl4Ao8ag","business_id":"FkmQbim2v64DvE69FfuThw","stars":1,"date":"2013-07-11","text":"Caveat Emptor. We hired this estate sale company last summer to help us with downsizing and a move from Madison WI to Austin TX. Susan recommended a gentleman who would charge $50\/hr to haul items from our home to the TOPS showroom. We ended up paying him $1000, although he made at least one trash one, so being generous let's say $500 went to hauling items to the showroom. Once the items were there, I was charged $122.50 for processing and tagging. The total proceeds I received came to $250, which means that the whole experience actually COST ME $375. Susan will say we did not end up sending in all the items we planned to, and admittedly we did give a few items to family & the people who bought our house, but at $50\/hr, the gentleman Susan recommended spent AT LEAST 10 hours hauling items from our home to the showroom, and that implies quite a few items. I would have been MUCH better off just giving the items to friends and family.","useful":17,"funny":0,"cool":0},
{"review_id":"2Dvq4154_WNuz9n0MS6Z9Q","user_id":"fQ662_ygUTPuHXJgXUeCLg","business_id":"ypSAad4wGe3Uh0N6dgVxaw","stars":5,"date":"2015-10-31","text":"I had a great car purchasing experience with Kevin Campbell from the first phone call I made until the new car arrived. We customized our car with specific options and he was very knowledgable about different combinations, helping us to get all the things we want with smallest overhead. I made a number of phone calls and sent a number of emails, and for all of them he was extremely responsive and accessible. I would recommend Kevin and this Porsche dealership for any future customer.","useful":0,"funny":0,"cool":0},
{"review_id":"YmMqkBG0I9yBcB-pIjhwfw","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"oJxuSZOoFprrjm0Dvwdc-A","stars":1,"date":"2013-08-07","text":"Visited the Mississauga location Monday, and ordered the \"Great\" Canadian burger. Took a photo, and didn't notice what was soon GLARINGLY obvious. There was a plastic TWIST TIE in my burger! Of course, I realized this on the first bite, and brought the burger to the counter. They offered to make a new burger, but downplayed the severity of the situation, saying \"Oh, yeah, that's just the twist tie that's used on the bags the buns come in\". I don't care WHAT it is used for. It's a FOREIGN OBJECT, and had absolutely NO BUNSINESS being in my burger! Not returning. Ever.","useful":0,"funny":0,"cool":0},
{"review_id":"SiYonvCZ8GxTbsK2C3C7DQ","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"TW53EB3Xw-uWnN3XS8qulQ","stars":1,"date":"2014-10-17","text":"Twice in the last few weeks, my fianc and I have visited. Twice we've been disappointed. \n\nBoth times we've visited, we ordered the same thing, the Rippn' Chicken, which is a feature item on their menu. Each time we've ordered, they've had to cook it from frozen, as they never had any ready to serve. While it is frustrating to see people walk in behind you and leave with their food while you're waiting for yours, I do appreciate that the alternative is eating chicken that may have been sitting quite a while. \n\nWhat I do not appreciate, though, is being forgotten. I watched as the onion rings I ordered were put in the fryer after my chicken was ready. The guy behind the counter tried to tell me that the onion rings take longer to prepare. (This is true; they do take longer to cook when you put them down after the rest of the order is ready!) He assured me that he'd bring them to me when they were ready. \n\nI ate my chicken, my fianc ate her chicken and fries. No onion rings came. I went to the counter, and the same guy who served me and promised to bring my rings when they were ready said \"Oh, it was that good, you're back for more?\" \n\nSERIOUSLY??? \n\nI told him that he hadn't brought my onion rings, he played dumb, pretending to not know what I was talking about. When I demanded a refund, he remembered, and spoke with his manager in a foreign language. I found this to be extremely ignorant. The only reason someone who speaks perfect English would choose to speak another language in front of a customer is the fact that they have something to hide. In this case, it was the fact that they had messed up the order due to ineptitude. \n\nA closer location to us has opened, but my level of confidence is not high. These people have absolutely no business working in food service.","useful":1,"funny":0,"cool":0},
{"review_id":"U-1jVZ9mZk32GZzKnCTosg","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"oKY9y_nzVguDkgpC1ggKsg","stars":2,"date":"2017-07-24","text":"Saw my first concert (Dwight Yoakam) at the DMH since the renovation a few years back. I'd hardly call removing the seats on the floor so you can jam more patrons in a \"renovation\", but that's neither here nor there. \n\nParking was found easily nearby , but after lining up down the street and around the corner to Broadview, I was told by security that the camera I bring to any other concert venue in the city, a non-professional point-and-shoot with no detachable lens, was not allowed in the venue. The venue's website said it was allowed, but that policy may change on show day at the request of the performer(s). I totally understand that, but the no-camera policy could have been posted at the doors (which I passed on my way to the end of the line) to prevent people from lining up with them. \n\nThe box office does not accept debit or credit, according to their website. The merchandise stands do, depending on the artist, of course. \n\nThe main level bar was easily accessible, as were the restrooms. The restrooms, however, don't allow for a lot of privacy, as the entry doors are propped open. Fine for the ladies, but gentlemen are left (literally) hanging in the wind in full view of the open doorway. \n\nMy wife and I chose balcony seating, preferring a reserved seat to the free-for-all of general admission. For the first two thirds of the show, this was not a problem. But security were going up to everyone who wanted to stand and enjoy the show to sit down? At a concert? In thirty years or more of attending concerts at several venues, I've never seen security tell anyone to sit down and not enjoy themselves. Being forced to sit in seats with little to no legroom for several hours can get quite taxing on the knees for anyone taller than 5'6\". Rather than make people feel like they're living in the town in the movie Footloose, where dancing is outlawed, why not just let people who want to stand up and enjoy themselves go down to the floor area? \n\nThere have been no major changes to the acoustics of the building. The last show I saw there sounded fine, as did the opening act, but Dwight's vocals seemed a drowned out by the guitars at times, so that would be the fault of his sound crew.","useful":0,"funny":0,"cool":0},
{"review_id":"Qjx6Pa_gnfEvRE6p6a5Vrg","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"qOUPufwF51EhQ21TGIgBGw","stars":1,"date":"2011-04-08","text":"How does a place like this stay in business? I've been trying to visit this place since it opened, and gave up. I met the owner one morning while I was out doing laundry. They'd been setting up inside for weeks with a huge \"COMING SOON\" banner teasing for weeks, and I asked when they were opening. He replied \"We opened yesterday, come on in sometime!\" It was 8am, and I was soon off to work, so I decided to pop in on my way home. \n\nI passed by on my way home from work at 9:35pm, and the place was CLOSED! (despite the sign on the door saying they closed at 10pm) The following night, the same thing. \n\nFinally, I decided to stop in on a Sunday afternoon. The flyer, which had been distributed in the neighbourhood, stated they were open from 11am until 6pm. Stopped in at 4pm, and guess what?  CLOSED!!! \n\nHow in the hell does this guy plan on staying in business, if he's only going to be open when he feels like it, and doesn't stick to an advertised schedule? I've all but given up on this place. I'll take a drive to Memphis BBQ in Vaughan next time I'm in the mood for BBQ.","useful":0,"funny":1,"cool":1},
{"review_id":"3p58BxNizB0tnWA-pZR3wQ","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"PBCHeehTKUEcoz5FDwhUkg","stars":1,"date":"2015-03-04","text":"Moved into 1055 Bloor in May, 2014. Management bent over backwards to convince us to move in, but once we moved in, it appeared as though their priorities shifted to luring other suckers into moving in. \n\nSeveral advertisements for 1055 Bloor highlight the beautiful indoor pool, which was our main reason for moving in. We had full use of the pool for two days, after which the heat was turned off without notice. Then it was closed for \"major repairs\" according to Almira, the building manager. The pool was, however, permanently closed without noticed in favour of a \"gym\" which required little to no maintenance. \n\nNo reduction in rent was offered when this amenity was taken away. Management reasoned this was fair, because they were opening the new gym, which was also advertised to attract renters. \n\nThe \"secure\" garage we pay to park in is anything but secure. When we moved in, the door knob was on the floor for several days. Then, when it became obvious that the antiquated locking mechanism was too difficult to open for too many people, someone jammed the lock open permanently. This was not remedied until the building switched to an electronic FOB system months later. How our vehicle was never broken into, damaged or stolen is beyond me. \n\nThe fire department is located nearby, which is convenient, because it's not uncommon for the fire alarm to go off several times over the course of a day, or late at night. These are often false alarms. At least one of which went on for 30 minutes, because the fire department was not notified, and residents were treated to the loud disruption well after 11pm while the inept superintendent attempted to disable the alarm himself to prevent the fire department from charging the company for the fourth false alarm of the day. \n\nRepairs are done on a when-we-feel-like-it basis. It took THREE MONTHS to fix a hole in the ceiling above our bathtub, and the ceiling wasn't replaced, it was only given a poor patch job. \n\nApartments are poorly ventilated. If you're unfortunate enough to have a neighbour who smokes, you can look forward to inhaling plenty of second-hand smoke. The peace and quiet is also often destroyed by neighbours fighting over trivial domestic issues, like who's turn it is to do household chores. \n\nLaundry facility was 24 hours when we moved in, but vandalism caused it to be limited to 7am - 11pm.","useful":12,"funny":0,"cool":0},
{"review_id":"yHaT08IcwCcSIasj2wOcew","user_id":"sJ3YcTPTIYmHdz2jgbWXRg","business_id":"NWVrkmPQW_zRvtOJEz0kxA","stars":1,"date":"2017-05-18","text":"We are far from \"regulars\" but at the same time, this was not our first trip to Fred's, but based on the \"service\" we received tonight, it may be our last. \n\nWith neither my wife nor myself wanting to cook tonight, my wife suggested Fred's. Every time we've dropped in, we've had to sit at the bar, which is less than comfortable when it comes to eating. When we arrived, we were happy to see an open table. \n\nWe sat down, and a waitress approached us. We were a little put off by her introduction... not \"Hi, can I get you a menu \/ drink?\" rather we were greeted with \"Yeah, I'm going to have to move you, because this table wants more space for people who are coming\". Another larger space opened up, and the large table moved. \n\nAnother waitress then came to our table and said \"Oh, there's only two of you? I have to move you to a smaller table\". She didn't bother to ask if a) we wanted to move or b) we had other people coming. \"Or we could just leave\" we said, and the waitress' response was \"Okay\"? \n\nThis is NOT how to respond to a dissatisfied customer. It's also not how to make a guest feel welcome in your establishment. If you don't want smaller groups sitting at larger tables, maybe you should spring for a hostess to greet people at the door, rather than leave it to the customers? It's just as well, because I don't think we would have been comfortable with the cigarette smoke wafting in from the open door on the patio, where the bar turns a blind eye to guests who choose to smoke at their tables.","useful":0,"funny":0,"cool":1},
{"review_id":"H3RymqlUv66qVeQNLASMVw","user_id":"ZigcXEaAY6JrNNS9Ci85Ew","business_id":"x9HvTsA83c5r-muemxw_9A","stars":4,"date":"2013-10-03","text":"I have been going to Thai Lahna for over 2 years for their yellow curry. It is absolutely AMAZING! (and as all of their curries are). I have tried yellow curry at almost every place in Phoenix, and it is because Thai Lahna's is best I put up with the mediocre service. I have called to place my order many times to pick up after work and been put on hold which has meant any of the following (since they don't have hold, it's just the phone being put down): 1) being hung up on 2) being left on the counter forgotten about as I've heard many people place to go orders at the desk. There is one employee that has such a piss poor attitude and looks like she hates her life, but everyone else seems great. One time I placed a pick up order with a friend of yellow curry and vegetarian yellow curry. We picked our food up and went on errands. During our errands we get a call saying they gave us the wrong order and didn't include a vegetarian and we could bring it back. We said okay, we're on errands, we will. Apparently it wasn't soon enough for them because they called us back and asked where we were. When we returned they made us show BOTH the yellow curries and took one back, which I guess is fine but every other restaurant I've ever been to would let you keep the extra, and considering we drove back, I would think this is fair. Overall, I will be going back, but only because the yellow curry can't be beat.","useful":0,"funny":0,"cool":0},
{"review_id":"oBygKiTM5HC1r9wEVpsATg","user_id":"ZigcXEaAY6JrNNS9Ci85Ew","business_id":"Uo8rlHCLINe_2fKFv8wLFg","stars":1,"date":"2015-01-27","text":"My ex and his family have been using Elwood Body Works for years, so when my car was involved in an untypical accident where a semi truck's tire blew and left my car with random damage all over it, I figured I was safe in Elwood's hands.  I was given a fair price on repairs, and told the whole car would be buffed of minor scratches and marks from the accident.  I received my car back and thought all was good.  However, I noticed some damage and had to return.  After I returned and that was fixed, the front fender popped off a bit from it's repair.  Over the next few weeks I noticed blemishes from the original accident that weren't fixed.  Between work and school I literally had no time or transportation to return my car to Elwood, and was so annoyed I'd already been back once I didn't want to return.  I feel I just received someone without much attention to detail, and while I wouldn't go back, I have a hard time believing if my ex and his family have used them for years they are all bad.  I would suggest asking for workers that have been there for years.","useful":0,"funny":0,"cool":0},
{"review_id":"Swvkvot1C3l4zVKVny6AHg","user_id":"ehaM_r_l7PNUb_zooA0ZTw","business_id":"ZsgqlgmzlcZbQREuyNRoKA","stars":1,"date":"2015-09-23","text":"I've been a customer at this place for 2-3 years now, and never had issues...until their staff (and\/or management?) changed over summer 2015.  \nUnfortunately, as of past few months - their quality of cleaning went down (I've had to return clothes every other time because of either smell or spots not being treated); and the (new) staff is not friendly at all. \n\nI'll be taking my business somewhere else, and would not recommend this place to anyone. You get what you pay for.","useful":2,"funny":0,"cool":0},
{"review_id":"LeahobQaXci4wUuENFwiHw","user_id":"OFCp-TW26ujJC7c5vmvN7Q","business_id":"i53HvxUdQEMllZ1XmpjjyA","stars":1,"date":"2015-07-05","text":"This is pretty bad pizza. We ordered because it could be delivered to hotel  ...tastes like cardboard very light on toppings...I would never order again. I think it might be frozen Digorno. The salads were lettuce w three tomato slices..some of lettuce was turning.","useful":0,"funny":0,"cool":0},
{"review_id":"x558BBFeRzwSYe1RwccbfA","user_id":"jwnc72KSGWdN_Cjp_FSohw","business_id":"L6Jnx7zUHDxBZ5e-OYSqLQ","stars":5,"date":"2011-08-02","text":"Mr. Submarine is my go-to sub shop when it comes to comfort food.  The Pizza sub is amazing and there is nothing that compares to it in the valley.  They are a locally owned business that make you feel like old friends.","useful":1,"funny":0,"cool":0},
{"review_id":"wPe_Orb6WzxQa8i1pQX7RQ","user_id":"jwnc72KSGWdN_Cjp_FSohw","business_id":"AwcNjlTqWBObQ9XXCFpg2g","stars":5,"date":"2011-08-02","text":"George is a true professional. This will be the third time that I have used his service within 2 years and the thing that impressed me most is the fact that he remembered my father and I specifically when I called him earlier this week.  He is prompt about returning phone calls and scheduling as soon as he can.  I also have always been more than happy with the level of quality that he produces.  I have multiple rental properties which means that sometimes the carpet is not given much care from the tenants but by the time George leaves, it looks nearly new!","useful":0,"funny":0,"cool":0},
{"review_id":"FxcXyORO684JlXq44B5KMA","user_id":"vEHlrY5_6mDI1_-le8WNpQ","business_id":"BRzbhvg47gNtnNzsPZc8Ug","stars":2,"date":"2014-10-04","text":"Today was the second time I have been to this bakery. I went through there at about 1 in the afternoon to pick up some donuts for my kids.\n\nI will not ever go here again because there was a younger looking blond woman working the counter who with her customer service skills should have been out back far away from the people. First, we were shocked because there was a fly inside the case and she seemed irritated that we even brought it up. \n\nIt is not there food that turns me away, it is the service that I received. \n\nP.S. Why not offer a military discount?","useful":0,"funny":0,"cool":0},
{"review_id":"sW9kDe3KesAVMiZIkmqk0g","user_id":"s2jxAAI9DyFci9Ob_2_F7g","business_id":"YQKdrtfSZajgQey9aNBG6w","stars":5,"date":"2016-06-26","text":"Gwen is amazing!! Highly recommended for a Brazilian wax. She is thorough and her method left me with zero painful ingrown hairs! She also has a great personality to take your mind off the waxing as its happening. Gwen is the best!!","useful":7,"funny":1,"cool":1},
{"review_id":"V--5fpegLGYr-OMwETjHzQ","user_id":"s2jxAAI9DyFci9Ob_2_F7g","business_id":"4nM1IDG6JyA0XLovt-_ENw","stars":5,"date":"2018-01-04","text":"Julie gave me the best blowout I've ever had so I looked fantastic for our family pics. She also saved me from a botched haircut I'd gotten at another salon. She is very knowledgeable and friendly! Salon Zoya is my new \"go to\" for all my hair needs. Highly recommend!!","useful":1,"funny":0,"cool":1},
{"review_id":"Ipur-r--MADCH7yxCyGq_Q","user_id":"s2jxAAI9DyFci9Ob_2_F7g","business_id":"pwNDVAatsIlOdOT3SA2d0Q","stars":5,"date":"2017-12-15","text":"Picking out a Christmas tree here has become our favorite holiday tradition for our family. They have beautiful trees of every size and they are always long lasting. It is a family owned and run business and that makes all the difference in the wonderful experience we always have when we go. Everyone is nice there but we always ask for Jodie because he is helpful, knowledgeable and friendly. Our son has so much fun picking out a tree there he talks about it for weeks. Highly recommend!!","useful":0,"funny":0,"cool":0},
{"review_id":"u34yhd4yvAGJHyRDMS21Qw","user_id":"4X8_sYkYxkLtoK8qE9jV2Q","business_id":"tCkjFVOL2Crz44D8_FDozg","stars":1,"date":"2013-11-09","text":"Please don't come here. I really enjoy good service. I'll pay twice as much for a place that has awesome and friendly service. However, iguana Mack's has mediocre food at best with terrible service and that's a bad combination. The fish tastes like Gorton's frozen fish sticks and the fries are cold and don't have seasoning. There's so many better places to spend your hard earned money.","useful":0,"funny":0,"cool":0},
{"review_id":"XtfZFYN6gR8YzAnv-qtb5w","user_id":"S3rMzYuiMAwoqJKWiYTiGw","business_id":"JJAwT9R6Fp2yyWHtWFA8uQ","stars":5,"date":"2015-12-16","text":"Come by and see the owner June for an amazingly delectable experience. We stopped in for the all you can eat sushi for lunch and told him to surprise us! It was delicious and had some great conversations. Highly recommend fresh fish and great atmosphere.","useful":0,"funny":0,"cool":0}]