[{"review_id":"kCieN9PVbrZe40eNYDZM9Q","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"k7D1eFxN-_Ry491C-RiMpw","stars":1,"date":"2016-01-13","text":"Terrible service .... Terrible over cooked wings. \n\nLiterally was like eating dried out oil jerky ... Not sure how they are still in business. \n\n\nTip* save your time and money go somewhere else... Anywhere else will be better.","useful":1,"funny":0,"cool":0},
{"review_id":"AVutsGbOCKlesul0HrXSFg","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"gEv1Og5uGDLw9HkbKSGUZw","stars":5,"date":"2016-02-27","text":"Love love love this place! \n\n\nTacos tacos  \n\nFirstly just need to say I put the habanero hot sauce on everything here to give it a little kick! ... If you love spice defiantly try it.  Also rule of thumb *squeeze* that lime on everything ! Tacos and in drinks .... Just go wild. \n\nShrimp tacos were juicy and great \n\nFish taco was great and flaky \n\nThey had a Trout taco day feature which was great (with a little lime and hot sauce)\n\nChicken and beef tacos had a decent amount of meat in them and were nicely cooked and shredded. \n\nThe Vegetarian option was surprisingly also very tasty and flavourful \n\n\nCeviche love the jalapeño touch inside but fish and tomatoes needs to be chopped up more for better chip grabbing fun. \n\n\nMargarita pitcher could use a little more lime less agave and more tequila.... Less sweetness and more pungent twist and kick in the mouth to go with those tasty tacos. (I just ordered extra tequila and added to my cup.... But I would say about 4 more shots in the pitcher would fix it)\n\nOver all very great vibes...music is beautiful loud and upbeat. Friendly staff. Great place to go grab a bite laugh and enjoy a fun Latin vibes time","useful":0,"funny":0,"cool":0},
{"review_id":"bDKAD52T5_dWnuTjZwzXgA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"J8cLxK-DIl8ZweElFLec7Q","stars":3,"date":"2015-09-16","text":"Great, friendly, quick service.... The Red , yellow and green curries are great  creamy and has a nice flavour \n\nRed - personal favorite we get this all the time. \n\nGreen - little spicier so not recommended for those who do not like spice \n\nYellow - good .. not spicy","useful":0,"funny":0,"cool":0},
{"review_id":"m-xTYOTdkk5dOf4JLnbLVA","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"b4LmLgVdbhM-nc1IZc5Weg","stars":5,"date":"2015-03-26","text":"Love love love ! Great food! Really hits the taste buds of sea food lovers ...the best way! \n\nhave been here many a times .... Love how they change up a lot of the plates! Always a new adventure  \n\n(Summer nights)Lobster Bisque - creamy buttery not over salty just perfect! \n\n(Summer nights)Scorpion Fish with Roasted Garlic Mash - Garlicy creamy perfect mash - Fish was flaky tender perfect ... Severed with a side of roasted crisp veggies. \n\n(AIl year)personally love the smaller oysters ... I usually eat 12  just for me! \n\n(Entering spring)Tuna Tartar -Fresh And Toasts were a perfect duo\n\n(Autumn) Seared Tuna with a creamy broth was absolutely perfect and the long chip\n\nClam Chowder - Creamy perfection with a little potato","useful":0,"funny":0,"cool":0},
{"review_id":"dSJalL-4TmWeuKmY3OdKoQ","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":1,"date":"2016-04-16","text":"Was very displeased as a regular client of Khao San Road. \n\nI have come here for a couple years... always in person. \n\nThe other day I tried to order take out I was trying to get through for over 30mins calling over and over and over again. I was EXTREMELY unhappy with the fact that I was pushing close to an HOUR with trying to order food. I called Northern Thai and they picked up the phone immediately.","useful":1,"funny":0,"cool":0},
{"review_id":"-2FCX5wLY9aS7LspKKyo4A","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"TqMTY6xTHThm0C7J1pJ7Aw","stars":2,"date":"2015-10-29","text":"REALLY dry ribs, pulled pork tasted like watered down sauce was added after cooking. \n\nMac and cheese was creamy and good not over cooked \n\nSlaw was good- just normal slaw \n\nI honestly could not believe how dry my ribs were.... It was pretty heart breaking as I had been looking forward to going there just for that for sooooo long ! \n\nBrisket was cooked well ... For most of the pieces I got because again part of it was dry. \n\nTip***The sauces are good but they need to leave the ribs in for a longer cooking time seriously tho .... Please do.... Ribs are suppose to fall of the bone not be like jerky .... If I wanted jerky I wouldn't order ribs. \n\nCustomer service was great! Very friendly and helpful. \n\nThis place has a LOT of potential to go so far ... The major loss of stars for me was because when you are a bbq house that advertises ribs like that I expect them to know it is suppose to fall off the bone.","useful":0,"funny":0,"cool":0},
{"review_id":"tWodKh9Oopx9uI33IZZ34Q","user_id":"kBNFdviedCPFWyR-wVaAzw","business_id":"RwRNR4z3kY-4OsFqigY5sw","stars":4,"date":"2015-09-16","text":"Great Japanese Cheesecake!! I loved it!! \n\nThe only thing they need to figure out is an effective way to get that line moving faster. It can be a very long wait ... Which makes the  whole experience negative for people.... Taking away from the enjoyment of the products.","useful":1,"funny":0,"cool":0},
{"review_id":"ezOskeLKOq9xd-815hmQsQ","user_id":"jjSR3JpsYKIgMUSR5zHRsQ","business_id":"x2NuIlQgvvl3Wtq8ipZC6Q","stars":5,"date":"2015-10-23","text":"My dog is really nervous(shaking, hiding, an occasional growl) at the vet.  Other places I have been the technicians make a comment about her being scared, ask questions, then leave. At countryside the technician went out of her way to try to calm my dog. My dog even gave her kisses, which she has NEVER done in the 10 years I have been taking her to the vet. I wish I could recall her name, because she was excellent. Dr. Hoppe was wonderful and knowledgeable and made our visit quick and easy without trying to add any tests or procedures that weren't needed. Because my dog is so nervous she is often overlooked as being a good girl, so I appreciate the nice words that Dr. Hoppe said about her! The free hugs and kisses on the bill is also a nice touch. Thanks for the good experience!","useful":0,"funny":0,"cool":0},
{"review_id":"D_WOkbf2X0c8tZqKeWzijQ","user_id":"xZ62OTOf-L88ucRYkFpEBA","business_id":"D9Uf7UmU2KlgS_H8lJwOrA","stars":4,"date":"2014-11-14","text":"The veggie burrito here is a staple in my diet. Great place, simple good food and nice people. The student deal is awesome.","useful":0,"funny":1,"cool":0},
{"review_id":"wrOqFe_OcoNSgCDvNL9SpA","user_id":"xZ62OTOf-L88ucRYkFpEBA","business_id":"-qdbWrCU8Ktg80dk458BAw","stars":5,"date":"2014-06-14","text":"this is hands down one of the best Indian restaurants I have been to, not to mention vegetarian. food is great, people are great. I will be back.","useful":1,"funny":1,"cool":1},
{"review_id":"Y_vlOS7oz46FByC6b8O2Yg","user_id":"qFJhWSCdeMV2hrRdxYnvoA","business_id":"p4qvXkb34X8hgidxEZ33Gw","stars":2,"date":"2014-07-02","text":"I was unfortunately very dissatisfied with my visit. After having been recommended by more than one person for their Thai food, the Pad Thai and Massaman dishes were bland and lacked many key ingredients. The Pad Thai was particularly sparse lacking leeks, raddish, and especially the bean sprouts....and it isn't Pad Thai without bean sprouts.\n\nIn short, isn't worth the wait or the hype.","useful":0,"funny":0,"cool":0},
{"review_id":"NCA0f9TWRPnYm_n0Pnh5EQ","user_id":"Xlt8GaT-Eqz8JYbprGt35w","business_id":"RrIo_ryNLDVdui6_Dmnmzw","stars":1,"date":"2014-04-02","text":"DO not use this company !   The \"owner\" is rude, obnoxious, self absorbed and if the lack of business is any reflection of the work they do (NO cars,  no repairs, not busy ever) - then that should tell you ** ALL ** you need to know.  Whenever you walk into a company and there is NOTHING going on - then you should be suspicious.  This guy needs a course in Customer Service - but it wont matter - doubt he will be open long enough.   DO NOT USE - don't subject yourself - PLENTY of other quality, caring, busy automotive repair places right nearby.   PASS THIS ONE OVER .....","useful":0,"funny":0,"cool":0},
{"review_id":"Hlz9V3Zm-ti9pdiv8TvtZg","user_id":"oZOBAtPYVUq724Wywoh5kg","business_id":"faPVqws-x-5k2CQKDNtHxw","stars":5,"date":"2016-02-13","text":"Best fried chicken I have ever had. We went for brunch and started with the fried green tomato BLT. It was so delicious and unique. Next I had the chicken and waffles and my husband had the plain fried chicken. We both agreed it was the best fried chicken ever. The cocktails were delicious and so were the mimosas. I wish we had saved room for desert! Service was excellent and I loved the ambience.","useful":0,"funny":0,"cool":0},
{"review_id":"zAasT5y0d1p28bNBXzIcFA","user_id":"oZOBAtPYVUq724Wywoh5kg","business_id":"BLp6atZ7ydioAIVkKlmAGg","stars":5,"date":"2016-02-13","text":"Best cocktails in Vegas. You can add a shot or double shot to any juice. I got the spicy mango with tequila based on recommendation from the bartender. It was life changing. Also tried the kiwi blast and monkey. Very strong drinks at a great price and amazing fresh flavors.","useful":0,"funny":0,"cool":0},
{"review_id":"WguHfuOz_vK0b9mPZmfEbg","user_id":"TVvTtXwPXsvrg2KJGoOUTg","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":4,"date":"2012-01-20","text":"We came here for brunch on a Monday.  Pretty tasty food!  Great selection of both brunch food, and regular dinner-type food.  The price was much better than I expected it to be for a Vegas buffet (around $24), and it included a free mimosa\/bloody mary\/champagne.  The decor is amazing, complete with great hanging glass installations in line with the rest of the Cosmopolitan hotel theme.  \n\nDefinitely try out the desserts (especially the great selection of gelato, and the chocolate covered strawberries!) as well as the macaroni & cheese.","useful":1,"funny":0,"cool":0},
{"review_id":"cf9RrqHY9eQ9M53OPyXLtg","user_id":"TVvTtXwPXsvrg2KJGoOUTg","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2012-01-20","text":"Came here for lunch after a long night of partying.  I'm a huge fan of French food, and had definitely been craving it ever since I arrived at PH and saw that the Paris was next door.  Mon Ami Gabi definitely satisfied my craving!  A friend and I split the steak classique (steak with butter), and the quiche Lorraine.  So good!!!  The steak was perfectly cooked medium rare, as requested.  The quiche Lorraine was delicious, but I was so full by the time I got around to eating it that I only had a few bites; what I did eat was perfectly balanced.  My friends seemed to enjoy their orders as well.  I only wish that the restaurant served steak tartare... I would've been on that like white on rice!\n\nSide note, the bread is served warm and crusty, the way it should be.  I wanted to eat the whole baguette myself, not to lie... but highly disappointing was the cold butter! \n\nDefinitely worth coming here for a meal that is nice, but not too nice (I'm looking at you, 16-course tasting menu at JG), when you're in Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"FRLE_GCPac5oPoZ37jHQrw","user_id":"TVvTtXwPXsvrg2KJGoOUTg","business_id":"pH0BLkL4cbxKzu471VZnuA","stars":2,"date":"2012-01-20","text":"I want to like this place SO MUCH.  The food that we got was delicious (the sea bass skewers are amazingly soft and flaky, and the black truffle sauce that comes with the fried green beans is TDF), BUT the service we got was horrible.  Our server was fine--she was upbeat and tried to work with our wants, but whomever it was that also talked to us was horrible.  \n\nTo be fair, we were a large group (about 14 or 15), and understandably it is hard to accommodate such a large group, let alone trying to get our food out at the same time.  Honestly, I could care less if my food came out at the same time as the people I had been sitting with.  Before we could even look at the menus to see what was available a la carte, the restaurant pushed us into this 'tasting menu' that would \"incorporate our tastes as well as some of their classic dishes\"--sounds fine, but in a group of 14 or 15 people who have VERY varied tastes, that is almost impossible to do.  To begin with, some of our group members didn't eat any raw fish, and others were basically only interested in raw fish.  We eventually agreed to this tasting menu just out of an unwillingness to continue \"fighting\".  They tried to appease by sending us some shooters and edamame, grilled shishito peppers, and fried green beans to start.  Great, and thanks, but still not the best service you could ask for at a restaurant like here. \n\nIf this rating were about the food only, I would give it 5 stars.  The food really is delicious, and the decor (while strange) goes well with the feel that the restaurant seems to be going for.  The pork in our meat sampler platter was overdone and dry, but two types of beefs that were perfectly cooked made up for it.  The appetizer of some sort of spicy tempura rock shrimp salad was moist with the perfect amount of chewiness and spring; it's spicy, but not in the give-me-milk-to-guzzle-now way.  The sushi that we were served, however, was pretty sub-standard.  I'm sure this was because it had to fall in line with our tasting menu price point (which somehow got haggled down); honestly, I did not come to SushiSamba just to get spicy tuna rolls.. I could get that anywhere. \n\nIn short, come here if you're in a small group.  The food really is worth it, many times over.  I'm sure it will be a far more amazing trip than the one I had in a large group.","useful":1,"funny":1,"cool":1},
{"review_id":"UWCpDwgwPzn8fLCJc-Aqcg","user_id":"hzREBVl2HgpUUCZiPY5w-A","business_id":"sCr3A1IpKuifofjoJo0v9Q","stars":1,"date":"2014-08-28","text":"So noisy we could not have a conversation.   Asked to be moved.   There was a table available but not for us.   No accommodation made.  We left.  Won't return.","useful":1,"funny":0,"cool":0},
{"review_id":"mv93vAkc7B-VOy12JxBCyQ","user_id":"CIWmICxK1NMixvIgb5nlAg","business_id":"n2vIw3p7jZ04N62JqsET6w","stars":4,"date":"2015-04-30","text":"Love their food..I went for their mac and bacon dish and it was yummy....the butter chicken that my husband had was so good too. Would be nice to have more chicken in it but other than that the food rocked. Waitress was great and she looked busy since it was packed house when we came in on Tuesday night since it was wing night.","useful":0,"funny":0,"cool":0},
{"review_id":"CZUQQoqZEFt2XrMgHfnjOw","user_id":"CIWmICxK1NMixvIgb5nlAg","business_id":"v1C8WQR6iB0WW0W48T5pqA","stars":3,"date":"2016-08-20","text":"I heard raves about onion rings being so good. I was a bit disappointed when I tried their onion rings. It tastes ok...not terrible but no seasoning to it. I like the A.&W.'s onion rings the best. Crispy and firm at most A&W's. Peter's were simple and bland. Maybe a bit like back in the 50's?  The burger was ok; it looked to be put together as an after thought and squished. The good thing is the variety milkshake flavours. That was what I was into; but for me; the milkshakes didn't have enough of that dairy\/ice cream flavour for me. It was good but not giving me a wow factor. It didn't taste like real ice cream shake to me. I won't rave about it but don't hate it there. It's not a place I would want to go as top thing to do when in the area. Food is decent though.","useful":0,"funny":0,"cool":0},
{"review_id":"Lze-XxG6wk112h_dnmPwzQ","user_id":"CIWmICxK1NMixvIgb5nlAg","business_id":"h2SA2bn6iBmxoe4W8iCYEg","stars":2,"date":"2015-04-30","text":"The food was good BUT the service was terrible. There was no spoon for my coffee; they ran out of spoons they said. The waitresses aren't too friendly either. They were busy with their cell; texting and I had to wait a while for my coffee to be refilled. I was pretty much ignored for most of the lunch. Won't go again due to poor services. Also my home fries were burnt\/dry. Other than that..the egg Benedict was good.","useful":0,"funny":0,"cool":0},
{"review_id":"Bpvqrm8fas_o5cM8Jp5N3A","user_id":"CIWmICxK1NMixvIgb5nlAg","business_id":"lDFSx3D5AKfza3GjpPV6BA","stars":3,"date":"2016-07-12","text":"We went there with our 9 and 11 year old. We didn't feel too welcome at all by the manager because we bought our 2 girls with us who behaved very well and it felt too \"upper class\" to even go there with kids even if they are older. Not a place to go with kids even though kids are allowed. \n\nThe lasagne was good but a bit burnt on top which I didn't like. The Alfredo pasta was flavourless. Not too good. Was disappointed that they had no pizza for a month when we went there. \n\nThe waitress was sweet. But the manager ignored us and went for the people who looked like they had more money to spend and talked to them about the variety of wines. \n\nThere was a sign when I came in that said something like no hats allowed or take off your hats. That was fine with me but a bit taken aback by that sign which kind of set the negative tone in a sense. \n\nDon't think I would go again because it felt like setting a foot in a stranger's house and felt awkward there. Food was good though but hard to enjoy myself.","useful":0,"funny":0,"cool":0},
{"review_id":"o_HLw5STQZ5WNLg4ZpfP1g","user_id":"CIWmICxK1NMixvIgb5nlAg","business_id":"wGoOWEue58i27zu2wYkiig","stars":4,"date":"2016-07-12","text":"My daughter and I are both picky about the sushi; she loves this place hands down so we only go here when the craving for sushi hits. The food is just amazing and delicious. My daughter often orders two plates of california rolls; her fave. Rice is good and food is just right. Not over or under cooked at all. I love their good prices; not even overpriced at all. :) The waitress was very sweet and nice. Hubs asked for extra pickled ginger and got that.","useful":0,"funny":0,"cool":0},
{"review_id":"AmDKzAWJJ8vsYJ36OhnvaA","user_id":"JIkVfsVYb7-26O3BxlyHAQ","business_id":"Wmrc1Yro_BLHGU3Usyqdhw","stars":5,"date":"2016-11-30","text":"We live out of town and really just needed some place to watch our dog while we had lunch since it was too hot to leave him in the car. We decided to get him groomed and had a great experience. The staff was friendly and did a great job. The price was cheap compared to other places. They called when our dog was ready to be picked up and we told them we would be another 30 minutes until we could get there. That wasn't a problem!","useful":0,"funny":0,"cool":0},
{"review_id":"STdRfSO1D_i9BKePNu8qVQ","user_id":"JIkVfsVYb7-26O3BxlyHAQ","business_id":"ebEP_MZngIWKH0Ixobcqhg","stars":4,"date":"2016-10-26","text":"This is a nice off-leash dog park. There are plenty of spots to sit while your pup plays. There's not a ton of shade which was fine for our visit in late October but I imagine it's miserable in the summer. The park is separated by weight. There was a third area not being used due to maintenance. My reviews is only 4\/5 stars because it's kind of a small park. It certainly does the job though!","useful":0,"funny":0,"cool":0},
{"review_id":"bRIMnNkLB3h3zz4D4_g4AA","user_id":"B8pfp9rzwqssLkAQzRuUiA","business_id":"LSMn-SgSeIV8FcEsYIxjvg","stars":1,"date":"2014-04-17","text":"Took our 2 dogs for grooming here. While the groomer was nice he did an awful job. He had burnt the side of one of my dogs necks. There was burn scabs\nFor weeks afterwards. I let the groomer know, he apologized and said ill use a different Gaurd next time. We gave him another chance and this time the burn marks were even worse! He had two huge scabs on both sides of his neck. My dog was shaking the entire way home. I am not one to write reviews but had to in hopes that it might safe another dog having to go through this. I can't imagine how I'm gonna take him to another groomer, he's been traumatized.","useful":1,"funny":0,"cool":0},
{"review_id":"T2ThVT-bvl1jTEQKlv47Dw","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"gQ-VFMpfCpTQZBOzQiYQ6g","stars":5,"date":"2013-02-25","text":"I have been successfully treated by Dr. Xiao for 2 very different conditions.\n\n1) I suffered a CTD \/ RSI hand\/wrist injury due to my profession.  Rehabilitation doctors are not trained to detect minor amounts of inflammation and use a pain scale of 1-10 to quantify a patient's condition, or use expensive and uncomfortable diagnostic tests.  For a minor inflammatory condition, hand therapy and anti-inflammatory medicines were the prescribed course of action.  Unfortunately, a minor onset of more inflammation from overuse is not detectable by the hand therapist either, who is also trained with the pain scale.  Dr. Xiao is an expert detecting minor amounts of inflammation and could identify both where and how I sustained it.  She used a combination of deep tissue diagnosis and healing massage, herbal remedies, and acupuncture to remove the inflammation.  \n\nNow, I am working with both Dr. Xiao and the hand therapist to build muscle and function.  I have regained a tremendous amount of strength and am well on the way towards a full recovery.\n\n2) I had a persistent skin irritation lasting over a year that my dermatologist could not identify and prescribed steriodal creams for.  Dr. Xiao recognized it right away as an energy imbalance in the liver channel.  She used a combination of herbal remedies and acupuncture and cleared it away permanently after 4 months of treatments.\n\nShe is easily one of the best diagnosticians and practitioners that I have ever met, and she truly loves her work.  I cannot say enough about how she has dramatically improved my life.","useful":3,"funny":0,"cool":1},
{"review_id":"dMBcrImAIPms06PxViZ-7A","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"dLEQ5BDAXWMjrC7XHwHbQQ","stars":5,"date":"2013-03-18","text":"I had a vacant rental house with pet odor that a competitor carpet cleaner washed twice to eliminate the odor throughout all of the carpets.  Desperate not to have to do new carpeting, I found Spotless Carpet Care on the internet and called Steve.  He came over right away and knew exactly how to search for the problem spots using a black light (the prior cleaning company was not trained with this technique).  He found nothing on the surface, as the carpet had been previously washed but gave me a great deal to wash it on his own, as he had high confidence it would work.\n\nWhen he came to clean, he was on time and very professional.  The cleaning was very thorough and brightened quite a bit, even after the previous cleanings.  I would definitely recommend him for pet owners or landlords that have to clean carpets after someone with pets leaves the property.","useful":0,"funny":0,"cool":0},
{"review_id":"8vz39lAw8sAee3WqWFlVIQ","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"lH0Ph4DiYSqj9UJBXAq8hQ","stars":5,"date":"2013-03-20","text":"I called Just-In Time on Monday to see if they could move a very large china buffet to Goodwill.  They were very professional and courteous and mentioned I could save some money with the Yelp Deal in place.\n\nRobert and Rick, the crew, were very professional, on-time, and very efficient.  I was so impressed I wouldn't hesitate to use them again!\n\nThanks guys!","useful":0,"funny":1,"cool":0},
{"review_id":"neNEWNClKRDUtRhGY7frRA","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"1hlwL5E035WQfB7Zb2mLUw","stars":5,"date":"2011-07-15","text":"We woke up this morning and found out that our garage would not open and we could not lift it due to a broken spring.  Wayne came out 2 hrs later and saved the day!  He was professional, courteous, and honest.  The repair will help our original garage door last another 10 years or so.\n\nThanks Wayne!","useful":3,"funny":0,"cool":0},
{"review_id":"U4-3icgEqGrD8t0FHBDq4g","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"JbHVdvF0E3n7e8jUrOO6uQ","stars":5,"date":"2013-03-25","text":"I recently had an interior paint job of bedrooms, bathrooms, trim, and touch up done through a competitor.  The price seemed to float higher and higher, even though I thought we had reached an agreement on the work to be done.  Needless to say, it left a bad taste in my mouth and some of the touch up looked terrible.  \n\nI called David and he was incredibly helpful and sympathetic to my situation.  I bought a couple of gallons of paint and he made the most of the situation on a limited budget.  The house now looks fabulous and I will not hesitate to use him again! \n\nThanks David!","useful":9,"funny":0,"cool":8},
{"review_id":"I_Q2KNU_yAb2SelbILTBWQ","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"J__5TVwnEtNNAWOndZtJig","stars":5,"date":"2012-02-17","text":"I had two cars washed this week.  He washed one at home and the other at work.  He was prompt for both appointments and did an excellent job on both.  It was a great value and I will happily use him again.","useful":0,"funny":1,"cool":0},
{"review_id":"BlnwfpnPAnI_dZPCnlOioQ","user_id":"vc-VfW7-Q7JmHzA6bTLHyA","business_id":"_ttAz3nQQOLY2UctfuNbmA","stars":5,"date":"2013-06-14","text":"Dr. Andy, Dr. Patty, Dr. Jeff, and the entire team has dramatically improved my spinal alignment on a permanent basis.  Yes, I said permanent!  It's not just them, its their combination of great talent, compassion, and a top notch methodology (chiropractic biophysics).  I used to get migraine headaches 1-2x per month...other talented chiropractors would be able to alleviate the symptoms after onset, but then it would come back again in a few weeks.  Since treating at Pivonka Chiropractic,  I have had 2 in a year, and the severity has been much less than before.  I used to have swallowing problems...this has also all but disappeared.  My shoulders could not relax.  Now they do.  I was so impressed, I sent my entire family.  \n\nFYI: This form of chiropractic is not for those looking for a quick-fix!  It requires serious commitment, but I promise that the gain in your quality of life will be well worth it!","useful":4,"funny":0,"cool":0},
{"review_id":"oMkc301DRq4Roey_iTGPow","user_id":"L4iqdi_AcVSRsoPHsflaJg","business_id":"AVv1l2mFjvcuWPss2EDedw","stars":4,"date":"2014-10-26","text":"So cute ceremony that Elvis sung & had the Bride & Groom dance for #raykiko Ramon & Makiko Owens","useful":2,"funny":0,"cool":1},
{"review_id":"Obb6cDphtELEWuixLif4vw","user_id":"qA3KOuO5_mYC6xphlkn7zQ","business_id":"3PsmvwxetLz1Tzb-6mNhgA","stars":5,"date":"2014-11-10","text":"The food is really good, try the beef enchiladas with hot sauce go set at the bar when the mariachies are playing drink a corona eat some chips and just enjoy yourself.","useful":0,"funny":0,"cool":0},
{"review_id":"0WRAc3Ot3h4oXQ3nMsMD5Q","user_id":"E-GAXLta6Dv0AeGb9M4zJA","business_id":"ujPuhQdg8-GCJQg6BoRJtA","stars":5,"date":"2014-09-15","text":"Never had better burgers before! My wife and I were looking for a place to have some dinner in Toronto's Fashion District. Going to Big Smoke Burger was the best decision we could ever make. I had the Big Smoke Burger which was simply awesome side by side with some very big and good tasting fried onion rings. My wife had the Chicken Burger with french fries. It was so delicious and the sauce was so tasty. We will definitely come back next time we are in Toronto.","useful":1,"funny":0,"cool":0},
{"review_id":"EnYrzgZUsDmwFFOImupedg","user_id":"0_c7MknzVim0RbEImdisSw","business_id":"BEB_jRY-Zh7neYfHks8w2w","stars":5,"date":"2017-05-03","text":"We are very happy to eat here. it is a great place for us to eat, and it is a traditional Chinese hot pot, perfect!!!","useful":7,"funny":4,"cool":5},
{"review_id":"GGDQQTA5pPEDBteCTIchNw","user_id":"oY6vb4d0bMNf-b1H2w29iQ","business_id":"ujKOI97lVORJJx8rOvOLkw","stars":2,"date":"2015-01-25","text":"Not impressed.  I took my Cavalier King Charles in today and gave them specific instructions about shaving his belly and legs and giving him a trim on top.  Not only did they not trim his belly but it looks like they just washed him, put a scarf on his neck, and called it a day.  We will be seeking a different groomer in the future.  It's slightly cheaper than other groomers, but who cares if your dog doesn't look right?  \n\nAlso, the shop seems a little haphazard in how it's run, dogs running around everywhere in a small space.","useful":0,"funny":0,"cool":0},
{"review_id":"-CTn_Wyc0K5bTDMm_MnE5A","user_id":"oY6vb4d0bMNf-b1H2w29iQ","business_id":"olmCDBoMF-EhN8U2livBSg","stars":5,"date":"2016-09-10","text":"Ordered my wife's birthday cake last minute and they worked with me to make it BEAUTIFUL!  Thank you, Freed's:).","useful":0,"funny":0,"cool":0},
{"review_id":"r25Ezdb_141mqnb3XZebCA","user_id":"oY6vb4d0bMNf-b1H2w29iQ","business_id":"NvKNe9DnQavC9GstglcBJQ","stars":1,"date":"2014-12-23","text":"My friends and I went into Grand Lux Cafe at the Venetian for a late dinner and drinks.  The food was OK, our server was reasonably pleasant, but the night manager Matt Timms, when questioned about the cost of an item on our bill, was so off the charts rude- my friends and I will never come back!  Mr. Timms even went so far as to threaten to call my girlfriend's employer to make her look bad when he learned we were locals.  I've never seen someone lose their cool like that, especially not a manager.  There are many better options for restaurants within this casino.  Beware!","useful":3,"funny":0,"cool":0},
{"review_id":"bXvB-C8Soghlk56K9KTZgQ","user_id":"oY6vb4d0bMNf-b1H2w29iQ","business_id":"dWFUKB_HPBIE87AFBHEb_w","stars":1,"date":"2014-02-23","text":"Spirit Airlines is the worst!  Hidden baggage fees, such as having to pay $50 for a carry-on.  This airline is poorly run and will nickel and dime you to death.","useful":4,"funny":2,"cool":1},
{"review_id":"L97NoNk2QgT11OunplhueQ","user_id":"oY6vb4d0bMNf-b1H2w29iQ","business_id":"Wxujfvh6t4xHkLHaqLgJoA","stars":1,"date":"2014-10-20","text":"Never again.  I've been to numerous chiropractors and I've never walked out in this kind of excruciating pain (I left in a neck brace!)  I communicated several times that it was hurting and he kept pushing.  There are better, more experienced chiropractors out there.  Don't make the same mistake I did.","useful":8,"funny":0,"cool":0},
{"review_id":"APe6QNq0xsX_hBjVCCPauA","user_id":"XSOIoLti43Us7v83n4zf8g","business_id":"4Rq2kF6HnqgsoR6819_lbA","stars":1,"date":"2012-10-09","text":"Front Desk was rude and not helpful whatsoever. The rooms were small and when we got to our room there was pee in the toilet still. Would choose a different hotel if I was you.","useful":1,"funny":1,"cool":0},
{"review_id":"5WR0u-DvTnQEGYGv_Dcj0g","user_id":"pzYSGytKQpth_Ovxja7sdw","business_id":"IF0swG6XxLegyHs0edj3xQ","stars":5,"date":"2017-03-11","text":"L'arrivée d'Adonis dans le Sud-Ouest a carrément changé la donne. Le magasin est lumineux, les prix excellents comparé à tout ce qu'il y a autour. L'offre de parking gratuit nous rend aussi la vie facile. On aime.","useful":1,"funny":0,"cool":1},
{"review_id":"ZhqJeerf6BNKls_nLUlckQ","user_id":"8hUlAc8B4a4-UD1kWhBiOw","business_id":"7tD2x6ElqZssMSCPhZu5uA","stars":1,"date":"2017-09-04","text":"The worst stay I have ever had. I understand it is a cheap motel. With that being said; we ark for 1 room with one bed simple two night. We arrived and found they gave away that room. So they gave us an \"upgrade\"we walk into a dirty room where the beds weren't made and towels left on the floor of the bathroom. So of corse we walk back to the front desk ask for a clean room. They gave us one just down the hall. As we lay on our bed we hear burn outs in the parking lot and now the building smells like burnt rubber. Mixed with the smoke and musty smell. I complained to the front desk and I was told I think the \"regulars\" are working on a car. At midnight mind you.  I look out side my window and they are tack welding and grinding out side. I will never stay here in my life and warn others.","useful":1,"funny":0,"cool":0},
{"review_id":"p3BRsQiB1McaSD1kxT0NbQ","user_id":"ZaN_gdRNcixoocfnldhiVg","business_id":"qQvHYQ1uocuEnFcUdhxV_g","stars":5,"date":"2015-06-27","text":"I took my kids here, because I was excited about their menu, and I was craving fish tacos, the crew at pub chip are awesome and the food was off the charts, my tacos were super fresh and my kids loved their food.  I plan to make many future visits.","useful":0,"funny":0,"cool":0},
{"review_id":"mq1mRd3MYNbCWj7_Knixlw","user_id":"gLErvGbsFX9GjVl2VZcTgg","business_id":"l8LYK3kqDBrqgVyvd2MoHQ","stars":5,"date":"2017-10-05","text":"Great selection of flavors. Everything I tried was tasty. The presentation was beautiful. Service was very quick considering the amount of work they put into some of the selections.","useful":0,"funny":0,"cool":0},
{"review_id":"OeBQLhv0R2n8_VD7q0C89A","user_id":"iPW6264yAb83X23BdOxxLw","business_id":"nao-DQVFd90DA37rq6HO2g","stars":5,"date":"2017-05-03","text":"Paul is simply the best. He could of installed a new water heater but instead, he figured out that the old one was not broken- and told me! I have rentals and sell real estate, Paul gets the plumbing referral!","useful":0,"funny":0,"cool":0},
{"review_id":"KCyFAZ2c3Zu7V606D5JH_A","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"tL9003ETHUAcHF-eaDQd1Q","stars":5,"date":"2016-06-05","text":"Went in on a Sunday around 2pm and got care for within minutes. I had no appointment and there were quite a few people there. I got a mani\/pedi. Overall, I am happy with my results and will definitely be returning. I love the prices :)","useful":1,"funny":0,"cool":0},
{"review_id":"PoacGlMa7qltjKlGiOBG5w","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"26tPTT3jtCktaqowDEYSUA","stars":5,"date":"2016-01-25","text":"I love fat straw! I used to work at Forever 21 which is right across from fat straw and I used to stop by and grab something to drink before work and on my break. I recommend Cali girl and BFF if you like sweet things. For coffee, I recommend the vanillachino.","useful":1,"funny":0,"cool":0},
{"review_id":"GxQhEd8Ot5AAW9szREwXew","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"dp3Gs7uWo9GkNviwdR2_3w","stars":5,"date":"2016-05-07","text":"I've been searching for a new hairstylist, since I recently moved from Hawaii to Arizona. I couldn't find any good salons\/stylist in Arizona, but thankfully I found Becca here in Las Vegas. She did an amazing job on my hair. I'm so in love with the outcome. I will be back for sure in july!","useful":1,"funny":0,"cool":1},
{"review_id":"5BBCAIxXTZ2B2ZBe6cH7Sg","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"qiR7S83_7Du_XQyj_U0zWw","stars":5,"date":"2016-01-25","text":"Eating breakfast at IHOP is a perfect way to start your day. They are having an All you can eat pancake special right now. I also love there red velvet and BM chocolate chip pancakes :)","useful":0,"funny":0,"cool":0},
{"review_id":"A4kB6UC3H34PmtS-qegFyg","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"nChi_8Gygb6NUMa_kg_tlQ","stars":2,"date":"2016-06-24","text":"My friend and I went here for lunch today. We got seated right away.. Took about 10 minutes for us to be greeted by our waiter. I ordered the curry beef stew and a honey dew slush. The curry had a good taste, but it had literally 2 pieces of meat and the rest was potatoes. We were done eating and we were waiting for the check... About 15-20 minutes.","useful":0,"funny":0,"cool":0},
{"review_id":"nyLiv84Cm9Tk1BAENHLXHw","user_id":"60Z_adXWeE2rC2HDewnUVg","business_id":"QZJpXx1TbOXqzLx6u6xmaQ","stars":5,"date":"2016-01-25","text":"I lived in Hawaii for 18 years and I am familiar with all of the local bbq foods. I enjoyed eating at this place because it reminds me so much of \"home\". I just wished that they made the kal-bi in bigger portions. Other than that, everything else is good.","useful":1,"funny":0,"cool":1},
{"review_id":"hMKoHll-OFEyKzYRTf_RFQ","user_id":"s0X0vCfR0X3oA3iMbYggDw","business_id":"DVhSFWIJKk4Vo8fjy_JfcQ","stars":2,"date":"2015-07-15","text":"I gotta give the place 2 stars because the staff is extremely nice. If that weren't the case I'd give this place 1 star because of their lack of knowledge. \n\nI have a 2008 6.4L diesel and it calls for 15W-40 in hot AZ weather. Newer ford diesels call for 10W-30. I should've checked to see they put in the right oil but when my wrench light came on and read a p012f DTC I knew immediately they put too light of oil in.","useful":0,"funny":0,"cool":0},
{"review_id":"S_ibpvF8OfI4N4Fs2VIazg","user_id":"ZzXCuibVEA7J1Dp5x9XA1Q","business_id":"k7yBx9rbBZZCcyJ3NYBAcw","stars":1,"date":"2016-05-25","text":"I got an oil change here a few months ago. When the car was ready they informed me that my AC was out, which I already knew. They told me my compressor was shot and quoted me $1000 to replace it. I left bummed out. I finally got around to getting my AC fixed this week. I took the car to my usual shop, Granite Reef Auto to check it out. They told me there was no belt around the compressor. Well, $100 later I have AC! How did Advanced Auto come to the conclusion that my compressor was bad? I can never trust them after that. I will never go there again. Granite Reef Auto is great! They saved me $900. Advanced Auto was ready to take my $1000 and replace my already working compresdor. Shame on them. Really bad business!","useful":1,"funny":0,"cool":0},
{"review_id":"Os1d5tNHL3XD8P8w_KbNgw","user_id":"ZzXCuibVEA7J1Dp5x9XA1Q","business_id":"7Gn0NmZIagfY7JlfwuEJnw","stars":1,"date":"2016-04-05","text":"I got the Burrito Phorrito. It was not good. My kids got the Stir Fry. They said it was ok, but we all ordered the slow roasted brisket for our meat choice and it was almost completely all fat. Couldn't even finish my burrito due to all the nasty fatty brisket.","useful":1,"funny":0,"cool":0},
{"review_id":"-o0vc9A8qzlBoDfXJPBcUA","user_id":"ZzXCuibVEA7J1Dp5x9XA1Q","business_id":"vjaHGc25CcyNPZTbjDa7Ww","stars":1,"date":"2017-05-22","text":"Wow, walked in on a slow Sunday night. Sat at the bar for 8 minutes, there was nobody sitting near me, was totally ignored by the bartender. Got up and left. They would have easily made $50 from me. Worst service ever! I'll never go back.","useful":0,"funny":0,"cool":0},
{"review_id":"J2P-lgzE3CT91HFxAZvtJg","user_id":"CeAagmfUfgmUouP6FV4ycQ","business_id":"6WDJklLMMCAYzrCNNKqCjA","stars":1,"date":"2015-08-23","text":"The place is kind of filthy. I tried it 4 or 5 times. The last time the barber didn't even finish the haircut and yanked the cover so that the hairs that she cut fell all over my clothes. The old guy was okay the first couple of times I went there, but there's no guarantee who you get and in any case you come out feeling like you need a shower urgently.","useful":1,"funny":0,"cool":0},
{"review_id":"KujyTphKbEzYb_q0jddMMQ","user_id":"r_xmrF17FH07DeKVp_topQ","business_id":"2XkVexeY_8zyc9nriSElQg","stars":1,"date":"2016-04-02","text":"Let me start off by saying this WAS my favorite Mexican spot in las Vegas. I drive from Southern Highlands just for the Pastor tacos! Usually I go late night but today I went in around 5 ish. Was greeted by the kitchen employees and when they asked what I wanted I nicely replied with \"I need a few minutes\". This man I never seen working there before said in Spanish a rude remark back to his coworkers about me saying I'm not ready yet. I was so offend, and he totally ruined my appetite so I left without ordering anything. Horrible experience for a loyal customer.","useful":0,"funny":0,"cool":0},
{"review_id":"Qgk466sMUDQK0r14qUYbaQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"VLDFjeqpUgWhnVuB_8GuEg","stars":5,"date":"2013-06-02","text":"Really really cool place!  I got the shrimp over noodles dish, and my friend got beef over cattle.  Everything is so fresh and the atmosphere is awesome!  I'll definitely be back very soon!","useful":0,"funny":0,"cool":0},
{"review_id":"z7TuJzlHD-UxM9lEtlxHhg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"kAiD3y_JOdOhuVXFkxzzUg","stars":4,"date":"2013-06-02","text":"This place is pretty cool.  I had a great time playing dodgeball with my son.  The foam pit is fun, but kind of gross when I think about it.  Sweaty kids just dive into it and I know those foam blocks are just soaking it all in.  Lol.  Overall tho, pretty fun time.  Trampoline dodgeball is awesome!","useful":0,"funny":1,"cool":0},
{"review_id":"QpHT4yaeHUk50vlRX9BjPw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"QwilUHinvhPL8gXtoHBufA","stars":5,"date":"2012-12-14","text":"Great haircut!  Great experience.  You just have to try it.  They spend more time massaging, oiling and relaxing you're scalp, face, neck an shoulders than the actual haircut itself... And it's great!","useful":1,"funny":1,"cool":1},
{"review_id":"9PwkwSkb3VqEXzUabMiYjw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"NJ0RzuWd5xDqfJejYQZ65g","stars":4,"date":"2013-01-31","text":"This place was so cool looking!  Real dark with a moder\/futuristic type feel with glowing blue lamps and crazy shaped decorations on the wall.  The Deluxe Burger was great and you get french fries in this little shopping car.  We got the 1\/2 sweet potato 1\/2 regular fries... great!  They even serve it with Fancy Sauce (Step Brothers reference.. but true story)!","useful":0,"funny":0,"cool":0},
{"review_id":"A81anZNTSjxVaFa-TiBvBQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"MHq5Ly9ZMbCgnP3PoQJbVQ","stars":4,"date":"2013-06-02","text":"awesome looking theatre!  I love the way it's laid out.  We went to watch a \"Lead and Succeed\" business seminar and it was cool.  Food is really overpriced though.","useful":0,"funny":0,"cool":0},
{"review_id":"cx6Ml7Dh6Qc6nXortujhLQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"_aofcEsCpuKVqK39u03x-A","stars":4,"date":"2013-06-02","text":"Awesome place... Just upset they took my salmon salad off the menu.  No more fish at all and that's what I like to eat when I'm out.  Their cookies and acai berry drink are awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"XuSie_006DeLXVNCLPM8-g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"IdNR_TYoB7eHz681M0bKag","stars":4,"date":"2013-03-10","text":"Lady was nice and did a good job on my sons hair.  My son is 6 and can be a pain in the butt with clippers.  She was done in 10 minutes too!  Only reason it's not a 5 star is because its just a haircut.  No cleanup or gel or anything after.  No water or cool amenities.  Worth the $7.99 I paid after coupon.","useful":0,"funny":0,"cool":0},
{"review_id":"XIE3NO3nGceAXfw1yOBMpw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"vEE91PRNYG3Boq3B69Bycw","stars":5,"date":"2014-08-24","text":"This place was awesome! I found out I had plantar fasciitis, which stinks since I have a 16 mile run to train for in November. Linda told me to come in and she'll take care of me. I was properly measured, asked a bunch of great questions and totally catered to. It was great. I got an awesome pair of new Nike running shoes that not only look really cool, but fit my feet perfectly. I also got an awesome set of running socks, inserts and a roller. They explained to me that I have tight calves, which can affect my feet the way it did. So, I got the roller to help break up the knots. I feel great and loved the experience. I'm not sure I'll ever just go to a Sports Authority again for sneakers. This was great!","useful":1,"funny":0,"cool":0},
{"review_id":"wfMmujCs8Y7H8XzuXJ8odA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"caXiL25g86LPvdwbn99VgA","stars":5,"date":"2012-07-02","text":"These guys are awesome!  I referred them over to my cousin who was having a hard time renting his home.  Brian V. got with him and totally took care of him.  He got him more than the asking price for the monthly rent and everything was handled with the best of care.  Totally recommend these guys and will continue to do so!","useful":15,"funny":0,"cool":0},
{"review_id":"xFxUy2N-NyQwpYRkCMMJsw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"qM8zeK2ZvWGe0y8tWB40Jg","stars":5,"date":"2011-04-26","text":"Beautiful jewelery, great staff, great price.  They were so personal and took their time with me and got me very taken care of.  Totally recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"AoxpOFSlVq3mIbfonPhY3A","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"gTaD9vJp04nFJBWyX7eK7Q","stars":5,"date":"2013-06-02","text":"Amazing catering company!  Their lasagna and 3 layer cookies are just like my mom made when I was younger!  Awesome!","useful":5,"funny":2,"cool":0},
{"review_id":"TQWtHKbIye6iw7x6FHd1hg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"YmFkrylzWy4vmNFkWk-I0g","stars":5,"date":"2013-06-02","text":"Pretty cool place.  Because I checked in and got 15% off for doing so, I am switching my 4 star to a 5 star.  The food was great and I love places that give yelpers a deal!","useful":1,"funny":0,"cool":0},
{"review_id":"VlUZG5zA-VrIN76wLyh0_g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"2iLeiQ4OCJVwfodR9egMag","stars":4,"date":"2013-03-19","text":"Get the green tacos!  Atmosphere is great!  I don't think ill ever bowl at an amc again!  Spoiled!","useful":1,"funny":0,"cool":1},
{"review_id":"BkNMW98ocPXDnzm3SkpJtw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"EV1jAj7NFNmNIqOnwZ4Acw","stars":4,"date":"2013-03-19","text":"This place was so much fun!  The band was absolutely amazing.  The ONLY reason they didn't get a 5th star, was because I asked the hostess a few days beforehand if there was dancing, and she said \"yes, the band is awesome and they move the tables out so people can dance.\"  The band WAS definitely amazing, but everyone kind of just stood there and my wife wanted to dance on her bday.  Other than that.... awesome!","useful":4,"funny":1,"cool":1},
{"review_id":"pwQZaBj36_DgN1dWIdZKwA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"jpBOoa3qNwsbVkdS2cdYSg","stars":4,"date":"2013-07-28","text":"Not a bad place.  Not a great place.  The price awards this a 4 star because it IS a really great value.  Churros and quesadillas were pretty awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"ECzqFLPc19OSZ4Sf2YqRdA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"GYTmQ4LK7vssENFDBuUt3w","stars":5,"date":"2016-10-12","text":"AccountingProse are amazing!  It's so good to meet a bookkeeper that actually understands 1) technology and 2) that the goal should always be to make things easier for the client... not for them.  My experience has been amazing so far and I'm so glad to have started with them!","useful":3,"funny":1,"cool":1},
{"review_id":"_sirto2dSokkNdPcxRcaXA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"eMvikXS_1HlPyVctesxSjA","stars":5,"date":"2017-06-07","text":"Been coming here for years!  Russ is the man and his barbers are solid.  Haven't seen fades and service like this since NYC.  Great people.  Never leaving.","useful":0,"funny":0,"cool":0},
{"review_id":"-_JK9H545H8SZuOJZpdlmg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"RsQdAT-eFwWpzy0t2SiReQ","stars":3,"date":"2012-12-26","text":"Really nice people.  The food is ok.  I thought it would be better.  Everyone's taste in Italian food is different though","useful":0,"funny":0,"cool":1},
{"review_id":"Vhvs1s3DHtIykDUWiXCwWw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"7t8mhKYTGuyiU2X65w0fLA","stars":4,"date":"2013-06-02","text":"The people here are really nice.  We like coming here.  I wish they had a better \"health\" section.  It's pretty small.","useful":0,"funny":0,"cool":0},
{"review_id":"veV2SXGTWHTAjP6pFVjS9A","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"qCS7kgg2o5QxCvIhTUgzrQ","stars":4,"date":"2013-05-30","text":"Really cool boxing gym.  Would have gotten 5 star if they had longer hours and better weekend hours.  Other than that... It's really clean, staff is cool and the classes and instructors are awesome!  If u don't wok out late at night... You'll find this place a 5 star","useful":2,"funny":1,"cool":0},
{"review_id":"O_ghHY7m-_y_R2QTdNFLaQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"d3Wz6ENnjMHtRUXfg8idaw","stars":1,"date":"2012-03-09","text":"Wow... talk about the absolute WORST company I've ever tried to do business with.  It does NOT get much worse than these guys.  First... a little background, I have never gone out of my way to complain about a company.  If you see my other reviews, you'll notice I go out of my way to rave about companies on here.  There's only 1 other negative review in my portfolio, and even that company is 4 stars compared to crappy old Appliance Certified.  \n\nI used these guys about a year ago, and the guy that came over was cool and the price was reasonable.  So I actually referred them to about 3 people since and kept their magnet on my fridge. \n\nHowever, last week my sink started leaking and we were unable to use it anymore until fixed.  I called this company right away (Thursday) to book appt for the next day (Friday).  No call... no show.  I called back later in the day simply to leave a voicemail.  Saturday I called back and they said they'd have someone out Monday (after apologizing).  Monday came... no call... no show.  Typically, I know you should give up on a poor company like this.  But, I decided to give them one more chance.  Called Tuesday, and set up for today because I had a busy week and couldn't do it until that Friday.  Next Friday came, they called me at 9am to confirm.  Whew... then... didn't show.  1pm I called them and a woman said she'd get on the phone with dispatcher and call me back right away with an ETA.  3 hours later... no call... no show.  I called now twice only to leave another message. \n\nBottom line:  This company shouldn't even be called a company.  The suck.  My 5 year old son is more responsible and considerate. If I had nothing else to do today, I would create 3 more Yelp accounts just so I can complain 3 more times.  One for every time they messed up.","useful":7,"funny":0,"cool":0},
{"review_id":"Dzs8zkLdlBTzkDK1UHxBXA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"UPCGUE7IW-sXriyEvyinVQ","stars":4,"date":"2013-06-02","text":"Nice place. A lot of fruit options, which I like.  People have been there forever, too!","useful":0,"funny":0,"cool":1},
{"review_id":"s3AkOkFhe-nzEkR5N1V0JA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"YmIYjZGnuZzqVPkFBF4Omw","stars":4,"date":"2013-03-19","text":"nice place.  They had a great guitar player that we listened to while having a drink for my wife's birthday.","useful":1,"funny":0,"cool":0},
{"review_id":"ULkRg1RFnmkTPIsiiRIyuA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"xIrFmRqK4TpwvaxlU926TQ","stars":4,"date":"2013-06-24","text":"pretty awesome place.  A lot to do and it's good for adults and kids.  My son, wife and I went to hang out with friends and had a blast.  Bowled the best game of my life!  130!! haha","useful":1,"funny":0,"cool":1},
{"review_id":"EHu9EYXSx7Aen0XSwv2wbg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"l1EzeGkWmLzAf9F1bAlFRQ","stars":5,"date":"2012-12-26","text":"Love this pizza!  Very close to the style back home in jersey!  People are cool, too!","useful":1,"funny":3,"cool":1},
{"review_id":"1v5ecsrr-38Vzup5aR40kQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"m6rffQy85HUq82DjLq-YJg","stars":4,"date":"2012-12-26","text":"Went to dinner here w my wife for her bday.  Nice decor.  Food was pretty good.  Calamari was great.  Waitress was a little slow in service.  Overall... I'd go again.","useful":2,"funny":0,"cool":1},
{"review_id":"T0SV4Hbd7YqXJdvpjaDf6w","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"Y5CTA3S9TVkpr3Yvwaki-A","stars":5,"date":"2011-04-27","text":"Great place!  Tickets include popcorn, pillow and blanket with waiters.  Wow!","useful":1,"funny":0,"cool":0},
{"review_id":"M7E1UyE_7m9zM3qlNp1j1Q","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"X3W-ddwbnZ2uAyYOxcYu3A","stars":5,"date":"2013-06-02","text":"wow!  such a beautiful place!  from the golf course to the bars and outside patio, it's great.  We went there for Infusioncon and it was awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"HQngKUrerDSj_l0Suq-7sw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"whAwdYVty-jSNRhrYT2zHA","stars":5,"date":"2013-06-02","text":"This place has been my favorite restaurant for 10 years.  It's amazing!  I always get the Mediterranean Calamari and oysters on half shell... But truthfully... Everything is awesome!  5 star!  Highly recommend if u enjoy seafood!","useful":1,"funny":0,"cool":1},
{"review_id":"6_A58CCY8SHB7r-Wu7-A5g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"BTcY04QFiS1uh-RpkR7rAg","stars":5,"date":"2013-06-02","text":"Came here with my 2 year old daughter for our first date last night.  Halfway through the movie she got tired ad wanted to go home and when the front desk saw us leave, she asked if everything was ok.  We old her what happened and she gave us 2 free passes to come back again!  Awesome!  Clean place, great seating!","useful":2,"funny":0,"cool":1},
{"review_id":"cNQ5AlAhZmwFFlurZtgOww","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"krCiaZqjU2CeOfwoJWctDg","stars":4,"date":"2013-06-02","text":"I've come here quite a few times.  Pretty cool place.","useful":0,"funny":0,"cool":0},
{"review_id":"ti-WA4WGhGBuz0jAVdjx6A","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"NKJIOH0qrXZd2_DVVQP5Lg","stars":4,"date":"2013-06-02","text":"pretty cool place.  kind of annoyed that we were told they'd lower the hoop for my 6 year old son, then when we got there they said they couldn't do it. Overall, still a cool place though.","useful":2,"funny":0,"cool":0},
{"review_id":"9FMtFHT01G1xaI2I4CEtJA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"eE4MUd3m6j6yISWjEYjyPQ","stars":5,"date":"2013-03-19","text":"Great time here!  So much to see!  The monkeys and giraffe where the best!","useful":1,"funny":0,"cool":0},
{"review_id":"J5OvPaIM4EeFV2CjnzR37g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"nXtgMIF5aZND4LD8um-8cw","stars":5,"date":"2011-04-26","text":"I met the owners through facebook and got to hear what a lot of their fans\/friends\/clients say about them.  Everyone said amazing things, and I can believe it with how great my relationship with the owners has gone in the few short months I've known them.  We are definitely using them for our next move and are referring them to anybody we find!  Great recommendation!","useful":1,"funny":0,"cool":0},
{"review_id":"-cu4PuvS-S6LLwSMTlL7Vw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"JWbING3NbK_Y2AEVrLGaNw","stars":4,"date":"2013-06-02","text":"Really nice people and clean, slick looking bank.  Making the switch from Chase wasn't as easy as we promised, but they did try to make up for it.  I recommend joining.","useful":1,"funny":0,"cool":0},
{"review_id":"225bpAlci77iu7UDKJRSGA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"mmeKyvhdKHsW-gh0JvLbGA","stars":5,"date":"2013-06-02","text":"Been going here for 3 years.  Great gym.  Other than a pool they have everything u need!  Because of the no pool, I was going to give them a 4 star.  However, because they give yelpers an awesome deal by awarding them with a free smoothie and tan if they check in... It will be a 5 star!","useful":1,"funny":1,"cool":1},
{"review_id":"9xtSmbEK-mG_Nl8gF0vn1g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"RHEfk2TTYsTMRsXCAk30yA","stars":5,"date":"2012-12-26","text":"Great cuts!  Vadim is really good.  Got me to come back!","useful":1,"funny":1,"cool":1},
{"review_id":"0QsCkd0MWH1xurDMqWjevQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"Jw3iaQalS9-1aeXkKh_plA","stars":3,"date":"2013-06-02","text":"This place is ok.  Cool atmosphere and the dishes taste pretty good.  Just a bit expensive for the portion size compared to other favorite places.","useful":2,"funny":0,"cool":0},
{"review_id":"qUKj7zIA1gJq3KW_pIkv6g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"zzgSiOnuUjnBnmfR-ZG4ww","stars":5,"date":"2011-04-27","text":"Dr J. is very passionate about her work and builds solid relationships with all her clients.  She's great at what she does and is very very reasonably priced.  Definitely recommend.","useful":0,"funny":0,"cool":1},
{"review_id":"7jYLdFeS2d8dx0ZOaiId-g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"n1S7XnZfCCDIWlMZ8yUvEw","stars":3,"date":"2013-06-02","text":"This place is ok. With the had some fish items.  But ten again... I don't think they're known for their \"freshness\".  Most of the food just sits there for a while. It does taste pretty good tho.","useful":0,"funny":0,"cool":0},
{"review_id":"xQtIDd-lijxV4rhyE-ekjg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"YcyWmqda0JJ5BNTqtBsb5g","stars":5,"date":"2012-08-18","text":"Mike came out and fixed our AC again!  A whole new problem occurred and he spent the time to not only fix the problem, but show up later in the day to make sure everything was still running as expected.  He adjusted a few more things and the AC is running great.  Thanks Cooler Tymes!","useful":4,"funny":2,"cool":3},
{"review_id":"ALW4S0eMi6PStOvxkOmYwQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"hPfszfTC6xu9Ysd3sIHm8Q","stars":5,"date":"2012-12-26","text":"This is our place!  They just started all you can eat sushi, too!  Order the volcano roll!","useful":2,"funny":0,"cool":0},
{"review_id":"fyVtCd2QlFxtVdtEFnu8Xw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"7XTGtaKjANmZqp2QtN_iPA","stars":4,"date":"2013-06-02","text":"Pretty cool place.  A little hole in the wall bar.  Had a fun time with friends but we had to move tables because they were about to start trivia night.  Man those guys take that seriously.  It was packed with trivia people!!!","useful":0,"funny":0,"cool":1},
{"review_id":"dfa66f-q8ddn97B4Cw96kg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"HqbwwkRJmm5RpCPRvOltGw","stars":3,"date":"2013-06-02","text":"it was ok.  Got my gas and the people were a little rude.  But... it IS a gas station.","useful":0,"funny":0,"cool":0},
{"review_id":"QI4FDz5aIF6a5u25sVYYPg","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"ynYEgNimJOyb8dvyr9x0sA","stars":5,"date":"2012-12-26","text":"Just had lunch here with my wife:  French onion soup - amazing!  Parisian Sandwich - 8 out of 10, crepe dessert with caramelized apples - 9 out of 10, atmosphere - very very cool!  Great date place!","useful":1,"funny":0,"cool":0},
{"review_id":"sZsyHJQvluH2dck_0lqarw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"WWOCqk1Vh605xP-lcb9lhA","stars":4,"date":"2013-01-31","text":"Seafood lunch red curry plate.  Awesome. Tiny little place but clean and comfortable atmosphere.  As soon as I walked in I smelled good food!  They have free wifi and waitress was really nice!","useful":2,"funny":0,"cool":0},
{"review_id":"vMEfCyisYZl8RWRDtfeP5g","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"tbMAjldMYhvDUS2gG5Fdxw","stars":4,"date":"2012-12-26","text":"Pretty good!  Coconut shrimp and sesame chicken is awesome.  Crab puffs are great too.","useful":0,"funny":2,"cool":0},
{"review_id":"3IwaUhMnCMo-q5uHeNFSCA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"LgMCHBadv9Z8Ge94zNpDFA","stars":5,"date":"2013-10-01","text":"Amazing food!  I live Mexican food, but Puerto Rican food.... Wow!  Try the pernil and empanadas!  Malta Goya and flan was great too!  Definitely coming back with friends!","useful":2,"funny":0,"cool":2},
{"review_id":"7J3swG3oMdGYuUCIgFsfRw","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"yNPh5SO-7wr8HPpVCDPbXQ","stars":5,"date":"2013-02-20","text":"Great place and cool staff!  Cool atmosphere too.  Always good to know another great downtown spot!  Sit at the food bar!  The cooks are so awesome to talk to and you always have people taking care of you!  Crab legs are amazing too!!!","useful":0,"funny":0,"cool":0},
{"review_id":"3FUYVgTPwB0GJwEPnGidog","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"VJzOQmsuoeF4Y53nEreJmA","stars":5,"date":"2013-03-13","text":"These guys did a video for our wedding entrance a it was perfect!  Exactly what we wanted and they worked with us on price and schedule!  Totally recommend!  They're the best!","useful":1,"funny":1,"cool":1},
{"review_id":"puPpmo26KHnA7kR3zqjfjQ","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"iUYAqWKoBdHqYNMDzOXb9w","stars":5,"date":"2012-12-26","text":"Me and my son's favorite place!  Get the Ecuadorean tamales and seco de pollo!  Apple soda is great too!\n\nPS:  Expect slower service, because it is TRULY mom and pop.  If you go in with this attitude, you'll really enjoy the experience.  If you want quick, timely servers that ask you how food is every 30 seconds, you may want to try Olive Garden or something.","useful":2,"funny":1,"cool":0},
{"review_id":"Pi4vTYGeS7HkfCRU0aJ8jA","user_id":"q3AiAe-AcpDrNsdZf8nCvQ","business_id":"kv42obrz682yqpNy0yxrUA","stars":5,"date":"2012-12-26","text":"Great little atmosphere to work or meet with people.  I'm not a big coffee guy, so can't tell u if that's good or not.  But, I enjoyed it and the place just has a great feel to it!","useful":0,"funny":0,"cool":0},
{"review_id":"shZ5L7rzG6AaHOdtMJ9UuA","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"1lmu_At_AFkgSWpNo0NZGA","stars":5,"date":"2011-09-21","text":"I searched high and low for a good salon near me (even driving out to Glendale & Peoria) and found exactly what I was looking for at Chace Salon thorugh Christina.  Christina's the best, use her and you'll have no regrets!  You can simply explain what you want to her and she'll figure out how do cut and style so that it complements your features!\n\nAnd the price is beyone reasonable for a great hair cut!","useful":7,"funny":0,"cool":0},
{"review_id":"9UULO-2CbfTuM3GrRxwSSg","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"0sX-jsw2gcFVqdzGlqU_kA","stars":5,"date":"2012-03-18","text":"I had my big olde english sheepdog groomed here and they did a fine job and the price was on par with everyone else. Actually I think the price is about $10 more, but I'll pay the extra money because of the extra service this place provides.\n\nI really appreciate that they have a pet taxi, bc of this service my dog gets a ride home for free (but we did tip the driver). Since I have a little child it's hard for me to bring my dog and pick him up on the days I would have time to pick him up, so the taxi is worth it for me. Bc of this service I can now drop off my dog before I go to work and my husband (on days he's caring for my daughter) can be home to let my dog inside. This is easier for me than having to bring my 100+ dog inside while holding my baby.\n\nShauna's is right next to Mountainside Fitness, it's right in Surprise so if you live in Surprise this place will be easy to get to. \n\nI also thought the service was great too. I'll definitely be taking my dog back here the next time he needs to get groomed.","useful":3,"funny":1,"cool":0},
{"review_id":"1-RDYuXP-Fch8Vdmy4g-WA","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"I8e1_CZ1c76UaL7LQfsh4Q","stars":5,"date":"2012-06-13","text":"Best sandwiches I've had in a long time! And they'll deliver--if you fall in their small delivery zone-- 1 sandwich to you. This comes in handy for me while I'm at work and hungry! \n\nI love the bread & their mayo. YUM! I usually order the beach club. No complaints from me!","useful":1,"funny":0,"cool":0},
{"review_id":"0Fb_M1kI7pR11lxPgQPlfA","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"iuFE29Wk113afMJZkcYiXA","stars":4,"date":"2012-03-16","text":"I joined this gym after leaving Fitness 1. This gym isn't perfect but is as close to perfect as I could ask for. \n\nI like the long hours the gym provides for daycare. And daycare will change dirty diapers!!! And for the most part I really do like the gym daycare employees (except I had an experience where the daycare manager was extremely rude, but I forgave that one instance because I figured she was having a bad day).\n\nI also enjoy the towel service. & The equipment is great. The classes seem great though I have yet to attend a class. \n\nBut I wish the gym would add free wifi for members to use while working out (so that I can watch netflix while working out), add some more channels to the equipment's tvs (I wish they would add e, bravo, mtv) and add a laundry shoot for towels inside the locker rooms. I even put in a request for the laundry shoot but Mountainside obviously just ignored my request. \n\nI also wish this location & all other locations would have a water service that they provide in their Scottsdale location. It seems like the west valley is constantly getting the short end of the stick and this is another example of that isn't it? & might be wrong but I think the Scottsdale location also has better tv channels than the Surprise gym does.\n\nBut despite those gripes I'm still a fan. This is the best gym in Surprise.","useful":4,"funny":1,"cool":0},
{"review_id":"JT8uWAavADrlWzXQ6mQUQA","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"I4EmpNOW7zCcx7fUnQ9ixg","stars":4,"date":"2012-01-21","text":"I'd give this place 3 1\/2 stars if I could. Because to me, this place isn't blow your socks off delicious! Instead it's just good enough. \n\nLook, when I'm craving pho I'm glad I have a place close by to order from, however it's just not as good as I'm used to back home. I think my problem is it doesn't taste as authentic as I'm used to. This place to me seems like it's trying to be asian fusion (like Pei Wei or PF Changs) when I just want pho nothing fancy just pho.\n\nThough I did think the spring rolls were awesome!!!\n\nBut nonetheless it does fulfil my cravings without me having to drive 45 minutes, so I'm happy about that!","useful":0,"funny":0,"cool":0},
{"review_id":"RMB8LFNBKlWML_A_jS-yMg","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"Swezz8vG_9woCkV30kdgKA","stars":4,"date":"2012-03-07","text":"I love it here!\n\nBut you really need to order the all you can eat because the portions on the plate of meat are too little for the amount you're paying.  The all you can eat is around $25 \/ person & everyone at your table has to eat all you can eat or no one can order it. If you order the all you can eat then you don't have to pay extra for rice (which you really shouldn't have to do if you put in an order for meat--but that's just my opinion).\n\nSeoul Grill recently revised their menu, so there are more options for different meats. They have added different flavors, which are so yummy! Try to spicy pork belly (sam gyop sal) that was recently added it's one of my favorites.\n\nAnd remember when eating meat first order not marinated meats then order marinated because otherwise the marinated meats taste will disrupt the taste of the not marinated meat.   \n\nI must say it's really nice not having to drive to Koreatown for a decent korean bbq place!\n\nOh and all the people who work here are so nice & helpful! I wish they would make a Seoul Grill in Surprise! We need a korean restaurant in Surprise!","useful":2,"funny":0,"cool":0},
{"review_id":"Enh1GOGSRzLTDgJLqemvig","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"S6atPSOFzioRsePJKQacVw","stars":5,"date":"2012-03-16","text":"I'm so glad I found this salon!!! After getting my hair burned last year & then finding out that Hair City in Phoenix closed I wasn't sure where to go to get my hair magic straightened. I even debated driving out to LA to get my hair done in Koreatown.\n\nBut luckily I received a referral to Cleo's from a Korean restaurant and so I went here and am glad I did!\n\nI got my hair magic straightened (aka japanese straightened) and the stylist did a great job. Although my hair didn't come out perfectly, I blame myself because I recently had my hair highlighted at an american salon and apparently the american salon used bleach in my hair. And bleach plus magic will frizz hair. I learned this from the stylist at Cleo.\n\nI have to give extra credit to the stylist at Cleo, because he kept asking me if I had used bleach in my hair for highlights. And I kept telling him no, but he kept asking so I finally called the salon where I had my hair highlighted where they told me that they do use bleach when highlighting! (unsure why they didn't use regular color since I was complaining about how my old highlights had turned yellow, and now my new highlights are turning yellow too! I think bleach highlights is too hard on my hair). I'm really glad the Cleo stylist was so adamant on finding out if bleach was used on my hair, otherwise I would have had a hair disaster this year (like I did last year!-- and no I did not have highlights on my hair last year, last year my hair was in perfect condition, no treatments had been done on my hair.)\n\nI also saw that Cleo has machines for digital perms too. I might have to try this next year after I grow my hair out (since my hair is currently shorter than usual because of the disaster from last year)\n\nGo here get your hair done by an expert. He told me he was trained in both Korea & Japan. So he speaks Korean, Japanese, & English. \n\nI believe magic straight costs about $150, at least that's what I paid. And digital perm costs around $130","useful":13,"funny":1,"cool":0},
{"review_id":"Bija_xwliHwqj5CSVYTcmg","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"NlCzRJCVhjZC9rkay1ykfw","stars":5,"date":"2012-01-21","text":"I'm always complaining about the lack of customer service in Arizona, but if you go to Pleasure Paradise Salon you will NOT have any customer service complaints!  Believe you me!\n\nI also had the best massage by Kimber. I'm always having neck \/ upper back pain because of stress & taking care of a young baby but Kimber gave my upper back so much attention that I finally found relief in my back. \n\nAnd everyone from was so nice! One stop shop for hair, body, & nail care!","useful":6,"funny":0,"cool":2},
{"review_id":"S9lAaQEDzM38K5uy6pbrjw","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"nTfMW-YzJbOY99vZea6B7w","stars":1,"date":"2011-04-23","text":"Helen's was terrible.  I got magic straight at Helens I think I paid $150 ish and she did not know what she was doing.  & kept blaming me, and kind of made me feel stupid my korean was not on par with hers.  \n\nThen when I called to tell her it didn't come out she had me come in again.  Attempted it again but given she doesn't know what she's doing obviously it didn't come out.  \n\nShe also laughed when I asked her to cut my white husband's hair.  Told me to go to a white salon.  I thought she was really rude.  Hair city is waaaaay better.  623) 847-0308\n\nHair city has on multiple occasions successfully straightened my hair (hair city did give me a funky hair cut once)","useful":12,"funny":5,"cool":1},
{"review_id":"z8-lzyD_JoAdC-j9w6LmlQ","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"IjPGaNpqcFl9byTSpg0AmQ","stars":5,"date":"2012-02-04","text":"Best insurance agency! Specialiazed in auto, home, life & business insurance","useful":0,"funny":0,"cool":0},
{"review_id":"W83ylz0dXtL_5YksYtkBag","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"CTnL5sDAfcSlaInNGxq-9w","stars":5,"date":"2012-03-07","text":"Family owned , Mike and Kelly (owners) are both very nice and both know their stuff. It's nice going to a repair shop that I trust isn't taking advantage of me! And it's nice walking in and speaking to the owners. Great customer service! \n\nEvery time I go to one of those other repair shops they come up with a list of stuff to fix -- and when I check in with my father in law or friends they tell me those repairs are not necessary for my vehicles!\n\nGo here and you can trust what Mike & Kelly say!","useful":14,"funny":0,"cool":0},
{"review_id":"0Gt4cXuT7A0KZ_7nt-nU0g","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"egXPYRWuMsw7p-feDrBjrw","stars":4,"date":"2011-11-26","text":"I've been a member here for 4 or 5 years.  I only pay $9 \/ month and the gym had everything I need... that is until I had a baby.  Look you know what you're getting at this gym.  It's kind of a no frills but cheap gym that's clean enough. So it worked for me during these past years.\n\nthe daycare hours that the gym are ok but the daycare workers don't change a baby's dirty diapers and instead page the parent which is disruptive to a workout.  Also the daycare hours (for me) don't start early enough.  So I'm sad to say I'm going to be switching to another gym probably at the new year.  \n\nBut I did enjoy working out at Fitness during the past 4\/5 years.  And all the gym workers are so nice and quick to help out with any billing issues (of which I have had too many!).  So I am sad to be switching.  But need to so that I can work out around my & my baby's schedules.","useful":4,"funny":2,"cool":1},
{"review_id":"bKOvYg4vMVSjxYIwHUPQbQ","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"Rud4J5Hsjn_jjU9IaQ0Dpw","stars":4,"date":"2012-05-24","text":"Went here to celebrate my anniversary. Food was good. But not lick the bowl clean good. \n\nFor the amount of money we spent I think we could have done better. But the meal was fine. Service was great. \n\nDessert is to die for. Pound cake & chooclate fondue. Enough said! \n\nI agree with other posters who suggest just going for dessert. The food isn't worth the price.","useful":3,"funny":0,"cool":1},
{"review_id":"CuDBtUETFntmgIUZLlPA4w","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"ZYUCffa5zsT1HPnKxeKQrQ","stars":1,"date":"2011-09-21","text":"This used to be my favorite nail salon in Surprise.  But I think they changed ownership (in fact I saw that they changed ownership-- at least that's what they're advertising in the Surprise weekly).  \n\nAnyway, I received a white tip pedi from a new tech (female).  She did not paint even  lines.  And when I looked at my toes the lines were a mess and did not match one another.  Some were lower, some were shorter.  It's hard to explain but  my toes did not resemble one another.  I asked if she could fix the lines.  And she had to redo the lines and still couldn't get it right.\n\nLook, getting a pedicure is a service and I want it to look nice.  And the fact I'm paying extra for the white tip... I feel like they should get it right.\n\nI've been getting pedicures for years and have never complained.  \n\nAnyway, it was obvious I wasn't happy, the manager(?) Kevin came and looked at my pedi and told me it looked fine to him.  They know me at this salon.  I think even if they thought I was imagining the concerns (which I was not) I think they should have had another tech redraw the lines or comp something to make me feel valued.  Instead they made me feel worthless as a customer by telling me there was nothing wrong.\n\nSo I got upset, passed on the manicure, paid for the pedicure and left.\n\nI've been going to this nail salon for years, I think 2 years.  They know me at this salon.  And to question me when I'm upset about something just doesn't make me happy.  \n\nI'm not going back to this salon.","useful":12,"funny":0,"cool":0},
{"review_id":"p9qeAnI-Di9WFqlu_LREuA","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"ujbnYohZttC_-u-BGIFzHw","stars":5,"date":"2012-07-15","text":"I've had 3 treatments so far from Sabrina and love it. Her prices are great & she's super nice & attentive to boot! Great customer service! She'll rearrange her schedule as much as she can to help accommodate my sometimes hectic schedule. \n\nSabrina's customer service is so much better than the other laser place I've been to.","useful":3,"funny":0,"cool":0},
{"review_id":"xBTwFReoyxfLcYwoS_FnRg","user_id":"WgbbxTRIy7MwDKn7nL5WKQ","business_id":"3RtqDazn1d5PoFXZ4v94wg","stars":3,"date":"2012-03-07","text":"the girls who work here and provide the services such as waxes, or massages do a great job!\n\nBut the customer service from the girls at the front desk is awful. SO terrible I don't want to go here again. Like those girls are so snotty and rude. I'm unsure why they think that's how they should be doing their job.","useful":11,"funny":0,"cool":0},
{"review_id":"nTf7s720IRC6bweUyFXZuA","user_id":"qSnGTERljtADoOatQiekrg","business_id":"rmP7AzV3SAeRWUzbNuqQ5A","stars":5,"date":"2015-05-20","text":"Excellent service and experience all around. Sometimes you can tell the quality of a restaurant by how they handle the simplist things.  Their prime rib sandwich with au jus dip was perfect and tender. Highly recommend","useful":0,"funny":0,"cool":0},
{"review_id":"wrv3mDXn34amHQNZ_NyDIw","user_id":"dejaCG65dfs1VuyXZbt-kg","business_id":"0FUtlsQrJI7LhqDPxLumEw","stars":5,"date":"2012-05-30","text":"We have been going to Phoenix for sometime now, but only recently learned of Joes Farm Grill. We tried it out, and let me tell you, it was awesome. Their portions were just right, and even though I was full when we left, I didn't feel gross like I do at other restaurants. I had the BBQ chicken pizza, and I loved it. Thin, flatbread crust made for a light pizza, very tasty pizza. My wife had the chicken Caesar salad. She gets that salad so often that she knows her Caesars, and she said this was her favorite dressing. And the chicken of course was amazing as well.","useful":0,"funny":0,"cool":0},
{"review_id":"1pzcYOQv6DSw_ExRGPqRPA","user_id":"KUFhR_7RgHuIs_HLEhpAug","business_id":"Tu0lTy5-vSTgo4glJFDMBw","stars":5,"date":"2015-09-22","text":"I've been to see Dr. Tom Nguyen for the past few years.  He explains things clearly, he's friendly and is willing to take the time to answer questions.  He does the cleaning himself, which means that you get more time with your dentist.  The cleanings have always been free of any significant pain (as little discomfort as a trip to the dentist can be, anyway!).  He has never suggested any costly\/unnecessary procedures (which I'd recently heard can happen), and I'm glad that he noticed some gum recession and suggested that I see a periodontist to prevent problems in the future.  Appointments have always been easy to get.  All in all, a great dentist!","useful":1,"funny":0,"cool":0},
{"review_id":"1YMOM49lC_MGXYa2HXCX2A","user_id":"KUFhR_7RgHuIs_HLEhpAug","business_id":"Lpbo9wYj4pu58vJ7tlh-4w","stars":5,"date":"2016-05-18","text":"Hirut is great.  Delicious food, friendly staff, a down-to-earth feel.  I couldn't ask for more.  It's my favourite Ethiopian place in town... I think partly because it doesn't feel like it is trying hard to be great; it just is.  I haven't been for any live events, but I love the idea that they do this.","useful":1,"funny":0,"cool":0},
{"review_id":"5mnfbnAWS1YlanNl1l7DqQ","user_id":"juE5LohVTruYea2SHV2HYA","business_id":"3uC7Lbc3RgUDTWQlBu4PqQ","stars":4,"date":"2014-01-20","text":"I am giving 4 stars for the coffee, otherwise it would only be three. My croissant tasted dry and as if it was made a few days ago. However, I could tell it was yummy. I find it very difficult to find a good cup of coffee out of my house and neighborhood, since we are spoiled in the Bay Area. Sure enough, they actually use a Bay Area roaster (Equator) and it was great and quite the relief!","useful":0,"funny":0,"cool":0},
{"review_id":"R9fs85b354hXFU3Q-phHfw","user_id":"HeK9vYCsGCcNddefnpepyg","business_id":"A-UPVDNls_vYHwj1zWJBZA","stars":5,"date":"2015-08-08","text":"I rarely leave reviews. That being said I have to let the world know that Ciarra not only gave me the best facial I have ever had. She also managed to make me relax enough to enjoy it! I have a hard time relaxing. Her amazing personality put me right at ease. You can tell right off the get go she knows what she is doing and she is a beautiful person!","useful":0,"funny":0,"cool":0},
{"review_id":"hGEpM4ndT2NnUyrTp7TpUg","user_id":"HeK9vYCsGCcNddefnpepyg","business_id":"t5nyOtnEv455rShOS_g3RA","stars":2,"date":"2015-08-16","text":"We ordered the 2 fish combo and fish burrito. I found the best idem to be their cocktail sauce. Over priced. Small portions.","useful":2,"funny":0,"cool":0},
{"review_id":"FCri17bAg8ZgeKui4qbyOw","user_id":"AgCuz6jHTMWEe4qsdhIC7g","business_id":"YyY4DFr-OFtpN2ThrLHTAQ","stars":4,"date":"2016-12-08","text":"We went there on our anniversary this year on December 6 th .I was concerned after reading the reviews from different sights .wow! We're we happy we ignored them . excellent service and the food was perfect Miriam( I think was our servers name ) and she was fantastic .I did feel the prices were high or should I say  higher than I want to pay .but the lady has put up with me for 48 yrs.so I think she deserved it .the only reason I didn't give it 5 stars is for the prices .","useful":0,"funny":0,"cool":0},
{"review_id":"aAZx8qzkle7T8lhvADAKdA","user_id":"nDdcMqgQkRZuvjRzXhUJ5g","business_id":"e-hztV3mlfn5z8VmRFBNlw","stars":5,"date":"2017-01-28","text":"What a great spot and atmosphere! Oh and their beer is some of the best AZ stuff around! Can't wait to day drink there.","useful":1,"funny":0,"cool":0},
{"review_id":"3nRIwp83jG_Hg4RVwW4yow","user_id":"nDdcMqgQkRZuvjRzXhUJ5g","business_id":"mnwRtuVQEsIUomBchu0gwg","stars":5,"date":"2015-03-08","text":"I am in love with this place. Today was my first time and we need one in Tucson immediately! \n\nThe parking lot was packed and just as I was about to get irritated I noticed there is complimentary valet service. Que  fancy! \n\nThe inside is super casual and clean and the staff was awesome! We didn't get to sit outside in the crazy cool and dog friendly patio. I saw a dog sitting on the a table outside! \n\nI ordered from the $10 brunch menu. Food plus 10oz beer or mimosa. I had the breakfast wrap, the wife had the breakfast flat bread. I recommend both. My girls had chicken tenders which were actual chicken with a tasty fried covering. They loved their food too. \n\nIf you have kids, a dog, and hankering for good food you owe it to yourself to come here.","useful":0,"funny":0,"cool":1},
{"review_id":"S95ZsFVPVVCbKgDz1zSIVA","user_id":"nDdcMqgQkRZuvjRzXhUJ5g","business_id":"hIgGkG1JnHX4xmVuOgegDw","stars":4,"date":"2015-08-29","text":"This place has 2 sandwiches cheese steak and cheese chicken! There are some small eats for kiddos but you owe it to yourself to stop here after a long IKEA hike. The bread is what seals the deal for me. \nI had the chicken with cheese whiz and buffalo sauce. #nailedit! \n\nThe staff was also crazy nice! No five stars only because I thought they served other types of sandwiches too.","useful":0,"funny":0,"cool":0},
{"review_id":"e18hIQjHUnz5WMVLOzdqrA","user_id":"nDdcMqgQkRZuvjRzXhUJ5g","business_id":"Vay9xHwcvu7VRZOddBgn-A","stars":5,"date":"2015-03-22","text":"A must stop on your way back from Vegas! \n\nI had the huevos rancheros with their signature green chili and pork. So good! The portion to price ratio was a nice return to normal coming from the land of a $10 beer on the strip 30 minutes away. The eggs were cooked just right and the pork green chili was smothered over the fried tortillas and beans. If you like green chili and solid breakfast food you have to take the very quick detour into the historic downtown area. \n\nI'm sure there is a wait almost every weekend but that will give you some time to do some antiquing. \n\nI'll definitely be going back!","useful":0,"funny":0,"cool":0},
{"review_id":"mfr2EkkhefzEUi_h-QVeIw","user_id":"KCBYSNE6t_Nk7zOa8RQVPA","business_id":"Y5CTA3S9TVkpr3Yvwaki-A","stars":4,"date":"2013-07-21","text":"This theatre is the ultimate splurge!  From the comfy recliners complete with blanket and pillow (in the premium seating) to the fantastic wait staff you couldn't ask for a more luxurious way to watch a movie.  Being able to book online and have reserved seats is very convenient.  Yeah, it's expensive (total of $250 for premium seating and dinner for 5-no alcohol involved) but is worth it for a nice evening out with friends once in awhile!","useful":0,"funny":0,"cool":0},
{"review_id":"9Tbqg3Nv7EyLxUv-ABfjwA","user_id":"KCBYSNE6t_Nk7zOa8RQVPA","business_id":"1yYPKKy7m2ssL8ydD3s1Hw","stars":5,"date":"2013-04-13","text":"Bought a used beetle at a dealer out of state and had a small problem with it on the way home.  Called San Tan VW service department the next day and was pleasantly surprised how friendly the people were on the phone.  I took the vehicle there the same day and was greeted by Jeff Aguilar in service who looked at the car and called me within the hour with the diagnosis.  The next day, the car was ready, fixed right and freshly washed. They even worked with the dealer in California that I bought the car from for payment.  I will be bringing the car back for regular maintenance without hesitation.  Thanks and keep up the good work!","useful":1,"funny":1,"cool":0},
{"review_id":"3-a39qIXT4hzhcdBsIo9Gw","user_id":"KCBYSNE6t_Nk7zOa8RQVPA","business_id":"JcMx_PIy0ROIlJWens4TAQ","stars":2,"date":"2014-12-30","text":"Went tonight for a quick dinner which turned out to be over an hour.  Nice decor, very clean but the very slow service (40min wait for our entrees) was way too long.  Never saw the waitress again after we placed the order until it was time for the check.  When the food arrived, it was only lukewarm and despite my attempt to flag down a waiter to refill our drinks, we were basically ignored.  Can't see this place lasting any longer than the other places that have been it this location, will not return.","useful":0,"funny":0,"cool":0},
{"review_id":"W03Dt6ZVOmbJvjOiaUvbIg","user_id":"KCBYSNE6t_Nk7zOa8RQVPA","business_id":"oknlO7HeJDWIQAfXiwnyyA","stars":5,"date":"2013-07-26","text":"Called Adam to tint my VW beetle.  He called back immediately with a quote and even beat the current Groupon price, plus he comes to you which made the deal even sweeter.  The car came out fantastic and he cleaned up all the overspray and left the car cleaner than it was.  Highly recommended! Thanks again Adam.","useful":0,"funny":0,"cool":0},
{"review_id":"wgr_hOfIWlXR-glOC-qKYQ","user_id":"Cxv3SNudPrCavvHJfIbwhQ","business_id":"07F9bkUm3cs83CzGvTi0TA","stars":5,"date":"2015-03-15","text":"Kudos to Charlotte Motor Speedway!! They took a situation that was less than idea at the All Star Race and turned it into a customer service win. Here is what happened. I used Ticketmaster to buy 6 tickets to the All Star Race. I browsed a few sections then wound up buying tickets in Chrysler section K. When we arrived at our section we were informed that it was a no alcohol section. I didn't remember seeing anything on the website (i went back and looked and there was at the checkout page and because of the way I searched I missed the one on the main page) or on my tickets. I was told to go exchange my tickets the gate. The employees at gate 3 said they did not have access to the Ticketmaster system so I would have to go to gate 4. At this point I'm not pleased but I head to gate 4. I show the employee my tickets on my phone and he hands in over to someone else. After about 20 or 30 minutes I'm informed by someone who I assume is a supervisor that the usher is wrong and that our tickets are not in an alcohol free zone and there is no need to exchange them and that the map displayed in the window of the ticket booth showing this as an alcohol free zone was wrong and out of date. At this point we have missed about a 1\/4 of qualifying. We head back to our seats and inform the usher that we were told that it was ok to drink here. He said absolutely not and that the ticket person was wrong. At this point I'm furious. So we walk down into the next section and head toward the bottom to find some open seats and hope we are not sitting in someone else's seats (luckily we weren't as most of them around us filled up). Upon calling the ticket office today and explaining what happened the agent said I did miss the no alcohol writing at the checkout page but offered me 6 tickets to next years race to make up for the inconvenience!!! Way to go CMS even though we regularly attend races here you now have a customer for life!","useful":1,"funny":0,"cool":1},
{"review_id":"b-kks4f8tVGvWsN8oIw3OA","user_id":"Cxv3SNudPrCavvHJfIbwhQ","business_id":"i8ijGG8LXmFOWTz-Haej7w","stars":4,"date":"2014-04-11","text":"I have eaten here quite a few times and the food is good. The 2 stars is because they no longer have limes!(trying to get a response) I ordered a margarita (ultimate which was very good) and when I asked for a lime the bartender said they had stopped ordering them because they were too expensive! Now granted this didn't make or break my meal but that was one of the strangest things I have heard. It wasn't like it was $2 margarita night ($9 to be exact) Hopefully someone in management will see this and respond. If you like a lime with your margarita or your Mexican beer you may want to pass until they they make a better business decision","useful":2,"funny":0,"cool":0},
{"review_id":"UqVQ_SeN6WQ9zuz0gz4FrQ","user_id":"Cxv3SNudPrCavvHJfIbwhQ","business_id":"sVqV9lzvx98kWU39Fn4c6w","stars":5,"date":"2014-09-20","text":"We are regulars but tonight we tried Korean short ribs which were amazing!  If you haven't tried this place the sushi and everything else is so good!","useful":0,"funny":0,"cool":0},
{"review_id":"S3kIydoT13PVjhq_XBeorA","user_id":"IqZ4tKOTEwvE8RBXKpyn6w","business_id":"mUdalYTuAtnZm2K9zoH27Q","stars":5,"date":"2016-04-28","text":"Had the Lobster with pasta a la carte - $45ish. \n\nIt was the best pasta lobster dish I have ever had - period. I am Italian and have been eating homemade pasta for years.  This rivals my great-grandmothers cooking.","useful":2,"funny":0,"cool":1},
{"review_id":"ed_oS456RRcz95dGOCp_VA","user_id":"IqZ4tKOTEwvE8RBXKpyn6w","business_id":"Q-5sqRN6p4B9dgUQKA4hTw","stars":1,"date":"2011-10-13","text":"My midway nissan review. This place is not honest.  My experience with them is that they will not honor their commitment to you.  Don't shop here. They are liars!","useful":2,"funny":0,"cool":0},
{"review_id":"Wf1KudZRaSi0wWmn2H6PGg","user_id":"IqZ4tKOTEwvE8RBXKpyn6w","business_id":"WEtbc5oewinsWdhrXDcojQ","stars":5,"date":"2016-12-14","text":"First Choice provided Jesus and Gustavo. They were very professional and careful. Thanks Guys -- you were awesome!","useful":0,"funny":0,"cool":0},
{"review_id":"oj03nFMkiq-9H-8Lx2ucXA","user_id":"IqZ4tKOTEwvE8RBXKpyn6w","business_id":"9yaFehP2nI9XBQg4t1Ztag","stars":1,"date":"2016-06-22","text":"Terrible customer service.  Was looking to buy an Evoque.  The salesman was totally arrogant  and the Sales Manager wouldn't budge on the quoted price even though I could get the same car in Scottsdale Az for 2K less.  I just wanted an extra 500 off - nothing crazy.  I was basically told that they know they are the only game in town - only Land Rover dealer for hundreds of miles and I was just going to have to take it or leave it.  After getting totally pissed and deciding that I'll just buy the car and get screwed on a bad deal they tell me that it is getting late (Saturday 4PM) and that even if I buy the car - right now - they can't delivery it to me today because they don't have enough time.  I'll have to wait till next week to get the car I am standing right in front of.  What!!!  What kind of low budget garbage is that?  \n\nI've never tried so hard to give someone 54K.  I'm done with these guys.  Taking my business and money somewhere else. What a joke.","useful":5,"funny":0,"cool":0},
{"review_id":"afmJHLZPnkVW36OTha8b4w","user_id":"InjJePwBmAygDVOxuDJ-OQ","business_id":"IQhBsMtHfZy72-1ivmEgTA","stars":5,"date":"2017-03-24","text":"Food was good.  Prices were less than Jen's across the street and the meat portions were bigger.  We got 2 salad rolls and 2 orders of B6, beef, pork, chicken, and spingroll, with veggies.  Paid $35 after tip and left full!\n\nWill be coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"HN-RRq6rzW5wt8qxbCFiBA","user_id":"InjJePwBmAygDVOxuDJ-OQ","business_id":"aSQW_zFuT54yyLGQWtKo1g","stars":2,"date":"2017-03-08","text":"Food came too quick, meatballs were still cold inside, jambalaya wasnt quite hot.  They forgot to ring in the appetizer  Service was ok, nothing more.  It was pasta tuesday, moderatly busy.  I like the deal on tuesday so we keep coming here hoping for improvement, so far it hasnt happened.","useful":0,"funny":0,"cool":0},
{"review_id":"0lVak0_3AFf6E7V-oUWPzA","user_id":"VgaYZ7004pTwEDSDWR6u4Q","business_id":"_Ic-AS5OHAVWSz3VL-DQ2w","stars":5,"date":"2016-11-26","text":"Perfect job! We hired kaleidoscope to paint our entire house - baseboards, trim, doors, walls, ceilings. It looks awesome and perfect! And they finished early. We will definitely hire them again.","useful":1,"funny":0,"cool":0},
{"review_id":"kUqPsZmWwLIMSstGHhWssA","user_id":"VgaYZ7004pTwEDSDWR6u4Q","business_id":"-LRlx2j9_LB3evsRRcC9MA","stars":5,"date":"2017-10-07","text":"The vet took the time to explain what was possibly going on with my dog. Staff was friendly. Pricing was good. I will be going back for my vet needs in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"v-U55-IhVWuh28SHtSm_dQ","user_id":"8l8PZFsNyhi24BCRQ0xbSA","business_id":"DyCv2ubxeygyOUWJ4lnewg","stars":4,"date":"2017-07-29","text":"First time here and the ice cream was excellent and very cold due to that it's made by liquid nitrogen. I would give it 5 stars only if they had more seating. #MakeItSweet","useful":0,"funny":0,"cool":0},
{"review_id":"vxHq3O5iJqIkqNCnjc5Heg","user_id":"8l8PZFsNyhi24BCRQ0xbSA","business_id":"ZrS5rhJ4OvXQG_38wPEWlA","stars":4,"date":"2017-07-22","text":"First time here. Trying out a new Boba place and it's great! My first drink is Vietnamese coffee Boba milk tea...super good!","useful":0,"funny":0,"cool":0},
{"review_id":"xX28f2wGVJEzxlNPE8bMww","user_id":"cuphQhfXFbGr5d9MEzgXEA","business_id":"Xrd1ZBG6ru-s7r5xT0G68g","stars":1,"date":"2011-10-01","text":"I went to see Dr. Steven Folkerth for a routine physical. The receptionist was unfriendly. The doctor gave me a prescription for blood tests and Vit D test.\n\nI went to do the tests the same day. After waiting for about 2 weeks and I did not hear from Dr. Steven Folkerth about the result of my tests. I called his office and the receptionist said she has the result in. I went in to pick up a copy of the tests and the receptionist was still unfriendly. I saw that my triglycerides was above normal range and that the Vit D test was missing from the report. I asked the receptionist to locate my Vit D report and she said she is going to give me a call next day. I waited and she never call. I called her and she said she is going to get back to me. It has been 10 days since I talked to her and she never called me back. I am missing a vital part of the test because my Vit D level was low from a previous test. I understand Vit D is very important for my daily health. I got a run around. The doctor or the receptionist never contact me about my high triglycerides and missing test.\n\nI am very disappointed from the people in this office.","useful":1,"funny":0,"cool":0},
{"review_id":"tUhbIopodnnYyAYc6s-dcQ","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"iCjZlOs3qL1_HhAQBW9smg","stars":5,"date":"2017-01-15","text":"This by far THE best sushi in the valley. No joke, everything is to die for! The sushi chefs are amazing. I like to sit at the bar here even though I usually opt for a table elsewhere. Their menu of specialty rolls is a bit intimidating I admit but, just let them know what you like and they'll make excellent recommendations. I must say, the sauces are beyond anything I've ever tasted. If it were socially acceptable, I would pick up the plate and lick it clean. I'm not exaggerating, they're heavenly perfection and unlike no other.\nPlease be aware there are no prices on the menu. Apparently it changes based on market fish prices and it can be a bit pricey. If I lived closer I'd be there all the time, seriously. No matter where you live, it's absolutely worth it!","useful":0,"funny":0,"cool":0},
{"review_id":"t8VPX0gzKCt_bQ0Big4GlA","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"yqYtY3-Po4OVPafA9Z-Xyw","stars":5,"date":"2015-01-18","text":"Amazing! They have lunch specials everyday, not just M-F. The Sunshine Roll is pure heaven, in fact, I can't stop thinking about it. The sushi is super fresh and beautifully presented. Cute place, great sushi, awesome service, I'm totally hooked!","useful":1,"funny":0,"cool":0},
{"review_id":"XG9OjitWIshMB8kgkwW8ZQ","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"mJFdBXviC-1YRtY51XnS6A","stars":5,"date":"2016-05-01","text":"This place is awesome! I love Mexican food and I'm so glad I found this place. The blackened chicken quesadilla is sooo good, they give you tons of sour cream and delicious guacamole to enjoy it with. The chips\/salsa\/guacamole side is a must order. They're portions are fantastic, their food is consistently delicious, and they have my favorite frothy pina colada drink. I really couldn't ask for more, I love you Habaneros ;)","useful":0,"funny":0,"cool":0},
{"review_id":"KY3Rw5dCn5Vu51-SBQMWhg","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"AMN3Sgns9tB2x-b3eWk0qQ","stars":5,"date":"2016-04-17","text":"I love this place! Pho is one of my favorite dishes and I tried many other Vietnamese resturants before finding this gem. Now, I don't go anywhere else because Noodles Ranch is the best. Excellent food, fresh quality ingredients, great service. I feel great after eating here, not at all sluggish. The spring rolls are amazing, we usually get a few orders. The jasmine iced tea is fantastic. The owners are sweet and passionate about their business, they even have a cookbook out and available for purchase there.","useful":0,"funny":0,"cool":0},
{"review_id":"TzAq1p9zDsWvoIfWCzd1LA","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"cy43dkUWxZHpmGNj228BsQ","stars":5,"date":"2016-05-29","text":"Pat is truly an artist! I love what she does to my hair, not to mention the way I feel after she works her magic. Her cuts are perfection, her highlights stunningly gorgeous. Whatever it is you want she can give it to you. Pat is experienced, talented, and knows how to make you look good. I even referred a guy friend to her who was frustrated after receiving mediocre cuts all around town. Needless to say, his hair looks great and with minimal effort which he loves. Also, this is my favorite Ulta, everyone is friendly and helpful.","useful":5,"funny":0,"cool":0},
{"review_id":"ab0DXlwtBA-nGETOHG5v9w","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"JFhfVTt_8xNjtwqSD-raIw","stars":5,"date":"2016-06-11","text":"I love 5 & Diner! The cherry cokes, the mac 'n' cheese, Mrs. Cleaver's pot roast (no longer on the menu but you can still order it), the diner grilled chicken sandwich, and the most delicious root beer floats & shakes! Being a classic movie fan, of course I love the atmosphere and photos of movie stars that adorn the walls. Plus, some nights they have live rockabilly music and people bring their cool, classic cars. How awesome is that? There's no where else like this in Scottsdale. Oh yes and the service is excellent too!","useful":1,"funny":0,"cool":1},
{"review_id":"H1NACCrp6aPFNvkihQOJ_A","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"K-vBVV_RZX-BeyqOBWjsDg","stars":1,"date":"2015-06-05","text":"Worst food and service ever. My boyfriend took one bite of their so called steak sandwich and said dog food. My boyfriend is nicer than I am. Seriously, I doubt my cat would've eaten it. What really got me however was the fact that when we politely informed the staff we were questioned 3 times about why it wasn't good. Now, I could have been straight up honest and flat out rude about it but it not our style. The man who questioned us could have been a manager but since he never identified himself he could have been anyone. I suggest the zipps staff eat it themselves and find out exactly why it's worthy of sending back. Don't bother when in the same complex there are truly excellent places to spend your money.","useful":1,"funny":0,"cool":0},
{"review_id":"yBmT9s5J3lD4VGJ6lEeJHQ","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"eS8OuIk6_fMNNslFnj8noA","stars":5,"date":"2016-05-28","text":"I love this place, great service and amazingly delicious Chinese food. The sweet n sour chicken is my favorite. I've never had it better and I've eaten at a lot of Chinese restaurants. I also love the vegetable fried rice, lemon chicken, and wonton soup. I've seen reviews that are unfavorable and to each his own but, really? I don't know what the hell they're talking about. This place rocks and does so consistently.","useful":0,"funny":0,"cool":0},
{"review_id":"7veSLwiGteiTmKaL72XdBA","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"F70couxLlxWDRZNIVHoIRA","stars":5,"date":"2016-11-20","text":"Ethical and mechanic don't always go together, as anyone who's been scammed can attest. So, needless to say I am so happy I found Al at brakemasters! Trustworthy, honest, and friendly. I will not take my car anywhere else. I highly recommend Al to all my friends and fellow yelpers who are in need of car repairs or routine maintenance. If this location isn't near you, trust me, it's worth the drive.","useful":1,"funny":0,"cool":0},
{"review_id":"_llirejTq3KCgoxET5iOlg","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"GTuAPBRsM5dVPqPy9oe14Q","stars":5,"date":"2016-04-17","text":"This place is awesome! A friend recommended it years ago and I'm so glad she did. The chicken salad sandwich is heavenly, a must try. Everything is fresh and delicious. This place is family owned and operated. They are super friendly people who remember you and make you feel welcome. Oh and did I mention to try the chicken salad? There's nothing like it anywhere, I love it and I'm sure you will too. Do make sure to bring cash as they dont accept anything else.","useful":0,"funny":0,"cool":0},
{"review_id":"MqB0I2heggMSrKMYj5lGkQ","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"JQwMRgCMZJhIDxec1z7URQ","stars":5,"date":"2016-04-17","text":"Oh Sushi Kee, how I love thee! I've been coming here for years ever since a friend recommended it. Im glad she did because they have awesome rolls. My favorites are the Arizona, Hurricane, Tiger, Kee, Salmon Avacodo, and the California rolls are the best! The portions are huge, the service and Chefs are awesome. I wish I lived closer so I could come here more often.","useful":0,"funny":0,"cool":0},
{"review_id":"OuJnSpi7SH8E8mE8URpAWQ","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"huB7wlPf096C6_Ck-XOD8w","stars":5,"date":"2017-01-15","text":"This is my go to Petco. It's close, convenient, and the staff are super friendly and helpful. I love being a pals rewards member since I get a $5 off coupon for every $100 I spend in store or online. They carry the brands I prefer, like Blue Buffalo and Dr. Elsey's (best kitty food and litter ever btw) and have sales often. Also, the fish are well cared for and healthy. I love that they do pet adoptions and give you an option to donate to animals in need. Kudos to Petco, I hope I always live close to this location.","useful":0,"funny":0,"cool":0},
{"review_id":"h9aRjBziWDsiosrmIFWJ6A","user_id":"36sFsSQbhgsa9p1tGownYw","business_id":"lENkF6Cgd9WzUDBcuZcAPA","stars":5,"date":"2016-05-01","text":"Love this place! Authentic, fresh and delicioso! I totally pig out whenever I go here. The carne asada street tacos are amazing, excellent nachos, yummy salsas. Friendly atmosphere and great prices, what's not to love? If you're looking for real Mexican food, go here, you won't be disappointed. A big thank you to my fellow Yelpers, another great find via your awesome reviews :)","useful":0,"funny":0,"cool":0},
{"review_id":"CpJppAM1VQ5cIPeB121LTA","user_id":"LeEcL76lQOFBB6wCNTd6kw","business_id":"r8764MtYyt8JhxMvrfM_xQ","stars":5,"date":"2012-02-05","text":"Had a very enjoyable time at Vintage95 last Saturday night. The wait staff was top notch and very accommodating. Very comfortable atmosphere and furnishings. The young woman paying guitar was excellent ... wonderful renditions of a Roberta Flack and Cranberries tunes, among others. Looking forward to going back and sampling the single malts they have.\n5 Stars for my date too!","useful":1,"funny":0,"cool":0},
{"review_id":"TSqrwJSAgYytZsL5otrAGQ","user_id":"LeEcL76lQOFBB6wCNTd6kw","business_id":"fsqLNNiViaTPFk5ggOy-gQ","stars":5,"date":"2017-09-16","text":"The #22 Dinner Combo (String Bean in Black Bean Sauce w\/ Shrimp) was the best black bean sauce I've had since leaving NY. Now, if they only had Cold Noodles with Sesame Sauce  ;-), Looking forward to going back and trying their Singapore Style Mei Fun and other specialities.","useful":0,"funny":0,"cool":0},
{"review_id":"oMiDnAGwPm-R-TvKsArzZw","user_id":"jr3_JSzz9157H8cOMBV4HA","business_id":"Fv4EXwV30rwGD2NzN1ekgA","stars":5,"date":"2017-07-23","text":"Great food and service! Came here for a special occasion. Large variety of food on the menu! Will come again :)","useful":0,"funny":0,"cool":0},
{"review_id":"MeUWNVQW4pMk_9mkZZ7pFQ","user_id":"onagImY8qLOyRGEymXcmRw","business_id":"VOGC-kA2DlI2kxFj5prkDA","stars":2,"date":"2015-06-26","text":"I'm mostly reiterating what other have said but with a few additions.\n\nGeneral\n- Bad ventilation. With Pittsburgh humidity, it gets hot.\n- Wooden walls, so there's not a lot of grip for smearing\n= Price for a day pass is reasonable, but fees for little things like a belay device and chalk add up instead of holding an id for collateral.\n\nBouldering area\n+ Decent number of routes and variety\n- Stiff trampoline floor. Movable pads are big and effective but they aren't everywhere\n\nTop rope area\n-The top rope area is a different section of the building and even has different hours from the bouldering area, which is weird.\n- Ratings are labeled as Easy, Moderate, and Hard with +\/-. Why not put real YDS ratings?\n- For whatever reason, the ropes are just draped over a pole without any loops, so you don't get much friction while lowering.  Therefore, they require the belayer to anchor into the floor for each top rope. Not a big deal, I just haven't seen that requirement in a gym before.\n- Nonsensical rules. I got in trouble for helping my partner go over the safety checks. I passed the belay test, but I was explicitly told not to teach my partner how to perform the safety checks as a climber so I could belay him.  I was told this was for insurance purposes as they don't want anyone but the employees teaching. I waited for the employee to look away so I could safely set up a top rope.  Discouraging learning seems like a bad idea to me.\n\nMaybe I'm just spoiled by the great climbing gyms in San Francisco where I live but there are enough easily remedied flaws that led me to such a low rating.","useful":3,"funny":0,"cool":0},
{"review_id":"ASYpI7sB2F5qOKiZG2NR6w","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"ZBrPiysQdu-Yi1gqWGzcmw","stars":4,"date":"2013-01-20","text":"We weren't planning on visiting here but saw a billboard (they work!) saying Jerry Seinfeld was on that night and we just couldn't miss out that opportunity!\n\nSo we ended up with seats towards the back but the view was still great along with the acoustics. Would make for a great venue to see some live acts in as well.","useful":1,"funny":0,"cool":0},
{"review_id":"_aDHL5U-jGHM7TlZkfzUcA","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"na4Th5DrNauOv-c43QQFvA","stars":5,"date":"2013-01-19","text":"To be honest at first I didn't want to stay here as it seemed like it might be a bit 'tacky' but after being recommended by a few good friends we decided to book in as part of our US trip for 3 nights.\n\nHow wrong I was! Upon entering the driveway it was just 'wow' all of the way. The reception was massive and they had plenty of staff ready to book you in. The only one downside was that we had to go into a smoking room which did have some smell left to it but was gone in a matter of hours and reception did tell us we could change later that afternoon if it was still bad.\n\nThe room was very spacious and the bathroom was huge. The resort is massive and trust me it will take you some time to explore. The gym had a great setup and has plenty of equipment- no waiting like at the gym back home!\n\nWe gave the buffet a go and just like everyone said it's a must visit. They make just about anything there and have heaps of options to choose from.\n\nAll up well worth the stay and couldn't believe the price compared to other hotels in the USA.\n\nps. the blinds in the room operate by a switch - we spent a while trying to force them open haha!","useful":1,"funny":1,"cool":0},
{"review_id":"XN1OyFgh0Nf1BRsyFacoeA","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":5,"date":"2013-01-20","text":"I read a lot of reviews about this buffet so on our last day I made sure to drop in as we were staying at the Bellagio.\n\nOh. My. God. This place was awesome! Not only did it have the widest choice of options I have ever seen at a buffet, the quality and presentation was like a top restaurant!\n\nHighly recommend going here if you're after a good feed. Plenty of healthy choices as well but I must admit I gave in to quite a few of those tasty pastries... :)","useful":1,"funny":0,"cool":0},
{"review_id":"Q-tP0blPQ43taEL9hSJMUQ","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"tk97oILqxd6y_eOWFevUQg","stars":4,"date":"2013-01-20","text":"Nice casual bar located in the Aria hotel. To be honest I went here thinking it actually had a view across the city! Still a good find and it's a nice open bar with plenty of seating and some great drinks.\n\nJust a word of warning the free snack include wasabi peas... didn't realise what they were at first but they made us go through our drinks pretty quick when we did!","useful":1,"funny":0,"cool":0},
{"review_id":"6yHuhqxM9akiyq3ZVcdrwg","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"huOCKRwDvNqGX3KSzYawbw","stars":4,"date":"2013-01-20","text":"Great spot for a quick treat if you're staying at the Bellagio. We had some of the pastries which tasted fresh and like something straight from a bakery.\n\nThe only downside was that the cafe was positioned on our walk back from the pool to the lifts.. ;)","useful":0,"funny":0,"cool":1},
{"review_id":"NZXayLIC5wMT63QBkAVqOw","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"LwQB9H3jZ9wTk24Lr-AnZQ","stars":5,"date":"2013-01-20","text":"Outside seating that's truly different!\n\nAs we were only in Vegas for a few nights we wanted to make sure we got to experience as much as possible - including the dining. After doing the usual hunt on Yelp we decided to try out Spago and it was a great suggestion.\n\nWhen we arrived the waiter asked if we wanted sit inside or out and we opted to go outside - best choice! To be honest I thought the blue ceiling was tacky at first but after a while it really started to trick you that you were outside!\n\nThe food was awesome (as expected) but the service from the waiters was top notch as well. Highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"R3ngyO7FJWTgNchl4iyKeQ","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"rcaPajgKOJC2vo_l3xa42A","stars":5,"date":"2013-01-20","text":"Our last night in Vegas and we wanted to make sure to finish off with a great meal and Bouchon delivered!\n\nNot only were the meals great but the dessert we had was sooo good as well. Highly recommend this place for anyone looking for something a bit different and a great atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"ng7SL-rFmvJnPbH2-OPaaw","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"KmuLLSyZJdNoarwcIERHcw","stars":5,"date":"2013-01-20","text":"Never being to a Cirque du Soleil before I didn't know fully what to expect but judging by what everyone else had told me, it would be an amazing show.\n\nHappy to say it was superb and I'll be certain to see another if I get the chance! It was amazing to see the skills of the performers and it was a great mix of acrobatics, theatre and comedy.\n\nLooking forward to the next one!","useful":1,"funny":0,"cool":0},
{"review_id":"WVckAkG4n5WM0S5rngVY-w","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"4KmrrhtfnngTVFa2d5LAjg","stars":4,"date":"2012-11-23","text":"We always love our Italian food so I couldn't resist checking out this place when we were inside Wynn checking out the casino.\n\nIt was a great find and the decor inside was executed perfectly! The staff we really quick to serve us and the meals came out really quick. We had asked for a white sauce instead of the tomato for one of our meals which they got wrong but were very apologetic and came out just as quick with another one for us.\n\nAll up a great meal and find in such a great casino.","useful":0,"funny":0,"cool":0},
{"review_id":"W5Y3_9iKXLo-iSiqXFfnCw","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"Cr4ipI-tr-R8Q0NilkWNkA","stars":4,"date":"2013-01-20","text":"Worth it just for the view.\n\nWe only went up to visit the lounge. One big downside was the cover charge ($20 each!) that we weren't expecting but we just treated it as an entry fee as if going to a viewing deck ;)\n\nThe drinks were nice and the bar was starting to get a bit busier as we got there. But the main thing we went for (the view) was well worth it - especially at night looking right across the light beam coming from the pyramid below.","useful":1,"funny":0,"cool":0},
{"review_id":"GgyrFtdqdVHdvqk7g95JZw","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"KPgyqG3MyFUDK7GRbUg51A","stars":4,"date":"2013-01-20","text":"We had been recommended Pink Jeep from some friends of ours and we're really thankful they did!\n\nThe trip was well organised with them picking us up from the hotel and then heading out to the Canyon. Our driver gave us some great commentary on the way out and had the perfect balance of not talking the whole time but still being really informative.\n\nWe stopped at a few spots on the way out including Hoover Dam and a small store for a rest stop which made the trip out there feel even more authentic going into an actual country store.\n\nWe didn't realise when we got there that we would all be going onto buses afterwards but the guide was really good at making sure we all had the freedom of looking around each lookout and then still grouping back together at the end.\n\nThanks for making it an easy and great trip!","useful":0,"funny":0,"cool":0},
{"review_id":"TCem-xp4QstqyCZcfRKfCA","user_id":"wcKvC0jov-kAHg-GIvWJqg","business_id":"g83WbX_recywc4DEIZ-xug","stars":5,"date":"2013-01-20","text":"This place is a must visit for anyone to Las Vegas!\n\nI'm so thankful I came across it on here as it was never suggested to us by anyone else or even at the hotel we were staying. You start off the tour at their meeting spot where they give you plenty of water and warnings about just how hot it can get in there so be careful!\n\nWe got to meet our tour guide as well who gave us a quick background on the non-profit organisation behind the museum - it's great to see such a dedicated group of people preserving what some people would just treat as junk.\n\nIt's an amazing collection of old signage and as part of the tour around the 'boneyard' the guide gave us some great (and humorous) history about Las Vegas.\n This really made the tour as there was so much we learnt at the same time and it was astonishing to learn just how much the city has changed.\n\nIf you like your photography this place is an absolute must visit. There's so many good opportunities as the place is full of so much colour and typography.\n\nStop reading my review and book in now! :)","useful":2,"funny":1,"cool":1},
{"review_id":"Wg4SyEFbAf-rcvOr5s86LA","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"RycZOiohghoI0Ssg2Qqgqw","stars":5,"date":"2013-12-04","text":"Roast beef was amazing that sandwich alone will bring me back again before I leave Vegas.  I didn't care for the pizza I've had better.  But that sandwich was easily one of the best I've had.  I ordered a pizza, chips and drink and the roast beef sandwich for about $20.\n\nThe veggie sandwich is around $8 is also great. And the BLT is good as well.","useful":0,"funny":0,"cool":0},
{"review_id":"VluIpojME0yKOcRKI5L0Iw","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"iCQpiavjjPzJ5_3gPD5Ebg","stars":3,"date":"2011-10-25","text":"came here on Monday, no line. its good, but not to go out of your way good.  price is reasonable, it is hard to find. but that was the fun of it trying to find it.  no name, no sign.  if your clubbing @ the Cosmo and your have the munchies this is your place.  they use fresh toppings, crust is thin and very tasty.","useful":0,"funny":0,"cool":0},
{"review_id":"oAzCMKU2H_zuhGuODUryfw","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"o6f_n_YyqHq1e7zXz_BP8w","stars":3,"date":"2013-12-04","text":"It's ok if it fits your budget. Plus when you get out your on freemont.  But if you are not a silly person or don't have enough drinks in you it will be hard to get into. Buy your tickets at tix4tonight on the strip it comes out to $104 for two. Don't get the pasta most didn't finish there's.  Chicken was o.k.   sodas are free and well drinks are $6.","useful":3,"funny":0,"cool":0},
{"review_id":"MCkijUA1sGibn-zupKyJvQ","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"owLXnEhlMLsFpemYoOxNkg","stars":5,"date":"2011-09-06","text":"for the PRICE the rooms are huge and very comfortable. the AC. was strong, for 110 degree heat, the beds were comfy and they have a hid abed. large bathrooms separate tub and shower. this place is a hotel first and casino second. All the rooms are in different buildings from the casino which makes it very family friendly.\n        front desk was very friendly and helpful. Even though its not on the strip its a block and half away from the center of the strip. a short cab ride or a short walk and you can be at ceasers palace, bellagio, paris,and bally's for the shuttle to the Rio. wi-fi is free in the lobby and pool side. there is a fee to have it in your room. there is a resort fee if you book it through a third party like orbitz, travelocity, priceline,etc. you should check there price first and see if you can save some money. i was there from Thursday to Monday on labor day weekend. it was quite and peace full as appose to the chaos of the strip on a holiday weekend.","useful":2,"funny":0,"cool":0},
{"review_id":"iK_19xLKRTZtL4L4ssj-Aw","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"4GXII-GU7S0ZyU6ElkhscQ","stars":3,"date":"2013-12-02","text":"Again great deal for the price and location plus free breakfast.  $50 on Saturday.  King room, flat t.v.,kureg coffee, good water pressure, did not hear the people next door and hope they didn't hear us. (Unlike planet Hollywood where you hear everything)","useful":0,"funny":0,"cool":0},
{"review_id":"cyOVXbImAMR10YwBjJ8Izw","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"DkYS3arLOhA8si5uUEmHOw","stars":4,"date":"2011-10-25","text":"cant go wrong here, in the mood for sandwich this is it. its baked and toasty, healthy and filling. its not as good as jersey mikes but almost there.  price is very Worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"YgIvr5Za2RaTIZShxyoA8Q","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"LNGBEEelQx4zbfWnlc66cw","stars":5,"date":"2011-10-27","text":"OK OK this is the BEST buffet in Vegas period.  there is a lot of variety. the desserts are very good.  The lamb shoulder cooked to perfection.  but what does it is FREE all you can drink beer and wine.  I'm talkin about the regular buffet on Wednesday under $55 for two.  without a players club. we got to the line around 7 and were seated about 7:15. it wasn't to busy.\nat the dessert bar you can order fresh coffee or a latte with Kahlua. If somebody hadn't told us we wouldn't have known. \n      everything was really good. The place is very clean.  Don't bother looking for the bathroom its not in the Buffet its outside to the right.","useful":0,"funny":0,"cool":0},
{"review_id":"XxsMdJl8OTgeq5iEhp4JLQ","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":5,"date":"2013-12-04","text":"this is for the fireside lounge.\ngreat place to finish the night off or start it.  the appetizers were large portions and the well drinks were also great.  it has a old las Vegas feel to it","useful":1,"funny":0,"cool":0},
{"review_id":"fxyFE8BiwfIeGfIgi0I4qA","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"1fK0bh0dI_Pz6-I8jorHQw","stars":4,"date":"2010-08-31","text":"mystery adventure is must do Sunday Thru Thursday. its great but its 3hrs+ long. i like the fact that it had something for everybody. you don't have to be a mystery junkie to enjoy the adventure. and for the price you really cant beat it. nothing in Vegas will keep you entertain for so long for so little, plus there's snacks to munch on while you try to look for clues. The one thing that is definitely fun is to determine what clues you need to solve the mystery and what clues you don't.   you'll get to meet people and work as a team to solve the mystery.  if your on a tight budget this is a must.","useful":0,"funny":0,"cool":0},
{"review_id":"qhTMlDmQqZI02EuTQPlGdQ","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"OAEeaLLm_9sHksKJEY0o0w","stars":5,"date":"2013-10-26","text":"besides going up the Eiffel tower and the crepes its the only reason i even step inside the Paris casino.  I've been here several times already and it hasn't gotten old.  no cover, two drink minimum and  pricey to, if you haven't you must.  two guys on a piano going at it.  they play everything from oldies to today's music.","useful":3,"funny":0,"cool":0},
{"review_id":"P1OMjonI7MOGn0KqHGQC-A","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"uanCi4OGc1mHLGl_AT4JhQ","stars":4,"date":"2011-07-06","text":"i was there from June 24 to 27th. the room big enough for four adults. we checked in early and we got a room on the 25th floor facing the strip. that was the best part. the view was unbelievable. the AC. was strong. the room was very modern and clean. the beds were very comfortable. the casino i didn't care to much about nothing special to see or write about. there is a free show outside the hotel. if you haven't seen it. its worth check out. the area is pretty good, there is tram to the mirage and next to that is ceasers palace and on the other side is a big mall. accross the street is the Venetian, Harras casino (and a shuttle to Rio that were the best buffet in vagas)and the carnival bar. pool parties are not the worst but not the best either. the DJ was pretty good ,the down side very little shade. \n\nthere is a mandatory $22 a day resort fee that includes wi-fi in every room and newspaper in the lobby. they don't tell you about the fee until you check in.","useful":0,"funny":0,"cool":0},
{"review_id":"raK0ehaHg0iZvdNP8EnuBg","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"BLIJ-p5wYuAhw6Pp6mh6mw","stars":4,"date":"2013-12-04","text":"great tip i found by accident. book your room through www.easyclicktravel.com and you wont pay a resort fee of $20 per night.  I'm not sure if it works for other hotels as well.  the hotel is great location, great bathtub, comfy bed, good or great view of the strip depending on your room.  only downside is walls are thin. you can hear the next room so gotta keep the TV. turned up.","useful":0,"funny":1,"cool":0},
{"review_id":"IEMR_Vo-0g53fPjqlaxeSA","user_id":"D1_nrBr4dOrs7M82OaBRwQ","business_id":"6kkxRV8H9SQLybj0xnEbMw","stars":5,"date":"2011-10-25","text":"it doesn't get better than green valley ranch sports-book.  1 dollar beer, 1 dollar hot dogs, turf grill only top of the line food and priced very good, plus free well drinks when you gamble (must get coupon when you place wager).  get there early and you get your own TV. booth., the waitresses are very thorough, they walk down every isle and ask everybody if the want a drink. unlike ceasers.  the whole right side is for football and the left is for horse racing,  but you can pretty much sit anywhere.","useful":0,"funny":0,"cool":0}]