[{"review_id":"jQ_jGVSTsYEw4bkkh-ojgw","user_id":"rEYGGiC7EViRsfYDiKyyZw","business_id":"8u_PwSJyVO4uvrAE7VKH2A","stars":5,"date":"2016-02-10","text":"Dr Sohn, understands exactly what you are looking to accomplish and is able to get you the results you want.  Excellent bedside care.  The staff was very kind and knowledgeable.","useful":1,"funny":0,"cool":0},
{"review_id":"oSBPYhwusQJ_GJkpeRk-aA","user_id":"hileHHDDqjxbyeyjgvNqOg","business_id":"vrU9f2x__QeSBvt6Er8NCQ","stars":4,"date":"2013-06-08","text":"Excellent Thai food. This restaurant has become one of our favourites.","useful":0,"funny":0,"cool":0},
{"review_id":"xRHGv6SmoYrjKVPPWOjgew","user_id":"-X6NbB699wt1Z2atOPgmBw","business_id":"AxeQEz3-s9_1TyIo-G7UQw","stars":5,"date":"2009-07-11","text":"Loved the BBQ chicken and fried rice plate!  Definitely worth checking out!","useful":0,"funny":0,"cool":0},
{"review_id":"iUOny-7pyHTYX4O9J83WXg","user_id":"-X6NbB699wt1Z2atOPgmBw","business_id":"3uC7Lbc3RgUDTWQlBu4PqQ","stars":5,"date":"2009-07-27","text":"Absolutely love this bakery....fell in love with it last month when I visited Vegas and now again.  Anything you order will be delightful.","useful":0,"funny":0,"cool":0},
{"review_id":"M1y0zuT-mrSQspMbSNmJyA","user_id":"-X6NbB699wt1Z2atOPgmBw","business_id":"QJatAcxYgK1Zp9BRZMAx7g","stars":5,"date":"2017-06-04","text":"I loved the SmokeShack burger and the cheese fries! I have to refrain from how many times I eat here every time I visit Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"l_iLxiwaiMhEBvf883penA","user_id":"xWPEJxrG-ybz8ol3gwrxtA","business_id":"-FZxMD-3aXsy9BI1liKqCg","stars":2,"date":"2012-02-04","text":"Love the staff.. Hate the customers.\nPlease leave your kids at home ladies","useful":0,"funny":0,"cool":0},
{"review_id":"8WY_nPb8TZuKjH_tAKwm0w","user_id":"ZxoQojdNB8UBEfLKHJDaUA","business_id":"tLCZdAt83gvD6Me_Vshu1w","stars":3,"date":"2015-08-10","text":"The pizza from this place is legitimately terrible. I'm the kind of person who will happily eat the worst pizza out there, but this deserves special mention for tasting worse, having a worse texture and makeup than the cheapest grocery store freezer aisle pizza you could find. I don't get how they make pizza this bad. I could throw tomato sauce and cheese onto a goddamn tortilla and nuke it in the microwave for 15 seconds and have something better.\n\nThat being said, their calzones and strombolis are somewhat acceptable just because they actually have to FILL the product with some ingredients (or they will give you sauce containers to dip their anhydrous product into), rather than leaving a dry, sauceless cheese on top of some stale dough like they do with their pizza. Their alfredo pasta is probably the best thing on the menu, and even then it's just because alfredo pasta is impossible to botch.\n\nThis place is good for two things: 24 hour delivery, and beer delivery. If you actually order food from them because you think it tastes good you are a nut. That being said, it fills an important niche role with those two things, and for that this horrendous establishment has a warm spot in my heart. Also, their delivery guys are always pretty friendly even at 4 AM which is pretty much the only time I ever see them.","useful":3,"funny":2,"cool":0},
{"review_id":"wr4vZKAnjg_oDoNwkGioYQ","user_id":"ZxoQojdNB8UBEfLKHJDaUA","business_id":"QMaaLfedGzNhHz6PZKAUkw","stars":2,"date":"2014-11-27","text":"Not that any Filiberto's location is high-class, but this Filiberto's is the kind of place where it doesn't matter whether or not the employees spit in my food because either way I'm going to eat my burrito under the assumption that they did.","useful":0,"funny":0,"cool":0},
{"review_id":"iOFNgJQCQiFmF65mKEUVRA","user_id":"ZxoQojdNB8UBEfLKHJDaUA","business_id":"AcgtsEyOco2WVJLgCGVwQA","stars":5,"date":"2014-11-27","text":"This place is a fast-food Mecca. Despite my best intentions, I have just enough self-control to maintain an unsightly fast-food indebted belly, so I come here often. Much too often. I'm not sure if Misty (who is a lovely and sweet lady) finds it odd that I've recited my order to her enough times that I know her better than most of my immediate family, but if she does find it odd (and I know I do) she's excellent at pretending otherwise. If I ever come in and she asks me if I want \"the regular\" I'll know it's a sign I should cut back. But instead I'll probably just order something different. Maybe I'll add jalapenos to my burger, I don't know. I hope it doesn't get to that point. \n\nThe menu at Whataburger is pretty great - it has every option you'd expect from a burger joint and an \"all-time favorites\" menu that has some specialty burgers which are all fantastic, and though their burgers are always higher-priced than some of the other places you can go, they're big burgers. Everything I've tried on the menu has been fantastic, but it doesn't really matter, because I always order one of two things. To start, I always order a patty melt. Two patties, melted cheese, grilled onions and a sauce that I'd go into detail about if I wasn't concerned about alienating readers from displaying an alarming amount of affection for it. The patty melt is big and filling, but me being the careless fat man that I am I usually order a meal of chicken strips on top of it and make it a large. The meal comes with 3 strips, fries, a drink, a slice of texas toast cut diagonally (and we all know bread tastes better when cut that way), and your choice of dipping sauce. I always get gravy because it's perfect for dipping the bread into. Thank god they have diet Dr Pepper in the fountain so that I can keep this meal healthy and low-calorie. I always get spicy ketchup with my order instead of regular. I'm not sure I think it's better - in fact I'm pretty sure it's not, but sometimes the novelty wins out.\n\nSometimes, when I'm feeling adventurous, I make the patty melt the meal and get 2 honey butter chicken biscuit breakfast sandwiches instead of the chicken strips meal. That's where I find the only limitation with this place - they only serve breakfast between 11 PM and 11 AM. Fortunately I'm a goon and often don't wake up until the sun has gone down, which makes that time period take up a good portion of my day. On the other hand, what should be \"morning\" for me is often long past 11 AM. Oh and there was one other time when the guy working the drive-thru made me pull around front because it was going to take them a little longer to cook up all the food for the massive one-man feast I ordered, and he assured me he would throw in 2 apple pies for making me wait but instead he only gave me 1. I'll hold a grudge over that unforgivable crime until the day I die.\n\nBut this whataburger is open 24 hours. Even the inside is open all the time, and that's good because there aren't many other places where I can pig out at 4 AM except Filiberto's which always carries a much stronger \"you might get murdered here\" vibe at that hour, and I like to feel warm and safe while I destroy my body. I've spent enough money here to put one of my future children through college, and sometimes my individual orders are big enough that they cost more than anything you could get at a 5-star restaurant. And it might just be because I'm almost entirely classless, but I'm pretty sure I'd rather eat here.","useful":2,"funny":2,"cool":0},
{"review_id":"xhwW8ZNLE06s3Ef9C6zi-g","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"fwznZTqJ4bVOfMCOniHCxg","stars":5,"date":"2016-09-23","text":"I am beyond pleased with this company! So glad to have found them. Carlos and Santos have been beyond accommodating and their prices are extremely reasonable for the detailed work that their team puts into their servicing of our facilities! They're also very adaptable to any changes in scheduling or service that we may need to make. I highly recommend them!","useful":2,"funny":0,"cool":0},
{"review_id":"uBK-nYD9x_GQRXyga86-Dw","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"dVQFNgVlnxgitEXDQR7tfA","stars":4,"date":"2016-02-21","text":"The food, especially the honey cornbread, is delicious,  and the service is very friendly.  I have to give them a 4 instead of a 5 because they really do need to work on better assessing their raw goodsinventory food-wise. They were almost out of everything by 6 pm on a Saturday night, and they weren't supposed to close until 9pm. That's money down the drain. This isn't the first time that this has happened so once they get a grip on that issue they'll be a 5. I would suggest calling first to see what they've run out of before making the trek in person.","useful":0,"funny":0,"cool":0},
{"review_id":"mhTbCMWWpvPMTf86jVKsKA","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"wT-J6sib_NSr8rcH2aTcAA","stars":5,"date":"2014-09-24","text":"5 Stars for Roberto's on Flamingo and Rainbow!! We had a caterer scheduled for lunch today at work for Employee Appreciation Week who did a no call\/no show, and I called Roberto's to see if they can make 90 tacos within a half hour.  They made three types of tacos within our requested time frame, packed them nicely and helped us load them in the car.  They were delicious! Thank you for saving the day!","useful":0,"funny":0,"cool":0},
{"review_id":"cl55I8shAS2F0AY2ErN1yw","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"60uVlCUiLJvq3xNo_3bhQQ","stars":5,"date":"2016-05-01","text":"I can't tell you how hard it is to find \"New York\" pizza that actually lives up to its name, and Carmine's has hit the mark! Excellent pizza that snaps when you fold it, great cheese and crust. The service was friendly,  bathrooms clean, dining area charming...definitely returning!","useful":2,"funny":0,"cool":0},
{"review_id":"hq-vnUj0cpheOIqob0aeWQ","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"0pA7gxi3K6_OrDsGrpMb2Q","stars":5,"date":"2015-01-07","text":"The move went so smoothly and was done faster than I anticipated. This is my second time using them and the rates are very reasonable for the number of people that they send out.","useful":0,"funny":0,"cool":0},
{"review_id":"WKR4Cv7jffcgBjq-HdiNmw","user_id":"4vP0IKq8qt7h-CsTLFhSxg","business_id":"PLVJCN2p1MIkeDzIbAx9kA","stars":1,"date":"2017-03-12","text":"I'm not writing this all over again after yelp dropped the first send of the post, but to make a long story short the customer service was the worst. Downright rude and deliberately inattentive.  Same with the Ft. Apache and Tropicana location. I will never step foot in another Denny's again and I will be contacting the corporate office.  I wish I had on a hidden camera so you could see them ignoring us!","useful":1,"funny":0,"cool":0},
{"review_id":"qT9FqVP1B_mxdcZdYLmrUQ","user_id":"SXqQpHrbZ-NYQaZnUfMmoA","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":1,"date":"2014-06-08","text":"Let me start with the good. The waitstaff was awesome. Very nice. And helpful as this was my first time at the restaurant. Also were helpful when my son got sick at the table from eating the Fresno Chile that came with his bbq wings. Also they removed the pepperoni breadsticks from my bill when it was obvious they were not a hit with the table. \n\nHere is the bad: my son said the Wings tasted funny. So I made the mistake of eating them. I didn't pay attention to whether the meat was fully cooked. But the meat must not have been, because within one hour of leaving I became violently ill. I am on my third day of suffering the effects of the food poisoning. Ruined the last 2 days of my trip to Vegas. My friend's son got the runs from eating the hamburger. And my friend is still sick as well from the grease. We are pretty sure the issue was  uncooked chicken and old grease. We will not return to the restaurant. Which is sad because we only went to the restaurant because my son loves Guy Fieri.","useful":0,"funny":0,"cool":0},
{"review_id":"PYXD8KYqcSGvBis22dB8sQ","user_id":"XdRmVROYtqGy4vqALrLGSQ","business_id":"Pwb0tGwDCa-Z7Eg2zqfhXg","stars":1,"date":"2012-02-12","text":"Poor service. Food was nothing special. I don't plan on going back.","useful":0,"funny":0,"cool":0},
{"review_id":"ieCSC_l4vAhHG6q82FuStQ","user_id":"Xg-B5oqEof-BcAp1N26mSQ","business_id":"-PJgh1XoQBMnnSgg6MhmMA","stars":4,"date":"2014-04-16","text":"The food so far has been Awesome. The veggies are fresh, the rice is light and the Walnut Shrimp is indescribable. Yum.","useful":0,"funny":0,"cool":0},
{"review_id":"dq4eLGOXcj4Xa_LT88dEgg","user_id":"Xg-B5oqEof-BcAp1N26mSQ","business_id":"Q28MO9hEMyG0xrAnOF-dSw","stars":5,"date":"2016-03-19","text":"If Howard isn't a staple in Phoenix by now, I can't believe it. Huge fan of the new place. Fuck Yelp! I hate it.","useful":0,"funny":1,"cool":0},
{"review_id":"asixVQWSaFohgyzbxOcBxQ","user_id":"GafWFl6wlAK4oEdL2ut2xQ","business_id":"pcreu_9klIorF3DTguh1Rg","stars":1,"date":"2015-02-19","text":"This is the worst restaurant in Sun City, BAR NONE. The service is slow, the food is cold, and the management is incompetent.","useful":1,"funny":0,"cool":0},
{"review_id":"Bmda5vhSA11LhhBsltBUOw","user_id":"GafWFl6wlAK4oEdL2ut2xQ","business_id":"lPPiiwk45KUFG9yMs_sNlA","stars":1,"date":"2015-05-22","text":"DO NOT USE THIS PHARMACY IF YOU CAN AVOID IT. Prescriptions are often not ready when promised. Recently I had to wait 24 hours for a prescription to be filled (this in a major metropolitan area). To top it off, they just shorted me on a prescription for Prednisone, which is risky with a drug that requires specific dosages over a specific number of days. It is not unreasonable to expect a pharmacist to be able to count to 12.","useful":0,"funny":0,"cool":0},
{"review_id":"-DWagvex8BBrVZoEdx0Ydw","user_id":"8NIn5l16pfPe10xA5S2dwg","business_id":"h7vh4Ai3-W4e1sMKhJUNQw","stars":4,"date":"2013-12-22","text":"This place is great because I don't have to go all the way down Spring Mountain for some good Korean food.  Try the poor man's soup and make sure you get the story behind it!","useful":0,"funny":0,"cool":0},
{"review_id":"YxGDdzWz_nQW0hzaBJ2Btw","user_id":"8NIn5l16pfPe10xA5S2dwg","business_id":"qk_fSkuViFcC4NmuhF9K4w","stars":1,"date":"2014-12-23","text":"I will no longer be taking my children here.  We needed 30 seconds of time for a little advice in a potential emergency situation.  Instead we received rude and snotty attitudes from the support staff and told to leave.  Apparently it's our mistake for thinking we should seek quick advice from our pediatrician when one of our children was seriously ill.  To the office staff:  When you see a seriously ill child and feel nothing, then you are in the wrong profession.","useful":3,"funny":0,"cool":0},
{"review_id":"7jRczKuWfDl83Th8IVX32Q","user_id":"pduRB-xpFr3prNqntRDZxg","business_id":"-JwSuDqyFILFJmVpjrVbwA","stars":1,"date":"2016-08-03","text":"went there for lunch break. me and my coworker received a water that we asked for after about 20 minutes. the food took so long we asked for it to go, then had to go inside before we were going to be late getting back to work (which is less than a minute away) for us to receive our food that was boxed. we get to work and open the boxes and the food is ice cold, no sauce was included that even comes on the food let alone extra we asked for. and hair was found in the cottage cheese and side salad. if i could rate half a star i would and only half because of how close it is to my job. would not return after this terrible experience","useful":0,"funny":0,"cool":0},
{"review_id":"UKQGCrsU89vdB2H-lToGxQ","user_id":"pduRB-xpFr3prNqntRDZxg","business_id":"b2HGvIFVDVyT2nHnkiZC2w","stars":5,"date":"2017-07-04","text":"This place is great. Kelsey is the best leasing agent I've ever dealt with. Positive experience all year long! Way to go Waterford. Autumn came in and it's been even better. Thanks guys!","useful":1,"funny":0,"cool":0},
{"review_id":"V7AnGK7d1jhP7MgN0LBi4Q","user_id":"7bu24my3AM2f0p_5lRB_Ag","business_id":"V-vvJGs3lBqCib1408rfaw","stars":5,"date":"2013-05-18","text":"I highly recommend Bike Authority.\n\nI ride a Trek 7500 hybrid on the Bike&Hike and the Towpath.   I ride some 1500 miles\/year.  SInce Brecksville Velosport closed a year or so ago, I take it to  Bike Authority for service.    I had them perform their $60 tuneup package.   I was pleased with their attention to detail and their quick turnaround.   I took the bike in early on a Saturday and it was ready in a few hours.\n\nToday I took in my bulging tire for service.  The shop was fairly busy but they took care of me right away.   The tech explained the tire needed to be replaced and gave me a couple tire choices - he had the tire replaced and I was on my way in 15 minutes tops.    There was no labor charge.","useful":1,"funny":0,"cool":0},
{"review_id":"-bV6cc9qVbtiVW4tFzH_dA","user_id":"7bu24my3AM2f0p_5lRB_Ag","business_id":"DJuQgsoj-qmU0i5iTAa4aA","stars":5,"date":"2010-11-18","text":"Outstanding Indian cuisine!!  \n\nMy work colleagues from India (both vegetarian and meat-eating) recommended Tadka as the place they go to when they eat out.  So the wife and I checked it out for our anniversary dinner.   \n\nThe restaurant is in Great Northern Mall, next to the Best Buy, so parking is plentiful.   Its actually two restaurants; the other is Bamboo Garden (Chinese).    The Tadka side has an open floor plan; it has many 4-person tables with built-in seats, and a row of booths.   A large bar dominates the rear.   We arrived ca 530pm on Friday and had the place to ourselves.\n\nService was extremely attentive.   We were seated immediately; we chose a booth, which seats you quite low relative to the tabletop.   It was a bit awkward but not unpleasant enough to request a table.     \n\nThe waiter brought us menus and a complimentary appetizer of spicy (maybe 4 out of 10) chickpeas; these were VERY welcome to my heat-loving tastebuds.  We also sampled the keema samosa and potato-cashew rolls.  This samosa pastry was very similar to filo, holding delicious minced lamb.  The potato-cashew rolls looked like hush puppies but tasted infinitely better - they practically melted in our mouths.  Neither of these was spicy in the chili sense, just full of flavor.\n\nThe main courses were equally impressive - marvelous flavors without fire.   We ordered Murgh Kalimirch (chicken with cashew nut paste) and Daal Tadka (lentils in ginger garlic cream).   Rice wasn't included, so we ordered 1 basmati rice - this was plenty for 2 people.   We also ordered Masala Papadam, which came with a thick garnish of sliced tomatoes and other vegetables.  The garnish was tasty but made it imperative to eat the papadam before it became waterlogged.   \n\nWe gorged ourselves and had enough left over for two meals apiece.   And the total bill was $60 including tip.    We're not waiting a year to return!","useful":0,"funny":0,"cool":0},
{"review_id":"BcPbHVhgsAoGq7z-Tjt9YA","user_id":"8k_zmKY9kZ5zeDLCRkRWcw","business_id":"w0ArxcJ0XsyK1ZwrIf3gpA","stars":5,"date":"2014-11-15","text":"This place fucking rocks!  Pool,  Foosball,  shuffle board and more.  Nice workers, good times, good music....what else do you want? Good food? Got that too. Get your butt here and see what local is all about!","useful":0,"funny":0,"cool":0},
{"review_id":"sdP-0vdOu-blJGWNTwaVoA","user_id":"8k_zmKY9kZ5zeDLCRkRWcw","business_id":"atVh8viqTj-sqDJ35tAYVg","stars":5,"date":"2016-01-17","text":"This is my favorite spot to go and chill with my friends after church. The food is always good, especially the specialty french toasts. The employees are very friendly and the prices are very reasonable. Swing by and give this gem a chance. You won't be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"fh8mGgWHMwwLoUEfzGIpKQ","user_id":"1AoB3hZoJ6jrmiXA7QGiyQ","business_id":"CPxUsIkhYDSHqgz6sNDmqw","stars":5,"date":"2016-04-05","text":"R+R is a first class run operation. Lauren always has a warm welcoming smile when I come in and scheduling with her is very easy to do. Shamrin is a very talented massage therapist. Her understanding of kinesiology is extensive and I requested \"heavy thumbs\" when I first called for a massage therapist. I was not disappointed. If you are looking to be greeted by friendly receptionists with great massage therapy, I highly recommend R+R.","useful":0,"funny":1,"cool":0},
{"review_id":"cEK9QgB6ljs7j46SakvoyA","user_id":"exr1e6N_JENy9FOhWpy9pg","business_id":"roMiZWtPQ2xQG_eLe86PJg","stars":5,"date":"2015-05-27","text":"Helen owns A&M, and she is such a pleasure to work with. She had creative ideas to fix my problem items, and truly wanted to help me feel satisfied and pleased with my clothes instead of trying to add on unnecessary charges. She'll discuss with you at length instead of rushing through your issue. She keeps working hard and makes tweaks until she gets it perfect, even if it takes time and is more difficult for her. I'm so happy with my end results! Do not hesitate to ask for her - she'll go the extra mile and you won't regret it!","useful":1,"funny":0,"cool":0},
{"review_id":"Xjlf6gADIlhamFh_Yci_Jg","user_id":"exr1e6N_JENy9FOhWpy9pg","business_id":"FvXZcRB8bocNMDvFUnoWhg","stars":5,"date":"2016-12-07","text":"Delicious, flavorful pizza and I love how the crust is thin, but doesn't flop over. Super cozy and cute with Christmas lights\/music and really friendly staff. Just go :)","useful":0,"funny":0,"cool":0},
{"review_id":"6QGcwDWdW3GPXKOWJ29w0w","user_id":"uAfGYs74KWKdH4bgXNMtPA","business_id":"cyzOijFJ82cae6qH6L8vuw","stars":5,"date":"2015-06-18","text":"Outstanding presentation the fresh roll and chicken satay very good! Highly recommend the beef salad and chicken basil!","useful":3,"funny":0,"cool":2},
{"review_id":"PUL5XFFbpnAuzaOxhWo20A","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"tPWn698nZ-yYj3yTwOsczQ","stars":5,"date":"2015-04-07","text":"Kosher department is big and you can get everything you need fresh and clean, the bakery is great from the pita bread to parve birthday cakes, great to have the kosher experience!","useful":2,"funny":0,"cool":0},
{"review_id":"fVUVdh5BszG9ZkOYmfE2Pg","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"nXUumj3RzCRVmm7B9HujAg","stars":4,"date":"2015-10-21","text":"I'm going there at list twice a week, great location, staff are nice most of the time, food and drinks are good.","useful":0,"funny":0,"cool":0},
{"review_id":"ADKuU1n1M0DL5UY1fGzyzw","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"sNiLWoLWRS56vWpgM6mQfg","stars":5,"date":"2015-05-03","text":"Good sandwiches and salads, great latte,\nPrices are fair and now there is pizza and the \nKids loved it, now if we need a quick meal for\nThe kids it's a great solution for kosher custemers, \nOver all expuriance is very good.","useful":0,"funny":0,"cool":0},
{"review_id":"HrW4Fi7JUIzqoQQltfeX6w","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"bN-rw-GtpNB1QCbnj0v6cQ","stars":2,"date":"2015-07-10","text":"I purchased 3 I phones over the years and every time something they say or promised is not true, the last time I went they told me after I bought my phone that I'm one of the only customers that got selected for home security system, they ran my credit without telling me and the next thing I see is a big box lending in my house a day after, I been told Simone will come and will come and show me the system but never been told they will ship it before, now I returned it but still fill like they have bad sales technic.","useful":0,"funny":0,"cool":0},
{"review_id":"eRyOUWGHITiyHC3L0zhCCA","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"naHOPNUhSnrHmzWCQ2bWyA","stars":1,"date":"2017-04-27","text":"Never again!!!! Came in at 10:20 in the morning and been told it will take 95 minutes, it's 1:50 pm now and still didn't see a doctor, now finally siting inside and only God knows when this nightmare will be over.","useful":2,"funny":0,"cool":0},
{"review_id":"eEy_uBt-g40ZULeSZ2XnhA","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"fe8_IsDmaMkfvvVEBnV5nQ","stars":4,"date":"2016-12-09","text":"Nice place, great location, they can do better as far as Eqwipment but overall I love the place.","useful":0,"funny":0,"cool":0},
{"review_id":"bo3Dj6hoe2nnMjOR5yGpQA","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"CVt6kBVBABSq-NA_FZfrVw","stars":5,"date":"2015-04-07","text":"A great place with great food, Moshe always make you fill at home and the prices are fair, highly recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"hOXO-G53iWZdaPdfYFs1yg","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"3p7mUvZtYocYf8gYEENGxw","stars":5,"date":"2016-01-18","text":"Been here few times, pizza is good and service is great, I was also enjoying Israeli music that was playing.","useful":0,"funny":0,"cool":0},
{"review_id":"K2AE1JLuianHt6UBQlGr4Q","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"ZOItJ2cUT1X8duyQTNZD8A","stars":1,"date":"2015-05-15","text":"I had Gary the owner give me a price and promise so many things, job was late, never finish the job bad qwality, nice face when want your money and after job done try look for him, not recommend!!!","useful":4,"funny":2,"cool":2},
{"review_id":"j1VmrM__SBsjqedZpjFfAA","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"bqkHFFxx21WaRPDBq1uLZQ","stars":5,"date":"2016-04-03","text":"Great service, in and out in 1 hour with 4 new tires on my car, Rocco and Brandon are great, I will definitely recommend this location.","useful":1,"funny":0,"cool":0},
{"review_id":"QmM6G560oX2brquS85uyZQ","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"IiVUoKDPWULbJOMfnHVrLQ","stars":1,"date":"2016-12-09","text":"Been there twice and didn't get what I was promised, bought a speaker and been told that I will see it as credit on my bill and never got it, two years later bought a new I phone and later on found out they never enroll me with apple care,not going again.","useful":1,"funny":0,"cool":0},
{"review_id":"svQ8g7w5EzUUPJOR49mjMw","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"ckke8MRDHVLJdNa0quxOEg","stars":5,"date":"2015-04-08","text":"Great news for people that keep kosher, this place is not what we been used to, this place is great, the atmosphere is fantastic and it's open till late so finally we can have a drink and have a kosher meal of just something small, prices also great! Will go back again for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"7n5c3n68Nz3XbY_5tsPocw","user_id":"WcHpqcghUOQ1W2HG6fgDOQ","business_id":"m1Ro6PUujWqO74ATF_w_0w","stars":5,"date":"2015-06-22","text":"After I bought my car at the sahara location I had to go down to the western location to get my gps installed, i had an appointment set up before I went down there, and the day I went I met Adam the service manager, I had to wait 30 minutes to get it done and wile The car was at the shop I was at the waiting room, everyone was nice and my car was done after 30 minutes, again like in the sale process also at the service it was smooth and easy, the way it should be!","useful":0,"funny":0,"cool":0},
{"review_id":"Ngysvh41QEzJDHtoWVbqMA","user_id":"T1razePJBocFNcEwsc1tQg","business_id":"Swvp2uAehquvfq1ggT8dGg","stars":5,"date":"2017-10-19","text":"I just moved in aboutt a month ago and Andrea is the main reason why! I even backed out of an apt I a had already invested in! The entire staff is professional and courteous! I really enjoy living here so far .... 2 downfalls are I had to pay for a parking spot which I thought would be in the garage but it's on the top level in the sun! :( and the other one is I can hear everything outside ... so I recommend communication w the office about your spot and getting earplugs or having something on to drown out the sound if you're sensitive to hearing.","useful":7,"funny":0,"cool":0},
{"review_id":"LBAXsSSpvWV4gGvGTOJlcQ","user_id":"lAEFJG11fsT5OsVRR3oPRg","business_id":"1kytABjYhj3naF4vLQEbYQ","stars":5,"date":"2015-09-29","text":"This nekter location I have noticed is much busier than the other locations, but I don't mind coming to this location because of the consistency of my smoothie and service received. Candice, the girl with all the tattoos makes an amazing date but smoothie that at any other location does not taste so satisfying. If you go in ask for her, I do, I promise you won't be disappointed and she has an amazing memory for remembering who are and what you ordered!","useful":0,"funny":0,"cool":0},
{"review_id":"PNGr6z0lju0lX4avj9QOsA","user_id":"nL1wGhI_1W8v3yEDw3-Okw","business_id":"JlQsOCa-UPw_Gu1MG7jmig","stars":1,"date":"2017-07-17","text":"This place and management is a joke! They messed up on our order. Pizza was not well done our wings weren't in our box. I called back in spoke with a so called manager he said sorry blah blah next Pizza is free for the troubles well I called back in few weeks later there was no notes in system so no free pizza. Honesty goes a long way when your a business owner!","useful":0,"funny":0,"cool":0},
{"review_id":"xUD-SFJ1UvVNt__eopqlKA","user_id":"nL1wGhI_1W8v3yEDw3-Okw","business_id":"5aeFlQjZlwJhR7gA-9VMWA","stars":1,"date":"2017-05-31","text":"This place is a joke! The manager (J) is a JOKE instead of acting like a thug when people ask you about something maybe you should be a adult! They ruined my wife's window tint wouldn't replace it the manager told me there our signs all over saying not responsible for damage in a tunnel!? It didn't happen in a tunnel the guy took off the goop with a razor blade. It's like how dumb are you? So anyways got home we noticed how much stuff they missed so we called numerous times to corporate THATS A JOKE nobody ever calls back. Cobblestone you are going down hill FAST. You guys use to be good. EVERYONE GO TO TNT CAR WASH ON GRAND AND BELL WAY BETTER JOB AND CHEAPER THEN COBBLESTONE. J I hope you lose your job if you still even work there.","useful":2,"funny":1,"cool":0},
{"review_id":"7eYag3I6ysEGaWSLUWtSbA","user_id":"nL1wGhI_1W8v3yEDw3-Okw","business_id":"JJWQxF7ljXKVvCxn3ug-CA","stars":1,"date":"2017-06-17","text":"This place is ridiculous! My friends and I went in for dinner and a few drinks long story short my friend asked my fag friend wants to know what drink that is meaning a joke and she said fuck you to him! Well my other friend went up to her near the manager and he did NOTHING you can not do that in a restaurant. We will be letting the entire surprise community know what happened you can not say fuck you to a customer. The women who said that we hope you get fired! Applebee's you just lost a customer! GM we hope you read this and do something to resolve this","useful":0,"funny":0,"cool":0},
{"review_id":"A3WB4ikWOZNu5S6HZXbklw","user_id":"ttIye9qeDzYZZVMyjqq-RQ","business_id":"zo_z6lMRcwHqQF_Z1VZLpg","stars":4,"date":"2014-03-17","text":"I don't know what everyone is complaining about! I for  one had a wonderful time at Starving Artist when my friend and I headed there for brunch on a Sunday after yoga!! The decor is inviting and not pretentious, the servers are polite but not intrusive, and the food was sizeably portioned and really hit the spot. The prices are decent too. I had the eggs benny with tomatos and fruits, and my friend had the eggs benny with avocado and maple beans. The eggs on the benny were poached to a T and the hollandaise sauce married the subtely sweet and crispy waffle well with the creamy soft egg. Even the fruits were really well chosen: a nice array of watermelon, orange and grapefruit slices, as well as grapes and berries (blueberries, blackberries, strawberries AND raspberries!). I really think my meal was perfect, not only because it was tasty, but also because it was appropriately-sized so I didn't finish the meal feeling like I had just been rendered comatose by a grease truck, which is how I usually feel when I go out for brunch, so that was a nice change.\n\nCan't speak for the coffee cuz I didn't have any, but the next time I go there, (which will definitely be soon) I'll be trying the raspberry milkshake. I saw someone else drinking their milkshakes and they looked gooood.\n\nI would say the only drawback is the long long line-up, but one would expect that for any decent brunch place. That being said, the staff treat you well while you're waiting in line and do their best to get you a table as quickly as possible. I might mention that they also have comfy couches for you to lounge about on whilst you're waiting for your table.\n\nIt's safe to say that I quite like this place and I think it's a very welcomed addition to the St. Clair West neighborhood.","useful":2,"funny":0,"cool":0},
{"review_id":"Qv1KfesIzJOsWvXhsUY79g","user_id":"ttIye9qeDzYZZVMyjqq-RQ","business_id":"YLPNiyf3rVKINhT1CvTeZw","stars":4,"date":"2014-07-07","text":"Jerk King is one of my favourite take-out joints in the city. I know it's not super fancy and the furniture is a bit haphazardly selected, but there's something very earnest and loving about it. Highly recommendable are the oxtail stew, the jerk chicken and the fried chicken. You will not get better fried chicken in the city for this price (unless\/even if you make it home). It is juicy, tender, well-seasoned and always freshly made. One bite and you will know that this is something the chef takes great pride in :)","useful":0,"funny":0,"cool":0},
{"review_id":"l_hwXQfUmq0pjeV_QcduBg","user_id":"POM_ZWp-cN2zp181Nhy5Zw","business_id":"Sovgwq-E-n6wLqNh3X_rXg","stars":2,"date":"2012-02-14","text":"Impeccable service, but it almost seemed like there was at least one person hovering around our table. We had the guacamole that was made fresh at our table, and it was really good. \nMy husband had the carnitas, and he enjoyed his meal. I had the combo plate with a beef taco and a cheese enchilada. The beef taco was okay, but very greasy. The enchilada was a disaster - congealed cheese - and tasted bad.","useful":0,"funny":0,"cool":0},
{"review_id":"f39vaV6_Z_U2-ugRYlsTsQ","user_id":"tXDS4RBNsBxknN51gs9c7A","business_id":"vVpn8kkosTFuW-ZpRrD08w","stars":5,"date":"2015-08-28","text":"Okay guys, I haven't had the best luck with hair salons lately so I decided to take it upon myself to do my own hair... Guess what... Bad idea!! If you're looking for a trustworthy salon that WILL NOT destroy your hair then I highly recommend Bombshell Hair & Extension Co. !!! Aside from completely fixing my horribly colored hair I felt so comfortable, I highly recommend this salon. \nBrianna had done such a wonderful job on a trim keeping my length and a color correction to a gorgeous light brown\/blondish color, I will keep coming back without a doubt!!","useful":2,"funny":0,"cool":0},
{"review_id":"as8YDvIxjGG2KxJk9IWVVQ","user_id":"MUGqSxbqzdTzvwaqNeuIGA","business_id":"xbcKJ2q6Z59QH4DtKJ18gg","stars":5,"date":"2011-08-08","text":"Pick Your Poison is a unique and fantastic cupcake shop that offers everything from Blueberry and Gin cupcakes (made with FRESH blueberries) to Margarita cupcakes (it will confuse your taste buds at first, but you will think you are sipping a margarita with salt and LOVE it) to the Banana Cream Pie cupcake. There is not only liquor based cupcakes, but beer, wine and many others! I love how you can order shot sized cupcakes, to ensure the friends at your parties will get to enjoy more than one flavor. Also, depending on the event you are ordering the cupcakes for, PYP (Pick Your Poison) will design the cupcake to cater to your needs. These cupcakes are the newest and hottest thing out there and you will love the owners of the company! They are extremely helpful and I will always recommend this company to anyone I meet. AMAZING!!!","useful":2,"funny":0,"cool":0},
{"review_id":"RX3fX2eRwwKnHC8KI_dnMA","user_id":"MUGqSxbqzdTzvwaqNeuIGA","business_id":"0InA3Ffj8MxyQV9hgsyYcQ","stars":5,"date":"2012-12-27","text":"My husband and I frequent pizza places all around Las Vegas. We went to Novecento for the first time today and fell in love with it. The white pizza with our additions of pesto, ricotta and an Italian salami was so delicious. The staff was very helpful with guiding us to what we should put on our pizza. The ingredients were very fresh. The establishment was super clean. Our food came out promptly while we were just finishing paying. I would come back again and again!! The pizza was amazing. Dine in or take out soon because this pizza will blow your mind!","useful":0,"funny":0,"cool":0},
{"review_id":"kUA-I_NXzO6Lce09If_-cw","user_id":"tTnFHscTvbWy7uOq_USA0w","business_id":"fja2EnaSxKu1D7uctMhw-w","stars":5,"date":"2015-10-09","text":"5 Stars  outstanding service and food was outstanding . A great place to have a special dinner","useful":0,"funny":0,"cool":0},
{"review_id":"IPS2OGKxq4IN60bEktTpUA","user_id":"tTnFHscTvbWy7uOq_USA0w","business_id":"LwQB9H3jZ9wTk24Lr-AnZQ","stars":5,"date":"2015-08-29","text":"Dinner was outstanding , service top quality and food 4 stars great place to have a meal","useful":0,"funny":0,"cool":0},
{"review_id":"mL2PhicomvZ02MOiTSahNg","user_id":"tTnFHscTvbWy7uOq_USA0w","business_id":"Xj7DIGRHEchJ-VVdISazQQ","stars":5,"date":"2014-09-25","text":"Outstanding \nFood we had 2 lunch salads it was fresh and light great mixture \nDrinks margaritas  were top notice\nService 5 stars \nCleanless  I really like the fact that I saw hostess wiping down menus it a sign of a top notch restaurant   \nA great Mexican restaurant on the Aria casino\n\nThe panda reviewer","useful":0,"funny":0,"cool":0},
{"review_id":"xPeOk4BGf3v35oiq1x8Q1A","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"dn51F67VLgPuqy_8SFk9oA","stars":3,"date":"2016-02-28","text":"The food at Ellis Island is quite decent. Prices are reasonable and my favorite \/ the grilled Salmon is acceptable.\n\nOn the down side there is always waiting ... We had to wait 20 minutes when half the dining hall is fenced off and closed. They could easily open increase capacity immediately by opening the hall.\n\nMy dining partner was upset as she tried to get a new bottle of catchup ... Twice calling the waiter no response.\n\nThe beers and house selection is very respectable. Some day I may raise number of stars... Based on this consideration ...\n\nAlso it is important to go at the right time. The bad singing and obnoxious noise of the worst Kareoke bar in town ( most bad Kareoke  singers and drunks attempting to remotely sing) drive most serious dining customers away. The ordinary sober diner, person with a sound mind,  could not tolerate ( and would not) this type of Kareoke NOISE.","useful":0,"funny":0,"cool":0},
{"review_id":"ZnRZYTB4PP9i2fK98BSdww","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"iA8Ve2sZKN5Vz3mYKrtCaQ","stars":3,"date":"2016-03-12","text":"I agree with the reviews above- this Thai restaurant is not as overrated as Lotus of Siam.\n\nThe menu is extensive and somehow impressive. It accommodates to tastes from the heaviest herbivore to the heaviest carnivore, and allowing some options for the fungivore as well.\n\nMy friend Linda, ordered a beer and a hot saki - satisfactory to the casual diner who orders a couple of drinks with the meal.\n\nShe ordered the Vegetable Delight and I - The Tom Yu Chicken Soup with Tofu. While after sampling both dishes, they are not extraordinary to me, I will give them a thumbs up.\n\nI was a little irritated of the indifference from the three waitresses. While they were a little busy tonight Friday, it is not that they had a full house ( there were about six tables ) and they couldn't even bother to walk by our table to check how we were doing?","useful":0,"funny":0,"cool":0},
{"review_id":"25kVfa_-jKBM73ewDugDfg","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"_vHI2zsJp7b02MFJUWJgbw","stars":5,"date":"2016-03-05","text":"Greatest selection, pastries are always fresh.\n\nThe hardworking Chinese couple \/ pastry chefs bake every item in the store fresh from scratch every day.\n\nMy favorite are the crispy egg custards.\n\nPrices are not cheap because of their location - heart of Chinatown.\n\nBut I go for an occasional treat!","useful":0,"funny":0,"cool":0},
{"review_id":"F0zQLIFNcwpkD0ISpIqVCA","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"Mr6GsFxfTNkWUJO4nBWpLg","stars":5,"date":"2016-02-21","text":"Friendly service. Hairstylist and partner\/manager offered me drinks.\n\nTG was willing to stay later hour, after my very messy day at work, to do a color - roots touch up\/ bleach on me. Great work, professionalism and patience.\n\nChairs and waiting sofa are comfortable. Walks-in are welcome. Very friendly and courteous service.  \n\nThe salon is spacious, clean and neat.  The Pandora music background is a plus.","useful":2,"funny":1,"cool":1},
{"review_id":"ZVT3rzTCXvKWZ81axTQFRQ","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"_Jt596tjji2NG9tKhIsW2g","stars":5,"date":"2016-02-21","text":"This is one of two reviews. One for Nick - this one... And another one for Kelsey, separate from this one. \n\nFirst of all the shop is neat with plenty of comfortable waiting areas. Parking is easy. Jewelry selection is decent m, which contains high quality pieces- a lot better than other places I've been to.\n\nNow, back to Nick!\nHe's professional and a very skilled piercer. He is a little bit on the perfectionist side, so that might irritate some people. \n\nNick did a 6 gauge septum piercing to my very short and tiny Asian nose that I have. A lot of piercers in Las Vegas and in Los Angeles don't even have the skill level to do that.  I like the result and am quite happy.\n\nNick suggestion of Jewelry fits my need and taste. ( Hollow 6 gauge tunnel )\nHis aftercare advise and follow up, all factor in for the five stars. Two thumbs up!!","useful":3,"funny":0,"cool":1},
{"review_id":"6h7tKlO9e9HXHR9FHRjcVA","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"ANKg6kIfJn5kRsc1HrBdDQ","stars":3,"date":"2016-03-06","text":"I agree with other reviews about their reps not being the friendliest folks in town.\n\nThey are overworked and grumpy. \n\nNonetheless, FedEx offers better service than the USPS - although the price definitely higher","useful":3,"funny":1,"cool":1},
{"review_id":"sMjF1WYHpObNrbR69YSjKg","user_id":"lBB9vGP-9yhT9ExP1egUCg","business_id":"_SzR2YKGpzdU3xC7VwaJGw","stars":1,"date":"2016-03-06","text":"This review is directed to management and corporate more than against the employees.\n\nI shop at night to avoid long lines. Being a 24 hour store I expect the same respect and appreciation whether I go at daytime or nighttime or any time. I am the good customer and a very avid shopper. I walk out of the store with carloads.\n\nIt bothers me that checkers are NOT available and am left alone to self-check.\n\nI talked to a floor supervisor \/ manager last Thursday night as I was shopping. He promised I will assisted with my checking out. Broken promise!\n\nWhy can't they cross train there employees? Too hard for them to multitask? There 4 customers in the whole store and about 20 employees stocking.\n\nPerhaps, it's best for me to consider shopping at Amazon.com - that delivers to my house NO SHIPPING COST.\n\nA negative one star if possible. Maybe they don't even care.","useful":2,"funny":0,"cool":2},
{"review_id":"G3zyJEo08YTDAEqakfGaRA","user_id":"rpeeFpnz5cPgxdPvcYPCxw","business_id":"JcTIqoWO83FfEI9PJJHMfw","stars":2,"date":"2016-11-01","text":"I think the first time I shot here was maybe around 10 years ago, and I went yesterday for the first time in a while with a brand new shooter. I can't believe how much they have raised the price. When we first started coming here (me and my family) the price was less than half of what I paid yesterday (for the exact same thing) and it used to be a place that you could tell the locals went, the serious shooters. It now seems that the focus is towards tourists (and taking advantage $). The person I brought with me (who was completely new to guns) even commented about how expensive it was. The customer service was ok, but not as good as it used to be. We probably won't be back :(","useful":0,"funny":1,"cool":0},
{"review_id":"nGp885cgawNiVi58ZsQfhw","user_id":"BGjzzMLEVacauyTAQe964Q","business_id":"YLFWo3hEZyT6Vp2q7RrpQQ","stars":1,"date":"2011-09-07","text":"Oh my gosh - Always H.  I had the same exact experience you did.  This is the worst company ever.  They have a lot of reviews on the better business bureau and they are ranked D- (yes, that's very bad).  \n\nThat guy Greg Dawson smooth talks you and you think its going to be all better, but you end up getting screwed.   You're almost at the end of your contract, and if you don't feel like you will be hurt by them over the next couple of months, wait until November \/ Dec and send in your NOTICE TO TERMINATE.  Read the fine print, I think you need to do it by cerified mail.    I lost thousands of dollars using them as my property manager.  I now manage the properties myself and it is going MUCH better thank you.","useful":21,"funny":1,"cool":0},
{"review_id":"Bt-d0iupFM64yRzbA9l2BA","user_id":"BGjzzMLEVacauyTAQe964Q","business_id":"IbR9sLnnR-qU6tXrw_LdlA","stars":1,"date":"2016-08-11","text":"Very hard to schedule a time to visit and they were not upfront about the fees they charge.  Not for me","useful":0,"funny":0,"cool":0},
{"review_id":"Y0e5C2iA3plWHdaYawnMyQ","user_id":"LvpV1eWeHoPVzzRribxGCA","business_id":"RHhjgjO1gVmO_xGCUYqLwA","stars":2,"date":"2013-05-06","text":"Don't get the nachos. $12 with guacamole and it looked exactly like the nachos bell grande at taco bell, just with out the meat and 3 times more expensive. They also took 45 minutes to come out, and arrived cold, soggy, and disgusting. I can make my own store bought chips with canned cheese flavored sauce much faster and for much less money. I would have much preferred taco bell. When the waitress came to give us our checks I told her and she responded with \"I wish you would have told me sooner\", meanwhile that was the first time she came to our table or was visible since taking our order. Slow and somewhat unfriendly service, bad food. There was barely anyone in the entire restaurant and I am not hard to please. My friend did have the chicken tortilla soup, and that was very good.","useful":4,"funny":0,"cool":0},
{"review_id":"1DmJqJD1V67k83GHZoCW_Q","user_id":"IZt19zYejTKS4DkqXzEpag","business_id":"yJRFIA3-JOjOxLloejG1Jg","stars":5,"date":"2013-05-24","text":"Thanks for bartending our 2012 PAX Holiday Party! Your Candy Cane Cocktail was excellent, and I'm a new fan of your Virgin Bellini. Thanks for making our party so special, you were truly the hit of the night.","useful":3,"funny":0,"cool":1},
{"review_id":"e5ninGk9WNPHHQJ1Pcivxw","user_id":"nRh1-FGdc2rFA9nhJgpuxg","business_id":"8F-UdXe_YylX3k0L1SEiRg","stars":3,"date":"2009-07-30","text":"+ open 24 hours!!\n+ real close to the strip...less than 5 min drive\n+ large restaurant which means lots of tables\n\nfood wise -as most have said- isn't anything too impressive..but considering this is VEGAS....i guess its good enough for vegas =)\n\nI really liked my eggroll dish i ordered (the fried eggrolls you wrap w\/ lettece).\npho itself did lack a bit of flavor...\n\nall in all...if you get tired of american\/fusion food...and you're craving some MSG...this would be a decent place to go =)","useful":1,"funny":1,"cool":1},
{"review_id":"r_QCzyjh6K7SbcOJQQr4ew","user_id":"acY_FTrKfnwsQ5yYyZnLrA","business_id":"xaFzCJe82C4N7t4zeCo3hA","stars":1,"date":"2017-12-10","text":"Had a new menu but limited it to next to nothing.  Complete disappointment as had heard good things, but when you can't even have a complete burger menu, extremely limited entree menu it is not worth the time.  Will not return.","useful":1,"funny":0,"cool":0},
{"review_id":"LLSkcGqJOIPJ3NbbgSP64g","user_id":"7o9U6JpHK9mpaoZwjmKPDA","business_id":"UcwWt3BmRUGgZ2-T55J9MA","stars":5,"date":"2015-06-15","text":"I moved to Las Vegas a little over a year ago and went to several nail salons and was not impressed. Then one day I went here because it was close to my work. Now, every time I go get my nails done I come here. I have not left here once without being happy with the results. They take their time and do a flawless job every time !! Love this place !!!","useful":1,"funny":0,"cool":1},
{"review_id":"eznYFQG_n6VB_WNCLXqYMQ","user_id":"FJY1hdMkHFsFzUIkeeHwzg","business_id":"d_cDUNNrt7046lrxAE04vA","stars":2,"date":"2015-05-21","text":"I've been going to this fairly new DD for about 6 months now hoping things will improve, but the service and coffee is still very inconsistent. They can't seem to get the dark roast coffee right. Sometimes it's good and others it's terrible. I don't understand why they can't get something as simple as a cup of coffee correct, but I think they may be struggling badly with employee turnover. The sign front always says they are hiring.","useful":0,"funny":0,"cool":0},
{"review_id":"VGjDEqQrgU_ycm1pqdc0Hw","user_id":"xbdBrqQ3eMMiqFn5kyidKw","business_id":"iA8Ve2sZKN5Vz3mYKrtCaQ","stars":5,"date":"2011-05-13","text":"My favorite Thai food restaurant. Their soy meat is soo good, and their Penang with soy duck is to die for. I would eat here everyday if it wasn't so far from my house. It's a must try for everyone!","useful":1,"funny":0,"cool":0},
{"review_id":"Ex6LP05cYiSI-g-2M9tlTA","user_id":"J3qaaE_lH0Cygq1DiIA1AQ","business_id":"Kzvhvk8QEde7HeTmYicDwg","stars":4,"date":"2013-01-12","text":"Cool mall but needs an update, not to many good stores now","useful":0,"funny":0,"cool":0},
{"review_id":"2lVXrEHRayZMO2DW6XlGIQ","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"u84eyOBILlFQIc8fMFCoig","stars":2,"date":"2015-09-04","text":"Sandwiches are tasty. Usually hastily put together and often wrong if asked for something different to be done to the item. Salad bar has an impressive selection of items available but pretty pricy in my opinion. Restaurant is very clean. Staff is friendly until we pointed out sandwiches were incorrect. They redid them and they were still wrong, didn't say anything the second time, we were on our lunch hour and didn't have time to wait for a third sandwich to be made. This has happened more than once.","useful":1,"funny":0,"cool":0},
{"review_id":"Q0pJDBhNp_16jHtzyovpdw","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"0qh5uSAUDcVzC6hoPsAPvA","stars":3,"date":"2015-09-04","text":"Seem to remember it tasting better when visiting in South Carolina. Was disappointed by it when this store opened in Madison.","useful":0,"funny":1,"cool":0},
{"review_id":"0auHIfD6xfNg0ZpktqnOVQ","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"f5QhYrr6uSf-SMlMaXUhsg","stars":5,"date":"2015-09-04","text":"Love bringing my dog here! They have a nice selection of treats for him to choose from. Only downside is not too many \"tough\" toy options. Plenty of other toys to choose from, my guy is just tough to shop for! They have a nice selection of cat trees, beds, bowls, water filters, jackets, etc. it is always a treat when I have my lil guy with me and we get to stop in. Plus he loves checking out all the kitties and they don't seem to mind!!","useful":0,"funny":0,"cool":0},
{"review_id":"K1lrDtw30cm9IhRMsD4BgA","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"19LMPCmoRpn7TG5QybeL5g","stars":4,"date":"2015-09-04","text":"I suggest you call ahead for a reservation. I have been here several times and have seen tons of people try to walk in and get turned away because the facility is always busy! They usually have time to fit them in later but it is also in my opinion rude that so many people just stop in without planning ahead. It gets in the staffs way of being able to do their job and is inconsiderate to the other people who planned ahead. If you make a reservation the staff always gets you in on time! I have been very happy with all of my mani pedis and the employees are very nice. Prices are a tad high but sometimes worth it when you find a place you like!!","useful":0,"funny":0,"cool":0},
{"review_id":"VluSmLAZ6TOnxsjETnfGbA","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"oulsa6dpDsheXPQ5nluB1w","stars":2,"date":"2015-09-04","text":"We use to like this facility very much. The staff is very pleasant but eventually our dog would come home from daycare or boarding stressed and anxious. Like he wasn't getting all the attention or play he needed. It is not an \"open room\" daycare facility the dogs are kept in their kennels and let out for their play sessions. \nHowever the facility has also been very accommodating when we needed. Allowing us to drop our boy off early. Also when he had an accident and needed close medical attention he was able to hang out at the front desk with the staff. \nThe building could use some fixing up\/ cleaning, otherwise charming decor.\nOverall if you have a lower activity dog I think this would be the right place for you.","useful":3,"funny":0,"cool":0},
{"review_id":"GoEl-_KgGnlu-cTBWG8ReA","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"FUX9h1a37GJn9ge1baiNuw","stars":5,"date":"2015-09-04","text":"My favorite place to grab lunch or coffee with friends! Owners are so nice and really go out of their way to make you happy. Food is delicious. All of it!\nOnly downside is I wish they could take cards but I understand it is a small business.. \nHighly recommended!!","useful":0,"funny":0,"cool":0},
{"review_id":"zuyXm8Q0MhFAw1kIfLLL6A","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"IpLvJEjb4AN8eWq5NE2TVA","stars":5,"date":"2015-09-04","text":"Love the food here! Always delicious and their happy hour prices are great, I always get the flatbread pizza. Beer is delicious and they have something for everyone. Also if you work in the mall they will deliver your food to you! Great for when someone calls in and you can't leave the store to get dinner!! \nService is always excellent and I recommend it to a lot of my customers passing through openly talking about where to go for dinner or lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"4yFAnSGhjV6jGAldYWhtKQ","user_id":"B5ZNE8-c_zwJ7ooOYOECEA","business_id":"9texmj-epVQVWDsCtIlIFQ","stars":5,"date":"2015-09-04","text":"Best place I have ever taken my dog for daycare\/ boarding! Prices are extremely reasonable and facility is spotless! I have taken my boy to many other places and they all wreaked like urine and he always came back stressed and anxious.. Not at PINEVIEW! He is so happy when we get him and he is exhausted from play. It is also nice to know that the boarding facility is connected to the vet, just nice to know that if anything did happen you know he could receive the care needed right away. I could not recommend this place enough! We will continue to bring our dog here for many years to come!!","useful":3,"funny":0,"cool":0},
{"review_id":"eW_Zg9Hl-8S99Rybqm5Dbg","user_id":"qfQSP1X7HFfh2XF80KqrAg","business_id":"hqvqLihniz0ynit9c36JHg","stars":5,"date":"2016-08-01","text":"Super bomb!!! Only all you can eat Korean BBQ & Sushi place in town. Derek was awesome hooked up all the grilling and gave all sorts of recommendations.. Brand new reopened under new management... Can't wait to come back!","useful":1,"funny":0,"cool":0},
{"review_id":"GhfLnc4TzBtBJvN7KwSpxg","user_id":"qfQSP1X7HFfh2XF80KqrAg","business_id":"adtEYGplWAteWaH9XONXmQ","stars":5,"date":"2016-03-11","text":"Can not believe how awesome this show is! Cameo puts on one helluva show... Most certainly a funky good time!!!","useful":2,"funny":0,"cool":2},
{"review_id":"u81GUlgJ4xHz6PS44y2xDQ","user_id":"YO7HGE7sz6LaSD-Cuz4yTA","business_id":"hnMdGajgg2083rWrxDb50g","stars":5,"date":"2017-05-08","text":"Professional, knowledgable, and organized. I highly recommend Allison Jung!  She helped me purchase a home, and the service I received was ABSOLUTELY OUTSTANDING!  She knows her business, thoroughly understands the buying process, and kept me informed every step of the way.  She accommodated me while I was living in CA and looking at homes in Las Vegas. Although her office is in Henderson, she willingly traveled without hesitation across town to the Northwest area several times to show me properties. She was always prompt in setting up viewing appointments, (which is important with how fast houses can move in this market). All around professional, always on time to showings, very informative, (it is clear she know the business well takes pride in her work). Although I'm sure she has many clients, she always made me a priority to was very responsive and prompt anytime I reached out to her with any questions or concerns.  Thank you Allison!","useful":1,"funny":0,"cool":1},
{"review_id":"nYVq7_EoGnTzXJCMNc5MEQ","user_id":"YO7HGE7sz6LaSD-Cuz4yTA","business_id":"VXzBT1QMeast6celkQpcQg","stars":1,"date":"2017-03-25","text":"Under new ownership. Remodel is nice. Made an apt to get manicure & pedicure. A male did my nails. Despite my apt I had to wait 10 mins. Did a terrible job. Filed my nails uneven, did a poor job removing my cuticles, and also didn't come close to polishing my nails close to top edge of my nails. Also his nails were DIRTY and unmanicured. It seems like since he works in a nail salon and does manicures,he'd put in an effort to keep his nails at least clean if not manicured. Overall bad experience. I won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"I-nSURtZ3zkbuTxmBZP7ow","user_id":"MmlSolB_N7YfG6EVK9ZwJw","business_id":"tSLMmMlleVKnXs5kVih23A","stars":1,"date":"2016-02-03","text":"If I could give them 0 stars I would. I am on hold with them as I'm typing this. Tried to book an appointment yesterday but was on hold for 30+ minutes. Trying to book an appointment now and I'm standing strong at 28 minutes on hold. She answered at 13 minutes and immediately put me on hold again. Whenever I go in for appointments I have to wait at least 45 minutes to actually be seen and the doctors are rude and unprofessional. It's definitely time for me to find a new doctor.","useful":6,"funny":0,"cool":0},
{"review_id":"k2cKunydWNN6QEvIjY2y_g","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"iNhP0ejUf2jVzaR5YCOoEQ","stars":3,"date":"2013-03-05","text":"sunday night dinner, and not a busy restaurant at all.  not a problem at all!  it was my first time visiting this restaurant, and while waiting for my friend, i was welcomed to sit at the bar while i waited.  wasn't a fan of their rail gin, but was very happy to see something on the shelf that i liked.  gin and tonic it is!\n\nbah, forget the play by play.  it's a 3-3.5 star for me.\n\ni haven't been to italy, i haven't searched out \"proper\" italian restaurants in toronto, but as one other poster wrote (can i quote?  or will this post be removed because of plagiarism?)...   well CHERYL C. wrote \"...If you want poorly done Italian-ish food in a very 1988 atmosphere, go.\"  i LOVE that she wrote that.  i couldn't have described it better!  except that i didn't mind the food at all.  perhaps it's not a \"real\" italian bistro, or perhaps the guys in the kitchen don't have that much hair on their arms, but the food was decent i thought.  i don't think it's right to compare it to the restaurants downtown in little italy.  i mean, this IS scarborough, right?\n\nbut i'll tell you why this get's a bit of a higher rating than some people have given it.  service!  they were friendly!  they were professional!  and really, the prices were pretty decent and food wasn't THAT bad.  would i expect better food when i get my butt to italy?  of course!  and that is why we're in canada!  it's a sample, not a mirror image.  hell, you can't even go to mcdonalds here in toronto, thinking it tastes the same in south america or asia!  it will be different.  don't believe me?  then get off the computer, and go buy yourself a plane ticket and taste for yourself!\n\ni will go back to remezzo.  i won't be running to go back, but i'll go back.","useful":1,"funny":0,"cool":0},
{"review_id":"0XteKOfewuRz8X2sPH3zcg","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"iGqGde420TlBrKcU43TEog","stars":2,"date":"2013-03-05","text":"uh oh...   i have a feeling all you \"fans\" aren't going to like me much.\n\ni'll try to give you only the details of my experience there (but it's not going to be short).  \n\nday\/time: sunday, 1:30pm\nplayers: myself, friend, mom, uncle, brother, his wife and their family (including three young girls under the ages of 6)  and, i'll let you decide for yourself if this info is necessary, but we're all asian.  stereotypes DO exist.  don't kid yourself.\n\nno reservations?  that's fine.  we were lucky enough that there were two 4 tops available side by side.  and it starts here.\n\nthe restaurant isn't that busy, people are finishing their lunches, and tables are freeing up.  but upon our seating, i notice two employees standing by the computer seemingly arguing about something, and staring at us (or maybe both were just staring straight ahead and we just so happened to be in their line of sight).  but i have a very strange suspicion that one of the two, was the manager\/supervisor.  no matter, maybe our server was wanting to go home or something, and now she had a table of 9.  no biggie.  but when our server came to the table, they asked very abruptly, \"so, does everyone want water?\"  no smile, no greeting, no enthusiasm.  well, it was a cold day, so i proceeded to ask around if anyone would like some hot beverage instead, so i asked our server, \"what hot drinks do you have?\",  shaking her head as if i was supposed to know their selection, \"tea, coffee...\" to the tone of, it's in the menu, take a look.  at this point, three people wanted tea already.  my brothers' family was still settling down with the kids, so they never had an option.\n\nwater's came by hand, without a tray.  not a big deal, but for the inspired decor, i would think a little \"higher end\" service is called for.  again, no big deal.  our server came back maybe 10 minutes later asking, so do you know what you want?  well yes.  we ordered a few apps, and i specifically ordered a grilled chicken on a bed of quinoa to start.  our server looked at me and said, \"that's a main item.\"  well, yes, i'm aware of that, \"...but is it possible to have it come out as an app so we can share?\"  our server walked away and muttered under their breath, \"well, i have to see if the kitchen can do that.  ...yeah, but the chicken takes time to cook.\"  really.  they went to the computer and ordered everything and upon passing by, i told them, \"we're not in any rush, don't worry about things coming out a little late\".  \"yeah, i already told the kitchen\"  yeah, thanks.  you told the kitchen by just punching in the order at the terminal which was on the other side of the establishment.\n\nfood came out (the apps).  everyone loved the humus, the felafel were quite nice (sauce lacked any purpose) and when the chicken came out, it was no thicker than about two centimeters.  not a big deal to cook right?  on the plus, our server did bring us more pita (i didn't look at the bill, so i don't know if it's on the house like bread?) i mean, that's great!  but they brought it in their hand, in some open parchment paper, and plopped it in our existing basket.  is that the restaurant protocol?  no biggie.\n\nless than midway through consuming our apps, yes, the menus were still on the table.  why?  ooooh, because our main course wasn't ordered yet.  so here's the server asking us if we want to order anything else.  of course!  so we ordered (i'll detail that after).  and i knew.  i KNEW at that time, that they wouldn't time the order.  i KNEW that the main courses would come out while the appetizer plates were still on the table.  and guess what?!  i was right.  so, we shifted, and piled, and re-adjusted who got to eat what...  with a bit of tetris experience, we fit everything, but food just wasn't in front of the person who ordered.  no biggie.  just eat, clear\/stack, and eat.  without even our side plates (which are a decent size) or app plates cleared, we finished our meal.  our server THEN decided to put on that smile and ask, \"how is your food?\"  well, the food is fine!  \"do you need containers to pack the extras?\"  sure!  so they brought us containers and bags.  \n\nthat's the sum of the experience.  all the way through, i noticed that all the staff had at least one disagreement with one other staff member.  again, is that management?  why is he pissing everyone off?  \n\ni'm a pure \"front of house\" guy.  i hate this about myself, but i just can't shut my eyes when i go to a restaurant.  in fact i openly admit it to my friends and family, that i'm the WORST person to go with (especially if it's western style service).  i'm not THAT picky, but if an establishment is looking to charge a fairly higher price for the style of food, trying to break the middle ground barrier of decor and supposed ambiance, you BET i'm gonna take notice of certain behaviors.  (if you look at my other reviews, there are some real dives, and i have no issues with that).  \n\nfood was decent!  and i ran out of space to wr","useful":1,"funny":0,"cool":0},
{"review_id":"nnPhRMIyXH0gh11Pa7AW5Q","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"kTHraDyzfXvW-98VT-P3mg","stars":4,"date":"2010-11-25","text":"red meat.  \n\nif those two words have turned you off already, then please don't read any further.\n\n24 hour steak.  yes.  24 hour.  so let me ask you.  what are your expectations?  what kind of service do you want?  would you like wine with your meal?  perhaps white linen napkins?  look, if you even have to answer ANY of those questions, then this place is NOT for you.  \n\ni don't remember who introduced me to this place, years ago, but i'm still very thankful that it's still here today, and that the staff have not changed over much.  i've brought my own slew of guests, to introduce them to this rustic looking gem.  some like it, some don't.  \n\nbeing in the food and beverage industry, and having to deal with health codes, etc..., but there's a time and place for those nit-pickers.  this again, is NOT it.\n\ni don't CARE that the tables and chairs don't match.  i don't CARE if i have to grab my food when i'm told to.  i don't CARE that only in recent times have they started to wear a uniform, and not bloody aprons (which i love to see anyway, 'cause i love hard workers).  and i sure as hell don't CARE if they don't smile at me, at 2-3am, when i'm undecided on my meal of choice.\n\nwhat i DO care about, is my meat.  my red meat.  i don't care much about the condition of the fridge that it's in.  i don't care much about what \"grade\" it is.  but what i DO care about, is the temperature at which i request for it to be at.  and let me tell you this.  if there's a secret that they have, to cooking the steaks as perfect temperature as requested, they need to teach the KEG.  \n\nso yes.  it's a little further away from downtown toronto.  but if you're a west-ender that won't take the effort to drive east, then stay to the west.  it'll save me the pleasure of waiting behind you, as your eyes glaze over the selection offered.\n\nprice?  can't be beat.  taste?  it tastes like meat.  which is exactly what it's supposed to taste like.  sides\/extras? don't be picky.   if you need to eat this, you need a bigger slab of meat next time...\n\ni've worked fine dining restaurants, i would like to think that i know what food is all about.  but this past september, on my birthday, THIS is where i had my birthday dinner.","useful":6,"funny":3,"cool":5},
{"review_id":"Lhurezyzoe8cHIoK7FpFHw","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"oWTn2IzrprsRkPfULtjZtQ","stars":3,"date":"2010-11-23","text":"...it really depends on what you define as a burger.\n\ni was fortunate enough to have the \"double-double\".  as verbally recommended to me by one of the brothers\/owners, it was this, or the \"priest\" which i was to have, as a first experience.  i had requested fried onions, ketchup, mayo, and lettuce as my toppings.  the cheese was part of the burger, but this burger alone, cost $10.16.  the friend who recommended this place to me (and was with me at the time), told me that i should try the fries as well.  alas, i didn't have too too much cash on hand, and was expecting a rather large burger (i wasn't all that hungry).\n\nso, what defines a burger?   is it the patty?  is it the toppings?  the bun\/hoagie?  or everything all together?\n\nthe meat (which i was told, is fresh ground every hour), was fabulous.  what some people would consider \"dripping of grease\/fat\" i must correct them.  it is juice.  wonderful meat juice.  one look at the inside of my bite, and i didn't see any visual additives to the patty itself.  i felt that i could actually TASTE the meat!  \n\nthe toppings.  well, what to say?  the cheese was not the greatest cheese, but did the job well.  one lettuce, ketchup, mayo, typical stuff.  the fried onions?  they were $1, and though it wasn't a lot it did fill the burger as a whole.\n\nthe bun.  ah...  the bun...  i feel as if this was the absolute downside of it all.  i'm sure they know how juicy the meat is.  i'm sure they know the size of the patty, as it leaves the capable hands of its maker.  but this just did not fit the bill.  it might be that it is an unpretentious burger (it should be, cause the meat is GREAT), but the bun was just a little lower than that.  i ate the burger there, and found the bun very sponge-y, quickly absorbing whatever liquid driveled out, and with the little pressure that i was holding it with, made the thickness of the bun to almost nothing!   i don't know how people can enjoy this, as a take out item.\n\nanyhow, i will frequent the burger's priest again.  i won't be running there, as some other reviewers will, but i hope that the next time i do, they will have my \"bun issue\" fixed.  or perhaps they'll offer me a fork and knife so that i don't have to have my burger with a bun, but that would cost more than having a better bun...","useful":3,"funny":2,"cool":3},
{"review_id":"xoJGuC3uI5yrlx6cVnPfEw","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"cUvCVDTnYosaf8dir936Ew","stars":3,"date":"2010-12-13","text":"let's take in consideration for where this place is located.  the closest intersection is at queen st. east, and parliament.  not exactly the best of neighborhoods to the north, but there is some smaller bustling joints around.  F I G S is just one of those!  but don't think \"hoitey-toitey\" coffee joints.  this is a breakfast\/lunch places, that exudes neighborhood warmth.  \n\ni've only ever visited here on sunday for breakfast, and i do so, because i'm otherwise not available to, but there is one very biased reason why i do visit.  the sole owner and operator, about one year ago, stopped through the market where i worked, and she was looking for ingredients.  and not that she is a regular customer, but what got me, was that she was searching for quality ingredients, and wouldn't settle for less.  we had a good discussion on food, and it solidified my opinion of what this place was like.  \n\nF I G S has your basic breakfast menu, with waffles, eggs benny, etc., but if you're lucky enough that they have any, there are some really nice homey greek foods, like the chicken and lemon soup.  beautiful way to start a cold winter day!\n\nit's not five star dining,  it's decor isn't one to rave about.  prices are worth what you get.  sunday mornings allow for free parking along queen, but it's family style and warmth are what fills this place up with locals.\n\nwould be a 3.5","useful":3,"funny":0,"cool":1},
{"review_id":"ltZ2EQ-IpvpG9RjWKEw_jA","user_id":"hFgYkJzdBhR1whLwuG6oUw","business_id":"JFfZDmNAoa_MHG16K2BY6A","stars":4,"date":"2010-12-07","text":"perfection?  \n\nif you're going to write a review, and tell me that it has flaws, then congratulations to you.  you should have the knowledge that they are human.  that would also reveal to some of us, that you have no knowledge of the physical workings of an actual restaurant. to be impressed with!\n\nanyhow, for face value, \"loire\" is a restaurant on the south east corner facing west of harbord, across from a gas station.  not the most ideal visual, while peering outside of the window.  but wouldn't you know it, that some of the best restaurants are always placed where no one else will find it?  \n\nmy first experience was for a special occasion, back in the summertime, when the patio was first built and used.  the patio was new enough, that there wasn't clear guidelines as to where a good table was, or how lighting would work, as the night progressed.  my memories of that, was of an absolutely beautiful dinner.  the one thing that will always stay in my mind, was of a desert that was made especially for us, as a request to the chef (JC), because of an idea that he had initially.  the service that night could have been better (could have used at least one more experienced floor staff that night), but they were just not prepared for the amount of guests that night.  fair enough, the economy was in a bit of a rutt, but it didn't reflect the meal!\n\nmy most recent, and second visit, was this past weekend (dec 04\/10), where our staff christmas dinner was held.  a table of 11 (and an early seating), allowed us to finish our meal with a bit of time left, which was perfect (considering two of the guests were late).  a few of us at the table had never had certain items on the menu, and were quite happy to try new things, and aside from oysters (which we know doesn't appeal to some people), everything else was well received.  i'm not going to get into the details of each dish, but i'll just sum it up by saying that the whole evening was fantastic.  [spinach and endive salad, trout tartare, market oysters with a maple\/apple mignonette][seared sea scallop, frog leg and veal sweetbread, duck breast and confit leg, butcher block of the evening was 10 oz. rib eye, and feature of the evening was braised rabbit risotto][banana bread, hazelnut creme brule, vanilla creme brule, peanut butter and chocolate mousse]\n\nanyhow, sure they may seem to have just a little less of minimum staff for front of house, but for the majority of the time, they worked like a well oiled machine.  easy going enough, and professional enough.  their private dining room will be finished soon.  two guys in the kitchen (in the back) doing cold foods and presumably desert, and chef with his sous, in the semi-open kitchen pumping out ALL that hot food, with good timing, and perfection.  wine list...   bah, don't worry about the wine list.  just let the owner\/somellier take care of you.  for dinner, we had an unoaked ontario chard, as well as a nicely blended red from loire.  both of lower price points.\n\none click on their homepage, and you'll see that they state that the restaurant is \"casual gourmet\".  it's nicely presented, and beautifully prepared home cooking.  but dining also is not only the food and the atmosphere.  it has to do with your table, and who is dining with you.  remember that.\n\nenjoy!","useful":4,"funny":0,"cool":3},
{"review_id":"-qT7I5-r6i58vNyikAaUbA","user_id":"jD19Y-AJgGD9CBt6vrYDoQ","business_id":"G9SOoi_tdUUeYLEzTRqPxw","stars":1,"date":"2015-10-01","text":"Great customer service, but the food was a bit lacking. After a few bites of the mac & cheese, I realized it was a bit sour and couldn't finish it. I got slightly ill later that night. Seems like a cool place, just be careful what you choose.","useful":0,"funny":0,"cool":0},
{"review_id":"l8ujBuM5mWMTdmY-OMIVqg","user_id":"jD19Y-AJgGD9CBt6vrYDoQ","business_id":"CJvN2k3gjR7JspTx21icTQ","stars":5,"date":"2016-11-13","text":"One of my favorite pizza places! The crust really is that good. Ive tried just plain cheese, roasted red peppers, and mushrooms -- all great. Make sure you get a drink though -- it can get a little salty. Best eaten fresh, not as good reheated later.","useful":0,"funny":0,"cool":0},
{"review_id":"fIGfk66L3Qv8JWY1Ac-U-Q","user_id":"jD19Y-AJgGD9CBt6vrYDoQ","business_id":"DGK2scJteV6vyvJ2xeOYag","stars":5,"date":"2016-11-13","text":"Have been here multiple times and always get the veggie\/hummus wrap with house chips. Love it every single time! Everyone that comes with me raves about their burgers and other options. Never disappoints!","useful":0,"funny":0,"cool":0},
{"review_id":"nzwCE5AutMItsiAfC3JEyg","user_id":"jD19Y-AJgGD9CBt6vrYDoQ","business_id":"ZLanOvPw7BscWDo0yC8Ncg","stars":5,"date":"2016-11-13","text":"Great vegetarian and non-vegetarian options! I usually get the falafel\/hummus wrap -- always delicious! Both dine in and carry out are quick!","useful":0,"funny":0,"cool":0},
{"review_id":"pAC6WeYRw4h-A_sr9xrWnA","user_id":"jD19Y-AJgGD9CBt6vrYDoQ","business_id":"DdZo9MKaDrh9OJnpVwbBUA","stars":5,"date":"2015-10-01","text":"Amazing! Just had the farmers plate - my first time having plantains. Insanely delicious. Will be back again!","useful":1,"funny":0,"cool":0},
{"review_id":"ogV3AnoXs2ap4Q8EwJMTbQ","user_id":"GBaJmSwxzVSXJe4AeDFl3A","business_id":"2JU7FRlnYgdRauYyFzHSLA","stars":5,"date":"2011-07-22","text":"Tried chicken fingers in different places, but none come close to the chicken fingers here! Wish they had a better parking area.","useful":2,"funny":0,"cool":0},
{"review_id":"qCQcrajHgBkgxJfTFOVMYg","user_id":"TSBKIRMjFEVH4_FEBAV28w","business_id":"9d36_PI9Fh7kZ-Pybr2QiA","stars":5,"date":"2014-07-25","text":"A good place to hang out. There's live music. The employees  here are very friendly. They have good hookahs here and its real smooth.","useful":0,"funny":0,"cool":0},
{"review_id":"y--ZifPBgLd0GOFxAAD-Pw","user_id":"0hSChYYQQKPS0qksI4VtSQ","business_id":"7ep7mVds1lc5Ar7xPtdBDw","stars":5,"date":"2017-10-08","text":"Alan basically saved my Thanksgiving weekend from being wasted! I needed a BIOS update to be able to build my Kabylake system and with no profit to himself, he helped me find a place that would do it the same day. Came in super clutch!","useful":0,"funny":0,"cool":0},
{"review_id":"kNBWgk4zuAe0_QbQPGRWdQ","user_id":"0hSChYYQQKPS0qksI4VtSQ","business_id":"CjfsFcNnV62PWWFq7-ZLgg","stars":2,"date":"2017-10-19","text":"The most unauthentic Afghani\/Pakistani\/Indian food I've ever had. I bought the Nihari recently and it didn't look or taste anything like one. It just tasted like a normal beef curry. No thickness to the gravy, no tenderness to the meat, even the onion on the side wasn't the crispy caramelized version it's supposed to be. The gravy was also not consistent like it should be. It looked like it was stored frozen and heated up for me. Which brings me to the next point. Why does it always take 15 minutes to serve any item? If the food was made fresh everyday, it would be in a big pot waiting to be served but that doesn't seem like the case here. Not gonna knock on the naan because it's next to impossible to find the authentic Afghani naan in Canada and this is no different. The price they charge for the amount of food is okay, but the quality is just not there.\n\nThe one extra star is because the staff is polite and the place looks clean.","useful":0,"funny":1,"cool":0},
{"review_id":"_GBzcfcMDtIYEyBSDohFEw","user_id":"9JRutc13tfw5A2KS_GDP9A","business_id":"iDIKRW0P2Rg1O5Nh59x7ng","stars":5,"date":"2015-03-15","text":"Great burgers and a great menu to choose from. For less than 8 bucks you will be satisfied believe me. Inside is a little bit cramped especially if it's the rush hour when schools let's out around 3pm. Before sure to avoid that time.","useful":0,"funny":0,"cool":0},
{"review_id":"kYkkEMJBPSMvZ6Lcx06lEA","user_id":"9JRutc13tfw5A2KS_GDP9A","business_id":"TQ5uHmIZmcXBBYOR8pvH-Q","stars":5,"date":"2012-05-26","text":"Great place all you can eat, be sure to leave home hungry for best results...and also don't fill up on too much water...the waiter(s) don't hesitate to fill your glass back up.","useful":3,"funny":2,"cool":2},
{"review_id":"_7XxC8nA-qnLe6kYD6Wjog","user_id":"wZ4WmthDC15V6vTfspc3Iw","business_id":"qmIHO-6T_KEfPC9jyGDamQ","stars":5,"date":"2011-07-15","text":"I had a Great Dinner last night at JG's Steakhouse...Special Thanks To Chef Rob Moore, for the great Tasting Menu and Wine Pairing he prepared as well as too our Severs James S. And Joe!!!.... The Tunatartar is Orgasmic!! The Habanero sauce with the Filet... Out of this world n the desserts Ummm ummm umm that Keylime Pops-A-Rock as well as the Chocolate-Lava Cake!!!!!!Awesome\/ Fabulous\/ Fenominal Job!!! I Loved It!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"3zawWY1X2QeJSXHVnc7M1A","user_id":"wZ4WmthDC15V6vTfspc3Iw","business_id":"jas8f0efpFSDGMM4RIGzeQ","stars":5,"date":"2015-06-17","text":"Highly recommend my new friend DEBBIE from the moment I walked in she was very friendly... I didn't have to explain much as to want I wanted and she knew right off the bat what to offer me.. Love my wedding dress!!! THANKS DEBBIE, can't wait to be a bridesmaids to continue shopping there with your expert services.","useful":0,"funny":0,"cool":0},
{"review_id":"dB4m8gvaMsWZRsP4UeV7Aw","user_id":"IQSZOw91lQ1KYELbbSa9ZQ","business_id":"tGBeFfwXCUZOsb0YWiMWIA","stars":5,"date":"2010-09-29","text":"We go to Ka Chi weekly and it's definitely our go-to destination for a good, cheap and quick meal.  It's all about the pork bone soup it certainly measures up against everywhere else we've been in Toronto, so much so that I know that it's generally 53 that I'm ordering off the menu. The dolsot bibimbap is pretty awesome as well, plus you get all the assortment of side dishes.  I find this location better than the newly opened one down the road on Dundas and a nose ahead of the original location in Ktown.","useful":1,"funny":0,"cool":2},
{"review_id":"iAsnj_P15WjxqR7nySs5eA","user_id":"IQSZOw91lQ1KYELbbSa9ZQ","business_id":"3Zgo3Fi1DayoSkm89NweKA","stars":3,"date":"2011-05-23","text":"So we decided to try this place out since we had a friend visiting from out of town who was already around Kensington.   The service wasn't too bad, but the food took over an hour to come out to us since the place was heaving.  Pretty understandable given the size of the kitchen. I had the El Especial and the scrambled eggs were quite nice, cheesy and creamy like described.   The salsa and sausages were a little bland, but wasn't too bad.   The wife and our friend both had the fish fry and were kinda left asking where the rest of the fish was, but what do you expect for the price?  All in the all, not great.. but not too bad.  Ended up picking up pork rolls from chinatown because wife and friend weren't entirely satisfied.","useful":0,"funny":0,"cool":0},
{"review_id":"u1WO14XmUwtithIJfVHdEg","user_id":"o3BPfqlT5OZSwkr2KULDBw","business_id":"Bz75D7cx4bhHGuwc20IN1A","stars":3,"date":"2016-04-01","text":"Ive gone to this place for about a year now. Under the previous owners, the customer service and the food portion sizes were better. Whereas I feel like now its declining because of angry-ish servers who smother the oh so small bites of meat with sauce (which is pretty good though). The price to food ratio is pretty high compared to other pita land locations but they are not bad and conveniently consistent.","useful":0,"funny":0,"cool":0},
{"review_id":"IdqNE0u55AYzK3I70jV2Xg","user_id":"wgrgBJqggThV3esMtD_K0Q","business_id":"8kL_Z36p2HtSe6-lh0naEQ","stars":5,"date":"2016-03-28","text":"Amazing pub,run by a wonderful family (we had the pleasure to meet a few family members while we were there) great food, wonderful atmosphere.\nHad a wonderful time there. Looking forward to visiting there again when we visit our son.","useful":0,"funny":0,"cool":0},
{"review_id":"Yoi4dSLDxR45Bw9N-9O83A","user_id":"ufC40CcLcC0nSnSpFD-o0Q","business_id":"6TSpAuUdmo2UEn9emgd8xg","stars":5,"date":"2016-05-01","text":"I must say, the creativity of Stacey's menu was incredible.  My husband and I are drastically changing our diets and searched high and low in Vegas for some healthy choices.  Came across Simply Pure and my husband who has never had a vegan\/ vegetarian meal devoured the large sample platter. He said it was too good to be true.  Hope to find something of similar calamari in Atlanta.","useful":1,"funny":0,"cool":0},
{"review_id":"pdX4Jd1qWptjDY7gxXu_Xw","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"dLc1d1zwd1Teu2QED5TmlA","stars":5,"date":"2015-02-23","text":"One of the best placed in Shadyside I think. It's not the most glamorous place but the food is really done well for what it is. It actually tastes pretty authentic compared to others in the area and is spiced well. Reminds me alt of some of the street style Thai places in LA. Every noodle dish I've had had been very good. If you choose hot they actually make it hot. The pork buns are really tasty. Has a cool vibe and its byob!","useful":0,"funny":0,"cool":0},
{"review_id":"m8pg97vQTKcE-4LI-nd0FA","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"O40nlfiMpWAKgMx7bH9h6Q","stars":3,"date":"2015-02-23","text":"The grilled cheese come on the thickest bread known to man. So it looks like you aren't paying way too much for a $12 grilled cheese but you mostly just taste toast. There is a good beer selection and the pretzels are really good!!","useful":0,"funny":0,"cool":0},
{"review_id":"dw4szw2d6f66XSSopPUf8w","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"bit99XCHmJlYds9b4tXTEg","stars":5,"date":"2015-01-20","text":"Great studio! I really like this place. The two owners are extremely well trained instructors. All of the instructors are good for that matter and all very nice and friendly. If you have any questions about poses they help you out. The studio has an un-intimidating vibe and the classes are full of people of all shapes, sizes, ages, etc. it's very clean and has a nice shower room and bathrooms.","useful":3,"funny":0,"cool":0},
{"review_id":"UAQtSm98V1N1WZNlsagkmw","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"RvwZqjdkZ_pER0moPXLZAQ","stars":1,"date":"2015-09-21","text":"Just had a horrible experience here Saturday night. I've gone here several times because the food is good but I'll never go back now. The place is sort of dirty and the tables are always sort of sticky and grimy. I could overlook that and come back because the fish with basil is so good. This past Saturday I took my girlfriend here for dinner. We ordered a few plates of food and after eating ordered bubble tea. We were talking quietly having a good time (still in the restaurant a total time of less than an hour) and the waitress comes over and says \"You need to leave. We need the table\". I was shocked! There were several open tables and not many people waiting. I wish I could have taken my 20% tip back. I thought they're shitty service was based on me being some white guy but after reading others I feel better knowing there is no race or gender discrimination in their shitty service. Won't come back and spread the word to several friends and family members.","useful":0,"funny":0,"cool":0},
{"review_id":"2pbNYVpxJabriTIbSi9oIA","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"3hbWjpRzGQbqeu2W3zkW3g","stars":5,"date":"2015-08-19","text":"Had a great experience here. Bought a vehicle off of Jim Comer. Good guy that made sure I was happy with my buying experience. My dad went with me and saw how smooth it all went and almost bought another vehicle off the guy for my mom","useful":0,"funny":0,"cool":0},
{"review_id":"mj9HGYBx-YPERCNL1rAIlg","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"i-Vnm8CIDZS0G815HAKCSg","stars":2,"date":"2015-08-19","text":"In general Pep Boys sucks and is a rip off. At this store in particular the staff is some of the laziest you will encounter. Look forward to standing there at the counter waiting and waiting without being acknowledged for tens of minutes while people walk back and forth and do everything else possible besides even tell you that they notice you are there. I've been here multiple times because it's convenient and it's always the same. I gave it a two star instead of one because a couple of visits ago some older white guy actually looked at me and said 'wait a sec and I'll be back to ring you up'","useful":0,"funny":0,"cool":0},
{"review_id":"M_t52Q5JY0wRXvtD9kyXew","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"NtpdFakRhkqtQ85PIraSJA","stars":4,"date":"2013-10-07","text":"I went here last weekend to meet up with some old college buddies for drinks. I had a hard time finding the place since there is almost no signage and the windows are boarded up. I couldn't help but keep thinking of the episode of Always Sunny when they go to the gin bar! Haha this place is just like that! I just move to Pittsburgh from Los Angeles and found this place to be way over prices for Pittsburgh. The prices were the same as in Hollywood! With all that being said, I had a great time. The service was very good and they had a good selection of whiskey and bourbon. The place also draws a much better crowd of people than any of the surrounding bars. I will come back but I will think twice about ordering that last extra $20 glass.","useful":1,"funny":0,"cool":0},
{"review_id":"9U2RemyRJEnL8F-CCLJ_ig","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"vyeIc4jZz462XRKO2I645w","stars":2,"date":"2013-04-02","text":"I am visiting Pittsburgh from Hermosa Beach and decided to check this place out. I have been doing Hatha style hot yoga at a studio where I live and love it. When I got to this place I soon realized that there weren't real locker rooms or showers but changing stalls. Not a huge deal but it definitely is nice to shower after being drenched in sweat for over an hour. I walked into the class and it was packed! I didn't really have a place to set my mat! I squeezed in next to the wall which really limited me. The class should have really been limited to half the amount of students that were actually in there. The mat I rented was a little small so some positions my feet went past the mat onto the slippery hardwood floor. The teacher walked around some but didn't tell you how to do any of the positions nor did she point out any mistakes. I know I'm not perfect and accustomed to having an instructor point out things I could be doing better. The other thing was there are absolutely no mirrors in the place! How could you possibly tell if your are doing a posture correctly if you can't see yourself! To sum it up, I was just really disapointed and wouldn't recommend this place to my Pittsburgh friends.","useful":4,"funny":0,"cool":0},
{"review_id":"hL2sjEe8-Htv61G-O0rUJw","user_id":"-Kqj8RqA1bYs4El1MTCw5w","business_id":"amRD820E7_jnK8Ju42jnrQ","stars":1,"date":"2014-09-15","text":"This place is horrible. If my vehicle broke down in front of his place I'd have it towed to a different garage. I took it in for a simple inspection. He called me back with a mile long list of things. I told him go ahead and replace the two burned out tail light bulbs and tighten the control arm bolt that was loose. I came back to pick it up and had a bill that was charging almost  $100 in labor fees for changing those two light bulbs and looking at another bulb!!!!! He didn't tighten the control arm bolt because he said it would need an alignment so he preferred sending the vehicle off with loose control arms. He didn't pass it for safety inspection and we settled as me paying for the entire inspection even though he will charge me another $30 if I bring it back for the other sticker. I hope this place gets shut down. I thought Los Angeles was supposed to be the city of shady vultures...I guess it's called Shadyside here for a reason","useful":2,"funny":3,"cool":0},
{"review_id":"gGjpr4E0ZutA5SKx7y3eLQ","user_id":"Cqhp3afalLZv7QJcoPY3Yg","business_id":"PglC8rgguMIlT621p1BLdQ","stars":5,"date":"2016-12-02","text":"Wow!  This place is the best dim sum in town...in any town.\n\nMy husband and I just drove in from CA and we were starving but had a craving for Chinese, we yelped and everything was closing or closed  ( 10:15pm)  we found this place and saw ..15 min left till closing and gave it a shot.So glad we did! \n\nSo, we are avid dim sum waters back home, we have eaten everywhere from LA , OC to SD and this place takes it.Fresh, Fast and the service was phenomenal.They were kind and communicative.I was super shocked because usually other dim sum places they want you in and out ...sadly I expected this since they were almost closing ...but it was the exact opposite.They didn't rush us and in fact they kept asking if we would like more.\n\nThe food was fresh and tasty and the prices you can't beat, especially is you want to save some cash for the machines lol. Anyhow, so good , so happy !!! Great place and clean.","useful":0,"funny":0,"cool":0},
{"review_id":"m9fMDDX2iqPFnyH35iHNzA","user_id":"O6X3n_j4df5uA2LXSe2FIw","business_id":"GesqIhULA3Pmi0fkgLL_BA","stars":1,"date":"2017-04-02","text":"We have had 2 repairs on our dryer this week and we are currently awaiting a 3rd repair.  We had to wait 5 days for the first repair, 3 days for the 2nd repair, and it will be 5 days before the 3rd repair which we are hoping will be the final one.  You appear to have a bad batch of parts on your repair truck.  My complaint is that you are making us wait so long between repairs for something that is your fault.  You do not seem to accept that you should consider our problem an emergency when it has gone on this long. Routing takes no responsibility for getting anybody out here sooner. The repairman is nice and seems competent but he can only work with what he has in his truck and with the schedule that he is given.","useful":0,"funny":0,"cool":0},
{"review_id":"wLqVeBGCDTtKelgH9NkfJg","user_id":"8bUSLEwKp3oG3lDgkZstxw","business_id":"om7YKYOC-Dulqq4Bl5lRYg","stars":5,"date":"2015-05-05","text":"The staff was excellent.  Food was great.  They went above and beyond.  We would recommend this place to everyone.  We've never experienced this much friendliness from a restaurant owner and staff.  He held the door open for us.  Went out of their way to make us feel welcome and to make sure we were satisfied.","useful":0,"funny":0,"cool":0},
{"review_id":"XAyVqyvWUwZDNjKf7b5mAQ","user_id":"UVKEf2UA_j1u5nBwreTINg","business_id":"eZcCFV-8X91ZSnmB9807bw","stars":1,"date":"2013-11-15","text":"Upon entering the restaurant I patiently waited behind another customer who was greeted and taken to be seated. I stood in front of the hostess station for roughly 5 minutes without being acknowledged by the hostess, although there were numerous times where eye contact was made, there was no attempt to greet, acknowledge etc... At the point were she began to have a casual conversation with another hostess, I asked if she intended on seating my wife and I. She stated in a very short manner \"well I thought you might have been with another party that had already checked in\". A simple greeting and may I help you could have cleared any uncertainty.. My wife and I were then seated immediately by another hostess who apologized. I asked to speak with a manager and someone who appeared to be a waiter approached the table and stated that he was the manager and would address the poor customer service my wife and I experienced on what was our wedding anniversary lunch. He didn't seem to take my complaint very seriously and to top it off, once we received our food, it was extremely salty. I didn't feel another complaint would go anywhere so I kindly paid by bill, tipped the waitress Alisha and left.. I will never return.","useful":1,"funny":0,"cool":0},
{"review_id":"1JZE1W0JVbYin0-2m8DPNQ","user_id":"UVKEf2UA_j1u5nBwreTINg","business_id":"PQER4ba8Q0zqB1G2QiXamQ","stars":2,"date":"2016-08-04","text":"It's rare that I take the time to write a review, much less a negative one; but I could not allow such a horrible dining experience to go unreported. I, much like many others, look to online reviews when making the decision to visit an establishment for the first time. This has been a pretty reliable practice until now. The negative comments were few, but I definitely should have taken heed to them even though they were drowned out by the many positive reviews. I only wish that my family's experience were even the slightest bit similar to those that felt compelled to sing this restaurant's praises. Perhaps your personal experience is dependent upon the cook and wait staff on duty at the time of your visit... In any event, as a first time patron to the Black Bear Diner on Tropicana, I will never return. Upon entering the restaurant, we were seated immediately, that's where the positives end. Shortly after ordering our drinks, a very persistent fly or two buzzing around our table and our shooing them away seemed to go unnoticed by staff; this was my first opportunity to cut our loses and leave. Instead and regrettably, I ordered the Grizz breakfast, and my wife and youngest son the Spaghetti & Meatballs. In short, they were flavorless, cold and disgusting. My other son and daughter ordered the Western BBQ burger and Chicken Strips, fortunately theirs although nothing to write home about, were edible. The spaghetti and Grizz on the other hand were irritatingly horrible. The spaghetti looked and tasted as if someone poured ketchup over 4-day-old pasta and 2 day old, half-hazardly formed meatballs. Regarding the Grizz, the eggs were cold, flavorless and watery, which its still a mystery how someone can cook watery eggs; the meats were cold and salty and the hash browns were cold, undercooked and flavorless. The Pancakes were edible, until a fly landed on the plate.  I called the manager (Don) over shortly after receiving our food and he seemed utterly shocked that we were not happy with our order, stating, \"we are one of the highest rated restaurants in the city\". I found his defensive statement odd and completely detached from the fact that there were major issues with our order. He did however; eventually express his apologies and a desire to make things right by having something else prepared. Unless there was another cook to prepare it, I had no faith that it would be any different from our first order and declined. The waitress (Chrissy) came over to our table as the manager was there and asked if we needed anything. The manager mentioned to her that we were not happy with our meal and she gave us a look that made no effort to hide her irritation and walked away... That and the fact that the manager made no comment about her disrespectful actions was unbelievable and topped off what was already a horrible experience! The manager adjusted our bill; we paid and left completely feeling as if we just walked out of an episode of the twilight zone. I will never return, and to those that read this review and still take a chance with the Black Bear Diner on Tropicana, good luck","useful":3,"funny":1,"cool":0},
{"review_id":"_2KCAp8HjukjLDnCCUNr2w","user_id":"ED7dr4byBaF2OXN7XFSlTw","business_id":"Ws8V970-mQt2X9CwCuT5zw","stars":5,"date":"2009-08-08","text":"Gorgeous atmosphere, outstanding service, delicious whole food!! Not only is their tea out of this world, their food is unique and fresh!  It's so nice to finally go to a restaurant that actually takes time to create dishes, instead of just throwing them together.  My boyfriend and I were in the best mood during and for hours after we ate at this place.  We highly recommend it!","useful":0,"funny":0,"cool":0},
{"review_id":"563RmytlhKvWNOex_VrQTA","user_id":"ED7dr4byBaF2OXN7XFSlTw","business_id":"YbweWBgYj9T3VqMFJcQlOw","stars":1,"date":"2009-08-08","text":"The food here is simply disappointing, and leaves you feeling gross after you've eaten it.  It all tastes very processed, not fresh.  It may be inexpensive, but clearly you get what you paid for (or less).","useful":0,"funny":0,"cool":0},
{"review_id":"HSWrYY1atqJd3pXmVpAGjQ","user_id":"08CnDfMA2uv4Fn7xjMT0Eg","business_id":"u4TDplSvOi-3NEmkWHbRRQ","stars":1,"date":"2014-07-10","text":"Horrible experience, I literally got kicked out by the Dr. I had to wait an hour and the dr wouldn't see me cause my kids were there and being kids. I had no problems in California they got me in and out for my workers comp. I get penalized cause I have kids, office staff is rude and a new girl up front didn't even schedule my appt that I had she just looked like a deer in headlights the whole time. Very un organized. Smelled like an ash tray in there.","useful":1,"funny":1,"cool":0},
{"review_id":"t8JpzBgPVpz9NBX1hjirTw","user_id":"08CnDfMA2uv4Fn7xjMT0Eg","business_id":"h1Jq1YlqPyD1mGSW0sjRaQ","stars":1,"date":"2015-10-20","text":"To everyone unsatisfied with centurylink you need to complain to the BBB, I just tried to complain twice about them and get my money back they wouldn't and There needs to be more complaints It is the BBB in denver,CO, that is they're main office for centurylink. My story is soo horrible it is unable to be typed out again! But I will try to post a pic of how the tech installs service!!","useful":3,"funny":1,"cool":0},
{"review_id":"HdxqozUPUIjMy110KjmIVg","user_id":"08CnDfMA2uv4Fn7xjMT0Eg","business_id":"w-ZGg3GKsnuVxMmiZSeryw","stars":1,"date":"2014-12-28","text":"So i walk in looking for a Particular snake. I found what i was looking for, but the animal along with the housing were infested with mites. I asked the guy wit the tat's and piercing on his on his face- why is this snake full of mites ?\n\n His response was, that snake is being treated for mites- OKAY...\n\n I said no thanks. \n\n Why would you treat (if that was true) a snake who is \"infested\" with mites with another snake let alone on the sales floor next to all the other snakes\/pets. \n\n Ever heard of quarantine ? In a couple of hours- in a quick quarantine process, the animals and housing can look presentable. \n\n With all that said, i would not buy a animal from this establishment after seeing a snake in such condition.","useful":12,"funny":1,"cool":0},
{"review_id":"FNGZjLz0mPrReNCr8qmPkg","user_id":"08CnDfMA2uv4Fn7xjMT0Eg","business_id":"SoeZLbMF6oTFoCyBTCgzwA","stars":5,"date":"2014-11-18","text":"I had David work on my A\/C during the summer he was awesome and detailed, and I called back recently to ask for him to tune up my heater for winter, they said he is no longer with the company, why would you allow a great employee to leave??? Hard working employees are hard to find. I guess I will go somewhere else next time!","useful":0,"funny":0,"cool":0},
{"review_id":"_z9uEKeVaHrIWc-RMqAChA","user_id":"f1h9Xa8ZfR_GExfKbt2_eQ","business_id":"61Do3_JKSyzUr3T3nZRROQ","stars":1,"date":"2016-04-27","text":"Initially wanted to try this place because it looked clean and modern.\nPricing: Cheap for poutines at 5.99 each.\n\nService: Overheard them saying that the fries take too long to make.... ? It took 10-15 minutes to make though they apologized for the wait. Other than that, the servers were courtious.\nThe order: Ordered the original poutine and chili poutine.\nThe taste: Fries were dry and overcooked. The flavour was off and the poutine tasted nothing like actual gravy but more like rosemary and starch mixture. Tasted like turkey stuffing. Extremely underwhelming.\n\nThe verdict: Would not go back.","useful":1,"funny":0,"cool":0},
{"review_id":"7lfrVOtWfdoyJuFpguU4yQ","user_id":"f1h9Xa8ZfR_GExfKbt2_eQ","business_id":"e41TP5cXZqSrz50xCBJqZw","stars":5,"date":"2015-10-17","text":"I've been here multiple times and I have to say they never disappoint!\n\nI went with a friend to grab brunch and ordered two eggs benedicts, the pulled pork and salmon benedict (definitely the bang for your buck).\n\nThe food came quickly as it wasn't that busy during a Wednesday brunch hour. Our waiter was pleasent as they checked our table to ask about our food and took away our plates promptly.\n\nThe pulled porked benedict was phenomenal as always. The sauce on top of the pulled pork was addictive and made me want to ask the chef for the recipe. The eggs were cooked perfectly;  runny in the middle and cooked enough to hold its shape. The homemade fries coated in the homemade ketchup sauce which was perfect; tangy, sweet and comforting. The salad and the piece of fruit were a nice ending to such a delicious meal. My friend and I were stuffed by the end of it.\n\nOverall, this place is one of the best places I've been to for brunch! The stunning, comforting food and excellent service will keep me coming back for future brunch excursions.","useful":0,"funny":0,"cool":0},
{"review_id":"pZ6lLr744B_R_DrLG0L7oA","user_id":"vrxKBbnLIeRtVuZpITE6XA","business_id":"iOt7ebp4Zy-5YUjHL1rbmQ","stars":4,"date":"2017-05-30","text":"I like this place! I have had good experiences here although I've only been twice. If you were to compare any other places that have quick service (fast food) Backyard Taco has a much better quality of food. It's a little pricier than most fast food places but for the service and quality, it is worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"q6z15ueAehdLYay1PITyJg","user_id":"jnx3oDuQM1_eZCei6TXGFQ","business_id":"uGupeWqih0yIcCg8anM1PA","stars":5,"date":"2017-11-19","text":"This was my first time staying at the Palazzo and it was incredible. From the moment you enter the hotel until you get to your room it's a luxurious experience. The room was spacious and elegant with a beautiful bathroom. I would definitely stay here again.","useful":0,"funny":0,"cool":0},
{"review_id":"JHB_v4TZqYp3LMKs4EamTQ","user_id":"s-LXrZZp4uxsMz_Bvecu9A","business_id":"zaw43jYgK4BGuTaYn37qMg","stars":1,"date":"2016-11-09","text":"I used to come to this location all the time, as it is close to my house, and always had a good experience. Normally the smoothies come out quick and then it takes another minute or two for the food to catch up. Unfortunately the current group of employees seem to lack any motivation for efficiency or speed. I walked in and only one group of two ladies was in front of us. We ordered food and smoothies. It took around 25 minutes for our food, and our smoothies still weren't made. I ate my and finished my food while waiting for the smoothies. It took another 20 minutes for a grand total of 45 minutes for two smoothies. Seriously? I could have taught myself how to make our smoothies and finished them in way less time. For the nail in the coffin, the smoothies weren't even good. They tasted weak and watered down compared to what they used to be. Very disappointing.","useful":0,"funny":0,"cool":0},
{"review_id":"GocxvmQcfKjjvQ3BGDBrvA","user_id":"4WgNxEqEUR5ZfgJ8NldUXA","business_id":"iA8Ve2sZKN5Vz3mYKrtCaQ","stars":5,"date":"2010-03-23","text":"OMG.. absolutely, positively the *BEST* thai joint in existence! Calling their food \"delicious\" is simply an understatement -  no review could ever do this place justice. Their service is superb, staff is very friendly, the restaurant is well kept with beautiful, authentic thai decor, and, of course, the food is AMAZING! Never fails to hit the spot.. I've had the pleasure of enjoying many different dishes at Komol, however my fav is definitely chicken panang w\/ shrimp fried rice (garlic fried rice kicks butt too!!). And for desert, mango with sticky rice! Ugh.. writing this review is making me crave it. I think i'm gonna go tomorrow ;)","useful":0,"funny":0,"cool":0},
{"review_id":"ILA_X6c4vfI9U9VvFqfVgQ","user_id":"04LHrTMrsVDeyaY_k1OdwQ","business_id":"KA7pIWtRA5jRXxAQZ_DRYg","stars":5,"date":"2017-09-15","text":"Great food and great prices! I tend to go here once a week for either the shawarma or falafel in a laffa.  Both great options! Would recommend to anyone looking for some great middle eastern food!","useful":0,"funny":0,"cool":0},
{"review_id":"r3BUmcaP_dPp1fcEq-2LLg","user_id":"7C9-IcNs4Sxixm_moP-uMg","business_id":"C2bcAmwrfvj3tGezHTYGEQ","stars":5,"date":"2015-07-31","text":"I needed to have a receipt re printed and would like to thank Brina and the other staff at customer service that made this happen!  It was much more complicated than I thought it would be and they continued to work the problem until we got a result. Many thanks.","useful":0,"funny":0,"cool":1},
{"review_id":"c8GL2fakKL8QScpbOfx79A","user_id":"7C9-IcNs4Sxixm_moP-uMg","business_id":"RM2ICsmqeOF10WIdu4nyRQ","stars":5,"date":"2015-07-29","text":"My wife started coming to Align because Dr. Sabol works with patients with Menieres. We have been extremely happy with her treatments so far. I normally accompany her and wait in reception and have observed the most professional, supportive staff I have ever seen.  \nI saw a photo on this site submitted by Bobby A about the 'drill'.  This piece of equipment has been essential to my wife's treatment.  It has helped substantially with her Menieres symptoms. Nothing to fear there!","useful":0,"funny":0,"cool":0},
{"review_id":"wXBBHjzkLQYROhyCt9Ke0Q","user_id":"7DRgJuAiM2yGNlTEIYSDOQ","business_id":"SDSDJp-d_qUibvLF2FfsCQ","stars":1,"date":"2013-07-26","text":"I loved Glory Hole doughnuts even before I got to try them because, well, how can you NOT adore the name? When I finally had the chance to get them last summer on one of my trips home, I thought my love was well-deserved. They were so scrumptious, I was like a maniac trying everything I could get my hands on. So you can imagine how heartbroken I was when my sister brought home a box of them this weekend and I was greeted by doughnuts on steroids. They were almost triple the size of last year's which made the doughnut:glaze\/topping WAY off. Being a fan of yeast doughnuts and anything tasty that even vaguely resembles bread, I wouldn't have minded so much except that even the bready part was a bland, soggy, uncooked-in-the-middle mess. \n\nPlease, please bring back the Glory Hole days of yore. I remember my first bite of the Bread & Butter and I want to relive that moment!","useful":1,"funny":1,"cool":0},
{"review_id":"CvHfKHfA02IUDTusqPXQvA","user_id":"7FKqxzejffaevYTNd5xk4A","business_id":"9KBd2YPnRxaNjZz23TUd6A","stars":5,"date":"2012-09-27","text":"I still have sex dreams about the burnt marshmallow ice cream from this place. MMMMMMM.","useful":0,"funny":1,"cool":0},
{"review_id":"hehJGS2S3WwLQjTj2Doj4Q","user_id":"7FKqxzejffaevYTNd5xk4A","business_id":"SDSDJp-d_qUibvLF2FfsCQ","stars":5,"date":"2012-09-27","text":"Great staff, tasty doughnuts - especially the lemon meringue pie.","useful":0,"funny":0,"cool":0},
{"review_id":"ku1LIWf3WXCNibRogChMDA","user_id":"9OHLU6QWzQ97KiIUjjQhUQ","business_id":"QJ8nA9dgfJagX66238Ne5A","stars":1,"date":"2014-11-05","text":"I will never go back. Sat at the bar.  Bartenders were ok, but I looked at my online banking the next day & they charged me for my tab and someone else's as well.  I've never has issues with the City Tavern near my house but will think twice because of the mess now I have to go through to dispute this bill.","useful":0,"funny":0,"cool":0},
{"review_id":"Mie1UFDiaTRng8GiLSq5Yw","user_id":"CkD8vm47yacR2T09nyl3sg","business_id":"cs0FZDhSmWirLXNoRa3S0Q","stars":5,"date":"2016-08-22","text":"Technician who came to my home, Ty, was wonderful. He didn't mind that I crawled up on the roof with him so I might be able to learn a thing or two, and even though I had to wait for a part to be ordered, he made sure I knew what was happening, and even came out on a Sunday morning to get the job done. GREAT guy!!","useful":0,"funny":0,"cool":0},
{"review_id":"6ptQzRbbKPBltZd5aIj--w","user_id":"p3aOu-ooA3V6yq58qOJetA","business_id":"awI4hHMfa7H0Xf0-ChU5hg","stars":3,"date":"2016-11-14","text":"I came here at 11:30PM (hoping to avoid long lines), and waited for 2 hours because of the rave reviews. This place IS a bar inside a hotel, with very limited seating (18-20 people?). I told my husband, \"this place better be worth it.\"\n\nI can only review on the dishes I tried: \n1) $10 for 6 raw oysters - I've had really good oysters before, so I would say these are pretty mediocre...grimy, creamy, and lukewarm...knowing how easily oysters can go bad, why were they not stored in colder temperature?\n2) Clam chowder - it's New England style, which I don't have a problem with. It's just, again, mediocre. My husband, who grew up in east coast, was not impressed.\n3) Pan Roast with extra Lobster - they do give you a large portion of lobster. I found the dish just OK. Too buttery, fatty, and much of the same taste. (You can share this dish between two people... it's huge). You can also add spiciness - 1-10. A group next to us ordered 12. Whoa.\n\nI think I understand why people do like this place: If you are a seafood fan, the restaurant gives you large portions of crabs, lobsters, shrimps, oysters, and clams for budget-friendly price. I also realize the taste caters more to people who indulge in very rich, buttery foods. I wished I tried their jambalaya or any of the chef's specials - those do look better. I am a seafood fan, and I do not mind 1-2 hour lines if the food is worth it. For now, I am unsure if I would go here again - it's a very long wait for OK food.","useful":0,"funny":1,"cool":0},
{"review_id":"q6VJsPimXEzF1HeC0aCJvA","user_id":"p3aOu-ooA3V6yq58qOJetA","business_id":"KskYqH1Bi7Z_61pH6Om8pg","stars":4,"date":"2016-11-14","text":"*3.5 stars*\n\nFollowing the Yelp reviews, I tried:\n1) Garlic Prawns - pretty decent! You can also eat the crispy shells. Wish it had a bit more toasted garlic. Order a side dish to go with it, otherwise, it might feel greasy. \n2) Nam Kao Tod - WAY TOO salty, too sour.\n3) Egg noodles that I forgot the name of (first dish under Northern cuisine page) Apparently, this place is popular for their northern thai cuisine. So we tried dish #1, recommended by the waiter. It was just OK - overly creamy and much of the same taste. I can't tell how authentic it is since I'm not Thai.\n4) Thai iced tea - too sweet\n\nThis place has so many dishes - it's difficult to choose what to order. I really want to try their sea bass, charboiled prawns, and fried whole catfish with ginger. All with beer. My advice to you will be: get what you want, not necessarily what other Yelpers have reviewed.\n\nI will come back again. :)","useful":0,"funny":0,"cool":0},
{"review_id":"A8f30MKQUy3bWCAjcj-IOA","user_id":"m7MF3bgOfVkFE-fJZuAlYg","business_id":"kYD9E14AijONhJ7rFsyLrg","stars":4,"date":"2015-09-20","text":"Llega con hambre y pide la hamburguesa, carne deliciosa pero grande la porcin. El filete mignon es una muy buena opcin tambin. \n\nCome hungry and ask for the hamburger, great and juicy meat but quite big. Filet mignon is a great option too.","useful":1,"funny":1,"cool":1},
{"review_id":"NUhXG-bQRgymw6M0dq_BvQ","user_id":"UCZYEGUTw0H3G4TyTcX0Dw","business_id":"r7fY9a3MuDemdGRKcHuG5w","stars":5,"date":"2017-07-14","text":"I needed some minor repairs done to my valves, and an underground leak repaired. Sprinkler Doctors got back to me quickly after I emailed them asking for an appt (24 hours or less). I booked for 3 days later. \n\nWade arrived on time after calling in advance to confirm (much appreciated). He quickly went through my list of things and corrected\/fixed as needed. He had easy and quick fixes for problems instead of replacing entire parts or pipes.\n\nAfter the work was done, he wrote up the invoice and took credit card payment on the spot. I received a receipt via email when it was all done. I highly value vendors that can do this...take CC on site and provide digital copies of receipts.\n\nI will definitely be using Sprinkler Doctors again for future work.","useful":1,"funny":0,"cool":0},
{"review_id":"JK1csNYFUzLotTiyKvdssw","user_id":"UCZYEGUTw0H3G4TyTcX0Dw","business_id":"ZW1ckLKGJqoBM5fuoBf1bw","stars":5,"date":"2016-04-16","text":"The sandwich I had (Toasty Pig) was fantastic. Pretty much an extra cheesy cuban sandwich, which was perfect for what I wanted. Sure, it's a bit pricey compared to other food truck prices at around $9.50, but to me it was worth it. I'd pay that much in a restaurant (and have) for much worse similar sandwiches. Every sandwich I saw coming out was toasted perfectly. I'll definitely go back again.","useful":0,"funny":0,"cool":0},
{"review_id":"omq_3SSrzVZt8Mz4Uy5zYw","user_id":"UCZYEGUTw0H3G4TyTcX0Dw","business_id":"tzTark5witF7zdew8KGJgA","stars":5,"date":"2016-05-25","text":"We recently moved to AZ from ND, and needed some general yard cleanup and maintenance done in our new home. Eduardo is one of the few people who responded to me via e-mail (I'm not a phone person), and was able to quickly schedule an estimate appointment. He showed up promptly, and took notes on my extensive list of items (tree trimming, remove a small palm, weed removals, palm trimming, bush trimming, removal of old landscape materials, irrigation repair). Once we were done, he sent me an estimate via email VERY shortly after. The price seemed great to me, so I scheduled for a few days later.\n\nThe crew showed up close to the window and got straight to work. It was about 3-4 hours of work, and when they left I was completely happy with what they did. The MANY weeds we had were all gone, grass mowed and edged, and all the bushes\/plants looked healthy again. I was only planning to have them do the one time cleanup and have them back maybe 2-3 times a year, but I'm considering every month or two now!\n\nOh, and after the work was done an invoice was emailed to me. I can't tell you how much I appreciate a company embracing technology (I'm a bit of a IT nerd). I like to be able to shoot off an email late at night when I'm getting my personal to-do list done, and KO accommodates me perfectly. They called later that day and took my payment over the phone. No hassles, great service, and fast responses. One of the best 2 service companies we've had working on our home since we moved in...and it's a tie for 1st place.","useful":2,"funny":0,"cool":0},
{"review_id":"MhabL3-z7_AQhgDraCrkyw","user_id":"UCZYEGUTw0H3G4TyTcX0Dw","business_id":"dA7ORbBrCdxoMlvn3I6JDA","stars":5,"date":"2016-07-22","text":"Was looking for a place to take my wife for sushi (rolls) for our anniversary, and found Shimogamo highly reviewed on Yelp. I read that they often get packed during prime hours, so when I saw they take OpenTable reservations I booked it right away. \n\nWe arrived, and were greeted by name at the door and seated right away. They weren't completely full, but still at about 75% capacity of their smaller restaurant. It was also happy hour, so we got the full menus, happy hour menus, and a nice order sheet for the sushi so we could just mark what we wanted on that. Waitress was at our table immediately to take our drink order. She was super polite, and extremely efficient.\n\nWe ordered 3 rolls and the gyoza appetizer. The Spicy Yellowtail roll showed up within minutes, followed shortly by the gyoza. Both were amazing. I'm usually not a dumpling fan, but these were lightly fried and crispy on a bed of sauce. The yellowtail roll was extremely flavorful compared to other places we've eaten. We barely finished those before our Shimogamo and Las Vegas rolls arrived. Nice presentation, and we were both amazed at how you could taste all the distinct flavors separately in the rolls. The touch of lemon in the Shimogamo roll was just perfect, and seemed to only come through at the end. \n\nI'm no food critic, but eating here made me want to try to describe the food like one. The happy hour prices were awesome, and they're so efficient we were in and out in 35 minutes. And no pictures because we were hungry when we started and didn't want to stop until we were done!\n\nWe're going to be regulars now I think. Fantastic.","useful":2,"funny":0,"cool":1},
{"review_id":"v85gnr5gfGxE-T7_s_w81A","user_id":"UCZYEGUTw0H3G4TyTcX0Dw","business_id":"rtTzTba5vNXtAHJYJ-wgRQ","stars":1,"date":"2016-09-19","text":"Let me tell you a story about our last trip on Allegiant. We were booked to head back home from Minot on a Monday at 1pm. At 1:30pm we got a text saying the flight was canceled. I thought, bummer...we'll likely get booked out later that day. NOPE. Flight was rescheduled for Tuesday at 5pm. A 28 HOUR DELAY. We booked a flight on another airline out of Bismarck for early the next morning. We could have gotten home Monday night still had we known about the cancellation 30 minutes sooner.\n\nI called the customer service number as instructed in the text to cancel our rescheduled flight. Was on hold for 10 minutes when I went to the ticket counter in Minot. Hung up after 30 minutes on hold when I got to the ticket counter. They could not do cancellations. Told me to call the number I just hung up from. We got to Bismarck that evening, and I waited another 30 minutes on hold before getting an agent. She put me on hold for another 10-15 minutes while canceling my flight, and came back to say I was canceled and would be refunded for the return trip. It may take 1-2 weeks for the refund.\n\nThat was on August 15th. When I had no refund on Sept 11th, I called and waited on hold another 20 minutes before just using their web form for customer service that stated 24-48 hours for a response. \n\nToday I tweeted.\nAnd they responded within hours.\nTo tell me it could be another 4-6 weeks.\n\nThe savings are not worth this level of customer service. We were more than happy with their service up until the past couple of years. Cancelations and delays have increased, and customer service is so bogged down their response times are very unreasonable.","useful":7,"funny":0,"cool":0},
{"review_id":"nIFN2M2ouDdBpfClWbMVTg","user_id":"GF_-gwpdrgJeftEY1ZCYVQ","business_id":"65IpGk7kDCsAbphNtQJJRw","stars":1,"date":"2016-05-18","text":"Horrible service. The food took a very long time to be ready and when it was ready it was cold. When I asked for it to be heated the waiter was very rude to me. I felt disrespected.","useful":0,"funny":0,"cool":0},
{"review_id":"yRUuK_5NqlJRIHAU4Kyx6g","user_id":"1WSJx4pLGsJH84o5Slbbeg","business_id":"rnx0KHHTD9Yvr2BWAWwQ4g","stars":4,"date":"2012-09-21","text":"the best cupcakes in Madison, WI!  I go there for cupcakes; they're fresh and delicious!  However, their coffee and food are not as good as their cupcakes.","useful":0,"funny":0,"cool":0},
{"review_id":"cPLgctE_4ru2JezpudsLYQ","user_id":"1WSJx4pLGsJH84o5Slbbeg","business_id":"yvqMh9kTv3Kx-tocc0DFBQ","stars":5,"date":"2012-09-21","text":"The only place that carries Intelligensia's espresso beans in Madison, WI!  It's the only cafe that people must try in Madison!","useful":1,"funny":0,"cool":0},
{"review_id":"jSzs4RbJCu4YTPUx7Lg-8Q","user_id":"9iGQvEYohMS37RqdnlJZEg","business_id":"rOq4Xiiey0_gqH1O4omV6A","stars":1,"date":"2016-08-01","text":"I scheduled J. Scott Refrigeration to service my central air conditioning unit and evaporative cooler on May 9, 2016 at 2:00 p.m.  The technician arrived on time.\n\nHe opened the air conditioning unit and cleaned out some debris from the return air vent.  He said the coils were dirty and needed to be cleaned but he didn't have the equipment to do it.  I offered to let him use my air compressor or brush.  He chose to use the brush but stopped cleaning after a few seconds.  \n\nWithout checking with gauges, he said the air conditioning unit needed some Freon and proceeded to connect his tank of coolant to the unit.  After a very short time, still without using gauges, he said that the unit was fully charged and, without weighing the tank before or after adding the coolant, he said that he had added three pounds of coolant.  I asked him if he was going to check for leaks and he said, \"No.\"  Please note that air conditioning units do not \"use up\" Freon; if the coolant is low it is because it has leaked out.\n\nThe technician said that the condenser fan was unbalanced and might need to be replaced; I should have someone take a look at it. \n\nHe then proceeded to \"service\" the evaporative cooler.  He asked me what was wrong with it and I told him one of the pumps was not working.  He said that the pump was bad even though it was brand new and that it would be cheaper for me to replace it than for him to do it.  I agreed.  He did not check the electrical system, cooler pads, blower motor, squirrel cage fan, or drive belt.  If he had checked the belt, he would have noticed that it was badly frayed and cracked;  it failed a few days later.  He did not oil the bearings or bushings on the motor or fan.  When I replaced the drive belt, one of the fan bushings was bad but he did not know this since he never checked them..  He did not turn on the water supply or check the float operation.\n\nThere were some areas on the duct work that the technician said needed to be taped but he did not have enough tape.  I supplied the tape.\n\nAlthough I told the technician that I wanted him to service the air conditioning unit and evaporative cooler because I was getting too old to climb on the roof, I ended up making more trips up and down the ladder than he did  in order to get him my tools and supplies for him to use.  \n\nWhen he was finished, the technician threw his tank of Freon from the roof to the lawn below. The technician then said that the Freon was very expensive and that my costs were $120.\n\nThe preceding report is factual.  Subjectively:\n\nHis methods of workmanship are unacceptable by any commonly accepted standards.  He did not have the necessary tools or supplies.  He did not do the work requested.  The neglect of using gauges or scales while recharging the air conditioning unit is both dangerous and unprofessional.  The fact that he did not check out most of the items on the evaporative cooler seems to indicate that he was more interested in showing up and collecting his fee rather than actually doing his work.\n\nThis is not a company that I would ever consider allowing back on my property.","useful":0,"funny":0,"cool":0},
{"review_id":"9Z0remSPuot5-iwv2ySF-w","user_id":"tm1fakqUkQKc8IamDZYtDg","business_id":"u632XAPn08Rot9Ru9BoFNA","stars":2,"date":"2016-09-25","text":"I wish my first experience here wasn't breakfast.  I wanted to try this place after all good reviews, and I just happened to be driving by running errands and saw their breakfast sign.  It was around 9:30am on a Saturday, and I was the only person in the place.  That always makes me wonder?!\n\nStrip mall needs a little cleanup, but the inside is very clean, comfortable, and open with both booths and tables in addition to the bar area with multiple large screens and an outdoor patio on front of building.  \n\nI was only going to drop by quickly to grab the $4.99 2-egg, sausage, toast, potatoes and coffee special.  But after looking at the menu, I'm always a sucker for an Eggs Benedict.  The waitress was new here for a week and seemed new to waitressing in general.  No problem as we all need to learn.  However, when she asked me how I wanted my eggs for Eggs Benedict, I was surprised and worried.  I said poached and not runny.  No such luck.  The eggs were completely liquid and ran all over my plate.  The bread was thick and completely entrenched in butter, and my very thin and burnt slice of some type of meat was very inedible.  But no, not the Hollandaise miss?!  Yes, I hate to say, the Hollandaise was more of a cheesy mixture.  Sigh...\n\nAs sometimes happens when the waitress notices you completely are not enjoying your meal, she avoided me like the plague.   With now only two diners in the place, she finally came to only ask if I was ready for the bill. Hmm...I think I'll give it some time and try again but only for lunch or dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"YJMhEdJ3AFExat1XfGTSVA","user_id":"tm1fakqUkQKc8IamDZYtDg","business_id":"kXoCEwQ1Qr9Ft6uObAvCBQ","stars":5,"date":"2017-12-02","text":"Fried chicken was out of this world!  Juicy yet not overly greasy.  Shredded chicken bowl was flavorful but not too spicy, surprisingly.  Definitely good for those that can't take the heat.  The cashier was great at giving tips for my first time visit, and all employees were bilingual.  This location is clean and well lit at night.  Will be back!","useful":0,"funny":0,"cool":0},
{"review_id":"NtWaJzCK5pvY77SIed3mig","user_id":"tm1fakqUkQKc8IamDZYtDg","business_id":"I5wx6OPTE_XlX8DKKPS3Jw","stars":1,"date":"2017-04-07","text":"Don't go here.  After being a loyal patient for 20+ years, I'm finding a dentist that truly cares.  The staff keeps changing in the past few years, so you're always getting someone different and they seem to get less experienced.  My last hygienist was nice but kept fumbling with the equipment and it wasn't making me feel comfortable.  Then, the new dentist went to fill a small pinhole cavity, and there was a lot of training going on overhead.  It wasn't till I got home, that I noticed a small piece of excess filling that was sharp inside my mouth!  I had to wait for it to fall off.  Not cool.  That filling to this day is very rough and not smooth like the rest.  Then, the cherry on top--their final bill was double the cost of their estimate, which I may understand if it was a complicated task, but it was a small pinhole of a cavity!!  How do you mess up an estimate for that?!?!  This is not how you treat paying customers, or maybe you do?! Not me.","useful":1,"funny":0,"cool":0},
{"review_id":"l050Y7jh30uwT2MCdfGnwg","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"o6ykIVqT34KgtaWT5WtE3w","stars":5,"date":"2015-12-04","text":"We have purchased four cars here. Every experience with our salesman Scott McEwan has been great. Even when things haven't gone smoothly he steps up and delivers. If you're not familiar with the one person one price program they pitch here it's actually pretty great. I work in sales, so my first impression was that the one price would be a high price they just weren't willing to negotiate on. It turns out, they are the real deal. I price shopped a deal for two Toyota Tundras and no dealer would beat the price and only one offered to match it. I don't live anywhere near Avondale, I actually make the drive here from Chandler because they are the easiest to work with and have the best prices, especially if you are doing add ons or aftermarket equipment. Do your homework before you come here, and you'll see there really is no need to haggle. Then make sure you ask for Scott he really seems to know his cars.","useful":1,"funny":0,"cool":0},
{"review_id":"37T4mH01A7lQuc42AxsoDw","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"834GwOgJpBTg8j5dWe-hrg","stars":5,"date":"2014-09-23","text":"I have taken my Tag here twice now. Both times everything has been accomplished on time and well below what I have paid at jewelry stores and watch retailers.","useful":0,"funny":0,"cool":0},
{"review_id":"hTM5wVuGSFfy0vTUkYOH-A","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"oJPInRXXXLwG_89I-5cIiQ","stars":5,"date":"2017-12-22","text":"These guys are fantastic. Patrick and Nick were very helpful. I originally chose an SLT with tow package and the 6.2-liter engine (a difficult package to find). Henry Brown had one, however when I finally called to say I would take it, the truck had been dealer traded. The other dealership dragged its feet in returning the truck and a week went by without any commitment as to when it would be available. Nick and Patrick worked to get the truck traded back for me, in the meantime they provided me with a similar quality loaner to use while I waited. Unfortunately, the other dealership would not send back the truck and would not commit to providing a timeframe for us. With 2 weeks wasted and no new truck, I was more than disappointed. Nick was able to work out a deal on a slightly more expensive package in the same engine size and get the deal done for the same price we had already agreed on. I had the Henry Brown Custom Shop (with Joey who is really helpful) add a 4\" lift, new Fuel Wheels and tires, a dual exhaust and few other items that make the truck perfect. I would recommend the team here to anyone looking for a new car. From the sales floor to the custom shop they will take care of you if you're as picky as I am you will be very satisfied.","useful":0,"funny":0,"cool":0},
{"review_id":"BbGIzi-TXfFi7aHX8coXoA","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"pB9ZZGJaApSw2PMcOTc8og","stars":5,"date":"2016-04-07","text":"I love this place, I have checked in 3 times but you can bet I have been here at least 30. The food is great. The drinks are always good and dont forget to use the Yelp offer for free edamame when you go.","useful":0,"funny":0,"cool":0},
{"review_id":"GQ7Qz7Jpd8ROKK7s--XY_g","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"5jxn3_C5rjBow-aiBqcQNg","stars":2,"date":"2016-04-07","text":"The service here leaves a LOT to  be desired. I have been let down by the total lack of effort on the part of the sales staff a few times. Most recently I went in to purchase shoes, they did not have my size (not that big a deal). When I asked if they would have them soon, they let me know that I could come back from time to time and see (really)? I asked if I could just order the size and then they could call me when they arrived, basically the answer was no. I was told that I could order them myself online, and if they didn't fit I could return them to the store. That was ok since I also had a 20% of coupon that expired that day. They did not have them online, so I lose the coupon and still don't have an option for getting the shoes (outside of coming back periodically to check). I will not be doing that, since I will not be returning to this REI store again.","useful":1,"funny":0,"cool":0},
{"review_id":"kB--XHQ-jTHSLxTrfjr78w","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"Wn632T6ReL4Kar7i4OzhYg","stars":2,"date":"2016-03-21","text":"The fact is that this company has a good reputation for a reason, they have been around for a long time and do great work. We had a shower removed and replaced it with frame-less glass. The quality and work was as expected. The complaint I have is with our sales person and the resolution of issues. The installers called me promptly at 7am before our apt scheduled at 7:30-8:30 to let me know they had a flat tire (these things happen) and needed to repair it at a tire shop. \nWhen they arrived they found out that one of the pieces of glass loaded was incorrect (these things happen, but probably shouldn't). \nThey went back to the shop to get the correct piece and now it would 11:30 before any work began. I originally figured this would be done by 12 latest, based on the 2 hour scope of work they gave me at the estimate. \nI had an apt. for my own job at 1 pm, that should have been no problem, and could not be cancelled. I called our sales rep at Roadrunner Glass to tell him I had been pushed out and had to be somewhere at 1pm. His response was that they would not be done by 1 PM(due to their issues, not mine). \nHis solution was that I could cancel the apt and get back on the schedule sometime next week. Not to reschedule that afternoon, or the next day, but just whenever they could do it. I was without a shower until this was done. They seemed more than happy to push me out to whenever the next most convenient time for them was.To be honest it's just the total lack of concern for the customer and my schedule that gets them a poor review here. This review is based on customer service and their total lack of concern if something goes wrong on their end. This review is not for poor workmanship and quality. Frankly, if you buy here and nothing goes sideways, your experience will probably be fine. I did not include the estimators name, as he is the weakest link at this company by far.","useful":1,"funny":1,"cool":0},
{"review_id":"jDdIJI0Y-bYybDhYyr59OQ","user_id":"vXBtJCZIGoDRn-GecpVfTQ","business_id":"szlK9dJSHeSACNYFO9tfwg","stars":5,"date":"2017-06-18","text":"This place is eggcellent (sorry had to do it)    seriously though, check this place out. Great food and good breakfast atmosphere. There are a ton of good choices, and the owner cares and is personally involved.","useful":0,"funny":0,"cool":0},
{"review_id":"-G5qVtSX2JldGDxUXdxWTQ","user_id":"a_STCPGJwLdnMtoLwLBSeA","business_id":"XEFayWAqUVwug4HeKomyKQ","stars":1,"date":"2015-03-10","text":"This is the response I got from the parish priest AFTER the baptism coordinator HUNG UP ON ME. There was more than one person present during our conversation, and I was neither rude nor belligerent. I simply asked to make the appointment and that I would fax Lilly's birth certificate over once I had time, PRIOR TO THE APPOINTMENT. They wouldn't even make the appointment and that is what upset me!\nDear Margaret,\nI have spoken to the three women who interacted with you last Friday morning and on Sunday evening. To a person they describe your behavior as rude and belligerent. The packet you were mailed last October was quite explicit in stating that you are required to submit a copy of your child's birth certificate in order to have your daughter baptized. This is in accord with diocesan policy, and is in place for a variety of reasons. We do not deviate from this policy.\nIn that you appeared in the office on Friday morning, it is obviously not out of the question for you to also stop by your safety deposit box to retrieve the certificate. As Judy told you on the phone, we are quite flexible in arranging for baptism appointments that meet the needs of the parents, and will be happy to do so with you. Having all the requested information in hand at the time of your appointment ensures that everything is in order for your child's baptism. Our goal is to serve the needs of our parishioners as best we can, but we also rightly expect some cooperation from them as well. We will be happy to work with you and your husband to arrange for the baptism of your daughter and will set up an appointment at your convenience once you submit her birth certificate. I do not believe this is too much to ask.\nI am copying this email to Fr. Diskin at the diocese.\nRev. James Turner\nSt. Thomas More Catholic Church\n6180 West Utopia Road\nGlendale, Arizona 85308-7111","useful":0,"funny":1,"cool":0},
{"review_id":"o7rzF7yfhexl8Nc4tmwl-Q","user_id":"k6Jiqkp67Hn4sc0LmE_OWA","business_id":"PdtlcLgE9SN5u7xoscBe5A","stars":4,"date":"2016-10-29","text":"Only 4 stars because not all the vets are nice... I love Dr. Bateman, she is amazing. She treats my dogs with such kindness and answers all my questions. However, Dr. Nofal (or something) is another story. I asked her some questions about my puppy and she really didn't even give me the time of day. She looked very irritated and was rushing me out. She also didn't catch my puppies ear infection, she said he was itching because of allergies and didn't even look in his ear. I had to go back to the vet a few days later because his ear was getting really bad, which Dr. Bateman diagnosed with a severe yeast infection. So -1 star because of Dr. Nofal!","useful":0,"funny":0,"cool":0},
{"review_id":"WUa8WqMBnktDaYIQZHUgdA","user_id":"k6Jiqkp67Hn4sc0LmE_OWA","business_id":"A1Ep3RYtCLFeEOg2pAiUCw","stars":5,"date":"2016-10-29","text":"Great place to let your dog off leash and run and swim! It's heavily lined with trees so you don't have to worry too much about your dog escaping somewhere or getting onto a road!","useful":0,"funny":0,"cool":0},
{"review_id":"hQ05nkgW6ITgN7djGZ8xyg","user_id":"k6Jiqkp67Hn4sc0LmE_OWA","business_id":"eW2oKyb9mBzrH0l63q727g","stars":5,"date":"2016-10-29","text":"Their green tea ice cream is the best I've had in my life. And it's really hard to find good green tea ice cream!!","useful":0,"funny":0,"cool":0},
{"review_id":"2XQjwU3FJk2ZFrgDxKoXmQ","user_id":"k6Jiqkp67Hn4sc0LmE_OWA","business_id":"VeYLpoglt8XepYdN2PjSmA","stars":3,"date":"2017-06-03","text":"Spring rolls are good but the Singapore noodles are really terrible. Was expecting better.","useful":0,"funny":0,"cool":0},
{"review_id":"kp2Raw5NrGr2itY1EgXi_g","user_id":"2zwLDI8qmMmlok9jHWebWg","business_id":"xu-aItSYIDg3PTYXoAaFWA","stars":1,"date":"2009-08-30","text":"Going through town I thought before I headed out on the road again in my RV that I should just make sure the air pressure was OK. The guys working there are not the sharpest tool in the shed. I thought they might be off a few pounds but he was adding more and so I asked what he was doing and he was trying to put 65 pounds into a 50 pound max tires. He said he must have read something on the tire that looked like it meant the pressure. I'm soooo glad I asked as in the heat in a remote place to have my tires blow out.\nThen I asked this other guy how to get to a particular highway and he started asking where I was going, commenting on my RV, why I used a map if I had a GPS and literally 10 minutes later gave me a roundabout answer to how to get there without going back into the downtown area.\nRun, run as fast as you can away from this place.  They might sell you something wrong or more than you need. Trust your car with someone else that actually knows about cars, especially if you are a woman. Safe to say any other place would know more about tires than Discount Tires in Mesa.","useful":4,"funny":0,"cool":0},
{"review_id":"bzlSVC6vA0Gq4FWXcUU2WQ","user_id":"2zwLDI8qmMmlok9jHWebWg","business_id":"3oXjSTFSOU1mrcnditsX-A","stars":5,"date":"2011-02-27","text":"I was in my RV looking for a park to stay the night and didn't want just any where. It was over 100 outside and so I got on line and found this place listed. It had the slogan \"come to play, come to stay\" well it is Arizona...land of tons of retirees but I didn't put the two together. It looked awesome on the internet so I called and made reservations that I'd be there shortly. The lady was super nice on the phone and so off I went. It was about 4:30 in the afternoon and I was in no mood to keep looking for a place. I drove in and discovered it's a 55 or better place. Oops I'm not that old. The lady I spoke with on the phone was in the office and she said I could stay there anyway since it was just a night and just me. Awesome!! Well this place people stay for winters, months at a time but they have a daily rate of about $45 a night. Pool, hot tubs, club house, laundry facilities, golf course, social events and I'm sure I missed some stuff but it was great just to jump in the pool in that heat. I think I shocked some of the men there in my bikini and interupted a wine and cheese  party.\nIt was quiet and close off the freeway like an oasis waiting for me. I would tell anyone coming in the area to check this place out. I felt fortunate to be allowed to stay there...even for the one night.","useful":15,"funny":3,"cool":2},
{"review_id":"KgJpEiqvYnZqvcimbqcEaw","user_id":"2zwLDI8qmMmlok9jHWebWg","business_id":"Es_cIduurEbcndt6y67hBg","stars":3,"date":"2009-08-08","text":"It was a little tucked away but once I found Trader Vic's it was awesome. I had been to the one in Bellevue, WA before and liked the decor and vibe. This place was no different. Awesome with the masks, statues and whole Tahitian amosphere. A friend of mine was playing there so I went to see her band. They faced the dining room and were all in the dark. It was an odd place for the band since the bar part was packed and not so much the dining room. They didn'tj have Guinness which was a bummer but they also didn't have much of a beer selection aside from the Bud, Coors type standards. $7 for a beer was pricey I thought for Scottsdale. My friends had some yummy clam type soup and some generous portions for their entrees which they enjoyed. I had already eaten so I just drank. We tried a mixed drink that, the coke my friend had with his rum was flat and my ginger ale was flat too and tasted way too much like syrupy seven up. We sent them back but they came back tasting the same. I had asked the waiter to just bring me a shot of Captian Morgan neat but that ddn't happen. I would go back but perhaps try the happy hour for food as it was on the high side for dinner as were the drinks. The staff was nice and friendly. The drinks dept. get something that doesn't have soda with it.","useful":2,"funny":0,"cool":1},
{"review_id":"Z_1aJAJyutkjElSfFHCFTQ","user_id":"aHGl-KarfpKi3l7ywZuVvA","business_id":"q3WDLHAtj3sqGo83yeFWMQ","stars":1,"date":"2016-06-09","text":"Usually, I've enjoyed this location but I've had 3 consecutive trips that were horrible. When the employee making the smoothie is looking around and unsure of the ingredients then know it's over. I'm not sure if they are new hires or simply don't know how to make simple smoothies. Today, a young guy was making my smoothie and clearly was clueless and the girl behind the register knew it and didn't bother to help or make sure he was putting proper ingredients in the blender. Instead , she checked me out fast as possible and said I'm out later. Leaving me w clueless guy making my smoothie. He continued to blend and add water for another 2 minutes until he handed me a slushy w zero flavor. Avoid","useful":0,"funny":0,"cool":0},
{"review_id":"RKxTaZ1ex4ttZLoY2HHd5g","user_id":"4qv0_QzpZthFEX2UJ7EpFA","business_id":"a2gWIG98DdT2nZBqNeYU9g","stars":5,"date":"2017-09-21","text":"After having a pretty rough day, I came out to my car that wouldn't start. I called my carrier and they advised it would be 75 minutes before the towing vendor would arrive.  Freddy, from Central Towing arrived within 10 minutes, was extremely pleasant and made me smile even after the day I had. I drive an European car and Freddy took the time to ensure it was towed properly and based on the manufacturers recommendation. If I ever need roadside assistance again, I will only call Central Towing and request Freddy.","useful":0,"funny":0,"cool":0},
{"review_id":"BqNOatIEHoe5Klc2tsc6vg","user_id":"EzvrCyS_4SEzsve8g2r2kg","business_id":"BYnmPgDK8QD5VTeUodQoZA","stars":5,"date":"2011-07-17","text":"Es un lugar de extramada hermosa naturaleza, la unica loma que tiene montreal, en verdad que es uno de los lugares mas lindos a los que he visitado, si vas a montreal tienes que hacer una parada en el park mont royal","useful":1,"funny":0,"cool":0},
{"review_id":"uxmILP3ZFq5JCDULnFE38A","user_id":"EzvrCyS_4SEzsve8g2r2kg","business_id":"Ux2wCjtzYHiwtbPWa892ug","stars":5,"date":"2011-07-17","text":"lugar donde se aprende mucho de la vida en otros continentes, una mezcla de ingeniera y una excepcional arquitectura y un gran calor humano, super recomendable si visitas montreal no dejes de verlo","useful":1,"funny":0,"cool":1},
{"review_id":"LeRio_nTtK5Pbym8CLAyCw","user_id":"ZdQJqZ5OmC2Tr2kHztawSg","business_id":"OIhwfK2wTtK23Bp1rtMfDQ","stars":1,"date":"2014-01-21","text":"Came here for a free diagnostic test. Lady at the counter says \"it'll be a couple minutes before someone can go out and help me. she didnt let anyone else know about me and why I was there so I assumed she was gonna do the test for me. 20 minutes later I see her go outside. Im pissed off by this point so I leave. Where do I find her? Outside smoking. And had nothing to say to me. She sucks. Older lady that wears an earpiece like shes busy.","useful":0,"funny":0,"cool":0},
{"review_id":"FcX0w1yCsPCpeTU1PgmHdQ","user_id":"ZdQJqZ5OmC2Tr2kHztawSg","business_id":"CexFXF1HmPJAF3C1UGuBlA","stars":1,"date":"2011-04-22","text":"would give negative stars.\n\ntowed my car here from another incompetent mechanic. took them 2 months to even touch my car. parts were missing\/broken. car still not running in fact is in worse condition than it was before. BEWARE OF THIS PLACE. BUNCH OF LIARS.  this situation started at Daves Automotive. check out my review of them for the entire story.","useful":5,"funny":2,"cool":1},
{"review_id":"CgdSGX2RzgozWDd3W5rkKw","user_id":"ZdQJqZ5OmC2Tr2kHztawSg","business_id":"czyhvf93Txsfxdxqcm16mA","stars":5,"date":"2011-04-29","text":"Reasonable prices. Delicious food. Clean.\n\nMy girlfriend and I eat \"Rice n Noodle\" pretty often. Most of the time it's delivery. We usually get the Dinner special that includes egg rolls, rangoon, soup, rice and 2 entres with a delivery fee of $2(i think) it all comes out to be about $26 or $27. Their generous portions take us 3 meals to finish. The math . . \n $27 \/ 2 people =  $13.50 per person\n$13.50 \/ 3meals = $4.50 per meal!!! Thats pretty decent if you ask me.\nbtw I'm a big boy. I can eat a good amount.\n\nLunch specials are awesome too. Delicious food, huge portions . $8\n\nThe service isn't too personable. They won't small talk with you while you wait for your food but they aren't rude by all means. \n\nDining-in can be a little off putting at first because all their food is served in \"to-go\" containers. I've come to realize it's more practical as a consumer and economically as a restaurant manager. They give you so much food that your'e gonna take the rest home anyway and it saves them time and labor cost by not having to bus so much off the tables and the only things they have to wash are the pots pans and cookware the cooks use.\n\nI love this place. If I every move away, I would consider Rice n Noodle one of the neighborhood institutions that I would miss and return to.","useful":2,"funny":1,"cool":1},
{"review_id":"GFLxGhmTMGrvTM41pxWMGg","user_id":"xKAM98AzSnZ0NbI_134CbA","business_id":"slaDHdZ6T09hPnpmp0SLIg","stars":5,"date":"2016-05-28","text":"Le coupe aux brownies est un peu cher (7$) mais elle vaut son prix.  Peut-tre pas idal  pour manger  l'intrieur mais peut importe quand la temprature est belle","useful":0,"funny":0,"cool":0},
{"review_id":"zfxoEKc_KBtKfh1Cot_O5g","user_id":"xKAM98AzSnZ0NbI_134CbA","business_id":"-mUXTkHOxfLxFDnaMcvqAA","stars":4,"date":"2016-05-27","text":"Vraiment trs bon. En lisant le menu je ne savais pas trop  quoi m'attendre mais mon choix  t excellent!","useful":0,"funny":0,"cool":0},
{"review_id":"3qqbRcId-Txzk6crXZwKeg","user_id":"DQBJ1DkxSCR-Qn0JxJmp0w","business_id":"yuxAz-Olx3LN9lo1gGYRZQ","stars":1,"date":"2013-10-05","text":"Horrible coverage, horrible customer service!  I would never ever recommend anyone to Sprint!!! If your thinking about signing a contract think again. I would go to any other carrier!!!","useful":1,"funny":0,"cool":0},
{"review_id":"1rt3WAZsDte1o5FaasWNbg","user_id":"DQBJ1DkxSCR-Qn0JxJmp0w","business_id":"F2Y-nyjAU91nUHtUjALIKw","stars":5,"date":"2012-07-03","text":"Best groomer ever!!! I refer all my family and friends to them.  I will never take my pups to any other groomer.   The people that work there are super friendly and handle our pets with care.  Everyone I've sent to them are still going to Backroom Groom and they also refer.  I highly recommend them!!!","useful":3,"funny":0,"cool":0},
{"review_id":"grlKilv2uzIzOoQ5cOGfRQ","user_id":"DQBJ1DkxSCR-Qn0JxJmp0w","business_id":"LC9F5wEOnXEIN29IY1O1mA","stars":1,"date":"2013-10-05","text":"Do not sign contract!! Worst service and also worse customer service. Think twice, triple, quadruple times before signing that contract!! Find a different carrier!!!","useful":0,"funny":0,"cool":0},
{"review_id":"axiPO_niJmlcbBep-KMglw","user_id":"FyZf7LyI7l_44qwelI9Vwg","business_id":"mJFdBXviC-1YRtY51XnS6A","stars":3,"date":"2012-12-18","text":"Hit or miss. Nice place to catch a quick bite.","useful":1,"funny":0,"cool":0},
{"review_id":"4t7gwBGysy3JfjSik7PPxw","user_id":"Vy8pqF1EhEF9DcCAESoODQ","business_id":"d_L-rfS1vT3JMzgCUGtiow","stars":1,"date":"2017-07-02","text":"Food was okay but over priced. The waiter was lousy and only checked on us one time and that was when we were all finished. He didn't give\/take our plates or ask us for refills. When the bill came around he was there immediately to collect tip and got upset because he felt we didn't give him enough money. He even said\" Wow\" behind me as I was walking out. He was a tall guy with blond hair and glasses. Be prepared to be disrespected when you walk into this place. Last time we will go and I'll make sure to tell my story wherever I go. \nIf you are looking for authentic Mexican food head over to \"Javier's Authentic Mexican Cuisine\" inside the Aria. You won't get attitude from frustrated dudes who hate their job. Rather, you get great homegrown Mexican service that you can feel good about paying for.","useful":0,"funny":0,"cool":0},
{"review_id":"suwqx4-xvSRFL2kJQ1X0aw","user_id":"Vy8pqF1EhEF9DcCAESoODQ","business_id":"g90V2hLYZ9C9DWWt22Sxow","stars":1,"date":"2016-10-21","text":"Cade Lavengco had given my cat a misdiagnosis which prolonged his suffering that ended with his death.  I took my cat into to see Cade because he was not acting himself. He has tired, sluggish and wasn't digesting any of his food. After going with their recommendation and outsourcing my cat's blood work to California for more accuracy, I paid the extra money. After getting his test results back (which I believe were mixed up), They told me my cat was fine and that he probably ate something in my house and hinted it may be a drug of some sort. They insinuated that I might have left out drugs for my cats to eat. This was a false assumption and I was very offended but took my cat home after they gave him some \"special\" food and watched him sleep overnight. \n\nWhen I took my cat home he was not himself so I took him back to the hospital, this time, it was midnight because I felt it was an emergency. I got a hold of Cade whom immediately sounded stressed out and backed up his original diagnosis. I said, \"NO\" my cat seems like he's dying.  Cade eventually met me at the hospital and made it seem like it was a showdown for a fight, very uncomfortable.  When I got to the hospital I paid for an In-House blood test. When Cade got the results his mouth dropped to the floor. He said your cat's white blood cells are very low. He diagnosed my cat with Leukemia and asked me to pay for an X-Ray to see his lungs and confirm his NEW diagnosis. My bill was already at $2,700 at this point and I felt that my cat was in too much pain to go on.  He could barely lift his head up and move his limbs.  I gave Cade the okay to put my cat down which has still bothered me to this day.\n\nI am holding Cade Lavengco responsible for the lack of professionalism and the misdiagnosis that prolonged my cats suffering.","useful":7,"funny":0,"cool":2},
{"review_id":"IvoHvcAl-MfB0kZKLNf3Qg","user_id":"jkj-X3B3oTeGYAd3fxihhw","business_id":"VyjyHoBg3KC5BSFRlD0ZPQ","stars":1,"date":"2012-10-30","text":"The hotel is ok but their staff including management leaves a lot to be desired.   They are definitely due for some employee training on all levels.","useful":1,"funny":0,"cool":0},
{"review_id":"hZRylgv0Ea41J_8ZNwBR7Q","user_id":"FP4YebXCJanJv6FBVw2OIA","business_id":"jwaWr4lVBIhZpKtJQpUZhA","stars":5,"date":"2017-01-27","text":"Ray and Edgar completed a small move for me from Cleveland to my apartment in Chicago. It wasn't a lot of things, but they had to navigate their truck down some tight alleyways, and my winding back stairs are tough to handle when carrying big pieces of furniture. They were efficient and friendly the whole time. They put the bed they brought in together for me (even putting the bed skirt back in place!) and were nice enough to take apart the bed frame that had been there before too. I would recommend them to anyone!","useful":0,"funny":0,"cool":0},
{"review_id":"0Mi9tCX5aozSZiAvJyCcuA","user_id":"zlbnyl1AKpRKpOjiedsraw","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":2,"date":"2014-09-02","text":"Love Guy Fieri's show on the Food Network channel.  We had high expectations, but was sadly disappointed. The atmosphere was cool; we sat outside on the patio to listen to the music in the surrounding area\/casino. Our server looked like he did not want to be there and was not pleasant. The Mac + Cheese Bacon burger was huge and pretty good. My husband's Triple B Burger was over seasoned, leaving a bad taste. All our fries with our meals were all too salty - over seasoned!  Even both our kids, who love fries, didn't like it or want any. The  Double Barrel BBQ wings were ok, nothing to brag about. Our server never checked on us during the meal, then all of a sudden, another server was asking if we wanted dessert. We kindly declined and asked for the bill. When we got it, some of the billing\/charges were incorrect. If you have a \"Total Rewards\" players card, each of the meal prices should be discounted. This had not been the case,  only two items were discounted; the new server blamed our first server since he entered our order on the system\/computer. Please review your itemize receipt before paying. They fixed the bill after we addressed it to the server, but if we didn't review it, then we would have paid more.","useful":1,"funny":0,"cool":0},
{"review_id":"nJ70nBReQ8yKZUsGB7KEPQ","user_id":"6g7hDPI2XoAQBMJNsmBxQA","business_id":"Ycn-l-X6joxbVQzgxjXpRQ","stars":1,"date":"2014-08-17","text":"Rude people run the front desk and security. Two ladies act as the gestapo at the entrance to the pool - you'll be wearing a wristband the entire time. The pool itself is excellent, but the prices at the pool bar are sky high. It's only a few stories, so you can't get a good view, not that there much to see in Arizona. They charge $4 each for the bottled water in the room - even though it's regularly 110 degrees outside. Add $50+ per night to the quoted rate; you'll be paying resort fees of at least $15 each plus taxes. The rooms have balconies, but are otherwise standard upscale fare. No bathtubs in rooms, so don't expect a bath. Also don't expect: good service, low prices, or any activities other than golf and sunbathing. Expensive, overrated, staffed with rude people - obviously, I'll never go back.\n\nLiterally cannot believe the saps who think this place is classy. I guess by Scottsdale standards it might pass as nice, but I promise the staff is exceedingly rude. Avoid.","useful":1,"funny":1,"cool":0},
{"review_id":"UJBWuf-VRDwc7Ug9US0Sqw","user_id":"6g7hDPI2XoAQBMJNsmBxQA","business_id":"DfgZlNgKwBvCpA_0alumXw","stars":1,"date":"2015-03-18","text":"If you want a shitty room staffed by awful people, go for it. Want a mean, shitty 'manager'? Stay here. Want a dated, old school shitty room for hundreds of dollars? The Mirage is your jam. Only stay here if you want no poker, no service, and offensive staff. You'll love it!","useful":2,"funny":1,"cool":0},
{"review_id":"zJqMeH2e3ceaXLVKZ_Omgw","user_id":"6g7hDPI2XoAQBMJNsmBxQA","business_id":"El4FC8jcawUVgw_0EIcbaQ","stars":1,"date":"2015-03-18","text":"In the scheme of Vegas, a complete waste of time. 'Service' is a masquerade. They care little to zero about you having fun. Spend your money in a better spot, and avoid this wasteland of customer service.","useful":0,"funny":0,"cool":0}]