[{"review_id":"wej0AR_2ZlSI4nopxOQQcQ","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"_cAvID0MXKjD8aveo1Uv0Q","stars":5,"date":"2015-01-29","text":"I recently got an adjustment from Dr Josh and i immediately noticed all the pressure and tension in my neck and upper body was gone. I work in retail standing on my feet all day in heels so i was in true need. I would recommend Josh to my friends and family anytime","useful":7,"funny":0,"cool":6},
{"review_id":"y0sE_lTMkd8mumimGC5KkQ","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"pjgr39sX5xaWFh80Z76cvg","stars":5,"date":"2015-01-29","text":"I absolutely love booking work with Marc. I booked him to dj for a party. I had some international clients come in from Europe and needed someone who could meet the standards of my European clients and friends. He set up on time and has quality equipment. Our party was booked from 8pm to 1am. Everyone was dancing to his set until 3am so we booked him for few extra hours. I would definitely recommended his services and will use him for future events as well. I have to say i also enjoyed his Australian accent and dress style as well!","useful":3,"funny":1,"cool":4},
{"review_id":"wjwYq601j_yOh20gjpgWSg","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"JWDiG0nSsM7GQ9QFRTxU9w","stars":5,"date":"2015-11-30","text":"I absolutely love shopping here. The store is very clean and extremely organized. They have great weekly specials on meat, seafood and wine. I am not happy going anywhere else. Most grocery stores are way too busy with long times. Its never a long wait at checkout and the food is extremely fresh. I truly recommended this store","useful":0,"funny":0,"cool":2},
{"review_id":"UH-nQOJzbWAZqBOvlO5L2g","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"xiSEUnaX77EhNz-l3ag7RA","stars":5,"date":"2015-08-02","text":"I did a walk in for a gel fill and pedicure and got serviced straight away. The salon is very clean and the owner played very pleasant relaxing music. Best nail design ive ever had and very reasonable prices! This is my new place to go from now on.","useful":0,"funny":1,"cool":0},
{"review_id":"iN2YQxRtZIS_v-1s0eIQ5A","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"1asJ5XNpbQashKOwIaln5Q","stars":5,"date":"2015-02-20","text":"Had a very pleasant experience at this salon. I got the Pedi & Fill combo which you get free gel included. I strongly recommended Roxanne. She gives great massages and have very nice personality. Great Atmosphere !\n\n\n I went to the Highland Nails across the street by Smiths and also Diamond Nails which are very close by and the front reception was very rude. So this shop will be my new go to place","useful":1,"funny":0,"cool":0},
{"review_id":"fwc30ulycIjAOnSF7BgbgA","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"UNI1agsPX2k3eJSJVB91nw","stars":5,"date":"2015-01-24","text":"Im a Mississippi girl living in a Las Vegas world and i have to say this restaurant keeps me on top of my southern seafood cravings especially with the spicy seasonings. Absolutely love this place. If i  dont eat here at least once a week i get anxiety lol... Must Visit","useful":1,"funny":1,"cool":1},
{"review_id":"4S65Q-rwjIBiTAYguju3AA","user_id":"SzxNcycjUDz6Itu9YMDzYQ","business_id":"lOQPeguczAueJnLmDUTfGg","stars":5,"date":"2015-09-09","text":"Great place. Stopped by for a drink at the bar end up having a blast. There was a band playing and the singer started singing songs for me and mom. The service is great! The bartender Karla was very nice and recommended new cocktails for us to try. Havent tried the food yet but next trip over its going down.","useful":2,"funny":1,"cool":1},
{"review_id":"S5kzq3J_mxFRnVUC9oYaGg","user_id":"1q6EKFyCcMUaKnUQRHHJIw","business_id":"JTgu-UYrJuYlwmwXUu4ADw","stars":5,"date":"2012-09-03","text":"We love eating at Ume.. We moved to the area in the last year, and were missing our old downtown sushi joint, when Ume opened just steps away from our condo - so we decided to give it a shot.  We noticed immediately that the prices were quite reasonable, and that there was a wide menu selection even beyond the sushi, so if you are dining with a sushi newbie, there are plenty of non-threatening options.\n\nWe have always had excellent service, and have always been offered a private booth.  We are always offered something complimentary - sometimes it is miso soup and edamame, sometimes it is an extra appetizer.  We have done both dine-in and takeout, and we are always greeted with the same excellent service.  \n\nI've also noticed that the restaurant is doing a lot to improve itself since the opening - there has been the gradual addition of decor and nicer menus, and over the summer, a new patio.  It is nice to see that they are not just coasting, but are actually investing in creating a better and better dining experience\n\nA definite thumbs up!","useful":0,"funny":0,"cool":0},
{"review_id":"uK45mDxjqsF1Zg0tOZjDFA","user_id":"1q6EKFyCcMUaKnUQRHHJIw","business_id":"IVAI4jFwRANbNCST-yhAHQ","stars":2,"date":"2012-09-03","text":"I had high hopes for Crazy Wings, it looks like fun and the decor is pretty neat when you walk in! I've given it 3 tries, though - and I don't think I'll be back.\n\nPros-\n-Decent menu selection.. Decent beer selection\n-Food was pretty good, when we got it.\n\nCons-\n-Too loud to have a decent conversation in the evening\n-You have to walk through a major cloud of cigarette smoke to get in the door.  I'm not sure how legal it is to have smoking that close to the entrance in the city of Toronto...\n-Service is pretty appalling.  It's one of those places that gets you seated and served ok, but when you want to leave, getting the bill and then getting them to come back to run your card is next to impossible.\n-I'm not a wing eater, but I hear from others that the sauce selection is pretty abysmal for a place that has \"wings\" in the name.\n\nLike I said, I gave it a fair shot, and I won't be heading back.  There are too many other options in the neighborhood.","useful":0,"funny":0,"cool":0},
{"review_id":"JhAEkm2fMFD3YMCCDGCMhw","user_id":"J1SMhb3FSmcHDoJ-UunBIg","business_id":"lRN5CRwiJrTJBi8Q9etcYw","stars":1,"date":"2015-09-29","text":"Funny how never being to metro pcs you go  there for your first time and the guy is just no help at all didn't seem like he wanted to do his job just lazy everytime I asked a question just had an excuse for everything.","useful":2,"funny":0,"cool":0},
{"review_id":"iLva1zOcoye0egLDPVLr1w","user_id":"s85yPKahlSxz-DD0p0SEFQ","business_id":"ObelBwE40B5oYm2aA8yTjw","stars":4,"date":"2010-11-05","text":"Great live music on a Friday night! Very chill- I hear they have great dessert- friendly service, nice atmosphere!  The only semi-weird thing is the random location..it was kind of alone and in a sketchy part of town. But I did just move to the area and it was at night...so I may have mid-judged","useful":0,"funny":0,"cool":0},
{"review_id":"PfYSGNv39H8MkvOxmTHo0w","user_id":"s85yPKahlSxz-DD0p0SEFQ","business_id":"x1Xn_0bw7ra8lAomLK-tZA","stars":4,"date":"2010-11-05","text":"I had such a great experience getting my hair done here! When you walk in you are given a tour, pampered, and treated so well -plus they do a great job on your hair. It's a brand new place very modern and chic and decent prices- I used a coupon from living social so my cut color and style were ridiculously cheap but even their reg prices are good!","useful":2,"funny":0,"cool":0},
{"review_id":"supNxP3w1c8_NNgWxDIT6w","user_id":"UFTMDL3kjEY81aUDskxNAw","business_id":"7eLUaZwipH_uwfvv-_WafQ","stars":4,"date":"2014-12-26","text":"A few blocks off of I-57, the Red Wheel Restaurant has a large sign out front that advertise \"PANCAKES! STEAKS!\" with equal enthusiasm. The interior is definitely dated, but that's ok, because on the Sunday brunch\/lunch time we were there, the average age of the clientele was about 75. :-)  But everyone seemed happy -- people stopping and chatting to other tables of patrons, and many tables of what was very obviously \"regulars\". The serving staff was busy, but extremely good -- no water glass was ever emptied, she checked back frequently but discreetly to make sure we were take care of, and the food arrived within minutes.  My husband had a hamburger platter with french fries, and pronounced it very tasty. I had a short stack of pancakes (not really fluffy, but still good, and HUGE), and what turned out to be a generous side order of bacon. We were in and out in less than 40 minutes.  It has it's own kitschy ambiance, but it was clean as a whistle.  Definitely a repeat if we're in the area again.","useful":1,"funny":0,"cool":0},
{"review_id":"9JeAtGgy39UQ5LExn1WJ_A","user_id":"UFTMDL3kjEY81aUDskxNAw","business_id":"FM6hRJtjDwNeZWa64wpdRg","stars":5,"date":"2014-12-26","text":"What a nice park!  We're recent arrivals, and were so disappointed with the dog park in Champaign -- basically a boring piece of dirt with a bedraggled tree or two  surrounded by an entirely too short 4 ft. fence. Someone suggested checking out the Urbana dog park (they have reciprocity between the two parks) - it's like night and day! The Urbana park has several wide swaths of open, grassed area that is perfect for dashing around, frisbee, tennis balls, or just running for a dog's sheer joy of running.  The grassed areas are punctuated by some meadow-like areas of prairie grass, which was pretty in the late summer with wildflowers, although I was a little nervous about the possibility of snakes.  There's a very welcome wooded area with benches -- some really lovely big trees provide shade.  The park is well-cared for, with lots of mulch in well-traveled areas, lots of doggie bags (but only one trash can, by the gate - still trying to figure that one out), fresh water, a hose for those \"roll in the dirt\" days, and even a port-o-potty for humans who can't hike a leg by the nearest tree. There's a separate small area for small dogs, too, but it doesn't seem to be used very much -- a lot of people bring their small dogs into the \"big dog\" section, but it would depend on how comfortable your dog is around other dogs. \n\nWith our escape artist dog, who considers any fence a challenge to be conquered, we were especially concerned about gaps in the fence, so one of the first things we did was walk the perimeter carefully.  Any areas that look as though a dog might be able to quickly dig under have been blocked with large rocks, and the gates are well-fitted, preventing a dog from nosing out in gaps caused by sagging gates.  And the fence is a good, 6' high chain link--perfect for jumpers like mine. That 4 ft. fence in Champaign would just be a suggestion, if mine saw a squirrel on the other side.  \n\nThe picture on the Urbana Parks website, http:\/\/www.urbanaparks.org\/facilities\/55.html,  is a horrible one and makes it look like an urban wasteland.  Click on the video on that page, and you'll see just how pretty this dog park is. Yes, there is a fee -- contrary to what the park website says, we were only charged for a half-year when we registered in August.  $38 per year for the first dog, or $5 to visit.","useful":5,"funny":0,"cool":0},
{"review_id":"fcslKrXKCTI4tYQwBMmTcA","user_id":"Y_a8VvH3-24GzquIIjhoMg","business_id":"AWcVD7qxNAuZT022ST_6wQ","stars":5,"date":"2011-04-13","text":"First of all Melinda is such an artist with hair, whether you want to stay simple or get a little crazy she will create a style and or color that will amaze you and keep you coming back. If you read this review you should give her a shot you will not be disappointed if nothing you will wish you found her sooner :-)\nOne quick thing is that the location noted for this review is incorrect it is the old location, the new location is as follows:\n4215 N. 16th St. Ste. 10, Phoenix, AZ 85016","useful":2,"funny":0,"cool":0},
{"review_id":"umoijzqNOGe2lwh86hv0Vw","user_id":"MwcKoED4tWYnA2k9nkQ72w","business_id":"2gS2opOiCAyL_Q99QiqiFw","stars":5,"date":"2017-07-26","text":"When my company needed a property manager to manage our real estate assets I was recommended PMP Carolinas by a trusted colleague who had been in the real estate business for years.  When I reached out to Scott to inquire about the company services, I found him to be an extremely engaging and knowledgeable of the Charlotte market.\n\nThanks for being an excellent partner in helping manage our investments and making the incorporation of our properties so seamless.","useful":1,"funny":0,"cool":0},
{"review_id":"v8-bwiuiuTL74HIopRbc8w","user_id":"MwcKoED4tWYnA2k9nkQ72w","business_id":"BeRW9lwppMRVAcwSgI9r0Q","stars":5,"date":"2017-07-19","text":"This is an excellent pizza place in the fort mill tega cay community that delivers excellent pizza and Italian food.  Great for a lazy Tuesday night if you don't want cool or if you are having a football party on Sundays!\n\nOne of the better pizza joints in town that I would highly recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"dQUb5AqKWn4SP1HcljAKAw","user_id":"2-ToUbVbGtHr8gwI_oPteA","business_id":"d31uae0VHRiaWTD6w2D03w","stars":1,"date":"2017-08-06","text":"Worst service ever. You don't expect much when you go to a Denny's but you do expect not to have to wait over 45 mins for food to arrive. Went on a Saturday for dinner and left without because service was so slow. Server says, you're fine to go. No kidding. We'll never be back to this hole.","useful":0,"funny":0,"cool":0},
{"review_id":"aegGGP_IO38uaZKS9ie72w","user_id":"plVQPDx96OpeFUuWwhuFoA","business_id":"gRCEObNuHtI61xR32ytqNQ","stars":1,"date":"2016-12-31","text":"Found BED BUGS in the first two rooms we had! They switched us to two different rooms and there was bug shells and pubic hair in those beds! Needless to say I will be sleeping in the car!","useful":0,"funny":1,"cool":0},
{"review_id":"-Kc58AzqM68FSUJXH-e5DA","user_id":"KdQHQcahzFLQvW9mvNF5NQ","business_id":"M3VCoUK9e9_VzhSFeBnFug","stars":5,"date":"2013-08-23","text":"While on vacation in Vegas I decided I wanted another tattoo. I checked reviews on Yelp and went to a couple of shops, and ended up at Precious Slut. While looking at Chicos portfolio I noticed he has done a lot of the style of tattoos I liked then when we went to his station he had a beautiful dragonfly on the wall. It was perfect for me. I asked him how much and filled out paperwork right away. I was able to get it done right then for a reasonable price. He has another picture in his station that is perfect for my husband we will be going back tomorrow.  Thanks guys for being awesome!","useful":1,"funny":0,"cool":1},
{"review_id":"iNinRRvOQVRseuNmxL7G0g","user_id":"OqQXW1qH7gL3OL70Kq0MyA","business_id":"hjgr1NJPgPjEUiUn7Ejn2A","stars":4,"date":"2010-06-05","text":"I actually didn't get to enjoy the grounds much since I was busy during the daytime, but the little I saw was impressive.\n\nI went to the spa to see if they could book me into a last-minute appointment.  Nothing available 'til later, but they did invite me into the sanctuary while I sipped their flavored water, ate an orange, and relaxed.  Their spa water tastes way better than the hotel tapwater.  The little spa store had some nice meditation music.\n\nThe little restaurant area to the right of the lobby as you walk in was a good place to relax and chat after a long day.  The food was good.  The waitress needed a bit of training on teas, though.  I had asked her if she had any herbal teas (as it was getting late and I didn't want any caffeine.)  She said she didn't, but she had green tea.  I asked if it was decaffeinated, and she replied yes after some miniscule hestiation.  I should have known.  3\/4 of the way through our snack, my eyes went wide as I realized I had more energy than when I walked in.  I reached for the tea bag and flipped it back and forth looking for the word \"decaffeinated\" on it and found none.  My fault too for not checking since I was given the tea packet.  I think the waitress did not know that green tea naturally has caffeine and has to be chemically processed to remove that caffeine.  I just ended up with a 2-hour bath to kill time 'til the next bleary-eyed morning.\n\nCheck-in was smooth.  My little casita was so far, I had to take a golf cart ride at night 'cause I didn't want to accidentally fall into one of the pools on my walk down while extremely tired.  Check-out took a bit more work as they had not credited my account with the appropriate discounts and I had to call the bellhop twice to come pick me up in his vehicle.  (After the second call, someone came for me in 1.5 minutes.)\n\nAll the staff were very nice and professional.","useful":0,"funny":0,"cool":0},
{"review_id":"FEenx1sIsyh_5vZvg2v9Aw","user_id":"OqQXW1qH7gL3OL70Kq0MyA","business_id":"C0yiSrxaTMthwS8PzEow1Q","stars":3,"date":"2010-06-05","text":"I really liked this hotel and would stay again.  The location was super convenient to the light rail to the airport, the convention center, local restaurants (including ones with good Yelp reviews), and the movie theater.  \n\nTheir hotel restaurant was very good (and the food fresh), the room was adequately sized and comfortable, the lobby was beautiful, and the hotel overall was newly constructed.\n\nI subtracted one star for overbooking and knocking us out to a sister hotel 1\/2 hour away (with advance notice and with compensation, including hourly shuttle service back to the fully-booked downtown area) for part of the stay, another 1\/2 star for messing up the restaurant billing to the room number and then saying they could do nothing about it since I didn't have the receipt, and another 1\/2 for forgetting to apply the small compensation for miscellaneous expenses because of the original goof-up.  (They had the note in their computer but somehow it was never transferred to the actual account billing.)\n\nFor the restaurant billing, I think the waiter got our two bills mixed up since we had separate checks at our table of 2, for business reasons.  So, I got billed to my room someone's else's higher check.  Anyway, an hour later, I was checking out and noticed the odd charge.  I explained that it looked like the other person's charge and that mine should be lower.  They indicated they couldn't change it since I didn't have a receipt, even though I had just finished eating.  I just told them to hold on while I walked around the lobby to the restaurant.  The waiter was still there, cleaning up, and I asked him for his copy of the receipt.  He apologized for the mixup and turned around plucked one of the first bills off the countertop and handed it to me.  I gave it to the front desk, who then adjusted my account, and then I walked the bill back to the waiter.  All that could have been done by the staff.  (Or perhaps they didn't believe me in the first place.)\n\nBut like I said, I would stay here again, keeping all receipts and perhaps checking my account balance periodically.","useful":0,"funny":1,"cool":0},
{"review_id":"F5LuI2mVvdpJIbFNhl1X1A","user_id":"-uNFo2rNWRh8YpAYG8bfbw","business_id":"F2pfjAZ_3dMTGCKv6c5wOw","stars":5,"date":"2011-08-23","text":"This is my FAVORITE restaurant in Cleveland. I'm a vegetarian(though I admit I'll still eat seafood) and this place had a ton of extremely delicious options for my boyfriend(a vegetarian who does not eat seafood) and I to try. We shared everything and were very pleased with everything we picked:\n\nGuacamole \/ pineapple \/ jicama \/ chile habanero \/ mint- Extremely delicious starter, but be prepared for it to make you insanely full, we didn't even come close to finishing it.\n\nChile poblanao relleno \/ smoked gouda \/ chile guajillo \/ tomato sauce- The best chile relleno I have ever eaten in my life, the smoked gouda was a fantastic touch to spice up an old favorite.\n\nButternut squash + goat cheese empanadas \/ oaxacan red chili + chocolate mole- Absolutely wonderful, the squash and goat cheese blended perfectly with the semi sweet mole sauce.\n\nRemolacha \/ roasted beets + spinach \/ spiced peanuts \/ chihuahua cheese- This the was entree we split and the beets were roasted to perfection, since we were splitting the server went ahead and brought us extra tortillas without us having to ask, big plus in my book!\n\nSpicy Mango Margarita- You burn my mouth in the most delicious way! I am obsessed with spicy food and cocktails and this one hit the perfect balance of sweet and spice for me. \n\n\nI really hope I get an opportunity to dine here again before I leave Cleveland!","useful":4,"funny":1,"cool":2},
{"review_id":"MnQddo0J--_8w8Nc9vqerA","user_id":"-uNFo2rNWRh8YpAYG8bfbw","business_id":"4S9wBUH7mI2eizd3MCWA-g","stars":5,"date":"2011-08-03","text":"I LOVE this store. I'm from Chicago and staying in Cleveland for a few months, I walked into the store and immediately fell in love with the clothes. They have a huge selection of colorful feminine dresses- think Free People for 1\/4 the price! The first time in here I bought three dresses, I came back for a fourth the next day and the owner pulled one from the back for me that wasn't even on display yet.\n\nI get at least two compliments whenever I go out wearing one of these dresses, I will definitely be back for more!","useful":1,"funny":0,"cool":1},
{"review_id":"BwdJQirQJrtNh5TPZ-lHcw","user_id":"-uNFo2rNWRh8YpAYG8bfbw","business_id":"228mfqUuGbnCs1kiupJXZw","stars":4,"date":"2011-07-29","text":"I'm so excited to have found this place! I've been searching for good Thai food in Cleveland for the past month (I'm from Chicago which has tons of amazing places that are easy to find). My co-workers and I ordered from here for lunch and everyone was very pleased. \n\nI had the Pad Thai Country Style and it was delicious. Like the other reviewers I agree it is not very spicy at all, however it's still the best Pad Thai I've had in Cleveland by far. I also ordered the Fresh Spring Rolls with tofu- there was way too much lettuce and barely any tofu, probably wouldn't order them again... Oh well, I loved the entree and that's what I care most about!\n\nI will definitely be ordering from here again.","useful":1,"funny":0,"cool":0},
{"review_id":"xl48ZOAWqkZsDPG2mB2xcQ","user_id":"-uNFo2rNWRh8YpAYG8bfbw","business_id":"oSS4sjOEjsubAKdTuAErfw","stars":4,"date":"2011-08-23","text":"I just had a very delicious lunch from Mad Greek, it's unfortunate that so many other people's experiences were lacking... I must admit though my company ordered out, and it seems a lot of complaints were about the service. As for the food being inedible? Luckily what I had was pretty damn good, everyone else in my office seemed to enjoy their meals as well.\n\nI ordered the curried veggie wrap with tabouli as my side- it tasted like simosa filling in a whole wheat wrap, awesome! Now I'ill admit the bottom was a bit oily- but I expect that from something that's curried and has been sitting in a box (our office is 20 minutes from the restaurant). A couple dabs with my napkin and I was good to go- and my food was still hot! The tabouli was delicious, very filling, maybe could have used a little less feta, but that's just me. My lunch cost $9.50 and I have a ton of leftovers. \n\nI would definitely order from here again, though the other reviews have scared me enough that I'm not sure if I'd dine in... We'll see.","useful":0,"funny":0,"cool":0},
{"review_id":"YRb5YUuBsWz7HvYdUq43cA","user_id":"-uNFo2rNWRh8YpAYG8bfbw","business_id":"K9XKszgtX5VnQ7FsDtUkLw","stars":5,"date":"2011-08-03","text":"Eddy's is a fantastic salon, I'm so happy I found an awesome place while I'm in town from Chicago for the next few months! Renee is my stylist and is AMAZING, the color she picked out for my hair looks fantastic! She is also a true artist when it comes to cuts... I can't wait to go back before I leave Cleveland!","useful":3,"funny":0,"cool":0},
{"review_id":"DY_e91Kktsus-xfiscwUhw","user_id":"KI_YWo4K0nLEKocfAEB6qg","business_id":"RwMLuOkImBIqqYj4SSKSPg","stars":5,"date":"2013-07-25","text":"Awesome.  just ate there for the first time and I'll definitely be going back tomorrow.  I only tried the spicy pork because the lines were a little nuts and I want to try something else.","useful":0,"funny":0,"cool":0},
{"review_id":"B7aWfUB7JyVdUXPAez3Hbg","user_id":"GqvAFWj_JhxnK5Kdh52UOQ","business_id":"RoaqURAVEs5D1-vd5t8wcA","stars":1,"date":"2015-06-21","text":"Rudest driver I've experienced in a very long time. Late pick up, drove like a maniac, dropped us several airlines away from where we needed to be and said, \"Your airline is up there.\"  Got disconnected 3 times trying to schedule the return reservation. One star is given for the helpful customer service agent who let us know where our shuttle was when we called since he was 10 minutes late. Given the poor reviews I now see here, it's obvious no one at HQ reads these or cares to make improvements in customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"pPyqBMOxlzJuKAxBOe6Acw","user_id":"1cgaB5dow_Z3DFKH4p6CGQ","business_id":"EC91SvTJeO6sEYRxjKrFLQ","stars":5,"date":"2017-11-10","text":"My new favorite spot on mill! I've been to the cabin for an after work beer, dinner and a night out and haven't been disappointed with any of the visits. The menu is diverse, and I've been working my way through it and haven't found anything I would not strongly recommend, they have an incredible selection of beer and the music is always on point! The staff is always great, I've had a bartender Dillon who's served me the last couple of times and is always a great host and entertaining. Highly recommend this place for whatever you're feeling-it looks, smells and tastes amazing and is always a blast!","useful":0,"funny":0,"cool":0},
{"review_id":"-9ezHL3uCZJOwqxfwXlIhA","user_id":"1cgaB5dow_Z3DFKH4p6CGQ","business_id":"qOd7QUh-sIB7zN7RbP1-qw","stars":1,"date":"2016-09-22","text":"I actually love this place, but customer service is so inconsistent, and the last two nights have been awful. I normally go in every week night after the gym at 8:30 pm. The last two nights, at 8:30 exactly I've walked in with the open sign off, employees sitting behind the register telling me they've closed down all the blenders and are closed. It just doesn't make sense to me, that a regular costumer with the same schedule can come in and get told they are closed early because the employees don't want to do the dishes. It sucks, I love the place but don't recommend it if you are going in anytime when they want to close 30\/40 minutes early. This was at the Tempe location.","useful":1,"funny":0,"cool":0},
{"review_id":"bjzJOX69c_i3vjFWUypl0Q","user_id":"dDrqd9JX9_6vrGQiqEwz9w","business_id":"F-ULgBFmiSqG9udQmu6CCw","stars":1,"date":"2015-08-29","text":"Better not use credit\/debit cards there, cash only if you have to. Bought $111.78 worth of grocery today. My card was swiped. After completing the whole transaction, they wanted to swipe the card again. I was told the charge did not go through. I was very suspicious instantly because it did not look like a typical miss-swipe. Promptly, checked my account, and the charge did go through -        \n--------------------------------------------------------------------------------------------------------------------\n08\/31\/15 PURCHASE BAIZ MARKETP PHOENIX AZ CARD5867   $111.78 \n--------------------------------------------------------------------------------------------------------------------\n\nAt this point, the manager was dealing with it and demanded another payment. Meanwhile, I had called my bank (Wells Fargo) and they confirmed me the charge had gone through. I notified them about this, they still refused to do anything. They would not release the grocery and I could not just walk away because my funds were deducted. At this point, I have filed with my bank to reverse the charges. \n\n\n--------------------------------------------------------------------------------------------------------------------\nClaim inquiry received\n\nATM\/Debit\/Prepaid Card Claim Reference Number: 70828151072\nRE: Debit Card XXXX-XXXX-XXXX-XXXX\nWe have received an inquiry regarding your Wells Fargo account XXXXXXXXXX. We take this claim seriously and have begun an investigation.\nPlease be assured that we will work closely with you to resolve this matter and will contact you if additional information is needed.\nYou received this notification because you are a cardholder, account owner, or an authorized representative for this account.\nIf you have questions, please call us at 1-877-230-8708. Our hours are (in Pacific Time):\nDuring Daylight Saving Time: Monday - Friday, 7:00 a.m. - 6:00 p.m.; Saturday, 8:00 a.m. - 4:00 p.m.\nDuring Standard Time: Monday - Friday, 6:00 a.m. - 5:00 p.m.; Saturday, 7:00 a.m. - 3:00 p.m.\nThank you for bringing this matter to our attention.\nSincerely,\nWells Fargo ATM Operations\n----------------------------------------------------------------------------------------------------------------------\n\n\nEventually, just had to walk away. Hope no one gets ripped off\/harassed again like this.","useful":3,"funny":0,"cool":0},
{"review_id":"XqQvcjolxjBVAXupPyIZkg","user_id":"7LL4zdyyt23Dft54Rayq4Q","business_id":"yP1TBPIe1iRFzdKFJUTUsw","stars":3,"date":"2017-01-07","text":"My problem is how inconsistent this place is. Sometimes the service is awesome quick and efficient than the next time it's some new kids with attitudes taking their sweet time. The product is normally good except the Italian cream sodas are AWFUL but I did order that on an off day so who knows it might be good another time. I normally just go there out of neccesity not out of loving the place which is too bad because I really really wanted this place to be awesome.","useful":2,"funny":1,"cool":1},
{"review_id":"WScTIn2Ike-NMGZrohzc8A","user_id":"7LL4zdyyt23Dft54Rayq4Q","business_id":"cq6SQkWKVT3TH-6YzGFn4g","stars":5,"date":"2017-11-15","text":"Very good! Staff is friendly and the food is wonderful! We have gotten the gyro sandwich and the chicken alfredo and my kids are hooked.","useful":0,"funny":0,"cool":0},
{"review_id":"Cx8ymmMfW5iY7FJG6F6dEQ","user_id":"Vnt9PVBp8EOnaiFyoP21AA","business_id":"dxeu5YQIzw0jOp1cSVkimg","stars":5,"date":"2014-12-23","text":"Make sure to stop by this place if you're craving Japanese Tapas. You won't be disappointed. Try the Kara Age!","useful":4,"funny":4,"cool":4},
{"review_id":"Nzu6epXPS0h5NUQgRKXe3w","user_id":"OASiREN5B7w5MscdWoSGTQ","business_id":"TEyX7oJh5Lj_YsHwwx3muw","stars":5,"date":"2016-12-06","text":"This place has got to be the best vape shop in Vegas. Prices are more than reasonable. Products are top notch. The service is totally awesome.  My snow wolf mod died ( finally) and I went to another vape shop to purchase another mod. BIG MISTAKE. I saw  their prices and walked right out. Went to Red Rock Vapors and bought the exact same kit for half what I would have paid at the first vape shop I went to. No shit..50% less at Red Rock . What a deal and I'm totally happy with it. I like the fact they make your juice order right in front of you . I'm a loyal customer to Red Rock Vapors cause I tried the rest , now I go to the best.","useful":0,"funny":0,"cool":0},
{"review_id":"Na3oAGv0WNk75YBFF74Tsg","user_id":"MpG8Mptjrjdz94A6sXmIow","business_id":"wS6LB0lSt0orSxP8cYXzvA","stars":4,"date":"2010-12-14","text":"This is a nice place to hang out as well as get a bite to eat.  The food is much better than your typical bar, and the drinks are generous and reasonably priced.\n\nThe service is excellent and if you come often enough, your drink will be served without you even asking for it.\n\nSome of the kinks mentioned in earlier reviews have been worked out and Lou's seems to be happy to be a neighborhood joint where half the people in the place walk to it.","useful":0,"funny":0,"cool":0},
{"review_id":"HxxqnOdWWymHdvzNzLpQmg","user_id":"3Pp7sNOtHavAPS0bBvAKUw","business_id":"fJldCnpZgAeVZGcN2WV_yg","stars":5,"date":"2017-04-07","text":"They helped me move out of state, great service, very impressed with Darrell and Eddie, quick, professional, no drama, delivered as promised.","useful":0,"funny":0,"cool":0},
{"review_id":"pvkDiVIAz-Ybe9jwXIjbvQ","user_id":"RW2OXA6hLkkDlN80FMiTdQ","business_id":"o1dX8oFupfjbBpYgT7TH0w","stars":5,"date":"2016-08-11","text":"Came here for a convention and had a number of things on my bucket list. Seeing these hotties were definitely one of them. I'm so happy I got to witness such hotness. Ladies bring you girls, bring your moms and granny. Fellas bring your ladies, so what if you gotta see another's man ass. After your lady leaves this show her undies will be so wet she'll wanna just give it to you!! Thanks guys for a great and fun night. Y'all were amazing. Pretty sure I lost my voice screaming at excitement. Aidan was my fave cuz he had that island boy touch. But all the men are gorgeous and super sweet.","useful":1,"funny":0,"cool":2},
{"review_id":"WiEAES3nHG140JNg6iNbgg","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"pmjwA8fI0scEBA7HRtbI3w","stars":5,"date":"2013-02-21","text":"I think its GREAT, with a capital G. First discovered them when I was in Nevada. I'm a vegetarian so was expecting the typical veggie sub. Boy was I pleasently surprised. They have four different veggie selections including a veggie turkey sub., veggie cheesesteak, and veggie burger. I've only had the veggie turkey and veggie cheesesteak.  The cheesesteak was just O.K. and I wouldn't get that again, but the turkey was fantastic.  \n\nThe negatives is that they can be slow at times, and prices are a bit high, but I can live with that.  Definitely one of my favorite sub shops.","useful":0,"funny":0,"cool":0},
{"review_id":"NpiGo8UK7iSdlArl8UslNw","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"55hXQybFQruQgWoEYl9cvQ","stars":4,"date":"2011-08-30","text":"I think this is a good club, but it definitely could use some updating. It hasn't changed much in 15 years since it was the Q.  Same paint job. The equipment is usually fixed fast but it is showing its age as well.  The teachers are good, and that counts the most.","useful":0,"funny":0,"cool":0},
{"review_id":"TyDiY48X-n0EcdPeUVd0ig","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"WAb6ox5RrBtF7m5Cb6p56Q","stars":3,"date":"2008-09-17","text":"i go to the House of Yang quite often, but I can't say its great. It is close.  Serving size is pretty good, but its a case of quantity over quality.  Everything is gloopy or greasy, and usually smothered in a brown sause.  It seems like all the parts are there, but there was much care in the cooking or assembly.  I often get back to my desk, open the bag, and the bottom is covered with brown sauce.  \n\nI'd say their fried rice is very good, but the rest, just fair.","useful":0,"funny":0,"cool":0},
{"review_id":"Tbx9qBdiyH-RPQAOhdpeoQ","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"0a5jrIXBKH5aRtQzh728qg","stars":5,"date":"2009-08-05","text":"This place rocks. Great pizza at reasonable prices.  They have lots of choice and a good lunch special that includes two slices and a drink.  The only negative is its not a very large place so near lunch time sometimes its hard to find a seat.  Overall highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"mGlTC2dSS-i5Vm1C44lRxg","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"tT1fLK44nm9O0UjirtSWPg","stars":1,"date":"2011-08-14","text":"I had this misfortune of going to the ER here twice in the last year.  Once for me and once for the wife. Both were really BAD experiences in more ways than one.\n\nI'll address my last visit which occurred a few weeks ago.   Without getting into the medical details, let me say the waiting room was completely empty when we arrived, so we got right in.  The layout if the patient rooms is L-shaped while nurses station in the center.   After a doctor did the initial examination, we had to wait maybe 45 minutes until more tests were done.  That is not a problem, but what was a problem is the loud nurses outside our room discussing everything from their dates last night, to other patients.  Yes, they were talking about patients, and NOT in a good way.  There was do door to close, just a curtain, so it was pretty hard NOT to hear it. Very unprofessional.\n\nAs we waited another doctor we had seen before entered our room and told us \"good news\" the test result was negative for this one test.  He then leaves, and I start thinking, and I ask my wife, did you ever have that test?  Without going into details, my wife KNOWS she never even had the test the doctor just claimed was fine.  Sure enough, later on, another doctor comes in and actually does that test. \n\nDuring our time there we definitely had more interaction about the billing charges and how they would get paid then by doctors actually giving us useful info.  \n\nAs it turned out, they actually didn't do that well of a job medically as well.   Without going into details, they missed things they should of found.  Also, afterwards we get more than $1200 in charges from doctors that are out-of-network, or feel, for whatever reason they don't take our insurance, although this hospital IS in-network for our insurance. (A major insurance company)\n\nI live close to this hospital, but from now on, I'm going to Scottsdale Healthcare Shea.  Even if I have to wait, I know the care will be good.  Never going to Thompson Peak again. Never.","useful":5,"funny":0,"cool":0},
{"review_id":"XwcD5Dad3UPZ94iMl-Lr_w","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"iBuh1wqpib8G_GdHpedckg","stars":1,"date":"2013-03-04","text":"This company HAS to be composed of complete morons.  O.K. My bill this month $122.  O.K.  You go to their account page and I find I'm using over twice the electricity of the \"average home.\"  O.K. Really.  So I'm being compared to the same size home, gas heat, pool, and where I work from home. Really.  We have this thing called the Internet that lets you customize things like this.  \n\nSo the account page gives me a \"breakdown\" of my charges.  $10 for water heating? Really, it is gas. No pool?  Hmm, I do have one. $12 cooking. Hmm, that is gas too.  Why even present this on my account when its totally BS?  Do they really think we are THAT stupid?\n\nBut the best part is hidden on the back of your actual bill.  THEIR breakdown of where MY money goes. $7.14 - Customer account charge. It costs them over $7 to just maintain an account?  Hmmm. How come Netflix can do it for $8 PLUS provide a service PLUS pay royalties.  How come MOST companies provide an account for FREE.\n\nSo the bill says it costs them $33.20 to generate the electricity, and $22.86 to deliver it?  In other words, it costs them $22.86 to deliver $33.20 of electricity?  \n\nBetween metering, reading the meter and billing it is another $9.00  \n\nOverall, their costs, not including any tax or things like that which are out of their control, including $4.27 for a \"system benefits charge\" is over $60 of a $122 bill?  Were just talking inefficiency here, NOT actually paying for electricity.  \n\nAPS is great at at telling us a make-believe scenario at how we are using their electricity, but you don't see them telling us how THEY are wasting our money.   \n\nThis is a perfect example of how a lack of any competition can affect you.  Just like the medical industry, they can charge you almost anything they want.  You may think the Public Service Commission helps here but it does not. If they were on YOUR side, would they allow these outrageous charges?  Like over $10 to just maintain and bill your account?  I think not.","useful":5,"funny":1,"cool":0},
{"review_id":"nLqEYqv8yS85sxEhXH8Ydw","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"DHJiH3C7qQyzY_I3VwD-Qw","stars":1,"date":"2012-11-28","text":"Visiting this restaurant was very depressing to me, since i had been a regular of Sweet Tomatoes. As a vegetarian it was fantastic.  The new concept, not so much. I'm not really sure what they were thinking?  \n\nFrom the start, the \"smartcard\" idea is stupid. You definitely feel like they are grabbing money from you on every turn, and you can't tell what your final bill is until you leave. Then to top off the insult, they add on a 7.5% gratuity.  When I have to go around to serve myself. I'd much rather have a waiter and give them 15%.\n\nI read that this is a 4 month experiment. I have no doubt it will be a failed experiment because I certainly won't be back. If you can't make enough money with your Sweet Tomatoes just raise your prices. This way you are loosing all your customers, and when you finally realize that and turn it back into Sweet Tomatoes will your old customers come back? Some won't. \n\nIf your going to change your concept, I definitely recommend you do some better research first. If you did do research and they recommended THIS, I'd get a new research firm.","useful":12,"funny":1,"cool":0},
{"review_id":"crTsrvifBOIxNdoiV708Wg","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"Rq6WYcNMX8VZohD89LGWaQ","stars":4,"date":"2009-08-05","text":"Just opened recently, and I would say as Jack-In-The-Boxes go, this is one of the nicer ones. Dining room is pretty small, and every time I've gone there the tables were dirty because nobody is cleaning them, but otherwise its a nice place in an area with limited low-cost options.","useful":0,"funny":0,"cool":0},
{"review_id":"G-Mx9bsCsmIGICEtne17rw","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"OjnRf8yDGEBCoUDdchSViw","stars":3,"date":"2013-02-21","text":"I thought it was fair. Went to visit them while they were at Whole Foods.  I had the Vegi Jambalaya bowl which actually comes in a cardboard carton. Has rice, beans, cheese, cabbages and some peppers.  It was OK, but I'd never wait 30 minutes in line for it again.  \n\nSo its put in this cardboard box, then the red and white checkorboard paper is put in, then the rice, beans, cabbage, etc.  The problem with this is the paper is not designed to be under juicy foods like beans, so by the time I got down to the bottom the paper was disintegrating into my food. Not very  appetizing.  They might want to rethink putting the paper in their bowls.  Anyway, wouldn't pay $8 for this again, and likely won't visit them again either.","useful":1,"funny":0,"cool":0},
{"review_id":"I09d-YTMPojYgJIJYt-Vaw","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"wbRZ9GU_YmrLA_1AwfbQ7w","stars":5,"date":"2011-03-25","text":"I've been very happy with Dr. Christakos. I feel that he is honest and doesn't perform lots of unnecessary work just to inflate his bill.  The dental hygienists are very professional and the dental equipment there also seems very up-to-date.  I would definitely recommend him to others.","useful":4,"funny":0,"cool":1},
{"review_id":"VPN-n2lPGGe6PMahPAK82A","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"BA2tYMpTHR3i7X-6qtcWaw","stars":5,"date":"2010-06-02","text":"I love the place.  Was a bit hesitant at first but friends recommended it, and it turned out to be quite good.  They even have a few choices for those that aren't into Asian fare.","useful":0,"funny":0,"cool":0},
{"review_id":"m6NkreLZ9uKmrzXuv2CarA","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"pCktHkZpZ96TJPbXdl7uAw","stars":1,"date":"2008-09-17","text":"Think this place is gone. Nice idea, but the high prices killed them. Yup, even in Scottsdale you can't charge $10 for a salad and expect to get away with it.","useful":0,"funny":1,"cool":0},
{"review_id":"M8r4VBpL9FT50d50DZpwlQ","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"YRy8FX66W5htql2pKL-o6Q","stars":2,"date":"2011-10-22","text":"I used to like this place a lot, but in the last 6 months, it has gone downhill fast. When they switched to the fancy square plates, the portion sizes dropped in half and the prices rose. I went there today after not going for months, and it was bad, almost comical. My $9 plate had maybe a teaspoon of humus, and so little of everything else, it was a joke. Was this the appetizer or what?  Its shame because it used to be good, but what did they think, nobody would notice? Word to the owner, we DO. \n\nI won't be back, and it wouldn't surprise me if this location closes soon.","useful":0,"funny":0,"cool":0},
{"review_id":"jbAPfGKv7Gpnr0aXzgrQ-Q","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"p-8AMN9Q0qwym-3Pdle20Q","stars":3,"date":"2011-09-19","text":"I like Pita Jungle, I really do, lots of good food, good service.  But there is one problem for me who is a Vegan, but also on a low-fat diet.  Its that their food, while much does not contain animal products, is pretty high in fat.  Even things that shouldn't be high in fat. \n\nExample, the Grilled Vegetable Salad has 52 grams of fat. The Veggie Burger, 41 grams of fat.  Just a Beef Gyro has 55 grams of fat, 22 of which are saturated fat.  And a Veggie Garden Wrap, 30 grams of fat.  \n\nI make many of these same things at home with 10% of the fat or less, and they taste great. There isn't any reason they can't as well.  For a regular restaurant I could live with this, but for one that puts itself off as healthy, I'm not so sure.","useful":2,"funny":0,"cool":0},
{"review_id":"TOsSGEqtiQjm3sppgp9y4w","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"0nyM_mub7LxN6Dx7tYpMaA","stars":2,"date":"2008-06-06","text":"I went for lunch, but it was a big mistake.  No menu items with a drink were under $14.  I think this place would be fine for dinner, but its not for lunch.  The food was good, but we were the only ones there, so it was quiet, and this was at noon.  \n\nThey need to either lower their prices to attract more lunch crowd, or move to a bigger place and offer an upscale diner.  Right now, I'm not sure they know their identity, and customers don't like to experiment either.  Get it figured out, or you will be gone in a few months, which would be a shame.","useful":2,"funny":1,"cool":1},
{"review_id":"YlPD42NPI8A9A8u5K1OHNg","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"uM5eNM6GYZYiSm3b2iZdOg","stars":3,"date":"2008-09-17","text":"Yeah, this is a bit of a mixture.  The food isn't bad, but I think it is excessively expensive, even for Scottsdale.  I've eaten there twice.  Its basically a fast-food place where you order at a counter, and they call you when your order is up.  Nothing wrong with that, but I don't expect to pay $15 for a simple wrap, chips and a soda.\n\nThe wraps were good, they can be grilled, but they weren't exceptionally large.  Certainly not Chipotle size.  \n\nSo if you want to try something different, and your not pinching pennies, try it out.  If you want value, this isn't the place.","useful":0,"funny":0,"cool":0},
{"review_id":"PejCECmAnY4y-IMnQDPKBQ","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"0gXYLVPNWz0WT8wXQVpS0g","stars":4,"date":"2008-09-17","text":"I liked this place, but it was on the pricey side.  Food was very good,. They have lots of salads and sandwiches.  If it was a special occasion, I'd go again.  The only other negatives is that the place is quite small, and it gets crowded.  When you go, don't always expect to find a seat.","useful":0,"funny":0,"cool":0},
{"review_id":"n7PEu0mGk135qMVdNCR7ng","user_id":"vtJNNmRxWwM8MSULUSAdSw","business_id":"Lj_C-CvuK-3V58AsIpkikg","stars":4,"date":"2011-09-19","text":"I've been to this restaurant twice, the first time as sit-down, then as a take-out.  The sit-down experience was good, and the food was good, but the take-out experience was poor.  Let me explain.\n\nSo I enter the restaurant and say I want take-out.  I'm handed a bowl and sent on my way, but I realize, when do I pay for this?  I go back, and the person, who I think is also a server, says I can pay for it here. O.K. I hand him the money, but there is no cash register, so he gets my change out of someone's tip, and it looks like he is baffled as to where to put my money. In any case I notice it costs a dollar extra for take-out. Maybe card board boxes are expensive.  Or maybe its a pseudo-tip for the server, because with take-out he wouldn't have gotten a tip else-wise.     In any case, VERY strange. I've never paid higher takeout prices before.  \n\nSo I fill my bowl and wait for my to-go order.  I can sit at the bar on the other side of the restaurant, but feel strange doing that since I don't want a drink.  So I wait around for my order holding up my number card to they can see if its me.  \n\nHopefully they are this disorganized because it just opened a few weeks ago, but I would never go back for a take-out meal.  And by the way, the box I paid an extra $1 for isn't a great thing to eat a lunch out of.  Otherwise the food seems fine. Lots of choices.  Not much different than other Mongolian places I've been at.  Maybe a bit nicer to dine-in, but much worse for take-out.","useful":1,"funny":1,"cool":0},
{"review_id":"tff-9mP_CpkVLPhf7ZPqwA","user_id":"FNQDOE8iTdotiwosY0TPAQ","business_id":"0sK05JQG2UrWtRONzrr0JA","stars":1,"date":"2017-06-06","text":"I purchased new furnace and new tankless water heater from Simply Comfort in October 2015. Their Sale was friendly and their Technician seemed knowledgeable. The contracts I signed were similar to a\"Lease to Own\" kind of contract. It is split into 120 payments and then I will own the appliances. The lease price is way more than buying it up front. They charged you high for the finance need. However, the Sale person never explained to me that they will increase that lease price year by year (this year they increase it by 3%). The lease contract includes a yearly inspection but you have to take initiative to call them to come. The technician who came scared me that my air con is not OK (leaking water in certain part0, my water is too hard and you need new air con and water softener, etc. They just wanted to sell. I ended up have to hire another technician to give me second opinion and found out that all those are not necessary. If you lease to own a car, the car company will not put up the lease price every year. I work in finance field and I do not understand their logic. You really have to read all the tiny print details on the contract before you sign. Don't rely on the Sale to explain it to you. I gave them a rating 2 because Lennox appliances are of good quality. I personally would not recommend this supplier to my friends or relatives.","useful":8,"funny":0,"cool":1},
{"review_id":"txEODR8s2uzJru4-nU_arQ","user_id":"FNQDOE8iTdotiwosY0TPAQ","business_id":"W2GY12qKFsq8LFVYSoaQhA","stars":5,"date":"2016-09-14","text":"I retired last year and fell in love with planting succulents.  I found Grow Something on Yelp and went there (the second time today).\n\nI am very impressed by the passion of the owner and her willingness to share her knowledge.  Her plants are nice and comparatively inexpensive.\n\nI look around in many flower shops and big nurseries and find that this is really the best place to shop for succulents.  You won't feel disappoint.","useful":0,"funny":0,"cool":0},
{"review_id":"YaP-eCxdE6kZ_vD3hgS3ig","user_id":"KXcXBvWbkf47EL08X7AMeQ","business_id":"33yClygMVQZb5y9WgOCHLA","stars":5,"date":"2016-11-27","text":"Aslam o aleequm            \nGood quality of food alhumdullaih with reasonable price and excellent friendly service. I always visit this resto\nAlhumdullaih","useful":0,"funny":0,"cool":0},
{"review_id":"jwEaP2roXmvg7J0mOPX_kw","user_id":"Emn00KXQ3aMbECHroP907Q","business_id":"w4bieaKWJ69V1GrQ4NNfVg","stars":5,"date":"2017-04-06","text":"When I was selling my condo, Lisa came in and \"cleared the decks\" of all my personal stuff and even the objects I thought added interest. She explained that those items detracted from the elements potential buyers would be living with-like the beauty of the marble or other architectural details that needed to be showcased. As a result, my agent told me that my condo showed really well! It sold within a few weeks and for the price I was hoping for!","useful":0,"funny":0,"cool":1},
{"review_id":"KH98jT0hnS9bzAis9_6kMg","user_id":"HgVkdtXo0WVEkosqIYpKmw","business_id":"jYN-lu3moXTFX2jHI2G7Tg","stars":5,"date":"2013-06-15","text":"We were sent to Les by a friend who recommended him and we were definitely not disappointed!! Les was able to create the exact ring we wanted at an amazing price. He was also able to get us a diamond at an extraordinary price that we were so happy with, after meeting with other jewelers and hearing their quotes. Not only did we get a wonderful deal, but the work was really top quality. We couldn't be happier.\nNot only that, Les has become like a friend and even family! He has always been so accommodating. We would certainly recommend him to anyone who is looking for top quality and a great deal.","useful":2,"funny":0,"cool":0},
{"review_id":"l9m_eFRJA3MI5UR6kmiZ6w","user_id":"92UySjdqhcGIiz5t1zmkfg","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2010-04-27","text":"Believe it or not, my friends and I got a recommendation for Mon Ami Gabi from our cab driver! On our cab ride from the airport to the hotel, the cab driver was giving us a song and dance about being able to get us into the clubs, so while he was on a roll, my friend asked him where he would recommend to eat. It was interesting to hear what he said even though we had all been to Vegas before.\n\nAm I glad we listened to him! He told us to check out Mon Ami Gabi around 2:30pm for lunch in order to catch the 3pm fountain show at the Bellagio. We went on Sunday around 2:15pm and asked for a table outside on the rail (like the cabbie told us to ask for). They told us it would be a 45 minute wait especially for a table outside. But it turned into more like 30 minutes. We killed time at the casino ; ) \n\nEverything was perfect, except that is was SOOOO sunny and hot on this particular day, so we ended up rushing through our meal due to the fact that the seats \"on the rail\" have to cover above. Even with that, the service was perfect, the waitress was polite and fast and the food...was AMAZING. Two of us got the same sandwich special and my other friend got one of the club sandwiches. We all liked our food. Yum! The sandwich I had was chicken with pesto, grilled red peppers and yummy cheezy-ness! YUM!\n\nThe lunch prices were surprisingly reasonable for such good service and food, $9-$15! Seeing (and hearing) the Bellagio water show was so fun!\n\nMy recommendation is:\n1) During the day, ask to sit outside, but under and umbrella!\nOr\n2) Go for a super late lunch or early dinner when the sun is lower in the sky or dark : ) It must be beautiful then!\n\nHighly recommend it, but if you need a very specific time, call ahead and make a reservation so you get to see the show! Check out times here:\n\nMonday - Friday\n3:00 p.m. - 8:00 p.m. - show every 1\/2 hour\n8:00 p.m. - 12:00 a.m. - show every 15 minutes\n\nSaturdays, Sundays and Holidays\n12:00 p.m. - 8:00 p.m. - show every 1\/2 hour\n8:00 p.m. - 12:00 a.m. - show every 15 minutes","useful":1,"funny":0,"cool":0},
{"review_id":"guZbhj8_tz7aL7TL8u6PIg","user_id":"92UySjdqhcGIiz5t1zmkfg","business_id":"loSgYD9dHOsjjm7QCly5qw","stars":4,"date":"2011-12-19","text":"Yum! My friends and I went to KGB after a long night of gambling. Our waitress was super sweet despite a large-ish group. I got the Cheeseburger Soup and the Chocolate Malt Shake, yum-o. I also stole a handful of tater-tots from a friend and those were cooked perfectly. The portions were big for the cost (in Vegas) and everyone enjoyed their food. I took off a star because the food was slightly over seasoned for my taste.","useful":0,"funny":0,"cool":0},
{"review_id":"mTRx-HZEhBdJ9AZVyXkL4Q","user_id":"92UySjdqhcGIiz5t1zmkfg","business_id":"NlGDKsTOLKyHJ0mgS_gWJQ","stars":2,"date":"2011-12-19","text":"I met some friends here while in Vegas and there was much to be desired. We were there on a Saturday afternoon and it was pretty empty. I was tempted to give this place 1 star, but the atmosphere was nice. Long story short:\n\n1) Food was way over priced for quality and portion size.\n2) Food - Everyone in my party agreed we have all had better.\n3) Waitstaff - Slow\n4) Orders - Took FOREVER! (I'm usually happy to talk and wait for food, but it was oddly long. Friends were getting re-fills twice over before the food arrived).\n5) Our server was forgetting things and was actually kind of rude.\n\nI won't be back. Sorry BB.","useful":1,"funny":0,"cool":0},
{"review_id":"FwvvAfcXUmKzeFF2TSq-Kw","user_id":"92UySjdqhcGIiz5t1zmkfg","business_id":"cJWbbvGmyhFiBpG_5hf5LA","stars":5,"date":"2010-04-28","text":"I. Am. A. Fan. This place is so much fun! The friends I was with had all been to the Hofbrauhaus before, so I was the only one who didn't know what to expect. We made a reservation for 8:30 on a saturday and walked right in when we arrived.\n\nThe first thing you notice is the HIIIIIGH ceilings and how loud it is. If you are looking for a quiet place to eat, skip this place or sit in the room in the back which is much quieter, but you can still hear the music. Next time I go, I'd like to sit back there because it is made to look and feel like an outdoor garden seating area and it looked just lovely.\n\nBut this time we sat in the front room. The band played a mix of fun german singalong songs and american rock. They even played the  Star Spangled Banner and one point and everyone was singing. Very cool.\n\nThe prices were reasonable for a Vegas dinner. A friend and I split a sandwhich which was around $16 and the beer I had was $7.50. The more elaborate meals and larger beers are a bit more money, so plan on about a $30 meal.\n\nAnyplace that let's me stand on the chairs (bench) to see the stage is OK by me!","useful":1,"funny":0,"cool":0},
{"review_id":"dLVp4RlF0JaZWNKAAYNzRg","user_id":"UULFYEa3OJljUMV2qHBifA","business_id":"kTuK-M5fFwV1_lMBmOU_qQ","stars":5,"date":"2017-08-12","text":"Brandon did a great job for me. I had to relocate from Phoenix Arizona to Dallas Texas in 3 days. He saved me from all the stress I had to deal with if I choose renting a truck on my own. It was worth the money. He is nice person to work with. I would highly recommend him for your moving needs.","useful":1,"funny":0,"cool":0},
{"review_id":"B_z5Z4iS7NAoi-Zvg2nWIg","user_id":"UULFYEa3OJljUMV2qHBifA","business_id":"PaF9DsA8aQSSKXSJxdd8lA","stars":5,"date":"2015-02-24","text":"Good service Ron is really helpful! The staff are friendly. Helped us to print out flyers on time. Life saver, it is cheaper than the convention center. I recommend it !","useful":0,"funny":0,"cool":0},
{"review_id":"b_jfkkDmrdzMH2n1LXBzjg","user_id":"P8z4xV3HPsyX63IWlFtZUA","business_id":"YNHvFEvp9VDNwX5VhRanYQ","stars":2,"date":"2010-07-30","text":"Please! Please! Check your food before you leave if your gonna take this home. Let's see I ordered 2 kids meals one with a Meatball one without  the first was $4.95 this should include pasta with sauce + meatball + drink + fruit roll up. I only got the pasta with sauce No meatball No Drink No fruit roll up. The second  $4.50 this should include pasta with sauce + drink + fruit roll up. I only got the pasta with sauce No Drink No fruit roll up.","useful":0,"funny":0,"cool":0},
{"review_id":"rpP-FROR_KSUcWy9M-LHgA","user_id":"xFZw-fQ6U3O5BIdPsGBQoA","business_id":"P8AR7Oe-pMrKtKMCtxllFQ","stars":1,"date":"2013-12-04","text":"Run away!  Fast!  Everything breaks in a year and then you have no warranty!  Our microwave broke in 6 months.  Then they told us it could not be fixed and that part always goes fast.  Then Why are you selling this product?  Don't buy from here, go someplace else!","useful":0,"funny":0,"cool":0},
{"review_id":"_HbYTWKYzOHQvfvgAH-Naw","user_id":"xFZw-fQ6U3O5BIdPsGBQoA","business_id":"giVVCzr86A9PTSGnPtJm3g","stars":1,"date":"2013-12-04","text":"Find somewhere else to go.  While in therapy there my shoulder ripped more.  They have assistants that run you through all the exercises, not licensed therapists.  After going there a number of times, I worked with someone new who told me the other people had me doing things wrong and changed it.  Think it should have been caught earlier?  They triple billed the insurance company and me several times.  They refused to credit our account even after I provided them proof of billing.  While I was trying to work through proving the billing, my bill kept changing even though I was no longer going there.  They had charges on one version for days after I had stopped going there.  The billing department is a mess.  \nThere are a lot of physical therapy places so why got to a bad one?  Don't risk it.  Choose somewhere else.","useful":3,"funny":0,"cool":0},
{"review_id":"4dPAaFLYxqm8trrgKAt_Iw","user_id":"xFZw-fQ6U3O5BIdPsGBQoA","business_id":"p3ephwyqeAvVtfX0wiNJ1g","stars":1,"date":"2013-12-08","text":"Our fridge broke after two years and needed a major repair bill.  When they came out to fix it they told us how this fridge is really bad (although it was one of their highest priced fridges and the sales person said it was the best) and always breaks down.  Dishonest and will no longer shop there at all!","useful":0,"funny":0,"cool":0},
{"review_id":"UTd6mAyMaq8M4RgntUFLww","user_id":"xFZw-fQ6U3O5BIdPsGBQoA","business_id":"a49-fGTOmArWbdzULzHeVQ","stars":1,"date":"2013-12-04","text":"Run!  It took them two days to come out and fix my fridge.  Then they did not have the part and rescheduled for the NEXT WEEK!  I lost all my food (donated to food bank).  Having to wait a week for a part is ridiculous in this day and age.  Then the next week they don't show up!  They call me three hours after the scheduled time (who has time to take off work and sit home in the first place) to tell me they are going to be late.  Then they can't come at all.  Then they re-schedule me, NOT for the next day, but for another two days out!  So if you have weeks to wait for repair, don't care if they don't ever show up for their four hour window, don't care if they don't show up and then reschedule for days later, then, sure, go ahead and book with Sears.  I however, will never use them again and recommend you use someone else too.","useful":0,"funny":0,"cool":0},
{"review_id":"-EF4zjads5YcvUwKTfYSrw","user_id":"OO-qJuNMBTVKoIn-LppNOw","business_id":"iL2-xJ4-eMsJk88PsbivbQ","stars":5,"date":"2016-01-21","text":"By far the BEST pizza I've ever had! Whether you're a local or just visiting, you should make the trip. I've never had a bad meal here! Our favorite is the meat lovers pizza and garlic knots. Plus the cannoli's are AMAZING!!!!","useful":1,"funny":0,"cool":0},
{"review_id":"207t7-VfF1btblCfMZ6nXA","user_id":"vLJZw-rA_ZGaK6CKtX1myA","business_id":"WtDwMqPWldXXS2xGUGBbuw","stars":5,"date":"2015-11-14","text":"After much searching for a good mechanic for my imported A class Mercedes, I found McNally's. These guys spent the time and asked the right questions. Five different mechanics prior could not solve the problem. McNally's is brilliant! Cheers!","useful":1,"funny":0,"cool":1},
{"review_id":"vfUx5_6Od6RsEsJxJbO4ZQ","user_id":"zFQFFGMvHQNAFV8Vz6R1vg","business_id":"Jqd8QeYoBxJvYxhG0Lekyg","stars":2,"date":"2015-05-12","text":"We went for mother's day. We ordered appatizers and they sent them to the table that came in after us. So we had to wait longer on top of the hour wait already to get a table. When we were eating I moved my foot and took a picture with my phone of how much stuff was.under our table..knives a broken flower pot npkins menus and it goes on..very dirty we normally eat at the one in Erie. THIS ONE WE WILL NEVER GO TO AGAIN","useful":1,"funny":0,"cool":0},
{"review_id":"VOrOP1ggFkZlCRM-gbdX_A","user_id":"gvZWtGTZJvoIribA7AuxLA","business_id":"JSBmIallJFr6rdo8qsXJWg","stars":5,"date":"2014-11-29","text":"You will not find a more knowledgable, friendly, and professional guy than Chris! He's amazing! He came to my home and had my computer fixed in under an hour.  He guarantees his work, and even emailed a few days later to make sure everything was running smoothly.  As someone who knows very little about computers, I'm so glad to know that I can call Chris with any issues, and he'll be happy to help! Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"U9NzCTlEPDJ1Ck7OiBjthw","user_id":"MxbAKCOZ4VI0aD3RhbLNqQ","business_id":"4Pb7SlTK89uSdqOwMNM35A","stars":3,"date":"2016-09-04","text":"BOMB food.. HORRIBLE service.. Thankfully you get your monies-worth. The food is a bit pricey (like most places on the strip) but the portions are huge! \n\nI arrived mid-day with a group of 5 and could see many open tables and there was no wait. It took them 20min to seat us and when we finally got seated we weren't even handed menus and didn't see our waitress for a good 5min or so after (but don't worry, she walked by us several times). We were clearly hungry so we ended up grabbing our own menu's so that when we saw our waitress we could order right away. \n\nNo free drink refills or chip refills but what they fail to mention is the large portions.. Would have been nice to know so we didn't order\/waste all this food. \n\nThe food is great though and the chefs are wonderful at accommodating meals to your preference. \n\nMaybe you're not big on service as I am but I was highly unimpressed with that part of my experience here.","useful":1,"funny":0,"cool":0},
{"review_id":"u7acuWW9wscHD1xzppn04w","user_id":"qgoq5t8OlEZmm2yV60h_ow","business_id":"09hXjMwfHxWpiOqYj08zwQ","stars":5,"date":"2015-05-23","text":"Hands down this was one of the best run kids birthday parties I've ever had for my kids! The young ladies kept the kids engaged and effortlessly moved on through 4 projects with 10 little girls and didn't skip a beat! If you are looking for a place to have your child's next birthday party this is it!!","useful":1,"funny":1,"cool":1},
{"review_id":"i5K5_jm5CxBuwJ7MsEUPEQ","user_id":"qgoq5t8OlEZmm2yV60h_ow","business_id":"pHbPn4H3LktvY7Q_2Nsweg","stars":5,"date":"2014-11-05","text":"Hands down the best hair stylist in Gastonia! Customer service is exceptional and her expertise on bringing life back to damaged hair, no matter the texture, is phenomenal! The location is super convenient and close to the highway. I have and will continue to refer D'Carmen Salon to anyone who is looking for a experienced hair stylist that is guaranteed to make heads turn!","useful":1,"funny":0,"cool":0},
{"review_id":"uTqbmpd4UyokTXB3eZqq8g","user_id":"7HE8d_ui27xTnhBRvdwysA","business_id":"AHAfH6maSPcVPJWc08dxgw","stars":2,"date":"2013-03-13","text":"I ordered a sirloin sandwich and a salad. The sirloin was chewy and gristly and the  salad dressing was too tart. Much better food at Panera or Stony's bread co.","useful":0,"funny":0,"cool":0},
{"review_id":"_E41OyL44TuJv9jAzdpabA","user_id":"7HE8d_ui27xTnhBRvdwysA","business_id":"lhygLa0ddGnWBvFRj65mFA","stars":1,"date":"2012-10-11","text":"I would give this company zero stars if I could. They are dishonorable and refuse to take responsibility for merchants not honouring their voucher. I tried several times through email and phone to make an appointment for a massage. The merchant didn't get back to me so I contacted Dealicious. They have refused to do anything about it. They also admonished me for not using the voucher earlier. So why is there an expiry date on the voucher?  Do not do business with this company!! There are other companies e.g. Wag jag, Groupon, that will take responsibility.","useful":7,"funny":1,"cool":0},
{"review_id":"VSZdlAvY9yDY-qjwD7m5IA","user_id":"H7wzfliu76skod-o8ht42Q","business_id":"VBVqHnViRLSYAqP7v8iNNQ","stars":5,"date":"2016-12-02","text":"The food at Jalapeno Inferno Market Street is amazing! Our server Dee suggested a boss margarita that was the best I have ever tasted! The Manager came around a few times asking if everything was ok and always asked if she could get us anything...everyone here was super friendly and Dee was very knowledgeable and attentive. They have amazing chips that they bring out at the start of the meal that includes the amazing flour chips and very good salsa. We shared the Lobster Street tacos and Sonoran Grilled Chicken Quesadilla, everything was delicious and so full of flavor. For first-time guest, they bring out a Free tamale they have us was phenomenal! Wow! Everything was delicious!\nThis was our first time eating Jalepeno Inferno, but won't be the last!\nFor More Info on this restaurant please visit http:\/\/oldtownscottsdale.com\/jalapeno-inferno-at-dc-ranch\/","useful":0,"funny":0,"cool":0},
{"review_id":"huJEI7pB9ElxWKufHpku1w","user_id":"H7wzfliu76skod-o8ht42Q","business_id":"C0C7IxBSC1df0FwXODZCvw","stars":5,"date":"2013-10-18","text":"The Quarters is outstanding, but you will not get much info from their website.  I found uptownscottsdale.com that has all the info you will need on the quarters, keirland and more.","useful":0,"funny":0,"cool":1},
{"review_id":"zGDm7-1KvO4xgB507oXflQ","user_id":"H7wzfliu76skod-o8ht42Q","business_id":"2vYTDuSS-D25BFpeSPCO-Q","stars":1,"date":"2016-07-29","text":"I have a 1996 Dodge Ram and I have replaced my radiator myself a few times, but this time I could not as I was not in town and needed it done before I returned.\n\nI have always trusted AAA auto repair, but NO MORE...They robbed me of over $800 for installing a new radiator, two hoses, and a thermostat.  \n\nThis happened back in September 2015 and I am still pissed about it, I talk to other service centers about it and everyone is half that price.\n\nPLEASE do yourself a favor and RUN THE OTHER WAY. Take your car anywhere but here...YOU CAN NOT TRUST THEM, and unfortunately YOU CAN  NOT TRUST AAA!","useful":4,"funny":0,"cool":0},
{"review_id":"_KmofQoqWl3dtwJhuwIjUA","user_id":"H7wzfliu76skod-o8ht42Q","business_id":"blznCCAvIVe5S8eeJrfplA","stars":5,"date":"2017-03-06","text":"Great job Guy's !!!!  I have nothing good to say about the scammers over at AAA Scottsdale Auto Repair and Airpark Auto Service is too expensive. Trust me they earned my business. Thanks Everyone at Rory's","useful":0,"funny":0,"cool":0},
{"review_id":"38X44yZF1JR1apu8ZByPyA","user_id":"ntqs4BjBT49QXMo0ZP4Nng","business_id":"LKRo3wv-QnHcbRPCzSh5kA","stars":1,"date":"2017-05-27","text":"If I could choose a half or quarter of a star,  I would do so. Do not waste your time or money with these people. Management is horrible.","useful":2,"funny":0,"cool":0},
{"review_id":"XJTaFRa4Zdmatioh9Nk04A","user_id":"ntqs4BjBT49QXMo0ZP4Nng","business_id":"TDZzz4cX0aUkk5vzNpaJ5Q","stars":1,"date":"2017-09-20","text":"Wynn Palms is run by Stout Management. Stay FAR AWAY! We moved here from out of state  for a temporary one year lease until we find a house. We have had a Horrible experience here! No hot water half the time, extremely rude and inconsiderate management.  They are very dishonest.  Do not allow them into your apartment unattended! The laundry machines are not working the majority of the time. The pool areas smell of urine. There is a drug and prostitution ring on premises. Dogs are walked off the leash and dog feces scattered around the property. The best part about living here is the view and convenience, but it is not worth the filth and nuisance you have to constantly put up with.  Not happy and will be moving shortly!","useful":1,"funny":0,"cool":0},
{"review_id":"oV2Kh86M49kNYpSOfIv2fw","user_id":"LFwaDFb_IjCSxdnINd7c0g","business_id":"FUmy99Q3EZByy2GcCJlxyg","stars":2,"date":"2017-08-27","text":"??????????????????????????????????????????????????????\n\n?????????????????????????????????","useful":0,"funny":0,"cool":0},
{"review_id":"_xnr95wSXYJlFgCEOK2s4g","user_id":"5Rx3Ue3j1rMnSxYWkepQ1g","business_id":"ncBPf_4toivivsi8b__cRw","stars":1,"date":"2013-09-01","text":"Worst experience ever, they made is pay $600 for bottle service despite the fact we had a guest list. Terrible service, it was empty on the inside and they made us wait for 30 mins outside for no reason. Never going back there again, nor letting anyone I know go there. Ripoff... Bad service... Terrible terrible experience.","useful":0,"funny":0,"cool":0},
{"review_id":"1lrMfVdgsyamdUKpIHe61A","user_id":"EKrbLZ49xXf-vhoqX0JvGA","business_id":"nQD284VfImPe_UXkmq4yaQ","stars":2,"date":"2015-08-23","text":"First off let me say that I've stayed at the Rumor Boutique several times before and a 1 complaint. However, after my last visit I will not be staying there again. If you plan on keeping visitors out think again. The gate to entrance by our room to enter the hotel was broken. Then we get in the room and our latch on our door was broken\/gone. There were no comforters, bed skirts, living room lamp was not fully assembled, no lounge chair, the closet doors were broken, and i noticed the bathroom walls we dirty. Also. The curtains we yell and tore.","useful":1,"funny":0,"cool":0},
{"review_id":"3aa4HBdMP-kxORnJ_RLzaw","user_id":"27qUo_nh_l41y8TsiHaKGg","business_id":"AfvKG1alZ1-edrZ9r2dfYg","stars":5,"date":"2013-10-03","text":"These guys are great.  Very professional, prompt and hard working. Mirko, Mooke, Victor and Ryan worked well as a team and got the job done.  Highly recommend to anyone who needs a local move.  Excellent service at a very fair price.","useful":0,"funny":0,"cool":0},
{"review_id":"gvkB8hbaW4WxiX71qetYUw","user_id":"27qUo_nh_l41y8TsiHaKGg","business_id":"bm6cNIis145xOuUo9GZZNQ","stars":5,"date":"2010-04-23","text":"What a find!  The food here is amazing.  It's owner, George Venezia is back in business.  Many locals will remember him and now he's running this small place that serves fantastic crepes and delicious sandwiches and salads.  The portions are generous and the prices are low.  It has a real international feel since George is fluent in so many languages and converses with his customers in their native tongue, be it French, Italian, Japanese...etc.  George and Faby make every customer feel special.  Ask Faby to make you a salad...just say...\"make me a salad\" and be amazed at what she comes up with.  Again...the portions are huge.  Breakfast and Lunch only.  This is a very small place so depending on the moment, there may be a line.  But, like Bianco, it's worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"AksXtu88D8TAOFTGDwD-5Q","user_id":"5vIRzj1P0v0aU46Go3CqMw","business_id":"HMTZ5VPLv02derTyMU9Ibg","stars":5,"date":"2010-11-24","text":"Galeria de los Muertos just opened on November 5th in the Roosevelt Arts District of Downtown Phoenix.  They are open 6 days a week (every day but Monday) so that you can see and buy art whenever it is convenient for you.  They have new exhibits opening every month and throw events for First Fridays, Second Saturdays, 3rd Fridays and other special events.\n\nOne of the cool things about this gallery is that they make giclee prints of the original works that are affordable so everyone can own the art of the local artists they show.  Their little prints are only $10 and the 8x12 and 8x12 prints on canvas stretched over wood frame are a steal at only $30.  They are definitely throwing down a cool business model by showcasing amazing art and making it available and affordable to the general public.","useful":1,"funny":0,"cool":0},
{"review_id":"C3IkB5QMrwXTyq4u6HMQTQ","user_id":"8kPFPOLSmMEBuK-SZde4dA","business_id":"DG7blxT5FHAlQGG8A92ZXQ","stars":5,"date":"2017-01-18","text":"We had two small (9x12ish) rooms that needed the carpet restretched to get the waves out. E-mailed Chris, he quoted me a fair price and showed up on time the next day. This is how service should happen!\nHe was friendly, articulate and did everything properly. He even offered to charge less as it wasn't as much work as I'd stated in the email. (I paid the full quote price, BTW.)\nWe seem to get a lot of service people who either don't do what's expected, screw up the work and have to come back, or charge extra.\nHighly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"BsryZp7hMsxpiARN8LLt0g","user_id":"8kPFPOLSmMEBuK-SZde4dA","business_id":"8XUyss7r1or5HxuIlWK2ZQ","stars":5,"date":"2016-12-21","text":"Came out right away and went over the issues in our old (18 years) tile roof. Fixed all of the problems. Highly recommended!","useful":0,"funny":0,"cool":0},
{"review_id":"IRi2Gbus0IpYcyyLee91Yg","user_id":"y22H4Hvdl20HX8n2CTUZpA","business_id":"utS8SMXH1sG6CzElmQvDwA","stars":1,"date":"2015-01-22","text":"Quick version - Laundry was late, then item was missing, returned when notified item was done, given wrong item, my item is still lost. No refund given, no call returned from management. VERY BAD BUSINESS!\n\nBrought in laundry on a Friday, told it would be ready Monday. Show up Tuesday, one day late and wow was that fortunate because only a portion of my clothes were present, and had just barely arrived. One item was still at their other location because of some sort of equipment failure. OK, that's not great, things happen, but I wish I had known to just wait a day and not make two trips, but oh well. I am told they will send me an email as soon as the item is ready. Get the email the next day (now Wednesday) and make another trip to their location. Hand me a similar looking item, I pay before I look closely at it, and walk out. Halfway to my car I notice its not my item... Go back in, cant find my item, call other location they cant find it. I am offered a refund for my item, but when they find it because the store's clerk couldn't, or just wouldn't, process the refund.\n\nThis is my first experience with this cleaner, and it has been terrible. All it would have taken to keep me as a customer would have been a refund and prompt attention to the matter of my missing item. I requested a call from their management as soon as they are open and reachable the next day (now Thursday at noon and I have received no call).\n\nAnd... As I am standing there waiting while the clerk calls the other location, another person walks into the store, and upon hearing that she is calling for my missing item tells her to check on his missing shirts from over a week ago. WOW. The other person waiting in line turned around and left at this point. \n\nTake ownership of your fault, do everything you can to ameliorate the situation and compensate the customer for the inconvenience (i.e. refund), and make rectifying the situation a top priority (or at least fake it). \n\nI don't even know what to do if the item is truly lost (given to someone else by mistake?) - Given how this has gone so far I expect nothing to happen.","useful":0,"funny":0,"cool":0},
{"review_id":"7dgFJAIp7RS80V6FbXXKeQ","user_id":"Ne_HMkGQjt9m41qqkCtr4A","business_id":"aX4mhLo9UdcfG83DBRcIfg","stars":5,"date":"2011-01-17","text":"Amazing show! Just saw it tonight and I as well as the crowd were laughing from start to finish. Well worth the price. You also get two free drinks included in the ticket price.","useful":1,"funny":1,"cool":1},
{"review_id":"hcSO3NLo6z6oj2eLW-_JkA","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"TFdLM8R_7Pf1xVeBNKl0hg","stars":4,"date":"2017-02-07","text":"Casbah has been our long term favorite restaurant in Pittsburgh over the years and we try to fit it in for every anniversary and birthday. The arugula salad with pancetta is our favorite but we also always enjoy the changing seasonal entrees. Each dish is a work of art and to truly experience it you must try to get a small bit of every little flavor on your fork to experience the artistry together. \n\nThe one complaint is a major one to us... the chairs in the patio area absolutely destroy your back! We are in our 30s and do not have back issues, but the metal garden chairs without padding are so terrible! It's a shame to spend $150+ on a dinner for 2 and leave in pain because of poor chairs. We learned this lesson early on and always asked for inside seating, but I hadn't been there for awhile and just booked a table through the website and ended up in the patio. I'm going to need to see a chiropractor after dinner tonight. \n\nIt kills me to say anything bad about our long term favorite place in the city, but comfort is an important part of dining and I think the patio chairs need to go to keep up with the quality and price that comes with the food.","useful":0,"funny":0,"cool":0},
{"review_id":"Kv7ltdEzqZHX4XObc6mw0Q","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"NrokuoWJAy_VbMprivfAIA","stars":5,"date":"2015-10-30","text":"Molly's Pizza is consistently very good. We've been ordering from them for years and have never had a bad item. I love their white specialty pizzas like spinach and feta. Other favorites are the Italian hoagie, sausage sandwich, chicken salad, fried zucchini and wings. My only complaint is that more often than not, the wait for delivery is over an hour. It's worth waiting for and we just plan ahead to not be starving by the time it gets delivered.","useful":1,"funny":0,"cool":0},
{"review_id":"b_wZmb-5SIDduTV06ZAdsA","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"93otbGHE0s0m-lU1osvg9w","stars":1,"date":"2013-01-05","text":"We should have taken the hint when at 9pm on a Saturday the place was empty. Our appetizer of scotch eggs was completely burnt to the point it was hard to cut. My entree was the steak which was such a poor cut of meat that it was inedible. I asked for a side of spinach and was given a dish of chopped frozen spinach. When we got the bill, we were changed for a beer the waitress never brought and that I went to the bar and got myself. It's obvious there are management and quality issues at this location and there is a reason why they are slow. It's such a great location and decor so it's a shame.","useful":2,"funny":1,"cool":1},
{"review_id":"ZnL907v9xq-hYp3lyRefbQ","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"Iam7tYWhssw_rscSBkeRIQ","stars":1,"date":"2013-01-05","text":"We ordered two pizzas and wings on a Friday night over the phone for pick up. They told us it would be ready in an hour. Sure, it's Friday a busy night so an hour seemed reasonable. My husband showed up an hour later and it was not ready. He had to park illegally because there is absolutely no parking available here and was very worried about the car getting hit. \n\nIt took another 45 minutes before he actually got the pizza. 1 hour and 45 mins is ridiculously long to wait! They should have cut off orders if they were that overwhelmed!\n\nWhen we tasted the pizza, it was... Okay. The sauce tasted like sugar and the crust was bland. Kinda like the pizza you'd expect from a street vendor at 3am in the South Side. \n\nWe will never be back and will remain loyal to Krazy Brothers and Molly's Pizza in dormont for now on.","useful":3,"funny":2,"cool":0},
{"review_id":"jlfz5mIbjmgkCcca-CEkLw","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"qAzOcHnWerREl678su-p0A","stars":1,"date":"2016-02-01","text":"In the search for a great new Chinese delivery place in our new area, we tried this place out. It was absolutely terrible. We ended up throwing every single thing we got out. Everything, especially the chicken products had a very strong chemical taste to it. I can't even describe it but it was like they somehow got coolant or oven cleaner into the chicken? The pork had a very unnatural orange color to it too. The only thing that we did eat were a few steamed dumplings which also had an underlying strange taste to them. \n\nAnd delivery took over an hour! \n\nMy husband said in all fairness we should wait until the next day to see how sick it made us. We were okay the next day, but felt really gross for a few hours after eating it and didn't consume anything other than a few bites.","useful":0,"funny":0,"cool":0},
{"review_id":"uNF3o9kuAm8wMlzSSWF9cQ","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"w2tr0PA0b3tg8pId0kjM-A","stars":5,"date":"2016-02-01","text":"The macarons here are a work of art. They have mastered these little desserts to be the perfect mix of a bit of crispiness, followed by a delicious chewy center, and then followed by a burst of subtle flavor. How can a burst be subtle, you ask? Try one and find out.","useful":3,"funny":0,"cool":1},
{"review_id":"_RSi7-lJlmLa6MUq2iFKLQ","user_id":"8Rzkw9XdCN30sUlpFKKjdA","business_id":"eGP2zwh3SdoSDRicMqTsig","stars":5,"date":"2017-07-23","text":"Great selection of beers that change regularly.  Also a sit down bar to try draft beers.  Friendly staff helped me find the exact types of beer that I like.","useful":0,"funny":0,"cool":2},
{"review_id":"Z6GCqU2skQ9KvGQPaiqTXw","user_id":"YNQ1av9A-w7Qu12PKIW2tw","business_id":"Ch0Y0E-QHxFOgcU-GDeNzg","stars":3,"date":"2017-07-13","text":"This subway is about average. We order take out weekly and have no complaint about sandwich quality.  But for the past couple of months, at least, they are not replacing the ink in the register ticket.  Not one time!!  When my wife hands me the receipt, I can't read it at all to see what to enter in my charge card account.  She has complained to them about it, but it hasn't changed.","useful":0,"funny":0,"cool":0},
{"review_id":"0AXqrSvSajK3umycZoDdGg","user_id":"VXxfLsD0oyIX5NH0fx1DDQ","business_id":"89_qI6EgDCVvWPs93aFPzQ","stars":2,"date":"2012-03-31","text":"I just had a birthday party for my 7 year old.  I was really excited about this party.  Thought it would be really different.  I was promised lots of different experiments, including the static ball and stuff to really engage the kids.  Instead we got a young girl who completely bored the kids.  She lost their attention within 15 minutes.  Talked over their heads.  It just wasn't engaging enough.  It made science rather boring for them.  There was no static ball, just some experiments with dry ice, air pressure and making slime.  I wanted to make cotton candy but the machine wan't working.  And as far as the \"treat bags\" go all they received was a cheap ballon toy.  Granted this was a \"Living Social\" deal but if that meant I was going to get the cheap version of their product I would have gladly paid the full price.  I'm really irritated about this because you put so much work into these parties and you can't just have a \"do over\".  Think twice before you book.","useful":0,"funny":0,"cool":0},
{"review_id":"paT3879Rv98NWSdchA_4oQ","user_id":"N0Lt1ctAzU76FsSnL4LGuA","business_id":"2tYaGVjYixLYYcWJ388o6A","stars":5,"date":"2017-03-30","text":"We recently had FISH Window Cleaners clean our windows and we are thrilled with their work.  Removed paint splatter, hard water spotting, and plenty of dirt. We can actually see outside and enjoy the new natural light in our home. \nGive them a call for Courteous, Professional and Affordable Service you won't be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"GFSWC6hq4zkV_GQThT8WuQ","user_id":"Fac3Wh83l6p2kMU8bCUepA","business_id":"zLiqDY4H4bLDJUmJL31fRQ","stars":1,"date":"2014-08-02","text":"At the close of a beautiful 4 days and 3 nights in Bellagio, staying at the wonderful Hotel Belvedere and exploring the picturesque towns, abbeys, and gardens -- we inquired around for the perfect restaurant and dinner to cap our Como experience... And landed at the worst restaurant experience we have had in Europe: La Punta of Bellagio, Como Italy.\n\nIn short:\n\n- the restaurant could not find our reservation which I made personally by phone days in advance\n\n- from the moment we arrived it was clear the restaurant was rushing our party of 5 through dinner to maximize our bill and minimize our time enjoying the meal\n\n- we ordered three courses (antipasti, primi, secondi) - they all arrived at once (!) with apologies from our server that the kitchen was \"in a hurry\" - the food came so fast there was no room for the plates on the table\n\n- the food was not just disappointing, it was inedible. Even simple dishes (prosciutto e melone) were clearly plated hours before dinner and had been sitting -- drying out and getting soggy at the same time\n\n- we asked for a wine list and our waiter came back to the table with an open bottle of a \"local favorite\" white - I asked again for the list. She set the bottle and 5 glasses down and walked away.  We didn't drink the wine and had to request it be removed from our bill.\n\n- once all courses arrived (at once), we never saw our waiter again - she was reassigned to another overwhelmed area of the restaurant\n\nIn short, the service and food were a disaster. What a sad waste of a beautiful location and potential.\n\nWith so many great places in and around Bellagio (Barchetta, Alle Darsene) - don't bother with this place. It won't be around for long.","useful":0,"funny":0,"cool":0},
{"review_id":"pWk9LyiZ2nKx4ILL4iwFLw","user_id":"Fac3Wh83l6p2kMU8bCUepA","business_id":"p_yiS94BXRTcP6Y0QZtZXg","stars":5,"date":"2014-08-02","text":"Visited Alle Darsene in July of '14 - it was recommended by the staff at Hotel Belvedere and for good reason! Our dinner was fantastic and the service was impeccable. The restaurant was filled with a mix of international visitors and Italians - great energy but not too crazy.  Will definitely return on our next trip to Como!","useful":1,"funny":0,"cool":0},
{"review_id":"amhAe_AS3RmRuGUZSopqYw","user_id":"xa0L2F-y8xI3Pt7LYZ0UPA","business_id":"u4IDWradF0DQSdfiUNpS2Q","stars":5,"date":"2017-02-18","text":"Finally I have found my favorite place to eat in Las Vegas. Even though I was quite impressed by the quality of their food and service I didn't write a review that day. Visited them again today, and guess what...? Same quality and even better customer service. Five stars for sure Tasty Grill. I'm in love","useful":0,"funny":0,"cool":0},
{"review_id":"CkNKKV4xzyzszza-dERlIw","user_id":"AfLsQ7xb0ys-nNZD7zV6aw","business_id":"JnotDMU1KOYHm5kHHuPnyg","stars":5,"date":"2017-04-05","text":"This place looks like a dive, but it is such great food! They give BIG portions at inexpensive prices (compared to other Ethiopian restaurants). On my last visit, I got the veggie combo to-go (which they confirmed was vegan). It had 9 different items, plus 2 giant pieces of injera. It was amazing!","useful":0,"funny":0,"cool":0},
{"review_id":"5mcsWvWGHlg_VapeBJQIOg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"xNSWOgUrAl902-6WexprxQ","stars":4,"date":"2016-02-15","text":"Not a half bad pizza pie for $6 and you're in & out in 2 minutes. Only about 4 pizzas to select from. The salad is way too salty - how do you make a really salty salad? Would like to see a little more meat on the pie but I know you get what you pay for. Just stick with the pizza folks and the crazy bread is alright too. It's a bit of a sorry looking pizza the next day, completely deflated, flat and hard. I just love that I can walk in, buy a pizza for $6 & walk right back out in 2 minutes!!","useful":0,"funny":0,"cool":0},
{"review_id":"IeaFfCo-ayhENIOfRo73BQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"aoI2O7lr0zTTwwib3qdEFA","stars":5,"date":"2014-12-27","text":"I shop here regularly and can't believe the variety of what's available, the organization, cleanliness and of course prices. They're always bringing in new items. Sometimes this store gets awfully lined up. This is the cheapest place in town to stock up on plastic left over and lunch containers, stationery, gadgets and candy - if you compare your prices like I do to identical products at the grocery store, mall, etc...","useful":1,"funny":0,"cool":0},
{"review_id":"LLlCw7_21fzD-BGW_7xScQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"jaqSKgXuUP9xJGFyBfWDTQ","stars":4,"date":"2014-10-18","text":"I've recently discovered this place - way to go for a custom made how you want Mexican food made to order, although I do find the prices a little high. If the prices weren't so high I would come in more often. I can't believe they're always trying to sell me guacamole for $1 for a scoop - that should be automatically included without extra cost. Staff are friendly, courteous & remember us but when paying for a quick burrito or 2 & paying debit & wanting a tip?! seriously!?","useful":0,"funny":0,"cool":0},
{"review_id":"pcIPWYp6M_pCdMGBOFS0Zw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"NzWY319ZSGFjppuZfgV70A","stars":1,"date":"2016-02-15","text":"For the amount of time I waited and price I paid the quality of the pizza inside, I think some other pizza places boxes would taste better than this places pizza. Blah...","useful":0,"funny":0,"cool":0},
{"review_id":"RLlrh00YR6dNEJevAa6Z9A","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"3XYER10Kn-63sWUcJlnnsg","stars":5,"date":"2012-10-25","text":"This place is great, I always feel leaving like I've done my good deed of the day! They always do all those extra little things to make sure you're feeling well when arriving, while donating and when you're getting ready to leave. I feel so great after reaching milestones such as 10x, 25x & recently 50x & they get so excited too! The food afterward is always worth it too. Occasionally you will get somebody who will jab you with the needle, but after 50 pokes the percentage is still quite low. More people need to do this and \"it's in you to give\" what better way to help out wihout having to open your wallet! and save a life instead!","useful":0,"funny":0,"cool":0},
{"review_id":"YF8t7jl570nbQACXYqmm6w","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"SK8MTQKD6jeLOBxxKejbqw","stars":4,"date":"2014-02-08","text":"I've eaten at IHOP's when I've been in the US & always look forward to it, good selection, prices & you're in & out. \nWent to this one last summer for lunch and ordered a salad, it was a meal in itself! Very good salad, I quite enjoyed it & their menu salad selection.\nThey weren't busy yet we had to wait 10 minutes to get in, odd.\nThey should build another one in north Calgary.","useful":1,"funny":0,"cool":0},
{"review_id":"cPN-Z2C0G-kjYYyLEIb58g","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"TYC6cu3vli1YG7mKdnFeCQ","stars":5,"date":"2013-05-08","text":"Never second guess doing business with this furniture company in Kensington! I shopped at absolutely every single furniture, garden patio, home improvement, etc... store in Calgary for a white rattan\/wicker sectional and most businesses wanted to sell me what they were selling not what I wanted nor did they want to place a special order for what I wanted. I had other conglomerate businesses tell me what I wanted couldn't be done. I knew exactly what I wanted and wasn't about to settle for anything less. I found this company over Kijiji then went in as I had never heard of this place - it is a small store. I went in last fall and shared my frustration and told them what I wanted, they told me to come back in the winter & could order me whatever I wanted, I felt I at long last finally found a store who heard me as a customer, so few businesses are like that these days. When I went back in February I sat down with the owner and the catalogue and she very patiently and professionally worked through what I wanted and took care of all the special arrangements quickly and easily. For fear of this small unknown company I was hesitant to leave much of a deposit, but was not pushed on this but had to leave enough down. I got My patio furniture My way 2 weeks ago and couldn't be happier!!!!  Just in time for this year's full summer to enjoy!! Thank You so very much Jaya at 3rd i Home Decor - I have Exactly what I wanted!! A Very Happy Customer!!!","useful":9,"funny":0,"cool":2},
{"review_id":"LXSTpjn-3v_NJZgbAQTm5Q","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"fYqz_q3c-HC3R5vreCvfpw","stars":3,"date":"2014-04-30","text":"How have I not written a review for this restaurant yet!?\nCan't go here & not have the ribs & baked potato soup!!! Yummmm!\nFairly good service, good prices & parking & location.\nIt's a ribs & soup restaurant, nothing too fancy but can't get bad ribs here.\nHave always enjoyed going here.","useful":0,"funny":0,"cool":0},
{"review_id":"l8FptHzylTnNfjajSLwjtw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"TAjvvMecdiTBpBnDp-KBKw","stars":1,"date":"2014-01-26","text":"Won't go back to this greenhouse either, the problem begins with parking and ends with service. You go inside and try to find something and finally seek some help and nobody knows anything. They will give you a pamphlet at customer service, offer no assistance and leave you on your own to find whatever it is you came there for, I've had better greenhouse service from stores that sell plants and aren't even greenhouses!  They think they're a conglomerate and have a bunch of 16 year olds looking pretty who don't know anything.","useful":6,"funny":1,"cool":0},
{"review_id":"VgqoIN5Iixg_nFcs1JaBQg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"B9hYNx2LpkJrSeHPiYwMeQ","stars":1,"date":"2016-07-17","text":"I called around town looking for a hitch to put on a new car I was driving for bike rack purposes only and this place beat out all the other competition around town by $15 but at the end of the day none of it was worth it. I arrived a few minutes late at the Crowfoot location because I found it impossible to find even using my GPS. I finally found it and pulled up 10 minutes late for my appointment. They said they were running a few minutes behind with the previous appointment so everything was alright. I waited across at the Subway for 20 minutes and it started to hail and they still hadn't brought my vehicle in, I called over and requested they pull in it and they said they couldn't because there was a bunch of stock on the floor for that second bay. I waited another half an hour and called again asking why my vehicle still hadn't been started yet (this is now 1 hour after my appointment time) and they told me the delivery person for the hitch hadn't arrived yet with the shipment due to the weather. Okay, I can understand weather delaying people but by 1 hour!?!? Okay, so I wait another half an hour, as you can see we're getting a theme here! I called again and I speak to somebody else who tells me the other person had to leave to go someplace and pick it up. Okay, wait a minute, I was told on my last phone call the delivery driver was running late! WTF! Also, the last person I speak with tells me the other person would be back in 45 minutes with the hitch! Are you kidding me!!!??? So I just walked back demanded my key and left. So, please let me get this right Hitch Experts expects a customer to wait outside for 2 hours and 45 minutes before you even start putting the hitch on my vehicle - a class 1 hitch with no wiring??? Also, I was initially told it would take 1.5 hours to install then I was told it would take 20 minutes to install. Every time I called here I was given a different story. Extremely frustrated!!!!!! So I take care of my running around and get back home later that day and start calling the other hitch installation businesses around town and am told by another competitor the people running this business used to work for them and there was a theft problem involved and they were fired then started up their own business across town. Please be careful who you're doing business with out there! Stay far, far away from Hitch Experts - they're all cons!","useful":5,"funny":2,"cool":1},
{"review_id":"R_iJ7qqNG5YEjcOV94G6nw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"DjzKWJMuv4Ga9JNcJvrLUw","stars":5,"date":"2013-01-06","text":"When I booked my appt & then had to change the time the day before because of another appt they were very accommodating. Then I went for my appt & upon first introductions my stylist seemed pretty distracted with other requests of her. When I finally had her time & attention she was very attentive, discussed what I wanted done, listened & looked at my pictures & even with a hiccup along the way my hair turned out exactly how I wanted it to. What a busy, busy salon & everyone was accommodating & nice. Sure I'll go back!","useful":2,"funny":0,"cool":0},
{"review_id":"3eyGkWUP2e00tnQSw3NZmA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"ABrS28KeTdAK21uf01SyLw","stars":5,"date":"2016-02-15","text":"Guacamole - need I say more! This place makes the only guacamole I will eat. You've never had guacamole until you've had Chongo's guacamole!!! I went here a few years ago and they were giving away samples of it and I was reluctant - I never liked the stuff before and much to my very pleasant surprise it was chunky and has other stuff in it, but I decided to try it after all. Yummmmmm!!!!! Was I ever glad I did!!! It was really funny but I turned those guacamole samples practically in to a meal and couldn't stop eating it! There's a zing to this guacamole so be careful if you don't like spicy too much as there's jalapeo or something in there - they wouldn't tell me what all goes into their Guacamole or nutrition facts, weird because some people have diets and need to watch exactly what they're eating and calories. I've reached out to them with no response. I go here regularly and buy the tortillas & guacamole for the most part. You have to go on a Friday or Saturday to get your fill because if you go on a Sunday they might be sold out because it's a to commodity!!! Anyone who's ever tried it knows a good thing when they've found it! They have a great selection of fresh produce and it doesn't matter what time of year you go, in the winter obviously much of what they're selling is grown locally or I don't think it is, please correct me if I'm wrong. Great prices, excellent selection, lots of free samples, clean & friendly! Gotta get back in soon for more guacamole & tortilla chips!! Yummy :) :)","useful":0,"funny":0,"cool":0},
{"review_id":"84LKoOLTir5a3JfmottW5A","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"fSNfKWo8AwVjx7SwsyRs_g","stars":5,"date":"2014-11-24","text":"Mozza burgers have always been & will always be my favourite burger. I loves my root beer & root beer floats. Good prices & friendly staff.","useful":0,"funny":0,"cool":0},
{"review_id":"5J_ARkNeoxkTqMcEs6KO3g","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"tBpUgbxm7nVgd3inU3dB0A","stars":1,"date":"2016-02-15","text":"Most unimpressed and through with this restaurant, this site needs to allow zero stars. Had a gift certificate and with the novelty valentines heart shaped pizzas you can't go wrong right - wrong, sorrily wrong! Walked in and 5 girls were behind the hostess desk and we had to wait several minutes for 1 of them to acknowledge our presence. We were seated at a booth which was really nice and the restaurant seemed dark and needed a little more lighting and this was at 4 in the afternoon, the restaurant was steady, not quiet and not busy either. We were seated at our table and barely opened our menus and the waitress comes by to take our order - seriously - you take your time acknowledging us coming in the front door but want us to know what we want to eat when we've merely opened the menu!? We ordered our drinks and mine tasted like soda water not 7up, I sent it back and settled for water. The girl came back 2 minutes later and asked us what we wanted to order, we had barely found the page in the menu for the pizza selection and their selection isn't half what it was a few years back. Then she comes back 2 minutes later and asks us again at least by this time we had decided on the appetizer and decide to go with the bacon wrapped steak skewers. It comes to our table 2 minutes later, that sure was fast. So I select 1 and cut it open - OMFG! Not only was it medium or rare it was Blue Rare and the bacon was entirely Raw! So that girl takes it back to get it cooked properly. 2 minutes later we have the shift supervisor at our table apologizing saying it was undercooked, ya think!!!??? this was not medium steak people this was Blue Rare!!!! Yuuuuccccckkkkk!!! Afraid to eat any more meat here we decide to split a salad instead, you can't possibly go wrong with a simple salad can you. 2 minutes later our salad comes and it was alright. Then our pizza came in the middle of eating our salads and didn't even remotely resemble a heart, it just looked like a piece was removed from the centre top. She brought our plates out for the pizza just before the pizza arrived and all the plates on our table looked so or out and old and stained and chipped and in addition 1 of them was dirty!! The server wasn't busy, was bugging us every 2 minute and can't check to see if a plate is dirty or clean before placing it in front of a customer about to eat off of it!!!??? We ate half the pizza and decided to take the rest home, so the girl brings up a box to box it up ourselves and then the side dipping sauce I wanted to take home as well and had to ask for a container for that as well and she brought it, but by this time had no utensils at our table to scoop the dipping sauce into the container and she had to then get that for us as well. Seriously?! During the course of our meal our server was at our table every 2 minutes wanting to top up my water, no thank you! I don't want a server at my table every 2 bloody minutes!! I used to eat here regularly but the menu selection and service has gone so down hill I'm not going back, I'll sooner sell a free gift card to someone else than eat here again, I'm through!","useful":0,"funny":0,"cool":0},
{"review_id":"OJ2wFy9jitAlciaVj5uWKg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"7rBPrU6UT8z2c5TbjCYpaQ","stars":5,"date":"2016-07-23","text":"HHVC you just keep outdoing yourselves every single time I do business with you!! Caught up with a busy life recently & tons of changes I realized at the last minute this morning I needed to get my dog in for a vaccination update & certificate to cross the border. Panicking I call them immediately & they fit me in in just a few hours at the best possible time that worked for my schedule as I had other appointments through the day. We're leaving to go away on a long road trip tomorrow. I arrive, they had the needle and paperwork all ready to go, in & out as always so efficiently. They comforted my dog so incredibly well & gave him his treats before & after his shot, he didn't even feel it. They ensured I understand what to watch for in case of any reaction upon departure. I would never go than other vet clinic but yours! Outstanding job as always!!!","useful":1,"funny":0,"cool":1},
{"review_id":"YhaKZntgJmb57UnDutVNYQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"J_RKa1eMNbjaSEqhagN3Jg","stars":3,"date":"2014-01-26","text":"The food, service and parking were pretty good. It's always so nice and makes a big difference when the wait staff will be a little friendly with you and chit chat a bit when time permitting as this always influences the tip I will or not leave and even help you order off the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"60lZ5cX8qKcj00Q5ODaZcg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"GQ39uk9ksAKYr0MggDLeow","stars":5,"date":"2014-02-01","text":"I love shopping here & buy practically all of my clothing & my sons clothing here - casual, business, sports, accessories, shoes & intimates here as prices & quality are always available. I will regularly shop around at various Winners around town depending on my shopping time & variety. I will go to a Winners before I will shop at a mall. I just love this chain & will keep shopping here for years to come, have never been let down. I've been shopping here for years and will be shopping here for years to come, I love the treasure hunt & find and love that when I find something that requires a bit of effort I won't see a bunch of other people wearing the same shirt unlike when I've gone to some clothing retailers who have 50 of the same shirt in various sizes. I've shopped at each Winners in town and each are slightly different. My favourite retailer, it's amazing how much variety they have packed into their stores.","useful":0,"funny":0,"cool":0},
{"review_id":"fFkWNTeilfpxmOzY6t44Iw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"21R8dLAnUix4iVlfO4K0fg","stars":1,"date":"2014-02-01","text":"I don't know what all the hype is about this chain coming to Canada. I've hear much more positive differing references about their US locations. Each time I've gone here, which has been 2-3 visits that anything I'm looking for they don't have anything close & what they are selling is a disappointment. People share with me their US locations are considerably better.  I caught a manager & expressed my disappointment & conflicting references from fellow customers regarding the variety, prices, selection & quality of what they're selling in the US and her feedback was simply their Canadian locations are not like their US locations, when people have held the bar up to this hoping for the comparable shopping experience here. Their expansion into Canada has been a disappointment for Canadian shoppers and the proof is in their revenue forecasts reality and feedback. Don't think I'm going back unless I shop at one of their US locations at some point.","useful":3,"funny":0,"cool":0},
{"review_id":"g4zwE3VNdlVWoZ_s7FOkfg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"yMIJLDOIb-J-JLPaBtHPDA","stars":2,"date":"2016-03-10","text":"Stopped in after the supper rush and weren't too sure what to order and weren't really familiar with the menu. We waited a few minutes in line and then when at the cashier were able to read the menu behind, the girl was nice and helped us order a little for take-out. The staff were friendly, the restaurant was clean and modern and brand new. There was a nice place to wait while it was being prepared and could watch the people behind the glass prepare  our take-out meals. We ordered stuffed pasta shells (there were 5 which is a small serving for $15 which was $3 per stuffed shell! ouch) then my friend got chicken penne and a caprese salad all for $46 and it was a small take out bag and containers. The servings were small and the prices were more than I would usually pay for such a small serving. We were offered gelato samples while we were waiting. Just a new restaurant in the community - tried, not very impressed with portion vs price. Done with that.","useful":1,"funny":0,"cool":1},
{"review_id":"fL0Ir-KVSW6EHzlDXIS96A","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"vrnKj6NAHfNA1_hnBi_C8g","stars":1,"date":"2013-01-06","text":"I'm disappointed with these pies now. I've been buying them for years. I've recently found the prices have gone up & the sizes & quality have gone down. I was led to believe after buying 4 dozen I would receive 1 dozen free. When I showed up for my free dozen it's not 1 dozen free but only 1 4\" pie free, I felt completely deceived, don't think I'm going back as my son prefers Michaelina's lately for much less $ & closer to home.","useful":0,"funny":2,"cool":0},
{"review_id":"azuebYK8fc-qVQJhLg6YdA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"WRVPOzgybjAtZJGn_0ucSg","stars":5,"date":"2013-05-08","text":"OMG wow I just have to update my review.\nI popped in here last week for some barfi & other yummy treats & couldn't believe my eyes. I stopped in here earlier this year & the place was undergoing some kind of a renovation. Well, people who have not dined in in the past because of what the restaurant looked like before the renovation are in for a shocking surprise! I have got to stop & eat here soon & stay & dine in - the renovations they have done are most impressive!  I just love east indian food and have tried other restaurants around town and this is the one I keep going back to. This is the only east Indian restaurant I trust in Calgary as I know the menu & have never had a single bad piece of food ever - good quality & always reliable & trusted food. \nI've been to the fancy restaurants in town that claim to serve east indian food but the food is awful.\nI've never had bad food from this place - the butter chicken, jasmine rice, naan bread, jelabi, samosa, all the other little indian desserts! Yummy!!!!\nI will always keep going back here - the food is great every single time!\nI've been here lots!\nThe people are always very nice and excellent prices!","useful":3,"funny":0,"cool":0},
{"review_id":"JD6I6IUIN6jQ_u1jF5TMhw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"2tvdTwgARXgu-5UVRcsc4A","stars":1,"date":"2014-01-26","text":"Aka Denny's Dogfood. This is the worst place I've had breakfast, had to wait and ask for service, the dishes were so old they were stained and chipped, I had a dirty fork at my table, parking was a challenge, the menu selection wasn't very good. Once was enough.","useful":0,"funny":0,"cool":0},
{"review_id":"Vzgo98rOMFv5-Vtv9FvTnA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"KMnFlu3SifyKWKVeMX1UFg","stars":1,"date":"2014-11-24","text":"Prices & food is alright. Was in recently & they've discontinued the italian wedding soup & italian sodas & we used to order those items each time we visited the restaurant. This place is seriously showing its age lately & is honestly in need of a good deep down cleaning, fresh paint & new carpets, tables & chairs. This restaurant is in the exact same condition but worse as it was the first time I ate here 20 years ago. Come on Olive Garden - how much money have you made at this location & won't pay for 1 pail of paint?!.","useful":0,"funny":0,"cool":0},
{"review_id":"CsNk7dhr2g4lcACRBJSufg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"v1C8WQR6iB0WW0W48T5pqA","stars":1,"date":"2013-01-09","text":"I haven't eaten here in years & never will again - this place was the absolute worst food poisoning I've had in my life, not once but twice - the only 2 times I ever ate there, even after my first experience & a colleague convincing me how great it was only to here of others having the same experience I did. First time shame on them, second time shame on me","useful":1,"funny":0,"cool":0},
{"review_id":"Zfvyuu0APgNQvEOa-Cnh7w","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"fndNnlL2LLaaCe2LQbYJIg","stars":2,"date":"2014-01-26","text":"The only convenient thing was the location, parking was okay. The menu was just average, prices seemed reasonable but had to wait too long to order and be seated and have the plates cleared they weren't busy the service staff were just disorganized. It seemed the only time we had the wait staffs attention was when the were constantly running around with the coffee, I would take one sip out and they topped it up and didn't even ask if I wanted more. Been there done that.","useful":0,"funny":0,"cool":0},
{"review_id":"uKLX-PKWCZYsLMwEYFtnCA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"KO5W8ahbm9rjFfx0JCSOMw","stars":3,"date":"2014-12-27","text":"I stop in here from time to time and sometimes find some cute clothes, shoes, camping or grocery items for a steal other times I go in and can't believe there prices - you have to know your prices if you're shopping here.","useful":0,"funny":0,"cool":0},
{"review_id":"LQJKqOjOgMOTpHAUph2Aww","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"q2jFLjbsCbCSc9htxv4f7A","stars":5,"date":"2016-02-15","text":"Yummmmmy, a little pricy folks but the toppings on the burger, the bun, those fry things, etc all very very good. Still mayhem with the new store in town but wow yum!!! I tried Carl's in Idaho a  few years ago & Penticton a couple years ago and very good burgers. You order your burger exactly how you like it including toppings and then find a place to sit if you can and they bring it out to you - it's as fresh as fresh can get, no sitting under a heat lamp here! Yummy :)","useful":0,"funny":0,"cool":0},
{"review_id":"epBp4zombqbPtTPCNyo3-Q","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"qms46yf3ZJmfZ1ixGoiOCg","stars":1,"date":"2016-02-25","text":"YUCK!!!!!!!\nGross!\nMe!\nOut!\nYou call this food????!!!!\nHow are there so many good reviews for this place\/stuff! How do the customers and people working at this place consider what they serve to be food?! Edible food yet??!! Everything was brown and overcooked. The kitchen looked filthy, the people working there were all wearing dirty clothes. Yuck!? They were pre-occupied chatting with each other than serving customers. Overpriced, overused cooking oil, the fries were soggy, strange meatless pieces of chicken. Blach .... once was more than enough!!\nBeen there done that and wish I hadn't!","useful":1,"funny":0,"cool":0},
{"review_id":"SC7wXrkZzYYE8NV0NZRw5A","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"W8f0UUpmVX5Vnar3TDNojg","stars":2,"date":"2014-09-12","text":"I won't buy there coffee anymore & this was before they changed it up to an even darker roast & were bought by Burger King. It's all downhill from here. I go here just for iced cappuccinos & donuts\/timbits but that's it.","useful":0,"funny":0,"cool":0},
{"review_id":"LTG-4RlxB7Bt5mhH8cqI_g","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"mkQ31BFYV8ri7znJpHd7Ww","stars":5,"date":"2016-11-11","text":"Incredible food & atmosphere! I've lived near here for years & have driven & walked past this restaurant thousands of times & snubbed it based on a previous experience by a colleague. I had very grateful & appreciative clients of mine recently take me here and I was most pleasantly surprised! Extremely well prepared and presented. Excellent food, selection, prices and service. Returned recently with family to explore the menu more. Best dim-sum in town!!!","useful":0,"funny":0,"cool":0},
{"review_id":"jPjVuZxd9OrsnsE3sBqhnA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"zzgdTix-4eDMxtiyIhesMw","stars":5,"date":"2016-11-15","text":"Who doesn't like Costco?! I recently took out a membership with them again and am scratching my head why I didn't have a membership for years. Now that I have a teenager who's eating my out of house and home it only makes sense for me now to bulk lots of food for him in bulk! I love the extra spacing parking spots - no more door dents! I love the packages of pre-cooked bacon where my son can take a bunch of strips & nuke them for 30 seconds and it's a great snack for him after school, I love the bakery, the bakery, meats (deli & fresh) & produce section. I recently bought a package of 4 pork tenderloins that I would have paid $40 at my regular grocery store I bought here for half that price. I love the cheese trays I can buy here and the variety that's always available. I recently bought a work printer here for about $80 less than it would have been any place else in the city, that alone more than paid for the membership. I recently bought a couple mondetta hoodies for $25 each?! They would have been $60-$75 anyplace else!? Love Costco!","useful":0,"funny":0,"cool":0},
{"review_id":"MgrbfQ6wWNFM8B0VvJ1hGg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"rM0Z-G5WuJ-8bGK7PtRkzQ","stars":1,"date":"2014-09-12","text":"I'm so grossed out by this place & will only use it if I'm passing by & need to use the washroom, even then I'll hover. My son went here a couple days ago & was freaked out with some of the other users & filth, he won't go back either. This place is within a km of my home & is only 12 years old but boy it sure isn't looked after. The cleaning people clearly don't know how to clean, they don't have anybody training or supervising their work, yuck! You'll be sick for certain if you use the pool. I stopped going to the fitness centre there years back because they use a community cleaning towel & watered down spray cleaner. They regularly have out of order cardio equipment that's awaiting repairs & people are lined up almost standing over your shoulder waiting for you to finish on the equipment you've just started using. If this is what a fitness centre is I'd rather not have a membership. The cost of memberships here is higher than a city facility, this place hasn't seen any renovations or upgrades in 12 years. How are the interior concrete stairs in such disrepair. & chipped away so badly? The pool is small, no slides or waves - nothing to do there either. Even the food court is a joke. Go to a City of a Calgary recreation centre. Parking is impossible even at the best of times.","useful":1,"funny":5,"cool":1},
{"review_id":"BlqfdD-qZyqD-zLz5dydbw","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"pb4eb79yDwlH8q2rWOO8cg","stars":5,"date":"2014-09-12","text":"While I don't really care for their fried burgers, I do support McHappy Day, they will always have the best French fries, just love those green Irish milkshakes, there salads are really good & believe it or not they have the best coffee in town, this is where I will go & buy my coffee from now on! It wasn't that long ago this was the last place you went for a coffee, but they sure turned that around!","useful":0,"funny":0,"cool":0},
{"review_id":"0SvsprWeFZFoE1N1WRvK_g","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"-UvOL9uw6NwLrdwGCZSxzg","stars":5,"date":"2016-02-15","text":"I've been getting my donairs here for years and the same people behind the counter for years. It's a good meaty, fresh donair every time. Clean & friendly. Thanks!","useful":1,"funny":0,"cool":0},
{"review_id":"44ZRERajddKfY4-0aphECQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"5lV09BaNcgzA1njkLfuZDw","stars":5,"date":"2013-10-29","text":"Kelvin is a true professional! Great businessman!\nI dropped my phone earlier today and began searching for repair techs over the web and found him and told him what happened and he told me he could be to my house in 25 minutes to fix and was the best price in town. He came to me I didn't have to wait for an appointment or drive across town to him.\nFast, efficient, professional, friendly, great price - what more can you ask for!\nHe even cleaned my phone and I asked for another repair and nothing of which he tried to sell up to me to generate more revenue\/business, it was my call with no pressure.\nOnly 3 weeks after dropping my phone a second time after replacing my covers & during a bad winter storm I had to call Kelvin again & he was at my doorstep in only a couple hours when he was out of town earlier in the day.\nI wonder if I should tell him I've just dropped my phone a third time?!","useful":9,"funny":1,"cool":0},
{"review_id":"Wi1qWxojSxDVXFnUD_WoWQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"Ne7gepL5wi47SEHXEd00oA","stars":2,"date":"2014-02-01","text":"I think anytime a new chain moves into the market customers get all excited because it's new and different. I've eaten here 3 times and each time have spent 1hr waiting in line for breakfast. I have felt rushed to be pushed through with my breakfast to turn over the table to other customers waiting in line for my table. I find the breakfasts are filled with fruit while I like eggs, pancakes & bacon for breakfast. I think they put too much fancy cut up fruits on your plate. The menu has a lot of choice but it seems like they're just rearranged in different formats. The waitresses seem overworked and pushed to get customers through and turnover tables. Had to wait and ask for service such as extra napkins & water.","useful":1,"funny":0,"cool":0},
{"review_id":"FrMG3ERiHn890TmCy16iDA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"1vtfUVGkcdikfBp7RSk9pg","stars":2,"date":"2013-01-09","text":"I don't understand what all the fuss is about. They're oversized, overpriced sloppy donuts. Nothing new or fancy. Just a fad.","useful":0,"funny":0,"cool":0},
{"review_id":"Q_qs-XrqNFi_5rulupiszQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"jJ7ZzUxpl8KbyJfw1tY3Cg","stars":5,"date":"2016-07-18","text":"Great Job Bob! A Very Happy Customer!! Like I said, I used to do business with you with my previous vehicle and received excellent service then and especially today!!! So very happy with the work, the price and especially the service received! I'll never understand why I shopped around last week and didn't come and see you first!\nLooking for a hitch, wiring, or service on your vehicle? Go here! Don't do what I did to save a minimal amount of money and go to the competition. Trust me, Service Counts!! This place treats their staff like family, looking after one another. I was in and out in only 30 minutes for what I needed done - a simple hitch for a bike rack. They offered me coffee up the road at a close shop while I waited, they offered me WiFi while waiting. Then they ordered me a rock deflector for the hood of my vehicle. They do more than hitches!","useful":2,"funny":1,"cool":2},
{"review_id":"fG4F2Qfq3AqbIEkcwcJjRQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"UfMyADE4CU2LDBnMjUNPkQ","stars":1,"date":"2014-01-26","text":"This place will never see me again. When I've been in in past years it's impossible to find someone then when you do & find them they don't know where something is & refer you back to the front entrance customer service for help. What broke the camels back was when I went in near the end of the summer last year because I was concerned about my lilac tree. I was referred to one individual to help with this as I was told over the phone to bring in pictures and specimens. It took near 2 weeks to get in with his schedule and playing phone tag. Finally I go in and he's helping another customer so of course I wait. Over 30 minutes of waiting and just needing 5 minutes of his time I ask if I should come back or how much longer he is going to be and the man blew right up on me. He couldn't just say come back later, he was busy sorry, or to see someone else - oh no he had to make a scene and yell at me and was quite angry with me for waiting quietly. I only wanted him to have some notice that I waited an extended period of time while he took his sweet time helping one other customer in front with paperwork. Miserable old man! Before this happened I saw a lady in the house plant section about a problem I was having with a house plant I had bought from them several years earlier. I brought in a sample and had aphids and was told to use rubbing alcohol and qtips to clear it up and hours later doing this at home made no difference whatsoever. This place will never see $.01 from me or seeking advice!","useful":5,"funny":2,"cool":0},
{"review_id":"pPjj05xxURZ37ye0pErT1g","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"fQ4nfWP8RYwdUchpiWhGcg","stars":5,"date":"2014-12-20","text":"Wow, I feel like I've just discovered this store when I've been in & out in the past & haven't really been able to find anything. Well certainly not the case this week - I bought 2 work dresses & a pair of high heeled shoes all for just $94 today! I've gotta start shopping here more often, nice stuff & quality for the price. I found a lot if there clothes were mostly available in 0-4 sizes & I'm a 6 or 8 so had to search and they didn't always have my size. Nice stuff though!","useful":0,"funny":0,"cool":0},
{"review_id":"u0d0yE39vDxv-Wt0DvcLLQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"Lym87uviWo9ieODU0qB1Xg","stars":4,"date":"2016-02-15","text":"I buy almost all of my groceries here because of the PC points and gas grocery credits because I know where everything is and about how much something will cost me, but what's frustrating is when I go to buy something and they're out of it and go back week later and they're still out of it! Really?! I like how they'll price compare and howI earn enough PC points every few months I get $20 free groceries a few times a year! Also, this place price matches, yes! If you find the same item priced lower someplace else, Superstore will match it! I always use the self check out and I always know the same lady who checks me out & is friendly and chat a little. I will never understand people who can't do the simplest thing for themselves and see them trying to use self checkout - really?! But Superstore can't help it. I occasionally go to the Huntington or Hamptons locations and they're cleaner and better stocked. When I go to this location and they don't have something I'm looking for and I go to another location and they do - mismanagement.","useful":0,"funny":0,"cool":0},
{"review_id":"68zNrsKGgXBxggJDZB26Lg","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"aGdyRoDCn6Z9_j2vIvnKNw","stars":5,"date":"2014-01-26","text":"My son and I enjoy going out monthly for our preferred meal of the day and have tried all the breakfast restaurants around town and this is our favourite! We always ask for Sue and of all the breakfast waitresses we have met she is like sunshine in the morning beginning with remembering us, some of the things we usually order and her general sunny disposition as there's nothing she won't accommodate from the HP sauce to extra napkins and sour cream and ordering my sons eggs based sunny side up and their little chubbies! This place has the Best potato pancakes I have ever had! I love that they leave the pot of coffee on the table and there isn't a waitress walking around the restaurant topping up your coffee. Prices are good, place is reasonably clean, people are friendly and parking is good. See you next month Sue!","useful":2,"funny":0,"cool":0},
{"review_id":"5VFuBhMXkEz12fni9YiwSQ","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"eQCYA7UhyVHNl_TE0Nne-g","stars":5,"date":"2014-01-26","text":"I live up in Coventry Hills and will drive 30+ minutes across town to shop here. This is the only garden centre I will shop at. Every time it go here they sincerely want to help, they don't bother me or crowd me but genuinely, warmly welcome me each time I've walked in busy day or slow day. Plants I want I can always count on them having in stock. They take the time to bring things to your attention regarding care for the plant and don't run off to help another customer who has just walked in because they are busy. As I go through the store and have questions or seeking something else one of their friendly staff will stay with you and help you along the way. When I have stopped in for advice because of problems with plants at home they immediately have an answer and suggestion. When one of my indoor plants had aphids it was as good as garbage, when my lilac tree had discolouration on leave last summer it was because of our wet spring. I've never planted bulbs til last fall and they shared tricks with me to be sure they came up in the spring. Excellent Service! Competitive prices, good parking and they genuinely treated you as a valued customer they hope to have back and I'll see you in the spring!","useful":2,"funny":0,"cool":0},
{"review_id":"eTI9QQwr3qfRu3weuB1ffA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"vuNwIrd6Dx1AK6VxS43r0g","stars":5,"date":"2013-05-08","text":"I just love this restaurant! What a fun place to eat!\nI'm a burger kinda gal, and with the tables lined with fullscap paper and a cup of crayons provided - who wouldn't have fun over a burger and literally writing all over the dinner table!\nFood, service, prices, atmosphere are all just great here!\nNever a bad meal, service, etc... here.","useful":0,"funny":0,"cool":0},
{"review_id":"xXO6WZ6JeS5HU1NlAQgSAA","user_id":"KjT3D4gZd5B-_WKgzmWjKg","business_id":"Cx4Jw_xgWwILWNt21RhK4g","stars":5,"date":"2015-07-29","text":"Yummy!!! What a treat!! We ended up here just because we were in a park close by and googled ice cream shops so decided to try it and never heard of it before but thought the other reviews we read were quite positive! I felt like a kid in a candy store!!! When you arrive you pick a cup and do whatever make you well - happy!  They have about 20 flavours of frozen yogurt, about 60 types of toppings and 4 types of syrups. I tried 6 different types of frozen yogurt all mixed in 1 cup, yes I went overboard. Then the toppings OMG candy overload, I'll start my new diet tomorrow. There's an excellent selection of healthy choices for when I return to eat better next time. Can't wait to go back as they even have a rewards program after you spend $50 you get $5 off which works out to 10% but hey what the hey I'll take it as I know I'll use that up in no time. What a treat! For certain I'll be back soon! That atmosphere was great too, fun, clean, comfortable, accommodating place to eat.","useful":0,"funny":0,"cool":0},
{"review_id":"YHe4kYY6V0_eColNLsupiA","user_id":"ZBatWYt_dvgnABATD9xjKw","business_id":"GN8-bayrDO_wZRnWx76VbA","stars":1,"date":"2014-10-17","text":"A few years ago, I came into this clinic after injuring my leg, because it was the closest medical clinic around. After waiting and waiting in obvious pain, the \"doctor\" examined it, told me it was sprained and told me to go home and put some ice on it. If i really wanted to, i could go to the children's hospital or southcentre for xrays. Unsatisfied, we went to the children's hospital, where i was xrayed and given a cast from my hip to my toes, and told i had a severe break. \"Put some ice on it\" was a lovely suggestion though.","useful":4,"funny":1,"cool":1},
{"review_id":"_4QtuSJy8CPM0An8k5GI1w","user_id":"ZBatWYt_dvgnABATD9xjKw","business_id":"SjOgDqMwZ4lgjOzVvLlVxg","stars":1,"date":"2015-05-03","text":"There's one up in canyon meadows, 5 minutes away from this one. It's smaller and may not carry everything you want but it's a better option than this one.","useful":0,"funny":0,"cool":0},
{"review_id":"Lp-v81EazPDDHqEmZ1eOHA","user_id":"ZBatWYt_dvgnABATD9xjKw","business_id":"IfCLKFjlzGJBD7XneJfFtA","stars":1,"date":"2014-11-27","text":"I give them one star because they did my nails! They lost a star for each nail that broke. Modestly priced nail services, and they looked great! Until they were all broken. No, I do not work at a construction site, or on a pirate ship or anything. If you want to look professional, avoid this salon for your nails.","useful":0,"funny":0,"cool":0},
{"review_id":"NUcHjA_KwCyefTxOggD0lQ","user_id":"Ys9ZHdHyfVwta3YCoRTT9Q","business_id":"YcRaEZaqXmrBjDYjGIHYvg","stars":1,"date":"2015-01-05","text":"I went to Jacobson's for years to get standing rib roast for Christmas dinner.  It was always fabulous.  Last year, I picked up the roast, prepared as usual, and it was dreadful.  Full of gristle, didn't taste good, etc.  My guests struggled to pretend it was good and tried to keep cutting it.\n\nWhen I called to complain, I was told they had a lot of lower grade roasts left and \"had to get rid of it\" so I got one of them.  I am quoting them exactly.  When I complained to the owner, there was never a response.  Make sure if you're going to use them that you insist on prime+ or you'll get something else if they \"have to get rid of it.\"","useful":2,"funny":1,"cool":1},
{"review_id":"PZ6OLT6JvIQiYYK8RMO6ww","user_id":"Ys9ZHdHyfVwta3YCoRTT9Q","business_id":"jTmhLR28XFUbiJ42jiHmDQ","stars":5,"date":"2015-11-17","text":"Well, like they say, never say never.  Working with my vet today with another one of my dogs who deteriorated over the weekend.  She wanted me to go to VES b\/c she had gone to a presentation by one of the respiratory specialists there and had discussed the case of my dog.  I went.  She was fabulous.  My dog is getting the best of care.  Like I said before, it depends on who you get.  This one was a 5; the other one was a 1.  But to be fair, all my trips there before, probably at least six times, each vet was a 5.  So I'm giving six ratings of five and one rating of one!","useful":0,"funny":0,"cool":0},
{"review_id":"zU8Anjh7FtB3pQT_6Vh1pA","user_id":"Ys9ZHdHyfVwta3YCoRTT9Q","business_id":"lzRlrIWuQmHVWU4zV6yZUw","stars":2,"date":"2015-01-29","text":"Have enjoyed Gus' for a decade.  Last time I went a few days ago, it was the pits.  Server never brought me my coffee, though I asked three times, until the food arrived, fifteen minutes after I'd ordered the coffee.  She seemed out of it to me; \"no problem\" was her favorite expression but everything was a problem for her while serving me.  The food, which had always been very good, was awful--greasy and slimy.  I may try it one more time (though I'll be certain not to set where that particular waitress is assigned).  If the experience repeats, I won't be back.  Don't know what has caused the change (maybe it was a one-day thing) but it's gone way downhill.","useful":0,"funny":0,"cool":0},
{"review_id":"YxbBLY1vvuOWkICEgTnTxg","user_id":"ZxY7Y5zlHM9UnmZYMhrgzQ","business_id":"GzjpOdtrQGkggGQmUN7xkw","stars":1,"date":"2013-07-24","text":"I accidentally purchased incorrect day when booking on Expedia.  They refused to assist me in recouping my funds.  \nI couldn't change my reservation even though I called them in less than 1 minute after my reservation.  I explained I was happy with the hotel and wanted to stay there, but I clicked the wrong day.  After speaking with several people at Expedia, I received the same answer.  \"Sorry, we can't do anything to help\".\nI paid $134 to Expedia for absolutely nothing and they refused to offer any assistance or customer service.\nI was a long time loyal user who spent thousands a year on hotels with Expedia and this is how I was treated.  One mistake and any \"savings\" you may have received are out the window.\nPlus, when booking through Expedia, you have no leverage with the hotel\/airline\/car company.  They will tell you to speak with Expedia, which trust me, is not a fun experience!\nPlease be careful booking through Expedia and don't expect any customer service if you make a mistake!!","useful":0,"funny":1,"cool":0},
{"review_id":"7MSfKelpit40pryn41Uslw","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"pybIuTluqRhH_BQ3CJHlLw","stars":1,"date":"2013-03-04","text":"The food's taste is never consistent. They never follow instructions. \nIf you ask for your food to be spicy number 8, some days it will be too spicy or for the most part it's not spicy at all. For the $$, they be able to deliver consistency in their food and make it the right way. Over priced for nothing!!!!!! Definitely not fine dinning. Even though they try to be....","useful":0,"funny":0,"cool":0},
{"review_id":"QzrJVBWyARU_trlaxdFBew","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"nMaIIKEAW2cTEWbEyeFyXQ","stars":1,"date":"2014-02-25","text":"Very bad customer service. Unbelievably rude. Don't ever get there delivery service. Because if they mess up on your order they are not going to fix it unless you order more food. Besides the food is not all that good.\n\nMy advice to the owner of the restaurant is to train your employees on what's acceptable customer service and good hospitality here in The United States.","useful":0,"funny":0,"cool":0},
{"review_id":"mzBXqX5eAMw-vjQlus1znQ","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"yYMTMtguT90BfMJVxasFuw","stars":1,"date":"2014-07-01","text":"Horrible service. They messed up on my food and refuse to fix it. In addition to that non of them speak English well enough to resolve issues instead they just want to argue with you. I told the lady who took my order 5 times to make sure my chicken is well done. The chicken was not well done and I checked it in front if the delivery boy. Who does not speak a word of English.\nI will never waste my lunch time on these idiots again.","useful":1,"funny":0,"cool":0},
{"review_id":"NTIB1t5ZvMvrC9vsZmchAQ","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"cxqW47z7TWaCNVO1ZWXQpw","stars":1,"date":"2014-09-07","text":"They always forget something or another for my order and then refuse to deliver it. First offense can be forgiven however it seems like a constant thing with this location. Manager Katy is rude and refused to help.","useful":1,"funny":0,"cool":0},
{"review_id":"AEkKN2_SHaOqQ8Zi5XaxkQ","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"gTlDDzDEHyDQ6iwjNhpI6A","stars":1,"date":"2016-07-19","text":"Worst Indian food ever!!!! Worst Customer service ever!!!!\nVERY VERY unsanitary. One of the servers sneezed Infront of me in the lobby and did not even go to wash his hands.","useful":0,"funny":0,"cool":0},
{"review_id":"3t1S0IX8aLWR2q6GgzO9Jw","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"yy7pPm_QGVRm6exD__Htug","stars":1,"date":"2016-06-21","text":"At 4:06pm on 6:19\/2016 I placed a carry out order for two chili chicken.\nThey served me with old left over food from lunch.\nI had Chili chicken plenty of times before and I know the difference between freshly cooked food and old left over food, very well.","useful":0,"funny":2,"cool":0},
{"review_id":"mtvhcXeAo9QQs9xYTKtaHw","user_id":"CiLks4YszswospIIbBrRPQ","business_id":"dKdApYVFDSNYsNOso6NYlA","stars":1,"date":"2015-05-29","text":"Las Vegas White Castle is NOTHING like an ORIGINAL White Castle.\nVERY rude staff.\nLas Vegas White Castle is nothing like the original White Castle we use to eat from, back in Michigan. The food does not taste the same like the White Castles in Midwest..\nThey don't even offer their best burgers in a the Las Vegas location.","useful":0,"funny":1,"cool":0},
{"review_id":"HvJrK7RKyCB2pnuKT9D71A","user_id":"pQOak-VzuQuuSl2PpK6HcA","business_id":"_WvEXsx2eZ53lTWHlIx9kg","stars":4,"date":"2016-12-26","text":"I'm staying at the hotel so I thought I'd give it a try. Hip atmosphere overall. I had a nice lunch with a view of downtown. I had the chop salad made with locally grown greens, pepitas, cotija cheese and grilled chicken. Good size portion enough for two. It was tasty and fresh. I also have the deviled eggs which were beautifully presented. Not really the traditional flavor but still pretty good. I'm curious to try their dinner now.","useful":0,"funny":0,"cool":0},
{"review_id":"f0uRdrCltKBOAugwJSZ90A","user_id":"Vl9MELj0a0yTfUBs4SfepQ","business_id":"z4TX4AepJcuhFFleFq9GzA","stars":1,"date":"2016-02-26","text":"I wish I didn't even need to give this place a single star. What a dive!!!! Guys are good looking I guess, but the staff are the biggest  assholes I've ever met in my life!!! Bouncer accused me of taking a pic (I was texting someone), grabbed my phone and then literally demanded I leave and once we got to coat check where no one could see, was shoving me and threw me to the ground. Please if you have any sense, just skip this crap and go have a fun girls night, don't waste your time here.  It's gross, the staff are horrid and treat people like shit, please for the love of god go elsewhere.","useful":2,"funny":1,"cool":1},
{"review_id":"39S_qnn5ef8ALNdujJSnbg","user_id":"iXTInfr0IH7XpaV3Rmjssw","business_id":"1yIedrVRAfAtsG2Fk0p9Fw","stars":1,"date":"2015-04-24","text":"Horrible service! They are rude the guy doesn't know how to paint a nail he just slaps the color on. I paid for a full set and manicure They didn't get my cuticles or give a little massage. Find somewhere else to go if I were you! Also it's not very clean. All around horrible. I wouldn't have come back but had to get my nails fixed the NEXT day!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"BR2jKXG6hc6TYmIugmKmiQ","user_id":"6pT4AYhEfkWfZquWcvZkhA","business_id":"KcCEAft-n9JiKPgad7y2lg","stars":5,"date":"2014-10-27","text":"Eloff was the listing agent on a transaction that I closed. Being in the mortgage industry for over 22 years it takes a lot to impress me.  Eloff  was on top of every aspect of the seller side of the transaction.  He responded to emails immediately and was a true professional.  I would suggest him to anyone looking to sell their home or purchase a home.","useful":8,"funny":0,"cool":7},
{"review_id":"CgkW6TngvEaM5fD0ezyeyw","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"aJ5Wki-RmbK381OnKvHrnQ","stars":4,"date":"2011-06-16","text":"Myself and my boyfriend along with a couple of friends decided to check this caf out one Sunday afternoon on a beautiful day in Toronto. The place has a real old rustic feel to it, almost like you're standing in your grandma's kitchen. This is achieved by the thick wooden rusty tables and the wooden cabinet littered with books and interesting knickknacks.  The kitchen is an open one with a floral pattern dress wearing chef cooking frantically behind it. We were a bit put off that she wasn't wearing a hair net but let it slide. One thing I liked though was that this place had proper ventilation, so you don't leave smelling like the food as was the case at Mitzi's Caf. We also loved that it was hidden in a nice, quiet residential area, always a favorite!  \n\nWe noticed that there was only one server on duty, which made the service less than impressive, but god bless her she was doing her very best. You couldn't really blame the server for this but instead the management for allowing one server on duty on a busy Sunday afternoon (the place was packed). Once seated we were served water right away and asked about our beverage orders to which we all said we'd have coffee. The coffee was the best damn coffee I've ever had in my life! And I've tried various kinds in my day between living in Europe and here. I even went to the trouble of taking down the name of the brand. As the service was quite slow, we had to re-fill our own coffee cups from the coffee station as well as our own water, which actually made the whole brunch experience more interactive as you almost felt like you were in a friend's kitchen helping yourself.  \n\nI ordered the salmon\/goat cheese breakfast wrap ($11), while the rest of the table ordered their own choices (all different). I have to comment on the freshly cut Paeonia arrangement in the middle of the table, my friend and I couldn't stop sticking our noses into them. The washroom was quite small but clean. Our meals came out 45 minutes after ordering but were delicious! The goat cheese complimented the salmon extraordinarily well; I was surprised at myself that I've never tried this type of pairing before. The rest of my table also expressed like for their meals. I was a bit disappointed though with the bland salad on the side. Although the leaves were all very rich in color, the dressing was nothing special.\n\nThe total bill for the two of us was $35. Even though the service wasn't the best, I would still give this place four stars, for the effort put in by the server in doing her gosh darn best, for the amazing food, for the ambiance and for the general feel of the place. \n\nA definite place to return to, but perhaps a bit earlier next time.","useful":4,"funny":2,"cool":4},
{"review_id":"uc1p20PTFEFaRJrWiDeJ_g","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"6R4GzPhlFS1n_xCO7U7Gcw","stars":2,"date":"2011-05-16","text":"After reading some great things about this place, myself and my boyfriend decided to check it out one Sunday afternoon. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. \n\nThis time around, instead of just us two, we invited 3 more couples to join us. My first impression of the cafe was spacious with a nice plain brick wall and art work on the wall for sale, features I've noticed in other popular brunch places. One drawback to this place was their beautiful front counter was facing toward the wall; it would have worked much better facing toward the doorway with fresh cupcakes on display.\n\nI also noticed that no music was played in the background, a feature I enjoy. The menu was a foldout with two sides plus the back listing drinks, as they also serve beer. Our water was served plainly, although a nice jug full of water with mint leaves and lemons would have been an extra nice touch. I ordered the Big Breakfast ($11.95) and earl gray tea ($1.50). \n\nI'm guessing they were under staffed or I sure hope so because one of their kitchen staff sporting a hairnet was going around taking orders as well as serving food, not exactly eye pleasing. I hope this isn't their usual wait staff head wear.  \n\nAfter 30 minutes, our orders arrived, although the long wait could have been attributed to the size of our party. The portion sizes were massive, you get two sausages, two bacon strips, two eggs any way you want, potatoes, pancakes or French toast, fruit and pre-buttered toast. My poached eggs were on the runny side as I like mine to be somewhere in the middle. The bacon was good, but had no hint of any other extra flavor. The sausages were a bit overdone and dry. The potatoes were nice and crispy, the pancakes were nice and fluffy, however, none of the fruits in the fruit salad complimented each other and were instead all very separate flavors, you could tell there was no thought put into the dish. We also found the meal to be quite cool and not hot at all. My earl gray tea was served in a nice tea pot but was a bit on the thin side. \n\nThe bill for the two of us was $30, pretty good price for the portions that you get, but more suited for someone who just wants to be fed as opposed to someone who wants to enjoy what they're eating.","useful":3,"funny":0,"cool":0},
{"review_id":"d_iuelZ0XQ-gZb7sKwe19g","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"K2uJfgsKunCuNKALv_mGUQ","stars":1,"date":"2011-09-27","text":"I took my jacket in for dry cleaning not too long ago. My jacket is originally white in colour, but was stained yellow over the years. The first time I came to collect my dry cleaned jacket from these guys, I came home to examine it. Not only did it not smell of any cleaning chemicals as is the norm, it was still stained. \n\nI returned and commented on the not properly dry cleaned jacket and also pinpointed the still visible stains. They took it back to be dry cleaned a second time without charging me extra. When I came back to collect my jacket which had now supposedly been dry cleaned for a second time, not only were the stains still there, I found new stains, those of ink stained fingerprints.\n\nSo not only did these guys not dry clean my jacket the second time, they left their ink stained fingerprints all over it.\n\nFinal verdict: THEE most horrible place to do your dry cleaning. You're basically paying for them to hold on to your clothes until it's time for you to come and collect them.\n\nI should add that I went to another place to have my jacket dry cleaned, and it came back whiter than I've ever seen it, which proves that it was indeed never properly dry cleaned, if at all, the first and second time around by Fast and \"Good\" Cleaners! \n\nInstead of going back a third time to complain, I figured a bad review would go a longer way as I hate being taken for a ride. I'm definitely not going back to these guys ever again!!","useful":3,"funny":3,"cool":2},
{"review_id":"uS5sQbemFaVSnrHM6x5ifA","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"03DvzzcB5ze7lacYwZbH8A","stars":2,"date":"2011-05-30","text":"Myself and a group of friends decided to check out this highly recommended eatery one Sunday afternoon for brunch. The moment we walked in, you could feel the buzz. It was quite busy, but we were seated right away. \n\nEach table was draped with a brown paper table cloth (similar to Jack Asstors style), with crayons for drawing. This touch made it a more family friendly place, as kids could draw while parents chatted with friends. I drew a tree : ) Underneath these table clothes were white linen, I'm assuming for when dinner rolled around.\n\nThe waitress brought out water right away, with a slice of lemon (without us ordering it) which was a nice touch. Most of us ordered coffee, which was served in a glass cup (very eastern European) and the large coffee pot was left at the table for our convenience. I found the coffee to be a bit on the watery side. About 5 minutes went by before the waitress came back to take our orders, a bit longer than usual, but not surprising considering how packed it was.\n\nI ordered the Lisa's Bloor West Village Special (a.k.a. Kielbasa and Eggs) ($11). I wondered if the owners were Polish, as kielbasa is a polish style meat, but our waitress told us otherwise. Our meals came out 15 minutes after ordering. \n\nI wasn't too happy with my meal as there wasn't anything that excited my taste buds. Even though the portion sizes were generous, the scrabbled eggs were quite bland, as was the  kielbasa. I was expecting it to be drizzled in a spicy sauce or something to kick start my morning, but sadly to no avail. The table side ketchup helped here. The cream cheese addition to the eggs was a bit awkward and didn't add anything to the flavor. The potatoes were also quite bland with no hint of any other taste besides...potatoes. My rye bread was nice, but nothing on the plate complimented each other. The fruit was disappointing, with half a slice of melon and pineapple. The melon was lovely and sweet, but my pineapple tasted like meat (I had to spit it out mid way). The rest of my party expressed similar dislikes. But with this place being around for the past seven years (as our waitress divulged), it must be doing something right!\n\nOur waitress only checked up on us once after receiving our meals; as I'm a huge water drinker, I kept scanning the room for her so I could have my glass re-filled.\n\nOverall, the large number of people helped create a strong buzz to this place, however, the food wasn't the best and the service okay. Total bill for the two of us, $30.","useful":2,"funny":0,"cool":0},
{"review_id":"9XjrAFKs3AjRF25At6J5qA","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"VSgrQWkpv15FJuqmNE3srg","stars":4,"date":"2011-04-24","text":"After reading some great things about this place, myself and my boyfriend decided to check it out one Friday morning. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. \n\nIt helped that before we entered, there was a sign on the door up front saying that they only accepted cash, a bit of a nuisance, but better to know before you go in than after you've eaten your meal.\n\nMy first impression was it was very buzzy, great music playing and beautiful art work on the wall for sale to keep your attention. After putting our name down on the waiting list and waiting 20 minutes for a table (we played the cross-word while we waited) we were seated next to the kitchen, which is an open one.\n\nThe service was friendly and fast, although the table we were sitting at was a bit small. You can choose from ordering off their menu or from the blackboard above the cafe area. I found that the menu was a bit more simple to follow, whereas the board was a bit too confusing.\n\nWe both ordered the Mitzi's Breakfast Special ($6.95), coffee and a large glass of OJ (freshly squeezed, $4). We also found that sausage is not served here, but bacon instead. When asked why this was, the waitress simply said that they prefer to carry one type of meat. \n\nThe wait was about 15 minutes for our food, but the art work on the wall kept us entertained. The food was absolutely delicious!! Where do I begin? The roasted potatoes, mmmmmm, nothing like I've ever had before. Roasted in some kind of pasta sauce with a hint of vinegar. When I asked the waitress for the recipe, she kindly said that it was a Mitzi's special and that it cannot be shared, smart girl! The bacon was oh so good with a hint of smokiness to it. The toast was pre-buttered (nice!) and our poached eggs were just right. And for $6.95, what a deal!! $24 total bill.\n\nThe only draw back to this place was the lack of ventilation. Because the kitchen is an open one, it got pretty warm and the faint smell of the cooking was left in our hair and clothes. \n\nAll in all, a really great place with delicious, reasonably priced food! It's not surprising that it has spread to two other locations.","useful":3,"funny":1,"cool":1},
{"review_id":"RFfF0Pp8xsCLOiAmwykTUA","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"f51YniULra1Fz01jwILh8Q","stars":3,"date":"2011-06-06","text":"Myself and my boyfriend, along with a couple of friends, decided to check their brunch menu out one Sunday afternoon on a BEAUTIFUL day in Toronto!!\n\nWe sat out on the patio, first scoring a table for four out in full view of the sun, but thankfully re-locating to a recently vacated table in the shade. The patio was full so the service wasn't as attentive as in other places, but it was good nonetheless. We ordered pints and the Irish Breakfast ($15).\n\nThe layout of the menu was a bit messy and confusing to follow, with the brunch menu stuck near the bottom of the page overpowered by the snack selections printed over top them. \n \nWhile waiting for our meals, I ventured inside the empty cottage (as everyone was sitting out on the patio). Myself having spent several years living in Ireland and my boyfriend being from there, we felt that it really pulled off the old rustic cottage look and feel to the place very well, very similar to what you would find in the rural parts of Ireland. This was achieved by the thick wooden tables and log cabin ambiance. The bar was massive and from what I could tell, had a fair bit to choose from. The washrooms were also very nice and clean.\n\nOur meals took over 45 minutes to come out. Even though we were reassured by our waitress that it was being plated 20 minutes into waiting, when we asked another waitress at the 30 minute mark how much longer it would be, she revealed to our surprise that the Irish Breakfast always takes a minimum of 20 minutes from the time of ordering to be prepared. Funnily enough, this little tin bit of information was nowhere divulged beside the dish on the menu, or verbally once ordered. Frankly, we had no idea why it took so long, as it was the worst Irish Breakfast we have ever eaten, and we've lived in Ireland!! Oh, and it doesn't come with toast, if you want a side of it, it'll cost you $3! My boyfriend was not impressed hearing this after he asked the waitress for a side.\n\nWhere do I begin, the rashers, if you want to call them that, were like min steaks, way too thick and quite chewy. The beans were just that, beans, probably dumped out of tin can. My Irish boyfriend commented that their potato farl were definitely not made fresh as he's had so many back home, he knew the difference. Small portion sizes were also a voiced complaint among us. The black pudding was quite dry and so tasted like sawdust. I found the banger to be a bit too greasy, whereas my boyfriend found it edible, although he found it to be leathery on the outside. The fried egg was good, but really overall, nothing special here. There are better versions out there, trust me!!\n\nOverall, the service was good, the food horrible, however, the beautiful weather and patio seating made up for it. Total bill for the two of us $65. \n\nMy Irish boyfriend refuses to go back!","useful":4,"funny":1,"cool":1},
{"review_id":"e_G1lb3egnLeKFOYBt8lUQ","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"RYGTF_2UlcdwDYZqL8duQQ","stars":4,"date":"2011-06-22","text":"Myself and my boyfriend stumbled upon this place while we were actually headed to another brunch place, which was packed to the rafters! \n\nThe interior is simple, brick wall, with a nice arrangement of fresh flowers on every table. The menu is divided up among two sheets, which I really think they should have just stuck with one for simplicity. The only draw back to this place was the items on the menu. My boyfriend wasn't too thrilled that most of their dishes served eggs scrambled and no other way, while other items weren't very brunchy as there were some spicy Indian style choices. Although different from what we were used to eating at Brunch, we took a gamble. \n\nI ordered the Salmon Scramble ($11) and coffee. The coffee was really good, I even had to ask the waitress for the name of it. My boyfriend liked that they were served in a basic white coffee mug. Our meals didn't take long to prepare (20 minutes) and were quite delicious! The salmon and caramelized onions went really well together. The side of baguette was fresh and different from the usual toast. The side salad was rich in color and thank god the dressing was good too, as most other places I've been to just serve greens on the side to make the plate look full, but lack any flavor in the dressing. The eggs were bright yellow and delicious. All in all, a very yummy meal. My boyfriend also ate his up, although we both thought that there was just a bit too much egg served. \n\nThe rest of the cafe was very clean and nice to look at. The counter draws your attention and the washrooms were clean.\n\nTotal bill for the two of us, $30. A definite place to recommend to friends, just don't be put off by the menu, although unique in their choice of dishes, it's definitely worth a try!","useful":0,"funny":0,"cool":1},
{"review_id":"cemJ6hlqB2lrc9e8B5xu5Q","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"5PO5ZIHIcaTNIiHNoRKDqg","stars":2,"date":"2011-04-17","text":"After reading some great things about this place, myself and my boyfriend decided to check it out one Sunday morning. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. \n\nOur first impression when we arrived was comfy. It wasn't very busy so we were seated right away. The service was friendly and fast, although when we asked if the heater beside our table could be turned on (it was chilly), we were assured that it would be, but unfortunately this did not occur. So we were pretty much glued to our cups of coffee to keep us warm, which was very tasty. The waitress was even kind enough to inform us of where their coffee came from, a nice touch of table side romance.\n\nLittle things I noticed (I'm all about the small details) is the table sugar was stored in a container used for salt, which when poured streamed out at a snails pace. I liked the menu though, only one page and very simple, although a bit pricey. But seeing as the location is a prime one, I guess this makes sense. \n\nWe ordered the Breakfast Platter ($13) and were told that it was quite filling for once person, so for two it would hit the spot. And seeing as I always ate less than my boyfriend anyway, we thought this would be the perfect choice. As an add on to the dish, we could also choose a side of beef for $2, but we substituted for bacon and sausage. \n\nOur meal was delivered approximately 25 minutes after ordering, which was quite a wait considering it wasn't a busy morning (two other occupied tables). The pancakes were nice and fluffy, although our sausage and bacon were quite disappointing, with one and a half strips of bacon and two sausages the size of a pinky finger. The sausage was good with a spiciness to it which was lovely. Our eggs came out fried even though we asked for poached. \n\nAll in all, the Breakfast Platter didn't hit the spot at all, as we were still quite hungry afterwards. \n\nThe bill was $27 in total, although we noticed we were charged $3 for the one and a half strips of bacon and $3 for the two pinky size sausages. When we questioned this discrepancy (as it said $2 side on the menu), and our surprise at the ridiculous price, we were given an embarrassed shrug from the waitress. \n\nEven though the food was good, we will not be coming back.","useful":3,"funny":0,"cool":1},
{"review_id":"Z09_IXQ0WRPy80Nhw7Dgug","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"nu-DHeDtxnOW5vYj93dGPQ","stars":4,"date":"2011-05-09","text":"After reading some great things about this place, myself and my boyfriend decided to check it out one Sunday afternoon. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. \n\nBecause of the beautiful weather, we decided to sit outside on the patio. It was about 1 in the afternoon but we were seated right away. I found the menu to be a bit too busy, whereas my boyfriend liked the layout of it. We were served water right away, which was presented nicely in a tall, thin jug. Even though it was our waiters fourth week on the job (he informed us later), he was friendly and efficient. \n\nI did quickly take a look at the interior. I really liked the unique layout of the bar area, a real eye-catcher once you enter. However, the rest of the restaurant had more of a diner feel to it accomplished by booth seating, which wasn't anything special.  \n\nWe ordered coffee ($2), which my boyfriend thought was a bit watery, fresh large orange juice to share ($4.25) and I had The Standard breakfast ($9.25) with poached eggs and bacon. Our orders came out about 10 minutes after ordering. The poached eggs were in their own little container, which I liked; less mess! Although they were a bit too runny. The bacon was not as crispy as I would like it, but very tender. The rye bread was pre-buttered (always a favorite), and the fried sliced potatoes had a hint of paprika on it which was lovely. I wasn't a huge fan of the green salad as it had no flavor to it; a bit of dressing would have made a difference. Although the addition of blueberries was nice visually and to the taste. I also liked the addition of a slice of melon; I have found it's always good to pair off greasy food with a bit of fruit as it seems to take away from the greasiness.\n\nThe total bill was $34, a bit pricey, but for the nice seats, beautiful weather and great portion sizes, it was worth it. Definitely a place I would come back to.","useful":2,"funny":0,"cool":0},
{"review_id":"HcA6lRL7Q17TAhWFKjLxvg","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"DizSoX0FqH_EvXSHW6wEIQ","stars":3,"date":"2011-05-02","text":"After reading some great things about this place, myself and my boyfriend, including a couple of friends, decided to check it out one Sunday afternoon. I'm also planning on opening up my own breakfast cafe in the near future, so visiting and comparing various breakfast places is also helpful for my own market research. \n\nIt being a busy afternoon, we had to wait 10 minutes before being seated. One drawback to this place was the size of the hallway, with people ahead of us already waiting, we had no choice but to wait out in the rain.\n\nThe layout is very long and narrow, with a simple brick wall. Very few artwork on the wall though (I saw one in the corner) so nothing to catch your eye while you're waiting for your meal, although the bar was neat to gaze at. \n\nOnce seated, the service was fast and friendly. I ordered the Hardy Gal Breakfast ($9.95) and the cafe latte ($3). The latte was delicious but disappointing that it was served in a glass cup (as it makes it difficult to hold the hot contents). The menu was one page with the second dedicated to drinks. There was also a little section welcoming and thanking customers, with some history of the place included, a nice touch.\n\nOur meals arrived exactly 9 minutes after ordering, pretty fast, and considering they were full on packed, quite impressive. \n\nThe meal was good, but nothing spectacular. The bread was pre-buttered which I'm always in favor of. There was also a small shredded apple salad included which was lovely and complimented the rest of the dish nicely. When I asked for ketchup, it was served in a shot glass, hmm. Although I was satisfied with my portion size, the rest of my table was not. Total bill for the two of us, $30.\n\nOverall, nice food, nice buzz but a bit overpriced.","useful":2,"funny":0,"cool":0},
{"review_id":"I9RjHgYvhlNUAGehRMAIdA","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"XmgdFa3G_CZVfjtQEJMZfQ","stars":4,"date":"2011-05-26","text":"Myself and my party stumbled upon this place by pure chance as we were actually heading to another brunch place which apparently was closed...on a long weekend!!\n\nMy first impression was spacious! And I just loved the cute little bar, back rest counter high white stools and a full drink selection. Only around for a year and a half, it seemed to already have made a name for itself, with its handful of cut out newspaper reviews proudly framed on the wall as you walk in (and the first thing you would see, which was a nice touch to the place). We guessed from the blown up photo of some dude in a chef outfit crossed armed and full of attitude was the owner\/chef himself. All this gave a nice personal touch to the place.\n\nOnce seated, we were served right away by an eager waitress. I ordered the 'Breakfast Special' ($9), although you're tempted to say 'I'll have the Breakfast Special 9' as the number '9' reads as part of the dish name instead of the price itself, perhaps something that can be improved on just for ease of clarity. After the fumble, we were reassured that many make the same mistake. Tea or coffee was included in the special, so I ordered earl gray tea, which was served in a small teapot compressor.\n\nThe menu was the actual table mat, blue and white in color with a fair selection of items. We noticed that their smoked meat sandwich's were a big hit, something to try for next time. We also noticed that the milk was annoyingly served in a small tin container, and there being 5 of us in total, it became a bit ridiculous asking the waitress to keep making multiple trips back to the kitchen to keep re-filling the tiny buggers!\n\nFour of the five meals came out after a 30 minute wait; my boyfriends came out 15 minutes after that. This was a bit annoying to be honest, but compensated for after receiving an apology from the waitress along with a five dollar coupon for our next visit (we're easily pleased) always a nice touch and appreciated. Although for that even extra nice bit of touch (going the extra mile as they say) it would have been even nicer for the 'don't mess with' owner\/chef guy to come out in person and apologize for the long wait. I never understand why some restaurants don't do this, it shows the restaurant cares just that little bit extra, changing the customers opinion of the place from 'I got a fiver for my next visit' to telling their friends about it. I saw Mr. attitude himself so he was there.\n\nThe meal was nice and the portion size just right. Eggs were a bit too runny, always a favorite! But their hash browns were yummy, complimented very well with the apple sauce addition. Their bacon was a bit too hard and their fruit salad was just that, fruit! Nothing really here to get me to come back, although I wanna try that meat sandwich!!\n\nThe total bill for the two of us was $27, not bad for what you get. If I'm ever in the area again, I'll give it another shot, I mean we do have that fiver :)","useful":2,"funny":1,"cool":2},
{"review_id":"oSFnSm9oAu4UyuQ_oeG9Rg","user_id":"MGU_MeGj51wBjhD0T8vUgA","business_id":"BjoU3Mf7nc_A-H3NS8EXbQ","stars":1,"date":"2014-07-26","text":"Where do I begin?! I was incredibly unsatisfied with fresh city farms! The amount of produce you receive is not nearly worth the money you pay, every time you have a question or an issue, their 'member support' number never connects you to a person and you have to leave a message which they rarely reply to, and the only option to pay is via pay pal which fresh city farms kept saying that there was something wrong with my credit card. There isn't anything wrong with my credit card, I use it all the time, so clearly the issue is with pay pal, but Fresh City Farms insisted that it was an issue with my card. When I e-mailed them to try to arrange an alternative payment option, I never heard back, even though their automatic message reply says they 'aim to reply within the next business day at the latest'. When they did finally contact me, it was regarding my outstanding balance and that I still owe it (which I already knew!), instead of a reply to my query regarding an alternate payment method. I had to cancel my service after two weeks and am in the process of looking for another provider.","useful":3,"funny":1,"cool":0},
{"review_id":"IqIUb45siw4oct0M3xHCiw","user_id":"L3cdLqBQzYUKOUxbSCi99g","business_id":"4eP4sX4NXyDSdGBE8RAoJQ","stars":5,"date":"2012-06-12","text":"I live across the street from Primo Veal and make it a point to have lunch there every Friday. Try the hot peppers on the veal sandwich. PRIMO!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"c-F9i8wby0_nKkfNe-oMww","user_id":"L3cdLqBQzYUKOUxbSCi99g","business_id":"zXuWHM45eDmW04CaDbQfKg","stars":4,"date":"2012-06-13","text":"Nicey's jerk chicken marinade is as good as any they sell or any I've tried. \nThey stopped making the spicy version to my dismay, but the regular is still great.","useful":0,"funny":0,"cool":0},
{"review_id":"OUnXmE5fOopy8dllRsseuQ","user_id":"3uA4WiG7DkCQP798QEs-Gw","business_id":"PU-CSnMYXizOS3uhr316eg","stars":5,"date":"2014-12-03","text":"Definitely something everyone has to do at least once. A great little outing for the family.  Nostalgia for a few dollars!! Worth the trip","useful":0,"funny":0,"cool":0},
{"review_id":"Bw2QhjSktD-XRQQrfaa68A","user_id":"3uA4WiG7DkCQP798QEs-Gw","business_id":"AUes4OUyO4moaB6WPi88cA","stars":4,"date":"2014-06-29","text":"Nice atmosphere. Beautiful bar and restaurant. We had a party of four I ordered my meal and our server was courteous and knowledgable about the menu. Ten minutes later she came back to tell me they were out the the dish I ordered. I understand they run out of items at times. But the time that lapsed was too long. I was uncomfortable and ordered something quickly that I probably would not have chosen under normal circumstances because we had somewhere to be and I didn't want to waste time.  Otherwise it was good. I would recommend it. However this small incident changed it to a 4 star.","useful":0,"funny":0,"cool":0},
{"review_id":"s1CxeDb9r8JpX88gC1BlPA","user_id":"3uA4WiG7DkCQP798QEs-Gw","business_id":"wLV7MpP_uDc2OuzFcU0ZZA","stars":4,"date":"2014-08-14","text":"Good food. Good service. Nothing spectacular but I would go back for sure. Diverse menu and clean. Overall good experience","useful":1,"funny":0,"cool":0},
{"review_id":"ubXL1KDln3Ka4tpCbvbi8w","user_id":"3uA4WiG7DkCQP798QEs-Gw","business_id":"gae9LAyt7Qvf_OgAkWASxA","stars":1,"date":"2015-11-12","text":"I wish I could give this restaurant zero stars. It was the worst experience of my life. Never ever go there!!!! Food was terrible. Service was horrible. My family used to go there at least once a month for years and years. But I can honestly say this location is a disgrace and should be shut down. We used to like it so much we chose this chain when we were on a family trip.  Being that it was always consistent. The experience I had will force me never ever to go back. Frankly I'm appalled at how much it has gone downhill in the past few years. They offered to comp my garlic bread for my poor experience. I said I would pay for it. I wanted the manager to understand I'm not trying to get a discount. I was complaining so she would realize how many things went wrong with my experience. \n1. Dirty table and booth\n2. Not greeted timely by the waitress\n3. Drinks were not refilled\n4. Garlic bread did not come out with app as requested\n5. Manager said ticket time for dinner was only over 30mins even though we put it in over an hour earlier. Claiming the food is put in after the app. Which is fine if the waitress courses it properly. However 20 mins after we ordered we were told that they were out of ravioli. And we're treated as if we were inconveniencing them. \n6. Manager talked to us and tried to be friendly but did nothing to speed up or improve our service\n7. The kitchen staff was laughing and yelling so loud I could here it from the dining room\n8. Bathrooms were a disgrace. Dirty and smelled\n9. Table tents were dirty \n\nI always patiently wait if I see my waitress is busy or I can tell the staff is overwhelmed. It was a Wednesday at 8. Maybe 3 tables were there and plenty of staff. I consider myself to be a reasonable person. I cannot fathom how this place is even open. The location is phenomenal. But everything else about this restaurant is gone. Save your money. The buca of the past with great family style American Italian food is now a dilapidated she'll of what it was.","useful":4,"funny":3,"cool":2},
{"review_id":"UVO5JiUoYpe_Xj7EEEEJqQ","user_id":"3uA4WiG7DkCQP798QEs-Gw","business_id":"nxo1C5te8Aug-Lf5D_0b1A","stars":3,"date":"2014-12-03","text":"So sad!! Used to be the best mall in\nThe area. Gone downhill. It's still clean but limited stores and it has a sad feel. Not sure his much longer it will be operating with so few customers!!","useful":4,"funny":0,"cool":0},
{"review_id":"OywclTNgBJGnX-4B-2ri2w","user_id":"Lz6Kv2qpepaV3zRKFIX8vA","business_id":"xG2DxjHdoUf3frxogIeTAg","stars":4,"date":"2014-01-08","text":"It's a great Canadian institution no doubt whatsoever. I have found over the years I search out the older staff when I have questions as I typically find most of the younger staff to be total gear snobs. There are obviously exceptions.... Nevertheless, the MEC products are of exceptional quality and the return policy on gear is fantastic. Footwear dept is always awesome upbeat and helpful and always seem to be the busiest!!! Some of the other depts could take note(ya I know broad strokes...)","useful":2,"funny":1,"cool":1},
{"review_id":"O05ulMRksbgjsL5was_jsA","user_id":"Lz6Kv2qpepaV3zRKFIX8vA","business_id":"R8TSCE3fqfDBLAx52jGGgA","stars":5,"date":"2015-05-04","text":"Tried twice both times food was above expectations. Pasta, pizza, craft beer, unique decor, some sidewalk seating. Fantastic","useful":0,"funny":0,"cool":0},
{"review_id":"mc7N_tzf33KS1Zp1GWya0g","user_id":"Lz6Kv2qpepaV3zRKFIX8vA","business_id":"AnemBUVAb9NRaselL2KITA","stars":5,"date":"2014-01-08","text":"Stumbled on this little family run sushi joint on the coldest night of the year before a leaf game. The green tea and Miso soup was some the best I've ever had. The small private booths were wonderful and cosy.  The sushi & maki was fresh and yummy. Service was friendly warm and relaxed\/comfortable yet traditional.  Wouldn't hesitate to return....the leafs stunk out the rink the sushi was the highlight of the night","useful":0,"funny":0,"cool":0},
{"review_id":"baciZngw63B6B0Yt46I0pQ","user_id":"Lz6Kv2qpepaV3zRKFIX8vA","business_id":"kofI6fYlJNEkmoixu9YAIQ","stars":5,"date":"2017-09-04","text":"Fantastic location, fantastic food.  Have been several times, food is consistently good and the patio is one of the best for people watching.  No complaints on this place!","useful":0,"funny":0,"cool":0},
{"review_id":"a8-0tTxscSdOnbMtLdqzRw","user_id":"Lz6Kv2qpepaV3zRKFIX8vA","business_id":"Sk0Ycurq7D083Qs8x65b_Q","stars":5,"date":"2013-10-07","text":"Spectacular meal. 7 course tasting menu, custom cocktails, beautiful ambiance. George's ingenuity never fails with no repeat dishes after several tasting menu's. The service is attentive but discreet allowing for an intimate dinning setting. Great spot for a couples night and larger groups.","useful":0,"funny":0,"cool":0},
{"review_id":"pQUGF2IPLnTlkcwnrCIzBQ","user_id":"wurYoEWBgx9dszMcZYVe7A","business_id":"R6jrBo4D8zX87rSAN6TiCg","stars":5,"date":"2016-04-25","text":"If you have never experienced a 'float spa' this is something I would definitely recommend. Floating is unique and as close to 'zero gravity' as you can get and is a mind, body, spirit experience of total relaxation. The staff at the True Rest Float spa were wonderful and made the experience even better. The facility is beautiful and had all the amenities that made my experience truly a spa day. Loved the herbal teas and flavored waters offered after my float. Thank you True Rest!","useful":0,"funny":0,"cool":0}]