[{"review_id":"Iwpg6s7K9kkaE4cl11R3Lg","user_id":"v8IDJd0m4QOamuvkq7N2gA","business_id":"Vti2Kkh_SwEXcyWiCIY1Zw","stars":1,"date":"2016-10-02","text":"not good all the food has no flavour. Crispy beef is soggy with no flavour at all, pad thai is awful again not an ounce of flavour and i'm pretty sure they don't know what thai style curries are because that is not what I was served at all. We will not order from here again.","useful":0,"funny":0,"cool":0},
{"review_id":"EK1fBd65ZMr_tmmHrBFmnw","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"5GJ60TyviQnyg2257CAGuA","stars":5,"date":"2015-10-08","text":"Waffles, sandwiches, and beer! Who ever thought of that!? Really random, but it works! The interior is more appealing than the exterior. I came in for a light dessert, and what I ordered was perfect. I love how light and fluffy these waffles were. I will have to go back to try the chicken and waffle sandwich.","useful":0,"funny":0,"cool":0},
{"review_id":"g6x8-riHzIhTwfQp8-VKVQ","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"Abm-1HRGPyevBtnC3Rpxag","stars":5,"date":"2015-11-02","text":"Dropped in for lunch and was seated right away. This is my go to place for a quick meal. I've been back a couple of times and the service\/food never fail. I ordered the chicken fried chicken, and bourbon pecan pie for dessert. Both tasted amazing!!!! The waiter kept on checking to see if everything was going well, and made sure I had everything that I needed. This place deserve a better rating! So, I hope my 5 stars will help :)","useful":0,"funny":0,"cool":0},
{"review_id":"g_4koAkl_XkqI9Z_TIe-7Q","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"MQEpDvkdL39hh1N0We3Vaw","stars":5,"date":"2015-09-11","text":"Randomly showed up during their trial tasting event and the food was complementary :) \n\nThe service was perfect! The food on the other hand, needs a bit of work. Since it was only a test trial, I was asked to critique the food and service on their printed menu. \n\nThank you to the owner who invited my friend and I in to partake in the event!","useful":1,"funny":1,"cool":1},
{"review_id":"IWugpLE5M9iyjK5JX-4gQQ","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"WbJ1LRQdOuYYlRLyTkuuxw","stars":5,"date":"2015-10-17","text":"This place is awesome. Their \"small plates\" option is not actually that \"small\". We ordered 4 small plates and it was a lot of food! I love the portions and the food was delicious! Service was awesome.","useful":0,"funny":0,"cool":0},
{"review_id":"Jmlzk6ksVNrYaRAsLCQCww","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"NcyEhCGBmPxyNROy0mLsFQ","stars":1,"date":"2015-11-05","text":"Here's a tip, just don't go here. The food is mediocre and it is in uptown? Why??? Meats were so dry and burnt. Seriously, hire better chefs or cooks!","useful":1,"funny":0,"cool":0},
{"review_id":"QRhFuk3T8-ZQjmIPfo1KfQ","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"a1v8QIdbA_HTg_YyNlBY_w","stars":5,"date":"2014-03-15","text":"Great food, great service. Ask for Kathy... She is the most personable and sweetest waitress I've ever met.","useful":0,"funny":0,"cool":0},
{"review_id":"F5q7mQHKxuaf3qfCEAIvPw","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"XagMSw5tADQbNSx0IM7TaA","stars":5,"date":"2015-11-08","text":"I love this place! It is so uber adorable! It has everything for gifts. I found cuticle cream that I absolutely needed. If only I like to read, the books in there looks interesting lol.","useful":1,"funny":0,"cool":1},
{"review_id":"ZDVU-1e4KP5yjc1TvFn-_Q","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"sYJaNxG8KLus6U7TJ2JHWA","stars":5,"date":"2015-11-02","text":"My first ever basketball game, first time in the arena for their first game of the season, lol. I swear, I thought the Hornets were going to win. Hornets 90 Hawks 92. Not too shabby! I'm not a sport fan, but it was nice to watch. Loved the arena!","useful":0,"funny":0,"cool":0},
{"review_id":"dVq4BUtMoGFLeaT9Xrmfdg","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"hggVnGwA5042-ABxqeJX-A","stars":4,"date":"2015-10-30","text":"I have been looking forward to check this place out after seeing all the delicious looking pictures on Yelp. My initial thought of the place was, small but upbeat. Service was fast. We only had to wait 5-10 mins. The down side, they don't take reservations and open only for 5 1\/2 hours! Man, wish I could make up my own work hours! \n\nWe ordered 6 dishes total: steamed bun, mussels, Korean beef, pork carnitas, ramen, and caramel apple cobbler for dessert. \n\nSo, here are the rankings based on my taste palate :D\n#1 steamed buns and caramel apple cobbler\n#2 mussels and Korean beef\n#3 pork carnitas \n#4 ramen \n\nThe ramen was pretty bad. Why is it even on the menu if it taste that bad? \n\nOverall, I enjoyed my experience, and would go back to try other items on the menu.","useful":0,"funny":0,"cool":0},
{"review_id":"LhD50hQ2stvZGlt9cB5PRg","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"D2ojX9bvE0_-aIj9BhdZZA","stars":3,"date":"2015-11-08","text":"We came in for brunch and was seated right away thanks to opentable. Placed orders in but had to wait 45 mins on food. I ordered their special, pork belly sandwich with fried grits, but the sandwich buns were burnt and harden. Told the waitress to take it back. The re-placement buns were a lot better. Food was okay, wouldn't say good, more on the mediocre side. First and last visit.","useful":0,"funny":0,"cool":0},
{"review_id":"CczeIdqeSZZilhkwpkcX4w","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"uDb1lOfDhl_VLmAbYvp-vQ","stars":5,"date":"2015-10-08","text":"Holy cow! These slices are bigger in person than on pictures! I ordered their Oct special which was the smoked pork pizza and my friend ordered pepperoni. Both are delicious. I will come back to try their other ones! Best pizza I had in a while.","useful":1,"funny":0,"cool":0},
{"review_id":"VxV47XStn78TkFz0ftg85Q","user_id":"cbfivZddqFY3QBf3uZ-m8w","business_id":"H9a6IRS0edhW343Y2kXSSA","stars":5,"date":"2015-11-08","text":"We came in after a fail mission at Tupelo Cafe because of the 1 1\/2 hour wait on a Saturday for brunch. Got seated right away, no waiting! Service and food was great. Nice interior, very clean. Will go back again.","useful":0,"funny":0,"cool":0},
{"review_id":"RSDMG7uaYd_id4ZyhJ-yOQ","user_id":"8HaK2BDUTikim7jNXTW1nQ","business_id":"bQ_wtZvMb__OhprY5bF9aQ","stars":4,"date":"2014-09-26","text":"nice to have a taste of home in las vegas.. we only had the crab cakes... but the were good...not great.......probably coulda used some more dry mustard and old bay....really looking forward to coming back for some crabs............ HOW BOUT DEM O'S HON...","useful":0,"funny":0,"cool":0},
{"review_id":"teGCvLVP2oX4qIyPHgNCIw","user_id":"8HaK2BDUTikim7jNXTW1nQ","business_id":"V2WLiBR3iGaegRAVNjOndA","stars":2,"date":"2014-09-26","text":"BLAHHHHH....looked way better then it tasted.... under cooked noodles, over cooked meats.....no thanks...wont b coming back....","useful":0,"funny":0,"cool":0},
{"review_id":"izR3eycO_Ugg4DxAgaesRw","user_id":"8HaK2BDUTikim7jNXTW1nQ","business_id":"-9YyInW1wapzdNZrhQJ9dg","stars":1,"date":"2013-08-02","text":"EEEEEEEWWWWWWW GROSS CITY ..AS MA DUKES WOULD SAY.! food is absolute garbage...yet everytime i still go again n again.....most likely just because i was being lazy and our V.I.P. card lets u walk to the front and get right in.. so free n quick plus the free beer n wine are another plus...... not the vegas buffet expierience you are expecting... if u wanna clear out your pipes go ahead and give it a shot....... MAY THE POO BE WITH YOU","useful":0,"funny":0,"cool":0},
{"review_id":"uQI07i-gboOX0fzhS_uwkA","user_id":"8HaK2BDUTikim7jNXTW1nQ","business_id":"ByFMv3p5X1aNeZhU61rDcA","stars":4,"date":"2014-09-26","text":"just stayed at the stratosphere for 10 days.......and my room was very clean...bed was comfortable . pretty helpful and attentive staff.great price (except the extra $200+ resort fee) we also enjoyed the pin up show...and the fact they turn the theatre into a great spot to watch nfl games on sunday.....AAA++++...i'll b back","useful":0,"funny":1,"cool":0},
{"review_id":"Zp9ZrNbwXPcL70L1MTehBw","user_id":"kK2AgOEZZ0dJeHx8l2GjMA","business_id":"PnlYLo4O0IymPhJB41Iabw","stars":5,"date":"2010-03-24","text":"I love this business! They're are a family team that does excellent work, and they are also reasonably priced! I have brought a birthday dress and on my most recent trip about ten pieces of clothing. Mom and Dad tailor the clothes and their two children work with you to get pricing and fit correct by translating. Their daughter is attentive and friendly and their son is very nice. I love going to get my clothes tailored because I know it will be done right. I will never go to another tailor! I noticed on my last trip there are many return customers and one gentleman didn't even try his clothes on, he was that sure of their tailoring skills! I think that's the highest compliment they could be given. I am telling you to go to Expert Tailor!","useful":3,"funny":0,"cool":2},
{"review_id":"rKztDKNCRTYQgqVyWK4VCA","user_id":"yaHS6znivcj08iK0Azi9fg","business_id":"_HboH55t0MnGVaDxzuogdQ","stars":1,"date":"2015-07-22","text":"My brother and I came into this location and we were the first ones of the day. It started out that they were out of steak which we understand that happens. But then as we sat down we overheard a tall guy behind the counter talking to who we thought was a customer about how bad the employees the night before did. He mentioned them by name and basically continued to bring them down while making himself look good. Come to find out the one he was talking to was the general manager and family sitting down to eat. Regardless of the night before, it is extremely unprofessional to be speaking where everyone can hear...especially the managers. We came in to eat not.to listen to the stores problems and especially not to listen to other employees get bashed by the GM and others. Considering you (and I won't mention your name) was standing behind the counter doing nothing the whole time we were there, you have no room to talk about others. We did however receive excellent customer service from a guy named Michael. Thanks for that! Michael, you get 5 stars! I hope your peers can pull their heads out and knock this kind of behavior off and be more professional. Thanks.","useful":0,"funny":0,"cool":0},
{"review_id":"Za5t1_WFXaZwBdJwzZ0vUw","user_id":"yaHS6znivcj08iK0Azi9fg","business_id":"JU2K7-ZmLZWc43ASTs7T1Q","stars":5,"date":"2015-07-30","text":"Amber the bartender is awesome. Very nice and happy!  Plus the wings were super HOT unlike the other native I go to. I'll be back!","useful":1,"funny":0,"cool":0},
{"review_id":"gxqL3RuxhBIF18JuY_4Vfg","user_id":"yaHS6znivcj08iK0Azi9fg","business_id":"vu_jrjVKFPLW-iFHq6sRCA","stars":5,"date":"2014-03-30","text":"I love barros. I am probably their best customer. I am there at least 3 times a week either getting a well priced beer or having my favorite pizza. I love that they actually know me when I come in. Great place and great food.","useful":0,"funny":0,"cool":0},
{"review_id":"cnYpvLzQ70D47SJFUME5Tw","user_id":"yaHS6znivcj08iK0Azi9fg","business_id":"J6VKpVFPlE25NVSt8PUONA","stars":5,"date":"2015-07-28","text":"I just left and had amazing service. Unfortunately I did not catch the guys name. White guy with glasses and said it was only his 4th day. Good job man!","useful":0,"funny":0,"cool":0},
{"review_id":"rx1gg66gRCvQtDWrGa30MA","user_id":"yaHS6znivcj08iK0Azi9fg","business_id":"nrqN45BQyxDjXy2q3VdolA","stars":5,"date":"2014-03-26","text":"I like this place because of a few reasons.... 1 the pizza is cheap and still maintains a pretty good quality. 2 the arcade games make me feel young again with old school ninja turtles and mortal combat. 3 great place to have a family meal because there is a kids room with tons of seating. I'm just surprised I've never been here before until recently.  Great place!","useful":0,"funny":0,"cool":0},
{"review_id":"k6Sgq3lnR9ByT273M7AymQ","user_id":"YkhLw6B61bhYUSAWXFJaRg","business_id":"J3FUxMAHfCl-WFo86u5DqA","stars":1,"date":"2017-08-18","text":"First of all, they are late in letting people in. If you are headlining a show at a major hotel, you should have it down by now. We bought 3 tickets at $98 a piece for the 9pm show. 15 minutes later we entered. \nAuditorium was nice and the A\/C temp perfect. Then it was downhill from that. The first 5 minutes or so, your reading a teleprompter introducing guest in the audience. Then it's 3 guys in blue suits doing stupid stuff. Drumming, barfing stuff and catching food stuff with their mouths. What a WASTE of money. Should've watched one of the Circus \"O\" Shows. \nTo top it off, self parking fee was $10, NO VALIDATION! Never again am I visiting this Hotel or seeing any of the shows there. My brother in law was disappointed with the Cris Angel show there too.\nThese are my opinions, but you can see the show for yourself and write your own review!","useful":2,"funny":0,"cool":0},
{"review_id":"8qJ44cl7RmbicqLkjitfrw","user_id":"PPAKAadwoPpVuHvV9otraA","business_id":"4OhQMzX1xrc8_bGwSpmMEw","stars":1,"date":"2015-10-15","text":"I got a staph infection on my toe from this salon after a pedicure.  Too bad, because I do think they do a nice job!  I am receiving medical treatment and reporting them to the Dept of Regulation and Licensing.","useful":3,"funny":0,"cool":0},
{"review_id":"ryxcBcS4vPgdaghsGVIy5g","user_id":"PPAKAadwoPpVuHvV9otraA","business_id":"NM9bHlBOZV0o8G3s6QN1Lw","stars":2,"date":"2014-12-04","text":"We've been going here for years and have always been very pleased.  But the practice has gotten so big that they are always running late and the appointments take forever (because the dentists are juggling many patients at any one time slot).  Good luck getting an appointment that doesn't involve taking time off work or pulling your kid out of school.  I just called to change an appointment a month in advance and they could not find me an after school appt for FIVE MONTHS (and this is just for a cleaning!)!  I think we'll have to switch to a different practice.","useful":1,"funny":0,"cool":0},
{"review_id":"9YoWtbMyC_TeG94iEwYE2Q","user_id":"PPAKAadwoPpVuHvV9otraA","business_id":"25FQZfGDmN-W5Zw99SzIug","stars":4,"date":"2015-12-31","text":"Have used these guys twice now, for basic stuff, most recently a toilet that kept clogging.  Two thumbs up for everything from scheduling, to timeliness, to friendliness of techs.  Will not hesitate to use them again.","useful":0,"funny":0,"cool":0},
{"review_id":"fg0dIMBUq5HvtCBEIb64iQ","user_id":"XE4u658wVTq711GDPTCjhQ","business_id":"F87ttJCwWdQccR4Wlr9j0A","stars":5,"date":"2014-12-18","text":"A lot of tattoo shops can be pretty intimidating when you are a newcomer, but my first experience at Golden Rule was nothing short of amazing. I made my appointment with Jonathon Penchoff (IG: EarthGrasper) months in advance, and communicating with his assistant Paul in the time leading up to our session was quick and easy. Paul was real attentive to my questions. When the day finally arrived, I showed up to the shop and while Jonathon put the finishing touches on my AMAZE-BALLS design, I sat in the customer corral and enjoyed the shop banter between all of the artists. Jonathon was especially easy to get along with, not a jerk at all. Once the tattoo was drawn up we quickly got down to business and Jonathon worked his magic quickly and efficiently, and was very friendly through the whole process. My tattoo is EXACTLY what I wanted, within the budget I'd set- I'm incredibly happy with it. And, to top it off, when we were done HE GAVE ME GUMMY BEARS!!! I love the talented, friendly, and professional talent in this shop. Highly recommend.","useful":1,"funny":1,"cool":1},
{"review_id":"I_V_xIcqV5ASClhJOiK66Q","user_id":"SjnK9Wal-ZHgR8uhe7vzZg","business_id":"hihud--QRriCYZw1zZvW4g","stars":5,"date":"2016-06-12","text":"Very nice food and service! \nFirst time here, I visited here when I am traveling. Good location and easy to park.\nFood here is nice and with reasonable price. You should come and check out.","useful":0,"funny":0,"cool":0},
{"review_id":"8dpqRMuHRnPwJPzyUp1nwA","user_id":"s8Ccg7YLPGjSz9TJjAjVlg","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":5,"date":"2013-11-03","text":"I've been here several times. The tiger shrimp corn tamale is a must. We came for brunch today and I tried to lamb Cobb salad. That was very tasty also! My husband ordered the pork sandwich, which was excellent!","useful":0,"funny":0,"cool":0},
{"review_id":"sQZNKMPn_gL_qgGjAv08vQ","user_id":"s8Ccg7YLPGjSz9TJjAjVlg","business_id":"_j2EtQtgLuXGRBfbM5YwZA","stars":5,"date":"2013-11-03","text":"I love the Szechuan beef noodle soup! Very tasty!! Every time I visit vegas I eat here!!","useful":0,"funny":0,"cool":0},
{"review_id":"8NnRb4ZXk2fC5i2nBL-kiQ","user_id":"s_fqI-pHHCEXCLBTMR-Pjw","business_id":"Uigx_t_hzoZMlJ04AWWF8Q","stars":5,"date":"2016-02-15","text":"Rudolf is awesome! He does it all, and a true handy man he'll figure out a solution to your issue. Prompt, courteous responses; always with a smile and a man of his word. do yourself and your home a favor, call Silver Desert!","useful":0,"funny":0,"cool":0},
{"review_id":"RLloVg77RHPDhpdB0Mzuog","user_id":"s_fqI-pHHCEXCLBTMR-Pjw","business_id":"CWh5Jvne98_jz0GO7hbzHw","stars":5,"date":"2014-05-12","text":"We were very fortunate to be able to participate in the first of two Vintage Vegas Food Tours this past weekend, and what a delectable feast it was!!  Vickie collaborated with the owners and chefs of five classic Vegas restaurants downtown to put together the menu for this food tour.  As locals, we had already been to 4 of the 5 restaurants on the tour, but we were so excited to have an opportunity to sample ALL FIVE in one evening!  The menu Vickie put together was perfect - samples of appetizers, bread, entrees and desserts left no one hungry!  Everything was perfect and it was interesting to hear everyone's favorite item.  The tour was capped off with a special cocktail made for this tour at the Atomic Liquor Lounge.  \nThere is only one more Vintage Vegas Food Tour, on May 24th, 2014 - get on that bus!\nGet a room downtown and make a night of it; you'll be glad you did.","useful":1,"funny":0,"cool":0},
{"review_id":"apz-R3KEkdQ_dP8DdJ0QfA","user_id":"s_fqI-pHHCEXCLBTMR-Pjw","business_id":"42qrdKMIYtHGeAiFbXHrhg","stars":5,"date":"2017-01-10","text":"Marcia and Mike are awesome! And my \"Murphy\" loves them too. I've been using their services ever since Murphy adopted me over 4 years ago. They take care of Murphy, and I, so well. They text me photo and video updates while I'm away, and also ensure my home and property are safe and secure. Whether 1 or 10 days away, Pawminders Plus takes care of Murphy and I!","useful":0,"funny":0,"cool":0},
{"review_id":"53rajWZxyo8un-SqdWf3pA","user_id":"eY852hnxtPPXA7di1oa29g","business_id":"chdQADb57xjYrZCl79GMAg","stars":5,"date":"2016-09-11","text":"I was referred to Adrain and have been beyond thankful for his shop! He is reasonably priced and does excellent work. There is nobody else in town that I would take my vehicles to. He is an honest, trustworthy, hardworking guy and runs his shop the same. I refer anyone and everyone I can to him and do not plan on going to any other mechanic for as long as I am around.","useful":2,"funny":0,"cool":0},
{"review_id":"L8th3jfqBhZfdPONjk0UGg","user_id":"eY852hnxtPPXA7di1oa29g","business_id":"7s39xlfRI4AJqOkjexPRMA","stars":5,"date":"2016-09-11","text":"Reasonably priced, quality work. It doesn't get much better than that.\nThis is the only plumbing company I will ever use!","useful":0,"funny":0,"cool":0},
{"review_id":"lIEZjQMFDnPKKiKjDP5ppQ","user_id":"H6LNdslSFrRrv_6AgdRvsg","business_id":"2q37XQA6iLLdIaspyM7tIw","stars":1,"date":"2015-02-23","text":"Terrible..my hamburger was tasteless.  The eggs scrambled.  Omg  dried out.  Whos cooking there food.  Never go there again","useful":0,"funny":1,"cool":0},
{"review_id":"20ts02Vv5LcKA0YvZqTY5Q","user_id":"H6LNdslSFrRrv_6AgdRvsg","business_id":"nv1XdkWviHXO7N6mK8O1yg","stars":2,"date":"2009-04-18","text":"save your money.. i was there last nite. the server was great an d very cordial, but the food was way under par...the potatoes were hard, no carbonation in the 2 soft drinks i had to return , asked for the dressing for my salad on the side of course the opposite, the salmon overcooked. i didnt say anything about that. ill give the restaurant 2 yrs to survive w\/ food like that. time for a kitchen overhaul of the staff. terrible for 83 bucks, should have went to wendys","useful":0,"funny":0,"cool":0},
{"review_id":"69eGBn5vbfE4L0xSsdP-gw","user_id":"609AXjpk7zWoUWcr4cIyGA","business_id":"Sn_D9Xv7L-jDK8hDG5B_bg","stars":1,"date":"2012-11-25","text":"I am a frequent Walmart shopper. I even have a close relative that manages a Walmart store in Wisconsin. This Walmart has by far the worst customer service that I have ever experienced - and I used to live in the SOUTH.\n\nThe workers that I have encountered at this Walmart could not possibly purposely display more \"I don't give a crap about this job\" attitude than they already are. The past 3 times that I have gone in there I have been treated like my time does not matter. They are completely inefficient, slow, lazy, and rude.\n\nThe first time that I shopped there, I had about 14 items and went through the express lane. The lady behind the counter (pregnant) was moving so purposefully slow that it was obvious it was on purpose. She was trying to prove that she did not care about her job and that the customer's time did not matter to her. To get through the EXPRESS lane took more time than if I would have stood in line behind someone with a huge cart full of stuff in a regular line with an efficient clerk.\n\nYesterday, I went in to get a couple of keys made and to purchase some other items. The lady who came to make my key just muttered utterances and sounds under her breath, rather than giving me a \"sure, I can help you with that\" or \"here you go, have a nice day\". She just took my key, made copies, and handed them back to me. Even when I said thank you she just made a small sound and walked off.  Then I stood in line to check out behind a lady who had about 10 things. The clerks name was Darlene. She was, just as the previous clerk, extremely slow and uncaring. She was even SITTING DOWN in a chair, slowly taking one item and sliding it across the laser, stopping in between items sometimes to \"chit chat\". It took FOREVER to get my stuff and get out of there. \n\nI don't expect super speedy service necessarily, but I do expect to be treated with respect. Treating your customers with respect entails making them feel welcome and being efficient.","useful":2,"funny":3,"cool":0},
{"review_id":"VUCHC0PUNwi9pkIvvRR7QA","user_id":"6nO4GxUz0v1OUlfpCxLIUw","business_id":"74iNcDdhcWRpnawK_sTPmw","stars":1,"date":"2011-09-27","text":"Since we were staying at a Hotel so close to Le Quartier Chinois which seemed to have quite a few Vietnamese restaurants I was looking forward to scoring some decent Pho before the trip was over.  When we did finally go out we realized that ALL Vietnamese restaurants in the area close at 9pm as opposed to Chinese places which stay open till 2 or 3 AM.  Why is that anyway? So we felt rushed to find a place quickly.  We chose Pho Cali thinking it looked competent and clean.  As we sat down we encountered the dreaded Surly Waiter.  Apparently someone whizzed in this guys cornflakes today and he was taking it out on us! He thrust the menus at us without a word with a thoroughly disgusted look on his face.  My husband nicely asked if he spoke English. He replied sarcastically \"No, Spanish\". Imagine his surprise when hubby proceeded to order our entire meal in Spanish.  Suddenly pissed off waiter boy spoke English!  The rest of the meal was a constant parry of attitude and sarcasm.  What school of serving did this guy attend?  I didn't check Yelp before going to this purveyor of fine Vietnamese cuisine so I guess I had it coming.  Our experience pretty much paralleled other Yelpers regarding paying the bill.  He added it up then when we tried to pay with American dollars padded the bill due to the exchange rate.  Would not accept our credit card either.  We payed cash and left this fine example of waitstaff one shiny Canadian dollar for the privilege of having him serve us and left.  Suddenly Nasty waiter follows us out to the street and proceeds to pull an indignant Justin Long tirade from \"Waiting\"!!! Oh, HELL NO!  He says \"here sir you left your money on the table\". In perfect English no less!  I said before he could go any further\" oh no you earned every penny of that with your fine attitude\" he got all \"Guppy\" on me opening and closing his mouth and nothing coming out.  So aside from the terrible service the Pho was decent, the limeade tangy and tasty and the rolls we had were excellent.  Not good enough to justify putting up with such nasty waitstaff. There must be much better Vietnamese places around.  I would avoid this one.  Just sayin....","useful":3,"funny":0,"cool":0},
{"review_id":"HzZPz3zMavb-9R7aHD8Fzw","user_id":"7JLr3VWwXfljsBxW1s3ksA","business_id":"EvqOkXYVceidPaUksqdR8g","stars":2,"date":"2017-05-21","text":"Haircut was ok, probably won't frequent as much as tommy guns, was made a little uncomfortable with how flirty the young lady with the green hair \"kate\" was being as I am married. It goes beyond the line of professional courtesy, and then to have a co-worker tell me his friend \"Jamie N\" had bragged to him about hooking up with the same young lady kinda says alot about the establishment \"maybe the staff needs restructuring\" back to a level of professionalism to keep them from picking up on their customer\/clients? (just a constructive critical observation) as that's not the type of reputation a growing franchise should purvey for it's customers. Will not be returning due to the lack of confidence i experienced on the professional front. As a business owner hate to see a franchise go in such negative direction.","useful":0,"funny":0,"cool":0},
{"review_id":"up4Jglnw0zKuU60xA_R4ww","user_id":"7JLr3VWwXfljsBxW1s3ksA","business_id":"dj0KrXqeEntYlSrnOpZtMw","stars":1,"date":"2017-05-22","text":"Was about to use this company for my relocation to ontario, had spoken to owner on the phone, and i asked for someone to come out and asses my hoysehold.items to get an accurate estimate as to what my move would cost me, and after being told staff was to busy to make it to my panorama residenc, amd tried to reschedule an in home assessment i was met with increasingly rude demeanor and insistance on doing my assessment over the phone, honestly how accurate can a moving company get doing this over the phone unless they're psychic movers, in all honesty, i think I'll go with a bigger name in terms of moving companies, something came of shady in the ten minute conversation i had with the owner, not gonna risk being ripped of, on top of already being spoken to rudely before i could even get a figure on what my move would cost, i dont see this company being around in the forseable future with this business mentality","useful":2,"funny":0,"cool":0},
{"review_id":"Mv-fQa_upbyCrYfio4J-qQ","user_id":"DP0L-Yo-ZQLJlwfUG28JiQ","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":5,"date":"2017-01-22","text":"Awesome food, awesome staff, the wait to get in may take awhile but once seated and your order is taken, your food comes soon after","useful":0,"funny":0,"cool":0},
{"review_id":"uwoaSMSz6LumQQIdDW2eJg","user_id":"0KeSH7ua-K7veiXaWdqfXw","business_id":"bca7C9JQH89k1Z_FVNBPRg","stars":1,"date":"2015-12-22","text":"After seeing this chiropractor several times I did not feel at all confident with him. First of all I went to him for low back pain and he x-rayed my neck and not my lower back. He showed me an x-ray supposedly of my neck, which I have come to find out was not my neck at all!! But yet he charged me for an x-ray. I think he scammed me! Also, my lower back never did feel much better after over a month of sessions.","useful":2,"funny":2,"cool":1},
{"review_id":"jhwftK9YWlBw4AKhUzpcDg","user_id":"PwlMTqQMfFVpSsrb8cZuyA","business_id":"frFf4EIhssarn8us5HwVkQ","stars":5,"date":"2012-12-27","text":"Haley has been cutting my hair for about 8 years now.  She worked in a variety of salons before finally opening her own.  I will NEVER go to anyone else again.  She's always friendly, professional and flexible with making sure I can get in.  Much better than impersonal quick-cut places that don't care about you once you pay.  Lather is fantastic for service, price, location, atmosphere, product and quality.","useful":4,"funny":0,"cool":0},
{"review_id":"pvTsNL8wrxyuFY2QaSUUqg","user_id":"PwlMTqQMfFVpSsrb8cZuyA","business_id":"Zcz-ilAvtiZ36goz5Sa_Ow","stars":5,"date":"2012-12-27","text":"Very spacious and has two entrances.  Always clean and staff is usually friendly.\nGood hang out spot with easy access to shopping and eating.","useful":0,"funny":1,"cool":0},
{"review_id":"OgwcpkOYoP-qzCV8S99mXA","user_id":"iZil1ye8o6BJA3Kpmz_qQQ","business_id":"rNqSjfRM09T-VOjRTAF66g","stars":5,"date":"2010-11-08","text":"Love the cleanliness , service and variety they cater for Dim Sum. So far the best dim sum I've tried in Phoenix. Highly recommended!","useful":1,"funny":0,"cool":0},
{"review_id":"YOpcteMiz8ct-7vC1gTY2Q","user_id":"iZil1ye8o6BJA3Kpmz_qQQ","business_id":"nWlJI4ImyPGpSpsC4lPQ9Q","stars":5,"date":"2010-11-08","text":"I've decided to give it a try after reading the positive reviews. It's hard to find an Asian hairdresser who handles Asian hair so I am so glad I found it! Jim and Vivian ( wife) were super friendly. Liked the little details when Vivian brushed off hair from my face while Jim worked on my hair. I felt pampered. Love the layers that Jim gave me, gave my hair more volume. A much needed haircut indeed.","useful":0,"funny":0,"cool":0},
{"review_id":"q9P9SBOLeqaZaCd9iuHbyw","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"FRlD1adgQzUlWX5BbZzg5A","stars":5,"date":"2014-05-18","text":"I really liked this place, the ambiance, the food, very nice staff too.\nI recommand it!\n\nJ'ai bien aimé cette place, les plats sont frais, beaux et bons en même temps. Les gens qui travaillent là-bas sont très gentils et amicales. Ils vous conseillent sur le menu. Merci!","useful":0,"funny":0,"cool":0},
{"review_id":"bFJLSJN5IChS81McKsRjFg","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"BDPehkzVAn6DFlvkXMO7hw","stars":1,"date":"2012-03-25","text":"I never i would never thought in a restaurant I would not be able to eat a lamb because of its hyper-hard texture ... I do not understand why it is often full ... really a mystery. and it is expensive! lol\n\nje n'aurais jamais pensé que dans un restau on me servirait de l'agneau impossible à manger à cause de sa texture hyper-dure... je ne comprends pas pourquoi il est souvent plein... un mystère vraiment. et c'est cher en plus! Lol","useful":1,"funny":1,"cool":0},
{"review_id":"qTakRg8Z8xWI2GnWJbHRQA","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"hfQWA7u_iM49E-3Ti4b2AQ","stars":4,"date":"2014-05-04","text":"The food is always fresh. The place is clean and nice. I love the view from the windows. You have really a lot of choice. The only thing is the price, it is a little pricey.\nThanks.\n\nLss aliments et les plats sont toujours frais, vouz aurez un grand choix. Le bar à salades est formidable, il y a des sauces qui viennent avec. La place est propre et joli. La vue est belle. Seulement à chaque fois je suis étonné du prix à la fin :)\nMerci.","useful":0,"funny":0,"cool":0},
{"review_id":"8RmIMahxOSc8PBKLElMlWg","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"wzugmCevnXuCMCF4upAf0w","stars":5,"date":"2014-05-05","text":"It's the most surprisingly good cuisine that I've tasted in any Montreal restaurant! The taste is like graciously combined savours. Go on a nice day with a friend(s) so the wait wouldn't appear that long, lol.\n\nUn restaurant que je recommande chaudement, parce que les saveurs auxquelles vouz allez vous soumettre sont suprenement bien choisies et réflechies. Seulement choisissez une belle journée pour faire la file et irez avec des amis pour que le temps t'attente passe plus vite :)","useful":0,"funny":0,"cool":0},
{"review_id":"yEVYVshzmw7roQNhaLLx2w","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"VP9XVlOVolnuUApRaILFwQ","stars":5,"date":"2014-05-04","text":"Enormous portions, fresh food, nice ambiance, beautiful experience! \nThanks! :)","useful":0,"funny":0,"cool":0},
{"review_id":"9IANdxlWifvYjB8UpVbUig","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"stzbkEGleSE7K_5FriDLSg","stars":5,"date":"2012-03-25","text":"I went there with my family, and all of us loved it. It's simple, nice, and the service is very friendly and polite. The ambiance is good and the music in background is very appropriate and beautiful. Remember that their dishes are prepared without any MSG, witch is a big \"well done\"! Maybe that's why the previous review said that is wasn't extra-tasty. We are used to super-tasty-chanease-fake food, lol.\nI recommend it to everyone. The portions are great too. We couldn't finish and took it for home.\nTry the sweet potato chips :)","useful":2,"funny":1,"cool":1},
{"review_id":"_fn64Ilz0iDqMRQwV7G65w","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"XSoJnq3swziO_bCmw3eKyw","stars":3,"date":"2012-03-25","text":"Advantage: there is almost everything for emergencies (like a health depaneure)\n \nFlaws: often closed during business hours, slow service (at the checkout because of political chatter :), expertise and connsil service not quite to the point ... There is a Red Bull on the floors (so perhaps not so much a healthy store :)\n\nAvantage: il y a presque tout pour des urgences (comme un depaneure santé)\n \nDésavantages: souvent fermé pendant les heures d'ouverture, lenteur du service (on attend beaucoup à la caisse à cause de bavardage poli :), expertise conseils pas tout à fait au point... , il y a du Red Bull sur les étages (alors peut-etre pas si santé que ça :)","useful":1,"funny":0,"cool":1},
{"review_id":"kxsDgjmHFrWWFQu39FVgPQ","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"hep6meAKTP55OZImraynwQ","stars":5,"date":"2014-05-04","text":"Really loved this restorand, the food, the service, the ambiance. You feel like you're in Japon.\nThank you.\n\nNous avons bien aimé ce restaurant. Les plats sont très jolis, savoureux et typiquement japonais. Une belle découverte à Montréal et une place que je n'hésiterais pas à proposer à des amis.\nMerci","useful":0,"funny":0,"cool":0},
{"review_id":"MJ_17Y2XPkkBi6RT_1SHow","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"j1ICx22o7Zp2SVFliRoyQQ","stars":3,"date":"2012-03-25","text":"great prices, but what a manifestation! Wow! Too many people buy and work and run, lol.","useful":1,"funny":0,"cool":0},
{"review_id":"pjoLXNkwEzQqSt3lmI50XA","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"HbY3KqSWRJXJaMrRwZ8qJg","stars":2,"date":"2012-03-25","text":"it's EXPENSIVE! \ncustomer service not satisfactory at all (you do not have enough space to walk, they pass the brush on your feed, you are told not to choose your fruit?!). But their high price is the most obvious flaw. \nSo I changed to 4 Freres, Bioterre or 5 seasons ...\n\nc'est cher la-bas! service a la clientele pas du tout satisfaisant (on n'a pas assez d'espace pour marcher, on vous passe le balais sur vos pieds, on vous dit de ne pas choisir vos fruits?!). Mais leur prix exorbitant est le defaut le plus evident. J'ai change donc pour 4 freres, Bioterre ou 5 saisons...","useful":2,"funny":1,"cool":1},
{"review_id":"6cIOOQg7aHe2CiS-dJWCjg","user_id":"IQWa82LDR7BWBw1uHKMAuQ","business_id":"mQWseGbBVPsoESvW1p6Jnw","stars":3,"date":"2014-05-18","text":"It is a beautiful, clean, sparkly place. The cakes and all are looking amazing. It would've been great if they tasted as good as they looked ;)\n\nC'est une belle place, les pâtisseries ont l'air superbe! Mas goûtent ils aussi bien qu'il en ont l'air? Pas vraiment :) Mais il faut voir pour soi-même. Merci.","useful":0,"funny":0,"cool":0},
{"review_id":"PT_HFvOaiSM2GDaBCTgRMw","user_id":"aiitW137STn9ORfgu4hBjg","business_id":"OARQDsxyoGnnX2FfSl9HjA","stars":5,"date":"2015-08-02","text":"First show. . .Honestly, my first impression. Don't think I would watch another show again. \n\nAnything else would be a let down. \n\nLoved everything. Experience unforgettable. Dancers awesome, swimmers fantastic. High divers and trapeze artists incredible. Loved the storyline. Costumes amazing. Dancing water, sprays of fires, et al WOWWW!!! Lighting, scene design, music--Just moving. Transitions seamless. My head was on a swivel trying to keep up. Eyes are still dry because I tried not to blink. So much to see, I was in awe. \n\nMore than once I asked. How'd they do that? No one can hold their breathe that long and kick their legs like a Rockette. They're not jumping. Oh crap, they jumped. Shut up did you see that. I'm dizzy watching them spin, how're they not flying to their doom? These were just random thought came to mind. \n\nPeople put in work. No detail missed. Visually stunning. Saw a few people moved to tears. Had my heart racing. My head shaking. My breathe syncopating. Funny, scary, warming--it was moving. Inspiring. A roller coaster adventure \n\nFew hours after the show and I'm still a Buzz. Like the Grand Canyon. . .you make the effort to see it. You will not be disappointed. In time it is certain, one will forget the details of the show. However, Le Reve is a First Kiss. It's something you will always remember. For me it was Wonderful. \n\nWould say more but no one reads more than short blurb anyways. \n\nI write this to all those involved in the \nproduction. Thank you! Thank you!! Thank you!!! Bar set high. So high that if I never saw another in my lifetime, I would be okay. \n\nI lie.\n\nI would experience it over and over  and over again.","useful":1,"funny":0,"cool":2},
{"review_id":"nQPjwUC_MBMT9LNSASrM_A","user_id":"aiitW137STn9ORfgu4hBjg","business_id":"aquwzx3ZsiG8l83lpnWF3Q","stars":4,"date":"2015-08-01","text":"Big clean well kept. One of my favorites. Can always get a great workout. Don't have to wait for equipment. No divas I've experienced. Can't get a workout here you can't get one anywhere. Found this to be one of the better 24 hours in the Vegas area. It worth the drive if you are here for the weekend.  Great job!!!","useful":0,"funny":0,"cool":0},
{"review_id":"2OeOsRlGxmc2mWWnS9fj_g","user_id":"aiitW137STn9ORfgu4hBjg","business_id":"Z0kPVmXzo2rLEJwdothOWw","stars":4,"date":"2015-08-01","text":"Not usually a fan of Filipino food but I like the food here. It's fresh unlike many others in SoCal. Foods not laying under a heatlamp like so many other Filipino places, e.g., San Fernando. Had the mani soup and it was enough to take home. Easily rivaled some pho places I've been too. If other Goldilocks were like this I wouldn't be as adverse to Filipino fast food. Perhaps the other places lowered expectations so much this place was fantastic. Judge for yourself. This one has given me pause for consideration for the future, instead of automatic No. Good job","useful":0,"funny":0,"cool":0},
{"review_id":"BbcQfkLJslKxFigDof6GHw","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"WgpxfYBGWolWEK8IQmXFJQ","stars":5,"date":"2014-11-26","text":"GO!\n I have only been here once and absolutely loved it! Everything was fresh, homemade and just down right YUMMY! The, made right when you order it ,Tangerine Lemonade is sooooo good I don't even have any words. My chicken noodle soup was perfect and when I go back I will be getting the meatloaf sandwich as I heard it was \"great\" but they had just ran out:(  It's a cute little place and the ladies there are so friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"Lh0rRaLyJmlhiZN9HmJWiw","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"dilhiIqMeXzgsw25Y6LG_g","stars":5,"date":"2014-03-29","text":"I've used Dana for many years and he has always done a fantastic job!  I've  NEVER had a problem with any of our cars. Do not hesitate to use Dana !!","useful":0,"funny":0,"cool":0},
{"review_id":"WfGtHdR6pc5IXFyIqFawVQ","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"7Ny2GHLw8xl_kXfhfrvh5w","stars":2,"date":"2015-08-13","text":"BLD I really wanted to like you, I really did! I gave you three chances and each time your food just sucked, plain and simple. You make a decent Bloody Mary and for that 2 stars instead of 1.","useful":0,"funny":0,"cool":0},
{"review_id":"kaeB2tgBMSXlSs2eANT-pw","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"aJK0cFYpf0TlxDMRVxk89w","stars":5,"date":"2014-02-21","text":"I've been going to Kelly for so long I really don't remember when I started. He is fantastic! The office staff is great, his assistants are wonderful. Do not hesitate to go to him! And my kids love playing the free video games if they have to come with me;)","useful":0,"funny":0,"cool":0},
{"review_id":"P8Le6wza9fEVho7PGy8eJg","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"EUDQVX5Q7rPGn9OfYMaGVg","stars":5,"date":"2013-08-11","text":"Dr Rooh is great! I've been seeing him for a few years, he's very reasonable and goes out of his way to be available. I leave there always feeling better than when I went in:)","useful":4,"funny":1,"cool":1},
{"review_id":"L1Udb_Vl0WRvjdd3Ib-8RQ","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"A6nY4SCrMuLPtlbq-EKnfA","stars":2,"date":"2014-11-26","text":"If you are a snail or a sloth THIS is the place for you because everything is SLOOOOOW!  We had to search for a hostess, never found her, not quite sure if they even have one. Drinks took forever, food took forever, service took FOREVERRRR \n( insert Squints from the movie Sandlot saying this). We were actually laughing at how long drinks took for nearby tables as well.","useful":2,"funny":1,"cool":0},
{"review_id":"zmT4w7H-7GBz9TelytVhBQ","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"rqoNmVLEOcwSYksT12pxcA","stars":5,"date":"2015-08-13","text":"Mike is an incredible real estate agent! He is extremely thorough with every detail dealing with the home buying\/selling process. I am so excited to be learning under his tutelage!","useful":1,"funny":0,"cool":1},
{"review_id":"p-YihrRRqoVg8xoeE7kE4w","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"-MKWJZnMjSit406AUKf7Pg","stars":5,"date":"2014-03-29","text":"GO TO THE BARRELHOUSE!  I've been there a few times and they always have great food and service. It's in a very random strip mall, but perhaps that helps to keep the prices reasonable. Great drinks!! Don't hesitate!","useful":2,"funny":0,"cool":1},
{"review_id":"3uGVULAFnn1AfJY_V0m6FQ","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"bD1j3fvACYemIV8nz0PF3A","stars":5,"date":"2013-02-14","text":"I have been using these guys for a few years, business cards, signs, etc-they are FANTASTIC!! Customer service is exceptional, friendly and do a wonderful job!","useful":0,"funny":0,"cool":0},
{"review_id":"-mnE7ji-W3_S31S01K0sCQ","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"dqUihMM3SFPJ9GE-3bAlpQ","stars":5,"date":"2011-11-07","text":"I had always wanted to try Pilates and now it's the only workout I want to do. I have seen great results and Sonia is a fantastic and knowledgeable instructor. I would HIGHLY recommend this Pilates studio!","useful":0,"funny":0,"cool":0},
{"review_id":"Y5uO1BRpSG5RCwJobN9nag","user_id":"5DvEmF5X6PuqQ_BH-aDzPQ","business_id":"UywPvignjHoj8ipT7l2OFw","stars":5,"date":"2013-02-14","text":"I think there is hope for downtown Mesa yet!  All I know is that everything I have ever had was good!","useful":0,"funny":0,"cool":0},
{"review_id":"kUeydH6ZA70K_O_n-unB3w","user_id":"nA78yTKKp8I7V34yC7HTVw","business_id":"roR1_DDlMk7mhi5_R6XVKA","stars":2,"date":"2017-10-24","text":"I'm giving this location 2 stars! The lady at the front is not very welcoming! We came on a Monday morning it was not busy only 7 tables had people sitting at them. I asked the lady (she might be the owner she's always there) at the front if we could sit in one of the booths that were open. We had 3 adults and a 2 1\/2 yr old. She said no you can sit at the table that's a half booth on the wall. I tried to explain I have a young child a booth is easier to contain her. I didn't want my daughter to be crawling all over people next to us! She said no and sat us at the half booth. Then she promptly sat a party of 2 in the booth I asked for right after seating us. \n\nThen they have these fake little trees on the table and my daughter was looking at it.  Now granted my daughter at one point was poking it with a fork which I missed because I was looking at the menu.  The same lady came over and ripped out of my daughters hand and said \" I'll take that!!! \". My daughter was so upset it made for a miserable time.  I wasn't going to let my daughter ruin a $5.00 fake tree from Michaels!!! \n\nFood at this location is lacking! The Gainey location is much better!! The only nice thing I can say about this location is the servers are always great and so are the mimosas!!\n\nMy point of this review is if you have small children don't go to this location and if you want better food food go to the Gainey Ranch location!","useful":1,"funny":0,"cool":0},
{"review_id":"BeMTD9iiJQZDLmJwJJM6FA","user_id":"N6__iT2ZijklpgxVmz7_ug","business_id":"MffsS7AXw8DahmQoTaNUGQ","stars":5,"date":"2016-08-29","text":"The best sweets around! These ladies are amazing at what they do and the quality shows in all of their tasty treats. I recommend them to everyone I know!!","useful":0,"funny":0,"cool":0},
{"review_id":"h1RepHOi1YErvPQtgUQO3g","user_id":"N6__iT2ZijklpgxVmz7_ug","business_id":"BTcY04QFiS1uh-RpkR7rAg","stars":1,"date":"2014-09-28","text":"Quite possibly the worst experience ever at any establishment today. My family and I were at a children's movie and an older man who was alone without any children complained that my child was being loud (which she wasn't) and without asking is about about it, decided to kick us out. The worst part is that the single man in the children's movie by himself was a Harkins Corporate Employee! We will never spend another cent at a Harkins theater. Hopefully that older gentleman enjoyed the end if the children's movie by himself.","useful":0,"funny":3,"cool":0},
{"review_id":"7AIRjMM5y80d8WlcyY32uQ","user_id":"RJaOM110aQlyfab_mYBw4w","business_id":"K1tLIHP5DLZG5NYIt83iYA","stars":5,"date":"2017-10-02","text":"Ken and Debra are amazing real estate agents!  I know that there are so many real estate agents here in AZ, but I can't recommend Ken and Debra enough.  I had been taken advantage of by an agent a number of years ago, and I was hesitant to go through the process again. Actually terrified was more like it. This time couldn't be more different. Ken and Debra were there for us every step of the way.  The most important thing was that they listened to us throughout the process.  No question was too insignificant.  They were incredibly helpful making sure that all of our concerns were addressed, and if there were questions that we didn't know to ask, they made sure we got answers to those questions as well.  I really felt like they had our best interests in mind, and I never felt we were left in the dark.  I really felt like we were working with friends!","useful":0,"funny":0,"cool":0},
{"review_id":"lygt0UqCjEJXpQzMmRRj5g","user_id":"LAKbZYb0VDrIE8HaZElp_A","business_id":"s8OLoPfOpB0FbK5frI3CkQ","stars":5,"date":"2017-06-03","text":"Great late brunch experience today! Ever meet a waiter that just rocks at their job? \"Franch\" went above and beyond for us today! Every order that came out was spot on, and he was great with summer drink recommendations. Been to peculiar plenty of times for the city view & good food, but this is the first time I've been impressed with the service! The Nola Benedict is my personal favorite brunch option.","useful":0,"funny":0,"cool":0},
{"review_id":"luVLrgjCJGrGaCjAwjfyoA","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"_14wp3McW-kk7foNA9A2KQ","stars":5,"date":"2016-10-12","text":"I wish you could give more than 5 stars because if so I would. Our flowers on our wedding day turned out better than we ever had expected. I booked Jodi because she came as a referral to me and I'm so glad I did. You can definitely tell how long her and her husband have been in the business; they both did not miss a beat! Jodi and her staff played my vision out to absolute perfection. My guests have not stopped talking about my floral arrangements and my bouquet and attendants bouquets were perfect. In addition to perfection on the day of as far as floral presentation the process with them leading up to the day of was seamless. Their communication is great and they are always emailing you back in less than 24 hours. Michael (her husband sends all the e-mails) and Jodi takes care of the consultation and all appointments. She has a staff that delivers the flowers on the day and they were very easy to work with, professional and on-time.They really have a good thing going! \nThank you Jodi and staff for the amazing floral arrangements on 10\/1\/2016 at Gainey Ranch Golf Club.","useful":0,"funny":0,"cool":0},
{"review_id":"lddoEeSRM-lQba1k2CiUkw","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"3-6biVwm7VwPZ-k67jml-Q","stars":5,"date":"2014-04-12","text":"What a perfect find for my Italian self!! My boyfriend & I went here for date night and absolutely loved everything from the service, to the food & the Italian ambiance! I highly recommend visiting if you are looking for a delicious Italian meal that is well priced! We enjoyed the spaghetti & clams, Rigatoni and yummy antipasto board! This place makes me proud to be Italian... I will definitely be back with my friends & family!","useful":2,"funny":0,"cool":0},
{"review_id":"4-2HT1moMCAS4F-J9b89nw","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"JKkyw_9uZP-XN1puU-YM6w","stars":5,"date":"2015-05-27","text":"This place deserves 5 stars! London Gold in Chandler has taken absolute care of my fiance, myself and my ring. My fiance purchased my ring in March 2015 and I have already been in 3 - 4 times to visit and get it cleaned. Every time I am greeted right away and taken care of with absolute professionalism. Everyone that works there is always ready to help you. If you are looking for a perfect engagement ring I would ask for Laine! She is amazing! She helped my fiance with the design and setting of my ring. I love it and her. Laine will definitely be our family jeweler from here on out! Thank you for everything Laine and staff... We look forward to spending more money at London Gold :)","useful":4,"funny":0,"cool":0},
{"review_id":"l--tFwuWsLaR74ocBQKUlw","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"E1eUQ9vJCMO3h9NJZfbhrg","stars":5,"date":"2016-10-12","text":"We had our wedding here on October 1, 2016 and had the best experience ever. We worked with Lauren Ogle, the Events\/Wedding Coordinator and she was FANTASTIC - extremely detail oriented and very kind and professional. When I saw the ballroom set up on my wedding day I had tears in my eyes because it was everything I had imagined plus more thanks to Lauren and the Gainey staff.  The chef and staff for the food\/serving was amazing, too. The guests ranted and raved about the quality of food (both apps & entrees) saying it was some of the best food they've had at a wedding. The grounds are kept up consistently and looked very pretty on our wedding day. I would highly recommend having your wedding here. My husband and I are so glad we did!","useful":0,"funny":0,"cool":0},
{"review_id":"L6qY7DKp3kxRfT5OkCvLqw","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"loxZhxT3UefbTW7PhTYYMQ","stars":5,"date":"2015-12-08","text":"We recently had Boyd and his crew install our plantation shutters and they are FANTASTIC. Boyd was so professional and easy to work with from day one. His timeline was spot on and he was very knowledgeable about the product. Boyd's install crew was also very professional and knowledgeable - they were in and out in no time. Throughout the whole process Boyd was easy to get a hold of for questions and his response time was very quick. Thank you for Boyd for these shutters and your professionalism throughout the whole process. Not to mention no other company could match Boyd's price which was a plus! We will definitely refer Boyd's Blinds & Drapes to our friends and will call you for any more needs our home has!","useful":0,"funny":0,"cool":0},
{"review_id":"rR-aPrEcb0d8blZQ5uIOeA","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"rMN6bT3jdvyDKnEkxKo0Ww","stars":5,"date":"2016-10-12","text":"Got You Covered was amazing!! We originally signed up with Eric @ Got You Covered because I was part of wedding him and his team DJed and I didn't want anyone else being responsible for our music but him and his team! Our DJs for the night were Eric (Owner) and Steve. You know you have a good DJ team when your wedding Coordinator and all other vendors tell you they're the best in the Valley. You can tell he's been in the industry for a long time. Their communication from our initial meeting to wedding day was spot on and never was music a stress for me during our planning. Eric and his team really take pride in our work. The music selection he played was exactly what we wanted and had asked for. Also, Eric is great at herding the group and getting the party started through his MC skills. Our guest commented on the music selections saying it was such a great play lists for all age groups. Thank you Eric, Steve and Got You Covered we will definitely refer you to our family and friends in the valley who get married in the future!!","useful":0,"funny":0,"cool":0},
{"review_id":"TiiGmMLVqly4BwOl5ivOdA","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"pnReyi3akZIGyg2p1O2jvw","stars":5,"date":"2016-10-12","text":"My husband and I immediately contracted Matt (1st Officiant) to officiate our wedding strictly because of the wonderful job he had done at my sisters 5 years earlier. It was the best decision! Throughout the time of contract and the day of Matt truly gets to know you as a couple and individual person. He genuinely takes time to get to know your relationship and it definitely shows in his work. Most of our guests asked how long he had known us because the ceremony was so personal and so special which was exactly what we wanted. In addition he also sends you an audio of your wedding ceremony which we will treasure for a lifetime. Thank you Matt for your work and thank you for marrying us. We along with our family and friends loved every single bit of the ceremony! We will continue to recommend you to family and friends getting married in the future.","useful":0,"funny":0,"cool":0},
{"review_id":"z9OtXXmMn8ojeWkOupdHag","user_id":"3xOtpzabqv12Eq8nRfbzfA","business_id":"voF2F6emy4zrDAezPC6bkg","stars":5,"date":"2016-10-20","text":"We recently had Colling Photography as our wedding photographers on 10\/1\/2016 and I cannot say enough great things about them. They had previously photographed my sisters wedding and my best friends wedding so they were the first vendor we signed up with right away. They are absolute artist. They capture shots you wouldn't believe are able to be captured and they are extremely friendly and professional throughout the whole entire process. Husband and wife -- Jeff takes care of the groomsmen pictures day of and Rena the bridesmaids so they don't miss a shot. They are extremely organized and as a bride I really appreciated that. They stick to a schedule and are very helpful leading up to the wedding. They even walked our venue to check out the good places to shoot and the sun prior to our wedding day - they truly care. The album they create for you is like no other- it's stunning and I haven't seen another one like it elsewhere. We were extremely happy with our pictures but we weren't surprised with their product. All of our guests, family and wedding party loved them too on day of because they love what they do and they have fun doing it. I highly recommend Jeff and Rena to shoot your wedding, we are so glad they did ours!","useful":0,"funny":0,"cool":0},
{"review_id":"ggDoKQfKTqB3FI9f71Ql3g","user_id":"3vADAmmsD8VKQXAPNx9zog","business_id":"kmOeRAvOL1oR6Z-4Ggdx6w","stars":4,"date":"2013-01-13","text":"Try lunch special!\n\nFirst, deco really cool and cozy.\n\nSecond, Service, we were there for lunch, above average, our serve is kinda busy, but very nice to us.\n\nThird, food, I have to say so far is the best fine dinning place in Calgary. We had one lunch special for roast beef, Bravo! And a whole fish! The fish is good but not excellent not as perfect as the beef!\n\nWe have to point out that the french fries is a must try! The reason is the house special source is outstanding! It is very unique ketchup! super nice!\n\nOverall, We will come back!\n\nAlthough it is not enough to be a Michelin star restaurant, but it worth a Michelin Bib Gourmand lever restaurant.\n\nCheers!","useful":0,"funny":0,"cool":0},
{"review_id":"5zCHlfrtz1hmS-y7hlh_fg","user_id":"s1peiUEC5g_mSGP0M4dnhg","business_id":"aqNCstpUKDaepWJUfFanVg","stars":5,"date":"2016-03-02","text":"Our agency has held numerous events here, and been extremely satisfied with the incredible professionalism, attention to detail and the overall collaboration with staff we've had here. It's a beautiful, functional space, and there are a lot of options that would fit the bill for small, medium and large organizations. Ample amounts of parking near the building, and a welcoming atmosphere as soon as you enter the building, all the way to the room. Highly recommended; as an added bonus it's a fantastic organization that you're supporting.","useful":3,"funny":0,"cool":1},
{"review_id":"0ZVqw_f4oS-jIgWek1NgAg","user_id":"s1peiUEC5g_mSGP0M4dnhg","business_id":"cpLO1l1hnLVzV6ZEFlKfEA","stars":5,"date":"2013-11-27","text":"Decided to give the place a try, as a couple friends and I were starving and trying to stay away from some of the \"pub grub\" available on 17th. We decided to try La Vida Loca, and boy were our expectations blown out of the water. \n\nWe started with a beer, and tried the guacamole and tortilla chips that's made fresh at your table. Our server was very attentive (keeping a smile throughout the difficult process of making the guac at our table!), friendly and made some excellent recommendations for food. The guac was excellent, and the chips, as with everything else on the menu. I tried the huarche with chicken in mole, which was fantastic. It really tastes like what you'd imagine Mexican home cooking would taste like. The food tastes like it's made from scratch, organic (unconfirmed), and to top it off they had a friendly singer playing there. \n\nGreat experience for a Monday night, and it appeared to be busy. Glad to see this spot, which has been riddled with uninspired attempts at a bar\/pub turn into something that will be very successful. It's unpretentious, laid-back, and you'll love the food and service. Will definitely be recommending this to family and friends!\n\nKevin","useful":0,"funny":0,"cool":0},
{"review_id":"tLkrpx1yqr85eg4h4iv5mQ","user_id":"s1peiUEC5g_mSGP0M4dnhg","business_id":"7I1nw1e3VBomqEXDYVNZJg","stars":5,"date":"2017-07-23","text":"This is now our go to pizza place. Reasonably priced, delicious pizza and the owners\/employees\/drivers are super friendly and delivery is quick! Just picked up some pizzas, and the guy at the counter was friendly. Great independent pizza shop.\n\nOh, and try the garlic vegetarian, it's amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"davZfvxnu9JsDcPQBhZdJA","user_id":"s1peiUEC5g_mSGP0M4dnhg","business_id":"cCcvatoEw-NvVZZWW4lQEw","stars":4,"date":"2016-03-02","text":"I work near here, and the pho is plentiful and fits the bill. A no nonsense, good place for reasonably priced Vietnamese. The lunch special is also a great deal, and the staff are attentive and friendly. Good spot if you can grab a booth to have a quick meeting as well.","useful":2,"funny":0,"cool":0},
{"review_id":"WGxWvVWApSAMFgfy45XHMg","user_id":"MC1b2NiqeSU4pHbVLefXPg","business_id":"BsxefnHbrpDN7HB2hJrEiw","stars":4,"date":"2013-11-11","text":"Delicious tacos and some good hot sauce to compliment them. Not bad on the pricing for the amount either. I'd stop there again when in the area and try a torta.","useful":0,"funny":0,"cool":0},
{"review_id":"qQ5S85bvSAm7M_HbuGtbQw","user_id":"k-bTRzqJrTAdO3XyBT8k3A","business_id":"J6qWt6XIUmIGFHX5rQJA-w","stars":4,"date":"2012-01-04","text":"This place is great, best breakfast and best hamburger in town. The mannequin needs updating though...","useful":0,"funny":1,"cool":1},
{"review_id":"jvcHlV-x154VwWYuabE37Q","user_id":"pqctKpcQtH0Dh2-Y9VMbww","business_id":"TMpfuOB7bogZeOx9OgHOGA","stars":5,"date":"2014-10-13","text":"INCREDIBLE! Worth every penny....and 100% pay the extra money for the doors off.  Beautiful way of seeing Vegas from that view.  My boyfriend and I did the VIP sunset tour and it was one of the most breathtaking things I have ever experienced!!!!!! Definitely suggest doing a tour, especially with this company! Great guys....thank you!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"qP4Lm_om8ccwvGogJZrRUQ","user_id":"hTfGwrW8r2PVBX44wFsU8w","business_id":"-3K14kIKBH3gBOLf8-XFsg","stars":5,"date":"2016-12-14","text":"Me, my wife and our son have been going to AZ Family dentistry for close to four years now.Crowns, fillings, extractions,deep cleaning,we have got it all done here. Dr Nadkarni and her staff have always been courteous, efficient,professional and reassuring.Every visit has been a pleasant experience.","useful":0,"funny":0,"cool":0},
{"review_id":"nks0ja2xAhwGaCFfJpCGjQ","user_id":"jFtmCvnxPhG_51KzEU7Ckg","business_id":"EbP8eduNl-aEy2UVfs3zJA","stars":4,"date":"2011-11-21","text":"I just dined at Switch tonight with work associates. Overall the experience was exciting and fabulous. The only downer was our waiter who never seemed pleased with any request or order. Nothing seemed good enough. Huge bummer!\n\nOverall the food and wine was fabulous!","useful":1,"funny":0,"cool":0},
{"review_id":"X5DJF8UGbDDQW0etaOiNPg","user_id":"jFtmCvnxPhG_51KzEU7Ckg","business_id":"6qZkaFH3qW96UjKj-IqM9A","stars":5,"date":"2011-10-26","text":"I recently got a Gel Pedicure at Arch and was very satisfied!\n\nThe salon is not a chop shop, decorated nicely and very clean (unlike most nail shops)   I was pleased they offer Gel polish and a great selection of colors. I had gel on my toes to begin with and they were the first salon in town I have gone to that actually used the tin foil to remove the gel instead of drilling off the polish. I was amazed and happy for my toe nails not to have to endure the drill again.  I was also very pleased they have a LED light to dry the polish that takes just a few seconds unlike other salons where it takes several minuets between coats. \nMy pedicure was great too... no bad filing and I left with beautiful piggies! \nVery happy and very happy with the price... $35.00 for Gel Pedicure before tip.\n\ngreat salon... I will be back!\n\nget your coupon at:\nhttp:\/\/www.inzipfo.com\/coupons\/nevada\/89052-coupons\/","useful":1,"funny":0,"cool":0},
{"review_id":"_nJt6WBP98uvlLO3RU5MUg","user_id":"jFtmCvnxPhG_51KzEU7Ckg","business_id":"RJtgNpUFthlJ5grLr16GxA","stars":2,"date":"2011-08-12","text":"I will start out by saying this used to be the BEST sushi place in Henderson... Fresh, delicious and unbelievable Tuna. \n\nThe reason for my 2 star review is the place recently changed hands... not sure if ownership has changed or just management (as I was told). \nThe quality has really gone down hill and in my mind is just another sushi spot in town. I used to pick up from them 2 or 3 times a week. I am sad to say I will not be ordering from them anymore. :(( \nI ordered last week: Spicy tuna rolls, rainbow rolls, crispy tuna rolls and all were just OK... I did not like the smell or taste of the tuna. Its sad cause they had superior tuna before. Now it is just not good. \n\nPLEASE bring back the old En Sushi!!!!\n\nI miss the old staff as well... what happened to EN?","useful":1,"funny":0,"cool":0},
{"review_id":"Vch8bDECzu7W2ILFBRwy4g","user_id":"jFtmCvnxPhG_51KzEU7Ckg","business_id":"cL1hu4ntD1UV5Gewz_esng","stars":5,"date":"2011-10-26","text":"This place rocks!\n\nI really like this salon. Over the last 10+ years of my life I have gotten Brazilian waxes. They are typically pain full, no fun and take forever!\nThere have only been a few salons over the years that have made this experience pleasant and Pretty Kitty is one of them!  They are FAST, Experienced and do a great job with not too much pain. I am always amazed how quick the appointment is.  I am also very satisfied with the cost. Totally reasonable!\n\nThank you Pretty Kitty!","useful":6,"funny":4,"cool":4},
{"review_id":"jO7BLz93ty_CuDbqeXwRqQ","user_id":"YpSGbewp2EFf1t8egdsvfQ","business_id":"Wd0ojAfJ3JicmE0T2K7UqQ","stars":5,"date":"2017-06-27","text":"I've been taking my kids here for a while and I absolutely love this office. We currently live in the Goodyear Area and I'm more than ok with taking a 30 minute drive to get to the office. My kids see doctor Shepherd and she is awesome. Very knowledgeable, caring, understanding, and very gentle with my children. She always available for advice or to answer any questions that I may have. Anita, the MA is just as awesome. She's easy going and very knowledgeable as well. They make their patients feel like they're at home and that's what I love most. When I call and leave a message for the nurses, they call back ASAP and that's another thing about this place, you don't have to wait hours for a response on questions that you have. Front desk are always cheerful and greet you with a warm smile. This office is the way to go!","useful":0,"funny":0,"cool":0},
{"review_id":"3-qZ_ZlWCyCc_6evq0yLdA","user_id":"YpSGbewp2EFf1t8egdsvfQ","business_id":"8Vpfy_WtcVvZS8Wfz7JQJA","stars":3,"date":"2016-07-12","text":"It's wasn't the greatest but it helped with our carvings at the time.  I wouldn't make this a go to spot to eat.","useful":0,"funny":0,"cool":0},
{"review_id":"bCjuV2TcglWq-nWjKAdoyw","user_id":"lPs5Z6dT75U-4NUN9K9-Kg","business_id":"PIK3IeCCb7tYchND-UDUEw","stars":5,"date":"2015-08-23","text":"I had a wonderful experience with everyone at La Bella bridal. Erin was absolutely wonderful! She was very professional and very kind. Very honest as to what looked right and what didn't look right. I felt like she was a part of the family.. Thank you ladies for making my special purchase wonderful! One more thing! Their prices are amazing!! I would give them 10 stars if I could!\n                                    Lisa w.","useful":0,"funny":0,"cool":0},
{"review_id":"f3o3WrXj7aDwWu2NL44NLQ","user_id":"snaZ_ormZAzXnmUuubSi2w","business_id":"WGRpmHGkPxBnQ8HOZM7QLQ","stars":5,"date":"2015-03-18","text":"I love this restaurant!!!!  The food is amazing!\nThe owners are very friendly and welcoming!","useful":2,"funny":0,"cool":0},
{"review_id":"U0asQRWpD7YDqu-zRepkUQ","user_id":"an9fvktswtMJOSvEqiEocw","business_id":"Gru0oL8j97xTxu--d50uZA","stars":5,"date":"2015-06-06","text":"Great experience. .  Quick and convenient..  no overselling.   DR Peterson was thorough knowledgeable and professional.  No appointment needed..  I like that!  My schedule to busy to have to make appointments if I don't have to..","useful":0,"funny":0,"cool":0},
{"review_id":"5qnWv1C-_N0lgT2iT6-nOQ","user_id":"GxBkOpJWtxVmgjaJIxC1rQ","business_id":"c_FTil8s5PS2l_YJDQAXhA","stars":5,"date":"2017-04-30","text":"I went here with my girlfriend On a Sunday afternoon, I had the best server ever Christine!!! And the food and atmosphere was absolutely amazing!!!! This my favorite place to come and hang out :)","useful":0,"funny":0,"cool":0},
{"review_id":"fdwcGWjt5edCFwSHkx2zPw","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"j3SHAiF8OIlY3kUPnAAlKw","stars":4,"date":"2013-08-09","text":"Ever since I moved to Charlotte from Chicago 2 years ago I've been looking for a good Chinese take out place.  Back home you could find one every couple of blocks and my absolute favorite is Wing Wah (Oh, how I miss you, cue the water works.)  \n\nI had tried a few places here and nothing came even close to my most cherished Wing Wah.  I'm used to fried rice being brown thanks to that yummy, salty soy sauce, not white like what I'd gotten here.  Fried rice should not be white!  \n\nAfter being let down so many times I just gave up on finding Chinese take out.  Then, one day I was informed of House of Leng.  I scoffed at the recommendation because my heart  nor my taste buds could take the potential disappointment.  However, one evening when the Chinese food craving bug kept biting me I decided to give House of Leng a try.  I ordered the Orange Chicken with fried rice.  Yes!  The rice was actually brown and tasty.  The chicken was okay just not my favorite.  Naturally I had mixed feelings but did at least have some place to go to if I just wanted fried rice.  A couple of days later my co-workers were going to House of Leng for lunch and invited me to go so I did.  \n\nBased on a recommendation, I ordered the Crispy Scallion Chicken with, you guessed it, fried rice.  Just thinking about it makes my mouth water.  The chicken was delicious and went perfectly with the fried rice.  Portions were large yet I ate everything on my plate.  My co-workers all starred at me in shock because they are always teasing me about my picky eating habits.  Even better was that my meal was only $8 or $9.  Say What!?  I still miss Wing Wah, but the longing isn't as strong as it once was.  Finally, I've found my Chinese take out place in Charlotte!","useful":4,"funny":2,"cool":1},
{"review_id":"TRXbPVych9NomJha3Gbyqg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"vbUABNAQI2iwN7v0xSqG9g","stars":2,"date":"2013-08-25","text":"This Popeye's is located right by my dentist's office (Dr. Stainback - she's awesome, read my review) but I've never been able to go because you can't really eat right after you get your teeth cleaned, now can you? So, each time I would pass by it, arms outstretched, just reaching in longing.  \n\nMy chance to sink my teeth into some golden, fried, well seasoned chicken that I've been craving for so long finally came a few days ago when I went to see Dr. Stainback for a follow up appointment.  She didn't have to do anything so as soon as I left her office I raced down the street to the Popeye's.  I ordered what I always do when going to Popeye's, the 3 wing combo with lemonade and also decided to give the beignets a try since they were only $1.  The service was quick, good, and friendly but my food was just ok.  My chicken and fries were pretty good but my biscuit was hard and the beignets were even harder which also tasted like they had been fried in chicken grease.  It will probably be a long time before I have Popeye's again because I don't think I'll be coming here.","useful":2,"funny":2,"cool":0},
{"review_id":"lANBEEWvR5hGETgJauwVWQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"fJqY-E3adwx7LLozV1TfFA","stars":5,"date":"2012-04-26","text":"Okay, so not only are the menu options crazy awesome the staff is equally awesome! After staring at and drooling over the menu for over 20 minutes, trying to decide on one thing to eat, (the options are endless), I landed on the Sweet and Sour chicken served with jasmine rice. \n\nWhile I waited on my food I perused the drink menu and selected my drink of choice, Pookie's Punch.  Now, I'm not a big drinker but, I can never say no to a deliciously sweet cocktail.  Pookie's Punch certainly delivered.  I even had the pleasure of meeting the manager in which the drink was named after, thanks to my server.  Funny thing though, his name isn't Pookie.  \n\nJust as I finished off my drink my food arrived and I stuffed myself silly.  My food was so good I wanted to pick up my plate and lick it.  I'm sure my friend was grateful that I didn't.  \n\nIn essence, what I'm trying to say is that if you haven't been to eeZ yet you need to go post haste.  Perhaps you'll run into me there!","useful":0,"funny":0,"cool":0},
{"review_id":"iv4lIrTzFp99d8XD-Gb-2A","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"OFsG3JcfVS3gWObH9vzUmg","stars":4,"date":"2012-05-03","text":"I ended up at this store to attend a new hair product demonstration that was being held in the store's community room (I can't say no to free samples!).  When the demonstration was over I browsed around the store and was pleased with what I saw.  Not only was there a wide variety of organic and natural foods and beverages there were also health, home and beauty products.  I was most excited to see all of the different hair products for us natural haired gals.  Can you say hair product heaven?  I kid you not I was in that aisle for about an hour.  \n\nThe staff was equally great.  They were really nice and they even mentioned when some of the products I was looking at would be on sale.  Needless to say I'll be going back even if there is no sale.  What ever you could possibly be looking for this store has it!","useful":1,"funny":1,"cool":1},
{"review_id":"ki4PVi3191J7fV_qLV7HDA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"3vkP6t_kKN3JT8MMUaBVEA","stars":5,"date":"2012-04-26","text":"Alright, so I may be biased but this has been my favorite place to eat for at least the past 20 years of my life.  I used to travel full time for my job so I've been to several locations across the country; Chicago, Southfield (MI) Toledo, San Diego, Dallas, Atlanta, Aventura (FL), Ft. Lauderdale, Miami, Jacksonville and my hands down favorite Boca Raton!  \n\nI've been ordering the same thing for all these years, bacon and eggs with pancakes.  Now these pancakes aren't your ordinary tasting pancakes.  They melt in your mouth and every time you take a bite a slight moan of delight escapes your lips.  \n\nAlthough the portion sizes may vary from one location to the next (The Boca Raton location is my fav because the pancakes were the size of a large plate!) but the pancakes always taste the same.  The prices are a bit higher than typical breakfast spots like IHOP and Denny's but trust me it's well worth it.  Hey, don't take my word, try it for yourself and you will definitely become a believer.  You won't look at any other pancake the same!","useful":1,"funny":0,"cool":0},
{"review_id":"qTxTu2_aj2m40jwArUq-Mw","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"NFm869_w6cvVaWaNpAzjeA","stars":4,"date":"2013-08-08","text":"So, one of my Meetup groups had an outing planned here that I wasn't able to make but the name intrigued me.  Automatically I started thinking that I don't know if I would want to eat at a place that eludes to anything that is gastrointestinal related.  However, my curiosity continued to get the best of me despite the name, so I checked out the website.  I was impressed with what I saw.  I'm a crazy picky eater so there are some dishes on the menu that you couldn't pay me to try, but there were also several that excited my stomach.  I'm a music junkie so I became even more excited when I read that different local DJs hit the ones and twos every night!  I said to myself, \"Self, we are so going to Soul Gastrolounge!\"  \n\nOne of my friends and I met up there on a Friday night around 9:00 and the place was packed!  There's a really cool outdoor patio that overlooks the street and inside is dimly lit and full of a laid-back, eccentric vide.  I thought to myself, \"I've found where I belong (tear, sniffle, sniffle).\"  My friend and I were told that we would have an hour and 15 minute wait, which normally would've sent us packing but we were fully committed.  So, we chose to wait at Twenty-Two (check out my review) which is right below S.G.\n\nWhen it was time for us to be seated we were lead to a bar right by the DJ booth (who was awesome btw).  Our server came by in a matter of seconds to take our drink orders and then we perused the menu.  Since I had already looked at it online I decided to order the Soul Wings (I wasn't feeling as adventurous that night but trust me I'll going back to try oh so much more.) and the french fries with garlic-herb salt, pecorino & truffle oil.  The wings were okay but I loved the fries.  Our server came back to check on us several times throughout our stay and was pretty darn amazing.  \n\nI'll definitely be back here.  The food options are just about limitless, reasonably priced and the service was awesome.  I say \"YES\" to Soul Gastrolounge and you should too!","useful":0,"funny":0,"cool":0},
{"review_id":"Ss6sahVZgMAorm1fjLylOg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"4vHqIhmx66pWqkaBSL8wZQ","stars":5,"date":"2013-08-21","text":"So, here's why I love this place.  Where else can you go to get a dining room set, cooking utensils, a shower curtain, earrings, the candy you ate in Japan that was so good you almost cried, the lager that knocked you off your bar stool in Germany, and the coffee that left you awake for 2 days in Italy?  No place, that's where.  As if this wasn't enough they throw in free wine tastings on Saturdays!  What?!!  Every time I walk into this store my mind is blown.  \n\nI regularly get Cafe Du Monde beignet mix, which is much cheaper than flying to New Orleans every time I get a craving, various snacks, and a variety of wines from all over the world.  Next up, is Pomula Passion Fruit Wine Spritz from South Africa which was on sale for $4.99.  Although the store offers sales frequently, you can get even better deals if you sign up to be a World Market Explorer member.  Like I said, I LOVE THIS PLACE!","useful":2,"funny":0,"cool":2},
{"review_id":"d8S9rt4BBKsaWpU5mj-DAg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"dEVap-JebgvRYTEaCo1YVQ","stars":4,"date":"2013-09-06","text":"I've been a fan of Target from day 1!  I've been to a few different Targets around the Charlotte area and this is my favorite.  It's pretty \"Super,\" get it?  Hahaha.  Corny I know but I couldn't resist.  \n\nI shop at Super Target for groceries, fresh produce, household goods, hygiene products (I just bought the Target brand Coconut body oil gel and absolutely love it!), movies, and the list goes on.  Unlike what most people who aren't Target shoppers believe, the prices are pretty low.  Definitely less than any of the grocery chains.  I also think that the Target brand items are of better quality than the store that starts with a \"W\".  \n\nI always come here with a list and always end up buying items that aren't on that list.  How can I not?  There are always things on sale and there are even clearance shelves that are hidden away in between the aisles boasting things that weren't on my list but perhaps should've been.  I come here so often that some of the employees recognize me. \n\nIn addition to the store's bountiful, bevy of items and groceries there is also a decent cafe that serves snacks and Pizza Hut plus there's a Starbucks.  I see people shopping and sipping on lattes and fraps all the time.  Sometimes I indulge in a frothy, caffeinated beverage myself.  \n\nSo, what's not to like this store has everything and then some!","useful":1,"funny":0,"cool":1},
{"review_id":"aQLISgXrgGipN0B4cd2HQQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"7m867lvE71rO_xJCjh8-gw","stars":3,"date":"2013-08-14","text":"I've been a fan of Marshall's for longer than I can remember and therefore know that the  selection of items can vary from store to to store.  Upon entering this particular Marshall's I expected to find lots of good stuff since the store is so large, shiny, and new.  \n\nThere are carts, baskets, and shopping bags right at the entrance that customers can use to make shopping a breeze.  I grabbed a basket and headed straight to the shoe department which is larger than most other Marshall's.  I found several pairs of shoes that I liked, but to my misfortune none were in my size.  \n\nI then meandered over to the clothing section and was left longing for a better variety and more clearance items.  My basket kept saying, \"Fill me, fill me,\" but I couldn't because I just wasn't finding anything that said, \"buy me, buy me\".  \n\nNext, I went to the handbags section and the sky began to open and the sun came shining through.  The selection of handbags is great especially if you like designer brands.  There were several Kate Spade, Michael Kors, Cole Haan, and Vince Camuto bags.  I had been looking for a new, small crossbody and found a pretty frickin awesome, turquoise Kelsi Dagger bag for $24.99.  I couldn't believe it!  It was originally $198.  Jackpot!  I snatched it up faster than the blink of an eye even though there was no one else around me.  I put the bag in my basket and walked up to the register with a smirk on my face and extra confidence in my walk.  \n\nSo, to sum it all up I'd definitely go back to this Marshall's for more handbags, shoes if I can find my size, but may not bother with the clothes.  I didn't really look in the home furnishings department but from a quick glance it appeared to be limited.  I'll take a closer gander on my next visit.","useful":0,"funny":0,"cool":0},
{"review_id":"TBw6t2IuLiX_4HrjHZKGFA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"ugYn03wpInU4DeU-VuKWOQ","stars":4,"date":"2012-05-26","text":"Prior to moving to Charlotte I knew I was going to need furniture.  For the amount it was going to cost to have my furniture shipped from my hometown I could basically purchase new furniture for my Charlotte apartment for less.  \n\nKnowing that I was going to be under a tight time constraint from when I moved into my apartment to when I would begin working, the sales consultant at my apartment complex suggested that I rent furniture.  My complex has an agreement in place with Cort Furniture in which apartment residents are able to rent furniture at a slightly lower  than regular rental rates.  I was able to select a furniture style (contemporary or traditional) and for $99 a month my entire apartment was furnished.  No that wasn't a typo.  $99 a month for a completely furnished apartment!!\n\nI had a bedroom set with mattress, dining set, couch, accent chair, cocktail table and end table and two lamps.  What was really great was that the furniture had already been delivered before I moved in.  Woohoo!  Although my mattress was pretty uncomfortable I was so happy to not have to deal with shopping for furniture right away.  \n\nWhen I decided to stop renting my furniture cancellation was as simple as 1-2-3.  Well, actually just 1.  All I had to do was cancel at least 30 days before I wanted the furniture to be picked up.  On pick up day two guys came in and carried off the furniture in almost a blink of an eye.  \n\nWhether you're new to Charlotte like I was or are in need of new furniture but don't have to time or money to purchase yet Cort Furniture rental is the way to go!!!","useful":5,"funny":0,"cool":0},
{"review_id":"aVYsB_rS07MrZv2DX7up3w","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"jXHmmircEbhQmZjWDR1xIA","stars":4,"date":"2013-08-01","text":"So, a friend calls me up on a Saturday night and asks if I want to go to brunch at Bistro La Bon.  Being the picky eater that I am I had to check out the menu first before I could commit.  The menu looked doable so I told her sure.  \n\nThe next day I'm driving to the restaurant and my GPS leads me into a strip mall and I said this can't be right.  With a name like Bistro La Bon I'm expecting valet parking and some ritzy, exclusive location.  I pull into a parking spot to check the address again and realize that I am where I am supposed to be.  I look up and see that the restaurant is at the end of the strip mall by the Family Dollar.  Obviously, I'm thinking where in the heck has my friend brought me.  I walked inside and was pleasantly surprised.  The decor was warm and inviting and the place was packed.  \n\nMy friend and I were lead to our table and our server explains that we can get food from the buffet as well as order food from the kitchen.  I went to the buffet and ended up with a plate of 4 or 5 grapes and 2 pieces of pineapple.  I had no idea what the other stuff was and I wasn't about to find out.  So, I ordered some eggs, bacon and brioche french toast from the kitchen.  Thank goodness the french toast was included in the buffet price because I got not 1, not 2, but 3 orders.  I'm not the type of person that over eats but I simply couldn't stop.  If I hadn't of felt my pants tightening around my stomach I probably would've gotten another order.  \n\nTo sum my experience up, the buffet was a little pricey at $20 not including any drinks but the service was great and that french toast is palette blowing.  I will definitely be going back and next time I'll be wearing a dress or sweat pants.","useful":0,"funny":0,"cool":0},
{"review_id":"i2eBoNNA7ZqCLYLr6qj9MQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"2C-KTLupCM9yY1eWQ13pqA","stars":4,"date":"2013-08-17","text":"This place is a natural gal's hair paradise!  Although the shop is small (could probably walk the entire length in 15 steps) you still need to give yourself time to peruse all the products.  I spent over an hour here sniffing and touching everything since majority of the products being sold have test samples.  \n\nThe store sells products that are you can usually only find online such as Karen's Body Beautiful, Curl Junkie, Oyin, My Honey Child, Bee Mine and the list goes on.  There are also body products and hair accessories for sale.  As far as the prices go they keep in line with the average costs of high quality natural hair products (i.e. around $15 - $45 depending on the type of product).  \n\nThe great thing about shopping at Beauty by Nature is that after your 10th purchase, no price minimum required, you receive a $10 store credit.  You also receive discounts for reusing the shopping bags you receive with your purchases.   \n\nAll I can say is that this place is awesome and I will definitely be back. \n\nP.S. You can also make appointments to get your hair done here.  I usually do my own hair but may schedule an appointment some time in the future.","useful":4,"funny":0,"cool":2},
{"review_id":"J7YDWn22P7ohMoGB0viruw","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"Z3r5MgPhbYMvB3-JowAmVw","stars":2,"date":"2013-08-10","text":"This has been one of my favorite stores for the past 6 or 7 years.  Back in Chicago there were several within the city limits and surrounding suburbs.  I would go to a Nordstrom Rack every couple of weeks because the merchandise was constantly changing.  \n\nI've found awesome finds such as Citizen jeans for $18, multiple French Connection dresses ranging from $30 - $40, and Dolce and Gabbana sunglasses for $50.  Each location had a great selection.  So great that I would spend at least 2 hours in the store every visit.  \n\nNaturally I was super, duper excited when I found out that one was coming to Charlotte. I ran through the streets of my neighborhood shouting, \"It's here!  It's finally here!\"  Okay maybe I didn't do that, but I did hire a jet pilot to write a message in the sky.  Nope, didn't do that either.  I did however, make the almost 40 minute drive from where I live to the store smiling and giggling all the way like a school girl with a crush.  I arrived expecting to leave the store with at least 2 bags full of loot but instead I left with crushed hopes and dreams :(  The selection of clothes, shoes and accessories was pretty underwhelming.  Definitely wasted my time and gas.  For shoppers who have never experienced a Nordstrom Rack in a major city the one here may suffice. For those of us who only know big city Nordstrom Racks, don't waste your time unless you live around the corner from the store and are bored.","useful":1,"funny":0,"cool":0},
{"review_id":"6sqpccl_8TQ-pzimfCkvTQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"NRcFHW2P1o9lVQ53Q682rg","stars":3,"date":"2013-08-06","text":"My friend and I ended up at Twenty-Two while we were waiting for our seats at Soul Gastrolounge.  The place is really chic and has a modern loft feel to it.  There are a variety of cool paintings along all the gallery walls.  \n\nMy friend and I didn't want to seem like we were uncultured lushes so we perused the paintings before making a beeline to the bar.  I must say they were pretty darn good.  I always wished that I could paint and draw but guess what, I can't.  Such is life.  I do however, appreciate and recognize good art when I see it.  Anyway, after we looked at all the paintings we grabbed a couple of seats at the bar and requested a couple of menus.  I'm not a big wine or beer drinker so I ordered a cider ale which was a special and quite tasty.  \n\nOur bartender was really nice and we ended up meeting some really cool people.  We even had a hearty laugh when the bartender recognized some patrons who were a bit unruly and had to be kicked out the last time they were there.\n\nSince I enjoyed Soul Gastrolounge so much and know that there will probably always be a wait to be seated there I will more than likely check Twenty-Two again.","useful":2,"funny":1,"cool":0},
{"review_id":"yf1xo_Mx0su79bbK7HaUpA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"QWH7RRcwLJvOU-GYB5xBgA","stars":5,"date":"2012-05-17","text":"Let me start off by saying I love this place!!!!  The variety and selection of furniture is quite vast.  After being in the store for only a few minutes I found the sectional of my dreams.  I worked with Pam who was extremely helpful and friendly.  She showed me the different colors that the couch came in without hesitation just to make sure I had seen all the options before making a final decision.  \n\nUnlike other stores, Havertys offers many of their furniture pieces in a variety of colors at no extra charge.  Now, if you want to get fancy and have some extra doe to spend, you can choose from a number of custom fabrics and put your own personal touch on the furniture style of your choice.  \n\nI spent a few days after I purchased my sectional looking at other furniture stores for accent chairs and couldn't find anything.  So, I went back to Havertys and found a chair style that I really liked and picked out a custom fabric.  The chairs were on sale which made up for the additional custom fabric cost.   \n\nYou may end up paying a little bit more than other furniture stores but the quality of the furniture is incomparable.  Don't believe me go and check it out for yourself!","useful":2,"funny":0,"cool":0},
{"review_id":"jqK8ewwacfQmZKseVOuIWQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"L3Vz7Hx4Ex5GQBn8NhVl_g","stars":3,"date":"2013-09-06","text":"Being a natural haired gal I regularly research on new hair products.  It's actually a very scientific process.  Aside from reading the labels you also need to check the fragrance and consistency of a product before committing to purchase it.  I wouldn't go as far as to say that I'm a product junkie because I do at least wait until I'm out of something before looking for something else.  \n\nThe sales associates are usually pretty friendly and helpful.  I've been here a number of times and have always gotten good service.   \n\nIn the front of the store is usually a clearance table that shouldn't be skipped over.  If you've read any of my other reviews on any particular store you know I'm all about the clearance.  In addition, the store tends to run sales pretty often.  Just remember to let the sales person know because the items don't always ring up for the sale price.  \n\nAlthough the store is small it definitely has just about everything for your beauty and grooming needs.  On average, I think the prices are a bit higher than what you may find online or at other beauty supply stores which is why I'm only giving it 3 stars.  But, if you're ever in need of any hair care, nail, or waxing products give Sally's a try.  I'm sure you'll find what you're looking for you may just end up paying more than you expected.","useful":1,"funny":0,"cool":0},
{"review_id":"loVWKs393-wbo3ETrY4LyQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"wUHPgIh-rJThxPvxHPlsjQ","stars":4,"date":"2012-04-26","text":"I've been to Wet Willie's in Miami a few times and always had a good time and decided to give the one in Charlotte a try.  The crowd in Miami was usually pretty hype. I went with a group of friends after leaving the Comedy Zone.  The crowd was nothing like the one in Miami but that was fine with me.  Nowadays I have to mentally prepare myself for the hypeness.  Definitely don't like being unexpectedly hot and sweaty when I go out.  \n\nOur server was very friendly and asked us right out the gate if we wanted to sample any drinks before we ordered.  Of course my friends and I said \"Yes!\"  I tried the \"Margarita, Sex on the Beach, Bahama Mama and Mango.\"  After my mini taste test I decided to go with the Mango.  Crazy thing is that I don't even like mangoes but my Wet Willie's Mango treat in a cup was shear ambrosia.  \n\nAside from the great service and delicious drink the live band that was playing that  Friday evening was amazing.  As with most bars and clubs the crowd is different every night but if you give me a good drink and great music who cares about the crowd.  A good time is what you make it.  I'll definitely be going back.","useful":1,"funny":0,"cool":1},
{"review_id":"GCuqrWnrTBU7zWC5qGq_lg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"CJty_bUZVJJaLFcTppxmzg","stars":4,"date":"2013-08-15","text":"Music is an integral part of my life.  If I don't go to at least 2 concerts every month I start to go through withdrawals. I'm a much bigger fan of smaller venues than massive sized arenas.  When the venue is smaller the entire concert experience is enhanced because it's more intimate and you're closer to the artist.  \n\nNeighborhood Theatre can seat a few hundred with mezzanine seating at stage right and floor seating facing the stage. The sound is great and spot on.  You can easily hear every note that is played or sung.  The only drawback is that the space is a bit dated and could use a few modern touches.  Other than the decor I think this place is awesome and will definitely be back for more concerts or events.","useful":1,"funny":0,"cool":1},
{"review_id":"7cLsQzya4tR_QdsrHvnIRQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"KFe0FPPAIPDoFaPE1MyUAw","stars":3,"date":"2013-08-25","text":"I love clothes thrifting and have been wanting to visit Sweet Repeats for a while and finally made it there.  The boutique has two sides: the upscale side and the consignment side.  The upscale side carried brands like Valentino, Miu Miu and lots and lots of St. John which is generally worn by a more mature and refined woman.  The prices on this side of the boutique were pretty high.  The cheapest thing I saw was a blouse for $150.  There is a clearance rack but I didn't see anything that I would even consider wearing.\n\nThe consignment side of the boutique is geared more towards women who were born in the 1970s and beyond.  The brands that I saw on this side included: Juicy Couture, Marc by Marc Jacobs, and BCBG just to name a few.  Again, the prices were a bit high in my opinion, but definitely more affordable than on the upscale side.  This side also featured Louis Vuitton, Gucci and Coach handbags.  \n\nI will say that I found several clothing items that I liked but wasn't willing to pay for them as I don't really need another pair of pants, jeans, shirts, sweaters, jackets, dresses, or handbags.  Nowadays I only buy things if they speak to me and a montage of events in which I will wear the items flashes through my mind.  I did find a few items on the clearance rack that I liked and ended up buying a pair of Joe's Jeans.  The original consignment price was $69.50 (way too high for used jeans) and I got them for $17.  I have at least 4 pairs of Joe's Jeans all of which were purchased brand new and I've never paid more than $50 for any.  \n\nI would go back to Sweet Repeats but only under two conditions.  1) I was already in the area as I wouldn't make a special trip and 2) would only purchase items from the clearance racks on the consignment side.  Even though the selection of items for sale is quite good I can't give this boutique more than 3 stars because of the high prices.","useful":5,"funny":0,"cool":1},
{"review_id":"5tLV4rJ1KvnV7D6jlIQt2g","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"mcMNaDARo6TXEnwm94xBOQ","stars":4,"date":"2013-08-01","text":"'ve been to the the Wearhouse about 3 times and I spent at least two hours there each time.  If you're not into combing racks for buried treasures resale shops may not be the places for you.  For me finding great deals on some awesome clothes is almost like winning a game even though your team was down with only 5 seconds left on the clock.  Perseverance plus dedication to the win (landing multiple good deals) = VICTORY!  However, if you're not as hard core as I am but still like going to the occasional resale shop let me help you navigate this store.\n\nThe Wearhouse is very well organized and divided into two sections.  The front section of the store is consignment which includes the designer brands.  I've seen brands from Marc Jacobs and DVF to J.Crew and Seven for All Mankind.  These items can be a bit pricey but you can still find some really good deals.  Towards the back of the store is the thrift section.  Some of the brands I've seen in this section have been Express, Forever 21 and those that can be found in any typical clothing store.  The thrift items are significantly less expensive than the consignment items but there are more to sift through.  \n\nThe great thing about the pricing of many of the items is that after a specific date the price goes down.  For example, you've just found a jacket in consignment in which your mind flashes through all of the different places you will wear it and the numerous compliments you'll receive.  When you snap back to reality you realize that although the jacket may enhance your life, it's a bit more than you want to spend.  No worries, just look on the price tag and there is information on the exact date in which the price will be reduced and what it will be reduced to.  \n\nAnother great perk about shopping at JLC Wearhouse is that there are sales all of the time.  There is also a frequent shopper program in which you can get 30% off of a purchase after you make 5 purchases of $25.  Sounds great right?  If I haven't enticed you to check out the store yet maybe a recount of my last shopping spree will!\n2 pairs of J. Crew pants\n1 pair of purple palazzo pants (Only $4! They are my favs!!)\n1 suit\n1 J. Crew dress\n2 cashmere sweaters (Banana Republic)\n2 shirts (1 of which was a Paul Stuart.  Generally retail for at least $200.)\nGrand Total: $92","useful":8,"funny":2,"cool":3},
{"review_id":"3nqI5FsBhORUsZKDKBJ0vw","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"d6McSv0tAhcjbzzF2iNzow","stars":4,"date":"2012-05-26","text":"I just received my new bedroom and dining set from Furniture Row and as JJ Evans used to say it is Dynomite!  I love it!  \n\nI worked with Paul at the store who was extremely helpful and very patient.  After looking at bedroom sets for over an hour, choosing one and purchasing it I went back to the store a couple of days later to add a chest and decided I liked a completely different set better.  Paul cancelled my original order and rang up the new order with no problem.  Don't plan on having to buy a new bedroom or dining set for a very long time but when I do I'll definitely be going back to Furniture Row!!!","useful":6,"funny":2,"cool":0},
{"review_id":"IBZjssFAcAJRW97cLBg-Qg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"l15YOYvy1cmOkNCDNEva4g","stars":5,"date":"2013-08-17","text":"So, let me get this out of the way first, \"This place is frickin great!\"  I've known about Trader Joe's for years as they were all over the Chicagoland area but never started shopping there until several months ago after being in Charlotte for a little over a year.  \n\nI was going to Petco right next door to get some dog food for my little guy and remembered that I needed to buy some adult beverages for a dinner party I was going to later that evening.  One of my friends told me that TJ's had a great wine selection so I decided to check it out and guess what, she wasn't lying.  I'm far from being a wine connoisseur so I appreciated the little cards that described the flavors of the wine and the perfect pairing.  I ended up getting 2 bottles of wine for about $12.  What'd you say girl?  You heard me 2 bottles, $12!\n\nSince then TJ's has been my go to grocery store especially since their products are predominately organic and chock full of natural ingredients.  Even though it's relatively small in comparison to other grocers  don't let the size fool you.  You can find everything you need from fresh produce, meats, frozen foods, snacks, household cleaning and hygiene products to the extensive wine selection.  \n\nAside from everything that you can find in the store the prices are really reasonable (Dare I say... cheap?) and the staff always seems so upbeat and happy-go-lucky.  I love it!  Definitely drop in next time you're near a TJ's.  I promise you won't be disappointed and you definitely won't walk out empty handed.","useful":2,"funny":5,"cool":2},
{"review_id":"QE0gnpZJ4pCd2hCYxYeXOA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"WCqcYtJ4rUxA4bIzjOfzqg","stars":3,"date":"2012-04-26","text":"I had actually passed by this place several times without any consideration before going with a group of my gal pals.  A rather large group (there were about 20 of us).  When I walked in the door I was pleasantly surprised.  The place is really contemporary and modern looking.  As a result I thought the prices would be a little on the high side but man I was I wrong.  \n\nAs you enter you are given a card which keeps track of all that you order.  Instead of having to wait for a server to take your order you simply head over to your station of choice (pizza, pasta or salad) and place your order.  Be amazed as your food is prepared right before your very eyes.  You can order drinks from the bar or the food stations.  Once your food is ready you can take it back to your table and dive in.  \n\nI wasn't overwhelmed by the taste of my food but it's definitely some place that I would revisit.  The meal prices ranged from $7-$11 and for the portion size that I received it can't be beat.  This is also a great place for large groups.  Thanks to the order cards you never have to worry about splitting the bill.  Another great thing is that the evening I went there was live music.  A couple of my friends were even asked to join the musician in song and dance.  That made for a pretty entertaining few minutes.  Thankfully they didn't torture the other patrons for too long.\n\nSo, if you're looking for a place to eat with a bunch of your friends and you're just looking to relax in an aesthetically cool, chill environment with cheap eats this is the place for you!","useful":3,"funny":0,"cool":0},
{"review_id":"927YgWk954lwtQqnkSNJJg","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"MP0K70FGLftGI5Rxmteskg","stars":4,"date":"2012-05-26","text":"Is your back sore?  Or, maybe your hips hurt.  Could be from sleeping on raggedy, funky hot mess of a mattress.  This was definitely my case.  I had been renting a bedroom set from Cort Furniture (Didn't know you could rent furniture? Check out my review.) and a mattress came with.  Unfortunately the mattress was like a nightmare (cue the \"Psycho\" shower scene music), I just wanted to wake up from it and never crawl back in.  \n\nWhen I decided to stop renting my furniture the first thing I bought was a mattress.  Thanks to a $200 credit to Mattress Firm that I purchased on Groupon, the decision on where to buy my mattress set was made for me.  Before I actually went to the store I checked out the Mattress Firm website to get an idea of how much mattress sets were.  To my surprise there was a short questionnaire that asked about my sleeping patterns and then provided me with mattress choices that would best suit me.  As a result I was able to go into the store and tell Nick, the awesome store manager, exactly what type of mattress I was looking for.  I purchased a plush Hampton and Rhodes mattress set that is so comfortable that I've been having to hit the snooze button twice ever since it was delivered.\n\nI also had a great experience with the delivery.  The two guys that delivered the mattress set helped me to put covers on the boxspring and the mattress without me even having to ask.  Overall my experience with Mattress Firm was top notch.  If you're in need of a new mattress set go and pay Nick a visit and tell him I sent you!","useful":1,"funny":0,"cool":0},
{"review_id":"RpmEu3nMO-oghzvufJDo9w","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"4vDffQ7eSQ7n39cyroOSKQ","stars":3,"date":"2013-08-01","text":"As I said before I would only go back to Crave if a friend invited me to go and that's exactly what happened last night.  We attended a bear and cupcake tasting and once again the service could have been better.  It was definitely an improvement over the last time and my friends and I were able to get separate checks which was one of the issues I had before.  Although our server was really nice, we had to ask for the same things multiple times before we actually got them.  When we got ready to go one of my friends asked for the check and our server brought only hers.  My other friend and I had to wait about 10 minutes before she came over to our table again.  So, I'm saying it again, I wouldn't suggest going here but if a friend invited me to go I probably would just knowing beforehand that we probably won't get the best service.","useful":0,"funny":0,"cool":0},
{"review_id":"zERvvGHOHcufjwg_JfT-kA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"d6i4jdRndCleA2muNk7opw","stars":4,"date":"2013-08-14","text":"I love this store!  I'm a total clothes, shoes, sunglasses and handbag junkie and this place has what I like.  Despite it being in the ridiculously massive Concord Mills it has its own private entrance and you can usually find a parking spot not too far from the door.  \n\nI will admit that most items are pricey since there store mainly carries designer brands (i.e. Kate Spade, Dolce and Gabbana, Seven for All Mankind, Marc Jacobs, etc.) but there are awesome clearance and sale racks which is where you'll find me.  My rule of thumb when shopping is never pay full price for anything which includes items that are already marked down when they reach outlet stores.  \n\nI've gotten clothes, shoes and handbags here all at great prices that even broke college students can afford.  Don't believe me?  Visit the store yourself and get back to me.  I bet you will have found at least one amazingly, great find and you'll want to go back for more.","useful":1,"funny":0,"cool":0},
{"review_id":"7opPHwTPnwrAtQ8ESVMgUA","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"gOOdzjVxP7Z7bGjsstRjcw","stars":4,"date":"2012-06-02","text":"In honor of completing our first year of grad school (celebration was a few weeks late but so what) some friends and checked out this place.  We had all heard of it but none of us had been before.  All we knew was that it was a place for us to have a drink or two or three.  Who's counting.  \n\nMy friends are beer connoisseurs or enthusiasts if you will.  I on the other hand am not.  I don't know the first thing about beer except that what I've had in the past I didn't like.  Fruity cocktails are more my speed.  So, I was thinking to myself great I'm going to have to sit here and watch my friends celebrate as I sip on a Sprite.  Woohoo!  Lo and behold there are mixed beer combos that are sweet.  Yay!!! Who knew.  Maybe you did but I sure didn't.  \n\nI had the Hummingbird H20 and it was yummy.  I then tried the Snakebite which wasn't as yummy but it wasn't terrible.  Our server was great and really knowledgeable about all of the drinks (the Snakebite wasn't her recommendation for me but I was being adventurous).  Which is quite impressive since there are hundreds to choose from.    Greatest part was that the drinks were cheap.  Only $5 a piece for my tall glasses of brew.  Definitely a great place to chill with good people and kick back a few.  There's also a full menu.  Always best to drink on a full stomach just something I learned over the years :-)","useful":1,"funny":1,"cool":1},
{"review_id":"0PqoHAsReB3IdMGq2dvEWw","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"DwV9lb-2ErTMER4BQWG0xw","stars":4,"date":"2012-05-07","text":"This is one of my favorite places to eat and has been for years. I figure who better to write a review on Texas Roadhouse than someone with years of experience.   I've never ordered anything that I didn't like.  The food is always well seasoned and tastes great.  Although it's not a meal (wish it was) my favorite thing to eat from here are the green beans.  Instead of getting two different sides with my order I get two orders of green beans!  I have no idea what makes them taste so good.  The only conclusion I've drawn is that they're laced with some type of drug because I'm addicted to them!!  \nThe rolls with cinnamon butter are also delicious.  I've gotten full off of them plenty of times.\n\nOn top of the great food the service is also really good.  There are also plenty of tasty treats on the drink menu.  Try the Jamaican Cowboy on for size.  This is a great place to bring your friends and family.  The prices are reasonable and this place should exceed your casual dining expectations.  I know they exceed mine!  \n\nSince this is a popular restaurant if you go between 6:30 and 8:30 you may have to wait a bit for a table.  It can get pretty crowded especially on the weekends.  But that should only tell you one thing, Texas Roadhouse is a great place to eat!","useful":0,"funny":0,"cool":1},
{"review_id":"8r3EquOjvrK5C9uDeh47SQ","user_id":"06L7NJYeQMmkWwcb_yho1g","business_id":"ZYCtGmwvWO85NPHY1Rk6pQ","stars":5,"date":"2012-06-21","text":"I may not be anal about many things in life however, my teeth are the exception.  I've worn braces twice and had to have 8 teeth removed in the process (Four of which are my wisdom teeth.  Does anyone know why they're called wisdom teeth?).  After all of that you better believe that I go to the dentist every six months religiously.  Well, that was until I moved to Charlotte.  Moving to a new place is always fun and exciting in the beginning but the novelty wears off when you begin to think about practical things like, \"How do I find a good doctor, Where do I take my car for service, What's a good salon (I'm 0-2)  \"Where do all the cute, SINGLE, guys with jobs hang out (Hey, how'd that get on the list?), and of course How can I find a good dentist that knows what they're doing and won't cause me to have to take a bottle of Advil when I get home?\"  \n\nSo, one day I'm checking my email and I get one from AmazonLocal Deals, which is really just LivingSocial, and I see a deal for Healthy Smiles Family Dentistry in Concord.  $55 for a cleaning and x-rays!!!! I said to myself, \"It has been 9 months, 12 days, and 14 hours since you have been to the dentist. Buy the deal!\"  I bought it.  Now, I was a bit skeptical about going to a dental office that I found on LivingSocial and so no joke, I prayed that it would be a smooth visit and indeed it was!  \n\nDr. Stainback, her husband Horace, who's the hygentist, and the receptionist are great!  They were all really nice.  Surprisingly, I had a great time at a dental office.  Never thought I'd ever say that.  Horace even took pictures of my teeth with a little camera on a wand that fit in my mouth.  I had never seen anything like it.  He then showed me the pictures and went over them with me in detail so I would be able to understand the dental lingo when Dr. Stainback came in.  \n\nThe best part is that Dr. Stainback's service prices are really reasonable.  I don't have dental insurance but was thinking about adding it to my medical plan and decided not to after I was given Dr. Stainback's prices.  It's cheaper for me to pay out of pocket than to purchase dental insurance.  I've found my dentist and couldn't be happier!  Now I just have to find a good salon and a male companion (Dang, another slip of the tongue!)","useful":10,"funny":4,"cool":2},
{"review_id":"jaw6hoPNGh0n9TXBPff8ZQ","user_id":"Wwk2393iPcFWhBdFPgTfnA","business_id":"-0qht1roIqleKiQkBLDkbw","stars":1,"date":"2016-06-18","text":"STAY AWAY FROM THIS PLACE PEOPLE!!!!!!!!!!\nThis place was and is a total night mare.  Diamond resorts is a shady time share company.  Do not deal with them they lie about everything and will try to take your money in any desperate way they can.  They will brain wash you and promise you all kinds of stuff.  They claim they are giving you some type of gift that is just another lie. They want to take your hard earned money to benefit themselves.  They stole money from me.  They took hundreds of dollars from me for no reason at all.  I never bought time shares from them because of their dishonesty and shady tactics.  Unless you have extra money laying around and do not know what to do with it stay away from this place.  Terrible people just after your money and stealing from hard working people.  So many nice places in Vegas that won't ruin your vacation or steal from you in the end. I have been to Vegas over 10 times and never once had a problem until I went to cancun resorts and dealt with diamond resorts.  Stay away from cancun resorts stay away from their time shares you will be glad you did.  Just trying to share our experience so others don't get scammed like we did.","useful":1,"funny":0,"cool":0},
{"review_id":"QmpzUXfCaCr49847Z3n1pQ","user_id":"KRHhM1EEhPTd7q5VoehjuQ","business_id":"gfIVwp0RkM5yMa1u3mbB4Q","stars":5,"date":"2016-10-23","text":"Love spending time here. \n\nTheir blended tea drinks are delicious (I love the lavendade and the Arnold on the green), as is their selection of loose leaf teas. \n\nI enjoy the food here just as much, though! The selection and pricing is sort of like a Panera, but local and better. The pear arugula salad is my go-to. \n\nThe baristas\/servers are very friendly, knowledgeable, and accommodating.\n\nI'm not sure if this cafe is conducive to going there to read or work, however. It can get a bit loud during the busy hours, and I think finding an outlet for a laptop would be a challenge.","useful":0,"funny":0,"cool":0},
{"review_id":"Ame6l7IvS2D-OPWkF3jV0w","user_id":"KRHhM1EEhPTd7q5VoehjuQ","business_id":"wDWKQR2psTIj4BZ0mf01Gg","stars":3,"date":"2016-05-31","text":"I will return to this place for sure, but there were a few \"cons\" to our first visit. We really enjoyed the look of the place; it's a bit like you're eating in someone's very posh mountain cabin. There are some gas fire places, two bars, and plenty of outdoor seating as well. The servers' uniforms of jeans and tshirts sort of clashed with the aesthetic, but it is nice to see comfortable employees. \n\nI tried the elderflower seasonal cocktail and loved it: sort of a toned-down floral lemoncello. I also enjoyed the house salad (mixed greens with tomatoes, roasted red peppers, feta and oil) and the crabcakes were scrumptious (as was the aioli; love the hint of lemon!). If there was filler in there, I couldn't detect any! My partner, however, was disappointed that his burger came out much more well done than he had ordered. We both agreed the side of fries were almost inedibly salty. \n\nI ordered a lemon tart to-go, and when I opened the bag later, delightedly discovered a sort of assemble-your-own they'd put together so that the tart wouldn't get soggy. It included the tart, four little sauce cups (two with delicious lemon curd, one with minted blueberry, and one with pureed strawberry), four blueberries, and chips of sugared crust for garnish. I felt like I was playing with an easy-bake oven again (this is a plus in my book), and it was delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"1W04BW60-N0oJD6KvasP4Q","user_id":"KRHhM1EEhPTd7q5VoehjuQ","business_id":"Ve6bA_jf9A7EWKXeyWf7PA","stars":5,"date":"2014-12-16","text":"We order from this place at least once a week. Their Award-Winning White Pizza, straight out of the oven, is literally the best slice I've ever eaten. Mandy's crust isn't thin enough to be considered New York-style, but isn't overly bread-y, either. The cheese tastes fresh and sharp, and they know how to wield an herb-shaker. What puts it over the top for me are the tomatoes they top their white pizza with...even in December, still firm, red, and full-bodied, like an in-season, vine-ripened Roma. \n\nDon't let the curt manners of the sales associates and the no-frills dine-in area put you off this amazing pizza.","useful":2,"funny":0,"cool":1},
{"review_id":"iV7ibVKMm3hnXGLo7dpApQ","user_id":"KRHhM1EEhPTd7q5VoehjuQ","business_id":"5LtZLznMWTNsciWBU3zg2g","stars":5,"date":"2016-09-07","text":"I love this place and won't take my hair anyplace else. \n\nI've had both wonderful cuts here, and a corrective color on an horrendous diy job. They all turned out brilliantly. Studio RAW nails everything: pricing, expertise, ambiance, hospitality, and friendliness. Love how they champion different charitable causes, too.","useful":0,"funny":0,"cool":0},
{"review_id":"tPGl61Rd8rs8r36xd1zt1g","user_id":"b_sJMASiKwmH6tZRIV4V8w","business_id":"ujHiaprwCQ5ewziu0Vi9rw","stars":1,"date":"2014-04-02","text":"My wife and I just ate here for lunch based on a recommendation from a local. This is one of the worst buffets I've tried in Vegas. The food was less than mediocre, and in most cases barely edible. Breads were stale and dry, flavors of most things seemed bland and cheap, and a platter of \"fresh\" burgers just put out were already cold. Avoid this buffet and spend your money elsewhere!","useful":0,"funny":0,"cool":0},
{"review_id":"k-QjuZCgnLqN74TVyhQkMQ","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"0OvM4_xU5cJYCo0bsbVEQw","stars":1,"date":"2014-09-09","text":"Absolute SLOWEST food service ive ever visited. They're consistently slow to a point of just plain silly","useful":0,"funny":0,"cool":0},
{"review_id":"78d8zVyME_NC_n-iQAxvFA","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"Dms-k7EA3d6YnCtrwxZ_BQ","stars":5,"date":"2014-09-16","text":"Just adding to my last review because I had my nails done by another technician there other than the girl they did them the first time. This time Brandon did my nails and he was beyond incredible professional, polite, accommodating, talented, i love this place!!","useful":0,"funny":0,"cool":0},
{"review_id":"waMR5SGWhvE43sfWVeLeLg","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"6UitXr8Ow66tmAycHhxwIA","stars":1,"date":"2014-12-05","text":"Omg are they sloooooowww! I understand it's a small town and limited staff but when there's a line of 7 people is that really the best time to chit chat about vacations and hobbies and such with the customers????? Come on now, that's just rude.","useful":3,"funny":2,"cool":2},
{"review_id":"ByTicsIaL_c9OMH75EXOMg","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"I6__xsL6K_aGeEJbN4sMJg","stars":5,"date":"2015-07-24","text":"So its not on the menu yet but they now have a deep dish pizza that is to die for! Im from chicago, I know good pizza, they nailed it!!! \nNot to mention the people who run this place are truely nice, genuine and just all around good people. Even if ya walk in there in a bad mood youll leave smiling. :-)\nThanks guys!","useful":3,"funny":1,"cool":1},
{"review_id":"mm3XgE4n3eum_dX5tguJgA","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"Q0fW4psOyHqGbkbF13ucqw","stars":3,"date":"2017-02-10","text":"Great place and great wings EXCEPT when the short female is working. She has major attitude, over cooks the wings till they're dry inside, even the Kool aid is watery when she's working. She also takes the phone off the hook when she feels like it. I don't know why they let her work there especially by herself. She is the only reason I stopped going and I was going about 3x a week!   \n Makes me sad because I really loved that place, she just kills it. The food and the customer service.\nThe rest of you guys are awesome! Would somebody please train her properly?","useful":3,"funny":2,"cool":0},
{"review_id":"mi1yVIfiaTrNk5tWuaKEMQ","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"fkjlGmamIYQHgnrE18X1LQ","stars":5,"date":"2015-05-19","text":"So far I've gotten a pedicure here and am about to get my nails done but am SO impressed with the pedicure I had to write this now. If you get a pedicure or massage you should DEFINITELY go with Lee !!! What a talented and absolute sweetheart she is!!","useful":3,"funny":0,"cool":0},
{"review_id":"Gc7yjNbNTWSx5WKw0ETDZA","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"_6KeQG5LVVLFvvXkoLZITQ","stars":5,"date":"2017-01-23","text":"This woman is absolutely AMAZING! I came to her in need of some slacks the I needed hemmed and taken in for an important job interview on very short notice. Not only did she get them done before I even needed them, which was like 36hrs after dropping them off, but she did an incredible job. They fit perfect! I have a very hard time finding pants that fit me and I've gone to a tailor before but never had a good result.\nE.g. I used to live in L.A (a place you would think custom tailors are easy to come by), found a place that came highly recommended but not only did they not fit bright but they screwed up the lining too! So I was hesitant to use a tailor again.\nBut being desperate for an interview outfit that fit I found Flor and gave it a shot.... not only is she the nicest, sweetest little lady you'll ever meet but she has some serious skill in the art of being a seamstress\/tailor.\nI will never use anyone else ever again. I love this little lady! Talented, fast, good prices, as sweet as can be. I wanted to give her a hug lol she's just so perfect!\n\nThank you Flor, you are an angel!","useful":1,"funny":0,"cool":0},
{"review_id":"CqjU8B6tMtXyE50mRuRx2A","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"UYYJ-XXX9Ije_m9035A7nA","stars":5,"date":"2015-05-04","text":"Great place. Quality work. Super friendly staff. All seem very genuine, funny, accomodating, made me feel like I was at a friends place or something which I have never experienced in nail salon. Also, not trying to be politically incorrect or anything but couldn't help but notice they all spoke perfect English which I thought was pretty cool. Just all around really good experience.","useful":0,"funny":0,"cool":0},
{"review_id":"mQU5CUFfXjlV5l4Vb-FXvQ","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"9DLz5BEC1ifj-yHHi6Xcsw","stars":1,"date":"2017-03-27","text":"I came here to study. Thinking a library would be peaceful & quiet enough to concentrate. This library is rather unique..... out of all the people in here (mind you school just got out so there's a ton of kids) the ONLY people that are talking aloud (going on 20min straight now) are the damn librarians!!!!! Seriously guys? There's 2 up front just flapping away like a normal convo at a loud restraunt and 1 guy who keeps coming in and out of a door that leads to the back and letting it SLAM every time he passes through it. \nI expect this stuff from I'll behaved small children but for the librarians ?!?!??","useful":1,"funny":2,"cool":0},
{"review_id":"59Szpl4iwdpOluZ4Lpg32g","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"6rl2DTYflL0t1_oL4KudYw","stars":2,"date":"2017-01-05","text":"I gave 2 stars because the artichoke spinach dip was pretty darn good. Aside from that the service was lousy, the pizza was soggy and the wine? I've had better wine out of a box lol. Sorry guys but for the prices you charge you should really step your game up just a little bit. = \/","useful":2,"funny":0,"cool":1},
{"review_id":"66cz2v0evFWWytRV5n451Q","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"UOTQRi7p6V6LP4onVVkN4w","stars":2,"date":"2015-01-18","text":"So I broke the glass on my tank of my vapor pen and needed a replacememt. Called around a few shops, most of which were really informative in either recommending a tank I'd like based on the one I had or just were too expensive or didn't have what I needed. I called this shop and they said they had a different model but same brand and it was 19.99 but right now had a special for 14.99. Between most of the shops being a lot further and my college student budget I decided on this shop. Got there and 1.They answered my questions with minimal attention (as if I were interrupting their social hour. I'm new to vapor pens and trying to learn as I go. Evidently this is not the shop to do that at) 2. Didn't offer the \"special\" I was told of on the phone and 3. After buying the tank anyway cuz I needed one and just wanted to get outta there I got home eager to satisfy my nic fit only to learn that  the tank I just bought SUCKED! It's like breathing through a coffee straw! Thanks guys.\n\nMy fault for not abiding by \"if it isn't broke, don't fix it\" and by that I mean that I have already found the BEST smoke shop in the valley but it's like 20miles away so I was trying to not make that  drive right than. A 2 Z Smoke is HANDS DOWN the best smoke shop in the valley, probably  the best I've ever been to and I've lived in quite a few major cities.","useful":5,"funny":1,"cool":0},
{"review_id":"x28dE0qgiYfgs1ZPK4KwMA","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"bFaTXY_QtYhKCCuVY0__Og","stars":4,"date":"2014-05-30","text":"I really liked this place..it wasnt huge but it was very clean, well ran, friendly, accommodating & good prices too. Got a full set of acrylics and a gel manicure for $27! Thats unheard of! She does good work too and really listens to what you want. I didnt catch her name but I think she runs or owns it. Will be returning! Thank you","useful":1,"funny":0,"cool":0},
{"review_id":"v3m2qDxd9MdHUPHy6KPdtw","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"F5H0xUQvYuDRgL7rrs4LIA","stars":5,"date":"2014-10-10","text":"This place is an absolute God send. It has been a very difficult time for me and my mother having just lost the only family we have, my grandfather. After a slew of bad luck and bad encounters with a few businesses, that will remain nameless, we finally found Avenidas Funeral Chapel. We went from being distraught & numb in tears to a much needed feeling of comfort & solace. These guys are nothing short of amazing. The owners name is Miguel, he not only goes above and beyond what's expected but prides himself on it (as does his staff). The level of sincerity from these people is beyond anything I could put into words. They spent almost 2 hours with us and covered every single detail, concern or question we had. When we left we were actually smiling knowing my grandfather was in good hands and in a place he would've felt like family at, just like we did. \nMiguel, Brandon and anyone I didn't get the name of at Avenidas....THANK YOU!","useful":4,"funny":0,"cool":0},
{"review_id":"PZq4c96ivnpf54UIrSBcTw","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"wMC4YtL3eiM5B0MS6hxUXQ","stars":2,"date":"2015-03-18","text":"They NEVER answer their phone. As far as service goes it's hit and miss.... I've been helped by girls who were knowledgeable and pleasant but I've also been helped by girls that needed some serious customer service training and than there's always at least one snotty princess that needs a reality check, or a hand across the face lol. The only reason I shop here is because there's nowhere else to get the product lines I buy in this damn state. Good luck! = )","useful":1,"funny":0,"cool":0},
{"review_id":"GgRsdqaV3lzw4ZNLSQ_7KQ","user_id":"rWsmIlUA961Gl6kZSZUvQg","business_id":"oknlO7HeJDWIQAfXiwnyyA","stars":5,"date":"2016-02-12","text":"This guy is AWESOME! I got my bfs windows tinted as a surprise for valentines. Adam was more than accommodating to my schedule and situation. Not to mention gorgeous work, very meticulous, didn't take long and a very cool guy. Great work! I'm extremely happy. Thank you!!! = )","useful":0,"funny":0,"cool":0},
{"review_id":"IRsxkauCJsR2kdV3O_u3VA","user_id":"TISfGZVta6OX47wH1m6eqA","business_id":"VyjyHoBg3KC5BSFRlD0ZPQ","stars":1,"date":"2015-09-06","text":"Go to Vegas 3-4 times a year and stayed At most of the hotels on the strip except for caesars palace.\nAlways liked the forum shops so decided to stay this time.  I booked 2 rooms for myself and family members.\nWhat a mistake, very disappointed in customer service since the front desk people are rude.\nThe valet parking was full.  You would think they would save space for guests at the hotel.\nAfter a late night drinking and gambling I like to make the usual complementary in room coffee.\nI've stayed in some crappy hotels before and they have coffee. \nIt may be minor to some but Caesars has Keurig coffee makers in the rooms, get this they don't provide the coffee, you have to order it from room service (for a charge). Why wouldn't you order a cup of coffee.\n\nI'll never stay at Caesars again , their competition can provide better customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"OJSQblLGCoEEutB8w3-aMg","user_id":"RzD-HTLb1evy7BbeRXoGjQ","business_id":"FgjTvLYH24OVUK75uh8kiw","stars":1,"date":"2016-04-22","text":"I dropped in for a coffee & cinnamon roll. Not a big variety of donuts, the cinnamon rolls were small and very greasy. Coffee wasn't much better than an instant coffee. And while I sat down to eat it the man behind the counter kept coughing up phlegm... Gross!!!","useful":4,"funny":0,"cool":0},
{"review_id":"Z6HxgbeNfowH2v67xohnGA","user_id":"RzD-HTLb1evy7BbeRXoGjQ","business_id":"nANM5rQINrSQOiJy1illYg","stars":4,"date":"2014-01-14","text":"Check out the 2 for 1 Tuesdays! The best deal in town if you have 2 dogs. I'm not a fan of the way the shampoo is dispersed (like a car wash), but they gave me shampoo in the bottle for my dogs. Will return!","useful":3,"funny":0,"cool":0},
{"review_id":"c-IPnrcJjEclm1acaj9c4A","user_id":"p6K4bbDCZkVc8GBC8Pbipg","business_id":"C2BR0TjNacoNzItPLUHTAA","stars":5,"date":"2016-06-17","text":"Was staying right by here and needed somewhere close AND I love fish tacos. \n\nFish tacos and coconut shrimp was amazing and just right to share.\n\nEddy was also great! Friendly and answered all our questions, since this was our first time.\n\nAlso the speed in which the food hit the table was great. Within minutes of our ordering.","useful":0,"funny":0,"cool":0},
{"review_id":"uBTZhqfxn2OZSY5AQxhrbQ","user_id":"0_RvUO1hnTyCKrt_gQoldA","business_id":"pYq3_GetBLzBZ6OQPcplRA","stars":5,"date":"2013-08-14","text":"Amazing Ice Cream for $6.\nCustomize it to your liking!\n\nOnly here until August 30th!","useful":0,"funny":0,"cool":0},
{"review_id":"1Kmn9PEnMm0JgEZ9pXrocg","user_id":"0_RvUO1hnTyCKrt_gQoldA","business_id":"0hifnJw81xfr35g6eH8GRw","stars":5,"date":"2013-08-14","text":"The first hero that opened up and it is still the best one!\nThe best food option in Hazelton Lanes and in YorkVille.\nThe staff is always friendly too.","useful":4,"funny":2,"cool":2},
{"review_id":"Uewjr5ERqo9Uf_Ed1KEcSg","user_id":"gJztQcYB3GTOrsfhgpGydw","business_id":"7sPNbCx7vGAaH7SbNPZ6oA","stars":5,"date":"2011-05-26","text":"Drive for a burger - off the strip - Yes!\n\nBurger's amazing! From the NW we're in the land of grass fed, well treated beef, I was amazed by this burger....really, truly, \"....just go\"\n\nCaesar Salad, incredible! The anchovy on top - was plump and shiny and lovely.....Beware the croutons just might be 1000 calories a pop - but so good. \".....just go\"\n\nTruffle French Fries - they did a 1\/2 and 1\/2 with the Sweet Potato Fries for us - they were perfect\n\nService - great\n\nAtmosphere - great\n\nBut honestly - the 5 stars are for the food - it's so good. I was in Las Vegas for 5 days - went here twice....have I said this yet?.....just go!\"","useful":0,"funny":0,"cool":0},
{"review_id":"lUujau_KkK7-gK_A3SMjwQ","user_id":"gJztQcYB3GTOrsfhgpGydw","business_id":"-IWsoxH7mLJTTpU5MmWY4w","stars":5,"date":"2011-05-26","text":"I am a Pho at least 1x per week kinda girl - and I was dying for some during the long week in Las Vegas. I searched, and asked and then turned to Yelp - I am so glad I did. The owner's who are also the wait staff - are incredibly kind, lovely people.\n\nWe ordered two dishes to split - \n\nThe Sliced Beef Pho was so aromatic, the thai basil was plentiful and fresh - everything was perfection. I don't think I've ever had broth that clean on the palate and just, well, perfect!\n\nVermicelli Noodles with Charbroiled Lemon Grass Chicken was just as wonderful as the Pho.  \n\nIt felt a little lonely in there - so I hope more people will check them out!","useful":0,"funny":0,"cool":0},
{"review_id":"KrjRKPOnYWZsa69CAug_VA","user_id":"gJztQcYB3GTOrsfhgpGydw","business_id":"KskYqH1Bi7Z_61pH6Om8pg","stars":5,"date":"2011-05-26","text":"Made a reservation because of Yelp reviews.\n\nDrove into the crazy\/odd parking lot and didn't drive out because of Yelp reviews.\n\nWent inside - sat down - ordered salad rolls......it just felt right. There were many regular customers who were warmly welcomed, families and out of \"towners\" it just felt good in there! You could tell there were plenty of foodies - long conversations with waiters - people asking for \"the best\" and \"you order for me, this is what I like....\"\n\nWe ordered:\nPrawns on Drunken Noodles - I am rarely at a loss for words - all I could say when asked was - \"I am so happy\". \n\nBeef dish with peanut sauce - also wonderful - though the previously mentioned was by far my favorite. \n\nThe service was as expected - prompt, tidy, nice but not overly solicitous. If you are looking for amazing waiters and ambiance go somewhere else. If you are looking for perfect - and I mean perfect food - please join in the feast - like many have said before - the place is so worth it.","useful":1,"funny":0,"cool":0},
{"review_id":"x1Zy5dRWMut4j2zIL_ET7Q","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"fQt4D34vcJNtEf8Q4zte3w","stars":5,"date":"2009-08-17","text":"This restaurant just adds to a perfect Vegas trip. I has the Pork dumplings which had a little spice to it, the Sizzling Mandarin fried rice and the Kung Pao chicken with vegetables. Everything from the food to the atmosphere was amazing. We had a party of 11 and were taken care of as soon as we got there on a busy Thursday night. A must on your trip to Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"zpROHDeq6r3HeuVfl03dFA","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"EbP8eduNl-aEy2UVfs3zJA","stars":5,"date":"2009-08-17","text":"Amazing amazing amazing. The changing themes were great. I ordered the 12 oz Filet and it was perfect. The black truffel mashed potatoes were unbelievable. Such an amazing experience. Made my first night in Vegas memorable.","useful":0,"funny":0,"cool":0},
{"review_id":"8oQSyopoFz4WPV2p7Ip8xg","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"4uISbaUPJLVECBHIi3tpxA","stars":4,"date":"2009-08-17","text":"This is a nice place for lunch. The whole table shared a lot of food. We had a variety of foods, from different styles of fried rice and noodles to wonton soup and crispy shrimp rolls. Everything was very tasty. Although the food was great, I would of liked it to be a little cheaper as I felt I was overpaying for my lunch.","useful":0,"funny":0,"cool":0},
{"review_id":"Iq6gbb6lFDLwoP5tii-Szw","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"ECOkEVUodMLUxvI0PMI4gQ","stars":3,"date":"2009-08-17","text":"The Tao nightclub is a very hyped hot spot. I must say, from living in Miami this club is bigger than most but is nothing out of this world. The music was good as in all clubs that play hip-hop IMO. The drinks of course are over priced but on a thursday night the place was packed but I never had a big issue getting a drink. The people who worked there did have a bit of an ego trip but I guess that is the way it goes. Overall a good experience but nothing spectacular.","useful":0,"funny":0,"cool":0},
{"review_id":"NJwBHsWNhKSCJbG11JWFoQ","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"EVxY3Vcc-4uavsq2CQsk3g","stars":4,"date":"2009-08-17","text":"This club was our last stop on Saturday night before our return trip home. Let me say this was the best time we had. The music was great especially when they played Hip-Hop. As far as the club itself, it's packed, a very nice waterfall by the dance floor that can be seen as u walk in. The drinks of course, overpriced but your in Vegas. Only thing I didn't like was how they changed the cover charge. We found a hook up to help us get a party of 16 in with no hassle and no waiting in line.","useful":1,"funny":0,"cool":0},
{"review_id":"jnCiT6REjEkw1Yd9RXMRIA","user_id":"mkCs-Yfq9uPF7nNpV4W9Jg","business_id":"LeuGZImVz_IG1e-SMYTSXw","stars":4,"date":"2009-08-17","text":"This is a very nice little spot inside the Wynn. Getting in seems not to be too bad of a problem but that's not because no one is there. My group and I went twice, Wed. an Fri. nights and the crowd was obviously better on the weekend and they played hip-hop on Friday compaired to house music on Wed. We were taken care of by Kevin Lee at the front that helped take care of a group of 17. I recommend this place for a nice experience without having to wait in a huge line forever.","useful":0,"funny":0,"cool":0},
{"review_id":"ofZL3z5CU_ZXLXd1ly86rg","user_id":"RRYw4ftaBlsNIQ1PBoNgTg","business_id":"DNip7JeIjjK3rBqE8Qhi1Q","stars":5,"date":"2014-06-13","text":"The owner is such a sweet man. Ate here tonight for the first time. Its a hidden gem! Loved everything we ate & loved everything the owner brought us to try. Ill definately go back to eat!","useful":2,"funny":0,"cool":1},
{"review_id":"EqukWbswEKvMbz874uSDVg","user_id":"MYvG5mXyMCRcG0L6OuGBKg","business_id":"5shgJB7a-2_gdnzc0gsOtg","stars":5,"date":"2011-08-18","text":"Start with a sangria, just trust me.....WOW.  The tapas are fresh, interesting, and some are even a good deal. Tuna tartare.... big hit. Lamb chops... fantastic... hip place with a lively vibe... and not a ripoff like much of the strip...","useful":1,"funny":0,"cool":1},
{"review_id":"c63_TZk9cJ2AX5t2BZTSdg","user_id":"MYvG5mXyMCRcG0L6OuGBKg","business_id":"TTpgjbrSyxwHHzE5bIF-Rw","stars":4,"date":"2011-08-18","text":"upscale, clean, quiet, good food, great service, and even a belly dancer one time when we went. It is in a shopping center, but don't let that deter you. We've been here probably 5x and prefer it to some of the other highly rated indian spots in vegas. \n\nyum....!","useful":0,"funny":0,"cool":0},
{"review_id":"AXP0Q0jOQOlT8O5Wg_iVuA","user_id":"MYvG5mXyMCRcG0L6OuGBKg","business_id":"1Tak6Q-IlkDrdmLwrEZeSg","stars":4,"date":"2011-08-18","text":"this is for the smaller location of the 2 restaurants under this owner. It is nestled in a quiet upscale neighborhood...and worth the drive. Clean bistro feel with a modernish look. Try the scampi stuffed chicken... fantastic!!  Great service, great food...what more would you want??  prices are normal.","useful":0,"funny":0,"cool":0},
{"review_id":"PWj9TmS_0Wr5U5sL8DWb_Q","user_id":"MYvG5mXyMCRcG0L6OuGBKg","business_id":"gTlDDzDEHyDQ6iwjNhpI6A","stars":3,"date":"2010-12-06","text":"I think it is definitely a decent place, but there are better in vegas. The Tikka masala sauce was definitely lacking, ...and I believe that is the most popular selling indian dish in the U.S..so they need to improve it.\n\nNaan was good...service was friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"CVSYYzBpRmbyYTmLlo5Gsg","user_id":"KVi6QiGq30ags18h4H0yYQ","business_id":"zyPGYeXF4XKCqNN1pjFWhg","stars":5,"date":"2017-03-13","text":"A little off the beaten path but well worth the adventure. The ambience of the restaurant was great. The staff and most importantly the food was fantastic! A must have is any of their risottos. Had the carbonara with shrimp-the real deal. I highly recommend this restaurant!","useful":0,"funny":0,"cool":0},
{"review_id":"5XgA8YMB_EDQOXGlLoQ6qQ","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"kWclF3kJdLYPaoz-pepCDg","stars":5,"date":"2015-03-07","text":"Okay, if you need a large, fancy dining room for a party get it to go and take it home.\n\nIf you just want real deal BBQ this is your spot. In an age when everyone seems to be jumping on the BBQ bandwagon there are so many posers I've gone from cheering to groaning when I hear of a new place opening up. I guess that's what's allowed me to drive by Bobbee O's for years without stopping in. What a mistake. \n\nThis first trip we had the pulled pork, brisket, and chicken sandwiches. All were exceptional. So often we find places where the  brisket and chicken are dried out. Not here. We also had potato salad and mac & cheese for our sides (how can you have BBQ without mac & cheese?), again fine exemplars of real deal BBQ.\n\nI won't be driving by without stopping next time.","useful":1,"funny":0,"cool":0},
{"review_id":"oBepUdTViWv0zZo5KLFLhA","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"vgY7zKwJ0Dv1stcxsQLS8w","stars":4,"date":"2013-01-31","text":"This location reopened under new management a while ago.  Great food, service.  The #13 Italian dressed Mike's way is hard to beat.  I prefer this location over the one in Huntersville because it has a bigger, better dining area.","useful":0,"funny":0,"cool":0},
{"review_id":"-FdssC_gy47opmcTHrX0tQ","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"0Cqkgz8hz8sLYvSkZhBDzQ","stars":2,"date":"2014-07-17","text":"I've loved Tenders in Huntersville, from whence PDQ was birthed, since the beginning (expect for that pork sandwich which is years removed from the menu). The food is excellent!\n\nI've loved PDQ's Concord location since it opened, too. Until my last visit, that is (7.10.14). My family and I have eaten there often but this last trip was a disappointment. We were there around 12:30 pm and everything seemed normal--staffing, cleanliness, good customer traffic, ordering experience--until I picked up the tray for the four of us. \n\nMy chicken tenders (3pc. meal) appeared to be about 70% of the size I'm used to. Maybe that's imagination, maybe the H'ville location has me spoiled. Still, it's not what I remember from PDQ Concord. Chock that up to a subjective determination, but one that made an impression nonetheless.\n\nWhat was objectively different from every past experience is the temperature of those tenders. Usually they are too hot to eat without some cool down. Not so this time. The flavor was right but smaller and just warm = no bueno.\n\nAnd the fries were objectively unusual too. They were limp and a tad oily instead of their usual crispy. Luke warm, not hot. Very disappointing.\n\nSo, has People Dedicated to Quality moved to some \"make it ahead, hold it 'til it's dead\" production model? I don't know, and wouldn't think so. I'm thinking the \"Chef Coat\" who essentially signs off on every order wasn't doing the Quality Control part of his job very well that day.\n\nThat's enough of a review to make the point. No need to detail the experience of my wife and daughters beyond the common theme: This trip wasn't what we've come to expect from PDQ. \n\nObviously, as I'm writing this review a week later, our sub-par experience made an impact. In hindsight, I should have cared enough to speak to one of the chef coats. My bad--I'll do better if it happens again. My hope is that it was just an off day and not a sign of problems leading to decline. We'll see soon enough. I want PDQ to thrive. When it's done right it can't be beat!","useful":3,"funny":1,"cool":0},
{"review_id":"AArgCquGG-EMSG9_FZHg-w","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"rXUZNVlpWMV5ORDDSguOEQ","stars":5,"date":"2010-12-24","text":"A tremendous value.  Dined there after the lunch rush...when you expect the crew to be inattentive because they are focused on side duties.  We experienced an attentive server and good timing of the food from the kitchen.\n\nThe food was quite good.  Two types of salsa and fresh\/ hot chips arrived right away.  Drinks came promptly and the server was both friendly and patient as we took our time choosing from the extensive menu.  We had heuvos rancheros, chalupas and a quesadilla.  Everything tasted great...not exactly like our on our trips to Mexico but a lot closer than most places around LKN.\n\nThe place is pleasant and clean.  All-in-all worth becoming your go-to Mexican restaurant.","useful":1,"funny":1,"cool":1},
{"review_id":"yPZxknu-727_B4dtjuSxpA","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"AXZzG-_VmsS47upzcXPrbQ","stars":1,"date":"2013-01-31","text":"This store was closed when Harris Teeter and Lowes Foods did some swapping of locations.  Lowes withdrew from the Charlotte market in anticipation of the arrival of Publix.","useful":0,"funny":0,"cool":0},
{"review_id":"TOWmWw6mHhL92SCOuF2RKQ","user_id":"ZoX9wH9JP_8SSVvsDVdcQA","business_id":"3Q3zeeVM_kP954N_SjkHhg","stars":1,"date":"2013-01-08","text":"As a  fan of great Barbecue joints I was hoping to have found a new one.  Sadly, that was not the case.  The food was just okay.  My major complaint has to do with the up-keep of the facility. The place could do with a complete cleaning--and by cleaning I mean scrubbing off the layers of oily residue that seemed to be on everything touched.  I could say more but it's not worth the time.  Wish it had been.  Always willing to give them a second chance but I'll need a good reason why.","useful":1,"funny":0,"cool":0},
{"review_id":"hMt6BR1SeWw5brHtWKkvVA","user_id":"VDdOtyX1wfo3xx5CaKRIqw","business_id":"T9r-6274tdT-GpZtlluBKA","stars":1,"date":"2017-02-03","text":"The worst service! run by a bunch of kids girls with hickies on their necks and just flat out unprofessional!!! I bought my ferrit there and I will NOT be returning there to get the monthly vaccinations!","useful":0,"funny":0,"cool":0},
{"review_id":"c90hM1uJYMoJSQu3fTvlkw","user_id":"XxbhXX4f_gUDzS-aYgj59A","business_id":"4HEF6BuO_BBsTmvcMCbhhg","stars":5,"date":"2015-04-11","text":"Great wine selection! 32 different wine to choose from with a sip, taste or a pour. You choose!","useful":2,"funny":0,"cool":0},
{"review_id":"CV0VGZpx24p3-1ZjF-lUoA","user_id":"dXBM3AifWFUjQOwAYK0irg","business_id":"jzr6jW5cQ0jpPhEo4kGMBw","stars":5,"date":"2012-09-28","text":"First time here and honestly get the Porterhouse for 2 with their homemade sauce. Best steak I've ever had, better than Mannys...that night anyway.  Loaded mashed potatoes were amazing as well.","useful":0,"funny":0,"cool":0},
{"review_id":"-IJwWQnAIFp-qApCbQypRA","user_id":"VJPI3mRlPtBQjZxQTckscw","business_id":"3KawP-W-C87wR0XUyyUNHw","stars":5,"date":"2015-08-21","text":"The staff over at Big Frog was very helpful. They were able to design a custom logo for me from a picture I had on my phone. I stopped over at the store and was able to have an order placed within 20 minutes. This was a last minute idea that I had and Big Frog was able  to  turn around my order within 2 days. I wanted to have something special for my out of town guests that attended our party. The shirts were a big hit.","useful":1,"funny":0,"cool":0},
{"review_id":"SOuEZ5tLP2qiMSSE-b8aXg","user_id":"VJPI3mRlPtBQjZxQTckscw","business_id":"x5fgrhaq8R8qXhZFPnfXWw","stars":5,"date":"2015-09-23","text":"Truly NY quality bagels and the staff is very friendly. I always get 2 dozen and freeze them for the family. Great variety and always fresh.","useful":1,"funny":0,"cool":0},
{"review_id":"qUzaQMjUrXW1n-9sh-fSfA","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"5HjmnWOtBYAYW-jjdZ3aKA","stars":1,"date":"2013-02-13","text":"Never going back.  I visited this place to check out the new bar they put in.  We had an awesome bartender Susanne, and we had some killer cocktails.  However, the owner of the place was sitting down at the end of the bar, drinking(most likely drunk).  He was chastising his employees in front of his friends, like he was on a power trip.  This put the bartender in tears, and another waitress in tears.  Shortly thereafter, a patron of the bar left, yelling at the owner for treating his employees like crap.  Once he left, the owner and his \"buddies\" sat there loudly making fun of the customer for walking out. Stating \"I don't care if he ever comes back\".   Not only did this make us uncomfortable, it is beyond unprofessional. I will never return to this establishment, and I am happy to share this story with anyone who wants to listen.  Shame on him, and the piss poor management tactics.  There are 100 different ways this should have been dealt with.  The End.","useful":12,"funny":0,"cool":0},
{"review_id":"tsWnzsGf3VoFGS2GoJYZYQ","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"PlMJAouo0D0ZXHkCDj6eeg","stars":5,"date":"2013-05-02","text":"This place had the best breakfast on the strip.  I am so sad to see it's closing.  It will be missed.","useful":0,"funny":0,"cool":0},
{"review_id":"2xrEvyzqyxBdIO05CNGdHg","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"ZJdOOIubTizd1eqECkeK-Q","stars":5,"date":"2013-01-29","text":"The chimichangas are the best thing on the menu. I also highly suggest getting a pitcher of Margarita's, they are amazing!!  I can't wait to go back!","useful":1,"funny":0,"cool":0},
{"review_id":"SeJEOGwwDsWXcjDfhbrb8Q","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"1MrJJ9tyNyfFrxaNZ67xFg","stars":5,"date":"2013-01-29","text":"The sushi here is absolutely amazing.  Better than any other Sushi place ive been to in the burgh.  The hibachi is pretty awesome too.  Ask for Kobe!  The Chinese food is also bomb!!","useful":0,"funny":0,"cool":0},
{"review_id":"VIcfo1mCFnzcmRRSMVSoJw","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"ESzO3Av0b1_TzKOiqzbQYQ","stars":4,"date":"2013-02-11","text":"First time I was here I had chicken quesadilla's and they were bad.  We went again last weekend. I had the chicken avacod sandwich.  It was very good.  No fat in the chicken.  Just a mess to eat, but still awesome.   Also had the chocolate stout cupcake, it was amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"zIpTqfatKOanXi3AKPdr9A","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"3ItygInw1ZHll29elcRBqQ","stars":1,"date":"2012-09-13","text":"This place is run by a bunch of incompetent meat-heads, from the manager all the way through the corporate tree.  They promised a charity event a free year membership to give away, never followed through on it.  Instead they tried to use the fundraiser to run their marketing campaign.  When brought to corporate attention, they just shoved it off, and could have cared less.  Talk about giving your corporation a horrible image.  Not only did it make LA fitness look stupid, but it made the charity, look bad, and lose the support of many contributing partners.  The estimated loss of charity donations from this is over $5k.  Good job LA fitness, keep up the selfish greedy business practices.","useful":12,"funny":1,"cool":0},
{"review_id":"oaHpk3i7_q08bWFfC35NVQ","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"C5zOHpwyA-snVGppkbUpQg","stars":4,"date":"2013-01-29","text":"Grilled Stickies and the Buffalo Chicken wrap are my two favorites.  I can't wait to get them again soon!!","useful":1,"funny":0,"cool":0},
{"review_id":"z3VliFmsxz-NunrfT0sx5Q","user_id":"uDmQMOo4y478HJUvT2RN3g","business_id":"ziJsGjXvidzZWC1I0-SOSg","stars":5,"date":"2013-02-15","text":"So we decided to go her for Valentine's Day, and I have one word.  Wow!  First off when the reservation was called in, we mentioned Vegetarian. They had prepared a special menu by the time we got there.   I loved it, everything about the place.  There was a piano playing in the lobby of the hotel that gave us music through dinner.  The food was out of this world good.  Now let's talk about desert.  Holy cow, it was the best i've had in the longest time.  The manager Gerry was really friendly and our server Nate knocked it out of the park.  Can't wait to go back!","useful":1,"funny":0,"cool":1},
{"review_id":"rTnYED_NoLMuluS8Vri1DQ","user_id":"hZRQeyI1eAeDQVFZiVZtww","business_id":"dj7jcvkitQAaRGvdOaoKZQ","stars":1,"date":"2014-03-14","text":"Horrible service. Someone named Coco burned my wife's head, ripped out hair because she didn't properly treat. My wife brought in the shampoo. This ghetto person just poured the shampoo on my wife's head and started pulling glue and hair out without wetting. My wife told her that the perm was burning her hair, but the unprofessional individual wouldn't rinse it out or take safe precautions to protect my wife. When we called in advance, my wife was told it would be $60. After torturing my wife for over an hour, and repeatedly burning her with a hot comb, this dirtbag charged her $75 and did nothing my wife had asked for.  Additionally, the conversation between the employees was incredibly racist, which offended my wife because I am one of the Caucasians they were saying horrible things about. I have already spoken to a lawyer and I signed up for a Yelp account specifically because of this situation. If you value your appearance and safety, STAY AWAY!!  After all this my wife went to a restroom next door to try to fix what the did to her, then she went to a restaurant near by. She was sitting and eating when another employee came in with a male client. They sat at her table and the guy, who she didn't know, started taking food from my wife's plate and eating it!  Seriously, protect yourselves by not going to this business. Who knows what this guy could have done to my wife!!","useful":1,"funny":1,"cool":0},
{"review_id":"nQcSpXuMi3V1SNmysqbkwA","user_id":"nPcl431geSEZgDFrDf9qgA","business_id":"61pecmfztHO2SLs-WRkwVg","stars":1,"date":"2015-04-09","text":"This place is horrible, I heard lot of people say \"pho Hung \" is bad. But I saw they put under new management, so I want to try see how is it new.. OMG...it is super disappointed, they are a copy cat, they copy the menu from one of the restaurant on LA,menu exactly the same of them but the food is super horrible. Service is bad. I ordered the Vietnamese dry noodles(mi kho ),usually it had oyster sauce on it,guest what,this dry noodles had nothing on it.I asked my server why it doesn't have sauce,he give me a funny answer \"it had sauce on it,but is white sauce \". Wth is \"white sauce\" I never heard that,I try one bite, it is salt & water mix = white sauce. \nI highly recommend people do not go to this place, you'll waste your money on to this restaurant with a horrible food & service. I don't want to give even one star.","useful":1,"funny":0,"cool":0},
{"review_id":"Z0_P7PDHUI8PFy4f4D-vEg","user_id":"5UjJRsp7cMikeKW-DltxUw","business_id":"RJZK4XXMXYcu9NeLOWMP5A","stars":5,"date":"2016-01-06","text":"The B E S T!!! Easy to get an appointment. Staff very professional. Nails always perfect. Must do The deluxe pedicure. Fantastic!!","useful":0,"funny":0,"cool":0},
{"review_id":"xThhJj4UvwUKkFIBPICb6A","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"Pg2yrb3JEUK3q9wK7EVNKQ","stars":5,"date":"2014-09-21","text":"Looking for a good caterer for our wedding was harder than I expected until we ran into this amazing caterer with a wide range of food options.  \n\nThe owner, Nik, hosted us for a great dinner to try out his southwestern cuisine and it was seriously amazing! We ended up booking him right away (and at a fraction of the cost of the more expensive ones we were considering).  People loved the food!  It was spicy and full of flavor but not too spicy for the old gringos.  The ingredients were fresh and packed with flavor.  My only complaint was that the pork dried out a tiny bit, but every other bite was fantastic.  People also loved the southwestern corn side dish.  We would DEFINITELY recommend these guys and would use them again if the need arose.","useful":1,"funny":0,"cool":1},
{"review_id":"nHriR0WmIvw4aZURR6UW3w","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"2g4ZTD3ePNSbDAvh6qAOKQ","stars":5,"date":"2011-01-07","text":"In being a bit of a burrito man, I was suspicious that a torta could ever marvel a tortilla filled with meat.  However, all of the hype on yelp and man vs. food was appropriate, as the torta provided a massive yet tasty introduction to pork, turkey, guacamole, and a bunch of other hidden great tastes all in one sandwich.  The carne asada quesadilla blew us away-- HUGE in portion, amazing meat, and super flavorful.  I was also glad to be one of the few gringos in this place.  People were friendly toward us in any case.  Check out the horchata for some authentic aguas frescas...","useful":0,"funny":0,"cool":0}]