[{"review_id":"Zm2NfZ3vL8XVNITm6cl5gw","user_id":"0HCPrZgYOfWZKk-X6OnS4A","business_id":"nWW6fBfBljiRFa4sG7TyxA","stars":2,"date":"2013-04-07","text":"Surprised to see this place rated 4 stars on Yelp. I came here with my girlfriend on a Saturday evening for a quick bite and we found our meal extremely substandard.\n\nThe draft beer and wine lists were solid and the cocktails were pretty good, so no complaints there. The food menu was focused, but one lingering question hovered over us while we browsed it:\n\nWhere the hell is the bacon?\n\nFor a restaurant with pork-themed fare, there were disappointingly few dishes that contained bacon. Plenty of pâté, tenderloin and belly but no bacon. It just seemed weird.\n\nThe cheese plate was very tasty and reasonably priced - $10 for three cheeses, toast points\/crackers and small samples of red wine poached pears and roasted beets. The beets were the only thing out of place on the plate, and although this was the high point of the meal, it's hard to give Black Pig credit for something extremely difficult to screw up.\n\nFor the entree, I ordered the croque monsieur ($13) and my girlfriend ordered the pork tenderloin ($19). My sandwich arrived and was ENORMOUS. The thing was slightly larger than my face and came with a mountain of \"pommes frites\" (Black Pig's terminology). It looked like something Adam Richman should tackle on a Man Versus Food challenge.\n\nThe huge portion size to price ratio couldn't save the uninspiring flavors. The fries were ridiculously salty and I didn't even bother taking the sandwich home despite leaving about 3\/4 of it on the plate. \n\nDespite costing $6 more, the pork tenderloin dish was much smaller and tasted as bland as it looked - plenty of brown and green on the plate but very little flavor. The pork was juicy at least, so not a total loss.\n\nOverall it was an extremely disappointing experience. The food couldn't live up to the menu, which overhypes its descriptions with meaningless adjectives - \"free range\" toad-in-a-hole, \"nettled\" risotto.\n\nWe'll probably come back for drinks, but my advice is skip the food.","useful":3,"funny":1,"cool":1},
{"review_id":"GBZ4oSOFH_eTjzuNGWD4cA","user_id":"0HCPrZgYOfWZKk-X6OnS4A","business_id":"fypwhb4PNHv2S6MXPNgbbg","stars":5,"date":"2015-10-09","text":"I've been coming to Quintana's to get my hair cut for over three years now. Jessica has been my stylist for the majority of that time, and every trim she's given me has been flawless. I always leave a happy customer. She's a great conversationalist, extremely knowledgeable when it comes to styling and always has great product recommendations for me.\n\nThe salon's other services are extremely high quality - the deep tissue and hot stone massages are fantastic, and on the rare occasion I'm able to, I enjoy a nice pedicure every now and then. Quintana's offerings are second to none.\n\nEveryone there is warm, inviting and friendly. I can't recommend this establishment any higher.","useful":1,"funny":0,"cool":0},
{"review_id":"n8nFRhH_j9qfYPtxpx7OqA","user_id":"xsj-tPOICE2UDkvECj730w","business_id":"pCZrmhZFRis_G2sQMGxg3A","stars":5,"date":"2014-01-11","text":"What a fantastic store, with great eyewear, beautiful eyewear necklaces, and cute cases.  I can't say enough nice things about the staff and the AMAZING Sally who is a perfectionist in fitting glasses.  Rarely are such stylish people so kind and friendly.  It was a great experience to shop at Sally's, which provides the most outstanding customer service I have experienced in a very long time.","useful":0,"funny":0,"cool":0},
{"review_id":"Y7MArYMgk6ToWIuKrD9-Kg","user_id":"gfK3WCNiD3Mq4BUPVfT4GA","business_id":"zw9_mqWBn1QCfZg88w0Exg","stars":5,"date":"2014-04-17","text":"Great food and wonderful service!!!! The manager is really friendly too! I would definitely recommend the steak quesadillas and the margaritas. I love the feel of the restaurant and that they are renovating the front entry. I can't wait to see it completed. Thanks for making this meal and experience!!!","useful":0,"funny":0,"cool":0},
{"review_id":"rd7h7gmQxqV6W6sifnZVXw","user_id":"gfK3WCNiD3Mq4BUPVfT4GA","business_id":"H-dkfQq4sVhq7rY5l9Qx7A","stars":5,"date":"2015-01-20","text":"Austin is a cool GM and I look forward to working out in here. They have everything I want and understand that we are clients who have personal needs and are not a nameless membership number. Thanks Austin!!!","useful":3,"funny":1,"cool":1},
{"review_id":"AlxZZp61yjv89vzHkR9BPw","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"DDlE4BTZDdbBmoZkIVRuxQ","stars":5,"date":"2017-04-28","text":"Love all the staff and dentist here! Like family! They take great care and are attentive. Flexible with my schedule. Been coming here for years!","useful":0,"funny":0,"cool":0},
{"review_id":"L69xmwf2PEGirjlM7AxxRA","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"P7UEPiLj3guembGsmoTkeg","stars":5,"date":"2016-10-06","text":"The extended hours and lab onsite is extremely convenient for a busy person, love it! The providers are great and can always get in same day or next day.","useful":0,"funny":0,"cool":0},
{"review_id":"9q0oIKQQ5BwpWrEoNhpR9w","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"ld-foUbIqtcYTihGZkGsTw","stars":5,"date":"2017-08-12","text":"We just purchased our 2nd car from there in the last few months. Everyone from the sales team, to the cafe, the finance department, EVERYONE is friendly, feel like they truly care and GREAT experience!! Would recommend Jason for sales","useful":0,"funny":0,"cool":0},
{"review_id":"5XgT0ApLW_Pwe1Hc1I6-Dw","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"gQHvqWLvqOlSi_A0WkLLog","stars":5,"date":"2017-08-30","text":"Cowboy Bill and Dwayne took great care of us! They were orient while we decided on a car, helpful and was a great experience. Recommend!","useful":0,"funny":0,"cool":1},
{"review_id":"wqQu3F0mMzIs7xmR9NynKw","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"pYLurMX_Sku8kK5r-kwu2w","stars":5,"date":"2017-08-12","text":"Family feel. They loved on my baby Bella and I feel secure with her there and they did great with my doggy","useful":0,"funny":0,"cool":0},
{"review_id":"G9qccRWlXMhJsjxnsXWZpA","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"0TxkJxQ-inYuVae4xqytRg","stars":1,"date":"2017-07-05","text":"I love them for vet but I won't use them again for boarding. I picked her up and they hadn't done her nails after charging me and saying they had. They handed me back her bed that was covered in poop and she never poops herself and said they didn't have time to wash it......not sure how long she was sitting in her own poop. I won't use here again for boarding :(","useful":1,"funny":0,"cool":0},
{"review_id":"GP-yYgG9f6VMIouqAhHjXQ","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"SSCH4Z2gw-hh2KZy7aH4qw","stars":5,"date":"2016-02-10","text":"Soooo delicious! I've had the chicken breakfast hash and the chicken sandwich. So unique and delicious. Best flavor ever. Excited to try more","useful":0,"funny":0,"cool":1},
{"review_id":"ZX6XXEUUcbqbMP1_g8wbyA","user_id":"tOIGjNwEkjAPA22Kc7XoLg","business_id":"_o3mzHr_BEvugDyNOfORTw","stars":5,"date":"2015-05-29","text":"Great grooming experience, really was able to get so much fur off my dog that she'd terribly. Professional, reliable and was extremely affordable. Highly recommend and will keep using ourselves!!!","useful":4,"funny":0,"cool":0},
{"review_id":"Se6VJ52jpwhoUcyEK4bcpA","user_id":"iEMIBk2BMoI7KG0-UWZNGw","business_id":"NASjUYKkz6l7hQLxMf2lqg","stars":5,"date":"2013-11-10","text":"A tiny place with amazing food!! Flew in from CA hungry and stumbled onto Chanpen. Oh happy day! Delicious!!!! Wonderful service too!","useful":0,"funny":0,"cool":0},
{"review_id":"ZDmP4GQBAPdVqM6vCO59rQ","user_id":"zKBlTY0Ua3XEXJPlpBuBEg","business_id":"P6iQA0bfU4USuzchR5wnKw","stars":3,"date":"2015-05-26","text":"After reading these reviews I had zero hope when I called about annual fees being charged to my account three months after sign up - annual fees that I was told would be charged a year after I had my membership (Ya know 'cause that's what \"annually\" means).\n\nHowever, I called the customer service line (after calling the gym and being told they couldn't help) and talked to \"Amber\" , explaining the above. She said she'd need time to \"request and review my file\", and advised me she'd call back with details. She didn't.\n\nI followed up a few days later, and she consented that she'd reverse the annual fees charged to both my account, and my girlfriend's. She didn't.\n\nI called back the following week, and spoke with \"Linda\" who informed me Amber was out sick, and she'd be reviewing my file. I politely stopped her there, and told her Amber had already told me to expect a refund. She again stated she'd have to research my file (Incidentally, what sort of \"file\" is there? I mean we are talking about a 1 sheet gym contract, right?).\n\nAt any rate, she did call me back that afternoon and told me the refund had been processed. On 5\/14, roughly 2 weeks later and 5 phone calls later it was resolved.\n\nBottom line, it was too much of a hassle. If it wasn't for the fact that they reversed the annual fees, and that I can walk to this gym, they'd be at 1 star instead of 3.\n\nhttp:\/\/davidiwritestuff.blogspot.com\/","useful":1,"funny":0,"cool":0},
{"review_id":"xy4mVAqxonj12-rxvsA64A","user_id":"zKBlTY0Ua3XEXJPlpBuBEg","business_id":"a2gWIG98DdT2nZBqNeYU9g","stars":5,"date":"2016-07-27","text":"Once upon a time I got a flat on a 100°+ July day. I called USAA and thought I had a towing company lined up but alas, when I called them they said they didn't even cover the area I was in. \n   But then a the clouds parted and a miracle was bestowed upon me. That miracle was USAA reassigning the job to Central Towing.\n   In twenty minutes less than what USAA had told me, my truck driver Fransisco showed up, gave me an ice cold water and told me to have a seat in the air conditioned cab of his truck while he took care of my car. \n  If he hadn't come along when he did, I could've died- well maybe that's a bit dramatic, but he still did a damn good job!","useful":1,"funny":1,"cool":0},
{"review_id":"VAFfCZZLD0OqWr5gMUAftQ","user_id":"zKBlTY0Ua3XEXJPlpBuBEg","business_id":"yo1G0hD855DYmU-YVlIKcw","stars":5,"date":"2015-05-27","text":"I toured the business on 5\/23\/2015 with my girlfriend and a friend. It was on a whim as we had a Groupon.\n\nI'd have to say that the tour was informative, and gave perspective of how a small business was run (if you've been on any of the big distillery tours like Jack Daniels you'll notice several distinct differences). The tour was given by one employee while the owner waited at the bar until we were done to provide samples.  While giving the tour to a group of maybe sixteen people, the employee encouraged us to ask questions and kept the air of the tour light while joking throughout. As an added bonus some of the jokes were even funny! Kidding aside, levity was definitely there, without feeling forced or bordering on the lame. \n\nOnce we got through the informational portion, we all bellied up to the bar and got ready for our samples. Jason, the owner greeted every person, asked their name and shook hands. Which I thought was classy, and was certainly a throwback to a bygone era of how business was done. \n\nJason talked through the history of each spirit (Moonshine, Bourbon, Gin) and connected us to how they came into being as well as how he decided upon their names. In doing so, he also informed us about how he had gotten into the business to begin with. Personally, I found this portion extremely relatable and inspiring, though I won't spill it here, and would advise you to visit the business on your own to hear the tale.\n\nAs far as the booze, I'm not a Gin fan in any form, but otherwise the Bourbon and the Moonshine were excellent. \n\nOverall, a great way to spend an hour, particularly if you have friends or relatives in town, or to simply support an Arizona small business doing quality work!\n\nhttp:\/\/davidiwritestuff.blogspot.com\/","useful":1,"funny":0,"cool":1},
{"review_id":"nDN24vXsgceEUHU9cOwNVw","user_id":"fB3WRAZqo_4JlQGkbweOdw","business_id":"277d8SZxXgkaMqImExe5sQ","stars":5,"date":"2015-08-30","text":"Great service, great location, well known stylists and conveniently open weekdays and weekends!","useful":0,"funny":0,"cool":0},
{"review_id":"A8Rx-bY2FYPNLE386RAa4A","user_id":"Arm7cgLCDWnSKJhpphJ_3Q","business_id":"8Y5p2IQMLX6QjGPzxanexg","stars":1,"date":"2016-03-25","text":"Average at best. Been here twice, twice got chewy bulgogi that tasted old. Grey and chewy and too sweet.\n\nSushi is terrible. \n\nAvoid. \n\nIf you want sushi, go elsewhere. Like anywhere else.\n\nIf you want Korean BBQ, go to Cafe Ga Hyang.\n\nNever again.","useful":1,"funny":0,"cool":1},
{"review_id":"VHURr3NAjUN-H-fKGAjm_Q","user_id":"Arm7cgLCDWnSKJhpphJ_3Q","business_id":"9u7knPXVCUOwnsz8sTTT_w","stars":5,"date":"2015-12-03","text":"As good as it gets. I've never had mole this good. Ever. \n\nThe Tamal Oaxacaeno is absurd. The Tlayudas are unreal. \n\nSomeone pinch me, I'm dreaming. \n\nNext time someone tries to tell you that San Diego has better Mexican food than Phoenix, remind them that La 15 y Salsas exists, and end the argument. \n\nAs good a meal as you'll ever eat.","useful":3,"funny":1,"cool":2},
{"review_id":"Khmz_6_dJFXiTpborHvp_A","user_id":"Arm7cgLCDWnSKJhpphJ_3Q","business_id":"9yESUcIVarhYEabIMj844Q","stars":5,"date":"2015-11-11","text":"Came in at 10:45 on a Tuesday right before close and split the chicken club and a house salad with my wife. \n\nSandwich was perfect. Absolutely killer. Crisp bacon, grilled chicken was dead on, ripe tomato, warm pretzel roll. so so good. \n\nSalad was great too, attention to detail... fine dice on the cukes, nice garlicky ranch, simple and great. \n\nWe'll be back.","useful":1,"funny":0,"cool":1},
{"review_id":"yd1ibc9MwzTudwVlmr37GA","user_id":"4oUR0OVCDfXPfGNXd8nGdQ","business_id":"NcrasPRJ3xm0K7JPxLFBGA","stars":5,"date":"2015-05-08","text":"By far one of the best 24 hour tropical smoothie cafe in town hands down. Only saying that because I'm a local and I frequent here. Nice to know that they actually remember me there. Service is quick, and convenient along with the friendly staff. Blimey Limey with mango please!","useful":0,"funny":0,"cool":0},
{"review_id":"xmsd7vlJ4sdbCD9dXipOaQ","user_id":"4oUR0OVCDfXPfGNXd8nGdQ","business_id":"1DJNBnnrvdrHcuDgbGlmLQ","stars":1,"date":"2015-07-02","text":"No stars for my visit today if I could, I go in to buy 4 items use the self check out and the machine is out of receipt paper she refills the machine and requires a manager to access the receipts on the machine. I got my items in 5 minutes. She called over a manager named Manny he takes 5 mins to come by looks at me ask if I need a receipt. Leaves I'm standing there for over 30 mins expecting him to come back with my receipt to find out he's helping everyone else because he forgot. I understand you have a whole store to run but this is ridiculous. The manager himself does not even know how to pull up the receipt. The whole ordeal took an hour and a half. Very upsetting.","useful":0,"funny":0,"cool":0},
{"review_id":"9rf7h_A6UYu-QVGD8wKIOg","user_id":"aBxbUVYRbNmk4EIJPi5dhQ","business_id":"ZckxLuc9lpz9LDAQlMKWiA","stars":2,"date":"2014-11-08","text":"Dim sum here is by far the least interesting in town and there's no cart service - you have to order off of a small pile of menus... so no points for experience. The food ranges from bad (very greasy fried squid that comes off as freezer-grade fish and chips), to bland (most dumplings), to ok (crab claw with shrimp). Also, prices are about 20% higher than the excellent Kam Fung and the reliable Ruby Rouge (it's right next door, so... why are you here?). Lacklustre service seals the deal. Pass.","useful":0,"funny":0,"cool":0},
{"review_id":"guxMOVIsLgr_3vBHWCuxAQ","user_id":"PiofAYdePR2sDSpZEVbX2Q","business_id":"0OkfU0vDBprsIEd5hWuhAQ","stars":5,"date":"2016-02-15","text":"Check it out.Simple Gourmet has Lenten Specials only offered on Fridays. I had the Veggie Tuscan which substitutes homemade hummus for chicken with greens, red peppers an balsamic dressing on a ciabatta bun. She also has Lobster Bisque but it was sold out when I got there. Finally, she has Italian Motz Salad. Unbelievable good and a great break from fish.","useful":0,"funny":0,"cool":0},
{"review_id":"8zz57EHsdbkIXY7xrNY6wg","user_id":"PiofAYdePR2sDSpZEVbX2Q","business_id":"2dOS56h2QueEIDAdP9-1TQ","stars":4,"date":"2012-07-21","text":"Great place. hidden on side of a strip mall. I had Vietnamese Spring Rolls and Beef Curry. Atmosphere is great. Definitely worth a try.","useful":0,"funny":0,"cool":0},
{"review_id":"YKBlE1pVClvqfzw0S03K5w","user_id":"PiofAYdePR2sDSpZEVbX2Q","business_id":"z15C-dJodOlPO8bMBl6F8g","stars":5,"date":"2012-12-12","text":"I stopped one rainy night because the outside looked very interesting being an old firehouse in the strip. The inside didn't disappoint from the food and wine to the service. It has very relaxed and European feel to it. I look forward to my return.","useful":1,"funny":0,"cool":0},
{"review_id":"OhN0AYX3hiErBzkPCeqbSw","user_id":"fOCV2evqdjDpfI-6ULvr5Q","business_id":"1VK3xb4nyFWZP7BicNQxUw","stars":5,"date":"2012-12-15","text":"Alan Cawthon is amazing... he has been doing my hair for over three years now.  He just made the move to Sachi and I am very excited for him.... if you are looking for an amazing hairdresser, he is your guy! He always gives you what you ask for and offers excellent opinions and advice if your are unsure.   He will make a great addition to Sachi!","useful":0,"funny":0,"cool":0},
{"review_id":"6qTtineIwJXZHVDmHtKDZg","user_id":"fOCV2evqdjDpfI-6ULvr5Q","business_id":"x5iQFVJkFl7fSXC6uVjwPw","stars":1,"date":"2012-06-18","text":"We just moved to Mesa and were happy to hear about this place. We love Mexican food.  We were looking forward to a green chile burro enchilada style.  The meat in the burrito tasted like canned meat and was gravy like.  The rice and beans tasted like canned food too.  Not authentic at all.  We did not finish our food but ate a lot of chips and salsa which weren't bad.  Finished our drinks and left.   I am not sure why everyone raves about this place..... They must not know good mexican food.  We won't be back.","useful":3,"funny":1,"cool":0},
{"review_id":"9iyorcVfHzLixL-kGz6UsA","user_id":"eMV-UMb733EHCFe-TG-SFg","business_id":"ceK2VvPlxPBPo1evXOlD7g","stars":3,"date":"2012-06-03","text":"Visited this restaurant a few weeks ago and tasted a variety of their kabob plate combos. My family and I enjoyed their baby lamb chops and the boneless chicken thighs the most - moist, delicious and large servings! (we also tried the chaplee, chicken breast kabob and shish kabob). Again, the combos offered are of very good value...good amount of meat, a large piece of naan (which was a little bland and not as soft as the Indian naan we're used to) and good serving of fresh salad with every combo. \n\nThe people working there were also very nice, welcoming and helpful. Will return and try the tandoori chicken they also offer. Note: their website mistakenly says they open at 12pm everyday, but when we arrived on Sunday, they did not open until 1pm!","useful":2,"funny":0,"cool":0},
{"review_id":"M4ql7C-LLXQLA9TvUexgUw","user_id":"MONB2_AEZ8mkROhjEycJaA","business_id":"xu3JbicQsPv1lay0cT6tRw","stars":5,"date":"2016-01-19","text":"Tonight my husband and I visited Cleveland Tiffin and we were thoroughly satisfied with our experience.  Before I get into sharing about the food, I must express how friendly and personable Anup and everyone at Tiffin were.  While waiting for our food, Anup shared fascinating information about Tiffin Carriers in India.  I will continue to learn more about this process on my own.\n\n     Now on to the dinner,  I am vegan so I ordered the Palak Paneer and traded out the paneer for tofu extra spicy.  I also ordered Vegetable Biryani extra spicy.   This was a delicious meal.  The spinach and tofu was so flavorful and fresh and the Biryani was aromatic and addictive.  My husband orders the Chicken Tika Masla.  He also enjoyed his dish as well.  The portions are large so I have a lot of food left over to eat.  All dishes are made to order...like a homemade meal.  With that in mind, prepare to order a couple of hours before you plan to eat dinner.  It is definitely worth the wait.","useful":0,"funny":0,"cool":0},
{"review_id":"ypVpERLX9V139w2QEJB8Jg","user_id":"MONB2_AEZ8mkROhjEycJaA","business_id":"qlg2QMEErgseygqs_MQETA","stars":5,"date":"2017-02-09","text":"I had such a great evening at M Italian. Our waitress was phenomenal! She was prompt, funny and knowledgeable about the menu. The food was delicious I ordered the Wedding soup, Italian meatball and mushroom pizza from the Happy Hour Menu. The meal was DELICIOUS! The Wedding soup was created from a family recipe and it was so flavorful, it warmed the soul. The Italian meatballs were moist and tender. The tomato sauce and cheese that topped this dish raised the flavors of a simple meatball; to meatball perfection in a dish...I will order this again! The pizza was cooked well and made with quality ingredients. The food portions were generous. I was able to take food home to eat for lunch the next day. \n\n     At the conclusion of my meal, the manager stopped by our table to ask about our evening. He was a pleasure to meet. After talking with our party of 4, he sent over a sample drink for our party to try. Of course, it was DELICIOUS! Needless to say, I will be a regular patron at M Italian. I will update my comment after my next visit to include the names of the wonderful people who made my evening special.","useful":0,"funny":0,"cool":2},
{"review_id":"74rP8OQpbKUaCIIXVaBWXg","user_id":"Oo_D4vsr404DLdIA-E0BTw","business_id":"cxnbk6t6L3jnfT5n2Hbl3Q","stars":1,"date":"2013-02-22","text":"good food horrible service wanted the 5.00 lunch special on the door.. had the yelp deal 5-10.. was given a hard time about using the  yelp deal with special  so here is the breakdown  5.00 lunch special x 2 = 10.00 + tax  = 10.81  IF I WAS PAYING FULL CASH.... but since i had the yelp deal ....     7.99 menu price x 2 = 15.98  + tax 1.29 = 17.24 - 10.00 yelp deal =  7.24 CASH i paid + 5.00 price for yelp deal = 12.24 TOTAL i PAID USING A YELP DEAL  I WOULD HAVE HAD A BETTER PRICE GOING W\/o the yelp deal...  food was good customer SERVICE SKILL NOT so much i will goto  5 guys better burger","useful":2,"funny":0,"cool":0},
{"review_id":"f0ipM7NTVx7-GPB4fVQrxw","user_id":"Oo_D4vsr404DLdIA-E0BTw","business_id":"OMtAgpa37BYD7Aux8a8hzA","stars":1,"date":"2013-07-18","text":"I agree since the name change prices have gone up, service gone down. THis is right next to my work and used to be bumping for lunch not anymore. Would have the wife meet me with our kids for lunch under kids eat free was perfect for my little ones and we loved the place.  UNDER NEW NAME...  meat chix wieners should be slow,slower,closed.  at this rate  the owners should rethink the name franchise break.","useful":0,"funny":0,"cool":0},
{"review_id":"2XePU_kWdraooZQ1q2l67w","user_id":"Oo_D4vsr404DLdIA-E0BTw","business_id":"A7LPS3Vk7ORNe3dMQbvsmw","stars":2,"date":"2013-02-22","text":"Had my Daughter's Party here the place is clean and lots of fun for the kids but the \"manager\" need to get in check on how to treat people, She was Rude and because of that they lost my business till miss Manager is no longer there. Let me say this is a GREAT PLACE minus that one staff member !! .... I love the place i really do .. but that one person RUINED EVERYTHING.. 1hr 30 min party and the last 25 mins we where cleaning up to get out did not EVEN open gifts we wanted out of there away from the \"manager\" so badly!!!! get rid of the RUDE personal and you will have a GREAT place.  Till then my business will be @ bounceU or pump it up.. Their staff is friendly!","useful":7,"funny":0,"cool":0},
{"review_id":"78siUryerLeJVQdgbn7lLg","user_id":"Qa6X9HCtiYZhqS8YiwsUrw","business_id":"fuC3sui68QWg-rqldhJ01A","stars":5,"date":"2016-05-30","text":"Needed carpet cleaning ASAP and A One saved the day! They sent out Fredy and his helper and they came out the same day I called and were able to clean up the dirty, dirty carpets and my rugs - they look and smell so fresh and clean! Thank you Fredy and thank you A One! I will be calling again!","useful":0,"funny":0,"cool":0},
{"review_id":"wY57KaKMXWpjqbaeilkUgQ","user_id":"xU2DZktxrJIjthxUTpk_NA","business_id":"_7wj87KZspahqDHxbXreMQ","stars":1,"date":"2016-01-07","text":"The pharmacist at this Walgreens is extremely rude and unprofessional. She was trying to play doctor and she is not a doctor she is a fucking pharmacist.  This women had the audacity to question my family's intent and our doctors education. We have been loyal customers of Walgreens for 15 YEARS!!! I understand their policies and we weren't asking them for special treatment. We were merely asking if it would be possible to get a certain prescription on a certain day because of the holidays. She questions our doctors integrity who has also been our family doctor for 15 years! We usually use a different Walgreens and the reason we were using this location was because the other one didn't have our prescription in stock so they referred us to them. Our other Walgreens knows us by name and they are all very sweet. This pharmacist then begins to insult the other location to us (the CUSTOMER). She also says that our doctor who has been prescribing the same thing for the 15 years is wrong and he shouldn't be prescribing that to us. She said that wouldn't fill our prescription. Feeling so insulted we then proceeded to call the corporate office and they said they would have someone call us that was in our district. They still have not returned our call. Overall i think that this pharmacist should have some repercussions for her attempt to \"play god\".","useful":0,"funny":0,"cool":0},
{"review_id":"MJtfAjacm6yaEE6FwMT4FA","user_id":"xU2DZktxrJIjthxUTpk_NA","business_id":"5wTs_RnU7XE_S2uw20kU9A","stars":1,"date":"2016-01-07","text":"All i wanted was some ice cream and they never have it!!! How does every other one have freaking ice cream except this one. It's the stupidest thing I've ever heard!!!","useful":1,"funny":0,"cool":0},
{"review_id":"f5Byc4mExE6a_0JKkI3I3Q","user_id":"xU2DZktxrJIjthxUTpk_NA","business_id":"seSxUrP20emweQGA-Ugm4g","stars":1,"date":"2016-01-07","text":"I like to make sure a store has something before I make the effort to go down there. I check the the website for what I need and make sure I check the boxes for in store at  this location. I do this all the time and they have it, but every time I go to this location it's never there so I just wasted my time. The shelves are never stocked and everything is just laying around. Terrible service. Always only like 4 registers open out of 30 registers and the lines are so long even in the 20 or less line. It takes just as long to get through the 20 or less as it does the normal lines.","useful":1,"funny":0,"cool":0},
{"review_id":"9i1KJosgeE7w2nLdwJCezA","user_id":"iE9zExe7hyxayWnrmIzQnw","business_id":"NWioeR6MmKxgYD87EL56wg","stars":5,"date":"2015-11-27","text":"Best korean Spa that I ever attended in US.\nI would recommend spa goers to check that place if you have some time.\nP.S.\nAnd yes you have to get NAKED at some point.So if you have issue with that, probably it's not your type of spa.","useful":0,"funny":0,"cool":0},
{"review_id":"KTlb9TeesgEqVp1UvKs14A","user_id":"mg0OdHY1lLmJkq8cnA-AJA","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":4,"date":"2017-02-03","text":"We where her for a work convention. Check in on a Wednesday night for a two night stay.  The hotel offered us a great upgrade to our room for a small fee. We stay in in one of the 900 sq foot suits. The room was  spacious and comfortable. The bathroom is clean. The only complaint I have is I felt that the carpet was gross. \n\n The first morning we ate at the buffet. The food was mediocre at best. I have to say we left a little hungry. \n\nThe staff was as nice a helpful.","useful":0,"funny":0,"cool":0},
{"review_id":"TTr8OAuTQ3Ls7u9shD4ZEg","user_id":"NX_cc7A7UZGK-EKB6ITetQ","business_id":"EZRl9nOwcaED93NnFakvHw","stars":5,"date":"2017-11-13","text":"It is a great place to study! The server here is really friendly and I have never had a authentic tea drink like this. Tea shake is highly recommended. So delicious!!!","useful":0,"funny":0,"cool":0},
{"review_id":"4P6BUkdQpobImZhCIY8Q_A","user_id":"NX_cc7A7UZGK-EKB6ITetQ","business_id":"6Z6IyosSMciZtwk8hRLRag","stars":5,"date":"2016-08-14","text":"The food was good as usual. The server was really kind to help me get rid of all of green onions because I forgot to let him know that I do not like it. The renovation of the interior was pretty good.","useful":0,"funny":0,"cool":0},
{"review_id":"z3Qh4olgKMyJOw-q_0iSow","user_id":"MXAcEttm9W5Pl9CdYrmwNw","business_id":"5euk5_UKqnAWcrbOPNYt0g","stars":4,"date":"2017-01-22","text":"This was our first time here.  Great food!\nThe Red curry was very tasty.  The service was good.  Loved the complimentary dessert.","useful":0,"funny":0,"cool":0},
{"review_id":"kfvzJqcxErM-AI_fErevWA","user_id":"Lo6HBMkIoENGkGSPqhlzCw","business_id":"wbeK4EgSJZ0mKDd2vbaxnA","stars":5,"date":"2014-11-06","text":"This place is fantastic. It's clean and the staff are very welcoming. I get a manicure & pedicure every three weeks!  Would recommend in a heartbeat.","useful":1,"funny":0,"cool":0},
{"review_id":"NK7p_XDn987ZyzlFWTmiBQ","user_id":"Lo6HBMkIoENGkGSPqhlzCw","business_id":"TsUg_BV3PZ7ZJP0r3SAD3w","stars":5,"date":"2014-10-17","text":"I have to say that Bellair Laser Clinic is by far the best I've ever been to!!  \n\nFirst impression - the clinic is spectacular.  The location is convenient (a few steps away from the subway), the design is very chic and the place is beyond clean.  They greet you so warmly and they have such positive energy.  \n\nThe services I had done were underarm laser, microdermabrasion and now going for fraxel.  I've inquired about several products but never felt pressured to buy them.  They gave me samples to take home to try before I committed to a bigger bottle.  Every single product I bought, I LOVED.  \n\nBellair Laser truly is an amazing place and would recommend anybody to try it out.  You will not be disappointed.  \n\nGood job to their team & management for such amazing experiences and professional advice.  You have a life long customer!!","useful":0,"funny":0,"cool":0},
{"review_id":"xpYb11cUFI9znl-FKC0t6g","user_id":"Lo6HBMkIoENGkGSPqhlzCw","business_id":"afc3QwjxDI79Rglr5jYqMA","stars":5,"date":"2017-09-16","text":"Missed eating quality pasta since becoming gluten free. Found this gem on Bloor Street. Authentic pasta with a variety of options. Perfect for take out, on the subway line and quick service. \n\nLove the name too.","useful":1,"funny":1,"cool":1},
{"review_id":"Xb_Dogb81tt8CTzMx-iBaA","user_id":"ykaHtq7cKrl5g6GWM3Jqew","business_id":"-2ToCaDFpTNmmg3QFzxcWg","stars":1,"date":"2016-06-09","text":"Unprofessional! We had a 10:45 flight, the shuttle company told us to be ready for pick up at 8:15. We were waiting in the designated spot outside of our hotel until 8:35 for the shuttle to arrive. It finally did, and took until 8:40 for us to leave. Originally, the shuttle's route was New Orleans to MGM Grand, but, upon calling, it was revealed that they had stopped at other hotels along the way. Irritating if you have to catch a flight!!","useful":0,"funny":0,"cool":0},
{"review_id":"MUev1heRK9gXv_vjxS27gQ","user_id":"ykaHtq7cKrl5g6GWM3Jqew","business_id":"DXlDzOcpdUE_F21tok0fgw","stars":5,"date":"2016-06-09","text":"Perfect! There's enough staff to manage having everyone enter the theatre, and the seating isn't in a difficult arrangement. \n\nBefore you enter, there's a bar. They serve cocktails and some soft drinks (Pepsi, Sprite). Their smallest size is 12oz. They also serve small and large popcorn, which was really good. \n\nThe actual show was great as well. There's so much going on, starting from when you enter- employees are all dressed up. In the stage, there's a fake blast of fire frequently. \n\nThe show began exactly on time and was about an hour and a half. The graphics, light, sound, and technology were crazy!! Enjoyed the show very much.","useful":0,"funny":0,"cool":0},
{"review_id":"NeVBhzNmUPgDDy60HttvXw","user_id":"WB7Wb1y2f9O3kHAuFo3VkA","business_id":"0NmTwqYEQiKErDv4a55obg","stars":5,"date":"2011-08-26","text":"Everything about this restaurant is AMAZING! We had an amazing view, the food was fantastic, and the staff, were all very helpful and friendly. The Chef, Chef Dave even came out to see how we enjoyed the food. I've never met such a great Chef!  I will make sure to come here again next time I make a trip to Vegas!","useful":1,"funny":0,"cool":0},
{"review_id":"mt1GXO9wbmylaEDouLU9-A","user_id":"WB7Wb1y2f9O3kHAuFo3VkA","business_id":"qEJjv2k8nDhOiYpmi_aVOw","stars":5,"date":"2011-08-26","text":"Top 3 Places you HAVE to go to in Vegas. If you are planning on going to any pool party, this is the place. Music was good, drinks were strong, people were so fun! \n\nWe got a cabana there which made it more enjoyable! Special thanks to BEX for being such a gracious host and the best VIP hookup in Vegas!  I along with the 11 other girls would never had as much fun without her help! I miss Tao Beach already!","useful":1,"funny":0,"cool":2},
{"review_id":"cA4ilkHRE8iX0denhXMd-Q","user_id":"s6ZZfPL8j5pnvVSeu6WwEQ","business_id":"rq5dgoksPHkJwJNQKlGQ7w","stars":5,"date":"2014-11-20","text":"Amazing little coffee shop! Loved the atmosphere and the coffee was fantastic! The employees were friendly and even helped play tour guide for my friend and I.","useful":0,"funny":0,"cool":0},
{"review_id":"sxBSl-gyXLgerDC71DCwhg","user_id":"4ecDa-I2HE_P99l6ZfLqYw","business_id":"JOsBOphWK14yjq7FC1zL5w","stars":3,"date":"2010-08-30","text":"Love this place for hangover Chinese.love the Kung pao and NY style chop suet","useful":0,"funny":0,"cool":0},
{"review_id":"BzuttF8N5YMzhW9CzkXTmg","user_id":"4ecDa-I2HE_P99l6ZfLqYw","business_id":"tXq5OcDNUT9boWJtaxtOlA","stars":4,"date":"2010-08-23","text":"Love this place great service and good food. Pretty girls don't hurt either","useful":0,"funny":0,"cool":0},
{"review_id":"eGa3R-W8CqGBJtlzUuSS3w","user_id":"He-yzVPPAe9xrRp9WGQlTw","business_id":"RypJ1Rhq7Y8GFdP5UFbzUg","stars":5,"date":"2015-08-20","text":"We really enjoyed our stop here. Very nice atmosphere. Private room and very polite people to help. kids enjoy the room with\n computers and television. Decent food and drinks were good.","useful":0,"funny":1,"cool":0},
{"review_id":"9n1T-wVxsfQZbQ3cdRf46A","user_id":"ceIxPqfjhZbMdht4tGk7TQ","business_id":"wkChwNgC7YSc8KZgXiGT0Q","stars":5,"date":"2016-09-12","text":"Magnificent views at sunset. Excellent appetizers.  We enjoyed the beef sliders & calamari frites.  Friendly wait staff.  Do NOT miss the restrooms!","useful":1,"funny":0,"cool":1},
{"review_id":"b6yeHqqvDpMpB4I9bXgUaA","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"prHnRsgY-PuM7vxe8-RwEA","stars":1,"date":"2015-09-12","text":"Went there for lunch and it was a disappointment , the food was so dry and had no flavor! Not to mention it was nicer outside then it was in the restaurant to eat, they forgot my chicken on my order it was just veg's and dry rice, then they laughed about it as I told them! I would not recommend this place at all to anyone, my stomach had cramps the rest of the day! The bathroom was so gross, it looked like it hasn't been cleaned in a very long time!","useful":1,"funny":0,"cool":0},
{"review_id":"x6nU3Oj_GSukylIK6b7vGA","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"4bmaBgd-GfVO94K5BlXk-g","stars":5,"date":"2016-04-30","text":"We love Daniel!!! He's amazing! He has been mine & my husband tattoo artist for 8 years & does amazing work! I guarantee you won't be disappointed in his work!","useful":2,"funny":0,"cool":1},
{"review_id":"9pNe8jRUpt2LGTANqe2dfg","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"44kd3YdkhXj5XiSPs5XNjQ","stars":2,"date":"2016-07-23","text":"Omg if you want to go eat dinner for 5 hours then go here, the waitress was so nice but it took 30 min just to get a beer & waited a hour or more to get our food. They need a better system here, it is ridiculous!","useful":3,"funny":1,"cool":0},
{"review_id":"NLKCekt9cdtVtVfnUPn93w","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"JhRxDdmZSGDG_u7cGxaYrw","stars":2,"date":"2016-08-28","text":"I will drive the extra miles to go to the one on town square , the manager had to take our drink order & bring us what we needed if it wasn't for him I would of gave 1 star, we had to go search for our own silverware and our server was missing half of the time, he was talking or just no where in sight! The girls were taking selfies, the staff is very unorganized! I do not recommend this location at all!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"lF2BtQMpXWI62gUT3oitjQ","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"CZhc8YXdFLhAI4ViC2ERTg","stars":2,"date":"2016-04-30","text":"There food used to be good & I don't know what happened but it's nasty now!!!!!!!! I ordered shrimp enchiladas & they were sour and the tortilla was falling apart like it's been sitting there!","useful":0,"funny":0,"cool":0},
{"review_id":"E0akC8G79eg2duaO8jn7qQ","user_id":"Ge7j52ujSiEKMx3q6BXXMQ","business_id":"Y9oYrGHiMyRIRaudSWomzg","stars":1,"date":"2015-12-26","text":"I was on hold for 7 minutes before the girl answered my can you hold call, my husband went to go pick up my food that I was still on hold to order & he says she was laughing and talking with a guy while I was on hold!!!! \nFood is great but customer service sucks! Hire some people with class","useful":0,"funny":0,"cool":0},
{"review_id":"MR5MJC3pEwc-4X1155zyJw","user_id":"beDswBeENFLTD6ZC1TzG7A","business_id":"-bMZCfTK7fxFaURynKpBMA","stars":5,"date":"2013-02-26","text":"Great flavor and service. Excellent fish dishes. Clean and friendly.","useful":0,"funny":0,"cool":0},
{"review_id":"GZwLeIYv2kk53Rk7rUqRnw","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"nn4ZkIZTCd7jJhxs-P9tHA","stars":1,"date":"2013-12-23","text":"Today is the last time I will ever order steak and eggs at the 5 & Diner.  This is the third time in a row where the steak just sucked.  Not even eatable.  The server (Carlos) is nice and does what he can but it's not enough.  Carlos told me he tells his boss but nothing changes.  Well now I'm telling whoever runs that place that your breakfast steak is not worth serving let along to pay $12 for it.  Unfortunately you will never have a chance to get me back even if you solve the problem.","useful":1,"funny":0,"cool":0},
{"review_id":"4KoUWJu54_26xRTYh2CMhw","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"du9_QFb75sxzKnLLQwSkMw","stars":2,"date":"2012-11-06","text":"It's way over priced for what you get.  The burgers are good the frys are soggy and undercooked and they're not shoe-string like advertised.  You can go to Hamburger Works and the best burger in Phoenix.  You can get a \"great big one\" with everything including a large 1\/2 pound of fresh beef for much less than 5 guys charges.  I also didn't like having to buy frys for 2 for $3.00.  A small burger, frys and a drink cost almost $13.  I tried it once but I won't go back.","useful":0,"funny":0,"cool":0},
{"review_id":"iMM4gfSUu1Ah7RwfX-CKfQ","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"IQVka-wzJmN3jw2W70aCzw","stars":1,"date":"2017-02-23","text":"Terrible.  Don't waste your time or money.  They only have one waiter to handle the entire place and he is so scripted he doesn't make any connection to the customers.  He's just working for tips.  The food is not to my liking the marinara sauce is way too sweet for my taste.  It's also expensive for what you get.  I will never go back to that place.  I'll go back to the Avanti.   Location is not great but the food and service is so far above this place it's not even a consideration.","useful":0,"funny":1,"cool":0},
{"review_id":"S8U883pBoZlibl60HqaECQ","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"PN2QUMm4bsEKls2Q2-BXsA","stars":5,"date":"2015-10-30","text":"The Ritz Brothers (Pat and Joe) are the best.  Patrick is a Master Mechanic and Joe is an organized Manager who cares about customers and getting the job done right.  They are honest and reasonable but above all, there is nothing these guys can't fix.  Fix it right and fix it the first time.  I'm impressed with how many vehicles are there in their shop, all high end vehicles or antique, they seem to do it all.  I was there today and again impressed with the line up of expensive vehicles for service or repair.  If  you want it done right and don't want to get gouged, take your car to Sports and Collectors Car Center.  You'll thank me later for this recommendation and you'll never go to a dealer again.","useful":1,"funny":0,"cool":1},
{"review_id":"uJaEU6CVdbJJTjFIPo4I3A","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"Nc7cqq5k0WZsVhu25QrmNQ","stars":5,"date":"2015-12-11","text":"These guys are the best of the best.  Their custom work is truly amazing.  They installed the latest Pioneer 5100 NEX in my 2003 Mercedes SL500.  There were no acceptable installation kits available so they had to hand make the mounting hardware and bezel plate for my car.  I had some initial concerns about how it would turn out because I'm very particular and the stereo \"head unit\" is the centerpiece of the dashboard.  When I went to pick up the car, I was blown away by how good it looked and what a great job they did.  It looks like a factory installation.  \nMy car now has the most modern technology available in stereo equipment including satellite radio, DVD, CD, Blue Tooth, Apple Car Play, touch screen, Navigation and best of all, sending and receiving texts by voice.... hands free.  \nI am 100% satisfied with the installation, the way I was treated, and the quality of the equipment and service that Sun Valley provided.  The same people have worked there for many years and they are very very good at what they do.  I would never even consider going anywhere else.","useful":4,"funny":0,"cool":0},
{"review_id":"Z5Rs_TtSTlMrCmcVWmIi_A","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"lbQiJ3t9VhBrt0NcuXx1bg","stars":5,"date":"2017-06-14","text":"These people were very courteous and helpful.  They were honest and straight forward about what I could expect and what action they would take.  Unlike others I called who wouldn't even talk to me unless I made an appointment.  I highly recommend this firm.","useful":1,"funny":0,"cool":0},
{"review_id":"LILlWF8JrkcUjWVKIapkAw","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"5DT2qxCkXxUKW7z_4kOXmA","stars":1,"date":"2014-10-04","text":"We had the Basel Duck and it was not bad, it was awful.  I complained but the response was it wasn't their fault.  They refused to make any concessions.  We were charged almost $40 and we didn't eat the duck because it sucked.  Be aware.  There people take no responsibility for serving a bad meal  I will never go back to this place.","useful":0,"funny":0,"cool":0},
{"review_id":"BEejG8XFIX6OmXXQhWm6dA","user_id":"nazlxDutX5FcG3F6xnFF-Q","business_id":"zSFutuGG7NcL60-N9g-EUw","stars":1,"date":"2017-04-07","text":"I Went in for a defibrillator implant on 4-3-17.  Every one of the people I came in contact with were 4 or 5 star people except one.  He was my night nurse and his name is Dave.  I was on the 6th floor, room #7 of Saint Joseph's Hospital.  The nurse shift change is at 7:30 pm so there was a meeting of Nurse leaving, me and nurse coming on duty ... that would be Dave.  We went over all my meds and that I was also due pain medication at 8 pm (now 7:40).  It was also discussed that my Doctor ordered an IV fed antibiotic also to drip during the night.  I called for Dave at 8:30 and asked about my medication which were due at 8 pm.  He said he was busy but would get to me soon.  At 9 pm I called Dave again who informed me that I would not be getting the pain medication because I had not specifically requested it at 8 pm. He also informed me that he decided not to do the  antibiotic drip.  I told him that I wanted both medications or I would \"unhook myself\" and go to a different hospital.  I told him I didn't feel safe with him and that I would be submitting a formal complaint in the morning.  That seemed to change his attitude and He finally agreed and gave me the meds sometime after 10 pm.  Dave avoided me most of the rest of the night.  Next morning I asked to speak with Dave's supervisor.  Someone came in who didn't really seem concerned (like this happens all the time).  While she was there my doctor came in for a routine checkup on my condition.  I told him what happened the night before and he immediately asked for the floor manager to come down and speak with me and take a report.  The Manager said she would be right down.  This was at 6:30 am and in spite of my reminders, the floor manager never did show up or contact me.  I think Dave is dangerous.  I stayed awake all that night because I was afraid of what he might do.  Dave needs to be identified and prevented from being around sick people.","useful":4,"funny":1,"cool":1},
{"review_id":"1em3I-M5xRfWkvgSe6_BlA","user_id":"h_sHtN-PC-DWZvwWDTxzsg","business_id":"J01oX1zLdkV5doNupaTaiQ","stars":1,"date":"2015-06-30","text":"Made the mistake of leaving a glowing review a few weeks ago when I was actually treated like a person. Drinks are cheap - expect nothing more, unless you enjoy Jekyll\/Hyde personal attacks from the unhinged bartender, regardless of how much you overtip. Oh, and if you dare to leave for a few minutes, he WILL throw out your pitcher. Just go to the Crown and Tiger next door - drinks are even cheaper, it's not in a dank basement, and the servers are efficient AND pleasant.","useful":0,"funny":0,"cool":0},
{"review_id":"2APSLFf_H4hVj1pwoukcJQ","user_id":"ihxhPCyMht1fojB3IuMPww","business_id":"9evRrJHVWghiv16EOUg6zA","stars":5,"date":"2017-05-11","text":"Great breakfast! Eggs and bacon both delicious, maple syrup with the pancakes; near-perfect hash browns; and cheerful, on-the-ball service by Lisa. Reasonable. We'll be back.","useful":0,"funny":0,"cool":0},
{"review_id":"BEocVyw8fKIoMNR4sT05hg","user_id":"Lol72qBdxMV96PJpjdR65g","business_id":"p5rpYtxS5xPQjt3MXYVEwA","stars":4,"date":"2015-02-05","text":"Looking to have a great tasting meal, fresh squeezed juice, or protein shake? G&P is the place for you.  They have gluten-free choices, a lot of organic choices and it's very affordable.  They even sell DNA Life Bars! Check them out after your next workout or just to have a fun lunch or breakfast with friends or even the kids!","useful":1,"funny":0,"cool":1},
{"review_id":"iScq0Yb92yurkkAJ2CUs-g","user_id":"Lol72qBdxMV96PJpjdR65g","business_id":"b6rE18Z5DLJfUGjH85maSg","stars":5,"date":"2015-02-05","text":"Great prices, great selection of all the healthy foods, vitamins, and protein powders you love.  Much cheaper than Whole foods, much easier too.  Go shopping there directly, or order on-line then pick it up -- right by McCarran Airport!","useful":0,"funny":0,"cool":1},
{"review_id":"xqh_V0dlgA57jqBbUukXpA","user_id":"Lol72qBdxMV96PJpjdR65g","business_id":"d_3T8hgY7PAKGW-t4LCHvQ","stars":5,"date":"2015-07-04","text":"Priority Pools and Ron Rudy were referred to me by my brother-in-law when I had my pool built last summer.  Their service is exemplary! Any time I've had any problems or pool issues (from low water line to a murky pool), they send some one over right away and it is fixed immediately.  Very professional, super nice, and they know their stuff.  I cannot recommend Ron, and his entire crew highly enough.","useful":0,"funny":0,"cool":0},
{"review_id":"eR_6_kGauXRS5B2H4FUkWw","user_id":"Lol72qBdxMV96PJpjdR65g","business_id":"Ci5_jgkoNYPjIkvcUQoilA","stars":5,"date":"2016-12-21","text":"Cannot recommend this mom 'n pop plumbing group enough.  They are courteous and timely and John's work was quick, efficient and professional.  From stopped up sinks to water softeners they can handle it all.","useful":0,"funny":0,"cool":0},
{"review_id":"NXYlu-CcOKXHEQ-kMmP_fQ","user_id":"Lol72qBdxMV96PJpjdR65g","business_id":"SR0Q2hAEMJ_m23O_x-khSQ","stars":5,"date":"2015-02-05","text":"Wishing there were more locations -- but in Henderson @ Green Valley Parkway, you'll find wonderful food, juices, and ambiance with many vegan and gluten free options that do not sacrifice on taste. I send all my clients there!","useful":0,"funny":0,"cool":0},
{"review_id":"zsM7Ot1vPVlT0JJ0gNsOCw","user_id":"nX9vaflXex-sJCqN5Ds8bg","business_id":"W2ir8qil0iruX_6C5EMLAg","stars":5,"date":"2014-10-05","text":"I never go any place else to get a battery for my car. Best prices in town, excellent service. Battery prices are a third of what you would pay at Auto Zone or any other automotive shop. Can't get better prices at Costco or Sam's Club either.","useful":2,"funny":0,"cool":0},
{"review_id":"39jlVqLyfP0hsScl1GwK5A","user_id":"7EXsW-esp0YYoHuVkJK33A","business_id":"krROTqY_UsCzpdh0fFRggw","stars":5,"date":"2015-04-22","text":"Great place. Brunch is perfect. Line up elsewhere if you want to pay more to be hip.","useful":0,"funny":0,"cool":0},
{"review_id":"W0oYn8A3jOE1smaL2gpXUw","user_id":"7EXsW-esp0YYoHuVkJK33A","business_id":"ovnqQaQ8BsPgDoJ4nlYBUw","stars":1,"date":"2013-05-09","text":"I'd say the baking was great except you have to endure the wrath of the owner.  She clearly couldn't give a monkey's about customer service.  I see on the website it's a artist baker.  Whatever get over yourself.  I live around the corner and will never darken the door of this 'artistic bakery' again.  \n\nTo the owner.  You have all the tender sweetness of a seasick crocodile,\nMs Grinch.","useful":8,"funny":10,"cool":6},
{"review_id":"6O4I5npA5SZTYzVH7vtCxQ","user_id":"7EXsW-esp0YYoHuVkJK33A","business_id":"g6h219qiuvmraj-IO-NQCw","stars":5,"date":"2013-04-28","text":"Great place.  I always ordered the veal, which I love, but tried the steak the other day.  Amazing sandwich.  For $20 for 2 for lunch it's a great deal, and you won't need a big dinner it's so filling.  \nThanks Vinny","useful":0,"funny":0,"cool":0},
{"review_id":"L8lssfI9K6u5Zp5GKHTNYQ","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"GU_bZ2qgcxVsj7f98z-1YQ","stars":5,"date":"2016-01-22","text":"I was so nervous! This was our first home build so we were very overwhelmed with trying to design our backyard.  I did a ton of research and talking to people about the best pool company in our area.  Hands down, Presidential was the top recommendation.  We met with John at the Gilbert location and he was very patient with us.  We had an idea on our pool design but had no idea at all on costs.  We explained this and he patiently designed our pool and all the bells and whistles.  Obviously it came back way over what we could afford.  But John didn't give us any attitude at all.  We were even in his office right before they were closing and he didn't shoo us out the door.  We ended up taking the quote home and sitting on it for a month.  When we finally came back, John was eager to help us redesign something that we could be proud of.  And we did!!\n\nWhen our project kicked off, our project manager, David, and John met with us at home and walked us through the entire process.  They even had this cool little website where we could track dates and milestones.  Once it got started, it went very quickly!  Our only delays were because of the holidays (Thanksgiving, Christmas, and New Years.. and the rain.. oh the rain).  And of course, I had soooo many questions.  David was always very responsive and easy to contact.  \n\nAt the end of our project, we scheduled an appointment with Jason and he walked us through the phone app to control our pool (yep, there's an app for that) and all the controls on our pool system.  He went step by step on the chemicals needed to keep our pool balanced.  After a week of owning our pool, I feel very comfortable being able to maintain our pool myself because of all the information Jason provided us.","useful":9,"funny":2,"cool":1},
{"review_id":"hkflo8Su4LJHKcSrp2pZ-g","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"H4LD8rfe6Mk5hWVBIIuelQ","stars":5,"date":"2015-07-29","text":"I purchased 3 fans from Clark about a month ago. There was definitely no pressure to purchase anything that day. For the fans I selected, I even had the option to have him install the fan speed controls at my wall switch or use the remote, with no additional charge for parts or installation. On install day, his guy showed up at 9am sharp, installed all 3 fans, and was outta there. \nThough Clark's fans were a bit higher in price, when I add on the install charge and headache to find someone else to put them in, it would have cost me much more. I'm going back today to buy 4 more fans.","useful":4,"funny":0,"cool":0},
{"review_id":"BzJAKpk60DPCbalCzXJ78Q","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"tL5FjqbF6ZyEouZrNaOdqQ","stars":5,"date":"2016-02-24","text":"In CA, we had a whole house filter that we liked. We called that same company when we moved out to AZ and somehow their price was over double. Nope! So I found a recommendation for this company on a local FB page. Sunday night at 10pm, I sent an FB message to Hunter with Mountain Fresh Water Systems. He replied right away and we scheduled an appointment with him for Monday afternoon. Hunter is very knowledgable, answered all of my millions of questions, and was not at all pushy. We decided on both the R\/O and water softener systems that were installed on Tuesday. Within 48 hours, from first contact to install and I'm a happy camper with fresh clean water! A much better system at half the cost of the other guy!","useful":1,"funny":0,"cool":0},
{"review_id":"5iR_bV4iQ1kH8ode8sjBMQ","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"-WExTQDca_JdeWd1BjlOTw","stars":5,"date":"2016-07-15","text":"By far the best car buying experience!  I was looking for a used Ford Explorer.  For three days, I was online looking at car dealers from all over Phoenix.  I came across one at Chapman BMW and left a message for JEFF ORENSTEIN.  He returned my call within twenty minutes, apologizing for having taken so long to call me back.  I told him I was interested in the Explorer.  He gave me the best price over the phone, which was much less than the other dealers had listed (including Craigslist), without having to haggle.  When I called him back after talking with my husband, Jeff had already inspected the vehicle, identified items he was going to get fixed before we came in to sign the paperwork.  We made an appointment for after work the next day and within an hour and a half, we were driving away.  I wish buying a TV was this easy!!","useful":0,"funny":0,"cool":0},
{"review_id":"7kM1Pbb2OnKTYUlQnoduhA","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"8keN8Z2sylAEXgMCJMQpDg","stars":5,"date":"2017-08-07","text":"Placed our pick-up order online last night for My House chinese restaurant. Went over 10 mins later.. 45 min wait for food. So had a glass of wine at Frys while we waited :) \"glass half full\"\n\nWhile we were there, the (young) owner came out.. stressed as all get out.. about having to close again at 6:30. He hasn't slept in 2 days and he's super worried about food quality and customer service.. people have been commenting about his restaurant on Facebook so more people have been coming out.. he's been open for 6 days.. Let's say you've been working on a job for 6 days and your boss tells you that you suck at your job, do you quit and give up? No way!!!!  \n\nIf you happen to be hangry today, please choose a different day to try these guys out.. you won't be disappointed!","useful":5,"funny":0,"cool":1},
{"review_id":"TWsivImJ8kWOCRjjAE6eXg","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"luxQ9RFLDM0ksWvlvVSUAA","stars":5,"date":"2017-03-29","text":"Don't know the guy's name but he is on top of it!! Every person that walks in the door, he's greeting.. eye contact, smile. No wonder I drive all the way to this store.. oh and the free tire rotation and balance helps","useful":0,"funny":0,"cool":0},
{"review_id":"5j6BUOUevkQw-OF75J0XoQ","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"eDJ0aUIAzc6PNuZ_6ELR1g","stars":5,"date":"2016-05-21","text":"What a difference Kelly's makes! We're new to the area and still trying to find our local auto shop. Used one shop down the street but after a few months, I was having similar issues with my car. Dale really troubleshot every possible area and found the problem. Not only am I not having issues with the traction control, but my brakes don't squeal anymore! Win win!","useful":1,"funny":0,"cool":0},
{"review_id":"JFOUowOOFTKHbjtXJnnsfQ","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"Pvuk0SoevAiOHt0fCOc8tg","stars":5,"date":"2017-09-25","text":"I'm so glad I went into a corporate store. I stopped at the tmobile closest to me and the guy said \"well we can do everything a corporate store can do\"........ well not really buddy since you sent me on my way to deal with it myself\nAt this store, I explained to Alondra that I purchased the iPhone 8 from T-Mobile's website and realized I should have ordered the Plus with the larger screen for my aging eyes. She was on it right away! She called tmobile and confirmed that I could ship back the 8 and get refunded the amount I paid online. She got a return shipping label for me (even printed it). And had the iPhone 8 Plus in the silver that I wanted. Got my new phone running with the application of the protection screen and sent me on my happy way!! \nI realize any store could have done this but the key is making a customer FEEL like you're helping them solve their problem. Kudos to this store that figured it out!","useful":0,"funny":0,"cool":0},
{"review_id":"vZW9-RPpXwxRRX29_G1E3A","user_id":"QkO16gr4QaPaKPWeUTAEqA","business_id":"h_LND2jTSC2uxgPCLdhGVQ","stars":5,"date":"2015-08-01","text":"I'm glad I didn't read these reviews before we drove down to the store. We went in looking for a dining set.  Jett took the time to show us all his options.  But after I showed him a picture of what we were looking for, he didn't blow us off.  Instead, he told us about a few furniture stores in the area that carry that manufacture line.  Pretty cool.\nSo we asked him about sectionals for a media room.  He sold us on one that had all power seats, easy-to-clean leather-like fabric, and then explained the included 5 year warranty.  We asked him about the deal they had at the time where you spend a certain amount and you get a TV for free.  But instead of just letting us spend the money, he suggested that if we didn't really need the extra furniture, just go with the sectional.  \nLast night, as promised, they called to let me know the time they were going to deliver the sectional (10:30-2:30 window).  Today, they showed up at 11:30, set it all up, and explained how to take them apart.\nWhat I really liked about the experience is how Jett had a ton of information, from furniture  manufactures to colors that promote warmth and coziness.  He is definitely an expert.","useful":1,"funny":0,"cool":0},
{"review_id":"58RlIcrwA3WmJWdf2CJfKg","user_id":"taQ2HgkJP5-GjcXmG0IV-A","business_id":"qMbtI2SfnmsR214w1AsH0Q","stars":5,"date":"2013-10-31","text":"I have been going to Dr. Terkonda for many years for fillers, Botox, and some \"preventative maintenance\".  He is highly skilled and personable.  He shows excellent judgement and I trust him completely.  I have strayed for Botox specials (while he's competitive, there's something about a Living Social deal).  I am so much happier when I return to him.  He does beautiful work and ultimately, where your face is involved....that's key!","useful":4,"funny":0,"cool":0},
{"review_id":"778ud8jDdilg6UnlugnJkw","user_id":"Jc6Cs05Dj6kXOpeEVuBbGg","business_id":"WdCh7l_pxqJtuZl5VJriYw","stars":5,"date":"2012-07-19","text":"The Samosa Factory always has great service and fantastic food. My order is ready on time and the food is consistently perfect.","useful":0,"funny":0,"cool":0},
{"review_id":"4d3wiPImvBizp6eX7UfdpQ","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"ncFbwqPRBkYxFc3Q-CTYIQ","stars":2,"date":"2013-03-04","text":"I can't attest to the beer, but everything else about this place was pretty abysmal.\n\nAtmosphere\/ambiance - weird. Stage still there from jazz bar and it's just taking up space and awkward. Also feels like a cafeteria. Tables are very spread out and there's just not much to the whole space.\n\nFood - decent, but definitely not worth the price. We had the calamari appetizer, a salad, 2 kids meals and some beer and paid $52.\n\nService - waiter was very attentive and nice, but scattered. He forgot our main meal and then actually offered to take the item off our bill. Well, yeah. You think?","useful":3,"funny":0,"cool":1},
{"review_id":"dZ-oRejfYsjeZrwlkE7tjA","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"4s_cPDS_AkLP1fXMJPqB2w","stars":4,"date":"2017-06-05","text":"My kids and I came here on a whim (sudden Bulgogi craving) and we loved it. Great service and yummy food. Even my picky eater 9 year old was obsessed with his Yakisoba. I had the bibimbap which was delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"BZdCc8eY_-6sgmeVC2kGSQ","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"Q6r5JFouQOFrQ3MKbOv-hg","stars":5,"date":"2017-03-17","text":"Our family loves Seville Family Dentistry. Both doctors are patient, thorough, and have hired an amazing staff of hygienists. Our whole family goes here now, but we just recently started bringing the kids as well. We had been taking them to Timber Falls Pediatric Dentistry for over 5 years and my kids teeth were horrendous. I thought it was just genetics and we had to live with it, but I eventually started to wonder if maybe the team there wasn't all that great. The minute we brought the kids to Seville Family Dentistry, I knew I was right. The hygienist explained what we could do to combat what was going on with my son's teeth and she was able to get them looking the best they'd looked in years. Plus, my husband had been going to Val Vista Dentistry and I convinced him to move. When he did, the team at Seville Family contacted Val Vista for my husband's records to find out that they couldn't provide a full set of x-rays because they never actually took any even though they claimed them on insurance. So it's refreshing to be able to find dentists who are honest and looking out for our best interests.","useful":1,"funny":0,"cool":0},
{"review_id":"B8dplv2ZK61FGK13miBHRA","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"i8fJhAD9QE-arHRoV0FsCA","stars":3,"date":"2016-12-27","text":"I like the idea and it's kind of fun since it's a little different, but I definitely spent an arm and half a leg for it. 2 kids + 1 adult and $50 later... Also, the servers were super friendly, but my first server (there were several) got 2 things on my order wrong. I would let one mistake slide, but 2 is too many. Also, the ordering method is a little archaic. It would be awesome if they had mobile devices at each table so you could just order that way instead of hand-writing your own order on a piece of paper. It's not that difficult but sometimes it takes time for your server to notice your paper order standing there. Overall experience was fun, but it wouldn't be something I do a lot.","useful":0,"funny":0,"cool":0},
{"review_id":"7zrF2bxpsI9n70YTSItOqw","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"SVhM3Pxjw-PUPr1sBghqlw","stars":1,"date":"2015-08-28","text":"Had an appointment at SimonMed today. I walked in and of course the waiting room was packed with about 15 people waiting. I filled out my paperwork and gave it to the person at the desk with my insurance card. 20 minutes later they still hadn't called my name to return my card even though they'd taken about 4 other people who came in after me. I checked with the desk and the lady said someone was processing me. So I waited another 20 minutes and went back to the desk. I asked if they thought they might get to me soon since I had somewhere I needed to be in 20 minutes. The lady said they were running at a 40 minute wait time (instead of their usual 25 which is already ridiculous) and there were also 3 people ahead of me. I'd already been there 40 minutes so I was done. I told her I would just reschedule and come back if she could just return my insurance card. But guess what they couldn't find? After she spent 5 minutes looking for my card and asking other employees if they'd seen it, I told her to forget it and left. Total waste of time and a frustrating experience.","useful":1,"funny":0,"cool":0},
{"review_id":"lM_Yo9KuJOoE_H9BgdYkKQ","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"hJNfnMZZzxgL_Y0R7o_OTg","stars":2,"date":"2011-01-19","text":"I've gotten good pedicures at White Lotus and since I had been looking for a new hair stylist and with all the great reviews on Yelp, I thought I'd finally try them for hair.\nI went to see Beth and told her that I was looking for a slightly different style since I was bored with what I'd been doing for so long. Unfortunately, I'm not really sure what kind of style she gave me. It ended up looking very choppy in the back - two very drastic layers with no texturing - and then an A-line cut which looked a little goofy since I have shoulder length hair.\nI ended up going to Cassie at Salon G (just down the road) and she fixed my cut and I love it now.","useful":0,"funny":0,"cool":1},
{"review_id":"GHwhVQhrM8AsAwIvsabfQA","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"RYIrHFJLOhxe-VFWgmbpBQ","stars":2,"date":"2017-05-16","text":"As with the other reviewers, we experienced the same flakiness on timing and communication. She showed up 2 hours late for our appointment and didn't text me saying she was on her way until she was already an hour and a half late. She charged $80 to shave my cat and trim her claws which seemed a little steep. The shave looked a little sloppy and our cat is super chill so it's not like it should have been hard to shave her. She also told us our cat (who we'd had less than a week) might have feline HIV based on some spots she saw on the skin and she recommended we take her to Nikki's Place to get checked. This of course concerned us and we asked our own vet who said the tests they ran showed negative. I don't know if this lady was trying to drum up business for Nikki's or if she actually thought there was an issue, but it just seemed weird. Definitely won't use her again but unfortunately there aren't a ton of options for cat groomers.","useful":0,"funny":0,"cool":0},
{"review_id":"cIaEsFqo06zWxZ5LEmM-0A","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"VNxHDIxVqFH4UMzOqWxAlw","stars":2,"date":"2017-08-01","text":"My experience in dealing with this place was mediocre. I went to their web site to schedule an appointment online to have my cat shaved. There were a ton of openings available so I picked the most convenient. Two days later I got an email from them saying they couldn't keep the appointment and they would call me to reschedule. I knew they wouldn't get around to calling me, so I called them and was told their cat groomer was out for a month. I mentioned their site is full of available dates and times, but the response back was a simple \"Sorry.\" It doesn't mean they don't do a good job grooming, but it was obvious the woman on the phone just didn't care and that's a turn off for me.","useful":2,"funny":0,"cool":0},
{"review_id":"xhMM7tXyy2fM-SY4iqNhDg","user_id":"2tOHlIE3sTntIX5DiE3l4w","business_id":"P4lcAvH_JqOIUPyNE5LoJA","stars":3,"date":"2014-08-01","text":"I keep wanting to like this place, but every time I come I am disappointed by something. The food is fairly tasty and different than the typical deli. But for example, today I ordered a BLT and got a sandwich with a bunch of bacon crumbs thrown on it and 2 tiny tomatoes. BLT's I've had here before were not this bad. It's stuff like this which frustrates me about The Spot. It's not consistent. I think they were busy and literally threw my sandwich together. But that's no excuse.","useful":2,"funny":0,"cool":0},
{"review_id":"olIiMhRpewTpmIZqX0QmvQ","user_id":"Xl9tUTgyWKD7TdoznkOEhA","business_id":"vlmMRpgqcGCAElnMmW9dtg","stars":4,"date":"2014-04-20","text":"I have been going to this Chiropractic location for 14 years.  Even though I don't even live in the neighborhood.\n\nThere are 2 Chiropractors on duty. Watson and Barlot.  I have gone too both of them, and recommend both of them.  I have also done graston and ART with both of them.\n\nI have used the Acupuncture and Massage in the past, but have not used them for about 10 years.  As I don't know the staff, and have not used them in a long time, if I needed Acupuncture or a Massage, I would go see someone closer to home.\n\nThe staff in general are very nice, and want to get to know you on a personal level vs. just being a number.\n\nBut I will continue using the Chiropractors, and drive the distance to continue seeing them.","useful":0,"funny":0,"cool":0},
{"review_id":"9xWNjYzFUCLhYIJPAt-W_A","user_id":"9jP8ULfjTf_cLBCYbc76uQ","business_id":"pxv5jBUOgsg6Rf6Z88e4mg","stars":5,"date":"2014-09-06","text":"This place is beyond amazing.  The food is soooooo good.  The service was amazing.  Our waitress was really good and attentive. It was just a great dinning experience.  We love the craft beers here and the view is a topper. We order the Attic wings and the Ivan burger, they were killer.  When in Arcadia must make a stop here.  They caterer to the late crowds on the weekends.  Wednesday are 10$ for a beer and burger deal.  They ask you don't split it, which is fine because it's a deal.  We can't wait to go back.  It really is a hidden spot.","useful":0,"funny":0,"cool":0},
{"review_id":"rFkaclht9Le0xCrQB_5nNg","user_id":"XtiALfUNO-8Xts7A1FnK-Q","business_id":"eAc9Vd6loOgRQolMXQt6FA","stars":1,"date":"2011-03-24","text":"Our stay at Mandalay Bay was such a pain in the ass that I had to let others know what to expect.\n First, when I checked in I found out that they didn't have the room I reserved available - a king bed and a strip view were part of my girlfriend's birthday present, as she had never been to Vegas and I wanted to show her the town from what I thought would be a perfect hotel.  I thought that reserving a room like that over the phone (and even paying for a night up front!) would get me the room I needed but no, there is no way to be sure that you're getting what you want or pay for at this place.\n The check-in procedure took AN HOUR thanks to an incompetent chump and sassy desk manager (she started giving me attitude like it was my fault they didn't have my room available!  wtf?) while my girlfriend sat out in the car, surrounded by drunks, in their driveway.  If that wasn't bad enough, this front desk hassle made us too late for my special birthday dinner!  Where I had a hook-up!  This was the first night in Vegas and already Mandalay Bay was losing me time and money!\n That night, I tried to put our expensive leftovers into a fridge but discovered that the only mini-fridge in the room was full of beverages that you couldn't move or else the computerized weight system would charge you immediately.  So, no fridge!  Even Super 8 has a mini-fridge!  We went to bed that night enraged.\n The next night we ordered $22 nachos from room service (there was a $5 \"cover charge\" ... just another cutthroat fee at this place).  I didn't get the room service guy's name because I was too busy staring at - seriously - LESIONS on his face, neck, and even wrist!  It wasn't acne, it was some kind of exczema or something.  I've never not eaten nachos before in my life, that night was a total waste of food and money.  Why hire room service guys who destroy your appetite!?  Isn't that a health code violation too?\n Finally, I was looking forward to talking to the front desk as I checked out.  The clerk asked the people in front of me \"did you enjoy your stay with us?\" so I figured that would be my opportunity to let Mandalay Bay know that it was really not an accomodating place to stay.  However, the front desk clerk just checked me out without even talking and moved right on to the next in line with cold dead eyes.  I should have stayed and asked for a manager but I was honestly too tired and frustrated to fight.  \n \"Disappointed\" cannot even begin to describe our stay at Mandalay Bay.  I had hoped to take my birthday party there this summer for their awesome pools but there's no way I'm going to put up with their incompetent, scuzzy staff, poor reservation schedule, and counterproductive accomodations.  Thanks for ruining my girlfriend's birthday and first time in Vegas, Mandalay Bay!","useful":0,"funny":0,"cool":0},
{"review_id":"7VV_lZwxJ_6hScT3YtuRkg","user_id":"bfG_h-PhY0qVCKkRnf23Uw","business_id":"fiYqGH-esbPpO-3DnSqVeg","stars":5,"date":"2011-10-18","text":"Divine! These bagels and bialys are so delicious. You will not be disappointed. I can eat these plain they taste that good. Mish mosh and egg are my favorites. You walk in and the smell of fresh made bagels fills the air. They serve these hot off the racks. Highly recommend this place if you would like to treat yourself to the way a real bagel should taste.","useful":1,"funny":0,"cool":0},
{"review_id":"QAMBGgnM3w7PvrhwCToYyw","user_id":"mj0ToH8kS6SNj59wx-lOBA","business_id":"wuMtOi-Q0VPDTVC9O442dA","stars":5,"date":"2017-04-20","text":"Absolutely one of the best experiences I have ever had. Even with the late notice they were able to fit me into their schedule and really understood my situation with the Scorpions and that I couldn't have that with my two-year-old daughter running around. Would highly recommend these guys to anyone out there who's looking for Pest Control. And not that everyone is going to agree with this but it also helps that I find out Brad is a Dallas Cowboys fan .....that was just a bonus....lol.A+++++ service and and very knowledgeable.","useful":0,"funny":1,"cool":0},
{"review_id":"Q0g-RciuaJotF4iCx-XZ9A","user_id":"7EAz1n1PkavKMPKvAc2uIA","business_id":"ze0vTDa1oFIH6oSRWgxM_A","stars":5,"date":"2016-02-25","text":"Great Job Maui!! Very helpful, knowledgeable had my computer fixed in timely manner. I had a 5 yr old dell XPS 8000 with the same parts the computer came with. Haven't made any changes for awhile, suddenly my computer froze. I tried to reboot the system, my computer froze again. I took my computer to ICU Computer Solutions talked to Maui, explained my problem, couple a days, came back the computer was fixed. I was back in business. If your not that Tech-savvy as I am and you need expertise service, I would go with ICU Computer Solutions for any computer problems or upgrades.","useful":1,"funny":0,"cool":1},
{"review_id":"wDZ930sSvSU1KmAJrw-mxA","user_id":"YpDrVlRcKq7Oq9J-74it_A","business_id":"k6hh3LSw68Zyh-J5OPpuJA","stars":2,"date":"2016-09-21","text":"I had called handyman for several jobs that I wanted done? They had called me to arrange everyone to come on same day as I have a crazy work schedual . Even though these appointments were pre booked they cancelled one as the trade had to go to a bigger job. Not cool at all!!! The plumber got tied up so it ended up that both plumber and electricIan came at same time. Duanne Askew the electrician was terrific and finished the job off with a fair price as the lights I picked were not the easiest to install. Plumber was fine but could not give me a quote as the sink I had chosen was not the right size. Said to just call him when I got correct one and he would give me a quote. Since then haven't heard from him at all even though I have left several messages. For me the expierence has been less than satisfactory and I think they only want to do large projects even though their advertising implies that small jobs are top of mind. Will not use again. Can do my own search for trades","useful":0,"funny":0,"cool":0},
{"review_id":"eIT9v-LFqq74Neupj6E-dA","user_id":"YpDrVlRcKq7Oq9J-74it_A","business_id":"ciG7QN_7TQEqtSrQAXpjKw","stars":1,"date":"2017-08-12","text":"I never order anything from brick and mortor store as it is always in the dirtest condition and product is always on floor. staff in this store are just beyond dreadful and their check out line drives me crazy as they never have more than one cashier ringing through. I order everything from this brand on line. it comes in perfect condition with very little wait time. \nVal S","useful":2,"funny":0,"cool":0},
{"review_id":"ZV-IX7hu1c6QJLzdHrHFkw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"bbzU5h4Fr9zDac1KrS-_2Q","stars":2,"date":"2016-02-15","text":"tried 3 types of pierogies:\n\n- bacon and cheddar: tasty! good pierogies, this was the first thing I tried so I was fairly impressed. but then...\n- jerk chicken: dry chicken filling, sauce on the side was just ok. have tasted much better jerk flavoured sauces. but then it got worse:\n- kimchi: weird textured and bland tasting mushroom filling, barely any kimchi on top, and the kimchi wasn't even good. disappointing and definitely not worth my money.\n\nfor $2 a pierogi, I want them all to be good. They should stick with the classic pierogies, in my opinion, the only ones worth eating (which is why they get 2 stars and not 1).","useful":0,"funny":0,"cool":0},
{"review_id":"kZiJVP2bDhRQhoksLJnrKA","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"tuikCn2ljRGN5QHZBnjoqA","stars":2,"date":"2015-10-21","text":"tried the asian dishes, the japanese noodle one has so much sodium! the thai style ones were bland tasting, the peanut sauce noodles was the best of the bunch. the chicken and steak had the texture of those frozen tv dinners (like swanson), but the price for what you get, given it's in prime real estate is ok. i'd prefer to spend my money on better food though.","useful":0,"funny":0,"cool":0},
{"review_id":"-Olz7gqJsNKRdQVPjlBEWg","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"kOFDVcnj-8fd3doIpCQ06A","stars":2,"date":"2016-09-29","text":"I really wanted to like this place and rate it better. \n\nSpacious room with lots of natural light. Sunday morning breakfast for 2, arrived at 9:30 and seated right away. \n\nRoom wasn't full, but at least 5 other tables near us were people who had placed orders and waiting for food. \n\nServer was pleasant and took our order (a skillet and an egg dish (clearly not memorable)). Coffee came after maybe 10mins. Still drinking mine when refills were circling nearby tables. Didn't see this happen the rest of the time I was there (had to flag someone down).\n\nMaybe i should have read more in advance but I was still shocked that it took 50mins to get our food after we ordered. Being able to see the open kitchen and no one looking like they were working very hard was extra frustrating. Our server disappeared after serving the first coffees and at 45mins in, I asked someone about how much longer it might be for the food. There was no apologetic tone or anything out of the ordinary. I went early to avoid waiting but was starving by the time the food arrived.\n\nThe food was tasty and not a bad price for a decent portion. The service, the slowness, not my thing. I can understand leisurely meals or waiting when the room is full or the staff are busting their butts. This wasn't the case. \n\nI likely won't return. But tip for anyone who does - order the scones with your breakfast. Saw other tables get those early on, probably tides you over to distract from the extremely long wait. Don't look at the kitchen either or it may make you question why they can't move any faster than a snail's pace with the cooking","useful":0,"funny":0,"cool":0},
{"review_id":"VGD5LAOUGYMxmYNe0tiSug","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"rl137V_5Hx0cJAV4beVdhA","stars":4,"date":"2015-12-17","text":"yes! made to order corn tortillas, oaxaca cheese in their quesadillas. been here twice and recommend the camarones taco and the campechano taco (sooooo good, great flavours and texture). friendly staff. almost over attentive service at times. the only things preventing a 5 star are i found the guacamole slightly bland, and the horchata a bit too sweet (the one at tacos 101 was better). love the decor as well. wish i lived closer to go more often!","useful":1,"funny":1,"cool":0},
{"review_id":"pk2ObSWHZPQYwd38iVgo2A","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"gd-fV04gMKMz724XM32xQA","stars":4,"date":"2016-11-14","text":"Enjoyed the vibe\nLoved having the option of flights and enough choices on tap\nBeer-battered cheese curds are popular for a reason! Beef stew was great too. \nwanted to give this 5 stars, but out of 7 beers tried, not one was a 'wow'. Will return to try more beers, hoping for a standout, the way I enjoy some of bellwoods IPAs","useful":0,"funny":0,"cool":0},
{"review_id":"6irdkNN2gLzeaNpSdyRs5A","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"2_8_ipfxCRtpXesLdBCqig","stars":5,"date":"2016-09-29","text":"Within a half hour drive of Duo I don't think there's any place with comparable croissants. In fact, when they are super fresh out of the oven and still warm,\nthey are really great. I can't think of many bakeries in the area I can experience that, and the going rate for decent croissants aren't any cheaper elsewhere. \n\nEspresso based coffees are excellent as well.\n\nI haven't had many of their cakes and other pastries but enjoyed the one with chocolate and yuzu. They look beautiful and it's obvious a lot of care and attention is paid to everything made and displayed there.  I will definitely be back to try more!","useful":0,"funny":0,"cool":0},
{"review_id":"J0xeVEMRYoRayDrrjC67RQ","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"A7waf6G3cvnLfAqKeLL8DA","stars":3,"date":"2016-09-29","text":"I'd give this place 3.5 stars if I could. Had been meaning to try the original Buca for a couple years. Finally went on a Friday, sat in the back area, surprisingly not very full. \n\nOur server was semi-helpful with the menu, maybe I didn't ask the right questions. \"Everything is good\" doesn't help much. The sommelier was helpful and narrowed our wine choices down and we were happy with the med-bodied red blend we chose\n\nCocktails to start were decent but not memorable. Charcuterie plate was overpriced for what was served. Flavor was good with the meats but not stand out, portions super skimpy. Next time I would skip charcuterie and try something else like the pig ears \n\nPastas were excellent. Bucatini and the spaghetti. Cooked perfectly, wonderful flavours. Possibly better because I got to try both and enjoyed the contrast. \n\nThe tiramisu dessert wasn't my preference. I like more traditional tiramisu. \n\nHad to ask for water refill twice (and waited to see if one of many people who came by\/bussed\/refilled wine\/checked on how things were going would notice, they never did). The server finally noticed on his own to refill as we were settling up the bill. A simple but important detail like this in a finer dining establishment is very disappointing. \n\nThe space is gorgeous and the pastas as good as people have raved about. I'd return and hope for a better server.","useful":0,"funny":0,"cool":0},
{"review_id":"_9b_bft0sVD-LK1jU6aThg","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"POprbisJ2h4UaESNnPT9hQ","stars":5,"date":"2016-11-14","text":"In a city with very few places offering croissants done right, Mabel's does a pretty good job. Their pecan pie is great for those who love it, and the beef empanada had a flaky, tasty pastry and ample beefy filling. Get it with the chimichurri. \n\nI've got my eye on the baguettes and bagels for my next visit.","useful":0,"funny":0,"cool":0},
{"review_id":"suZKIgwvbFuSgTFS_J1ZZg","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"9pWzjhdrPgsZEmF7-QOaIQ","stars":5,"date":"2016-11-15","text":"Still some of the best tacos! Chicken and fish ones tops, addictive to snack on the chips and salsas. Upping to 5, happy to support a local small biz offering great value for great food :)","useful":0,"funny":0,"cool":0},
{"review_id":"ebgmE4LeWKfvD48tFtA6mw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"uAAWlLdsoUf872F1FKiX1A","stars":2,"date":"2015-11-20","text":"i don't understand the hype.  ok ice cream, ok cookies. terribly inefficient service, which is why there is a lineup.  if they are doing that on purpose to generate hype, I guess it works because in the warmer weather, the line can get ridiculous long.  i'd go again, if there wasn't a lineup, but i'd rather eat ice cream at Sweet Olenka's.","useful":0,"funny":0,"cool":0},
{"review_id":"EierfyYVkvctJXm6yuvllw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"8cr7Kdx1bT51CnKsrWABbw","stars":5,"date":"2015-10-14","text":"the champagne and strawberries crepe cake blew my mind! their gelatos are also amazing, black sesame, and all the khao san road flavours. haven't tried their other cakes, but definitely will for the next special occasion","useful":0,"funny":0,"cool":0},
{"review_id":"jZDL2In70_fkC05gEfHJXw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"B5JCODx4728Ce2Qca1NFHw","stars":4,"date":"2016-02-15","text":"went back for late night snacks a couple weeks ago. surprised to see empty spots on a friday night. my 2 friends and I shared a few things, including the hamachi tartare and the salmon aburi. loved the salmon. cool spot, happy to return again.","useful":0,"funny":0,"cool":0},
{"review_id":"1ansQMOLQqgfPqgoJk17bg","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"tHlJKmUECTlj2amcGG0TOQ","stars":2,"date":"2015-11-26","text":"the staff seemed pleasant enough, until after a lengthy exchange in which I, as a first time visitor, asked about 3 or 4 of the options, and finally made my choice, was then told that the one I wanted they were out of :(  given the staff was at the station preparing another mac and cheese as we spoke, and it wasn't busy, I was very disappointed they didn't tell me up front what they were out of.\n\nand more importantly, after waiting a few minutes while the food was in the oven, I walked the short 4minute walk home to eat a small $7 mac and cheese that was unevenly cooked. some bites were hot, others were lukewarm. if this is all you are selling, it would make sense to make sure the food is thoroughly hot?!\n\ni like the concept and want to return, but not sure it is worth the money.","useful":3,"funny":0,"cool":1},
{"review_id":"dRUI4RAuGAV35X_rHm3KqA","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"ufwkkMd9yr9cFU1R5ONArg","stars":4,"date":"2016-09-01","text":"Cute brunch spot, great service, enjoyed the breakfast sandwich, and bottomless coffee! If it was my neighbourhood I could see eating here more often","useful":1,"funny":0,"cool":0},
{"review_id":"rtrWg3aYwZQu2oBwmX037g","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"uxM2hXYkS9kr-DiQN2lB5g","stars":4,"date":"2016-02-15","text":"great cocktails, enjoyed the ambiance of the place, service was fine. shrimp and grits tasty (a bit rich for me but i went with a group and we shared many dishes). the dumplings with the truffle was amazing (when truffle is used right, it is a glorius eating experience). i would gladly return for more of dumplings for sure.","useful":0,"funny":0,"cool":0},
{"review_id":"6i9isNhoohdH1Hc3qmF4qQ","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"CZxAlrWOD4Mu2K7FoAcRaA","stars":4,"date":"2015-10-14","text":"i had heard about fresh soba for probably years and finally tried it a few weeks ago.  On Tuesdays, we made a reservation earlier in the day, it wasn't busy at all when the 4 of us arrived. I loved the texture of the fresh soba, preferring the one that isn't already in sauce (the sauce makes it a bit mushy over time). The dishes aren't cheap, and they only take cash, but I enjoyed my experience and would go back. It's worth supporting people who are passionate and care to make quality food like this!","useful":1,"funny":0,"cool":2},
{"review_id":"m-Ccj_eX5fEcU9OUlv1Pkw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"hQtGXpMq4gyRWH4s2iNpUQ","stars":3,"date":"2016-02-15","text":"I saw photos of this space from a blogto review and checked it out when i was in the neighbourhood a few weeks ago. it is a cool looking spot. i had a latte, it was good, but not super different than other cafes I frequent.\n\nservice was pleasant, though the guy who was at the register did not have great English, and got confused when I asked if they had decaf espresso, as I didn't see the menu. I was overcharged for a latte and a separate espresso, but the other staff was quick to help with my order so it was resolved without issues.\n\nthe place had individuals spreadout across the room working on laptops, one per table, and spaced out equally on bar seating. they have two chairs next to the entrance which worked fine for me.\n\noverall it was pleasant, but given the location and price for me, I wouldn't go out of my way to return.","useful":0,"funny":0,"cool":0},
{"review_id":"NsB0pbE4ypwYpkNVN0Em7g","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"741v9WSq3BceeRyBLCvF9g","stars":5,"date":"2015-11-20","text":"first off, it surprises me Yunaghi hasn't gotten more good press.  they deserve it. there isn't anyone else doing the same thing in Toronto at that price point. the beautiful composition of each dish takes care and attention to detail. seasonal menus (it was Oct when I went), and options for wine or sake only pairings.  servers were friendly and explained each dish (sometimes a bit challenging to ask more questions but they tried to answer). i would return to see what's on offer next year!","useful":0,"funny":0,"cool":0},
{"review_id":"xkWGKaoR4cJ8137BhWkCuQ","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"piZ4JqJI5WTljJuQV7yZHQ","stars":4,"date":"2016-02-15","text":"i've been to a few Kinton locations, I think the original is still the best! i've tried a number of the broths and enjoyed them all. a satisfying, filling bowl of soupy goodness!","useful":0,"funny":0,"cool":0},
{"review_id":"iFI-YCw-1snTakfaQyTDKQ","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"JsAjP49bCk9KjJmmmjyM4w","stars":3,"date":"2015-11-20","text":"the staff i've interacted with have all been nice. avoid the regular croissant - it's as bad as a supermarket one. the chocolate croissant was better, but there are other places for better. the other croissants with different fillings looked like they could be promising but i haven't tried them. i'd likely save my money for croissants and go further (Patisserie 27 further west is good)","useful":0,"funny":0,"cool":0},
{"review_id":"G7zosP95IRVmkMFDPSpcmA","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"9qcuLH2jjANhXiKHs9oTsw","stars":5,"date":"2015-09-08","text":"love all the SJCB, this one is closest to home. i love that they offer almond milk as an option. drinks are always solid and the baristas are always friendly and cool.","useful":0,"funny":0,"cool":0},
{"review_id":"6--HU9B-PatvQuYXIsoINw","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"WlkOFaqRL5vtYZZ7fl4x1Q","stars":4,"date":"2015-11-20","text":"cute spot - like the atmosphere, super nice staff. good place to grab a drink. wasn't planning to eat, but the place got busy as the night went on, and not wanting to switch venues it was convenient to have decent options to go with our beers  (tried the bean and cheese dip, and the potato and fish cakes, decent, but if i get food next time, would try something else).","useful":0,"funny":0,"cool":0},
{"review_id":"Gjt8aAkGWGAvCaYcguyRUA","user_id":"vexkrpa0-IAZ_j5z7ZJyxg","business_id":"mFBZcwkHuys0pbyBGOhKoQ","stars":3,"date":"2016-02-15","text":"chicken is good, i like the power flock and frenchie flock. \nservice is slow, it's like they can't properly manage the flow of orders.\n\nthe handful of times I have ordered there, it has taken at least 10 min wait (and not during prime lunch or dinner time). i'm not ordering something very complicated - a bowl that is an assembly of salad ingredients, a dressing from a squeeze bottle and pieces of chicken on top.\n\npaying $17-18 for a chicken salad, and having to wait that long isn't what I consider good value. it's tasty enough that I won't write them off, but I won't be ordering it often, and will try calling ahead to reduce my wait time, hopefully they will be able to work out some of the timing on the orders.","useful":0,"funny":0,"cool":0},
{"review_id":"gICNSAHpWqDK8sjvIDbtWg","user_id":"P4uc45ola_JMqjFT3JoYuQ","business_id":"wRQ4IUdDs-pheChmrNJSrg","stars":5,"date":"2016-03-03","text":"I couldn't be more happy with my experience at Pure Facials.  I went in for a free consultation regarding lip injections and met with Dr Denise Curtis.  She answered every question I had and her knowledge and confidence is what led me to go ahead with the procedure.  When I say she is top of the line I'm not kidding!  I am now three days out from receiving my filler and I couldn't be more pleased with the results!  Very natural looking.  Very little pain and bruising.  I would highly recommend her services to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"zIIOED75VoT068WcTBPT7A","user_id":"8H5TOjBwG_nOzAdg9yGCCQ","business_id":"TT658qQinO6MBHP9q7rJ8w","stars":5,"date":"2016-05-20","text":"The food here is AMAZING!! This was the first time in a long time I ordered a second round of appetizers. The patio dining is beautiful and comfortable. The staff is very friendly...server was extremely cute too.\n\nIf you are looking for New Orleans style food this is the place!!!\n\n***anyone who goes to a restaurant on Mother's Day or any other major dine out holiday without a reservation is an idiot***","useful":1,"funny":0,"cool":0},
{"review_id":"3F8Sb5EMhtkhG7atIRMLqQ","user_id":"Q-z64O1ia_8kPQBvgvj5TA","business_id":"fL-b760btOaGa85OJ9ut3w","stars":2,"date":"2015-04-29","text":"I visited this restaurant at the end of March because I heard the food was great. I was very disappointed with the customer service. The cashier Caleb was not very friendly as he greeted me .  No smile or have a nice day in fact he didn't seem too pleased to take my order.  The waitress Jessica also wasn't friendly . There was no kind word or smile as she shoved my food into my hands. Never once did I hear , \"have a nice day or thank you \"  The food was great but the customer service didn't make me want to return .  I visited a place called Yardbird and all their staff smiled and said , Hi .  As I left Yardbird every staff member I came across smiled and said , thank u for coming, have a good day or come back and see us as they smiled .  I felt more welcomed and appreciated at Yardbird.  Good Customer service is very important to me.","useful":0,"funny":0,"cool":0},
{"review_id":"_1fT99jruYQaIyqjduyFyQ","user_id":"oNPHUSj4dZn5dsm7VBhvLA","business_id":"-Ca6Hx-G1kOR8ycPRybr5A","stars":1,"date":"2016-05-27","text":"If there was 0 star option this is what this dealer would get. My nightmare began after getting the car delivered from this dealer. I asked that they be careful with my car and the initial promises were all good and they'll take care of it. I received the car and the bottom bumper was scratched and neither the dealer nor the shipping company they used took responsibility for the damage even though they all promised they'll get it taken care of. Then comes the paperwork, they were behind on getting their registration paperwork to my local DMV and after 2 months finally get it through and because of that I was charged with 400 in late penalties in getting my car registered and not including the temporary tags I had to pay for so I can drive the car in Texas. None of them will return your phone calls and you'd be lucky to get a hold of them, including all the managers. The finance manager promised to pay for my temporary tags and I received nothing. I would not recommend buying from them if you're out of state and good luck after the purchase, they're quick and grabbing your money but the service is horrible. This is one of the reasons why I will never own a BMW.","useful":0,"funny":0,"cool":0},
{"review_id":"1XOQ7T_FYgpkQNZt2lT_Qg","user_id":"gJ6iIcLnwKOkBHcCeJYeLw","business_id":"g2F3S8pxuRZdVNo_wnBa3w","stars":1,"date":"2016-01-07","text":"On the advice of a friend, I went to this place early in the day just before the holidays for a special treat of shellac mani and pedi. I don't do these often, as it is not in the family budget, so I was looking forward to it. And the place looked nice and shiny inside. Well, I was completely disappointed with the results. First, the pedi.The \"spa pedi\" I asked for didn't include the removal of dead skin cells with the razor or other scraping tool. The woman gave my feet a quick 10 second brush with a pink pumice and then on to the \"massage\" she prided herself on, which lasted for a whole 60 seconds at best and was nothing special. That was a huge disappointment, as this is one of the parts of a pedicure it's hard to pull off at home. I am prone to having ingrowns, so I was VERY specific that the woman should cut straight across for the pedi, leaving the corners alone! Well, she cut the nails straight across, but then she got fierce with the nail nipper. Before I even knew what she was doing, she had cut at a diagonal on the corners of one of my big toes. Worse, when I got home, I realized that she had actually visibly CUT the cuticle on the side of that same toe, further down. And I had to treat it with antibacterial ointment for several days before the pain and swelling subsided. Also, I noticed that the tools she used seem to be in her own personal toolbox, which was fine, but I have no idea if they were floating around in water or in some sort of antibacterial solution. I am praying it was the latter. [Note to self: next time look for a place that assigns you your own set of tools and stores them for you or clearly shows you how their tools are kept clean] As for the shellac mani, the woman piled on so much and so many layers of polish that it looked and felt as if I was actually wearing fake nails! And the so-called \"2 weeks at least\" shellac manicure lasted a whole of four days before the shellac bubbled at the edges and began coming off of the nails in large swathes.  Never again.","useful":1,"funny":0,"cool":1},
{"review_id":"HHos4cWRIVLLlcW3cUAzDw","user_id":"gJ6iIcLnwKOkBHcCeJYeLw","business_id":"Y9TialvINU0jf0GXaCXuiA","stars":5,"date":"2017-12-28","text":"Great cocktails! Fab beer fridge. And awesome VHS projection. Also, they give a shit about making sure people feel comfortable in their own skin...(Signage in the loo.)","useful":0,"funny":0,"cool":0},
{"review_id":"51urVps2lcJ-qhbzIxw4JQ","user_id":"gJ6iIcLnwKOkBHcCeJYeLw","business_id":"mjex91FZ2b5Khh4YDK4-9g","stars":5,"date":"2017-12-28","text":"Best Americano evah! And the breakfast sandwich is amaazing. Not to mention the awesome owners and friendly staff...","useful":0,"funny":0,"cool":0},
{"review_id":"4EUGaAYouMXz1E720dFRBw","user_id":"gJ6iIcLnwKOkBHcCeJYeLw","business_id":"Yn0SgBd6svamaEOtM8RBWw","stars":4,"date":"2017-12-28","text":"Love that they use hard wax! Smells a bit too much like oranges in there...but the aestheticians are all fab. Would have given 4.5 stars, but where's the half?","useful":1,"funny":1,"cool":0},
{"review_id":"h4oq0PbwcOzaHPji2hblFA","user_id":"gJ6iIcLnwKOkBHcCeJYeLw","business_id":"BfZgUIMJgEu2Y4tLQKu46g","stars":1,"date":"2017-12-28","text":"No, No, No and NO!!!  I'd been going to this location for some time, though their services were a bit pricy, because I liked the cleanliness and modern look of the place. Waxing and shellac manis, mostly, and holiday pedis that were meh at best. (Despite my asking for specific toe nail grooming due to previous injury, they tried to pressure me into doing it \"their way,\" which made me feel uncomfortable.) But, my real disappointment began when they started trying to sell stuff to my young teenage daughter in my absence. More than once, I'd come in to pay for my 13 year old's service, and they'd have a line-up of supposedly luxe \"teen\" skincare products (some of them for blemishes, etc) at the register which she told me she felt pressured into approving of. And, more than once, I had to tell them absolutely not. She was coming in for basic grooming, services that were for fun, not to be told\/to have it implied that she was inadquate in any way. And NO WAY you should be asking a minor to make purchases.lWe will NOT be returning.","useful":0,"funny":0,"cool":0},
{"review_id":"3GUUOMLXmjXg9SyJ1dIW0w","user_id":"8ooGRxoD7F7Tn1lkcoF0Ig","business_id":"OHFH6ALQqq35NiEbD1eXuw","stars":4,"date":"2011-06-21","text":"I was looking for a dim sum place while in Las Vegas and decided to check this place out after reading the reviews. I must say, I was definitely not disappointed.\n\nThe dim sum selection and taste is by far the best I've ever tasted in US. It was a pity that it was just 2 of us and we could only stomach that much food. I would have loved to try more.\n\nMy top top favorites:\n- The egg tarts (they taste just like those you'd find in HK). We had 3 plates of that and I wish I could pack to bring home but they wouldn't taste as nice then. \n\n- The soya beancurd is so smooth and the ginger taste is very subtle that blends in with the beancurd. I've tasted the soya beancurd in another restaurant and it was just too gingery. We ordered additional 2 portions to go and had them chilled when we reached home. They tasted just as great chilled & warm.\n\n- Chives dumplings were also good.\n\nI would definitely visit this restaurant when I head to LV again. Service was also decent. Carts of dim sum were being pushed around the whole restaurant.","useful":0,"funny":0,"cool":0},
{"review_id":"T6Fi4vO07585XVhJKt-ryQ","user_id":"r1yGSK0QGdXmIFJIy-RfZQ","business_id":"7rHrKkouOYatJycqbobGOA","stars":5,"date":"2016-11-27","text":"1st time there and I am happy to let Denise work on my hair. She is awesome and work with me busy schedule. Thank you Denise for coming in Sunday. You are life saver.","useful":1,"funny":0,"cool":0},
{"review_id":"E0kxJqQLNR7ebSuTdIVvjA","user_id":"jied6iDthSbNjw0bopOwTQ","business_id":"t0sNE-tm2dFvRlbTGTA7Ew","stars":5,"date":"2016-09-10","text":"We called Bryan when we had a mold problem that nobody could seem to find the source of. He spent the time to look over everything we had had done already, came to the house, spent almost two hours walking through and highlighting things to us, explaining the significance, etc. Then he gave us detailed information about what he would do, what things to watch out for, and what he would do in the meantime. The thing that impressed us the most is he didn't charge for any of it and even told us things that we could do (e.g., renting air movers from Home Depot instead of from him) that would be more convenient for us but lose him money. I wish everyone could be like Bryan - awesome service and great explanations. Definitely seems way more above board than some of the more popular mold remediation outfits.","useful":1,"funny":17,"cool":0},
{"review_id":"bbbyt89ANeV70H7l9ubd9A","user_id":"jied6iDthSbNjw0bopOwTQ","business_id":"DoI7_AHYM7HICjQhu3Ybig","stars":2,"date":"2016-09-10","text":"We contacted Daryl initially to help us identify\/address a source of a moldy smell in our home.  He had extraordinary reviews, so we provide this one just to present our different experience.\n\nHe was immediately reachable, very prompt with arranging a home visit, and always very confident in his assertions.  While his speed in identifying our problem and readiness to discuss his (possibly excellent) credentials repeatedly would be a positive to many, we felt that he reached his conclusions a bit TOO quickly and mentioned his background and all his competitors' inadequacies TOO frequently.  Possibly just a clash of personalities, but...\n\nWe weren't feeling confident in the diagnosis and remediation he proposed and looked for another opinion just to do our due diligence (but we are certainly NOT experts).  We subsequently learned of a few red flags:  \n(1)  MoldEx does their own specimen collection (not the actual testing, though) which other contractors believe is a conflict of interest (i.e., there's an incentive to find a problem and to prove that the work has resolved it).\n(2)  A more thorough inspection revealed an entirely different source for our moldy smell which would NOT have been addressed had we gone with the MoldEx remediation plan.\n\nDuring this process (before we found what is likely the right source), we contacted Daryl to ask a few follow-up questions, planning to hire him.  I must have given him the (totally incorrect) impression that other contractors were standing by to do the work for us, because his brief response was that he was busy and must pass on our job.  \"I'm sure the people providing you with this information will be more than happy to take care of you\", he replied.  We took this to mean that he was offended by our potentially getting other opinions.  We felt rather put off and left a fairly scathing review.  Next day he called to inquire about it (I appreciated that).  I explained what our concerns were and that we did not, in fact, have any other options available to us.  I revisited my questions with him; he told me he'd talk if I took down the review (I was unimpressed with that).  He called the next day when I hadn't, then tracked down my spouse's work number and left a message there.  We were left with a fairly sour taste.","useful":15,"funny":41,"cool":0},
{"review_id":"_L23IFX1DAXdDHAoIEJO6A","user_id":"EPv1yOOUEdpcyZwdSkkw0Q","business_id":"gim65qnPAaU_l7nU1ntvsQ","stars":1,"date":"2017-03-18","text":"Worst service, they act as if it's a privilege to shop their. Cashiers are rude and not polite. I will never go back!","useful":1,"funny":1,"cool":0},
{"review_id":"r7g6JHccs_M1tz3BeH4t9g","user_id":"EPv1yOOUEdpcyZwdSkkw0Q","business_id":"mlTjJC4cIH8dn9h1S378Iw","stars":5,"date":"2016-04-06","text":"Dr Fausett and the entire staff was great.  Very pleasant and knowledgable.  He helped fix what another doctor did. Amazing, clean, and quick.","useful":0,"funny":0,"cool":0},
{"review_id":"p7XtZENPgCcnL9zhV0ENEw","user_id":"tNxFSTdsUtXNwifkJbqw5Q","business_id":"bBTDYwWFBno1bJ1R4TeBJw","stars":5,"date":"2013-11-01","text":"After looking at about 15 different apartments in Phoenix and Scottsdale, I have found my home. After taking a tour of Broadstone camelback I couldn't imagine living any place else. The location is perfect, the apartments are fantastic, and staff is very friendly and super helpful. I can't wait to move into my new apartment.","useful":0,"funny":0,"cool":0},
{"review_id":"IeM_dUHpvmUhlSc9iQm6uA","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"yqqXDVl7ZJaiDDbuCFXqMg","stars":4,"date":"2014-08-30","text":"When they're good they're great. Service was awesome. Mac n cheese was amazing, my husband liked the brisket, wedge salad was pretty good. They give a free half order of onion rings to first timers. They also had no issue brining samples of the sauces so my husband could decide which he liked. Their North Carolina BBQ was pretty awful though. And we weren't terribly impressed by the spinach artichoke dip.","useful":0,"funny":0,"cool":0},
{"review_id":"RTkyzkRR1mnbI7S4WvjTyQ","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"FJ4SYm6u4GbhkkXXnjYPcg","stars":5,"date":"2014-08-30","text":"Fantastic! Seats were awesome and the bathrooms were clean-ish. Didn't use the concessions. Love love love the reclining seats. Made it so much more enjoyable!","useful":0,"funny":0,"cool":0},
{"review_id":"Jdd3EPL1f9uD91BORKmcpg","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"-Dnh48f029YNugtMKkkI-Q","stars":5,"date":"2014-08-30","text":"Their marinara is fantastic. We all thought the food was great. The place is a little small though. Bonus points for the area- some cool shops nearby.","useful":1,"funny":0,"cool":1},
{"review_id":"IFXCLHrvjOOcu11Y46_mlQ","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"29e_OB7jRf7-5Tdn7_bd_g","stars":1,"date":"2014-08-30","text":"I should've heeded the warning reviews. It's August in Phoenix and my AC in my car quit working. They made an appointment with me Friday over the phone to diagnose the problem and warned me since I had an after market warranty they might not be able to get in touch with them on a Saturday but that they would try. They said the earliest they could get me in was 1. I showed up at 1 and they told me they had two hours of oil changes ahead of me and that they could keep it until Tuesday and look at it then. I work during the week- hence why I made an appointment for a Saturday. I asked why they made an appointment with me if they didn't have time to look at my car and they said they didn't know and they weren't sure who I spoke to. I told them the person I spoke to said their name was josh, but josh claimed he never spoke to me. Massive waste of time since not only did they not fix my car or even look at it they made the appointment so late it's impossible to me find another shop who can work with me today!","useful":4,"funny":0,"cool":0},
{"review_id":"CdmB6S9aJDLH-SgBEQEF_g","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"eaPLZezIMILiG2rStpqfjA","stars":1,"date":"2014-05-28","text":"Their customer service sucks. They didn't seem to have a great selection to choose from. They also don't offer much in the way of public service. They were also inconsistent about what they do offer. Over the phone I was told I could use a scanner (because they have it and it doesn't cost them anything) when I came in they told me to try staples.","useful":2,"funny":2,"cool":0},
{"review_id":"6QG-mMzJGxWk5DJmBDzdgg","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"lpD3xIYuVaQA8xRSlKwn-Q","stars":5,"date":"2015-05-03","text":"The salsa was delicious and super fresh! The chips were nice and warm. The manager was on it! He was not only checking up on his employees he was helping out! Our server Joe was great, even though he was in a hurry he checked on us regularly. The dinner portions were slightly smaller than expected, but my husband and I liked our pollo especial fundido, and chicken chimi with fundido sauce (even though the fundido was much spicier than expected since we're used to garcia's fundido). My mother in law was not impressed with the chile rellenos as she thought it needed cheese. Didn't try the drinks or desserts this time but will definitely be back!","useful":1,"funny":0,"cool":0},
{"review_id":"lAyx-fW6ROJzZbgiX_lS1A","user_id":"HYrFRSlJbCDhUX31GWLiCA","business_id":"B6ITkZ36EJ7_Yjd7l3PdMQ","stars":4,"date":"2015-05-03","text":"They were supposed to show up between 12 and 2. We had already moved out and the office had to let them in. We called at 3 to confirm that they came because our lease required us to have the carpets professionally cleaned before move out inspection which was the next afternoon. They had not shown up and said they would be there around 6 pm. The office closes at 5:30 and we were an hour away. He said he'd come first thing the next morning (which he did), and upsold me on conditioning the living room because it all looked like a high traffic area $20 and $35 to remove an un identifiable red stain the size of my head (if it wasn't done to the apartments satisfaction they would've charged us to do the whole thing again). I didn't get to go to the move out inspection but my husband said the carpet looked brand new and that the inspector used a black light to examine the carpet (we have a cat), and the only thing that showed on the carpet was some detergent which they didn't care about. \n\nTL;DR? They didn't show up on time, they did upsell, but they did do a fantastic job! If not in a hurry I would use them again.","useful":0,"funny":1,"cool":0},
{"review_id":"npKnwFm53uSnLDI8AQIjhg","user_id":"TIwbzlcPzq_xJvcufzutSQ","business_id":"TCoBE_BkDRrK0bWrh5VueQ","stars":1,"date":"2014-05-18","text":"Do not EVER eat here!!! Or the tacos at least. I went with a friend of mine and her sister. I got tacos and they got other menu items. I am just getting over a 36hr food poisoning! The food wasn't even that good. I have had way better tacos. The people I went with weren't impressed either. Do not waste your time or risk your health at this place!","useful":1,"funny":1,"cool":1},
{"review_id":"Efdw5F1DB_xV4A2uxUidTg","user_id":"mJEuU99CjHfVQhCbfIGOtA","business_id":"07AZL5XenCQ_-op_onKLdw","stars":5,"date":"2014-06-18","text":"Larell, Stephanie and Bia were incredible bartenders. They truly made the experience one of a kind. The food was amazing.  Double smoked bacon,  tuna tartar and duck liver (compliments of the chef)  were amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"Bk0lUP8FuJhwvwuUETKr3Q","user_id":"_O9uuFfVgUSwuoTa9Vb4fQ","business_id":"Ay34xZOFax3X23zaA3nwdg","stars":1,"date":"2017-03-13","text":"Stopped in today for lunch. Every previous experience has been great. Today was terrible. I walked in and sat down. The waitress kept on looking at my table and walking to other tables around me. After about 10 minutes the waitress asked if I was waiting for someone and I said no that I was alone. I ordered some water and she brought me some and the menu. I was ready to order right away and as I was talking to her she turned and walked away. I sat and waited as other patrons came in and sat down. The owner tended to them and the same waitress brought them their drinks and began to take their orders. I kept on waiting patiently for her to stop by but she proceeded to clear empty tables as well as ask other tables about their meals and if they needed anything.  After 25 minutes I decided to leave since nearly half of my lunch hour had passed with no true service.","useful":3,"funny":0,"cool":0},
{"review_id":"43u2f3AiktyRT8wUVCgJnw","user_id":"_O9uuFfVgUSwuoTa9Vb4fQ","business_id":"bdPJYc4dx48FcgHSBD1swA","stars":1,"date":"2013-12-30","text":"I own a 2006 Hyundai Sonata and love my car. I have been wanting to go in and purchase a second Sonata from Centennial Hyundai but after reading all of these reviews of the Sahara location I have serious reservations in doing so now. First impressions are everything but follow up and continued customer care after a big purchase are an absolute necessity. Despite the positive there are an alarming amount of negative reviews I feel I may steer clear of these dealerships even if there has been a change in ownership.","useful":0,"funny":0,"cool":0},
{"review_id":"pPuw28_LBmzuh1fSmPv8Yg","user_id":"_O9uuFfVgUSwuoTa9Vb4fQ","business_id":"ZPwx7ktiVluGFVg0L05n5A","stars":5,"date":"2017-03-13","text":"Excellent service and great food. Order the parrillada for a good variety of the meats they have to offer. The empanadas are delicious along with the sandwiches de miga.","useful":0,"funny":0,"cool":0},
{"review_id":"WVSQxZ3d5lJ25h_UgAoEIQ","user_id":"_O9uuFfVgUSwuoTa9Vb4fQ","business_id":"a2leVC69VaflWRREkr7RNg","stars":5,"date":"2017-12-28","text":"Shane was very polite. The company was willing to work on price. Shane arrived promptly. I loved that technician information and a profile picture was sent via text in advance. Shane was very knowledgeable and accommodating. Thank you for the service!","useful":0,"funny":0,"cool":0},
{"review_id":"HuFfLv_BJ_oiC6myFQ1fUg","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"1dhPgc7E7IzzpxjHM2LphQ","stars":3,"date":"2013-04-04","text":"If you want to eat at a restaurant that proudly advertises its attempt to shoehorn an entire Thanksgiving dinner into a burrito (truly a unique contribution to the obesity epidemic) then this might be the spot for you.\n\nOtherwise it's pretty medicore tex-mex.","useful":0,"funny":1,"cool":0},
{"review_id":"3TnYquPAShbJ6TbBM3ST3Q","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"bLi48v8Div6Qm2Fyaw0C6Q","stars":4,"date":"2013-04-08","text":"It's not too often that you order a burger and end up with a three course meal.  It's even less often that all three of those courses turn out to be good!\n\nOn a course-by-course basis;\n\nThe tater tots were tasty; light, fluffy, and delicious with the accompanying aioli.\n\nThe signature Hodge Burger was good, but not great.  The ingredients went well together, but the overall experience wasn't one that has stuck with me.  It was certainly well above average, but not outstanding, and not something I would go out of my way to sample.  The kitchen did cook the meat perfectly, which was a plus.\n\nThe cornbread was INCREDIBLE.  I don't particularly like cornbread; it's never been my thing.  I generally avoid it if I can.  But the cornbread at Hodge's- it's to die for, especially with the maple bourbon butter.  OH MY GOD.\n\nI would bring a companion here just so I could watch their face as they have the joy of sampling the cornbread for the first time.","useful":0,"funny":0,"cool":0},
{"review_id":"T-8c5_PK0g3t7Oaw3UpZwg","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"9MnbQg7kfb_WgxoV0hXKSQ","stars":4,"date":"2013-05-09","text":"Great little spot!  Cute and appropriately grungy location (love the building and signage), great food (burnt-end sandwich, YUM!), and a good selection of beers.  Delicious house barbecue sauce.\n\nThe chips and salsa were mediocre, but they're not why I stopped by.","useful":0,"funny":0,"cool":0},
{"review_id":"-w3K0UEq1gQRizBVOY4NlQ","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"5REYrZfsX3m4E3FTwovp5Q","stars":5,"date":"2013-04-04","text":"Pittsburgh has a serious lack of quality ethnic food choices, and Seviche is without question the best of the available options.\n\nHaving said that, Seviche is a worthwhile destination in its own right.\n\nThe ceviche bar is unique, and the recommendations of the staff were on-point.  The sauce \/ fish combinations that I chose were excellent.  I also ended up ordering a  bocadillo, which was full of flavor, perfectly balanced, and filling.  The kitchen sent out some complementary tapas towards the end of the evening which, though I don't remember what they were, were also delicious.\n\nThe wait staff was delightful, and kept me engaged the whole evening.\n\nThe beer menu is lacking, and they only have bottles.  It's definitely more of a wine and cocktail type of restaurant.\n\nI'm tempted to dock a star because the music was obnoxiously loud by the end of the evening, but the overall experience was so outstanding that I'm happy to overlook it.","useful":0,"funny":0,"cool":0},
{"review_id":"Ai8165xBlf5Fn7UGVYJLMg","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"Ul6JwluSTm12PVDIqnNaTg","stars":3,"date":"2013-05-09","text":"I stopped by Kaya in my search for an amazing burger in Pittsburgh (spoiler: Winghart's won by a mile).  The Kaya burger looked unique and delicious, so I set out across town to try one.\n\nMaybe it was the beef (which did arrive cooked perfectly), or maybe it was just that the kaya sauce just didn't jive with the fried egg, pickles, and avocado.  Whatever it was, while I enjoyed the burger (great bun, and delicious fries), it didn't WOW me like I had hoped it would.\n\nThe interior is super cute, and the service was good though the kitchen was slow.  That gave me more time to drink, which is always fine, though Kaya's bar was a little on the light side for worthwhile beers.\n\n3.5 stars, rounded down, but I will without question be stopping by Kaya next time I'm through Pittsburgh to try some of their other menu items.  I expect great things.","useful":0,"funny":0,"cool":0},
{"review_id":"Ru30N8rcAUTI1tO-uTOXuw","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"G7LYpILnHveyvbg3sJePPw","stars":3,"date":"2015-07-22","text":"I'm not really clear on what's going on with L'Entrepôt. The food is pretty good - and plentiful! But the drinks menu is something out of a terrible college bar. The mixed drinks are bad. Really bad. Like, *really bad*. And weak. Should I find myself back in Montreal, I would definitely stop by L'Entrepôt again - it's cute, and fun, and poppin', but I'd definitely stick to shots or beer if I was drinking alongside my massive $5 sandwich.","useful":1,"funny":0,"cool":1},
{"review_id":"5T8GEm1kuBBtjFdfx3mozA","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"5h7ra0kJKswSZEzbFSIpaw","stars":5,"date":"2013-04-04","text":"Okay, it's a little grungy, but that's how a coffee shop in a grungy neighborhood should be.  The employee that helped me was a bit hippydippy, which fit in perfectly with the atmosphere of the place.  It's about as genuine and unpretentious of a hole in the wall hipster coffeehouse as I've ever been to.  I mean, according to a conversation that I had, Beehive hosts a periodic dance party where customers bring in vinyl and they just kind of play whatever and have a good time.\n\nPerfect.","useful":1,"funny":1,"cool":0},
{"review_id":"JBGADg9Jz-jYyCZpT0JKBQ","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"oPvYovnl06fy5W0e51zjMQ","stars":5,"date":"2013-04-04","text":"The Shipwreck Burger is the second best burger I've had in the United States, without question.  Believe the hype.\n\nI came to this location because the Market Square shop was undergoing major renovations and was closed for several weeks.  I'm glad I did; I absolutely love the neighborhood, which Winghart's blends right in to.  The seedy interior was complementary to the food, which came from the kitchen perfectly cooked- medium rare, of course!\n\nI stopped by during lunch, and while the place was disconcertingly empty, the waitstaff was pleasant and attentive, and took the time to chat with myself and my coworker.\n\nThey have a pretty well-stocked bar, and next time I'm in the area I'll make sure to take advantage of it.","useful":1,"funny":0,"cool":0},
{"review_id":"GFkzqycFeugd1aDdUs-gwA","user_id":"OxE0QBa6m1399S8BXigIsg","business_id":"0wca-OLqtMV8Ebp-W2du0g","stars":5,"date":"2013-04-05","text":"I popped in to the Frick because, well, why not?  I had the afternoon free and the weather was beautiful.\n\nSure, it's not MOMA, or the Met, or LACMA.  What were you expecting?  But what the main collection lacks in cachet, it makes up for with its outstanding curators.  I can't rave enough about how friendly and knowledgeable the staff are.  They went out of their way to describe the history and intricacies of each work of art.  It made even the most average of pieces come alive.\n\nThe car collection was amazing, and the staff in the outbuilding were equally helpful.  The gentleman that I spoke with went through the collection car by car, giving an enormous amount of detail and history for each vehicle.  It made what would have been an average visit fantastic.\n\nI didn't have a chance to do the tour of the mansion, but I did walk around the grounds, and they're perfect to while away some free time on a nice day.","useful":1,"funny":0,"cool":1},
{"review_id":"MsEG7BWLo63-1vCVEIsp4w","user_id":"t7znPy9U9B4hFbvpZ6oOtQ","business_id":"iRhB506lbc0kU5289zyHzg","stars":3,"date":"2013-07-12","text":"Solid choice for airport fare. Stopped in for breakfast before a flight. I ordered the pulled pork breakfast burrito. The pork was tender and flavorful. The ingredients weren't mixed well, however, and I had pockets of eggs, cheese and cilantro clumped throughout. I wish they were more evenly distributed. The homefry style potatoes were top notch, crispy but not dry. \n\nStaff was attentive and upbeat even early in the morning. \n\nHeavy rock and roll music was a bit odd for the AM.","useful":0,"funny":0,"cool":0},
{"review_id":"BrhYJdABj4c2-voC6vxyRA","user_id":"NnXWALyMq2k4mrESPbA-kA","business_id":"wEisic-u9Yj543iYzfpAhw","stars":5,"date":"2011-04-04","text":"BEST MEXICAN IN TOWN!!!!!  Been coming here for years, fresh chips and salsa.  Tacos are fabulous,  but everything is good.","useful":0,"funny":0,"cool":1},
{"review_id":"-77TOIFojK-tC6lDwlUQ-A","user_id":"iDFGH32ATJJGFhNU9CIUvA","business_id":"KTtqAhOYvh-8H5V-aiq9Aw","stars":5,"date":"2013-04-26","text":"My mom and I passed through Paraphernalia Boutique on our way from San Diego to New Hampshire, and she purchased a heavy hitter that she eventually gave to me as a Chanukah present. Chris has been fantastic about offering advice regarding upkeep, replace malfunctioning atomizers, and even sending the replacement parts to me in Ohio (where I attend college). Definitely a shop I would stop at again if I'm ever in Phoenix! Very cool decor too, and some of their jars are fantastic (I personally love the vacu-seal doob tubes that came with the heavy hitter).","useful":3,"funny":0,"cool":1},
{"review_id":"epYmB67MG7NkuAbmCUKplA","user_id":"lNlebhXrvf_WSxOhCNaePA","business_id":"kp9IG_6UDGFn8HxlIDBusQ","stars":5,"date":"2017-03-14","text":"It has really good food and fancy restaurant it is really pretty I like eating on the Patio we are definitely coming back A pretty fountain And party room","useful":0,"funny":0,"cool":0},
{"review_id":"ZkZiw6AZmOYgHGKzk7NMrw","user_id":"rQV9rfDlBzpkp22lGBQZBQ","business_id":"RKbdi2YlZhS5nc7Q4os7HA","stars":5,"date":"2016-06-14","text":"We have been going to Curtsinger for 3 years now. Dr. Curtsinger is knowledgeable and willing to explain medications, animal health, and any other questions that arise. He will take the time necessary to discuss your animal's health. He is friendly and accommodating. His prices are reasonable. The front desk ladies are always nice & welcoming to us when we arrive. I highly recommend his office.","useful":0,"funny":0,"cool":0},
{"review_id":"FS1KfSajjiTyF_lFrerH_A","user_id":"rQV9rfDlBzpkp22lGBQZBQ","business_id":"nPB_oUbkXcgOiLYVmYrjog","stars":5,"date":"2016-11-13","text":"I ordered my first carry out GF meal from Jim 'N' Nick's today. The cashier was new to food allergies, and didn't know many answers to my questions. However, she was eager to learn, asked the chefs, and the manager to be sure she answered all of my GF questions. She found the food allergy listing and walked me through the items available. She went above and beyond to learn about and respect my allergy. There are many GF options available in the meats. Many sides as well. I will eat there again!","useful":0,"funny":0,"cool":0},
{"review_id":"azGYp_Elvaydy1UpNjs5Mw","user_id":"rQV9rfDlBzpkp22lGBQZBQ","business_id":"XlbDdblfNsOGiZ84CorRBQ","stars":5,"date":"2016-11-13","text":"Excellent service and food. The best Pad Thai I have ever eaten. The basil rice rolls were excellent as well as the jasmine tea. Our waitress was friendly and helpful. Thanks for having gluten free options for those of us with food allergies. We will eat here again!","useful":0,"funny":0,"cool":0},
{"review_id":"abWOcaZorhvB_E2B2nrSfQ","user_id":"rQV9rfDlBzpkp22lGBQZBQ","business_id":"0gzjWF7rX-biFsQB3EvIBQ","stars":5,"date":"2016-11-13","text":"My favorite spot. I love the fact that they offer gluten free options, label the order with \"gluten free\", and will immediately replace the food if it is not correctly made. I appreciate their willingness to go out of their way to offer options for those with food allergies. Love the BBQ, and the many sauces available.","useful":0,"funny":0,"cool":0},
{"review_id":"qzy9QFWLkyauZefzmt7T8w","user_id":"_9FJo67GBwS_jPaPLwnszw","business_id":"MDmziyjffQLQDwjpK-7rfA","stars":5,"date":"2017-02-03","text":"Quality, upscale barbershop with neighborhood prices in the heart of the newly updated Downtown. All barbers are equally talented, with a combined total of 25 years of experience. Come and experience a REAL barbershop with REAL barbers. No Bullshit, just great haircuts.","useful":0,"funny":0,"cool":0},
{"review_id":"PQ4OJBG96uItH_XOSc7srw","user_id":"_9FJo67GBwS_jPaPLwnszw","business_id":"4bmaBgd-GfVO94K5BlXk-g","stars":5,"date":"2016-09-28","text":"Daniel has been tattooing me for a few years and he never disappoints. All artists are equally talented.","useful":0,"funny":0,"cool":0},
{"review_id":"au_UBFGzpu4z9B97NnanaA","user_id":"_9FJo67GBwS_jPaPLwnszw","business_id":"HcCjIDs9AXLyccVEJOHBMg","stars":5,"date":"2016-09-28","text":"Best shop in town, hands down. Can't say enough good things about Downtown Tattoo. Got my first tattoo here when I was 18 and have been coming back since.","useful":0,"funny":0,"cool":0},
{"review_id":"or27rpnaqDxNJiEbYw43wg","user_id":"_9FJo67GBwS_jPaPLwnszw","business_id":"OY--Bo-QFgxL4KFZYn0iSg","stars":5,"date":"2017-02-03","text":"Quality barbershop that Henderson so desperately needed. Barbers here specialize in traditional cuts, but are capable of doing any haircut you might request. If you walk in and see hair on the ground it's because the barbers are always busy cutting quality haircuts. Again, this is a barbershop. If you are looking for a sensitive, P.C. barbershop, this is not the place for you. Go to Supercuts.","useful":1,"funny":1,"cool":0},
{"review_id":"4IvJkOLLNV6VlPbXZZVA9A","user_id":"Yxt140Hp7Kgt8EXBJ1m5DQ","business_id":"0JGMKaKJGVuDus5WcJzvjw","stars":4,"date":"2017-05-29","text":"Came here to have the lobster pasta since this is what it (and joe beef) are famous for... i have to say i loooved their pork belly dish much much more. It was in a wonderful shrimp and mussel sauce, and perfectly cooked, juicy, and tender!\nHubby loved the oysters too! \n\nThe pasta was definitely rich, but there was a je ne sais quois missing... maybe the lobster needed salt? Some kind of spice missing? Perhaps there was so much hype around this dish that it just fell short of my high expectations! However, the portion was more than generous! I couldnt finish the pasta! Gluttonous indeed! \n\nThe rhubarb sherbert\/icecream\/and meringue dessert was also spectacular!\n\nHard to get reservations, so get yourself the DINR app and score some last minute openings!! Its your best best!","useful":0,"funny":0,"cool":0},
{"review_id":"Y920GCU1W7TtKmxABPxVoQ","user_id":"Yxt140Hp7Kgt8EXBJ1m5DQ","business_id":"f-cg_onJ_v-RGdCx75EZMA","stars":5,"date":"2017-05-29","text":"Ate here on our last night in Montreal, wish i had tried it sooner! Ate a few other places including one of the more hyped up spots in the area, which came in slightly under expectations. Bocata was amazing! The food was delicious, the ambience was spot on, music selection was great! ... but let me get to the food.... \n\nHad the fried smelt, first time trying this, were delicious, perfecr with the spritz of lemon and then a mayo dip, could have had more! Hubby had the oyster special and loved them. \n\nThe octopus a gallega was tender, and wonderful. But the highlight for me was the squid ink risotto... EAT THIS ... i could have eaten this for every dinner... it was rich and delicious, with a little smokiness from the spicy chorizo, tender little baby squid tentacles, peas, and baby cilantro sprinkled on top. The prawn and scallop served on top were cooked to perfection! Get this, you wont be disappointed!!!! \n\nThe only downside here was that they were out of the crispy chicken skins for the night, which i was dying to try, but they must be good if they ran out! \n\n5 stars, will recommend to anyone who takes the trip out to mtl. Oh, and make a reservation in advance, and if you cant, download the DINR app to score last minute reservationa from cancellations if you cant find something!","useful":0,"funny":0,"cool":0},
{"review_id":"cG7GdDvtqjlsoboUdDSrVg","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"0TljdWRIDQzlp4siHQ_BAQ","stars":3,"date":"2015-12-31","text":"Like another person said, this place is a hit or miss. The last time I went there, I waited 30 minutes on my food with 10 people in the place. I got the grand slam which comes with coffee and choice of juice. I said I wanted orange juice for my juice. I never received my coffee and when I asked about it, the waitress said she thought I only wanted OJ since I didn't ask for coffee. You would think that it was implied that I wanted coffee. Do I have to ask for every thing? Do I ask for hash browns when it says it comes with it? There is a problem every other time I go in this Dennys. I've had sausage that was frozen inside. I gave it 3 stars for the times that the service was good. I've been coming to this location for about 3 years and I've seen a decline in service.","useful":0,"funny":0,"cool":0},
{"review_id":"Ec7qSGYqWQZEvELX4mO4Cg","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"eaCP75OfFlz51MaZ7SBNoA","stars":5,"date":"2017-04-08","text":"I had a check engine light show up on my 2007 corvette and an occasional rough idle. The car is supercharged and I wanted to take it somewhere that specifically deals with high performance sport tuned vehicles and not some run of the mill auto shop. I chose Doc's based on reviews. As soon as I showed up, the owner came out to see what I needed. I didn't have an appointment scheduled, but he still was able to take the time out to help me on the spot because of the quick nature of diagnosing my problem. He identified the problem and had me back on the road minus the engine light. He was able to adjust some fuel\/oxygen parameters that were out of sink with each other. Looks like Doc's will be my go to spot for any further tuning or diagnosing needs.","useful":1,"funny":0,"cool":0},
{"review_id":"4NURF5wYUcqSAtccfnP4Nw","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"f9cIbhLyBz_qTEfMLfwrrQ","stars":5,"date":"2017-04-08","text":"Me and the wifey really like this place. Good macaroni salad and BBQ spare ribs. People that work there seem friendly. They need to get the drain problem fixed. Sometimes there's a clogged drain smell.","useful":0,"funny":0,"cool":0},
{"review_id":"eJvueuWkUnj8Y63YE9G_Hw","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"_y1Et7f4NE6D1P1GzphlIw","stars":5,"date":"2016-03-23","text":"Excellent pizza at a decent price. There's a reason why there's usually a line all the way to the door. The best.","useful":0,"funny":0,"cool":0},
{"review_id":"81vYK0GOsfppovQrQ3H51w","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"zYb4kj2R54R2YPeNm829BA","stars":3,"date":"2015-02-01","text":"After leaving the Galleria mall, me and my wife noticed the Saucy bistro. It looks really nice from the outside. It was 2130 on a Saturday and barely any cars were in the parking lot. We noticed a lot of advised specials on the outside of the building. The interior is different but nice. We were seated and asked our waitress about the specials. She began to tell us and then a woman with short blonde hair interrupted and rudely said the happy hour specials don't start until 2200. I guess she's the manager. I understand rules, but C'mon, the place was empty. So the end result was that me and my wife left and they made zero dollars instead of something. I gave it three stars because of the decor and the possibility of decent food","useful":1,"funny":0,"cool":0},
{"review_id":"6nhg_gSvBMOxGTse9FubKA","user_id":"L4WO1cEkT0QLgAdYayrfeA","business_id":"wwgRu0TAMX8rfRhsiI0ifQ","stars":5,"date":"2015-05-18","text":"The food is flavored very good. They have an all you can eat marinara or alfredo pasta for $10. Calamari was tender and there was a lot on the plate. Prices rival Olive Garden. The atmosphere was upscale and clean. The music was at a nice level, not too loud. All of the staff was very professional and attentative. Not much bad to say about Bistro 57 besides its location and the fact that Aliante Casino has the tightest machines outside of the strip which keeps the casino kinda empty. In Summerlin, this place would be packed on the weekend. The place looks too fancy for the area and I figure most people walk past it heading to the buffet, Friday's, or the food court.","useful":0,"funny":0,"cool":0},
{"review_id":"IRfIVR7FhauI85JuP66ZTg","user_id":"7YpEks5ZMWGM0pZH2QoCMQ","business_id":"i_96cvjJo5mgcepHmGvl_A","stars":1,"date":"2016-08-01","text":"The manager \"Justin Parker\" at this location is rude and condescending.  While the staff is accommodating the manager \"Justin Parker\" will interrupt and make rude comments.  Be aware the deposit for this location is $300 or $100+cost of the rental, which ever is higher.  I was not aware of this unusual policy and when I said the airport location doesn't charge a $300 deposit, Justin said \"Well go and rent from there, that is our policy\", and he glared at me.  Then my daughter offered her Visa debit card and they said she had to have \"2 Utility bills with her name on it\"....really, who travels with two of their utility bills immediately in their possession?  We were unable to rent the car, they close in 1-hour and the wedding we had to drive to was in 3 hours.  Then Justin Parker (the manager), told the driver \"take these ladies back to where ever\", really loud in the office, it was humiliating.  A good manager shows leadership and has the skills to handle a difficult situation, not insult customers and send them on their way with tacky behavior and rude remarks.  It was weird, like he got some kind of thrill showing off how he could treat us.  \n\nI have rented from Enterprise for at least 20 years, and this is the first time I have ever been treated in such a shabby manner.  This manager is a very poor representative of a company that I used hold in the highest esteem.  I will not rent from them again, I usually rent several times a year.","useful":2,"funny":0,"cool":0},
{"review_id":"Y0lgGBKChexIU4WbRg1IVw","user_id":"jXMNx3Km9vz-NedCKBe6oA","business_id":"CtYCzxaDoVCABoz1drGOGg","stars":1,"date":"2017-05-09","text":"THIS RATING IS IN THE REFUND POLICY. ..I RESERVED A ROOM FOR MAY5TH....HOWEVER I HAD TO CANCEL..I DID SO APRIL 24TH..AT THAT TIME THEY HAD ALREADY CHARGED MY CARD 125.00... KOOL.. WHEN I CANCELED I REQUESTED A REFUND...THERE WAS NO CANCELLATION FEE..!! Booking.com. call the hotel. .And i was to wait 7-10days.. I call back again May1st.. I was told it shoud be in my account May5th ...that the hotal was just refunding my money the Friday before .OK..HERE WE GO ..I called back again today May9th.. Booking.com called the hotel..And guess what?  THEY HADDEN REFUND MY MONEY YET..BUT WAS GOING TO DO SO TODAY..AND I SHOULD HAVE MY REFUND IN 5DAYS...You gotta be kidding me!!! Im about to blow a gasket because of the principle. .And oh yea. .i want my freakn money...REALLY! !! Booking. Com has to REFUND MY MONEY IF I DONT RECIEVE IN 5DAYS... At this point im supper PISSED...But however if i dont recieve my money in 5 or less days...ima tke to social media..the local news.  whover will listen #BOOKING. COM #HYATT PLACE. can kick rocks. .play i quick sand..run into traffic wthout looking..jump off a bridge...and play with fire after bathing in gasoline...!!!!! Yall done pissed off my #CAPRICORN..ok IM DONE!!!! #1835417441...","useful":0,"funny":0,"cool":0},
{"review_id":"eu2P2GoBPiJnodyzcFNmJA","user_id":"ZtK9LAn7H4CYm3brQrHcvg","business_id":"frCxZS7lPhEnQRJ3UY6m7A","stars":5,"date":"2017-04-04","text":"Lord have mercy, this place is in strong contention for best downtown Mexican food. Strong drinks and fresh, delicious food at very reasonable prices. When you tire of Macayos and all the other cheap knockoffs, get your soon-to-be-chubbier behind to La Santisima.","useful":1,"funny":0,"cool":1},
{"review_id":"TWsPrbCS8wLVVoswK6Bxzw","user_id":"ZtK9LAn7H4CYm3brQrHcvg","business_id":"eHr2LOE3bAJ4wFPfEmZ7WA","stars":5,"date":"2017-04-04","text":"When it comes to independent mechanics specializing in Mercedes Benz, there's none better at what they do. What they do is pinpoint hard-to-find issues and fix only what needs fixing for the Benz owner on a budget. Bring any model or year and let him have at it, you will not be disappointed.","useful":0,"funny":0,"cool":0},
{"review_id":"a-FkV9GrmMX8x0K7VVtE-Q","user_id":"l2CmCtS1ymStfbckt1Ir0A","business_id":"a6Q55ryy5zJhyyzTXMF6pg","stars":1,"date":"2017-03-15","text":"I'm still itemizing my items and will be posting my review shortly.  At this point I have 4 pieces of designer glass\/chrome pieces of furniture missing (of course, they didn't photograph these four furniture items but there's a glimpse of the coffee table in one of their overall photographs with everything pushed together so they could remove a designer sofa -- still wet with water from flood which they took immediately for the weight factor for insurance pay) a brand new Kohler faucet still in manufacturer's box (no big deal in comparison to my furniture!) that one of their workmen kept placing in a \"throw away\" pile in driveway.  I removed it three (3) times out of the pile!!  Two of their workmen were involved in my garage placing whatever they desired into the \"throw away\" pile.  I stopped the job the following day -- unfortunately, with my house drenched in water and a different agreement the job resumed.  The adjuster was no help as far as advice in this situation.  I had a bad experience with this company from Day 1 of the pack out (trying to steal items) and the furniture they returned is banged, scratched and one of the sofas has rips in the fabric.  It's a black exquisite, contemporary, fabric (special order) and had some fade due to all windows (tons of sunlight) but was in perfect, excellent, condition when they removed them.  No one ever sat on them except during holidays.  \n\nInsurance companies shouldn't send these type of companies to their clients' homes.  Chubb Insurance should be rated horribly for sending this company to my home.\n\nThere is no category for my rating and if I have to click on a 'star' above in order to start my review so be it!!","useful":4,"funny":0,"cool":0},
{"review_id":"C68RozrbelOBMDyK9DcdKQ","user_id":"wwghHADz_kYgJ8qrnF3_dQ","business_id":"d8WZtx4dZUvT9Sg9NXGb3Q","stars":5,"date":"2015-06-04","text":"Excellent, fast, friendly service! Ron is great. Second time to come back within two weeks for a second car, and I will come back next year again.","useful":1,"funny":0,"cool":0},
{"review_id":"7eFTAZJdQcE_y5fnmJAXcQ","user_id":"zaxcckbC4Unruf4yeCZ05Q","business_id":"Tmj6c74wRTqvBvWHqlFFzQ","stars":1,"date":"2015-08-23","text":"We threw up the food was so bad!!!\n\nFirst thing my girlfriend and I noticed when we got there was that no one working was smiling or looked enthused. \n\nOur waiter acted like he couldn't give a flying f@ck and didn't ask \"how was your day?\" or any niceties like that, instead just taking our drink and food order.  No small talk whatsoever.\n\nWaiting for our drinks or some bread or something while waiting for our food, but no, my food arrives before our drinks!  I see the waiter bringing other drinks and putting glasses away but he looked like he didn't care, which seemed to be the general attitude of the place.\n\nMy girlfriend and I both ended up throwing up after we returned to our hotel!!!  We were both picking off each others' plates, but I suspect it was the meatloaf, as it was cold on the inside. We got our food within ten minutes of ordering, so they couldn't have cooked a salmon and meatloaf in that time! They must have pre-cooked it and kept it on the warmer.  Today we are paying the price and are laid up in bed.\n\nI've eaten at Toronto Tower and Seattle Tower many times and have had no problems. The Calgary Tower was the worst experience ever. And on top of things, I tipped the bugger 15%, when in fact I feel like suing the restaurant.","useful":1,"funny":1,"cool":0},
{"review_id":"Qzkbi4e3DL6fyEnavKk65w","user_id":"tuBxzi0Nu3osHLZt62R1Rg","business_id":"5bcpM0ss6j3AnsOOiOZiig","stars":1,"date":"2014-11-18","text":"Came to this clinic because my family doctor is on the other side of the city. The front desk staff is disorganized and not very friendly. Dr. Patel is nice but doesn't seem to listen to what I need. I will not be going there anymore. I would rather drive across the city.","useful":2,"funny":2,"cool":0},
{"review_id":"-EgsveYgZp-xo-vyAiQJ_g","user_id":"E92eg6IqUh5Vz5FiciLBZA","business_id":"XKPosZx2j4RHcZ8Ewdwj0A","stars":5,"date":"2015-04-07","text":"Fabulous place for all occasions- from a family weekend brunch to a weekend night out.  The one restaurant to eat in Montreal if you had to eat all your meals in one restaurant. \n\nGreat service (even nice to the kids). \nDelicious food. \nAnd a menu that everyone can find something to love.\n\nAnd delicious profiteroles.","useful":0,"funny":0,"cool":0}]