[{"review_id":"LCN6IOxgg4BH6CpY2mVytw","user_id":"FBi_G8-Mhoiz8lCmO8F29w","business_id":"mPHqFhaZAB1TmTlnnJygmQ","stars":5,"date":"2014-01-01","text":"We were recommended to Cashman through our wedding venue Emerald at Queensridge and it's no wonder they recommend them! They did our engagement photos, our Save the Dates, our video montage and our wedding day photos! The quality is simply stunning and they are so organized and everyone is just so sweet and professional! We mostly dealt with Allana who has become like a family friend and our wedding day photographers, Patrick and Jasmine are masters at their craft! They will be our go-to photography studio for life!!","useful":0,"funny":1,"cool":0},
{"review_id":"BME5kDr1J0ZM5Lm-WW_jCQ","user_id":"FBi_G8-Mhoiz8lCmO8F29w","business_id":"5I8VE_KBcDhh6uzdt5hwTg","stars":5,"date":"2014-01-01","text":"Holly and Richard did my Grooms cake for my December 8, 2013 wedding and perfection doesn't even come close to what we were given!! They are truly artists at what they do!! They are worth every penny and even delivered our cake to the venue! They will definitely be our go-to cake artists for as long as we live!","useful":7,"funny":0,"cool":0},
{"review_id":"sf-TYYW-imEzo3SyuDKuXQ","user_id":"FBi_G8-Mhoiz8lCmO8F29w","business_id":"55CXQoIftXybtBZEg0HQfQ","stars":5,"date":"2014-01-01","text":"Enchanted Florist did my December 8, 2013 wedding and I cannot say enough amazing things about not only the people working there, but the flowers, centerpieces, my bouquet and everything else included were stunning! They were amazing to work with, worked with my budget and I truly felt like I had the highest quality flowers! They truly saw the vision I wanted for my wedding and we're always available to help with any questions I had! I worked mostly with Kathryn for my payments\/money stuff (amazing, always got back to me super fast) and Moe who did the setup\/delivery of the flowers (so sweet and cool, felt like we had been friends forever) would highly recommend them for anything needing flowers in the Vegas area!","useful":1,"funny":0,"cool":1},
{"review_id":"Z3DzzqZolU3MhYEBPES75Q","user_id":"FBi_G8-Mhoiz8lCmO8F29w","business_id":"A26hK0LDXOyRaIbDdbel9g","stars":5,"date":"2014-01-01","text":"I cannot say enough amazing things about EAQ! We had our December 8, 2013 wedding here and from the first time we walked through the door to check out the venue to a year and a half later when said our \"I Do's\" nothing was left undone! They are so organized and efficient and know the wedding biz inside and out! Never once was I given a \"I don't know\" or a \"we can't do that\"...they will find the answer or a way no matter what and they do it always with a smile! They evening of my wedding, I felt like I was the only bride that had ever lived! They truly catered to my needs as well as my guests! I'm not sure what other venues offer or cost, but EAQ is worth every penny and I would do it all again!!","useful":0,"funny":0,"cool":0},
{"review_id":"nL3VWhAcuihh0Xyf05_M0w","user_id":"FBi_G8-Mhoiz8lCmO8F29w","business_id":"RP1FXBnZVE4O60H51MLl6A","stars":5,"date":"2013-09-12","text":"Mike did a wonderful job of thoroughly cleaning our stairs and four bedrooms! Our carpets looked like new and he did it all for an exceptionally reasonable price, and took the time to make sure any cleaner\/water\/dirt was completely gone from our carpets. If you need your carpets cleaned and and cleaned RIGHT, definitely call Triple J!","useful":2,"funny":0,"cool":0},
{"review_id":"JJf1cvAr90EOZTclZ4oRVg","user_id":"iNSL4q8MUvZ1ItVGboPpbQ","business_id":"Uis9LkGms_T9Cj0iWNp_BQ","stars":4,"date":"2013-09-27","text":"Best experience I've had concerning a dental visit in a long time. The process was great and the work I had done  was completed successfully and I healed fine.","useful":1,"funny":0,"cool":0},
{"review_id":"VkEeSwaqHgp6VFeANMoFow","user_id":"iNSL4q8MUvZ1ItVGboPpbQ","business_id":"04u-szAykldu-caSDHQaKA","stars":4,"date":"2012-02-09","text":"I have been looking for a good Chinese restraint for lunch near work. This one fits the bill perfectly.","useful":0,"funny":0,"cool":0},
{"review_id":"upJTAXA5fFXy0lH0ahmCVQ","user_id":"iNSL4q8MUvZ1ItVGboPpbQ","business_id":"YPavuOh2XsnRbLfl0DH2lQ","stars":5,"date":"2011-10-07","text":"Always enjoy eating here. But than I had them cater my Wife's birthday party and now they have even more of my respect. Love this place, can't say enough about it. Just go, I placed a picture of the spread from wife's party and now my boys back in NC want to come and certify this spot. LOVE IT!","useful":0,"funny":0,"cool":1},
{"review_id":"5S1fV0O2lVjuJslt2UqjTw","user_id":"nWSFggNLV9HYDe9pI9fazQ","business_id":"xHZmM-kGXqOfmQNTm0T05g","stars":5,"date":"2017-04-15","text":"If not the best Italian, definitely the second best. Great Apps and nice and quiet atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"bKP197kzX8aangfHeSoQgw","user_id":"nWSFggNLV9HYDe9pI9fazQ","business_id":"mqUgobkWrQgfYo3ri1foVA","stars":5,"date":"2017-12-10","text":"This is by far my favorite Mediterranean restaurant. Always fresh and delightful, and the same at both locations. From the Cauliflower or Falafel to the Hummus Shawarma, Enjoy!!","useful":0,"funny":0,"cool":0},
{"review_id":"XXhvCGetTf1X1Awk7pEgKw","user_id":"r5Sk34LR3WmEw4bzFBY_oQ","business_id":"3glVZZh_vyZH1VvPU0307A","stars":2,"date":"2012-08-11","text":"I'll spare you the long winded version. \n\nThis restaurant is another product of a bad trend happening in Toronto. A mediocre restaurant that somehow gets great reviews from pretentious rags such as Toronto Life, Globe and Mail, etc. and the virulent contagion spreads to the minds of every subsequent reviewer and patron of said 'trendy' locale.\n\nThe food at this restaurant is just OK. It deserves no better than 2\/5 stars. My partner and I eat out a lot and this might be the most overhyped restaurant we've tried in the past 24 months. Avoid.","useful":5,"funny":0,"cool":1},
{"review_id":"zlgE71VNTfWOEMmPjN6KmQ","user_id":"l6JyqV5oa8fa1zZZZcykPg","business_id":"MrovSlB5Ff0v4VGnvC2i_Q","stars":5,"date":"2015-08-26","text":"This place is sooooo good! The service has always been very good and the food is always on point! \nThe guac station they have going on is where its at! Everything is always fresh and the servers are always friendly. \nHighly recommend this place","useful":1,"funny":0,"cool":0},
{"review_id":"ME2tAIjppbzathM_FamU4g","user_id":"l6JyqV5oa8fa1zZZZcykPg","business_id":"fuCpY7v9ayBi8d90B1EGEQ","stars":4,"date":"2015-08-26","text":"I've been to this firehouse a few times recently and have been pretty pleased. The first few times the service has been a bit slow and lacking personality. However I took my wife with me this last visit and there was a bar tender with a broken foot who had us almost in tears from laughing so hard. There were a few older gentlemen a few seats down from us and she was joking with them and chatting about their family and her kids. This bar now seems to be more of a local place to hang out with good company rather than a typical sports bar that you just go to from time to time.  \nIf there were a better selection of craft beers the firehouse would have 5 stars easily!  Not even a decent IPA! The bartender was knowledgeable about beer however the bar had nothing good to offer. \n We were  also introduced to the eli steak which was delicious! It is not on the menu, which makes no sense to us but we will be back for it!","useful":0,"funny":0,"cool":0},
{"review_id":"tlCUY6mWuB8g1QAB_uOXsw","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"YwPTqsox-0Qt2nsk3B75Iw","stars":5,"date":"2016-07-08","text":"All four of my daughters have played here for years. What a wonderful place for children to learn the game of soccer, learn commitment, learn teamwork and make endless amounts of new friends all while staying out of the elements in a climate controlled facility.  Alfredo and his staff have made us feel at home just as I see him do with many many other players and parents. I could not recommend this place enough. This is one place I feel my children are safe, having fun and being well cared for. Great job LV indoor. Great job Alfredo and your staff!!","useful":1,"funny":0,"cool":0},
{"review_id":"MBtP1_Hid1GqrKfnVFFsEA","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"pkr0gGFBmei8b_l1pLwzcw","stars":1,"date":"2016-04-30","text":"Absolute worst experience with this place. Called to inquire about signing up my daughter for cheer or gymnastics class. After lengthy talk nice lady on phone recommended trying both since one was immediately after other. My wife took my daughter to the class while our other children at indoor soccer facility in same building. Instructor proceeded to belittle my daughter and wife by insinuating we were trying to get something for free by staying for second class.  I called in and advised them of this horrible situation and awful customer service. They DID NOT show compassion towards my issue or offer an apology for THEIR misunderstanding.I have been waiting for this company to show up on Yelp since this incident so that I can warn all of the unsuspecting people about this business. Beware. There are many other places that would love to have mine and your business. Steer clear. I have told countless dozens of people at the soccer facility of my experience as well.","useful":2,"funny":2,"cool":1},
{"review_id":"1I-78YDyJr_JHflxseF31Q","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"7A9HrrfVdLVlQwR-kAIjUA","stars":4,"date":"2017-01-11","text":"Received a follow up call from Cindy today who took the time to listen to my concern with my experience yesterday. She made a fair offer to resolve the issue to which I applaud. Thank you for working towards a resolution instead of sending a client away.","useful":0,"funny":0,"cool":0},
{"review_id":"MUJFx3FUtX1FczZ9Zbk60g","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"35X1ZV9tSEqB__yJEAhuhQ","stars":5,"date":"2016-06-20","text":"Employees make the business and in this case Mark Guilfoile takes the cake. He is the reason myself and anyone I know with a Toyota product go to this dealer.  What's wonderful asset to the company. Great job Mark!","useful":0,"funny":0,"cool":0},
{"review_id":"W7SkCYCQs0RxZY4tMWvkpg","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"Klg7aKcXOGEdeLi2oI2cOg","stars":5,"date":"2016-10-05","text":"I have been working with Chris for over 10 years.  He and his staff always are available to help with a question or to give me more info on something I am thinking of adding to my policy. I have referred many people over the years to Chris and they have all had positive experiences as well.  I recommend Chris and 360 insurance to everyone I can!  Give them a call.","useful":0,"funny":0,"cool":0},
{"review_id":"YHzJ-J1wsphytS-25tPM5A","user_id":"bOoKUkqQbGeIzreoGLG9vQ","business_id":"oZJHJieidHz-zuGL7lBMpg","stars":5,"date":"2016-07-27","text":"Lizeth is the best in the business!! Above and beyond service. I have worked with her for 3 years and have had exceptional results. I recommend Lizeth to anyone looking for a tax professional","useful":6,"funny":5,"cool":6},
{"review_id":"4XJqGvvObxKcpfoVGpKUkA","user_id":"QSuiLL2xyQJ3MV0mPwYLjg","business_id":"OyGwvqB3iVPX5CavwuC4tA","stars":5,"date":"2013-01-28","text":"Best gift for a foodie - The Chef's Table.","useful":0,"funny":0,"cool":0},
{"review_id":"h-mf7UvIJNA893RpcLoovw","user_id":"QSuiLL2xyQJ3MV0mPwYLjg","business_id":"aXWN4oH8W-MVDchWia084g","stars":4,"date":"2013-01-28","text":"Very nice plates and the menu should have a food challenge for all.","useful":0,"funny":0,"cool":0},
{"review_id":"TGRx_oucbSGwrHBrLJLTAg","user_id":"QSuiLL2xyQJ3MV0mPwYLjg","business_id":"wE8OljxUdpI8UbhGay2Xgw","stars":4,"date":"2013-01-28","text":"Good burger and large salads.  The daily soups are definitely home-made.","useful":1,"funny":0,"cool":0},
{"review_id":"Oz6G_JM63FS49rnf3-O2Sw","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"3U2xuNVUApXMCvFmp59GYw","stars":5,"date":"2012-02-06","text":"I am not vegetarian, but, I love this place, and eat here at least once a week.  I have pretty much given up on all other lunch options in the TO financial district.  Great combination of healthy food, taste, value, quality and service.\n\nThe only thing I don't like is that they charge 50 cents for using their credit\/debit machine.","useful":1,"funny":1,"cool":0},
{"review_id":"2e3zFs0RI1fBSj523mKK_A","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"ZGmgiPdWv97WMGUPN71OPQ","stars":5,"date":"2016-09-01","text":"Dr Sam and Dr Ali are amazing vets. More than that, they are also great simply great human beings. It takes a special type of person to be able to take care of our furry loved ones who can't communicate and are 100% dependent on us. Dr Sam and Dr Ali are super gentle, always available, 24\/7, and do an amazing job of following up with each client. Best vets we've had experience with by far. Highly recommended! :)","useful":0,"funny":1,"cool":0},
{"review_id":"gjb9Xb28jZPcuDwe5kqf3g","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"SLH_6FIjptg5BEJbYNld6w","stars":5,"date":"2012-08-20","text":"Living in downtown, I have been to numerous Sushi places.  I must say that this place, especially in terms of the overall value for the money, is amongst probably that best 5% of the sushi places in downtown.","useful":0,"funny":0,"cool":0},
{"review_id":"-mce34K7T-0kof2qAXF9-g","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"tZsSTf4Q7eoq4v0-_HvPPg","stars":1,"date":"2015-06-18","text":"Bought a chair for $400 for my home office from this location (as a gift to myself after a promotion).  I only spend about 1 day a week in the home office.  In 1.5 years, the synthetic leather in the chair totally fell apart.  Conveniently the warranty was only 1 year.  Structube personnel at this location and the head office refused to do anything even after repeated attempts at contacting them.  I would've expected a $400 chair to last at least ten years when used only once a week.  My previous $80 Staples chair lasted more than 8 years.\n\nStructube: poor quality expensive furniture - although it is good looking - just don't expect it to last.","useful":6,"funny":1,"cool":1},
{"review_id":"4zewjzvh5evBtoCuxyWnGg","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"dqD1Q5FEMvFR6L0nH48Xjw","stars":5,"date":"2013-12-25","text":"The food is amazing.  It's made with love.  I have tried almost all veggie and sea food dishes, and all absolutely amazing.\n\nCaveat:  This is a family business.  The waiter, who's also the part owner and son of the cook, is a little weird - but he's actually a very nice guy - even though he may not seem like that at first brush.\n\nYou will always get good service and good food.  Ignore bad reviews based on service.  Enjoy :)","useful":1,"funny":0,"cool":0},
{"review_id":"9lvYgAzdnWEBqml6aNnpoA","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"KK20vQwAATFwDDUPQ6A8uw","stars":5,"date":"2014-04-21","text":"My most favourite Italian restuarant in the Vaughan area - and this area is full of Italian restaurant.  This is definitely not a typical Italian though - they have eastern twists in various dishes - which make it different in a great way.  The dishes are simply more flavourful.  I love the various pasta sauces and seasoning that use saffron.  The chicken pastas, steak pastas and seafood pastas are all awesome.  I am not a big steak person and have also heard that their steaks are not their strong point.  The two poutines are really great as well - which again also are different from regular poutines as they have hints of eastern flavours.  Awesome restaurant.  If you feel like having Italian, and want to try something different, this is definitely the place.","useful":0,"funny":0,"cool":0},
{"review_id":"0LCVtgVHLhMamZABpmeFsg","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"8MdS6jgVymIfV0C2yv_IGA","stars":5,"date":"2014-02-12","text":"Bamiyan kebab has the best kebab options period.  Their various chicken and beef kebabs are all amazing.  It's really good to go with a bunch of people that you can try all the kebabs.  Been to all their locations and the meat is always fresh and tasty and consistently good.  Their quality and freshness is definitely higher than some of the other kebab options in the area.  Highly recommended.  It's also great for people who are New to different ethnic foods as this is relatively mild and you can add as much spice as you want on the side as needed.  :)","useful":0,"funny":0,"cool":0},
{"review_id":"NS2iJcV7CKuilXbSFqlUfQ","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"1A47OcRyjJa56OwrTZpfmA","stars":5,"date":"2014-02-11","text":"This is one of the best Indian restaurants in Brampton.  Everything always tastes super fresh and super tasty.  Quality is seriously lacking in a lot of Bramton Indian restaurants but that's not an issue here everything is high-quality.  I've tried almost all the vegetarian dishes as well as the fish tikka and fish pakora which are great.  The notable mentions are Achari paneer, chili paneer, fish tikka, gajar halwa, chat papri and Channa bhatura.   I've been going here for years - highly recommended :)\n\n I only wish they had halal chicken... so I could try the chicken dishes too.","useful":1,"funny":0,"cool":1},
{"review_id":"HKCjiie2QIgWD2BjfCb4Zw","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"656iajmxqJU2JvMeUbNkXg","stars":5,"date":"2014-06-25","text":"My favourite Pakistani\/Indian restaurant in GTA.  It's worth the drive to Mississauga even if you are in Ajax to come to this place.  They have the best Bihari Kabab, Peshawari Kabab, Karahi dishes and over all dishes I've tried (which is almost all of them) are super delicious and mouth watering.  It's a little small, so, it's always a good idea to call and make sure they are not busy before going - as it's quite popular and there is often a wait, especially on weekends.  That alone tells you that this is a great place :)","useful":0,"funny":1,"cool":0},
{"review_id":"ekE26DjMyhvjJSFgBSTPtA","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"eGP9T_kj0iM5h3MciSQjSw","stars":4,"date":"2014-02-12","text":"I don't understand what some of the negative reviews are talking about. I love this place.  The food is consistently good not amazing but good and it's great for people who like lots and lots of options.  Definitely one of the best vegetarian options and Brampton.","useful":0,"funny":2,"cool":0},
{"review_id":"OB0vBZAkxc1SdD6QWCdfTA","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"MC4becrrM9ntmnfMrD9b0g","stars":5,"date":"2017-07-18","text":"We drive 20 km  in GTA traffic to go eat Sushi at this place - probably driving by at least 20 other sushi places. The quaility, selection and freshness of the sushi is really awesome. Highly recommended.","useful":3,"funny":0,"cool":0},
{"review_id":"lBC1FeQTakV_RZHO7vS7IA","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"5LPK0LeKiS4HKzYwKXvFLg","stars":5,"date":"2014-03-28","text":"One of the best Russian\/Mediterranean\/Middle Eastern I've been to in Toronto.  We tried several dishes - appetizers and entrées.  Great presentation, quality with varied and flavourful experience.  Highly recommended :)","useful":13,"funny":3,"cool":0},
{"review_id":"hqnB6QeT5apk1XwywMBfbQ","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"RUd_M7DPJq1I3DPq0oF--w","stars":5,"date":"2012-02-06","text":"One of the best Pakistani restaurants in the GTA.\n\nDon't go in expecting good service or decor or even regular plates (as you get paper plates).\n\nIt's all about the food here.  Besides some of their vegetarian dishes (not their specialty), everything reliably always tastes amazing.","useful":1,"funny":0,"cool":0},
{"review_id":"N1wKmFLExoBFHaq8tI68aw","user_id":"K5TZLIfO4JXhXHiNd0-REA","business_id":"LI9sVHgnX-DzFyvWmPDRgA","stars":5,"date":"2014-02-12","text":"I've been to about 10 dosa places in GTA and this is definitely the best that I've been to in Toronto.  The variety of dosa and other options are endless which is also one of the big appeals of this place.  One of the best vegetarian and southing Indian options in the GTA probably.","useful":1,"funny":0,"cool":0},
{"review_id":"oL7WX8mzJu1_-vyXgVlAKQ","user_id":"e6BujhFRfeGXh3EXVl9RTg","business_id":"bdSnm8vPT71rufNgYziKvQ","stars":5,"date":"2012-07-11","text":"Have been using for the past few months instead of a company I had been using for 20 years because the old supplier just sells ice and did not return phone calls.  Great customer service.  You need ice right away, they try to handle right away.  Have storage box issues, they have immediate response, and usually an immediate solution.  Nice owners and accomodating pleasant delivery staff.  The ice is good too!","useful":0,"funny":0,"cool":0},
{"review_id":"C778Du7g0I-lL4QmZapW2A","user_id":"Ax0GGDPECKMQqwwlyp23xw","business_id":"xjmSOMWaobEPCf9eyw014g","stars":1,"date":"2016-01-23","text":"I unfortunately had similar a similar experience dealing with Leah that many of the other reviewers had. She came across wonderfully in my initial meeting with her but things quickly went downhill. She showed up at my wedding with a friend that she claimed was her second photographer but I don't think that friend took any pictures. My bridesmaids later told me that Leah was saying she didn't even want to be there...I paid her plenty of money to be there! I had to beg her for pictures after a few months and then got about 100 less than what was promised in the contract. Oh and no reception pictures! I don't have a single picture of me dancing with my husband or father. I asked her about this and she came up with excuse after excuse. Finally after 8 months and the threat of a lawsuit she admitted she didn't have any pictures from the reception. Leah has changed her company name so many times (I'm sure due the bad reviews) and it makes me so mad that she's still out there duping people. Please do not do business with her!","useful":2,"funny":1,"cool":0},
{"review_id":"3YofgraEHB_-RbTP2hj_Ig","user_id":"-ciBvC2RcMtt3JeRW0NDvg","business_id":"WVvqV0cmNR3j7ChPoI74hQ","stars":1,"date":"2015-10-27","text":"do not order chicken and waffles....honestly they need not to cook any type of meat if they are not going to cook it thoroughly and season it right...seriously..they need to consider closing or just get the shit right..seriously!","useful":0,"funny":0,"cool":0},
{"review_id":"yDjwi8uFx2EMkNxT2-Qb9w","user_id":"-ciBvC2RcMtt3JeRW0NDvg","business_id":"CELtWt1ygao81JWDwWRvSQ","stars":5,"date":"2015-11-18","text":"Raw Remedies is not just a small business hair salon,its home. Its welcoming environment makes any wait time a ease, the ambience is outstanding, its appearance is artsy,colorful and well decor. The owner Bobbie is an exceptional business owner with a great spirit you cannot help but to be around, she is respectful and very informative on the health and recovering stage of your hair with great tips on how to keep it healthy. Truly this is a one stop salon you can call your own. The other employees, Shanae,Jiyeah and Mary are great stylists as well. Very satisfied!","useful":1,"funny":0,"cool":0},
{"review_id":"hs63SXj-fON9u5m94G_A2A","user_id":"o3_WJLViPEKPfXcBgjgXIA","business_id":"nuGAd48mGzVLlJLPkST0BA","stars":5,"date":"2015-08-30","text":"Needed my nails done, Traci took my appointment, I got my nails, a pedi and eyebrows, all came out great! Hey traci!!!","useful":0,"funny":0,"cool":0},
{"review_id":"SMbAV2io0tGBGisi81L6dg","user_id":"PX8qhpo8bwoxS7A9ivZlfQ","business_id":"RAh9WCQAuocM7hYM5_6tnw","stars":4,"date":"2012-07-31","text":"This is by far one of my favorite places to eat in Charlotte based off of a couple of things. 1. The menu is very vast (almost too vast at points though) so you are bound to find something that suits your fancy. 2. The atmosphere is great - crowded but not too crowded, cool artwork on the walls, awesome bar with a giant salt water fish tank that spans the front wall, great outdoor seating by the fountain if that suits your fancy. 3. The food is YUM (the Bento box is my favorite as you get a little of everything, burger and sushi). 4. Love that when you enter the bathroom the background \"music\" is 3 voice where one is a sentence in English, one in Redneck and one in Japanese!  5. The service has always been top notch! 6. They have a combination burger and sushi option that is called Burgushi...novel ideal! \n\nBiggest draw back to me is that there is ALWAYS a wait and reservations are hard to come by unless you make then well in advance. Also, not a fan of no drink specials on the weekend.  \n\nOverall, a fun place that I will continue to support.","useful":0,"funny":0,"cool":0},
{"review_id":"YXqza-whN942cjc28Hu7Aw","user_id":"PX8qhpo8bwoxS7A9ivZlfQ","business_id":"Xrr19fzrUUgTTQBLUd2Gzg","stars":5,"date":"2012-07-15","text":"Great food....one of the best burgers in Charlotte. Spuds are good and a very generous portion. Will be back!","useful":1,"funny":0,"cool":0},
{"review_id":"kDlrKCscvZDCKclDpbnX4w","user_id":"xfMk2896pP337dS8bebP4A","business_id":"wND-GmM09BNCo_kEQLHxVw","stars":5,"date":"2017-02-08","text":"Based on the reviews, I called Prima Sweet Shop. From the first conversation, she was very attentive and had good customer service. She gives great attention to detail to make sure you are satisfied with your order. The cake pops were prettier than I had imagined and they were absolutely delicious! The flavors that were ordered were vanilla, chocolate and red velvet. Everyone at the party were awed at how beautiful they were and enjoyed them even more when they ate them. The prices were very reasonable especially given the exceptional service and quality of the cake pops.","useful":0,"funny":0,"cool":0},
{"review_id":"h110SyoiTAptnBf_02y7-w","user_id":"dsMbImAJx5SCLGbDH5iSbQ","business_id":"nn4ZkIZTCd7jJhxs-P9tHA","stars":1,"date":"2015-08-19","text":"The guy in purple shirt  asking the black bus boy to go out back and fight what a turn off from this place 3rd time i ate here from out town this loud mouth pushing what  seems  to be a manager  never again will i eat there cause of him and i staying across the  street for 2 months  for work shame  on him the girls were just shaking  there head cause of his behavior  lots of kids with  family present","useful":0,"funny":0,"cool":0},
{"review_id":"ffGsRht3FK7yzsgMTMuw9w","user_id":"dPzYNnCgHippzLI5Ja1Mgw","business_id":"Y6Tu9r3AaEaX41BRATQLaQ","stars":4,"date":"2014-07-08","text":"Food was great...but they use msg...so tell them no msg or you will wake up the next day with an MSG headache.","useful":1,"funny":0,"cool":0},
{"review_id":"6OMzVvLMwMy_mBOJNnz0ow","user_id":"pQY_h122h0nzPn5l5OY9nQ","business_id":"Zd5bvGvlSmksBJXrevtxEQ","stars":4,"date":"2017-03-25","text":"If I was rating on food alone, this would absolutely be 5 stars. \n\nWe split the tofu tod for an appetizer. Panko coated and fried tofu with a crazy good sweet\/spice dipping sauce. The tofu was well seasoned (its easy for fried things to go bland and this didn't) and had great texture. \n\nI had chicken pad thai. For $13 it was a generous portion. It came out piping hot and with a perfect level of spice (I requested on the mild side of medium, which isn't easy to nail).\n\nI also tried my husband's massaman curry with chicken, sweet potato, and peanut. It was phenomenal, really rich from coconut milk with great flavor and heat. \n\nThe service here wasn't bad, but they're definitely still learning. Our waitress mentioned that her brother opened the restaurant with his wife, and I'm happy to support a family business while they sort out the kinks. \n\nI think this is a great addition to the neighborhood and will routinely be slammed. Glad they offer take out!","useful":4,"funny":0,"cool":1},
{"review_id":"lmKiMucYvzlRorzTIJQw1g","user_id":"MPbaacBrI9yKv2JSl6d1Qg","business_id":"pFQaji0idkrzv5J-qTQ82Q","stars":1,"date":"2015-04-25","text":"Food was cold and didn't taste good then to top it off the manager was yelling at these two ladies and just being so rude when they went nicely up to him to inform him that they weren't satisfied with the food yeah after that I'm good I'd rather go to denny's","useful":1,"funny":0,"cool":0},
{"review_id":"RobvxgLcXhBousfYy5PE6g","user_id":"jYCKy1tzeCD7sMRQfWbZIw","business_id":"jTZYireK6pnPb6Rni0jygw","stars":4,"date":"2012-09-02","text":"This was my first time at Wow! Sushi on a Saturday evening. It is a small quaint restaurant and we were greeted by the staff as soon as we walked in. \n\nWe ordered sea urchin (uni) sushi, japango roll, louis roll, and wow roll. I was amazed by the sea urchin roll and louis roll, the other two were okay. I was impressed by the freshness of the fish as well as the excellent service we received. I will definitely be returning!","useful":0,"funny":0,"cool":0},
{"review_id":"Q69K3jM_sUsDqySNmHl7kQ","user_id":"jYCKy1tzeCD7sMRQfWbZIw","business_id":"XmgdFa3G_CZVfjtQEJMZfQ","stars":4,"date":"2012-09-02","text":"This was my first experience at Caplansky's deli on a Sunday late morning. It's a great location in Little Italy and inside has a nice dining room area with tables outside as well. \n\nI was greeted by the staff who were quite friendly. I ordered the smoked meat sandwich which I have to say is the best smoked meat sandwich I have had in this city! I am definitely a fan and will be returning soon!","useful":1,"funny":0,"cool":0},
{"review_id":"Ck7l8I8VevuGYP8GqFcQuQ","user_id":"txTqktmhXaW_s9ljKqZsIg","business_id":"8WBHKj2davW6hhZWlUQ7DA","stars":5,"date":"2016-10-10","text":"Lionel Richie was a FABULOUS..ENTERTAINING AND ENGAGING SHOW!\nHe did a fabulous job confirming he is and has remained our TO GO artist when you want to go to therapy via his music and HUGE talent!\nTop of the line entertainer!!!\nI Highly recommend everyone go see this FABULOUS SHOW!!\nGreat night!!!","useful":0,"funny":0,"cool":0},
{"review_id":"MrEYx1QQxWdHe_k2xNCIWg","user_id":"txTqktmhXaW_s9ljKqZsIg","business_id":"FDY7wagp7-rfjopJDRARbA","stars":5,"date":"2016-10-08","text":"My wish for years was to see Celine perform in Vegas.\nLast night my wish became reality..and boy Celine DID NOT DISAPPOINT!!@\nThe show was SPECTACULAR!\nProfessional..fun..emotional and just to DIE FOR!\nCeline has to be HANDS DOWN best singer alive..she is sweet ..genuine and loving too!\nThanks Celine!!","useful":0,"funny":0,"cool":0},
{"review_id":"LTtcdsTt_DGQ9OhEHPBBdw","user_id":"txTqktmhXaW_s9ljKqZsIg","business_id":"V4NH79nxz5PS6_GdCM9sSQ","stars":5,"date":"2016-10-09","text":"The best show ever!\nCeline is the best singer alive..hands down!!!!\nIf you are in Vegas..do not miss!\nWorth every penny!!","useful":0,"funny":0,"cool":0},
{"review_id":"5qAJghT7TWdu10_t7qcIqA","user_id":"lJKqSF4oxspbV592oOByyg","business_id":"ARj6DzbLlRkHt3kQeTuuVA","stars":1,"date":"2015-02-22","text":"Absolutely awful experience! If I could give no stars I would! This used to be my favorite nail salon, but since the new owners took over it has gone downhill. The customer service is horrible, and their services are shoddy at best. It took a total of 7 minutes for my pedicure from start to finish....i was cut twice on my cuticles, no callus treatment, and no massage. Apparently a pedicure now consists of soaking feet and painting nails only. I will be on the hunt for a new salon. Never coming back to this one!","useful":0,"funny":0,"cool":0},
{"review_id":"p0U2xPzQgaxfSDcE4fRCmA","user_id":"p2XsyGUohEk--lk_0aNBUQ","business_id":"7RtxNNY-wRnCHEdxaP9Slw","stars":5,"date":"2013-07-31","text":"I want to thank Impact Boot Camp for the help\/support in my lifestyle changes.  I first tried Impact Boot Camp with a Groupon Special.  I knew I needed a change from my regular boring work outs at the gym.  It seemed like I was just going through the motions and not really seeing any success.  I liked the trial so much I ended up joining as a member.  There are 3 instructors, all with their own unique style which makes it a nice change and fun to work out.  The workouts are always different and challenging.  The best part to me is all I have to do is show up and give it my all, they have the workout all planned for me, no thinking involved of what do I have to do next.  After a few months of eating right and doing Impact Boot Camp for about 4 days a week I have lost 10.5 lbs and almost 6% body fat.  I'm very pleased with my results and look forward to continuing with Impact Boot Camp for even more improvements.","useful":2,"funny":0,"cool":0},
{"review_id":"PWAAVV0dhGMAx1RGS76r0Q","user_id":"-c0HqcXE_2WsS-QhS8FUAA","business_id":"-0qht1roIqleKiQkBLDkbw","stars":1,"date":"2017-05-10","text":"I went to the cafe\/bar at the pool. They charged me 5$ for 4 onion rings. When I went to tell the front desk how disappointed I was, they took no ownership and said that the cafe was owned by someone else.  This cafe is ripping their members off. In addition, there was construction around the pool and it smelled like sewerage. I am disappointed and won't stay here again let alone buy their time share.","useful":0,"funny":2,"cool":0},
{"review_id":"fliUpy3aEmojarTCabgqGg","user_id":"tUNlCjJCSgWdQQtZrqJqMA","business_id":"BToSTEiaK94G3h5_XROEcA","stars":5,"date":"2016-08-07","text":"So good! Service was excellent food came in generous portions and the price was fantastic. With the atmosphere and the service this place was a top tier restaurant. Will be coming back.","useful":0,"funny":0,"cool":0},
{"review_id":"yIB-GoynIQa2XlU7TcGqmg","user_id":"i6LALSBkkMs4qrNWtOrQ3Q","business_id":"Do_mUw9iZARpYx81jsPkRg","stars":5,"date":"2017-02-12","text":"Big catch is defenetly one of the best sushi in Calgary. The service is good but the food is just delicious. If you don't know what you want just ask them and you won't be desapointed with their recommendations.","useful":0,"funny":0,"cool":0},
{"review_id":"wdO4arCeV7oSkQDxEkCXYA","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"mdrdluPih166hhckelglNA","stars":5,"date":"2015-02-10","text":"Impressed! Went to Takamura Services for help with filing our income taxes and was pleased with their services. Fernanda was very friendly and professional would definitely recommend their services.","useful":0,"funny":0,"cool":0},
{"review_id":"jyV3ddKg3UlJbtQYeTP-Yg","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"sVYxSjy_lPIG18uOvk5v7g","stars":4,"date":"2015-01-31","text":"Love it just moved to the area and I'm so happy i found this place! Thai is my go to guy for my pedi n gel manicures! But everyone here does a great job!","useful":0,"funny":0,"cool":0},
{"review_id":"VtgIO225BNeWAJ7qJoxvWg","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"Ed47ZME7NcLTZeIBUYsdog","stars":4,"date":"2015-03-15","text":"Absolutely amazing! Everything here looks smells and tastes Great! Staff really friendly the only thing i would suggest more space more tables it get packed quickly its that good!","useful":0,"funny":0,"cool":0},
{"review_id":"vuuMvu_2JhNRnd4GYXuA6Q","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"_i3AM8X40LkTDOrDyNVv5Q","stars":1,"date":"2015-02-10","text":"Absolutely hate this place everyone I've  dealt with in the store is extremely rude I've  gone three times before i wrote this review and all three I've had a bad experience i will drive further down the road to Smiths to get a smile and better customer service!","useful":1,"funny":0,"cool":0},
{"review_id":"7NuFnuStvGhBgaRTnw2bOQ","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"4hu_-khyc-DlOIhTMZcN3w","stars":5,"date":"2015-01-31","text":"Amazing place super cute and the staff is really friendly! Victoria is awesome and very professional absolutely loved it!","useful":2,"funny":0,"cool":1},
{"review_id":"HOe5e1H5XlkvTLTz1nbh_g","user_id":"v6ZM4ZunKDjxySsSZFePWA","business_id":"Lsr7V0QWYvrHnYo_RQbADA","stars":5,"date":"2015-02-10","text":"Love Sweetie! Have been going to her for two years now soo happy i found her! If you want your threading done right go to Sweeties!","useful":0,"funny":0,"cool":0},
{"review_id":"1zOdP7MXMa01XCbtmLgeyQ","user_id":"Qh9DYZ3dvYpN6PdtjtpJ1A","business_id":"M6A1VQEK0OOVEp6UbO9INg","stars":5,"date":"2015-09-03","text":"Got my nipples pierced here. Shop is clean, and the staff is super friendly! Kendra is great at what she does and very knowledgeable. She made my experience great!","useful":0,"funny":0,"cool":0},
{"review_id":"eFrbNV0RFeYCgK5TrwSBcg","user_id":"-0biHfjE0soSptbU5G3nug","business_id":"GmdujALb1Nq2RHGr7jhCaA","stars":5,"date":"2016-12-18","text":"I love this place.\nBeen here over 10 times Atleast once a month.\nBeen to honey pig and Lee's Korean bbq\n& Hwaro is still #1.\nI'll keep this as my regular restaurant 2 times or more a month.\nIf wife permits.","useful":0,"funny":0,"cool":1},
{"review_id":"paBLyLebRO1jC_7H7FaTMA","user_id":"tyMRrUCkdByr1XxExNzmZw","business_id":"Lqp3uwGJU6CHyys-eerMmQ","stars":5,"date":"2011-03-16","text":"So, whenever you have a California gurl in a Mexican Restaurant, it has to be good.  My weary tummy has not had anything substantial all day, and having read the best of the best about the amazing La Tolteca, I decided to let me feet hit the street & check out this local flor in the rough.  Well, I have to say the reviews are all TRUTH.  \nThe green enchilada's were my choice as I've not ever been huge fan of the red sauce, in addition to a full range of all that one could feast your immediate appetite too, there is also fresh tortillas, candy, the bakery which is a temptation I did avoid (thank you P90X) and yes, I did say it, the temptation is the BAKERY,  the smells hit your nose before you even step in, yeast, sugar and spices, La Raza!  \nEnjoy your time, don't rush, I wandered around and grabbed my favorite Fanta to connect the true flavors of home, Cali and my youth, thanks for the great time La Tolteca, and you'd better be sure that I'll be stopping in again with re-inforcements.   \nGracias & Happy Eating","useful":2,"funny":0,"cool":0},
{"review_id":"7dvoi6sJFQzsS8WlsC4DRQ","user_id":"LyfuXI_JUht8r8YfF1mn2A","business_id":"JOr4h5_BsGly5Cnt25jFxA","stars":1,"date":"2016-03-26","text":"Came for dinner and so unbelievably DISAPPOINTED!! Ordered Salmon which was jerky not a filet. Management deemed it to be edible and did nothing to rectify the situation. Miserable experience and would never recommend this restaurant!","useful":0,"funny":0,"cool":0},
{"review_id":"WTVr0TOV_AZn2vmK38KTwg","user_id":"QfC5lIRA4ipul81V5eomrA","business_id":"u_vPjx925UPEG9DFOAAvFQ","stars":5,"date":"2010-09-13","text":"If you are looking for quiet hotel in Las vegas book Budget rent flamingo hotel. Hotel somethimes offer discount on accommodation. I stayed here and i cant tell anything bed on this hotel. Rooms are nicley decorated, of course clean and nice. I love the budget hotel services. Las Vegas is nice city and if you come here book Budget rent Flamingo.","useful":0,"funny":0,"cool":0},
{"review_id":"tuqLUCL3165DZEWoQFX7ng","user_id":"V7tDW7E-VRyqPqbGdsuueA","business_id":"JpgVl3d20CMRNjf1DVnzGA","stars":2,"date":"2017-09-11","text":"It's not typical for my husband and I to try restaurants that have unusual name, not recommended by someone we know, nor because we're not the adventurous kind. Unless it's the only thing open and we're dying of hunger, maybe there's a slight chance. And if it weren't for the voucher we got, this restaurant ain't in our list to try when in Vegas, but it was a win-win, good opportunity to try since it's free dinner (with exceptions of: dessert, alcohol, tax, and gratuity)!\n\nWe were seated at a divided room where large parties were placed. Our server named Juan seemed a replacement as the main server for that area was slammed or should I say was too busy  favoring the group before us. It made it more noticeable after we've eaten as the main server took care of two other incoming groups seated in the same large party room. But what the hell, they all does the same, but to be determined to bring quality service, which I felt Juan didn't deliver well. \n\nI had Brazilian bouillabaisse which was a big meh! Bucca di Beppo or Bravo's, all located in Hawaii probably could have done a better version. It's pretty much a pasta with seafood medley of mussels (which the only thing I liked), shrimp, and salmon fish that's super untasty! My husband had Surf & Turf Rodizio with \"unlimited\" meat serving and my in-laws had Grilled Salmon and Skirt Steak (not part of this review) while my child had Loaded Cheese Fries (bacon, cheese, sour cream all OTS because we have a picky eater). \n\nGoing back to my husband's food that didn't impress me at all, even if there's different meat carvers who goes to your table to serve it, due to lack of consistency. They seemed to be favoring other parties and we had to ask either our server or other bypassing staff to call the meat boys. Not a big fan of dead carcass (I'm a wannabe plant based dieter), so I can't really attest how good it was for my husband, but I can tell it didn't really pass to his liking the meat choices and service. \n\nTo end the night, we had some confusion with our server Juan. I should have mentioned this beforehand and the server should've done the same with warning us with water charge per person. Like who does that? I guess only Pampas Brazilian Grille! Or the voucher could've printed it too with other exceptions. Plus, the way Juan applied our voucher against our orders were very out of order! Instead of simply listing all our orders and inputting the voucher at the end, he customized the receipt like they're trying to manipulate something. And call me stingy or whatever, but I didn't like the force tipping impression! That's why it's called a tip because it's up to the guest if they think it was well-deserved. At that case, he obviously didn't earn the whole 15% because I had to swallow my own saliva and drink from my husband's and child's water just so I can go on with my dinner. Plus it's not even ice cold! They charge for water back to the customers because it was placed in a fancy water bottle. There was also a lot of idle waiting for our server to get back to our table in between dinner session and the meat carvers were sparse serving and favoring table groups.\n\nGiving it two stars only because it was \"free\" dinner and experiencing the meat serving at a lackluster manner! Go get that voucher as a VISA card instead!","useful":1,"funny":0,"cool":0},
{"review_id":"Jzy0jASWTA7XJlZiAWi4OA","user_id":"OKW0MKppKns0epSt3d_d6Q","business_id":"110iMPMPEEjFlf8HKVq84g","stars":5,"date":"2014-08-21","text":"EXCELLENT!!   The smoked salmon app was some of the best I have ever had! Very moist and cooked perfectly but with the right amount of smokey flavor. \n\nI have the filet and crab cake special with red mashed potatoes.   The filet was cooked perfect at med rare but the outside was seared to perfection.   The crab cake was also done perfectly with huge lumps of crab meat and little filler. Lastly, the mashed potatoes were thick and very flavorful. \n\nYou know your dinner was great when the mashed potatoes are the worst thing on the plate !","useful":1,"funny":0,"cool":0},
{"review_id":"iHBhAvJsiVgpU1II0Hzvlg","user_id":"OKW0MKppKns0epSt3d_d6Q","business_id":"QvxBnMcBPP1z_NAIYCqqdA","stars":3,"date":"2017-06-19","text":"Moving to CLT from PDX we were kinda excited to experience NoDa. We heard about this place and followed it in IG. Finally made out way to the area and it's def like a Portland vibe. Only they food missed the mark.  I got the fried chicken and waffles. Chicken was average and the waffle was bland and hard like a brick. I absolutely hated the syrup. \n\nHush puppies were the best thing we ordered and were prob the best I've had since moving here \n\nBacon jelly biscuit was also good but I wouldn't order it again \n\nOverall it's a fun spot with average food but we will go back  at some point to try it again.","useful":0,"funny":0,"cool":0},
{"review_id":"v9hYyI4Um9WxSwHzHO4BPQ","user_id":"OKW0MKppKns0epSt3d_d6Q","business_id":"b8fEuQPrf383f6pzdm8-1w","stars":1,"date":"2014-08-21","text":"Not good at all. I had the tuna tacos and my wife had the bacon, shrimp tacos. Both were tasteless. The rice was so dry it was inedible and the black beans were straight out of a can.  \n\nThe service was slow and non existent. We asked for lemons for water twice, refill of salsa that never came, another beer which also never came, and they allow smoking outside in the patio!!  No one wants to sit beside a cigarette during dinner. When we asked about the state law they said they allow people to smoke on the patio anyway. \n\n$45 for 2 crappy meals and a beer! We will not be back!","useful":0,"funny":0,"cool":0},
{"review_id":"qn9VLtVdgb0oPEWkDuczIQ","user_id":"OKW0MKppKns0epSt3d_d6Q","business_id":"c4KXpCou6HBOgfKp2z2_hw","stars":2,"date":"2017-04-20","text":"This was a weird dining experience.  The atmosphere is like a casual dining spot but the prices we high for the offerings. My wife and I spent almost $80 on 1 small app, 1 dessert and 2 entrees. No drinks.  Both entrees were wrong as if they ran out of food and were plating dishes on the fly with whatever they had. Nothing we ordered came out correct except the water. \n\nApp:  Deviled eggs - good flavor in the filling but the whites were extremely rubbery. \n\nEntree 1 : Sea bass topped with crab \/ veg medley.  The Sea bass was good except it didn't come with anything that it was advertised on the menu. It came with fried mashed potatoes instead of the veggies , no crab meat, and had pesto sauce on it. I actually asked for the menu and pointed to what I thought I was getting. They brought my plate back and there was literally about 1\/4 of an oz of crab meat. My wife and I just chuckled. \n\nEntree 2 : salmon and cheesy mashed. Salmon was great, but came with veggies instead of mashed.  Come to find out they ran out of mashed potatoes and we were stuck wth the veggies.  Who runs out of a main side dish at 6:30p?! \n\nDessert: PB brownie cheesecake. SAVE YOUR MONEY AND CALORIES! Huge piece but bland and tasted kinda stale. Was also supposed to be topped with Pb cups. It wasn't. By this time we were fed up and just asked for the check.   We have NEVER not finished a dessert. We took it home and even the kids thought it was bad. \n\nService: average at best. Everyone had super awkward personalities and it was painful to have a conversation. Our waitress seemed to be frustrated with everything. She would ask us how we are doing and then walk away while we were answering. We waited for silverware on 2 different occasions.   \n\nTo top it off the UPS driver wheels in 10 giant boxes right beside our table to unload in the kitchen.  \n\nLike I said, it was a strange experience.","useful":0,"funny":0,"cool":0},
{"review_id":"z3lbrkGcyyMBuUpXUulb7Q","user_id":"OKW0MKppKns0epSt3d_d6Q","business_id":"YURN6bVsqRfPElrMlef4nQ","stars":4,"date":"2017-06-19","text":"Really cool place and the kids enjoyed customizing their pops.  Prices aren't bad for a niche shop and the pops were very good. \n\nOnly negative is that they are very messy. The drip trays could be a bit larger.","useful":0,"funny":0,"cool":0},
{"review_id":"lc8OkNn6f-K-LWITgJFPbA","user_id":"-myx3NMENwa7_HbJFUaleQ","business_id":"QrH5iDowzV0Bs6xOoCsg9A","stars":5,"date":"2016-08-16","text":"Wow walked in with lower back pain,walked out feeling amazing!! Thank you Dr. P, would definitely recommend.","useful":0,"funny":0,"cool":0},
{"review_id":"9rvhDZA2PqQqmo9iBACeSA","user_id":"QmhFu9II2RSTkPln9lEgrg","business_id":"3uIXuw878fNjxZ2Li1diFg","stars":5,"date":"2015-12-01","text":"Hogtown is wonderful. Absolutely perfect vegan comfort food. Sometimes you really can't stand another healthy-tasting salad, you know? \n\nThe staff was friendly, the service was quick, and the portions were ample (to say the least). I'm definitely heading back before I leave Toronto! :)","useful":0,"funny":0,"cool":0},
{"review_id":"Vq2jyuPwE6j7lH75MALvdg","user_id":"QmhFu9II2RSTkPln9lEgrg","business_id":"13i9_fvGykydL6wKxXq8FA","stars":2,"date":"2015-12-01","text":"I was really underwhelmed by Capital. The service was fine, but the coffee was mediocre (even though they serve 49th Parallel) and the music was kind of awful.","useful":0,"funny":0,"cool":0},
{"review_id":"MVoMBmZXNzZZC8ShQW1qbw","user_id":"QmhFu9II2RSTkPln9lEgrg","business_id":"tf4FoM-A_I469qTUbLZs5Q","stars":5,"date":"2015-12-01","text":"Absolutely awesome. M Square serves a really nice espresso and does it with class!\n\n(...and the fine gentlemen behind the bar were lovely to chat with!)","useful":1,"funny":0,"cool":0},
{"review_id":"N98uoJ-NS_FOZ28yb4FI4Q","user_id":"B0msg6C-CcvYgJzu5Nnk-Q","business_id":"6CcXCWwwnp_NYQm5ya3wAw","stars":1,"date":"2017-01-30","text":"If you can wait an hour for your sandwich and do not mind it being cold then this is the place for you. Yes, you can receive faster service if you get there a few minutes before they open or a few minutes before they close but again no guarantee ... take your chances .... To be fair, I only waited 45 minutes and didn't get my food. They do happily refund your money though.","useful":0,"funny":0,"cool":0},
{"review_id":"wKyFGOId8Z-4rwlYdFOQhw","user_id":"poN3MHVHU41zVV6sCheuZQ","business_id":"Ql5npMMRWKurN99tgA-g5w","stars":1,"date":"2010-03-24","text":"BEWARE OF EXAGGERATED CHARGES FOR THINGS IN THE ROOM THAT YOU MAY NOT HAVE EVER EVEN TOUCHED\n\nI stayed here for 1 night with a promotional rate of $85 plus tax in December 2009, and ended up paying $200 [basically their normal rate].  It wasn't even a full night, we checked in at like 8:30pm close to 9pm, and checked out earlier than 10am to make it to the famous Paris Brunch, before head on over to our Time Share.  That's like 13 hours, including sleep and walking the strip for 5 hours.\n\nDon't get me wrong with this, it's a very beautiful and impressive property, but what happened after I left, can't be forgiven.  It's appalling, and I feel like I've been personally violated by the whole ordeal.\n\nWhen my Credit Card Bill came, I noticed 2 charges from \"Mandalay Bay\".  I called to find out what the second charge was about and found out that I had apparently been charged over $100 for things from the private bar.   \n\nI travel a lot, and know better than to touch anything in the overpriced bar, when there's the same exact stuff down stairs for much cheaper.  When I asked for a receipt of the itemized charges to be emailed to me.  I never received it.  I called twice to have it emailed, and twice they said they'd do it, and they wouldn't, so I disputed the charge through my Credit Card company.\n\n30 days later, my Credit card was able to receive a copy of the itemized list and below were the items they pretty much made up out of thin air.  \n\n--- half of this stuff, i don't even know what it is.  A \"CD?\"  what the heck.  What would i play it in?  Who plays a CD in Vegas?   I stayed in the room with brothers and sisters, what would I do with a \"Love Kit\".   \n\nThe only thing I could think of would be the personnel taking everything before tidying up the room, and blaming it on me....how would you dispute that?\n\n4 bottles of Fiji water ($5)\n1 Pringles Sour cream ($5)\n2 Orange Juice ($4)\n1 CD ($10)\n1 Travel Kit ($15)\n1 Love Kit ($30)\n2 Cranberry Juice ($4)\n\nIn the end I couldn't do anything because they had my credit card on file for \"incidental\" charges. -- something that's industry standard, but to Arbitrarily charge for everything that was in the room, even if it wasn't used is absolutely NOT standard at all.  It's Shady!\n\nI come to Vegas a lot and have stayed in a good handful of hotels on the strip and have never had any other Hotel chain do this.    From the budget friendly Imperial Palace, to even their very own newest 5 star, the Aria hotel, and not ONCE did any of them try this nonsense.  \n\nFor the many conferences and personal visits to Vegas I shall make, in the future, I will never, ever stay at the Mandalay or TheHotel again.  It's managed by Shady people.","useful":2,"funny":0,"cool":1},
{"review_id":"EwqGnKBArhiHxGLzvfHBlg","user_id":"IbYh87kbTZTPbD4ICCZ7vw","business_id":"DMmeFKsUuMl0kDy7Zd7W3A","stars":1,"date":"2017-08-30","text":"This has been the worst experience I have ever received at a business establishment. So much so that I feel obligated in writing my first Yelp review in the five years since I've been a member.. \n\nThis is how the story goes:\n\nMy girlfriend and I arrived on Saturday 8\/26 to watch the Mayweather\/McGregor fight. Prior to arriving we called ahead to ask for the cover prices. We were told $10 at 4pm then $20 at 5pm and $30 after 6pm. So fast forward to arriving at the entrance BEFORE 5pm and to my surprise we were told we had to pay $20 since it was beginning to get \"unexpectedly\" crowded. So after we agree to reluctantly pay the cover, we were then told by the hostess that we were highly unlikely to get a table\/seats. Granted, this was after we had already payed the cover charge to get in fully expecting to at least be able to sit at the bar. As we enter we realize how insanely crowded it is with no open seats in sight. We could not even order drinks at the bar because it was so crowded. After a brief browse around the area we came to the conclusion that it was just too crowded and it wasn't worth it to stand for who knows how long and wait for open tables\/seats. By then we're both irritated and decide to leave after a few minutes of searching for open seats and squeezing through the crowd. \n\nAt this point, we arrive back home (no more than 10 minutes from Sandbar). Still irritated by the fact I had spent $40 for feeling totally uncomfortable and for something I didn't even receive (watch the fight), I call Sandbar in hopes of receiving a refund. We speak to a woman and let her know our situation. She tells us that they should be able to refund us, however because it was too busy they wouldn't be able to do it that day and to call and speak to a manager tomorrow. We make sure to let her know that we would be able to drive back and show our receipt if that would make it easier, but she continues to encourage us to call and speak to a manager tomorrow. \n\nSo we call back the next day to speak to a manger, however we are told that the manager who handles refunds was not there and to call back tomorrow. \n\nSo then we call back the following day, and to our surprise the manager who handles refunds was still not there and that he would be in the next day.\n\nIt's now Tuesday, and thankfully the manager we are waiting to speak to, Steve, is finally in. My girlfriend explains the situation and how we've been waiting days to speak to him and get our refund. Initially, Steve offers to give us a $40 gift card, however at this point we just want our money back. Steve tells my girlfriend he will call her back to let her know his verdict. Finally he calls back and VERY RUDELY tells her that he is NOT going to refund our money and even goes as far to take the $40 gift card off the table. He tells her that at this point, if we are going to want a refund, we must call corporate and immediately hangs up the phone. \n\nSo officially pissed off at this point, I call corporate and leave a message with Natalie explaining the situation. She tells me that I should receive a call back tomorrow. And now the waiting game begins.....\n*This review will be updated as soon as I hear back from someone.*\n\nNOTE: This entire situation has been a mess, and if the owners\/leaders of this establishment had any sense of integrity towards their patrons, they would make this right!","useful":3,"funny":2,"cool":0},
{"review_id":"lx__zsozmvxDwHufQ_sIdw","user_id":"RY-OKBoqaIx7BmzumnuKyg","business_id":"dH5LDzfqGulpIDrLjQgKtA","stars":5,"date":"2017-09-29","text":"I'd like to add to Steven's abundance of great reviews!! Went well above and beyond to fix my water heater issues. He certainly is an asset to 5 star home services! I see one negative rating about replacing a water heater which I am about to do so let's hope it was not a common thing.","useful":1,"funny":0,"cool":0},
{"review_id":"-newKncC4brje-iKC3JOcg","user_id":"sHEGIUjcwG_qVmHtcdudxw","business_id":"1cCh0fuVULWtWhJPr95jIw","stars":5,"date":"2012-10-02","text":"I had a very pleasant experience at this dental office.  Front office staff was friendly and helped me figure out my new insurance.  Had one filling done and it wasn't bad at all!","useful":3,"funny":1,"cool":0},
{"review_id":"ZzaXWLdgiohhe0IHV09YPw","user_id":"sHEGIUjcwG_qVmHtcdudxw","business_id":"QJLP4Yk0kTdXOpq9bxQMOQ","stars":4,"date":"2012-10-04","text":"Plenty of workout equipment, easy parking, rooftop soccer field and tennis courts are awesome!","useful":1,"funny":0,"cool":0},
{"review_id":"yMfsPfYDhBM0qji5HtoSdQ","user_id":"XriLHnFKaTVxfMhSywuWCQ","business_id":"IZKjHtCuRlbhyD1WtGd8uA","stars":5,"date":"2010-02-01","text":"My girlfriend and I had an awesome time thanks to Chris and the guestlist feature. We signed up about a week early to go to the Palms clubs and then XS the next day. We received text messages the by 5pm each day with all the instructions needed for that particular day (ie, what time to come, etc.) I even called Chris and asked him for passes to the Mix (on Monday). He was very helpful and he rightly suggested that I should stay in XS since Mix is dead that day. At XS we got to skip the long GA line and we were in in 2 minutes.\nThe clubs were great of course and we had a super fun time. Thanks man!","useful":0,"funny":0,"cool":0},
{"review_id":"iZkQNE2PbXRdlD5v17-jYA","user_id":"oFV2JnphVxgUlPLdCQwlLg","business_id":"ak_qBHizWMbY_ens51v8Mw","stars":4,"date":"2016-10-25","text":"I had a zipper replaced in a pair of men's jeans do for v$18.00. I was happy to find this place. Nice older couple that own it.","useful":0,"funny":0,"cool":0},
{"review_id":"jMiSOzQsv79TgdxhGqUqGw","user_id":"oFV2JnphVxgUlPLdCQwlLg","business_id":"p5x_dS2CGwmhu2aXm7PuIQ","stars":1,"date":"2015-01-15","text":"I can not recommend this bookstore. I have been a book reader all my life. In fact, when I was growing up my parents had an independent bookstore. I am someone that is always buying books. Shortly before Christmas I drove to The Bookshop intending on buying books as Christmas Gifts. I do not smoke in my car and wait until I get somewhere to light up outside. While having my cigarette I was looking through the windows of \"The Bookshop\" prior to entering. The store was empty of customers as usual. A man inside saw me looking at the merchandise through the windows and in a most obnoxious voice came out and told me not to smoke in front of his store.  His arrogant manner and tone of voice implied that I was some sort of vagrant because I was a smoker. I told him \"You just lost a customer.\" Every time I go past there to go to Dick's Hideaway to eat I never see anybody in his book store.  In fact, the other merchants in that strip plaza say they do not know how The Bookshop pays its rent as they never see anybody in there.  I might also add that while looking in the windows I noticed a sign inside the book store that said \"Pets Welcome.\"  Like many Americans I am extremely allergic to dog and cat hair and do not think they should be allowed inside retail businesses unless they are seeing eye dogs.  The Bookshop owners are not considerate of potential customers.","useful":1,"funny":2,"cool":0},
{"review_id":"sV7h92qVg5vEZ1ZgP2_5QQ","user_id":"oFV2JnphVxgUlPLdCQwlLg","business_id":"G8k2E3oYHHl2o4lNJQwR-g","stars":4,"date":"2016-11-16","text":"The portions are very generous - there is definitely enough to take home for a second dinner.","useful":0,"funny":0,"cool":0},
{"review_id":"s9HCOykvt3ehWnzRDCEAuA","user_id":"sJBIwUCbDydz3Y1NTS_cmA","business_id":"KbBoAR5qkp59r7VlNshbyg","stars":5,"date":"2016-06-08","text":"Excellent, Excellent facility.  I have had several procedures done here and have been absolutely pleased with everything.  The overall experience from the front desk to Dr. Hall, to Evelyn the aesthetician has been wonderful.  Everyone is friendly, the facility is state of the art and the results are AMAZING.\n\nI spend a lot of time in the sun and have experienced severe sun damage, primarily the ugly brown sun spots that connect and take over your skin!  After consultations regarding what I hoped to achieve I was given suggestions on what would work best for my skin.  This was done at first with Shannon.  She is terrific!  Very down to earth and funny. This really puts you at ease as you discuss procedures and financials; also important, given that these procedures are obvious luxuries for most people .  There is no high pressure sales and they always point you to promotions that might be coming up and how to get the most bang for your buck. \n\nEvelyn, the aesthetician is wonderful.  Very friendly, puts you at ease and really knows her business.   As I stated, I do have a lot of sun damage that has reared its ugly head in middle age. I will need to have more treatments done, but due to my outside activity I have to schedule it around times I will be inside a lot (summer).  After 3 treatments, there is a noticeable difference in my skin.  Many of the very prominent dark brown spots are completely gone off of my face and my chest area is almost completely clear!  It truly takes years off of your skin; which shouldn't be important but it is!\n\nI have also had lipo on my previous  \"baby\" region. I'm of average height and weight but after children even diet and exercise couldn't get rid of that belly bump.  The results are amazing, no more pooch or \"jiggly\" area.  Do I look 20 again?  No, but that's not the purpose.  My interaction with Dr. Hall from the consultation to the actual procedure was excellent.  He gives you a realistic view of what you can achieve with the procedure. No false promises. He said that I had enough elasticity in my skin that it would shrink back after the procedure and he was absolutely correct.   He is kind and has an excellent bedside manner that is all but forgotten in today's world.  \n\nI am very pleased with all the results and will be returning here for future laser resurfacing.  I recommend this facility to everyone.","useful":1,"funny":0,"cool":0},
{"review_id":"ydQuVCCZO0cO2E9zwGQ0Dw","user_id":"sJBIwUCbDydz3Y1NTS_cmA","business_id":"J28BGjxTkrceKunNwwoKNw","stars":4,"date":"2016-06-09","text":"We were looking for an older but reliable vehicle for our son.  We had looked at dealerships but we wanted to pay cash and most dealerships just don't carry older vehicles for a cash price with any type of warranty.   We told the salesperson what we were looking for and the price range and he suggested 2 vehicles that fit our needs. The salesperson was pleasant to work with and we were able to get the vehicle out the door for the price we needed and the paperwork process was very quick.  \n\nWithin the 15 day warranty period we did have an issue with the vehicle.  However, we contacted the dealership and worked with Patrick.  He was very helpful and the problem was corrected in an acceptable amount of time.  He returned calls quickly and worked with us to resolve the issue. \n\nOverall, we have been very pleased with the purchase.   Customer service is incredibly important; especially when issues arise.  This business met all of our expectations.","useful":3,"funny":0,"cool":0},
{"review_id":"9fpFCnGONHQlBJp-fthUeg","user_id":"sJBIwUCbDydz3Y1NTS_cmA","business_id":"BHKxSslPkHZEraHtTm-lJg","stars":5,"date":"2017-01-07","text":"Dr. Guyette really is a Top Doc. An immediate family member recently had to have a skin cancer removed.  Everything was explained prior to the appointment (procedure, insurance, etc.). There are no long waits once you arrive for your appointment and everyone is friendly and courteous.  You are not rushed through appointments and he answers ALL of your questions without making you feel like you are on the clock.\n\nDr. Guyette is very caring and shows a great deal of compassion as he performs the procedure.  As noted previously, by other patients, he personally calls you to see how you are doing after surgery; this really is unheard of these days.  After receiving the test results from the biopsy Dr. Guyette's diagnosis was absolutely correct and enough tissue was removed so that we didn't have to go back to have additional work done. The cancer was right below the neck area so it was highly visible.  It's completely healed and unless you are really looking or know it was there the stiches are nearly UNDETECTABLE!   Beautiful work......for anyone who may be considering any other procedures.   \n\nAs a side note, we have also been to the Scottsdale office; both facilities are lovely. Our daughter had cystic acne when she was younger.  We originally had gone to a dermatologist and didn't like the treatment that had been prescribed; a prescription that had a lot of side effects we were not willing to risk.  Long story short, we took her to Dr. Guyette's Scottsdale office and through skin treatments, approximately 3 (laser) and using the Obaji line of products her skin completely cleared!  It's been almost 9 years, she continues to use the skin regimen they suggested and her skin has remained cystic acne free.  She did have some slight scarring from the acne but thanks to the IPL treatments it really is minimal and undetectable with very little make up.\n\nWe never hesitate to recommend either facility.","useful":0,"funny":0,"cool":0},
{"review_id":"REqc6l5_n1Lfch5BpIBvTw","user_id":"sJBIwUCbDydz3Y1NTS_cmA","business_id":"6OmTD7FvQnnQqO-0CJu53w","stars":1,"date":"2016-06-08","text":"This place is clean and sanitary from what I saw; however, customer service is also very important and the interactions that I experienced was not great.  The lady that did my nails made several snips around my cuticles to the point where they are still stinging, one actually was bleeding. She was polite, but difficult to understand and not a great nail tech.  The man who did my friend's nails was beyond rude.  She needed fills and a color but after not completely understanding him and him acting like he didn't understand \"fills and color\" , he removed the \"powder\" he had put on and then because of what she needed done he told her needed to put the \"powder\" back on but there would be an extra charge because she had changed her mind and he had removed the \"powder\".  What?  We still have no idea what he was doing except charging extra.  She hadn't changed her mind he was making it more confusing than necessary.  All of this was being done with his eye rolling and heavy sighing like his customer was intruding on his day. This place is also much more expensive than other salons.   Fortunately, there are nail salons on every corner so it isn't necessary to spend hard earned money here.","useful":2,"funny":0,"cool":0},
{"review_id":"ALRQ-FpDKGRh7lgNRmyFCA","user_id":"kyHqQbQSoprJRGb-yyzc2A","business_id":"eStn1HCGNcKiLXc0pfvZxg","stars":1,"date":"2015-12-26","text":"Nothing too complicated, so I thought.  Tried to catch the shuttle from the west gate to the airport.  Concierge told me I could pick it up on the 20 minute mark or the 50 minute mark...Tried to get on the shuttle that showed up at 8:50.  The driver wouldn't let me on and told me I needed to schedule a pick up.  Called and they told me it was too short of notice so I took a cab.","useful":2,"funny":0,"cool":0},
{"review_id":"6Ln2wKbDkC3taCNWVm0J3w","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"uRjEJr_Ge0_S10P2dEgN0Q","stars":1,"date":"2016-06-20","text":"We chose Stabella based off of a recommendation from a family friend. Unfortunately our experience wasn't everything we expected it to be. The main issues that we had was that our countertop was cut into two pieces to fit together, which sounded fine. But they cut a straight line instead of the typical angled line that you see. The straight line makes it so much easier to see. AND the worst part is that the color is so off its extremely obvious to see the line. We just feel that an effort to match the colors at the line should have been made. A few minor issues is that the countertops didn't fit the walls because our walls weren't straight. Which of course isn't Stabella's problem, but the sales rep initially told us that if this happened on sight the installers would just cut the wall a little to slide the counter tops in so everything would be flush with the wall. But when the installers got there they said they couldn't do that because the line (where the two pieces were cut and were supposed to meet) wouldn't be flush. We also decided not to get a backsplash because the sales rep talked us into how \"new\" and \"modern\" looking it would be. But then when we ran into the problems with the wall not being straight we wish we had just ordered the backsplash to hide the issues in the wall. Once again, that's not Stabella's fault that our wall wasn't straight but we just wish the sales rep had been a little more realistic instead of making everything seem like roses and daisies. In the end this left us feeling dissatisfied because we expected different things based on the initial sales pitch. Going back to the line where the two pieces met and one side was much darker than the other, they told us that the granite cutters were instructed to put the darker piece in be back. So what that told me is that Stabella was 100% aware of the drastic change in color while they were cutting our granite ... And the didn't care or even think that would bother us? They just sent it out to be installed at our house anyways. They offered to have an installer come out and apply a darkening agent to the lighter side..but why wasn't this done when the granite was still in their factory being cut? It would have saved everyone a lot of trouble and things would have been done right in the first place. We declined having them come back out to apply the darkening agent because we were worried it would end up looking worse and then we'd really be screwed. Let me add that after we notified them we were declining their offer to come out and darken the countertops, we NEVER heard from them again. We NEVER at any point in the process heard an apology that we weren't 100% satisfied, they never bothered to reassure us that their work would look great after they applied the darkening agent and they'd really like to make it right...nothing. Long story short, I would never recommend Stabella and we've even gone so far as to give their name to some acquaintances and say they're who we recommend you NOT use. Stabella might get away with taking our money and leaving us dissatisfied, but we'll do our best to keep people we know from using them.","useful":12,"funny":1,"cool":2},
{"review_id":"AeHD6_XFnK8i8IjeVAaaGQ","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"32-2DSm7zaPpQgUggMp0RA","stars":5,"date":"2014-10-31","text":"Glass Doctor of Charlotte has replaced my mom's windshield, repair mine, and most recently replaced my husband's windshield. I've been super impressed with them. They're always on time (within the general time frame - you make an appointment for morning or afternoon), they're speedy (the repair of my crack took about 20 minutes, the windshield replacement took about an hour), and they're courteous. I will definitely be returning if I ever have any glass replacement needs.","useful":0,"funny":1,"cool":0},
{"review_id":"mqMnm9BHaI2ZfVthiJLRNA","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"jGe5sKmpIStORtVbsd9yyQ","stars":5,"date":"2013-09-01","text":"What a wonderful experience! My dog had developed a serious rash on his skin and wasn't eating of drinking all of the sudden. My regular vet wasn't open on the weekends, so we called and got an appointment through someone else's cancelation. Thank goodness we did. Come to find out my dog needed antibiotics. We were in and out of the facility in 30 minutes. Dr. Sheehan was extremely knowledgeable and thoroughly explained everything that was going on with my dog. The vet tech and front desk staff were so friendly and made us feel welcome. We will definitely be going back for regular visits!","useful":0,"funny":0,"cool":0},
{"review_id":"s8lgvub4EyHOr4drHgHvfw","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"W8p1ld4W7WJh_fAx8k9YbA","stars":1,"date":"2014-04-29","text":"Went to order my bridesmaids dress after my bride had picked them out at the store. I'm 6' tall, so when my bride was at the store choosing a dress she specifically asked the sales lady if the dress could be ordered in extra long. The lady looked in the computer and told my bride that the dress could be ordered in extra long. Great! So I go to buy my dress, and the sales associate tells me that the dress is on sale for almost half the price. Great! I was ecstatic. So I pay for the dress, and as I'm walking out the door I return to ask the date that the dress will be in. The lady goes back in the computer system and says \"whoops, I accidentally did your dress as a take off the rack instead of an order.\" So basically, if I would have walked out of the store my dress never would have been ordered. How upsetting is that! Well, as she look in the computer system to actually place the order, she finds that the dress is discontinued in extra long. So basically, she lied to my bride when she told her that the dress could be ordered in extra long. So I'm polite and say that it's fine and I'll just order the regular length and it will just be short on me - well then they tell me that I owe an additional $50, because the regular length dress was not on sale. I asked to speak to the manager to see if she would honor the discounted price, since that is what they told me that I would be owed. And the manager was extremely rude and would not honor that discounted price. Super bad customer service. First, they lied to my bride - the dress was not available in extra long. They lied to me - they didn't order the dress, and it never would have been caught if I didn't ask them to confirm the date that it would be in. And then they wouldn't honor the lower price of the discontinued dress. Honoring the regular length dress at the extra length dress's price would have made me feel a whole lot better about the situation. They basically said \"sorry, it's not available.\" And that's all that they would do to remedy the situation. Very disappointed!!! I will be recommending to anybody that I know who is getting married to NOT use David's Bridal. If it weren't for my anal double checking personality, I never would have asked when my dress would be in, and the dress never would have been ordered. The wedding would have been here and I would have had no dress! If you are ordering from them, I would definitely suggest double, triple checking that your dress has been ordered. Otherwise, who knows if it will ever come in.","useful":5,"funny":0,"cool":1},
{"review_id":"P4fOqdkNW7SjKpSOoYw3bA","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"uJggtxnt7AgTJqnLU8M_4A","stars":5,"date":"2015-01-13","text":"We called Air Source on a Thursday and were quickly able to schedule an appointment for the following Monday. Jeff arrived within the time frame that he said he would and he spent several hours looking at our unit. He found several problems and was even willing to put some temporary parts on to test it out to see if we could get by with a repair instead of a whole replacement. We finally determined our 8 year old system just needed to be replaced. We asked Jeff how much the first visit would be and he said no charge. Wow! Most places would charge hundreds of dollars for a service call visit. He ended up calling us that night with a final price for a new unit that he recommended and confirmed that everything he needed was in stock at his supply house. We scheduled the replacement for the following day. I was shocked he could get us in that fast. Once again, he arrived on time and spent several hours replacing our unit and also replacing some duct work that was too small. The final price was exactly what he quoted us with no extra surprises. Air Source will definitely be our go-to Heating and Cooling Business from now on! Would definitely recommend them!","useful":2,"funny":0,"cool":0},
{"review_id":"vPxZWCXCWyzCNoTY9u3OAg","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"UQFZKiYbZ5ajfeK5AMmNNA","stars":2,"date":"2015-03-03","text":"The administrative staff at this location are incompetent. Because of a billing error to my insurance that they made, it has taken me months with my insurance to fix the error and get reimbursed fully for my glasses. If Monroe Eye Care Center's Staff would have been more competent at their jobs, they would have billed my visit correctly and I wouldn't have had any of these issues. I did enjoy my visit with the doctor, but the headache that their staff has caused me for the past several months will force me to never go back for another visit. I wouldn't recommend them for the simple reason that it could end up being very expensive for you out of pocket if they mess up your bill as well.","useful":5,"funny":0,"cool":0},
{"review_id":"q-_YlfvakDbp-Ty1ybGH4w","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"gblFg_GOg8OTPEO2sbCHhg","stars":1,"date":"2014-03-18","text":"Time Warner Cable is just awful. I was due a refund of $29.13 for canceling my internet service half way through the month after I had already paid for the entire month. Well, that was the middle of January and now it's the middle of March and I still haven't received my refund. I have called Customer Service a handful of times and even posted on their Facebook wall. I can not get any resolution! They just keep telling me 1) someone will call me or 2) they're checking on it and they'll get back to me. I never hear anything back. I just want my refund. It's stealing if you keep money that isn't yours TWC! Until the day I die (which is a pretty long time hopefully, I'm only 21) I will NEVER use your services.","useful":1,"funny":1,"cool":0},
{"review_id":"qzmUeoA4nnOHZPRm_thi0g","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"GBAJOqt9j01ppXw20s_Rkw","stars":4,"date":"2013-07-12","text":"Update: They did cut my dog one time. But they were totally upfront about cutting him and called me to let me know. They gave me a percentage off of the bill, but I do think it should have been free. However, I will still use them because they were very honest about their mistake.","useful":0,"funny":0,"cool":0},
{"review_id":"swZgdRbDYODH59WBn3CnGA","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"hWK2yx9mFbr7Ix-78Ki8rg","stars":5,"date":"2014-12-31","text":"When searching for someone to do body work on my husband's truck, we ran into Mr. Tullock at a local gas station. He saw the damage, walked up and introduced himself and gave us his business card. After looking online at the wonderful reviews, we decided to get a quote from Tullock. He beat out all the other prices that we had gotten, and with the assurance of wonderful online reviews we decided to go with him. He took the truck a few days later and had the body work done in about 6 days - really quick compared to other body shops we had dealt with in the past. The truck looked amazing after the body work, it was affordable, and it was done in a timely manner. We also had some brake work done while the body work was being done, and that went well. We definitely feel like Tullock Automotive is an honest, reputable place to take your vehicle and we will be continuing to service our cars with Tullock for years to come. Would definitely recommend them!","useful":1,"funny":0,"cool":0},
{"review_id":"HjYi1MBvuVf8fVsLeLx1bQ","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"T5R6aILLDBnHQvfejY7dgA","stars":5,"date":"2012-07-09","text":"I've gone here since I was 8 or 9 years old. Now I'm 19 and I'm still seeing my pediatrician - you can stay there until age 21. Definitely a great place to take your kids, I plan on taking my future children there. I would definitely recommend Dr. Parish and Dr. Young. They're my favorites!","useful":2,"funny":0,"cool":1},
{"review_id":"ykDHCNLiQh608IAanWMbgw","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"RClrhCnZiQtKbg6XUpwIWQ","stars":5,"date":"2012-07-09","text":"Such a great team of people - I had my wisdom teeth removed here and the staff was so kind. I had Dr. Valiquette do my surgery and she was great. My sister had Dr. Patty do hers a few years ago and he was also great. I would definitely recommend this place.","useful":1,"funny":0,"cool":1},
{"review_id":"ZuAS0kGi9UbgkoA2efr5IA","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"g9dn-3YxlY9TwWWSctpQMQ","stars":1,"date":"2017-02-09","text":"Never shopping there again after two recent terrible experiences. First was an employee wouldn't let a mom in front of me in line exchange a pair of kids shoes for a smaller size. She didn't have a receipt but all she was asking to do was get a smaller size. She ended up leaving in tears and the employee did nothing to help her. Second experience was we bought a lawn mower in 2014 and got the extended 3 year warranty. The sales associate assured us that if we canceled within the 3 year time frame we would get 100% of the warranty price back. Well here it is almost 3 years later and Sears will only refund $44 of the $249 price of the warranty. So the sales associate just lied to our face and management will do nothing to refund the full $249. Never shopping here again.","useful":0,"funny":0,"cool":0},
{"review_id":"90TuY5RQ-ebWnwWoUi_MUg","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"YDB5VpPFkVMNsIlWJ2zl8g","stars":3,"date":"2013-05-10","text":"I would love to give Planet Ballroom an awesome review, but I just can't. They were not willing to work with me and my fiancé to find a package that was affordable for us. They just wanted us to sign up for a package that cost over $400 a month. I have trouble understanding why they want to charge so much when they have Groupons for $75. We had a great time with our instructor for our four private lessons we got with our Groupon, but when we wanted to continue on there was just no way we could afford the outrageous prices. After talking with the manager, he still wanted to charge over $100 a lesson. When we were trying to negotiate the price, the manager simply stopped replying to our emails. We won't be using Planet Ballroom in the future because we definitely feel like our business is not valued. It was fun while it lasted Planet Ballroom, but consider emailing people back.","useful":23,"funny":3,"cool":4},
{"review_id":"YUgZuniQJGddge5sjiznGw","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"v1u4gpFkA_5AYvNGtEa0mw","stars":5,"date":"2012-07-09","text":"Dr. Rochelle was so great - the staff was pleasant, the office was in a good location and was very nice. They gave me free samples for the prescriptions they wrote me, and they gave me 2 coupons to get my prescriptions filled for free. I felt really comfortable there and would definitely go back!","useful":0,"funny":1,"cool":0},
{"review_id":"XGZUL-JWV8ozBqKgPuhTmA","user_id":"rbFG2hvQPA0Vca2cBGomFQ","business_id":"pvNlEkUozt6B1BhGnsj77g","stars":2,"date":"2011-08-12","text":"It was good, but I've had better. The more upscale froyo places such as pinkberry and yoforia definitely are better than Fruiticup, but since there isn't a lot of other froyo options in the university area I would def recommend trying this place. My main problem with Fruiticup was that they didn't have a lot of fresh fruit toppings.","useful":1,"funny":0,"cool":0},
{"review_id":"KQE3umRmMK1LwwuHHANjlA","user_id":"0qPPCzrYPytuYAeweDX1rg","business_id":"lY6XPUD0X4PIbub15M15aQ","stars":1,"date":"2012-02-26","text":"The studio has no facilities, insists on playing ridiculous music; I came here to get away from the stress of my divorce, not listen to Sade singing about her breakup. \nThe prices have gone through the roof since she opened her tiny studio in Uxbridge, and all it is now is a money grab; Franchise?? really?\n\nFranchises are normally sold once you have a PROVEN idea that works-not just for the owner, but for hte clients and the franchisees. I have been with you since thestart, and am so frustrated now, that I am no longer saying nice things to people about the experiences there.\n\nIn short:\n1.focus is money; one on one with Shasta used to be $50 now they are $100-$145\/hour-did you get a medicl degree we are not aware of?\n2.Calls herself a Transformational and life coach; where did you get your psychology degree?I have known her for years and do not recall any of htese things, only selling more positive karma for $$$$.\n3.franchise a business that has no showers, change rooms, blaring music and chatting instructors when we are trying to wind down and get over cancer treatments, divorce, pain and general distress over our lous lives; try to complain and they do not care-too busy to care!\n4. Telling people that being registered with the CRA for tuition is like getting FREE training; that is NOT how our tax syste, works-it is a tax deduction, not a wage deduction like an RRSP-this is a blatant lie.\n5. the majorityof the instructors have come through their own BLY training and have little to no anatomy outside of htis course; One shoule NEVER do compression of the back\/core or extreme Flexion within 45 minutes of waking up-there is still too much fluid ont he disks-WHY don't your instructors know that???\n6. Education must be broader; ensure they know that they CANNOT do forceful or any other hands on to clients without asking! A rape victom in child's pose does NOT want hands on her back pushing her further into a stretch-WHAT was she thinking?\n7. Instructors SHOULD NOT tell clients before a class that hey should come more regularly in order to \"get rid of the rest of that belly\". Someone with an eating disorder, struggling for years, does not want to hear this-Actually NOBODY should ever have to hear that from anyone! Disrespectful. We thought that BLY was a safe place, but we gues it no longer cares about anything except money.\n\ntoo bad. \nIf you cared, we would be back.","useful":1,"funny":4,"cool":0},
{"review_id":"7Ja69C-1DJtU9R8F5LpstQ","user_id":"ozwrsBvrPlvcdIRNW8WYqg","business_id":"v1lOO2jjHwhoX2fySoDkVg","stars":1,"date":"2017-03-01","text":"The service here sucks.  We waited over 24 mins for food.  Our waitress was oblivious. Once she got our order we didn't see her again.  I finally had to flag someone down.  Then once we got our food she asked how everything was and then she was gone again.  I had to flag her down for boxes and check.  The food here is not worth the horrible service.","useful":0,"funny":0,"cool":0},
{"review_id":"5RaTWbn6b4377IMGaMdtBg","user_id":"OSynCvw8UgyL_h63R5hR7w","business_id":"NTtLuuBKpywlyIz6oyd9kg","stars":5,"date":"2015-11-29","text":"Great little sushi bar. Affordable and quaint. Service was exceptional and food tasted great. Their rolls are a decent size and they offer quite a variety. Can't beat the buy 2 get 1 free special. Bento boxes also come with a lot of food at a decent price. Overall, our experience was great and we'll definitely be back!","useful":0,"funny":0,"cool":0},
{"review_id":"JBpjOlfuAJEPNqGMb4SsDw","user_id":"OSynCvw8UgyL_h63R5hR7w","business_id":"3xykzfVY2PbdjKCRDLdzTQ","stars":4,"date":"2015-10-21","text":"Delicious & affordable. Not what some may consider \"fine dining\" but it's definitely a lot cheaper than most sushi\/teppanyaki places around. Cheaper in this case doesn't mean bad quality, either. Everything was still very tasty and service was great.","useful":0,"funny":0,"cool":0},
{"review_id":"pEPXbrqLEUVKZQ9lEBU6Xw","user_id":"OSynCvw8UgyL_h63R5hR7w","business_id":"7ibuDLfx8gEhESAufYIySw","stars":5,"date":"2016-02-19","text":"Always an excellent experience! Great food and wonderful staff! Their prices are very decent and their rolls are large. My favorite is the Vegas roll. Can't beat the buy 2 get 1 free special! Delicious!!!","useful":0,"funny":0,"cool":0},
{"review_id":"3dIKesZGgS7hjxWtaJjkqw","user_id":"OSynCvw8UgyL_h63R5hR7w","business_id":"lL07o3UNikDqj1AAtUXhvg","stars":1,"date":"2016-02-19","text":"Not even worth one star! Unless you want to live with a bunch of cockroaches, don't move into this place! They're infested with them & they never go away!","useful":6,"funny":0,"cool":1},
{"review_id":"xRkB1gqz7cJHxU72iS5fbw","user_id":"_muoX69_cx0yf_8PCAIIOw","business_id":"xYy54Y2VTBAG5k7WJcaH4A","stars":4,"date":"2011-12-16","text":"My two dining companions and I had a wonderful dinner tonight. The surroundings are pretty ordinary, but the food and service quite inspired. The Lamb Osso Bucco was as good as I've ever had, and the apple tart for dessert was just right for the three of us. The place was busy but the service was attentive and unrushed. It was expensive but our Living Social coupon made it pretty reasonable....about $40 apiece.","useful":1,"funny":0,"cool":0},
{"review_id":"Ks_93nBUX6abUC5Fkvfyzw","user_id":"_muoX69_cx0yf_8PCAIIOw","business_id":"wqJ6eC0bmKsTK5bsSuYhcg","stars":3,"date":"2011-12-10","text":"My wife and I dined at Aquavina last night. It was good but not exceptional. She had the crab cake appetizer which was quite good. I had the wedge salad which was uninspired and the tuna entry which I liked a lot and which came with Forbidden Rice, a new dish for me. The rolls were not hot.\nThe service was not warm and fuzzy. It was very businesslike, acceptable but not the type service that makes you ready for a return visit.","useful":3,"funny":0,"cool":0},
{"review_id":"fQp90ASeCFzb5FM9qrrSfQ","user_id":"x3Fv7UXEZObzboRACflVsw","business_id":"FC5Vl9QgTM5Z9d0CW5t95g","stars":5,"date":"2017-08-03","text":"THE BEST.  My husband played in some World Series of Poker events, but forgot to pick up some souvenirs.  I thought it'd be a lost cause trying to find someone half the country away to help me out, but Anything U Want replied quickly to my texts (TEXTS - YAY!).  It was like talking to a real person (haha) and not just a random disinterested far-away rep.  Even though it was just a few t-shirts, they treated my request with professionalism and diligence - it ended up taking a few trips over a few days because the booth wasn't up the first two times.  When it was finally open, they called me to discuss what was in stock and sent pics of what they picked up.  Couldn't be more pleased.  I thought for sure I'd have to give a few-sentence instruction and hope for the best, but this was like working with someone who really cared about my order.  They got it exactly right and were prompt, professional, and communicative!  Will definitely be keeping their number for future needs.","useful":0,"funny":0,"cool":0},
{"review_id":"oKUP177a73XbT4Szg3X_FQ","user_id":"qIgy7yl3Rveq0zeFFowsTg","business_id":"Qt7EOWunbxf16Gstm1KtVw","stars":5,"date":"2017-04-28","text":"Superb service.  I was seen at the exact appointment time.  Danielle was terrific. Dr. Ross was terrific.  Everything that they were going to do was explained, no surprises. Great experience.","useful":0,"funny":0,"cool":0},
{"review_id":"zWI_WiRbrnt5BwtslolwvQ","user_id":"qIgy7yl3Rveq0zeFFowsTg","business_id":"Ntp-xe4x9mDAOEgpbNuPSA","stars":5,"date":"2017-01-12","text":"Dropped my Samsung S7 in a parking lot Tuesday evening.  It was run over by a car before I could retrieve it.  Needless to say, it was crushed.  Visited Nick at Quick Mobile Repair at 9:05 Wednesday morning.  He said I was in luck because it was still \"blinking\".  He replaced the front of the phone and I was back in business and out of his shop in approx. 40 minutes. Total cost was $199 plus tax.  Verizon told me I would have to pay off my contract ($560) and then buy a new phone.  It was a pleasure dealing with Nick.  He is my \"go to\" cell phone repair shop forever!!!","useful":5,"funny":0,"cool":0},
{"review_id":"l7nGVeXfDWdivkHm350qmg","user_id":"qIgy7yl3Rveq0zeFFowsTg","business_id":"Oq_xWfwt5uJj_GTdnxAMyg","stars":5,"date":"2016-09-22","text":"Danny and his team are fantastic.  They are true mechanics, not just parts replacers. With his 30 plus years of experience, coupled with his multiple certifications from GM, there is nothing that he cannot diagnose and repair.  He has worked on my 75 Chevy Caprice, 85 Cadillac Eldorado and 91 Camaro Z28 as well as my Daughter's 2003 Chevy Tahoe.  I would put Legends above every shop in the Valley.","useful":0,"funny":0,"cool":0},
{"review_id":"wfysJhgzTB5c1-J23mB7lA","user_id":"qIgy7yl3Rveq0zeFFowsTg","business_id":"c3lQY7bGBnOAncyYI0RcDw","stars":5,"date":"2014-04-19","text":"What a fantastic company with which to do business!  The professionalism, from the first meeting to the completion of the installation, was second to none.  The honesty and integrity of Sean, Bonnie and the installation crew was beyond what I could ever have hoped.  From signing the contact to the final installation we were kept informed all the way. While there were some hurdles (lack of cooperation from APS), we still received a 1st class installation.  The results are now apparent in the major reduction of our energy bills.  I look forward to a continued and long term relationship with everyone at PEP Solar.","useful":0,"funny":0,"cool":0},
{"review_id":"yJZHtOZYq71nEHdQngA4qw","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"3Z55ll2Rx43I96aozFG3Eg","stars":5,"date":"2014-07-02","text":"My favorite pizza n wings spot. Very nice owners and staff. Very clean. Lots of space to sit. So much vatiety of food to chose from. Steak plate and tawook plate are awesome too. Anytime theres a big game i come here for my pizza n wings...sooo fresh!","useful":0,"funny":0,"cool":0},
{"review_id":"6vyEJ1J9hA3b9AIxud6_4A","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"QE1tzFyyyRKV1p7C4LRukQ","stars":5,"date":"2014-07-02","text":"This place rocks. Beautiful decor. Very classy yet fun vybe to the restaurant. Super clean. Great music. The fod was amazing. Peri peri sauce is insane. Service was top notch. I reccomend everyone to check this location out. Priced perfect","useful":0,"funny":0,"cool":0},
{"review_id":"ajKs0jNo5eEyTm9ClZEbpw","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"GdCRQU3VCh_x8fY84mbwYQ","stars":4,"date":"2014-07-02","text":"Great food..huge portions...the half chicken dinner is my fav! Barg kebob is amazing as well.","useful":0,"funny":0,"cool":0},
{"review_id":"tphyOXwDejEBuMzMQGCWeg","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"fY3lvNKf5KyQUDwUz2apnQ","stars":3,"date":"2014-07-02","text":"Nice little halal pizza spot downtown. Hidden gem. Pizza is great. Burgers are not bad. Service is fast and friendly. One thing they could change is to have napkins instead of kleenex to wipe your hands...alot of variety..would def go back","useful":0,"funny":0,"cool":0},
{"review_id":"3FlwYMivahCxPWTzyhTJWQ","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"EpqlqXSjtoKhc-dNft0_ug","stars":4,"date":"2014-07-02","text":"Some of the best ox tail ive ever had. Good protion size. Service has improved everytime ive been there. Curry goat was very delicious as well. Chef is very friendly. Only issue is they charged my friend 95 cents for oxtail gravy on her rice! Never heard of that before at a west indian restaurant. Had the soup as well and it was great!","useful":0,"funny":0,"cool":0},
{"review_id":"QhPiWP_4fJoU07jq-9jXag","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"Y3FcorCGv0U-ecprHT1Hxg","stars":4,"date":"2014-07-02","text":"Best popeyes location. Great service. Owners are hands on and appreciate every customer. Very clean. Has alot of space to eat comfortably. The spicy wings are the truth!","useful":0,"funny":0,"cool":0},
{"review_id":"b9wK4KyOkF9W6Eszmsd-gw","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"uthbVCNZqmExJTzhII9iNQ","stars":4,"date":"2014-07-02","text":"The lamb dinner is the way to go. Ask to be seated upstairs as it is less hectic. The pizza is delicious as well. Seating is a bit tight. Price is a bit high for the style of food.","useful":0,"funny":0,"cool":0},
{"review_id":"AbHMq58cbPzIcntPNyopPw","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"BXg7KQWfxNF5774IU02rEw","stars":1,"date":"2014-07-02","text":"Where should i start? Was excited to try this new restaurant. Came a day before they opened and the lady at the cash was so friendly and welcoming. Came two days later and was not greeted at all. There was no way to tell where to order ...the guy near the food just looked at me with wide eyes. I asked for a mix plate (chicken n beef) he cuts the beef and asks me about my salad n rice choice. He adds the salad to the main part of the takeout container which is usually meant for rice. As for the rice..he litteraly gave me 3 regular size spoon fulls. Then adds the beef...i told him its mixed plate. He doesnt aknowledge. Removes some of the beef that already has tahini sauce on it and adds some chicken. I go to pay and the cashier is on his phone texting and i was visible to him. I ask if this is where i pay and he says yes and apologizes...i gave him a 20 and later realized he overcharged me by $3. The food taste was good but i would never go back. A new restaurant should embrace new customers and win them over forever. Interested to see how others were treated","useful":3,"funny":0,"cool":0},
{"review_id":"aUuJ43ADF5XZ1S2DPfLnow","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"ts_kVtBEAJsdmdoqxRDdRQ","stars":5,"date":"2014-07-02","text":"Very tasty food. Great ambiance. Good service.\nHummus is a must. Love the tea as well!","useful":0,"funny":0,"cool":0},
{"review_id":"4U9DyAOQjZAlAk4eRTVWcg","user_id":"2McB9CmWgZFlGWQozt6sOA","business_id":"TQcDrdS8Dbbrayu78G_myA","stars":5,"date":"2014-07-03","text":"Five stars for the taste of the food. Friends from work who live in brampton told me about this spot! The beat nihari ever...wow...all the food is soooo tasty. Youl want to sit there n eat all day. Decor is not the best but youl forget about it once u taste the food. Service is great. Very nice people. This is a hidden gem!","useful":0,"funny":0,"cool":0},
{"review_id":"MFbhiYNSdukSwPMJOOCpkg","user_id":"nR_LQstSwUHCwzL3Kh9IjA","business_id":"zMdpFu7hpvrHChR7H2XCfA","stars":5,"date":"2011-05-08","text":"Great place amazing service, the staff is on point in all aspects. Ask for \"Augi \" he's the best!!!","useful":3,"funny":0,"cool":0},
{"review_id":"6j9TPFR2YEs3qbASpfk0jQ","user_id":"qJN5wieHsYWjyGBpLKJQLA","business_id":"cOJ1uIVIHCiefUyWG2wDfw","stars":3,"date":"2017-02-28","text":"This is NOT the Blind PIG of last time I visited !  New menu and only thing on menu that is PIG is pork chop.  No ribs !!!!!   And almost nothing without carbs!   Still a great staff and atmosphere!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"CbyZBK6wXZQJZFkpuH8gZA","user_id":"CL5s57su_T4C2JwgrAVA4A","business_id":"ovnqQaQ8BsPgDoJ4nlYBUw","stars":2,"date":"2015-08-03","text":"Yeah of course they ran out of their London fog icecream. Literally as I ordered it because some couple stopped my server so they could order first even though they had their own server.. And yeah, fix your door.","useful":0,"funny":0,"cool":0},
{"review_id":"Fob0TWijBRGrCoYttVeP6A","user_id":"J7eL6AL1TUe809bPykIUcA","business_id":"gdtZA3sVQ5Hk-3oPBArdLA","stars":1,"date":"2016-06-13","text":"I have gone to several locations without my physical rewards card, and the employees have printed out receipts w\/a claim code for me to use at home to get the points. HOWEVER, this location had rude confused employees that have never learned how to do the same and acted as though I didn't know what I was talking about. To the owner\/manager, please keep your employees up to date with how other locations function. What an absolute annoying experience!! I will not return to this location.","useful":2,"funny":0,"cool":0},
{"review_id":"5db6V_jQxHR1pxTptdk_vA","user_id":"WkzKeTFMdBelxbYptwh5kg","business_id":"UPIYuRaZvknINOd1w8kqRQ","stars":5,"date":"2012-01-02","text":"All I want to do is eat here all the time! I had the Miso Ramen with pork and it was the best ramen I have ever had.\n\nShow up early as there is usually a line just to get in right when it opens.","useful":0,"funny":0,"cool":0},
{"review_id":"HK53OvBgibiu7_v1VQK5wA","user_id":"I65VBFdAY4UFzBxOcFD4KQ","business_id":"s8PwBK300SvyJ-dxL-FOpg","stars":1,"date":"2016-09-03","text":"PLEASE DO NOT GO THERE! They are only interested in making money. They recommended extreme measures that were not necessary and kept pushing tests, injections, hospital stay and surgery that was not warranted. The vet, the assistant, and the front desk staff kept trying to push expense procedures. I knew they were just trying to scam us. After paying $260 for a visit and x-ray and rejecting their other recommendations, our pet is doing fine. He just had an upset stomach and was fine by the next morning. They never followed up with us the next day to see if our pet was okay. VERY DISAPPOINTED! PLEASE BE AWARE!","useful":1,"funny":0,"cool":0},
{"review_id":"ZnyCKNapZ3U7aGPW7CYISw","user_id":"ta8pBENHnIx5M-BYSVrhYA","business_id":"Z_wOfCE5E6o_xaeL1avuLQ","stars":5,"date":"2016-07-26","text":"Being a first time mom, I was extremely nervous about my son getting tubes in his ears. Dr. Fucci walked me step by step on how the procedure goes and how painless and easy it will be for my little guy. He gave me a ton of relief and I knew my son would be just fine. I recommend Dr. Fucci to anyone in the Valley. Great staff, great advice, and an all around great Dr. and person. Thanks Dr. Fucci!","useful":5,"funny":1,"cool":1},
{"review_id":"g18RUmIv3HMFXQHWLrbm7g","user_id":"ta8pBENHnIx5M-BYSVrhYA","business_id":"AKwn9oWzFwm4TNYzVY08DA","stars":5,"date":"2015-04-07","text":"Had nasty urine and poop stains from my dog and thought the smell would never disappear after I found my dog a new home. Had Cliff from Certified Specialists come out and he completely fixed my carpet to where it looks brand new now! Plus people don't have to walk into my apartment plugging their nose! Saved me from getting yelled at by my apartment complex AND he gave me a great price! Thanks Cliff! Definitely going to use you in the future!","useful":2,"funny":0,"cool":0},
{"review_id":"nAwHI5R5pYQxl2PMaPOEiA","user_id":"ta8pBENHnIx5M-BYSVrhYA","business_id":"FUZSxfQbZbuNxkyCR3Hj2g","stars":5,"date":"2016-10-24","text":"After my pregnancy with my first child I was looking for a trainer to help me lose the baby weight, learn how to eat healthier and be my cheerleader through my weight loss journey. John Turose has done all of that and more! Not only have I lost 30 pounds since working with John, but I have gained muscle where I never thought I could. He pushes me to do my best and gives me the confidence to try harder. I HIGHLY recommend John to anyone who needs help losing weight, wants to build muscle, fix their posture, or anything when it comes to your body. He is AMAZING!","useful":0,"funny":0,"cool":0},
{"review_id":"9vdgCf5YssXXwURzDqX4hw","user_id":"N3nQ4CclmbNepoJmFCm7Ng","business_id":"JVbhg2uUmjp0Acs72gP7rA","stars":2,"date":"2013-02-09","text":"- song selection sucks\n- customer service horrible\n- microphones don't work\n- shitty sound quality\n- walls are paper thin (although this was kind of a positive because we could hear how much fun people in the next rooms were having)\nOVERALL NOT A GOOD KARAOKE PLACE.","useful":0,"funny":2,"cool":0},
{"review_id":"b-xu1CrYqh5cVFctAlDZfg","user_id":"N3nQ4CclmbNepoJmFCm7Ng","business_id":"j-_edie1hOUgWVHUGjSfKg","stars":2,"date":"2011-11-23","text":"meh ive had better. its not much cheaper than pretty in the city either so just go there.","useful":7,"funny":0,"cool":1},
{"review_id":"W2fOCuQjnGUMubaqE0ObVQ","user_id":"N3nQ4CclmbNepoJmFCm7Ng","business_id":"POB0Ng3wbILP5OmpVvGPOQ","stars":1,"date":"2011-12-19","text":"i got my nails done my cindy. i got biogel fake nails. she clumped on the biogel like cement and then shaved it down till my fingers were numb. i got home and one of my nails is lifting already. she told me to come in the next day to get it fixed by anyone because its her day off. i called to make an appt and the very rude lady kept saying but cindy is not in today. she then very rudely told me to come in whenever. I will never ever come back here again. go across the street to the other nail salon with the red sign they are friendlier and do a better job. they just happen to be closed the moment i decided to get my nails done.","useful":0,"funny":0,"cool":1},
{"review_id":"mpNaGq0ylyDNf6JKYky69A","user_id":"N3nQ4CclmbNepoJmFCm7Ng","business_id":"R5ZvZ97FDp2bD93CNKg-zQ","stars":3,"date":"2013-07-29","text":"Coming to this place is like rolling the dice and praying for meat that isnt too chewy or sushi that isnt too funky. It was definitely better a few years ago and has since gone downhill. Service is not so great either. If you get a waitress that speaks english then consider yourself lucky!! I'm asian so thats not racist.","useful":0,"funny":1,"cool":0},
{"review_id":"VjWmA3fV4hlyR1k92S_vWw","user_id":"MmOlteGoOLp4uydXpW7EHg","business_id":"NFv21m2Czqz2XM5G4kpbKg","stars":1,"date":"2016-07-17","text":"Zero stars!! My friend and I went to this Whole Foods this past Friday and had the worst experience. While standing in the area by the spring water, my 2yo was fussing. I noticed a customer and the cashier looking at us. The customer shook her head and turned back to the cashier and made a motion with her hand smacking her lips. The cashier laughed and made a motion cupping one hand and back hand smacking the cupped hand with his other hand. They looked at us again and the customer kept talking while she was frowned up. \n\nI went to them and said I know you're not implying I smack my child. They just looked; the customer still frowned up. As I walked away my friend still stood there and said they kept looking at us while making comments. \n\nAfter this we spoke with the supervisor who claimed she was the highest in rank there. She seemed to not care because she said I'll talk to him nonchalantly. She said I could go online to get in touch with the corporate office since I wasn't satisfied with her response. She also gave us a card and pen to fill out with comments about the store only to later come back and say she needed the pen back because that was the only one they had. \n\nBefore leaving we talked with a cashier who pointed out the manager to us. Then the cashier who was making the motions with his hands came to where we were and started talking to us saying he has a 5yo so he knows how children act up. Obviously the supervision said something to him. He had an attitude and said he wouldn't be talking to a customer about another customer and we had mistaken the whole thing. \n\nOnce leaving we talked to the manager about the hand gestures the cashier and customer made. He said he's worked with the cashier for years and he wouldn't do anything like that. He claimed the cashier smacks his hands a lot while talking and that when he came over to us told he apologized for his hand gestures. I told the manager our conversation was over because the cashier never mentioned anything about his hand gestures and only had excuses, not an apology. \n\nIt's nice to know that the Whole Foods staff sticks together no matter what from the top on down. I will find out if Corporate sticks by this kind of foolishness. \n\nOh... Before I left I saw the cashier pushing the supervisors cart to her car and they were chatting it up for a while.","useful":2,"funny":2,"cool":0},
{"review_id":"HDKdiJXa6GYAfZDV5JVWnw","user_id":"MmOlteGoOLp4uydXpW7EHg","business_id":"C4gZY6CsTVoF_X_j1Cp1Lg","stars":5,"date":"2016-12-21","text":"I went in for my normally scheduled maintenance and had the pleasure of working with Dan. The mechanic found a nail in my tire and it was replaced with no out of pocket expenses due to the coverage I added for my tires when purchasing my vehicle. The timing of the service was not too long. Thank you!","useful":0,"funny":0,"cool":0},
{"review_id":"iWL20DdQRBHNWap7aPyH8g","user_id":"MmOlteGoOLp4uydXpW7EHg","business_id":"BPyopyEntbl4obte91gNrQ","stars":5,"date":"2016-07-17","text":"I came to see the new Trader Joe's and had an excellent experience. The staff was very helpful and the store was nice and clean.","useful":0,"funny":0,"cool":0},
{"review_id":"ACYTFPIdMnQdP5KcTgdOIQ","user_id":"gGW4nPk86iujV7QWPzOW8A","business_id":"IMlVSAmQMfKp0ltI2D0SPA","stars":5,"date":"2017-04-07","text":"JULIE at MOD STUDIO is awesome! She has been my cut and color stylist for many years...I have followed her to many studios and am so pleased to see her in her own place! The set up at the Beauty District at Desert Ridge is great and Julie has a beautiful studio. She is a great listener and really wants you to be happy with the end result. I always leave feeling good-inside and out!  Thanks Julie!!!","useful":1,"funny":0,"cool":1},
{"review_id":"SkdaOSml2fZtokD__Pi0cw","user_id":"gGW4nPk86iujV7QWPzOW8A","business_id":"Q997r9eE0cd3PQH0wUNdqw","stars":5,"date":"2015-02-17","text":"I have been going to Aspire since they opened in N Scottsdale. They are now on High Street ... It's a pretty salon in a fun location. Julie has always been my stylist. She is awesome! She always listens to concerns and is committed to being sure you are happy with the end result. I always look forward to my appointment because it's always great to catch up on our lives and walk out looking great!!! Thanks Julie!","useful":1,"funny":0,"cool":0},
{"review_id":"khuJKV53JdKiQ5v-QpP5ew","user_id":"gGW4nPk86iujV7QWPzOW8A","business_id":"wQWhzyZNzFQKAOiSVEXCwA","stars":5,"date":"2017-01-10","text":"I truly appreciate the service I received today from Vladimir at Phoenix Appliance Services.  He was very accommodating to my schedule and came out same day to fix my GE fridge.  He was extremely knowledgeable and polite.  I absolutely recommend him without reservation!","useful":0,"funny":0,"cool":0},
{"review_id":"BJMQSCLgzrqDjlkcQGJbVQ","user_id":"SS41k-oHTHw2yBhhrEH4Rg","business_id":"gZGdAgYHCJUbh-uKpZiMMA","stars":4,"date":"2013-06-06","text":"I got a great haircut from Pamela! The wait was short and the atmosphere relaxed.  I used to go to Great Clips but this was a superior experience in every way. She used a straight razor on the back of my neck and to straighten my sideburns, and we had a pleasant conversation that passed the time.  I would recommend Ray's.","useful":1,"funny":0,"cool":1},
{"review_id":"xhbZ5-fSErn3V6XHAOyOBQ","user_id":"NqpqzTdGg6YzaRNIauj7MA","business_id":"OkLqpxpbvU2N2-OGDn0yiA","stars":5,"date":"2016-03-03","text":"this place is sooO lovely! stumbled across it a few months ago. such a cute little date spot and the pastries are morsels of heaven. although it is a bit pricey it's totally worth it and I never mind supporting a quality local business. Treat yo self to Coquette for sure!","useful":2,"funny":0,"cool":0},
{"review_id":"MCW1MdNh3qQaOR7Oy8ET8g","user_id":"NqpqzTdGg6YzaRNIauj7MA","business_id":"1u4EvujoBP37oEL4SGLpgA","stars":3,"date":"2016-03-03","text":"I've only been here a couple times just because the atmosphere is kind of dark and musty. I wish they would use paper cups instead of styrofoam. Styrofoam really cheapens the whole thing. The coffee wasn't bad but nothing really special either.","useful":1,"funny":0,"cool":0},
{"review_id":"z-xrST32ztEeBmup0YYI8Q","user_id":"3walcNgGR1EYBiuGo0IaLg","business_id":"uZ6hNIEQvTZZDPPvgbfoXA","stars":1,"date":"2015-08-20","text":"Shane Wilson is horrible with coloring hair.   I came in for partial highlights. I've been getting my hair highlighted for 20 years and never had this kind of experience.  He fried my hair... He painted an inch size band around my face. He didn't use foils and painted it right on my scalp. The next day when I washed my hair it was sticky and stretchy like spaghetti; falling out by chunks...  absolute disaster. I spent the whole day trying to restore my hair.  I asked Shane for my money back and he got defensive and basically said I can try to fix it or you can go else where... He didn't do it right the first time, you think I'm going to trust him to do it a 2nd.   One month later and my hair is still messed up.. Don't trust Shane with coloring your hair. BEWARE","useful":3,"funny":0,"cool":0},
{"review_id":"w0NknzADxjwxvNznxr9cpg","user_id":"hC_IckNXAty-vBFZlHKQxw","business_id":"6OkjUz-I552moryf3qN1Gg","stars":1,"date":"2015-03-21","text":"I went here today for a nice meal. The waiter was great. I asked for my dueling lobster tails to be served without shrimp. The meal was brought out with the shrimp in it. Even though the manager asked me what I needed and apologized, there was no offer to take money off of my meal for the mistake. In addition, I was charged ninety nine cents because of my request. This is not how customers should be treated.","useful":0,"funny":0,"cool":0},
{"review_id":"VJXljg80PNYr5rKDI-4Ltw","user_id":"xtR3Eg14CStCnFsyfgzMIQ","business_id":"q70zfSFnQeKDiRltb7eXuA","stars":1,"date":"2014-10-10","text":"I attended this location on a Wednesday, one of the days they're open late. I asked the girl working at the reception if an appointment was neccessary for a cut and colour. She informed me that no, an appointment was not needed. She was nice, cheerful and informative. She told me about the current specials as well. I said that I would return the following day. \nThe next day, I returned to this location at 5:30 with a friend. We both said that we wanted a colour and cut. It was the same girl working at the front desk. She was disappearing, on and off the phone, and otherwise out to lunch - so to speak. She gave us forms to fill out with our contact information and told us it was an hour to an hour and a half wait - Really, no appointments? She then got on the phone and made herself unavailable. My friend and I stood there waiting for someone to assist us. Eventually, the instructor, who had been busy doing another sudent's highlights in plain view, came over to take our forms and she said she would call us when our spot was open. \nMy friend and I went to some shops in the plaza to kill time. 6:45 rolls around and we still hadn't gotten a call. We went back into the school (I don't want to call it a salon...) and let the front desk staff know we were back. We waited until 7... Nothing. They wouldn't even give us an estimate on the time. They said there were two people ahead of us. I struck up conversation with a woman who was also waiting. She said she also came in arounf 5:30 - for a ROOT TOUCH UP - and was STILL waiting. She made a good point... she could have gone home and done it herself in that time. I approached the desk around 7:15 and spoke to a student, the same student who was getting highlights done in her own hair earlier. She told me that as soon as she was done - and pointed to her own hair - she would help me. Um... ok.\nAt 7:30, we were still not served or given a time that we would be. I approached the desk and informed them we had been waiting 2 HOURS and that this was entirely unacceptable and bullsh-t. The same instructor that was doing highlights on the student earlier had only said \"I do apologize.\" I told her she should be teaching these students professionalism and correct customer service, neither which was present in this place.  I also let her know that I completely understood that this was a SCHOOL and not a salon, and that I therefore knew it would be a little slower but that it was common sense to let their customers know what was going on as we had been waiting. she kept saying \"I do apologize\"... nothing else. I asked once again what the time frame for waiting would be. She then said half an hour to an hour. I asked her if she was for real... to which she said yes. I then told her we are NOT waiting three hours for this... and told her to dispose of our contact sheets that we initially filled out. I told her, now with an audience of two students - one who was the girl working the front desk - that I had attended this location the previous day and thought the prices, staff and reviews looked good. I told her I had recommended this location to my friends and family to check out. I then explained that I would retract that and that I would never recommend it again.\n\nWhat a terrible experience. I'm looking at this as a blessing in disguise!","useful":0,"funny":1,"cool":0},
{"review_id":"STP2dkU2UGfeZqgj3cKqMw","user_id":"ZRqLxkrnP1T8dVCs26X41Q","business_id":"zBN0QWgGeeVJ4gF3UeLo6w","stars":1,"date":"2011-10-12","text":"I have got to admit it was not what I had imagined when entering Riad.  I'm thinking of a Moroccan feel, very aromatic\/herbally, and very calming music.  I also imagined separate rooms for each service offered...What I had received is this..\n \nEntering on the 2nd floor of a very old building, into just a regular room with a high chair\/foot rest on one end and the manicure station next to it.  Also in the room was the Moroccan sit down\/waiting room along with the front desk.  So this small room consist of all of the setting described above.  Then in another room was the facial station\/massage station separated by a curtain.\nI wouldn't have such an issue with the setting but I did have an issue with the experience\/professionalism of the service. Please see below:\n \n1)  The short hand and toe fix is just taking off our nail polish and clipping it down.  Followed by continuous filing on your nails that actually was unnecessary because it was already to the skin part of the nail (that really hurt).  Also my cousin had stated that she had extra skin that is near her fingernail so it was already cut to wear she wanted it but the owner insisted she knew what she was doing and that she will cut it.  On top of it, she did not massage my hands nor my foot.  Shows that she really doesn't listen to her customers.  What is nice was the paraffin feet and hand that she provided.\n \n2) Then we went into the massage\/facial room.  I was given the back scrub first and my cousin was given the facial.  My back scrub was fine.  My cousin's facial was fine for the most part.  Now the funny thing is, so she gave me 20 minutes to relax and then came into the room to wake me up.  I do not think her assistant knew what she was doing for she kept asking the owner what to do.  Then, she told me I had to go shower!  What????  So she stood there in the massage room while I was naked trying to get on my robe (weird). So...she took me to a bathroom down the hall..the bathroom was so disgusting and I had to get up in the stand up shower to rinse off my back  and the paraffin hand\/foot treatment.  While I was in the gross disgusting stand up shower, barefoot-keep in mind, the woman opens the door and asks if everything is okay.  Who does that??\n \n3) After the shower, I came back and sat in the massage room.  She told me to lay down again and she gave me I guess at most a 15 minute \"moroccan massage\"-which was not relaxing at all.  And on top of that her hands slipped and punched me in the cheeks.\n \n4) Facial was okay.  I don't think the towel they put on me was a clean towel.  I felt like it was the same towel that was probably from my feet.  The facial was nothing spectacular and it did not serve it's justice.\n \nI really, really had a bad experience with this massage place.  I feel mostly bad for my cousin because she's never been to a day spa.  What she experienced is not a good impression of what a dayspa should really be.  She was not a licensed massage therapist but yet she wants to do all services.  If you are not experienced..you should not do it.  It says on there she was a licensed podology.  She kept pushing her product line and repeatedly informed her that we were not interested.  At one point, I told her I was from the states and that I was flying home so I wouldn't be able to carry all the products onto the plane.  She suggested that I send it through the post office..ummm I don't think so.  It would cost alot of money to send out of the country.  And last but not least her hidden fees.  So I guess this living social deal did not include the taxes.  She charged 13% for Canadian taxes and then an automatic service fee (which I think is a bunch of bullshit since it was crappy services) of 17%.  So we already paid 99.00 for the services and then forced 30.00 for fees\/services?  Really??  \n\nI don't think I will be going back....","useful":0,"funny":0,"cool":1},
{"review_id":"K1u4tBI8-GCc7P_Ra2lmLg","user_id":"mBpRrVzcUsLViA1r4Cua1Q","business_id":"PycR_Mr5jA9jB4Xg3nX0Yw","stars":1,"date":"2015-03-14","text":"This is the worst rental car company I've ever dealt with.  Not only did we have to wait for an hour and a half in line to pick up the rental car, but the company added on a additional charges for fuel (even though I filled the tank full within a few miles of the rental car return) as well as late return fees.  \n\nWe had returned our vehicle on time according to the rental agreement, and when we did, their system was down.  We asked for a receipt or something showing the car was returned on time and they told us they couldn't provide anything.  When the final charge came in, they added on a late return charge and printed the receipt after their system was back up.  \n\nI will never use this company again and I recommend you avoid them too.  The price is initially low when you reserve a car, but they add on false charges afterward.","useful":14,"funny":1,"cool":1},
{"review_id":"S8u4NZDxMhD6U1XC9qmXJA","user_id":"_tKbJnlGSFEjPgJ_mOk_TA","business_id":"eAZqT24e0Pk8apWzy3RsAQ","stars":1,"date":"2013-12-08","text":"The food was very average. I just don't see the draw to this place. We went on a Friday night and the place wasn't crowded but it was full of bikers and loud folks. Smokers on the patio and a huge dog (brought along by a guest) stared us down the whole time we ate. He even lunged at my husband. The ribs and chicken were dry, as was the Mac and Cheese. The upside is our drinks were great. So I'd say go for drinks, skip the food, don't expect any sort of civility from guests.","useful":1,"funny":1,"cool":0},
{"review_id":"YTF9tuO2_F5NlHYUMg_Rkg","user_id":"_tKbJnlGSFEjPgJ_mOk_TA","business_id":"iyFS4twFjCKfaKl7kUl3sg","stars":5,"date":"2013-11-15","text":"Harry's is awesome. The brunch is perfect, the staff is friendly, the location is wonderful. What more could you ask? We go there every weekend.","useful":1,"funny":0,"cool":1},
{"review_id":"9OUMFxo-TcIa41rscfIaiA","user_id":"k8KKxnmCZkubXp2bfMp0Dw","business_id":"6o9Y55T6uJndAfl4QHsKdw","stars":1,"date":"2013-05-29","text":"nun werde ich nach längerer QYPE PAUSE wieder mal einen Kommentart abgeben\nleider ist das Eis nicht besser geworden die Früchte im Eis fast unsichtbar\n die Bedienung sehr lahm ,ausser man kennt sich dort und lebt t mit der Grünberger Bussi Bussi Szene und der Chef bemüht sich eigens um seine Freunde dann ist man dort gut aufgehoben Andere Gäste aber warten teils 30Minuten bis man bestellen kann man wird dort an manchen Tagen gerne übersehen ! aber jedem das Seine wer dort sitzen möchte sollte sich nicht beschweren .","useful":0,"funny":1,"cool":0},
{"review_id":"MMifNAb9ZlFM0EAV20AURg","user_id":"k8KKxnmCZkubXp2bfMp0Dw","business_id":"1JL8aScZuo4eDpx55hZudg","stars":4,"date":"2012-11-21","text":"Hallllo!\nNun auch ich möchte gerne mal etwas positives über unser Grünberger Körperforum berichten.\nhabe dort meinen Fitnessführerschein gemacht und bin angenehm überrascht , über die Freundlichkeit und Hilfbereitschaft der Trainer und anderen Mitarbeitern. \nIch werde weiterhin dort meine sportlichen Leistungen ausüben.\nes ist nur schade das sich auf manchen Beiträgen so einige Nörgler und und Nörglerinnen befinden die das Forum mies machen aber dann liegt es oft an den Kunden selbst wie sie sich in diesen Forum einbringen.\nich bin der Auffassung Probleme und Missfallen sollte man ansprechen,\nund allen Anderen wünsche ich ein gutes Miteinander in unseren Forum!","useful":0,"funny":0,"cool":0},
{"review_id":"VsShfuz1B1sDxLup1DrUbQ","user_id":"k8KKxnmCZkubXp2bfMp0Dw","business_id":"4_jgrKQg3g8DvxECZr28uQ","stars":3,"date":"2013-03-18","text":"also ich pflichte bei, das die Preise schon etwas erhöht sind schliesslich sind wir immer noch auf dem Lande,,\nund der Kaffee ist viel zu dünn wir sind ja nicht am Bodensee wo man bis zum Boden gucken kann \nvielleicht nimmt sich Frau Lukasch das ein wenig zu Herzen.","useful":0,"funny":0,"cool":0},
{"review_id":"2VuQdH_tUxVQyA0h4Emnyw","user_id":"LGnVJYdObYMD8vkatrxt_A","business_id":"7T_2djdY6ldRugsuWb2S-A","stars":5,"date":"2014-09-07","text":"I am a regular customer of Coras. I absolutely love that location. People are friendly, fun to talk to and they serve fresh orange juice. Not only that, the portions are huge. \n\nTheir salmon Benedict is just astounding. There's nothing much I can complain about the place. Oh! And the bottomless coffee.. MM mmm","useful":0,"funny":0,"cool":0},
{"review_id":"5Uk9foAeUIY4Wx620975Qg","user_id":"LGnVJYdObYMD8vkatrxt_A","business_id":"-b94nkPVLQw95zgtDhcpYA","stars":1,"date":"2016-12-03","text":"They are really bad. Staffs are incompetent, screwed up my order, food took forever to come (we probably sat there for an hour and a half), the servers straight up ignored us when we wanted to ordered food. Like honestly, how can you screw up on a order for burgers...it's really not that hard..... I would not recommend anyone to go to that place as you can probably find better food elsewhere. Their poutines are decent tho, the server (well... the tall dude) is rude. I don't think they got the hint that we wanted the bill until they saw us standing there with our coat  for good 10 mins with my credit card out.","useful":1,"funny":0,"cool":0},
{"review_id":"F4FJzjj9GaXcp9EoAo14vA","user_id":"LGnVJYdObYMD8vkatrxt_A","business_id":"9v9cMGBpUm_IzTuPfXXEOw","stars":1,"date":"2014-08-05","text":"This place does not even deserve 1 star. The service was very disappointing. My waitress was playing with her phone and it was almost impossible to get their attention. Not only that, she was giving me attitude for no apparent reason. \n\nFood was okay. Service was not. I would never go back there again. Ugh","useful":0,"funny":1,"cool":0},
{"review_id":"ylVOv9mctHXo-09XEKam4w","user_id":"LGnVJYdObYMD8vkatrxt_A","business_id":"nrOxXGd3Vx6iz5xuIJT8cw","stars":2,"date":"2016-01-14","text":"Regular here. I'm from Vancouver and I always keep an eye for decent sushi in Toronto. I used to go to this place once a week... not anymore\n\nGood sushi, fair price, discount of takeout, what's not to like? \n\nYesterday, I went there for my usual Love Boat take out order and I noticed that huge price jump. The price for the Love Boat B was 45.99 and it's now 62.99. I was initially confused by it and then realized that they've changed all menus. Looked around and the restaurant is now empty without any take out order then everything started to click and I know why. \n\nSince I have to wait for the order to come, I went back to my car and grabbed the old menu and went back to the restaurant to compare with the new prices. The lady came by and took my old menu away! Sneaky sneaky\n\nIf anyone has any recommendations to any other comparable sushi restaurant, it would be greatly appreciated. $17 price jump on the same order is not cool. As much as I love sushi, I'm not paying that.  \n\nI'm going to miss that nice lady that yells \"hello, AKANNNEE\" on the phone","useful":5,"funny":2,"cool":2},
{"review_id":"BvmhSQ6WFm2Jxu01G8OpdQ","user_id":"etbAVunw-4kwr6VTRweZpA","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2017-05-10","text":"Loved the fried goat cheese in tomato sauce along with dogfish 60 minutes IPA. Very nice view of the Vegas strip along with excellent service","useful":0,"funny":0,"cool":0},
{"review_id":"3SheDCLpvTBPK8b_L2q8jg","user_id":"etbAVunw-4kwr6VTRweZpA","business_id":"gNhxs9nPUSkVBSSIRQOgaA","stars":5,"date":"2017-05-09","text":"Excellent food - take this from an Indian foodie!! I Tried vegetable Thali - chotey, saag paneer, daal, Raita, hot naan and rice along with chopped onions and pickle","useful":0,"funny":0,"cool":0},
{"review_id":"Fv5_99pM3qJdpFo1Yqb2vA","user_id":"wR_jmLaie-HrdsxDYCf2xA","business_id":"yt1HMXF-dUfUEZQQtv16Ew","stars":3,"date":"2013-12-14","text":"It's very nice....but Augustus is still my favorite.  The spa is on that side.  You can read from the earlier posts....welcome tea, robes, slippers, turn down service with a lavender spray, our elevators worked perfectly....need your key to get to the elevator...to get to the room. The staff was fabulous...! Also, the spa at Caesars is fantastic....if girls are going...it's a must...take your suits..relax...and you have access all day.  Bottom line...I love Caesars!","useful":2,"funny":0,"cool":0},
{"review_id":"Ib2V-CbcCI7F7sylJ55Dug","user_id":"wR_jmLaie-HrdsxDYCf2xA","business_id":"hRQS8y-uG2kc8miWVYiLuQ","stars":4,"date":"2013-12-14","text":"Celebrated my 50th birthday here December 7 with a party of ten.  Our experience was fabulous.  We arrived when the doors were open...we were going out that night and wanted to take our time, eat, and enjoy!  That we did!  The staff was wonderful.  Everyone really enjoyed their meal, the service, and the experience.  Can't wait for the next special occasion!  Yes, the location is not eye catching....and the decor...I'll say...vintage, but I love that old style!","useful":1,"funny":0,"cool":0},
{"review_id":"0xeunj5iE2VGj_A09rp4KQ","user_id":"jczg3Je7CYjh6HOsW5_veA","business_id":"tEfvf1cznLZUIeTcKKpAIw","stars":4,"date":"2015-08-17","text":"If you like Taiwanese food or just a fan of chicken, Koo Koo Chicken is for you.\n\nI got the chicken bites with fries and a taro bubbletea. The food is incredibly well-seasoned and filled with flavor, the chicken is tender and not too overcooked. I love the variety of topping spices they have (seaweed, black pepper, spicy, lemon, etc) that go really well with the chicken and fries. This is a new favourite for me anytime I'm in town!","useful":0,"funny":0,"cool":0},
{"review_id":"obseAFpr2qe18wxbNHpQUQ","user_id":"jczg3Je7CYjh6HOsW5_veA","business_id":"sGAbBm8eX6DY5R5S2NSy6g","stars":5,"date":"2015-08-07","text":"We had afternoon tea at the Lobby Lounge on a Sunday afternoon for eight guests.\n\nThe ambiance is wonderful, with live musician playing a piano rendition of modern songs. \n\nThe quality of the food platter was excellent. There was a large selection of sandwiches, biscuits and desserts for everyone and it was quite filling. Each bite had a unique and vibrant flavor. I was blown away, everything just tasted so good.\n\nThere is a big variety of teas. We poured ourselves a cup of tea and then rotated our teapots so that we could try everyone's selection. Each tea had its unique aroma and taste.\n\nIf I had to complain about one thing, it would be the speed of the service. Our waitress was friendly but there were only two wait staff in the dining area serving a lot of guests at the same, so it took a long time to get our bill and leave. It was an 1 hour and 30 minute seating time but we stayed for 2.5 hours because of the wait.\n\nOverall, I had a great experience and I would love to come back.","useful":1,"funny":0,"cool":1},
{"review_id":"_lx9VWnSIPcfGiFmmM0ZMA","user_id":"a6DvTzukz1wsL2F-vxRYig","business_id":"Vsw36dEKpusmpwGsZH0pAg","stars":5,"date":"2016-08-30","text":"I used their services for 2 different events. Both contained special requests. The cupcake cake I ordered was not only beautiful, but delicious as well. The specialty cupcakes I bought for party favors were amazing and the guests who received them are still raving about them. Emily, the store manager, is wonderful and both orders were exactly what I asked for. I highly recommend using them for your next party.","useful":2,"funny":0,"cool":0},
{"review_id":"mPbXUwLHrhUqmwK8je5Qmg","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"ZU7aTTXWe7CZT_mSTxj4cw","stars":5,"date":"2016-08-11","text":"If your looking for a Title loan on your car..your at the right place\nAmazing Customer Service, and the process is fast and easy.\nI have  used  them a few times and it's the best... \nThey also treat you the (Customer) very well.\n\nI find the rates are good and they give you a date when your loan will be paid off.\nIf you need a loan TODAY! This is the place to go!\n\nRoger Pineda","useful":0,"funny":0,"cool":0},
{"review_id":"arsRJxXIo3pEsML7_P97XQ","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"BbH_waWdlUMjiEr__lTAIQ","stars":5,"date":"2017-09-04","text":"What Can I say..They are the BEST!!!!!\n\nI took in a poster to be Framed, that needed some custom work and colors...\nWhen I went in to pick it up WOW!  It was fantastic!!\n\nAlan, the owner suggested a way to frame it...and he was 1000% right\n\nWhen I got home it looked great on my wall..\n\nIf you're looking for the perfect framing, this is the place.\n\nPrice was good..and service was excellent and it was done in a few days..\n\nWhen you go into the store, you can see some great Framing they are doing for other clients.\n\nA Very Happy Customer!\n\nRoger","useful":1,"funny":0,"cool":1},
{"review_id":"0YR41zN9j2oJDIpLNfmiZg","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"rp20zYiJoV4WsmFXBOCpew","stars":5,"date":"2017-10-18","text":"I stop in to get a price for replacing my car carpet...the car is my work car and after 2-years\nthe inside was awful beyond cleaning..The owner- Chuck, looked at carpet and gave me price that was fair.  Other Upholstery shops that I went into... the estimates were ridiculous....\n\nI brought the car in for repair, and the JOB was FANTASTIC!!!\nAnd it was a done in a few hours.\n\nThe carpet match the one I had in the car...and the carpet was much better than the one in the car when I bought it new.\n\nEverybody was very nice...and Chuck, answered all my questions..and I could tell he knows he's stuff...\n\nI'm a very happy customer...and so glad I found C & L Upholstery, they are the best!!!\n\n\nRoger","useful":0,"funny":0,"cool":0},
{"review_id":"O6FedTL_R5c60mS6Nawrvw","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"UDucqwO8PwUOwcmUsJ-gOA","stars":5,"date":"2016-10-19","text":"My son told me about this place. Said the the food was excellent and the tacos were a WOW!!.  We were out together and decided to have lunch there and to our surprise they are closed on Weds.\n\nA  few weeks later I was in the area stopped in to have lunch. The tacos were amazing and everything else that came with the meal.\n\nI stopped in again yesterday and the food was great..\n\nIt's worth the drive and you will NOT be disappointed and the prices are good.\n\nI don't write a lot of reviews, but the time to do this is well worth it.\n\nTry it once, you will come back for more.\n\nRoger","useful":0,"funny":0,"cool":0},
{"review_id":"vHMRkVFFtxgyLyitHAXzPg","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"YN_uJtl4tvRTTmxPM2VTmQ","stars":5,"date":"2017-10-17","text":"It took me  3 or 4 months to find the right Auto Body Repair.\nAfter getting repair estimates from other repair shops that were ridiculous\nI stop in at Northern Auto & Equipment to get a estimate..\n\nThe price was fair so I said ok I will have them fix my car.\n\nWOW!!!  when I pick up my car, its was perfect!  \nThe body work was done right, the paint matched perfectly.\n\nEverybody was friendly and they answered all my questions\nand the price was exactly what they said it would cost.\n\nI'm a HAPPY customer...if your looking to get your Autobody work on your car..\ngo there and see for yourself\n\nAlso, my car was fixed in a timely matter..\n\nRoger","useful":0,"funny":0,"cool":0},
{"review_id":"4wR5udNS5GLlblmZFocXEQ","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"Zp9RMGJKVc9Qkhj4QqyROw","stars":5,"date":"2016-10-12","text":"The food is excellent and prices are good.  The owners are friendly and they always welcome you with a smile!  \nThe Place is spotless, I went to the restroom to wash my hands and I was amazed how clean it was.\n\nMy son and I, when were on Deer valley we always go there for lunch...\n\nThe service is very good. We never have to wait long to get our food.\n\nI give them a 5-Star rating, because I like everything about this place.\n\nGive it a try, you will not be disappointed and the food is GREAT!\n\nRoger","useful":1,"funny":0,"cool":1},
{"review_id":"4kfVihLXmKiB8WtcMdx-cQ","user_id":"2dJm6oGr5FmoPw9S5Q6aGA","business_id":"hEu9xC836j8D1PwUjRDyXA","stars":5,"date":"2015-10-06","text":"The Best!!!!\n\nThe work is excellent..I took my 2014 Toyota Camry to get my bumper fix. Just had my new car for a few months and backed up to a pole.  When I got the car back the paint was a perfect match.\n\nThe service was awesome, very friendly and helpful and answered all my questions.\n\nThe car was also fixed on time and the car was totally washed and cleaned inside and out\namazing service.\n\nThey get 5-STARS, because everything they told me was done. And most important the work on my car was PERFECT!!!\n\nIf you want your car done right, this is the place.\n\nRoger Pineda","useful":0,"funny":0,"cool":0},
{"review_id":"WbDa1m6ZZ60nOshThaIdaA","user_id":"pJ72lLBh1Ll-ct9fNUy18A","business_id":"XGOyiBZ67eaF11DXY-Xtyg","stars":5,"date":"2017-04-02","text":"I had the BEST experience here yesterday! Found out the gender of my little girl at 15 weeks and 6 days. The tech was amazing and so nice. Also, the man who made my appointment was very kind and professional. \n\nAlso, after I finished filling out my paperwork and used the bathroom, I went back to the lobby and there was a couple there who bought me a heart beat animal! How nice is that?! Seriously made my day and definitely my week. I wish I knew how I could thank them in a better way because I cannot show my appreciation enough! \n\nWill DEFINITELY be coming back later in my pregnancy! I haven't been treated this well by a business in a long time! Thank you, Miracle View!","useful":3,"funny":0,"cool":3},
{"review_id":"p5h4jyaf2HFXL8QC3Pi7zw","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"pQpre1XGF1l4vh8XE1Jchw","stars":1,"date":"2017-07-19","text":"Not happy with my meal. I got the Mama Mia which is gyro meat on top of a small amount of lettuce, tomatoes and onions, and a dozen small pieces of pita bread. All I could taste was oregano! The meat and the bread were heavy on Oregano, the bread seriously covered. Another odd thing is that their Greek salad doesn't have greek olives. No olives. I also bought a cupcake, which was dry and crumbly as cornbread. It was obviously old.","useful":0,"funny":0,"cool":0},
{"review_id":"pQCmuTNNqmbx7x0LvILXfg","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"cAyi1WEvty4vckQJ3YU1RA","stars":2,"date":"2016-05-28","text":"The best thing about our meal there as our server, who was very good at his job! But the place is dirty. Every table had a thick built up grease covering, so thick people had scratched their initials in the grease! A good scrubbing is in order, to say the least. Food was okay, but not great. Will pass in the future.","useful":1,"funny":0,"cool":0},
{"review_id":"93WO6l-e41SF02I61TiV-w","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"5WJvFVmBZXeSPXB4IjZ_Ig","stars":3,"date":"2016-09-16","text":"Disappointing. The asian salad was good, fresh, nice flavor in the dressing. The focaccia bread, fresh. The strawberry salad was fresh, but the strawberry dressing was overpowering.  Too sweet. A light vinaigrette would have been better. The Thai coconut soup--nice flavor in the broth but the long stringy dry chicken strings in it ruined this soup! Made it very hard to eat, and the strings were dry and ew. like twine in your soup! The bakery case has huge cookies and cupcakes, etc. They look delicious but the reality is stale, non flavorful, dry. The pineapple upside down cupcake was dry, and tasted like a piece of cornbread with an old piece of pineapple on it.  The cream horn was good, but whoopie pies, dry. Stale. I really wanted to love this place, but no.","useful":1,"funny":0,"cool":0},
{"review_id":"TUFmvhAynUbjSbOJa79sRw","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"01fuY2NNscttoTxOYbuZXw","stars":5,"date":"2016-07-08","text":"Loved the food! Atmosphere funky and artsy. Staff good. Creative entrees prepared with care. I am giving it 5 stars even though the bathroom was outdated and not the freshest. Great place for people who like a funky vibe. Probably not for the uber conservative.","useful":0,"funny":0,"cool":0},
{"review_id":"Li-11fBoRoQOB-V35vDuMA","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"wh62Gu_Wgnti9W_WAY-nHQ","stars":3,"date":"2016-09-09","text":"This place is weird, a diner with Greek food. But the chicken pita I had was very good and priced well. My husband loves the gyro. Staff is helpful and nice. All that it is missing is updated restrooms. please!!","useful":1,"funny":0,"cool":0},
{"review_id":"-fFGPgbAdWlMt-v-4zW1vQ","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"QL4crtKMQnE-vi-TAACC9g","stars":1,"date":"2016-12-05","text":"These people overbook and are unprofessional. The stylists are working on two other people's hair while doing yours, which causes lack of concentration and poor results. One stylist I was passed off to for my blow-out because my stylist was too busy working on someone else, burned my head with the blow dryer! Beware!!","useful":4,"funny":1,"cool":0},
{"review_id":"M6ZFzlmmnQgt3R-vBm8fsQ","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"sOp6feWKRJ_77yP2z0S3NQ","stars":1,"date":"2017-08-05","text":"The management doesn't care about the health or well-being of their residents. They act like they are all afraid of something, like if they fix something it will come out of their own pockets. Makes you wonder if they get bonuses for not doing repairs! The maintenance staff are ill-trained and do an incomplete job on anything they're asked to do. I have had to fix what they fixed after they left! There are water issues, mold issues, trash issues, parking issues, the list is long. So glad we got out of there. I pity anyone who lives there.","useful":0,"funny":0,"cool":0},
{"review_id":"eYE9-QfnAtjfbQ_OPN34LQ","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"sdYkVaTy7EJwUkO8Ie_qPg","stars":4,"date":"2017-02-11","text":"Tried for the first time today, and loved it! Chicken flavor and texture is very good, cooked just right. Sweet potato fries, good amount and very crispy. The corn salad, with edamame, cilantro, tomato, cucumber and feta was awesome. The dressing was soo good. Clean, bathroom clean. Just great experience for \"fast\" food. Only drawback is music is too loud!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"_JPIuzkEz8Tzzd6HHtTGcA","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"VdZ_0EzBo7EHsNmiZ-zX8Q","stars":4,"date":"2016-06-07","text":"The chopped beef sandwich was awesome. Big portion, and very nicely seasoned. The quarter chicken was good, but we expected a breast and a wing but got a thigh and leg. We prefer a half chicken, but this isn't available. The meat is very good. The sides were not good. We had the potato salad, the \"white\" slaw and Mac and cheese. All meh.","useful":0,"funny":0,"cool":0},
{"review_id":"dXXiX6cizS7KnWekAPorkw","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"AQE4MruPY5cZDfLmLmd4ig","stars":1,"date":"2016-09-11","text":"Ew. Just got the grilled chicken, and it doesn't even taste like real chicken. Its got that nasty rubber texture that you get with cheap fat chicken. I should have driven across to Chik fil a. oh, well. thought i'd give them a try. Zaxby's, get yourself some good quality chicken, people!","useful":0,"funny":1,"cool":0},
{"review_id":"LUVoeBVSi0zfAK4xHNumcA","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"FU6KQ01FMtqddIHSaJli4Q","stars":4,"date":"2016-07-08","text":"Food is good diner food. It all has to do with your expectations. We have had breakfast and now lunch here, and were very pleased both times. Fried chicken is great! Service good, pretty clean. Decor is all old style diner with vintage cars and dated decor. Fifties music playing.","useful":0,"funny":0,"cool":0},
{"review_id":"0hlPcro_S7Z_syT4n_tMkA","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"PZ4F_Nul_xZeqB4xGxDN1w","stars":4,"date":"2016-07-08","text":"Great diner food and atmosphere. Varied menu, desserts made on site, very nice staff! \nBurgers are great, Tater tots great, chicken salad very good and plentiful, grilled pimento cheese sandwich awesome. Will keep going back!","useful":0,"funny":0,"cool":0},
{"review_id":"GlIcxHiCFWLftBUZNcpMzg","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"yOWggxs2fx2BDMeA1P_Yeg","stars":2,"date":"2016-06-18","text":"We have always loved Jason's Deli, but this particular location is too crowded. Tables and chairs and booths are all crammed together making it an uncomfortable eating experience. There is literally no space between the tables in much of the restaurant. Won't visit again.","useful":0,"funny":0,"cool":0},
{"review_id":"TLIhVTlqSGQVcTrqcuWRGQ","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"EcRYCDKqM-jVtoFVmkla8g","stars":3,"date":"2016-09-17","text":"Sweet little place! Great burgers!! Live music. Sorry to hear they are moving to a new location. Loved the little house!\nSecond trip--crab \"burger\" was like a blob of crab salad on a bun. Not real tasty for me. Husband tried the crab and shrimp stuffed portobello- 2 1\/2 stars out of 5, he said. It was thickly covered with melted cheese, a (less than) subtle touch it could be much better without. He said the asparagus was good. The service was good, and they did comp my meal, which was nice of them. In the future we will stick to the burgers!! Live music was very pleasant. Beers good.","useful":1,"funny":0,"cool":0},
{"review_id":"w5nutbPdWpJrWo9ggMSSnQ","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"ApAzthiFRKuL-yJo1HMFvQ","stars":2,"date":"2016-07-17","text":"Very disappointed in the food and service. Pretzel with cheese dip: Vegetarians beware. There is bacon in the dip not noted on menu. Spiedi sandwich: No sauce, just meat and bread. Meat flavored okay, but sandwich lacks. Homemade chips good, but sauce is thinned down ranch dressing. Onion straws very good, fish tacos good. Major problem is service. Understaffed? Don't know but it took 15 mins for server to even come near us and we had to grab her attention to ask for drinks. She complied but acted unwilling at first and took her time reappearing and seemed distracted all night. Won't return.","useful":0,"funny":0,"cool":0},
{"review_id":"aC5OvnFq3Aav4LKioSRURw","user_id":"MejkKZgdUNfekUoNO1QJOA","business_id":"QpCYSH83E5qT9Vss28Odug","stars":3,"date":"2016-06-07","text":"We built our own pizza as their specialty selections weren't to our liking. We ordered the large size. The flavor of the pizza was very good, the sauce, everything fresh and delicious. The crust was not cooked well in the center, though, and was not crisp like NY style normally is. Not doughy but not cooked well. The outside was great. Then the cookie dessert was cooked at much too high of a temp and was burned. We ordered another and this one was raw.  After we sent the first cookie dessert back, our waiter disappeared. We did not see him again before we left! We flagged the manager down to finish our transaction. This place is in the south, maybe it is considered rude to send something back?","useful":0,"funny":0,"cool":0},
{"review_id":"uNPaf2wyfyBvFbsoOSQkTA","user_id":"oUJpTc3Oejrj8waW7tOxcg","business_id":"K74Px1ALCCBvcU6-XsmSpA","stars":1,"date":"2016-08-24","text":"This gym is filthy and the members seem to not give a shit about using a towel ... Gym etiquette bring a towel and wipe your sweat off of what you use ... Wash your gym close nobody wants to smell your funk ... Put your weights back on the racks  unless you bring your mommy to clean up after you ... People like you make the gym a really bad experience...","useful":0,"funny":0,"cool":0}]