[{"review_id":"D-dFWmzuOsRIcXQXuwSNRQ","user_id":"1EjIfQi64Zj7ntXWlFFXpw","business_id":"5Lcit9Zt6TF9bmKoFMhF0g","stars":1,"date":"2015-01-09","text":"Terrible service period, since we don't speak taiwanese people that showed up after us got seated before us. They got their food before us, the place is dirty. We waited at our table for over 10 minutes before ever being acknowledged (I'm pretty sure it would have been longer if we didn't go up to the cashier trying to order), the table we had to run and claim ourselves. The yelp location of the place is completely wrong so a couple of u turns had to happen. Waited forever for the food after waiting a lifetime to even put our order in. While waiting watching more people who arrived after us get their food.  The food is not worth going through all the crap.   And the check was wrong.","useful":1,"funny":0,"cool":0},
{"review_id":"c44CQENmylT7PEa--xvrmg","user_id":"1EjIfQi64Zj7ntXWlFFXpw","business_id":"FqA7ofYWGVHnAIF4jjznHA","stars":5,"date":"2014-06-28","text":"This place is the bees knees and beyond the cats pajamas! Marlon the bartender is amazing and needs a raise ASAP! And Angela?! Hubba hubba ;)))\n\nHappy Hour specials is hard to beat here and the yogurts soju Is super yummy with good portions!","useful":0,"funny":0,"cool":0},
{"review_id":"pxw8TcEBDZWu1GApUOaRrw","user_id":"1EjIfQi64Zj7ntXWlFFXpw","business_id":"qqs7LP4TXAoOrSlaKRfz3A","stars":5,"date":"2014-06-28","text":"Amazing atmosphere! Love the cocktails and the truffle bacon mushrooms mac and cheese is amazing","useful":0,"funny":0,"cool":0},
{"review_id":"yP03itb6yCIsc3GurmrG0g","user_id":"1EjIfQi64Zj7ntXWlFFXpw","business_id":"eLFfWcdb7VkqNyTONksHiQ","stars":5,"date":"2017-02-21","text":"Kailin was the best waitress! Very attentive and quick for a party of 6! Would highly recommend the kalbi beef with strawberry yogurt Soju.","useful":1,"funny":1,"cool":1},
{"review_id":"PPvi5KebTX9WcDBFSlsrCQ","user_id":"1EjIfQi64Zj7ntXWlFFXpw","business_id":"hIUKufhwR6Ifn7bi0-phLA","stars":4,"date":"2014-06-30","text":"The food here is fresh and the coffee is delicately prepared. Thank god for Ilys Italian roast! Oliver is a very respectful host and super friendly. Every time I come here the service is friendly but a bit on the slow side since lunch is pretty busy.\n\nDefinitely try their eggplant and ANYTHING with pesto, it's delicious and the proportions are perfect for lunch! The seafood bisque is rich and creamy. If your feeling sweet try their monkey latte.\n\nMy only peeve is that this place is a little awkward to get to and it's tucked away on the side of a freeway and corporate offices.","useful":0,"funny":1,"cool":0},
{"review_id":"F501pCsl5da4YMgkxo-oug","user_id":"Qnq3qordFqyCKJL6qErzZA","business_id":"HFX_40H4KOsg-fKxdS_bxQ","stars":1,"date":"2015-05-06","text":"BEWARE!!  People at the store were helpful, but they charged my card the minute my order was placed online (on a weekend, when they couldn't be reached by phone), despite my explaining in the comments that I wanted to confirm the color before the order was completed.  They did call to discuss the color, and even sent photos to help me make a decision (especially since shipping to California was VERY expensive).  I got back to them - via e-mail - that I appreciated their help (which I did) but that I was not going to complete the order and, instead, continue to look for a color closer to what I was after.  I said that, if I decided to go with the alternate they suggested (different type of yarn and color), I would get back to them but, for now, I wanted to keep looking.  They responded by saying to let them know, and how nice the other yarn was.  Two weeks later, I get a message that they've shipped yarn to me!  I immediately contacted them, saying I had canceled the order - that I had told them I was going to keep looking and had not accepted their suggestion, but their response was that it'd been two weeks so they automatically shipped.  I'm guessing they've sent the yarn I initially chose online....I have no idea!  They sent me no warning - no confirmation that they were going to ship....and that's when I discovered they'd charged me for the order the minute it was placed - NOT when it was shipped like every other company I've done business with online.  I'm EXTREMELY disappointed and will never do business with them again!  Beware if you give them any credit card info!  They'll use it whether you want them to or not, and the minute they have it....even when nothing has been settled or even shipped yet!!  To return it, and pay shipping twice would cost more than the yarn so I've been FORCED to make this purchase, even though they led me to believe I would not be.","useful":3,"funny":1,"cool":0},
{"review_id":"t3d3QRY09O4IMtZHGL0vmg","user_id":"TbIYJmZQgh4bQ3bfguSjWg","business_id":"Fufm0lM0opOKXiu30ZQjDA","stars":4,"date":"2013-03-30","text":"I have been eating here for years.  While the ambiance is not great, the food is very good and the prices are very reasonable.  I have probably eaten every item on the menu, lunch and dinner, and never been disappointed. \n\nI am a bit of a Thai aficionado, originally from NY.  Bangkok Ocha is better than most.  I have had better Thai at significantly higher prices in Florida and California.  There are a couple of places in an Atlanta that are as good but overall this is a terrific \"once a week\" (at least) spot.\n\nWhile I understand reviews are subjective; the details in some of these reviews, what was ordered and the comments, suggest input from Thai posers and dabblers rather than addicts.  I am the later.","useful":0,"funny":0,"cool":0},
{"review_id":"eOhwzJdx2jmT3KO-wHaViA","user_id":"M-DgDJcRdWbHpz3f16m-pg","business_id":"PJOIEJgVVjh9KDBlVwjzQw","stars":1,"date":"2017-12-21","text":"Well another vacation ruined by frontier.  What was a 2 hr delay turned into a 5 hr delay. Merry Christmas! !  Why don't u take better care of your planes so u don't disrupt the customers who actually fly your airline.  As for me, this is our last time!!!","useful":0,"funny":0,"cool":0},
{"review_id":"ryvmhvPcQHXwi7_sjmPt6Q","user_id":"NA9KLVu51nz7Y728sC6L8w","business_id":"egK9XPQwna9KiZmv_objzQ","stars":5,"date":"2017-02-03","text":"Having been a luxury home real estate specialist in Arizona for over 17 years, I have very high expectations, not only of the vendors I use, but also those I recommend. Therefore, for my personal move, I engaged the moving and storage services of Get Your Move On. The office staff was very responsive in getting me on the schedule quickly, the follow up and customer service was impressive and the entire staff and crew were top notch professionals.\n\nI have and will continue to recommend Get Your Move On to my clients without hesitation.","useful":2,"funny":0,"cool":0},
{"review_id":"kpqNEkNVsn2_3BA5MFAATg","user_id":"AfRxCDXuW9_Hm43SQySK9w","business_id":"snw9iNNLpFYZeHotW00uVA","stars":3,"date":"2014-03-02","text":"Glorified Mandarin. Totally not worth the money. Take any Asian restaurant, pile \nthe food high, put some fresh herbs on top and you have Lee","useful":2,"funny":3,"cool":0},
{"review_id":"Hv3coGSxnuKTMaAgpbJjjA","user_id":"rDI_GkIvcZ_IopMHIl07qg","business_id":"DMwU0igEs9K7XuI3utsr6g","stars":3,"date":"2013-11-27","text":"Margarita was tasty. Food was decent, but seriously, who doesn't double stack their corn tortillas for tacos?!? A single corn tortilla has zero structural integrity, so I'm left forking my taco (Lame pun intended).","useful":0,"funny":0,"cool":0},
{"review_id":"YenGJQXh2ya7cbCbGqI-UA","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"mBU4G-eh-GN2Tp1X-uLb3A","stars":5,"date":"2009-10-10","text":"Smokeless Joe gets 5 stars for being one of the greatest concept restaurants I've been in...ever.  I completely understand and accept that my sense of Smokeless Joe's greatness is directly attached to my own love (LOVE) of a good pot of mussels.  Their African Peanut soup is also great, which makes me assume that the other stews and soups are too.  Additionally, I find the beer list here suits my taste better than any other I've found in Toronto so far, and the fact that the beeristas are willing (and required) to leave their bar fortress and go to the fridge at the back of the store makes me feel grossly indulgent asking for some of their bottled speciailties.  My one request for these guys is to find a way to add some pommes frites to the menu...but I'll be back weekly regardless.","useful":2,"funny":0,"cool":2},
{"review_id":"mAtuDgXXLeH6cxVJLjUFkg","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"qbC4cfz-ShxEGpLS94Mk7Q","stars":3,"date":"2010-03-15","text":"The moules are great but the food and service don't quite add up to the prices...good place to take a date if they are turned on my the fatness of your wallet","useful":0,"funny":2,"cool":1},
{"review_id":"b235bNs57PpBcKZElyEbiw","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"lf1wqczeKUz5iyQn7J7sBA","stars":3,"date":"2009-10-10","text":"I just like small bars better...ok prices, crap beers, mixed crowd and ok music.  This is the type of place I associate with Cancun or Tijuana more than Toronto's scene...","useful":1,"funny":0,"cool":0},
{"review_id":"oW-jzHg1uE8tfLkmb_Edig","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"seDuOOv4W3_fgFD7iMKhKw","stars":4,"date":"2009-09-20","text":"I just moved to Toronto and had to ship my bike across from the states.  Sweet Pete's was very helpful in receiving, rebuilding, and giving my bike a nice tune-up.  I don't think I'll be living near Pete's, so I don't know how often i will go back, but i very much appreciate their helping me make my move a bit easier and will certainly recommend them to others.","useful":2,"funny":1,"cool":0},
{"review_id":"lZRw4xT_X7m02fVgDK6nGQ","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"SxjNgkzAlUG-wt2rSbc2HQ","stars":3,"date":"2009-10-13","text":"I had New Ho King delivered.  I did not\/do not\/do not plan to go to UT.  Those things said, and understanding there may be some ambiance-related pieces I am missing, the food was not so good although delivery service in both depth of menu (its like a road map of food....just keeps on unfolding) as well as open hours was impressive.  I would not totally rule out ordering here again...but it's going to have to be pretty late at night and probably a push between being conscious or passed out when the food arrives.","useful":0,"funny":0,"cool":0},
{"review_id":"T0Ir4bh86l3GSALxdJSbZw","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"7YYrZ9LgjpKLTtF-huhJug","stars":5,"date":"2009-09-27","text":"As a hockey venue, this is as good as it gets (for a new arena...the Joe is still the best for obvious reasons).  On top of great seating, there are HUGE beers to be had, which reduces the impetus to leave one's seat and they also have a mean poutine, or heart attack fries as I like to call them.  Great entertainment value all around.","useful":1,"funny":1,"cool":0},
{"review_id":"FbmbptfvejQtDwaHuHAjkA","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"uuDxjiidiIb6dTsV9edUTA","stars":3,"date":"2009-09-24","text":"So it's not the most delicious pizza in the world...but it's super fresh, super customizable, super fast, and super cheap.  Special right now gets a large pie, 10 wings, and 4 sodas for $22 (after tax)  which is insane.  I say well worth the price.","useful":1,"funny":0,"cool":0},
{"review_id":"bC5EHqiKl8zkWt_rssH4Hg","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"AmrUWxq17Ct5VhG0Czx-FA","stars":4,"date":"2010-03-15","text":"Got a new rack and panniers as well as some nice tires here and was happy with everything...will definietely try service dept out this year.","useful":2,"funny":0,"cool":0},
{"review_id":"ngX9sChaU4L4lZs5wugqvA","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"dTuT_G3Zp79RZmnF3oxfiA","stars":4,"date":"2009-09-26","text":"I would give 3 starts, but they carry my favorite hard-to-find Danish beer (Tuborg) and that yields an extra star.  The moules (mussels) are definitely worth the 4 stars as well but the large party (read: non-cozy) atmosphere just doesn't quite fit the menu.  I think things here are a bit overpriced as well, but when you look around and see 10,000 sq ft of party space, it's easy to understand.","useful":1,"funny":0,"cool":1},
{"review_id":"xmq6DuRyKVEj5DlvrJvmIg","user_id":"TuZIsGyI021XZdHpfsj_7Q","business_id":"qP-wKnRAGLXzUY10JNyDyw","stars":2,"date":"2009-09-24","text":"I had major bike issues on the Don trail today and needed some TLC around 6pm.  I rode past Warren and they looked closed...so I called.  A very stoned sounding elderly lady answered saying \"Helloooooo?\".  So I asked if she was at Warren Cycle.  yes.  Are you open?  no.  What kind of hours ARE they open if not 6pm on a weekday?  Not going to waste my time going here again...","useful":2,"funny":2,"cool":2},
{"review_id":"Dl_WVN_e6c04kAd5MXtk2A","user_id":"eyuqEahcZUDQr0SUA3d4mw","business_id":"GdPWJo3z4ySEXpF7Wkn3FA","stars":5,"date":"2014-08-10","text":"First time eating at this restaurant and it was an excellent experience. Coming from the Bay Area we are seasoned pakiindo food eaters. This food however is the best desi food we have ever tasted. The best part was seeing my pre teen kids enjoying the food. We ordered the wings, chicken tikka masala, chicken tandoori, chicken boti. I am coming again to Phoenix, just to eat here","useful":0,"funny":0,"cool":0},
{"review_id":"IG6KlvSzTjfgvBSOEenphQ","user_id":"4nnTryTeKIji5VQp8tIOyQ","business_id":"Y4CKJ3mJJeV0E8BNf7gEtg","stars":5,"date":"2013-05-23","text":"The Audi experience starts with the purchase.  Audi North Scottsdale makes the buying and owning experience such a pleasure that you will probably always be an Audi owner.  The car speaks for itself as far as styling, technology,safety  and luxury.  The professionalism of every individual who works there inxluding Steve Bacca to Jaime Ossa to Jason Brown and Anthony Pacheco makes owning an Audi a complete pleasure and a great experience.  I am on my sixth Audi!","useful":0,"funny":0,"cool":0},
{"review_id":"iHhLivLDbUhUCZ2Q7zZI6g","user_id":"4nnTryTeKIji5VQp8tIOyQ","business_id":"8XoDXN2DKmQGJHZhkQbJ9A","stars":4,"date":"2014-06-19","text":"The food is  quite good and true to home style cooking.  Very friendly good service","useful":1,"funny":0,"cool":0},
{"review_id":"T-oR1diaP-imXxCxJ6sTHA","user_id":"4nnTryTeKIji5VQp8tIOyQ","business_id":"v4YmJDtKzG2Dlh-vGB241w","stars":2,"date":"2013-09-16","text":"I was disappointed this time.  The service was great.  The food however was certainly not what one would expect in the least from a restaurant of this calibre.  My prime rib was tough and rubbery and so was the duck entree which my husband ordered.  I had a solid experience last time around so maybe it was just a bad night.","useful":0,"funny":0,"cool":0},
{"review_id":"2YazjPNZPXaQqAS1sP0MGQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"JcFyuyo0Rt6gDiVZ9yJ3VQ","stars":3,"date":"2014-07-23","text":"Four stars for the food here, one star for the drinks.  The food is delish- favs include the kale & sweet potato wrap and the bbq chicken wrap.  My issue is with the juices... $11.25 for fresh pressed pesticides.  You cannot charge that much for a juice made with conventional (NON organic) produce and position yourself as a health conscious restaurant catering to that clientele.  People who can afford a $12 juice are smart enough to care where this guy sources his ingredients from.  Also worth noting that the meat is not organic either, so the whole concept is a little off for me.","useful":4,"funny":1,"cool":1},
{"review_id":"xFY6Rs89XoY6fBmlcvm93Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"eoHdUeQDNgQ6WYEnP2aiRw","stars":5,"date":"2014-07-23","text":"Three words: frozen hot chocolate.  It's epic & lives up to the hype!  Their desserts and food are geared toward tourists and nothing to write home about, but it's worth a trip for that hot chocolate- which, by the way, you can get from the takeout window without having to sit down.","useful":2,"funny":0,"cool":2},
{"review_id":"N7WCcnQgXuYF_ITflWyhOA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"dn_ipqbm7_jUz5X3rDez_A","stars":5,"date":"2010-09-10","text":"Todd English's latest is incredible!  Great atmosphere (cool bar, outdoor pub tables, red leather booths inside) and our server (Paul) was phenomenal.  Expansive bar and a huge selection of beers on tap, including some very enticing samplers.  No blue cheese olives for the martinis (bummer, since that's a signature drink at Olives).  Prices are high, as to be expected in City Center.  The seafood is the freshest I've had in all of Vegas- it's flown in every morning.  Their live bar comes by the piece- east and west coast oysters and delicious jumbo shrimp cocktail served on a gorgeous platter over ice and garnished with sea plants.  The duck buns were incredible- the meat was sweet and tender and the buns were like soft little pillows!  I've been dreaming about these ever since and I plan to come back for them!!  Lobster rolls were delicious- sweet rolls lightly buttered and grilled, then stuffed with lots of sauteed lobster meat.  The coleslaw they were served with was the best I've had.  The moules frites (mussels) came in a rich, delicious curry broth and even the fries were perfect.  We also had the pickles (three house-made varieties, thought they came with bottled mustard and not stone ground).  The smoked salmon quesadilla was incredible- with buttered yukon golds and fried capers.  They also do a fabulous bread pudding that is served with fresh whipped cream, salted caramel ice cream, and a delicious toffee sauce.  The bread pudding itself was the perfect texture and is one of my favorite desserts in all of Vegas.  This place rules, I cant wait to come back and try the carvery menu- chose your meat, sauces and bread.  Definitely recommended.","useful":2,"funny":0,"cool":1},
{"review_id":"BNTyVDQ1rm0AFdv0da0Trg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"QDeB3ZtWYzVJJ0KK-HM-PA","stars":5,"date":"2010-04-21","text":"BEST DONUTS EVER.  Seriously... they're amazing.  Huge selection of every variety imaginable- IF you come early.  Favs are the apple fritters (they let you chose from lighter or darker ones, depending on how done you like them), and their old fashioned buttermilk.  The donuts on the top two rows of the case are vegan,  but you'd never know it.  Their chocolate glazed cream filled (soymilk) and glazed raspberry jelly (gelatin-free) are crazy good.  I dream of these things.  Hole-in-the-wall smack dab in Chinatown.  The owner & her husband are as sweet as can be.  I only wish they were open 24 hours!","useful":1,"funny":1,"cool":1},
{"review_id":"itC-MHiVQ9uch8ZqAouPCQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"rq5dgoksPHkJwJNQKlGQ7w","stars":5,"date":"2010-11-02","text":"Love love LOVE Sambalatte!  Vegas has been lacking cafes like this one! I go here multiple times a week and everything has been perfect.  They have many different coffees brewed through various unique processes that make a French press look run of the mill.  Cappuccinos and lattes are full bodied and strong, and they have designs in the foam.  Great hot tea selection available in french press pots, and a delicious iced green yerba mate.  They have sandwiches (good caprese one, heated and served with a side of balsamic) and lots of desserts- including minis (napoleon, eclair, tiramisu cups, etc).  They also have gelato and sorbet, and my husband's all time fav- affogato (gelato with a shot of espresso poured over).  The atmosphere here is charming and warm, and they are open till 10pm wed-sat.  Service is excellent, they always walk upstairs to bring me my drink and are super friendly.  There is free wifi and an entire long table downstairs with multiple plugs for laptops.  Only negative is that I wish they stayed open later on weekends, especially for Vegas 10pm is early to close!","useful":2,"funny":1,"cool":2},
{"review_id":"47r814oPnytzHzdPCt_IAA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"KalAJyO0Zpg3K1wVwYXBHA","stars":2,"date":"2010-09-10","text":"Marche Bacchus has a gorgeous view, but the food does not stand up (as is often the case).  The quality was average at best.  The lobster croissant that everyone raves about was terrible- a stale croissant unnecessarily toasted and filled with lobster meat that tasted fake.  It was shredded and almost had the texture of \"Krab\".  Very unappealing, and a very poor rendition of a lobster sandwich.  The signature bread pudding was also sub-par, burnt on top and dry throughout.  Definitely not worth the pre-ordering and 20 minute wait.   Service is disappointing, however the wine store is lovely and has a nice selection at reasonable prices.  The view is great and they have misters (major bonus in summer time), but next time I will be trying Garfield's next door in hopes of a better meal.","useful":1,"funny":0,"cool":1},
{"review_id":"wb6zJ5h5oyycgL8NLrVEBw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"FSEHqBewxEVQJvezrDL_bA","stars":4,"date":"2010-05-14","text":"Great pet boutique.  They carry all the hollistic brand foods, including the standard Wellness Formula and the grain free variety.  They have a great selection of treats, both bagged variety and behind their bakery counter.  They also have a nice selection of toys, harnesses, clothes, and bath products.  I love this store- prices are reasonable and staff are always friendly and knowledgable.  Highly recommended for anyone who feeds their dog\/cat healthy food and treats!","useful":1,"funny":0,"cool":0},
{"review_id":"E7vDhV3f9_Ve4h7GSO5v4g","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"-yApKLEFAvvNyifvpNKWCA","stars":4,"date":"2010-06-07","text":"I am updating my review of Luv-it... still the best frozen custard in Vegas (by a mile).  However, it is super lame that they use styrofoam cups in this day and age.  Polystyrene is not accepted by recycling (Waste Mgmt) in Las Vegas, it's a possible carcinogen, it's made with petroleum, it is clogging our landfills, ETC. (google it!).  With so many eateries going green and switching to eco-friendly packaging, I wish Luv-it would too.  This guy sells a ton of custard every day and I cant imagine how many of these cups he goes through.  You gotta get with the times!","useful":0,"funny":0,"cool":0},
{"review_id":"OWt9XHjSAvqHNcoCDvFiMQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"m5niZy68d2gTtVWz89elfA","stars":4,"date":"2010-05-13","text":"MAD LOVE for the slider truck.  What a great concept, I am so glad this place is getting the attention it deserves.  Finally we have a gourmet mobile restaurant!  The weekly schedule is posted on their website www.slidinthru.com and on twitter.  My fav is the caprese (grilled eggplant, mozarella, toms, basil, balsamic).  They also have a pulled pork slider, a beef one with tzatziki and feta, a bbq one with carmelized jalapenos, and a classic with cheddar, bacon and special sauce.  Supposedly they are going to start doing a chicken one too- fantastic news for me and my husband since we dont eat red meat!  Their buns are great and everything has a really nice smokey flavor from the grill.  They have regular fries, and really good sweet potato fries (tossed in cinnamon and sugar).  Only thing I wish they had is unsweetened iced tea, and I am looking forward to more chicken and fish specials.  Prices are reasonable, ingredients are high quality, and these guys (especially Ric) are total chillers.  There is always a line and your sliders are made to order, so be prepared to wait a couple minutes.   If you haven't been here, be sure to check it out.  I cannot give this place enough praise, mad props for a guy in his 20's acting on a really great idea- Vegas SO needed this!","useful":0,"funny":0,"cool":0},
{"review_id":"azIy8Ua2fV3-n7NRw3wv8Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"U_svUGP1XhMTC0_GTZXpGA","stars":2,"date":"2010-04-29","text":"Mad Hatter cupcakes are not good.  I have tried every cupcake bakery in Vegas and these rate at the bottom.  They use oil and poor quality ingredients and their cupcakes look very unrefined (almost unappetizing).  This would be a cute place for a cheesy kid's birthday party because you can customize your own cupcake (cake, filling, frosting, and topping).  Unfortunately their cakes are tasteless and the frosting is overly sweet.  These dont hold a candle to The Cupcakery, Sprinkles, or any other decent joint.","useful":1,"funny":0,"cool":2},
{"review_id":"eOCdS3327PEwWLYhH6-vgg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"QJR4qBUHegWEozSQrGmBPw","stars":5,"date":"2010-05-06","text":"Olive's is a fantastic restaurant, exactly what you'd expect from Todd English.  The flavors are somewhat mediteranean and they've got a great menu.  Their cocktails are fabulous, I love their white peach belini and my husband is crazy about their dirty martini with blue cheese stuffed olives.  The bread basked comes with fresh baked onion foccacia and two kinds of olive tapenade.  They have some really good apps, including a great ahi tartare and some really nice flatbreads (one with proscuitto and figs, another with mushrooms, and a great classic tomato-basil-mozarella).  Favs on the dinner menu include the scallops (perfectly seared, served with risotto), the butternut squash tortellini, and the chestnut ravioli (served on a bed of creamed spinach-heavenly!).  Do not skip dessert here- they have a souflee that is crazy good.  Flavors change but the strawberry is incredible, so is the vanilla.  My husband and I order two, that's how delicious they are.  Service here is always great, very attentive.  I recommend sitting on the patio, it's much more private and has a beautiful view of the Bellagio fountains and water show.  Definitely make reservations or you could be waiting 2 hours for a table.","useful":1,"funny":0,"cool":1},
{"review_id":"Hu4-DKakumqEqlAG1yGD6w","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"UMqfeCItzQ2glr4d9apGlA","stars":4,"date":"2010-05-14","text":"Great coffee shop in the Henderson part of town.  They have really good iced tea, avaiable in 3 flavors- including unsweetened peach black tea and passion berry (amazing!).  Their coffee is fair trade organic and varies daily.  They have a small selection of pastries and some breakfast and lunch options (vegan friendly).  They have a good breakfast burrito with eggs, potatoes, beans, cheese, fresh avocado and lots of spinach.  There are comfy seats and a bookcase full of books, however they are only open till 8pm.  Awesome eclectic staff, super friendly and knowledgeable about their coffees.  I wish they had a larger\/better pastry selection and were open later.  We need a place in Vegas that is comparable to the living room in SD, and this is the closest I have found so far!  I so wish they'd open one in the Summerlin-ish area!!","useful":0,"funny":0,"cool":0},
{"review_id":"Qy2hvB_xQ0dFUYYZA7la4Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"XkvvUNCmLIvOts0OftXegw","stars":4,"date":"2010-05-13","text":"Original Pancake is one of the best breakfast places ever.  They are a chain, and their locations in Rancho Santa Fe (SD), Palm Desert, Chicago, etc are all way more charming than this one.  That said, breakfast here is always consistently delicious and the service is great.  Their omelettes are fluffy and baked with the ingredients inside, almost like a souflee.  They do a great dutch baby, german apple pancake, and a dutch garden (dutch baby topped with veggies and cheese).  Their pancakes are my favorite- thin and flavorful, you can smell the buttermilk.  They come in every flavor, including seasonal pumpkin (amazing!) and fresh strawberry with whipped cream (during summer months, with fresh not canned whipped cream).  They also have classics like eggs benedict, corned beef hash, and amazing swedish pancakes (thin like crepes).  They also have a location in GVR that is newly expanded, for people on the Henderson side of town.","useful":3,"funny":0,"cool":1},
{"review_id":"nb4Lxuxc0Ciq4YbpJni3Cg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"VG0nWxGsPixYLsyi49gyxQ","stars":4,"date":"2010-05-06","text":"Hugo's is a Vegas landmark and an old school experience not to be missed.  Let me be perfectly clear that it is in the Four Queens Hotel, a dive hotel on the old strip with the parking lot to match.  That said, when you step down the stairs into Hugo's Cellar you are in an entirely different environment.  Ladie's are greeted with a rose and the setting is very romantic (dark wood walls, candlelight).  Service is excellent and they have some great sommeliers.  They have a very good wine list and serve complementary bottled water, as well as a nice bread basket with cheese-toasted lavash and rose-shaped butter.  Their salads are the highlite, included with your meal and freshly prepared on a cart at your table.  Toppings like hearts of palm and bay shrimp and delicious dressings- try the orange walnut vinaigrette.  You are served an intermezzo sorbet to cleanse the palatte (raspberry on a mini cone).  Dinner is very traditional- chicken, fish, and steaks served with a potato and vegetable.  Not especially gourmet or cutting edge, but very old school classic and part of the experience.  They offer traditional desserts such as bananas foster prepared tableside, and they bring a complementary dessert of chocolate covered strawberries, dried figs, and apricots served with whipped cream.  This restaurant is great and remeniscent of old Vegas, definitely a must try.","useful":1,"funny":0,"cool":1},
{"review_id":"vwmo-62vWfCKnR97895Opw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"YavRvjbLsvh4DYDJPAfJIA","stars":4,"date":"2010-04-29","text":"This place is super clean (major bonus points!) and they have great vegetarian pho.  I am mostly restaurant vegetarian and it's hard to find pho that is not either a beef or chicken broth.  Their's (I think called tofu\/vegetable) is very flavorful, salty, and comes with a platter of very fresh veggies to arrange in your soup as you like.  My husband and I each get a large bowl- it is huge and takes forever to eat!  Their fresh spring rolls (the cold ones) are good, but not the best i've had.  The sweet sauce that comes with them is great.  Major bonus points for a place that offers a veg pho on par with the traditional beef one!","useful":2,"funny":0,"cool":1},
{"review_id":"rUoMvoXxdqTCxCmIL2CrpQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"JWDiG0nSsM7GQ9QFRTxU9w","stars":3,"date":"2010-08-15","text":"Glazier's is pretty middle of the road for me. Let me start off by saying that the store has a very strong, strange odor that has lingered since they first opened (my husband says its tolerable, I find it hard to bear). The layout is nice and the store looks impressive compared to most regular grocery stores (Smiths, Vons, etc). They have a large produce selection at very affordable prices. Lots of exotic fruit, vegetables, and peppers that cannot be found at conventional grocers. However, their herbs and most greens are less than fresh and their selection of organic produce is lacking (and way too expensive when compared to Trader Joes, Whole Foods, or even Vons). They have a great selection of ready made food, but few healthy options. Pizza, ice cream, sushi, pasta salads, pasta entrees, vegetable and starch sides, etc. Some of what I've tried has been good, including salmon stuffed with spinach and pesto, green beans almondine, mixed vegetable rice, broccoli with peppers, etc. They also have a nice looking coffee and tea bar and a good selection of gourmet bread (La Brea Bakery olive bread, jalapeno cheddar, pain rustic, organic whole grain, etc). They have a huge bakery with donuts, pastries, pies and cakes at shockingly low prices, but nothing even remotely health conscious. Salad bar is run of the mill and cant hold a candle to Whole Foods, but again the prices here are incredibly reasonable. They do have an organic\/natural food section but they do not have organic eggs, meat, etc. \nI could not do my regular grocery shopping here, but this place is great for specialty items and anyone shopping on a budget. It is far better than a Walmart or Smart and Final and I like the fact that it's family owned. Their produce selection is worth a trip alone. I also find myself coming here when I get home late and don't want to cook- their ready made and pre-packaged food is available 'till they close at midnight. I wish they'd offer reusable bags, a discount card, and a juice bar among their ready made food stations. I also wish they'd refresh their magazines- I feel like I am in the twilight zone when I stand in line and see covers from weeks ago.","useful":2,"funny":1,"cool":0},
{"review_id":"gx3y9GCoW8HjHomYvj0cbg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"3-0Q3D3lC5hDys3EX0Ai9g","stars":5,"date":"2014-07-23","text":"This place is fab... they have every single toy imaginable- from the typical pet store brands to more boutique style game\/brain teaser toys (my dogs are currently obsessed w\/ hide-a-squirrel!).  They also have food, treats, leashes, harnesses and more- all discounted.  Love this place.","useful":0,"funny":0,"cool":0},
{"review_id":"j95JQtJde3A7rm_Y3HHZmQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0CB7YB1qRSWLQvMbHw3Fmw","stars":4,"date":"2010-04-21","text":"This is one of the best places for boba tea in the city.  They have an extensive menu featuring the usual flavored black and green teas, slushes, snow ices, and smoothies.  Their prices are more reasonable than most tea houses in Chinatown, the service is friendly, and the place is clean as can be.  There are always people getting take-out drinks here and there are a couple tables inside and out front.  Favs include the strawberry milk tea and passion fruit black tea, both with boba.  My husband loves their fruit slushes.","useful":1,"funny":0,"cool":1},
{"review_id":"76KcHohecAR10T2l04YGqg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"3DW4YkYL0lBOG6AS9ksFqQ","stars":1,"date":"2010-05-11","text":"Pet Pros is a nightmare, I cannot emphasize this enough.  Their dogs come from puppy mills, they were taken from their mothers far too soon and many dogs in the store have kennel cough and other illnesses due to improper care.  The staff, as expected, tell you the dogs came from reputable breeders and have papers, which means nothing and is standard in this industry.  This is where people go to purchase \"designer dogs\" for astronomic prices, without doing the research or investigating this industry.  A simple search on google will tell you all you need to know about petstores, puppy mills, and the store itself.  Go to petfinder.com and search for a rescue dog that fits your needs, or check out local animal shelters.  If you are looking for a specific hypoallergenic dog, check out breed-specific rescue organizations (ie. poodle rescue).  \nDont breed or buy while shelter pets die.","useful":11,"funny":2,"cool":0},
{"review_id":"zmVpf7r00n7zNvZ-htWvVg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"uUEKndnFbHD8mVkGiirtpA","stars":5,"date":"2010-05-13","text":"Tommy Bahamas is great.  I have eaten at their restaurants in Maui, Palm Desert, and here in Vegas- they are all consistently fabulous.  Service is always attentive and they have a great happy hour in the bar (there are also comfy booths if you dont want to sit at the actual bar).  Happy hour is I think from 4-7pm weekdays- discounted apps and drinks, and some really good fish tacos.  Their bread is in the shape of a crown, served hot with a sweet cinammon butter.  Great apps- favs include the coconut shrimp, cayman lollipops (chicken drumettes with mango bbq sauce), goat cheese with mango salsa and flatbread, and the ahi poke.  At lunch they have really nice salads and some great sandwiches, including a beer-battered crispy fish sandwich with tarter sauce and honey roasted onions.  For dinner, they have great seafood and a really great stuffed chicken (herb cheese and roasted red pepper cream).  Dessert here is a must, the pina colada cake is good but the butterscotch pudding is incredible.  Most desserts are available in small sizes, though they dont display this on the menu so you'll have to ask.  I highly recommend this place, especially for dinner on the patio on warm summer nights.","useful":1,"funny":0,"cool":1},
{"review_id":"duvPONn-Lv2sK8m7nCqm_Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"n_K2xa_nqzUqaUJa0S_5tQ","stars":4,"date":"2010-04-21","text":"Tea Station is my favorite place for boba tea in Chinatown.  Their prices are definitely higher than most of the competition, but they do offer a discount on all to-go drinks.  And lets be real, some of the other tea houses in the area are just plain creepy.  The menu is extensive (over 10 pages of tea) and the atmosphere is nice.  This place is very clean- major bonus points, especially if you've frequented some of their local competition.  Tea Station is always packed, especially at night since they are open late.  My favs are their passion fruit green tea with boba, or the iced mixed fruit tea (although this one is super sweet).  My husband likes their fruit slushes.  This is a great place to get work done during the day (free wifi) or meet friends at night.  It is very popular for takeout drinks, in fact I always see 5-0 popping in here for their late night boba fix.  Service is reasonably friendly but definitely on the slow side, especially during busy times.  I would not recommend the food (their squid balls were inedible and smelled like a mixture of hot garbage and the ocean, though perhaps they are an acquired taste!).  I recommend this place based on their atmosphere, tea, and the fact that they are open late.  This is definitely more of a traditional tea house than your average take-out boba shop.","useful":1,"funny":1,"cool":1},
{"review_id":"a5IHhvqpCPsYea-ES6nXuw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"z3bUwDC1wUPGeIB8Rt90wA","stars":4,"date":"2010-04-29","text":"Layers is the best bakery in Vegas, without question.  This place is the closest thing Vegas has to a high quality bakery on par with SF or LA.  They use high quality ingredients and everything is always fresh, never sitting out more than that same day (like other lame bakeries in the area!).  Favs include their butter bars, cupcakes (flavors change daily), and sticky buns (get there early, these go super fast).  They also do beautiful celebration cakes to order (and have some avaiable in store every day).  I only wish they had more French pastries (almond croissants, napoleans, eclairs, brioche, etc).  That would bump them up to 5 star status!","useful":1,"funny":0,"cool":1},
{"review_id":"-3GgVv9pFnYmK875TCpHlA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Qihead6oTtWCwde3TBqlGg","stars":4,"date":"2011-06-11","text":"Dupar's is all about the pancakes- go here for them, they're incredible.  Fluffy, drizzled with butter, & served up 24\/7!  Solid breakfast here... bruleed oatmeal w\/ fresh fruit, & eggs florentine among my favs.  They also have a great tuna melt, split pea soup, carved turkey sandwiches, pies, etc.  This is my go-to spot after a late night downtown, and for breakfast when I'm willing to make the trek down to Freemont.  Everyone I've taken here loves this place- they have an expansive menu and those pancakes are the absolute bomb!!  Best in Vegas, maybe even the best ever...","useful":1,"funny":0,"cool":0},
{"review_id":"rnrbXssf9gu540kcSMq67g","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"ow5ku7hfMqU94mylTd3WlQ","stars":3,"date":"2010-05-18","text":"Vivido Gelato is good, but not authentic Italian gelato.  Large selection of flavors, but they're lacking some traditional staples (straciatella, fior de latte, etc) and need more fruit options.  Prices are high, especially given the small servings (two small gelatos for $8).  Also, they limit you to two flavor samples per person, which they announce when you walk in.  This just seems really cheap of them and totally rubbed me the wrong way.  There is something in their gelato that makes it very stretchy, almost gummy.  The mint was pretty good (but colored with green dye), blood orange was okay but not very flavorful.  I will probably go back if I crave gelato again, but only because there is nowhere else in the area.","useful":3,"funny":0,"cool":3},
{"review_id":"5_bs_GYNIUrRAeDCutDiVg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"myQEB6ldvn-1oRHmauozDA","stars":5,"date":"2010-05-14","text":"This is the best dog store in Vegas.  The selection cannot be beat- they carry all the hollistic dry and wet foods, as well as treats.  Great selection of Wellness Formula, which is what I feed my dogs.  They also have a huge variety of toys, chews, clothes, beds, leashes, harnesses, bath products, etc.  They will special order anything you want that is not in-store.  Unfortunately I live clear across town from this store, or I would shop here far more often.  As far as pet stores in Vegas, this is as good as it gets.","useful":1,"funny":0,"cool":0},
{"review_id":"UsS8p8xwZcMfcL8ba2hT1g","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Ssa6XY_RdDRRB9wuVIeIWw","stars":4,"date":"2011-01-27","text":"Hedary's is legit Lebanese food.  Really yummy mango juice (more like a nectar and not overly sweet).  Solid hummus, good tabouli and Greek salads, and an incredible lentil soup.  Falafel are flavorful and not overly fried, although the sandwich was a bit on the dry side (needed more veggies\/sauce to balance out the grittiness of the falafel balls).  Pita bread alone is worth the visit here- sweet, puffy, and served hot out of the oven.  I definitely want to come back for their lunch specials, and to try the shrimp scampi (ordered by the table next to us- smelled and looked amazing!).  Hummus, pita & that lentil soup are better here than anywhere else in the valley.","useful":1,"funny":0,"cool":1},
{"review_id":"OM3jdzNpoHEGCaQZ4UsjAw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"eFbYR1MZT5zT9y-DO4F1dg","stars":5,"date":"2013-09-14","text":"This is THE premier alpaca store in the valley, if you're into this sort of thing.  I happen to love various furs- from Mongolian Lamb, to sheepskin, to alpaca- and this store is a fur heaven!!  I take trips out here with friends when we want to update or add to our collections.  I love that no animals are killed for this fur, and the quality is exceptional.  They have fab pillows, rugs, and various accents for the home- as well as some pretty cute sweaters.  I've also gotten some handmade moccasins and a horseshoe hook here, designed by a local artist in Boulder City.  Prices are on the high side (which is typical for alpaca), but the men that work here (owners, I'm guessing) have been accommodating at lowering the price (especially when you buy several items).  If you're looking for Alpaca, this is the place to go!","useful":1,"funny":0,"cool":0},
{"review_id":"lZoqIs5Td0dUA_DW4V7wFA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Qy_tDaVTWlS14fEglzo1Tg","stars":4,"date":"2010-05-13","text":"I'm a fan of Rachel's.  Like another yelper said- Vegas needs way more places like this!  It's a gourmet little breakfast and lunch spot, you order at the counter and there are some cute tables in and outside.  They have breakfast burritos, pancakes, sandwiches, wraps, burgers (beef, chicken), soups, pastas, and huge salads (spinach, curry chicken, cobb).  There is a nice selection of veg options and everything is fresh and high quality.  Pastries could be much improved on and I wish they served breakfast past 11 on weekends.  Mad props for having fresh brewed tropical unsweetened iced tea.","useful":1,"funny":0,"cool":1},
{"review_id":"0FlTdE0Cqc7ujLNTzYpOMw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"DkYS3arLOhA8si5uUEmHOw","stars":3,"date":"2011-01-19","text":"Earl of sandwich is a great concept and the menu is super enticing.  Prices are fair, quality is average.  The turkey is in the form of cold cuts (not roasted like Capriotti's) and mirrored the quality of a Quiznos or- worse yet- Subway.  The bread here is baked fresh to order and is fluffy on the inside and crispy on the outside- yum.  The All American sandwich was okay, but again the quality of the turkey was off putting.  It had cranberry sauce, buttermilk ranch, lettuce, tomatoes, and cheddar.  The fellow reviewer who said this sandwich trumps the Bobbie must have had a few too many, I mean really.  The tuna melt, however, was great- very simple with just tuna salad and melted cheese, but delicious.  If you like tuna melts then this is the place for you (that might have been a 5-star sandwich!).  Potato salad was average and they have a selection of other salads and kettle chips.  There is also an assortment of baked goods, unfortunately the chocolate cupcake we tried was yellow cake mix with chocolate frosting (lame!).  The earl gray lemonade was refreshing and delicious, and I loved that it was something different.  Major props for having good vegetarian options (veggie sandwich with feta and peppers and a caprese).  I'd probably come back for the tuna melt and an earl gray lemonade, but I am shocked that this place has better ratings than the much superior Tom Colicchio brainchild Witchcraft (which uses vastly superior ingredients and has more exciting offerings).  Mad props that it's open 24 hours.","useful":1,"funny":0,"cool":0},
{"review_id":"VQR9u5gWigPQqttg12zo-A","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"4Bw9XffSa0AMy2SrNCS2KA","stars":5,"date":"2010-06-02","text":"Sababa has moved up to five star status- strictly based on their falafel.  Let me be perfectly clear, I have never had anything else here.  However, this is the best falafel in Vegas- and I have tried many.  The falafel and hummus comes in a pita pocket filled with tahini, tomatoes, pickles, cabbage, cucumbers, and lettuce.  They have an incredible green parsley hot sauce (crazy hot!) and their falafel is moist all the way through (not dry in the center like many others).  The falafels are fried to order and the sandwich is made in front of you.  Still wish they had fresh brewed iced tea, but I usually get takeout anyway.  This place is Israeli owned and about as authentic as it gets.","useful":2,"funny":0,"cool":1},
{"review_id":"8g3N6sHKf89MwS6znhqraQ","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"t6WY1IrohUecqNjd9bG42Q","stars":4,"date":"2010-04-22","text":"I love Red Velvet Cafe, for their baked goods alone.  I have never eaten the food here, but have visited many times for tea and cake and often pick up their baked goods to bring home.  The owner's wife does all the baking herself, and it is clear that great care has gone into developing her recipes.  My favorite is the red velvet cake, which looks like a large cupcake and is topped with a deliciously sweet frosting and a whole strawberry.   They also do a delicious chocolate peanut butter cake, also in the shape of a large cupcake with a moist chocolate cake and rich peanut butter frosting.  The best part about these cakes is that they are under 200 calories, vegan, and free of any saturated or trans fats.  She does not use artificial sweeteners or make things that are low fat but still unhealthy- these cakes are all natural, preservative free, and taste delicious.  I highly recommend this place for their baked goods alone, and I look forward to trying their food.  The menu features sandwiches, pastas, salads, and an assortment of vegan meats and cheeses that are all made on site.","useful":1,"funny":0,"cool":1},
{"review_id":"zyXCUPpiotXHwuaQHR--cw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"Sr-TfSJOxrcnByDPeAzQLQ","stars":3,"date":"2011-01-17","text":"Went back to Fresh 52 today with the desperate hope that they'd expanded and added a few more vendors.  Unfortunately you can literally walk through the entire place in under 5 mins, so it's hardly worth the drive across town.  However, there are a couple places that will keep me coming back (at least on occasion).  The bread from Bon Breads is solid and they have lots of varieties (white chocolate batard, multigrain, pretzel rolls, ciabatta, etc).  Also the salsa and chutneys from Miguel's rock!  The salsas all have a great kick, and they have a mango one too.  They have jalapeno jellies and an amazing apricot jalapeno chutney that is super flavorful.  A couple places have come in since summer and a couple have gone out- there is still a decent sized produce stand but its strange that there was only the one vendor.  There is a face painting station, a dog store, and a booth that sells Scentsy.  There is also an organic, loose leaf tea stand and another with baked goods (although there were very few options).  There is a crepe stand too, but they were mostly dessert flavors rather than breakfast options.  I wish this place was 10 times the size it is, but it's still worth checking out and most of the vendors were solid.","useful":5,"funny":0,"cool":1},
{"review_id":"7BjS2cOrQXEIPpAKXBLvuw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0UlMUHtEDgDMkycBQpoAew","stars":3,"date":"2014-07-23","text":"This review is for the spa only.  It's a fab property that I've enjoyed coming to for years... unfortunately this place is pretty dead lately and the staff are not friendly.  My masseuses have all been good but nail techs not so much.  If they are struggling for clients they need to up the ante and make it a great experience worth the drive.  Also, the pool was closed due to it being a weekday (so we couldn't use the full spa amenities, which is why we go).","useful":3,"funny":1,"cool":1},
{"review_id":"a0SUOGOGA38TVe-xiTUDWw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"_8yxceldCT7oe0wJC-yDPA","stars":4,"date":"2010-11-30","text":"Benjrong is a great neighborhood Thai place... my husband and I have been getting take-out from here on a weekly basis since they opened and have never been disappointed.  The service is excellent and the restaurant could not be cleaner or more pristine- the entire kitchen is on display (major bonus!).  Favs include their vegetable egg rolls (love that sweet, clear chili sauce), tom yum soup, pad see ew, pineapple fried rice, pad thai, and the currys.  Their hot sauce is great, so are the lunch specials.  The food does not compare to L.O.S. or Komol in terms of the flavor or complexity, but everything I've had has always been fresh and delicious.  I definitely recommend this spot- it is way above average for a local Thai place and is not filthy, dingy, poor quality, or lacking flavor- like so many other local places...!","useful":7,"funny":0,"cool":1},
{"review_id":"JquBPoTv8E9B0PImoxX72Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"i3mZIwNi1EiJ7-1A8amoyw","stars":5,"date":"2011-05-24","text":"Five stars for the falafel at Amena!  Similar in style to the falafel in pita at Sababa (hummus, cabbage, pickles, tomatoes, etc), but even better.  Their pita is fluffy & delicious, like soft little pillows.  Falafel are bright green, flavorful, and the perfect size.  You order at the counter and when it's ready, you come up and chose what veggies you want inside.  They also have a good homemade hot sauce on the tables, and a great selection of bakery items including a really great baklava.  Best falafel in pita I've had in Vegas.  I wish I'd tried this place sooner... the creepy Trader Joe's strip mall\/dive-y location was throwing me off.  I should have trusted Misty's review because I've been missing out!  And like she said- they sell their pita bread!!","useful":1,"funny":1,"cool":3},
{"review_id":"jQIvBD-o4wux2r64D53h9Q","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"oH6QAuoTLFaX97oqqpLTMg","stars":4,"date":"2010-04-21","text":"Familia is in a strip mall on Durango and delivers to the surrounding area super fast.  Good service & they always get your order right.  Love their garlic knots, greek salad, and pizzas (cheese w\/ ricotta & basil is our standby).  They also have calzones and stromboli.  Good cannolis- thick cream with cinnamon and chocolate chips, filled to order in their homemade shells.  Spumoni ice cream for sale by the tub.  Way better than Marcos or some of the other chains in the vicinity!","useful":2,"funny":0,"cool":2},
{"review_id":"Rr7DUgBcjzKGQ3KiONi-7A","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"O7ot_LMlCfLpOP9tBqeNfw","stars":4,"date":"2010-04-21","text":"Love this sushi spot, I've been coming here for the past few years.  They're in Town Square across the street from H&M, next to Yogurtland.  Atmosphere is warm and trendy and is why I often prefer Kabuki to other places in the area.  Comfy private booths, tables, sushi bar, and an outdoor patio.  Usually crowded from happy hour (great specials) to closing, but I've never had to wait more than 10-15 mins.  Extensive cocktail menu, decent wine selection and several flavored non-alcoholic drinks including sweet mango iced tea and mint lemonade.  Edamame comes with all sushi orders.  Good miso soup and house salad with ginger dressing, decent seaweed salad but not my fav.  Lots of apps, including fried eggplant and calamari.  Large selection of specialty sushi rolls, fav is the Lotus on Fire roll (spicy tuna, jalapeno and lotus root on california rolls).  Extensive menu with lots of pictures, and lots of non-sushi items including teriyaki, noodle dishes, soups, seafood, etc.  Fresh fish, great service & atmosphere!","useful":1,"funny":0,"cool":1},
{"review_id":"IMuAGbZQDet04ZUbKMNJaA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"7tNY4BYLA4laqWNV4IWGQg","stars":5,"date":"2010-07-07","text":"Settebello is definitely the best Italian pizza i've had outside of Italy.  Their crust is bubbly, chewy and delicious.  They have some nice salads and a yummy focaccia (this is really just their pizza crust baked with some oregano and sea salt, but delicious none the less).  Great sangria, coctails, and espresso.  Unfortunately, their iced and hot teas are lipton (lame!!).  The margherita pizza is delicious, as is the four cheese (with gorgonzola and ricotta, yum!).  Their cannolis are good, traditional with dried fruit and chocolate chips but the shells and cream were both a little thick.  Their gelato is also good, but very airy and not dense like traditional gelato (great flavors though, including a seasonal apricot).  Comfortable atmosphere with tables and booths (props) and well worth the drive across town.  Five stars based on their pizza alone- delicious!","useful":2,"funny":0,"cool":1},
{"review_id":"uvYEVAqZYIrfcSk6VHrZoA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"7P3Z4HTUM8M8Y9Yw3cc7Pg","stars":5,"date":"2013-09-14","text":"5 stars for the chai latte at Tipsy- best chai I've found in Vegas.  Spicy and not overly sweet, and major bonus points for being able to order it with almond or soy milk.  The chocolates here are also great- the s'mores bar is graham cracker-y, peanut buttery amazingness.  Definitely a spot worth checking out.","useful":4,"funny":1,"cool":3},
{"review_id":"rMxsO1121Ki9O2NfDOQYEw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"0ldxjei8v4q95fApIei3Lg","stars":5,"date":"2010-08-15","text":"Lucilles is really great BBQ, definitely the best in Vegas by far. They're located in The District in GVR and the atmosphere is really great, very southern. Expect an insane wait here on weekends, but it's well worth it. They have some of the best sweet tea I've had, served in a huge maison jar. The bread basket is stuffed with buttermilk biscuits and apple butter, and they have some really good apps like pulled chicken sliders on sweet rolls, fried green tomatoes with red pepper cream, and fried pickles (spears, not chips served with remoulade). They have delicious salads (one with sauteed shrimp, one with smoked salmon and a peach vinaigrette, one with BBQ chicken and onion strings). They have the usual meat platters with brisket, tri tip, ribs, chicken, etc. They have a good blackened catfish and some incredible sandwiches- my favorite is the BBQ chicken sandwich with melted cheddar, onion straws, and lots of field greens on a french roll (they also have yummy potato buns). Sides are awesome- good mac n cheese, peanut slaw, sweet potato fries, cheese grits, etc.  Mad props for being one of the few BBQ joints that also caters to vegetarians- veggie burger, salad, or a really good marinated portobello sandwich with melted cheese and garlic mayo. Desserts include fruit cobbler, pecan pie, peach bread pudding, banana pudding, and red velvet cake !! There is a separate take out area near the entrance that absolutely kills it. Service is great and prices are reasonable, especially given the huge portions and quality. This is the only place my husband and I go when we crave BBQ, and we often take out of town guests here for the great atmosphere and food.","useful":5,"funny":1,"cool":4},
{"review_id":"2AYM2avwxiTBxMXntkpZMw","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"8UBOqmp97HzYB15PfKsChw","stars":4,"date":"2010-06-02","text":"I bought my car here late last year and have had good experiences with both their sales and service staff.  They are knowledgeable about all the models (including mine, which was new for 2010) and they do not leave harassing messages or turn into stalkers if you need some time to think before making your lease\/ purchase.  They always loan me a Lexus rental during servicing, even if I did not reserve one in advance.  The waiting room here is about as nice as one could be- flat screen, comfy couches, drinks, bagels\/cookies (my husband creeps on their cookies like they're going out of style).  Thorough car wash (inside and out) with every service.  When an update was needed for my car's computer system, they came to my house and installed it.  Unfortunately they are the only Lexus dealer in the entire Valley, so they aren't exactly wheelin & dealin here.  I hear they are opening another location in the Henderson area, which i'm sure will be a huge plus for people on the other side of town.","useful":6,"funny":1,"cool":1},
{"review_id":"jQARtVDXq-A9Lfvmg_rYHA","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"alaiXlogA286nuM8tj9ghw","stars":4,"date":"2010-04-23","text":"The Molto Vegas Farmer's Market is one of my favorite things to do in this city.  This is an indoor famer's market, located on Dean Martin in a warehouse.  It runs on Thursdays from 11am-1pm, with a previewing for chefs at 10am.  I found out about this place by eating at one of Batali's restaurants- it's all through word of mouth, they dont advertise.  There is lots of fresh produce including some nice heirloom tomatoes, herbs, lettuce, interesting citrus, etc. though it is not all organic.  Their prices are high, as to be expected.  They do not carry dairy for sale to the public, aside from cheeses sometimes (goat, gouda, and a heavenly buratta that sells out immediately).  You have to be a member of their profit sharing group to purchase the eggs.  There are a couple other vendors that sell coffee, dates, and some hydroponicly grown herbs.  This market is very small and even mediocre compared to what you would find in California or Seattle, but it is much better than the other farmer's markets here in Vegas.  Be sure to bring your reusable bag!","useful":2,"funny":0,"cool":1},
{"review_id":"CXm-RCYt0sp01Hasp-PVmg","user_id":"dEgO4_n8thLMbG1dKfFMHg","business_id":"JjcJVqhZXhP4tvOhg3fnag","stars":5,"date":"2013-12-07","text":"The ONLY company in town to use for anything water heater related.  Had my water heater replaced for $650 (other companies quoted between $800-$1k).  Charlie and Shane were awesome- straightforward, on time & super honest.  Highly recommend.","useful":4,"funny":2,"cool":2},
{"review_id":"8IJTnD7lMPklq8LOIVkUKw","user_id":"rPAWUsn1gtVuI4JS4n58Gw","business_id":"dWFUKB_HPBIE87AFBHEb_w","stars":5,"date":"2014-01-26","text":"Love the cheap flights, plane was clean and attendants was really nice.\n\nEveryone complains about additional charges but if you read the fine prints and understand their policy, then you'll have absolutely no problem.","useful":2,"funny":2,"cool":0},
{"review_id":"C9Qh8PWsfJNg2n6mEflHyA","user_id":"rPAWUsn1gtVuI4JS4n58Gw","business_id":"OETh78qcgDltvHULowwhJg","stars":3,"date":"2014-12-18","text":"Went there for my Husbands birthday on 12\/16 and the food was not as good as the first time we went in January 2014.  The soup was cold, the shitake mushroon side taste like soy sauced mushrooms and the American cap was flavorful but was tough. 5 star is for the American Kobe, mac and cheese and the French Press coffee (Yumo).  We really like the service and hope the next time we go to Vegas, the food will be as good as the first time.","useful":0,"funny":0,"cool":0},
{"review_id":"X8YDHpMp6S1rfarcuaPbZQ","user_id":"bsH9WdGVrFOjMlpDBNkWIA","business_id":"M30I1NPl5JuHthxo1IXPGg","stars":3,"date":"2009-11-28","text":"We stopped by for Pho since we were soo done with the Vegas mass grazing from last night.  The Pho here is decent as far as Vegas goes and the broth doesn't taste artificially sweet like some places when they load the MSG in there. Their bean sprouts are super clean and white which is a good indication they do it right. We may come back again if we have a Pho craving while in Vegas. Oh don't order the Che Ba Mau dessert it is a rip off!","useful":0,"funny":0,"cool":0},
{"review_id":"498PnbjX_IdBdjIVnegeJg","user_id":"bsH9WdGVrFOjMlpDBNkWIA","business_id":"EjYGxyksao-Jhw86tIAiYQ","stars":4,"date":"2009-11-28","text":"The Roast Pork was crispy and is better than Sam Woo. The BBQ pork noodle was okay because the BBQ pork wasn't great. The food is definitely made for Asian taste and thus authentic.  If you like sweet and sour then this ain't the place(try Panda Express). Portions are huge so be ready to share:-)","useful":0,"funny":0,"cool":0},
{"review_id":"_YKZDcsZ34XzabQJXmIm-Q","user_id":"bsH9WdGVrFOjMlpDBNkWIA","business_id":"DVfCbJhJUDWRlUfrKzaKOA","stars":1,"date":"2010-02-16","text":"I am from LA where there are many Sam Woos and this one's got to be the worst. You would think being the only one in Vegas it would do a better job at living up to the name like its LA restaurants instead they take a monopoly attitude. Food is mediocre and portions half of the same order in LA places. We tried the Roast Duck and you can tell it wasn't done thoroughly trhough and the meat didn't marinate through long enough. We also tried the clam and Ginger scallions. Clams were not fresh and the sauce had too much corn starch that it was thick and startchy:(\nAlso don't ask for forks or spoons as they still had clumps of someone elses dinner still stuck on them!!!stay with the disposable bamboo chopsticks!!","useful":0,"funny":0,"cool":0},
{"review_id":"1DPL8zmhG0ERfhjAArbG7Q","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"bFbfpIwrd5M8UsNpPivc6w","stars":1,"date":"2016-03-05","text":"AVOID. The worst customer service I have experienced in Las Vegas. Extremely hard to cancel account. I was told my account was closed and current then was still billed after I moved when they claimed I still have bottles that were not dropped off. Long wait times for customer support. If there are other options, use them! Trust me, you are better off getting a faucet water filter.","useful":1,"funny":0,"cool":0},
{"review_id":"4qujfz7p5-zjW4Cp4ujMLA","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"Oe7FYgamhSFuxQy9cMNI0A","stars":5,"date":"2017-03-02","text":"Great customer service from Linda. First Affogato and it was great! We tried the strawberry and cheesecake gelato. It's all delizioso!!","useful":0,"funny":0,"cool":0},
{"review_id":"eJblydKi2ZVUQx9YRgTYTA","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"gdtZA3sVQ5Hk-3oPBArdLA","stars":5,"date":"2011-05-18","text":"The reasons I choose this place over Chipotle: Wheat Tortilla, Brown Rice option, pesto cilantro sauce, no charge for guacamole on items. I go here probably 2 times a week lately because it is a good option for a healthy meal. I usually get the salad with brown rice, black beans, chicken, pesto sauce and salsa. I also like the option for a wheat tortilla. Guacamole is fresh and has always been good. Great food, great healthy options, good service.","useful":1,"funny":0,"cool":1},
{"review_id":"OMGU0QF9EJzIxLHGg-Aaew","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"dVQFNgVlnxgitEXDQR7tfA","stars":5,"date":"2015-03-29","text":"Some of the most authentic BBQ I've had in Vegas to date. Brisket was by far the best item on the menu. They know what they are doing. BBQ is a tough sell in Las Vegas and I hope they stay put for a long time. Well done!","useful":1,"funny":0,"cool":1},
{"review_id":"5BcuwzmlplsDp2fiqGRHdA","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"iYQPfLcPQXiYi-kycrm2rw","stars":1,"date":"2016-03-05","text":"I was a customer for 6 years. Always paid my bill on time. I go to cancel my account (a month before I move) and I was told to bring all bottles and dispenser in before March 1st. I returned all bottles and dispenser on Feb. 23rd. I was given a receipt that said my account was closed and current. Today I get a bill for $30 and they say I have 5 bottles to return still!? Are you kidding me? You looked at my account on Feb. 23 and cleared it! Took 30mins on hold to get customer service and was just told that she sent an email and a response would take 3 days. If THEY determine I somehow have these mystery bottles of water that I never received I will not be refunded. AVOID THIS SERVICE! TRUST ME. Everything about closing the account was (and still is) a nightmare. Do yourself a favor and do business with someone else! Some of the WORST customer service I have seen in Las Vegas to date. Shame of businesses that know they are below standards and continue to operate without making changes to provide better service. I hope all the negative reviews catch up to you and you see a decline in your profits because I am guessing that is the only way you will fix the issues.","useful":3,"funny":0,"cool":0},
{"review_id":"JR-GQhf8TqpdipWZN-5fHQ","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"EgemRE83Qe_ZbGnFcrPsng","stars":1,"date":"2016-04-20","text":"Let me preface this review by stating some facts. I lived here for 6 years. We ALWAYS paid rent on time, were respectful neighbors to the community and responsible tenants. These apartments were great..... 5 years ago. What happened? If you are debating renting here, let me fill you in on what you are really in for. \n\n2 years ago the apartments sold to new owners. That was the downfall. Instead of taking care of upgrading appliances, upgrading the landscape for renters or properly managing maintenance requests; they chose to upgrade the front office and future tenant center to increase curb appeal. They chose to close down the main pool.... right before summer. The pool was closed for months. They offered no reimbursement whatsoever. When you sign a lease you are entitled to the amenities that were provided to you when you were shown the apartments. The mailbox lock hardly ever worked and was left open a lot. Car patrolled security (non-armed) that once existed, must have gotten cut because they were no where to be seen in past years by my eye. Apartment building security lights were left burned out even after MANY maintenance requests, which was CLEARLY a security issue. This last December, there was an armed robbery.... AT THE MAILBOX at 10pm! Two men jumped from the nearby bushed area with a gun and robbed a tenant. We no longer felt safe and it was (in my opinion) because of poor management with caring about the safety and well-being of it's tenants that were already moved in.\n\nOnce you're in, why do they have to care about your satisfaction and safety? You signed a lease and they know they have you locked in. In the last 2 years, our apartment has been flooded by the upstairs unit 3 times! The first was a faulty bathtub connection but the second time was due to a maintenance repair error (as stated by the maintenance man) and was repaired VERY poorly and took over a week to complete while we couldn't use our main bathroom. The third time (see video and pictures) was also a faulty connection to a washing machine after it had recently been replaced. The managment never apologized once for the inconvenience to flooding our apartment for the third time in two years. They also NEVER came back to fix the damage it left on the walls and pillars, as evident by the water stain on our ceiling and paint that was bubbled. The foundation for the apartment is shifting as well. There were huge cracks in our walls from who knows what. Our sliding door on our patio would no longer shut correctly because the door frame was warped from the building's unrepaired structure (multiple times we put in requests to see what was going on with this. Nothing was fixed, just noted on our maintenance record) \n\nSounds great, right? There's more. So you can see how unprofessional they are, but how about unethical? They started bribing tenants to put in \"5 star\" reviews on yelp to get entered into raffles for iPods and other prizes. They also, recently, started asking new tenants to put in \"5 star\" reviews to get some fees taken off their move in costs. If you ran a sound business with great satisfaction, you wouldn't need to bribe people into giving you 5 star reviews, would you? Shame on any business that does this. And last, but not least, we are (at the time of writing this review 4\/15\/16) still waiting for our security deposit. Like I said, we ALWAYS paid rent on time, for 6 years! And the one time we are LEGALLY due our deposit IN FULL within 30 DAYS of moving out (Nevada States Law NRS 118A.242), it has not arrived. We have called Jessi, the manager, multiple times and never received a call back from her. We received one email stating the refund has been \"processed\" but still no update on the status or postage date.They tell us they are short staffed and sound really sad on the phone but guess what? You are a business! Act like it. Don't make excuses, just fix issues. If I were to tell them 2 years ago that I had some personal problems and couldn't pay rent (which never happened, just example given) would they let me pay late or maybe within 7-10 business days? NO! They would have fined me and eventually evicted us if they didn't receive payment. These are not even all the issues we experienced but this about sums up our time there. It is not right that businesses don't care about the tenants after they have signed a lease because they know they have them locked. We should have moved out 2 years ago, that was our fault for staying so long. But we have now moved into a new apartment with better appliances and staff, 24hr armed security car patrol, maintenance requests that were taken care of within the same day... all for the same price we paid there! Do yourself a favor and look around and judge for yourself. I can tell you that we feel like Andy Dufresne in Shawshank Redemption when he finally swims through the sewage drain and is free. Good Riddance, Vintage at the Lakes. And no, you can't buy a 5 star review from me.","useful":50,"funny":2,"cool":3},
{"review_id":"UjUbobbR2Takr5_GEhnWvg","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"qjLlFfu2pnJ9lVYlj-4QVg","stars":4,"date":"2011-06-29","text":"Cool little breakfast spot. Staff was really great. Nice atmosphere and country decor. We had the red velvet pancakes and the Monte Cristo. They were INSANELY good. If you aren't watching the calories go and try these. They also have a good selection of items for you if you are eating very healthy too, as I look forward to heading back there and trying the lighter options as well. A+","useful":3,"funny":0,"cool":1},
{"review_id":"16XgFPA1uPa09gSCEXOijw","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"bFdk8ZXEq4ApXVo9-4_alQ","stars":5,"date":"2016-09-17","text":"I have had the pleasure of having Budesa Photography shoot many things for me. Always professional and streamlined efficient. I would recommend to anyone without batting an eye!","useful":0,"funny":0,"cool":0},
{"review_id":"sT3Qz_Kv6LKIXWOAwsbJLQ","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"SVGApDPNdpFlEjwRQThCxA","stars":5,"date":"2013-06-26","text":"LOVE this place, and here's why......\n- GREAT, friendly and fast service. There are always 3-4 people coming by your table and refilling water\/soda\/beer\/chips\/salsa\/bean dip! They are on top of it!\n- Fresh tasting food. A lot of Mexican food around town (and elsewhere for that matter) taste like it's been sitting around for hours waiting to be served. This almost always seems fresh.\n- Fair prices! The prices for items and combos are great! Great happy hour too.\n\nI recommend the rancho style tacos and (of course) the fajitas!\n\nI hope people support this place and keep it in town. This is a hard location for businesses to prosper it seems. SUPPORT GOOD BUSINESSES!","useful":3,"funny":0,"cool":1},
{"review_id":"RUY_GN4tgIjDcbqR-gfEgg","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"ct43PIwz_XflYImvopdvIQ","stars":5,"date":"2017-06-22","text":"We just purchased a couch, computer table and chair here. Rashard helped us and was absolutely great! He was extremely helpful and had great customer service.","useful":0,"funny":0,"cool":0},
{"review_id":"OKEOvHR0VBaiw6igRS2w_w","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"k0iSRXXqw49yugl8UUpbsw","stars":5,"date":"2016-04-20","text":"My girlfriend and I have ordered from Ninja Fit Meals about 5 times now. It is great! All of the meals we have had so far are really good, some we just like over others. They have taken my customization and substitutions to the meals and nailed it every time! They care about pleasing the customer and helping you stay on track with specific needs. The delivery driver always calls and\/or texts to tell you he is on the way, which is nice. If you aren't home you can leave a cooler our with ice blocks and they will put the meals in there. We love the carb-less chow mein, turkey burger, turkey meatballs with spaghetti squash. All in all for meal prep and customer service, they are doing a great job! Thank you. - Cody","useful":0,"funny":0,"cool":0},
{"review_id":"76-blx-l94yFJf7VIoPgxw","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"rM73z7YU9M-U0HLP62XCZQ","stars":1,"date":"2013-06-26","text":"HORRIBLE!\n\nWe got a late night dinner there and everything was horrible. First, it looked like it was closed. I am sure that the employees do this so people just drive away (I wish we did). Our order was wrong. Cold and super greasy fries. \n\nand the chicken sandwich was RAW! If you think it's a pain to cook chicken late at night because it takes awhile SAY YOU ARE ALL OUT! But never rush it.\n\nThis place needs to either be under new management or torn down. Start over with a place that gives a damn.","useful":0,"funny":1,"cool":0},
{"review_id":"lUX1oD-UK8E0pCuic57EyA","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"2ZSRAM6TgzoCSfOsVHA7Qg","stars":5,"date":"2012-12-07","text":"I have been only volunteering at Toys 4 Smiles for a few weeks now but I can definitely say this is a great group of individuals that are donating a lot of time and energy to do something simple yet profound, make children happy. In a society full of high-speed entertainment (internet, cell phones and video games) fueled by a \"I want it yesterday\" mentality, it is refreshing to see something like Toys 4 Smiles. These toys are very simple, yet very high quality. It is rare in this day and age that a child will receive a toy that not only was HANDMADE for them but also requires them to use their imaginations. The way I think of it is that maybe some of these kids getting theses toys don't have a lot of people in their lives that make them seem \"worth it.\" Well, I am hoping that some of these kids will get these toys and understand that a stranger took the time to make them by hand and that a stranger CARES. They are worthy of it and deserve it. It's a simple thing but if that message reaches some children that message could possibly affect a life. \n\nI encourage anyone looking to donate some time (doesn't matter how much) to give them a call and head on in and help make some toys!","useful":3,"funny":0,"cool":2},
{"review_id":"R1P8ZSQopJc7Of2nOEBLOQ","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"gBy6UXTpoSHhW6qd15XU0g","stars":4,"date":"2013-06-26","text":"The hidden gem in Summerlin! \n\nThis is a little restaurant (separated from the gaming side) hidden by the Lake in Summerlin. We didn't expect much from this place but after reading the great reviews and it being so close to our home we had to try it.\n\nIT WAS GREAT. Here's why......\n- Friendly staff! Always smiling and it's a relief to see people working in F&B in Las Vegas that look like they are genuinely happy.\n- The food. I'm sorry to say but I didn't expect great food. I was mistaken. Everything we tried was pretty dang good. The breakfast burrito was great. The club sandwich was huge and great tasting. The quesadilla was maybe my favorite I've ever had, with the peppers inside, the crema on top and it wasn't greasy at all. Corn beef hash was also good. The eggs and bacon may be the downfall for them. They seem like they are instant and the bacon was majorly overcooked. Looking forward to trying the chicken pot pie and some other things there!\n- Price. It is VERY fair.\n\nThis place feels like a little local spot back home for us. So for that and the other reasons I listed, we will be coming back...... a lot. =)","useful":0,"funny":0,"cool":0},
{"review_id":"PToUJHmAOQplcDqj5HFnFw","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"cNEMXz1IWVv9YweDNlWi0Q","stars":5,"date":"2013-06-26","text":"I am somewhat new to comics. I read some as a kid but really just started getting into them more as an adult. \n\nI have been in some comic book shops where it feels like being a newbie is a bad thing and they don't really want you there. THIS ISN'T THAT TYPE OF PLACE!\n\nThe staff is great! They answer all my questions without some weird superiority judgment. (they also remembered me by name after only a few visits) They set up a subscription box for me to keep track of the comics I want. They matched some prices I found online for some back issues I needed. They call around to other stores to track down the issues you may need. They have a decent rewards card that when you fill it up you get a free book. The toys there are pretty fairly priced as well.\n\nOverall, great place!","useful":0,"funny":0,"cool":0},
{"review_id":"rzYTA7Wjg-ct3Xe7aI5vCw","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"aJK0MWXKgXIgQUCM9fqSJQ","stars":5,"date":"2011-06-29","text":"I recently planned my birthday party here complete with trying the \"MONSTER PIZZA CHALLENGE\" I have to say from the time I called to ask about having my party there to the time we left that night the staff there was awesome! It's so rare to find genuinely friendly staff in Las Vegas. They had our reservation perfect and gave my party it's own side of the restaurant. There was games for the kids. The pizza was very good. Roberto is a great manager (owner?) and he accommodated us with every need we had, which included staying open a little late. Do yourself a favor and go and support a Las Vegas business that deserves your money, time and appetite. \n\nps - all you other Las Vegas business owners, Go to Graziano's Pizza and take note of how to treat customers right.","useful":2,"funny":1,"cool":2},
{"review_id":"S_9Bp4k_VhF96iHfkHmtzA","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"T-wer_1iIXs692gYrTriDg","stars":5,"date":"2010-12-17","text":"Great food. Great service. Definitely go try this place. I haven't tried the egg&tofu but have had everything else and it's great. Fries are awesome!!!","useful":1,"funny":1,"cool":2},
{"review_id":"Tu8F31A68RplGzO0Dc0GEQ","user_id":"nS4mcwbdFynSchOqtDhWsA","business_id":"CeqWpwHBoaxwRcv5btnv6g","stars":5,"date":"2013-06-26","text":"LOVE THIS PLACE!\n\nBasically, this is chipotle\/subway of pizza. Great and fair prices. Quality ingredients. Daily specials. Friendly staff. Beer.\n\nGreat concept. This place really does things right! The white pizza was great, as well as the classic margherita pizza.\n\nThe downside I think for this place is the..... NAME. It's hard to associate \"custom built\" with pizza, especially if you are driving down the street and can't see the \"pizza\" part written very small. To me, this seems like a great name for a cabinet maker or something.\n\nWe love this place and hope it survives the rough Las Vegas restaurant market but it doesn't ever seem that busy and I think the name is what's hurting it.  \n\nWhat helps this place? Word of mouth and Yelp reviews!","useful":2,"funny":0,"cool":2},
{"review_id":"7zBs0pdvjArtKjVR7RH7yQ","user_id":"4nlF6QV8SVpnNUcN2qNdqA","business_id":"FqJ1SWEBhgVl66FrcsovOQ","stars":4,"date":"2015-10-17","text":"We came here on a Friday around 5:00. I was a little nervous because of the other reviews but all in all it was a great experience. It's not like I was expecting much for 4.99. We have 3 kids and since kids under 4 eat free we fed our family for under $20! The pizza was fresh and hot and they kept different varieties coming out all the time. The tables were clean as were the bathrooms. The staff were friendly and helpful. I would absolutely go back to this location.","useful":1,"funny":0,"cool":0},
{"review_id":"VAa8KY-ud6Ua_SBQmtuGEA","user_id":"gHN-3VzMjDYRF0eQNfo2wg","business_id":"8-_jXGGDFPFAPB4r1x-81w","stars":1,"date":"2013-03-14","text":"Wanted to try this restaurant as we live nearby and couldn't figure out where to park. Finally we went around to the back and found only valet parking. We went to Rosie McCaffreys instead","useful":6,"funny":2,"cool":0},
{"review_id":"yxdIh2zBNDpxKouVKbMtuA","user_id":"cyOUpn20SRhyP8K7SZG-0Q","business_id":"IlV0PBRM6NnYhpR0RSYcCA","stars":5,"date":"2017-02-02","text":"We chose Vanna to take care of our mature Golden Retriever Cody many times over 7 years ending when Cody passed in early 2016.  Vanna demonstrated such care and love for Cody and we were comforted when we were away knowing he was in the best care.  Vanna has a knack for taking care of multiple dogs at a time, and Cody always had so much fun with her and the other dogs.  She walked her guest dogs many times a day and Cody got more exercise and play than he did with us.  When we returned Cody was always so happy and healthy and he looked like he'd just had a dream 'dogcation'.  Cody would always get excited when we walked towards her place, it was clear he really enjoyed his time with Vanna and her other guest dogs.  Vanna's rates were the lowest in the area too.  If you want your dog get the best exercise, food, love and attention, and a chance to live and play with other dogs (they are pack animals), I very highly recommend Vanna's services.  Cody had a much improved quality of life because of Vanna.","useful":0,"funny":0,"cool":0},
{"review_id":"HAGBBc0EThybIfWq2zQ4kg","user_id":"d9HmceFp7H26qE4xSiEMiQ","business_id":"GT0K4EdSSxe_LMU6SPr-_A","stars":5,"date":"2016-05-05","text":"First of all, these are amazing cupcakes! A little slice of heaven. Really the best cupcakes I have ever had -and I have had a few:). Secondly, the people that work here are super friendly and responsive.  We had a window for delivery time but when I called to see when they were coming within the timeframe (because we had plans), they changed their delivery route to come to our hotel and worked around our schedule. And they were so gracious about it. The delivery person wouldn't even take a tip.  Class act all the way around.","useful":2,"funny":1,"cool":1},
{"review_id":"rV6b-1ICuJ0sI4tdbmSD7g","user_id":"bF94vG4-iserSe-4rLLDtw","business_id":"KaGZE0_o1EmmSN4Fo_cpUw","stars":5,"date":"2016-10-17","text":"Excellent place with good food, fast service and plenty of screens to watch the game. Prices are affordable and the service was prompt and courteous.","useful":0,"funny":0,"cool":0},
{"review_id":"-JZrDxBDTvD5Y5zf1JFI9A","user_id":"bF94vG4-iserSe-4rLLDtw","business_id":"8b5ll2kjXfjgFIqWsjkr8Q","stars":5,"date":"2016-10-16","text":"Stopped here for breakfast excellent service and the food above average.  The place is very nice and comfortable. The waiter kept my coffee cup filled without me having to ask. The prices very reasonable. We came back for a late lunch. Once again the food and service  were excellent. Food portions are generous and appealing. The waiter kept my water glass filled and removed dishes as soon as we were done. In both ocasiones the bill arrived promptly. A very nice place!","useful":0,"funny":0,"cool":0},
{"review_id":"YIF_DDmOsCJgwefNaGA7Tw","user_id":"bF94vG4-iserSe-4rLLDtw","business_id":"dWk0mbhj79pK3WBp5oLtpw","stars":2,"date":"2016-10-16","text":"Saturday night a super busy place. The atmosphere is definitely lively. The food was ok I ordered the meatloaf  it came with soggy and greasy onion rings... left them untouched. My partner ordered the pub hamburger with a side of crunchy onion rings... onion rings soggy and limp.  Not a place to recommend.","useful":1,"funny":0,"cool":0},
{"review_id":"eeMZdlmx8UYGyfzB5XzYTA","user_id":"zOf0Ty1b9WyKLW7zu7W1jQ","business_id":"SvCjBtbN1cKElDKPTw9dOA","stars":5,"date":"2017-05-29","text":"This was probably the best seafood meal I have ever had! And in Pittsburgh!! Who knew? 2 locals on the strip recommended this restaurant when I asked where we should eat atop Mount Washington. They both stated Monterey Bay Fish Grotto. \nThe drinks were excellent, as was the ambiance. The view was amazing and we weren't even by the window, but elevated to where we could see everything. Incredible! The appetizer was to die for, and the meal itself was superb! I had the parmesan crusted swordfish, my husband had the crabcake with sea scallops, and our daughter had the crabcakes. All were cooked to perfection and plated beautifully. Our server knew what she was talking about and was very helpful in our selections. For dessert, we shared creme brulee and the angel food grilled cheese. Oh my word, talk about delicious! If you don't eat anywhere else in Pittsburgh, this is THE place to try!","useful":1,"funny":0,"cool":0},
{"review_id":"HAMqF3h7h9dFtc9t8z3paw","user_id":"Y8yr-YJPU8OTpVZKeA0JEw","business_id":"El4FC8jcawUVgw_0EIcbaQ","stars":2,"date":"2015-01-05","text":"First I stay at the Grand every year for CES last year was really nice but this time I am very disappointed with the room and the cleaning crew. When I got to my clean room I was great by the housing keeping. They had just cleaned my room min before I got in. I decided to use the rest room to wash up before hitting g the strip and noticed that the bathroom was clean but on spot. The shower wall had black long women's hair on the wall. I called the front desk to get house keep up to clean it. They did cone and cleaned the rest room, but fit some reason they did not clean the wall were the hair was. I had to call three times before someone would c lean it. \n\nNot very happy with my stay and it's only the first night","useful":0,"funny":0,"cool":0},
{"review_id":"g8WVsxQvtJ5iP0bUarXrSg","user_id":"3s8yuXqHQLLaC4TwhyUGkA","business_id":"KnafX7T6qSAmSrLhd709vA","stars":1,"date":"2016-08-15","text":"My family and I travelled to Montreal for a week, after reading a couple reviews we decided to grab some dinner at this location. We arrived around 5 PM, and it was not busy. We were not greeted or seated for a good 5-10 minutes after walking into the door. The waiter did not seem to know much about the menu or he did not bother to explain any of it to us, we ordered some appetizers. Most of the food was bland with no flavor. Their spring rolls are not authentic spring rolls, most likely spring rolls catered for non-asian. Let's see, it took about 10 minutes to get seated and the appetizers came out 15 minutes after we ordered, but after finishing out appetizers and waiting approximately 20-30 minutes after our mains had still not arrived. So we asked the waiter how much longer our main courses would take, he looks at us then looks down at his hand which had our orders. He did not put the orders through! This was horrible service and he did not even apologize, he would looked annoyed anytime he looked at our table. Keep in mind that when we walked in there was only 2 occupied tables. It was already getting late and we decided to wait for the main course. The pho had the weakest broth I have ever tasted. Everyone else food was either cold or bland. HORRIBLE food and TERRIBLE service.","useful":0,"funny":0,"cool":0},
{"review_id":"w-9rcSWXwzhpx2NcPjJbJA","user_id":"3s8yuXqHQLLaC4TwhyUGkA","business_id":"gkxmQi2cipbysXFgT_w_jA","stars":5,"date":"2016-08-15","text":"Great for tourists and the food is amazing. They have a wide selection from sandwiches and salads. The service was amazing with such a busy atmosphere, although the seating is a bit crowded the food will not disappoint. This is a must visit place!","useful":0,"funny":0,"cool":0},
{"review_id":"Cx67XHccKO1ngOkqhOaQ0g","user_id":"3s8yuXqHQLLaC4TwhyUGkA","business_id":"bMiyGPaMqF0svjseW1UR_g","stars":5,"date":"2016-08-15","text":"If you're a tourist, COME HERE! The service was nothing short than superb, came to Montreal to visit some friends and explore the city, we had a reservation and we greeted kindly as soon as we walked in. Our waiter was friendly and lively, more importantly patient as we had difficult time choosing what to have. We ended up getting quite of bit of food to share among all of us. The food was terrific, the beef tartar was packed with flavor and ask for extra bruschetta because there is only 3 pieces along with the order. Duck poutine and shepherds pie makes my mouth water every time I think about it. Their wine selection was not bad, and had all of the essentials. We had a great time among friends and the staff, and the food with wine is amazing!","useful":0,"funny":0,"cool":0},
{"review_id":"g4Ne97Z4zeacIffwSekL3Q","user_id":"nD8PQeD5nxnAEBqgtTJFZA","business_id":"7QSFLU0AGAUqwnQWg3qHqQ","stars":5,"date":"2014-01-16","text":"Matt is the hardest working and most dedicated worker I have ever met. Every previous worker I have used to clean my dryer vent took the easy route and did a half quality job. Matt squeezed into areas my two year old boy would have trouble getting into just to make sure the job was done correctly, and on top of this is half the price of every other company I called. At the end of the job he told me that he probably saved another dryer fire from occurring and that makes it all worth it. Truly loves his work. I will never call another company again.","useful":1,"funny":0,"cool":0},
{"review_id":"7AB65HgPA95FnZi8PKPQEQ","user_id":"Abq6fRXgpL34w5dtff0L5g","business_id":"twOcD5kUudEwzLfUdaVduA","stars":5,"date":"2015-12-10","text":"The Haus of Vapors in Phoenix is by far the Best Vaporizor retailer in AZ!  If you want to quit smoking, new to vaporizing, or just curious about the whole vaporizing experience.....this is the place to go. The owner is awesome and so are his employee's, they all know everything you need to know to get the best education on vaping as well as knowing their customer's needs.  They have the best vaporizing liquids ~ far superior than your regular smoke shop....and very decent prices. The owner takes pride in his shop and it shows!!  From  the name on the building to the interior and the awesome flavorful experience as you try out the flavors!  My fiance and I have been smoker's for 27+ years pack a day or more....tried the patch the gum the meds and nothing worked till we walked into the Haus of Vapor's!  If you are the same get the Snowwolf 200W don't mess around ~ you will be glad you did!!! Experience, Education & Excellence!!!! Phoenix Sprouts Plaza on E. Indian School between  N. 28th and 30th Streets. I F!@#en LOVE Unicorn Puke!!! Raquel & Josh","useful":0,"funny":0,"cool":0},
{"review_id":"Rqs0bz4IbEvGHEZL4chxDw","user_id":"Ako9YE9_h_oc5STiaJmGYw","business_id":"IKpVBsOTixsnoU4r0Sc42A","stars":4,"date":"2011-02-15","text":"My rating would be a 5 if it wasn't for the Tom Yum soup. The soup was good, but I've had better. However, their green curry and drunken noodles were outstanding! Spice level and consistency was perfect. They even stayed open late to let us finish our dinner! Fantastic!","useful":0,"funny":0,"cool":0},
{"review_id":"rDsKttj1Cin1P1JpP-lEyg","user_id":"Ako9YE9_h_oc5STiaJmGYw","business_id":"6AgvdkMHPvAGpxs7gdx38Q","stars":4,"date":"2011-03-17","text":"So far so good! Service Has been awesome, Beer has been great! The carne asada quesadilla was yummy! The margarita pizza was excellent and the buffalo chicken slider was tasty. I was not impressed with the black angus and pulled pork sliders. The pulled pork turned out to be carne asada and not pork at all, and the angus was only a burger patty. Didn't come with toppings it sauces. Otherwise excellent!","useful":1,"funny":0,"cool":0},
{"review_id":"IjbYAsSU43leeZNi5UE7Sg","user_id":"Ako9YE9_h_oc5STiaJmGYw","business_id":"WBxR9IC6E9-4szNzq7_Y3Q","stars":1,"date":"2011-02-15","text":"Worst green curry I have ever had. The chicken and vegetables in the curry were good and fresh but the actual curry a\nSauce was awful!!! It said it was made with coconut milk, but I'm thinking more like coconut water, or maybe just plain water. It was runny and flavorless! But the spring roll that came with the lunch was good....","useful":0,"funny":0,"cool":0},
{"review_id":"crAOVfddTrf1ThVQJoAN0g","user_id":"eCQ6FwqUILL2YRLRZ9B8sQ","business_id":"NylzsZ9pSn4ZNuGMHKSYPw","stars":5,"date":"2015-10-30","text":"Great pizza, friendly staff. First time trying neechis pizza. As a active duty military member pizza is almost part of my everyday diet. I was very impressed with the taste and the amount of toppings the crust had good texture and was very tasty as well but the sause is what made me put them at the top of my list very unique  I haven't come across before in other pizza shops that I've been at across the country  (San Diego, Texas, north chicago,michigan,ohio) I travel alot so I like to get a taste of everyones pizza. And they offered me me a military discount which helps us military guys out thank you neechies.","useful":1,"funny":0,"cool":0},
{"review_id":"LokF1PCr7__3K4Hi7oL0eA","user_id":"D9r8nSaeLnjvC46hBi7Nig","business_id":"ujKOI97lVORJJx8rOvOLkw","stars":5,"date":"2017-11-03","text":"Been coming here for years! They are always so good to my dog, they don't lock him up in a cage for hours, they let him hang out and play with the other dogs. He is always happy and groomed perfectly. The owner\/manager is so sweet and always so accommodating. Love this place!","useful":0,"funny":0,"cool":0},
{"review_id":"VUHnZ4quLUaigowEH_MKnA","user_id":"RAqwBjWe9pt5yhOcFZFHnA","business_id":"c-NXKTJ0jrrusTPxJAUwvA","stars":1,"date":"2014-11-12","text":"HORRIBLE SERVICE! Waited for a half hour didn't get our appetizer, while everyone who was seated after us was served.  The server didn't even get our order until 15-20 mins of being seated. I get its a new restaurant but it shouldn't take that long for our appetizer to get to the table. The manager had to go to the kitchen and get our food that was probably just sitting there. Then when we got our food the waitress came over and said she forgot our onion rings. So upset with the dining experience. Food was alright but still didn't need to take over an hour to get everything to our table. Thought this was a burger place?","useful":0,"funny":1,"cool":0},
{"review_id":"P1ykWPA1P0Unqu4epHcqdg","user_id":"HCurof8TGOxl9BmrMLYhfw","business_id":"MVHGmZEwtKrXH11ySGweEw","stars":4,"date":"2017-04-02","text":"This was an excellent restaurant with a great ambience and lovely food. I was in town looking for a great place to eat which would serve fresh food with high quality in reasonable portions, and I stumbled upon this place. The service was great, the food was excellent quality and taste and minimal disruptions. I ordered the kale and arugula salad which I did not realize had bacon on it. The server did not even question my concern and right away replaced the salad for my convenience and satisfaction. I was so impressed at how she did not even question it and said no problem we will just change the for you to make sure you are happy with your food choice. I would really recommend this place","useful":1,"funny":0,"cool":1},
{"review_id":"qQtp2EtDW9iOJkz2Pa4AYw","user_id":"HZgnRq19XNjQA5QF_bBQHQ","business_id":"riM-pBsdqRRVXtAVbLfsxQ","stars":2,"date":"2014-03-04","text":"Food great. Service horribly. Not enough staff to handle a small amount of customer. Had to wait forever for each step of the process. Be prepared to have to shave again during the meal","useful":1,"funny":1,"cool":0},
{"review_id":"kdhG9o9fJZwuSwk6qrNsWA","user_id":"HZgnRq19XNjQA5QF_bBQHQ","business_id":"irje9nJnDy6GbfU84v0N4Q","stars":1,"date":"2013-04-27","text":"Slow and understaffed.  Looked past me and took known guy behind","useful":1,"funny":0,"cool":0},
{"review_id":"SOUnhCZVlAIkGRHAm8cu1g","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"RocmpYTrzNTxRll1kqUv-w","stars":5,"date":"2015-04-16","text":"Always quick and efficient! The price is right, every time I go (probably twice a month) I do the $15 wash, which includes exterior and interior and my car always comes out like new within 15min!","useful":0,"funny":0,"cool":0},
{"review_id":"8osa6iIynfQBHrS_cxB1iA","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"nWbYvXpikLfAh4S6AkG45A","stars":5,"date":"2016-03-30","text":"I am not usually a fan of burritos, but wow I am obsessed with their breakfast burrito and all of their pastries are fantastic. I've definitely found my favorite place to grab breakfast or lunch or just a sweet treat!","useful":1,"funny":0,"cool":0},
{"review_id":"imZ0ZKiV5AhxqIDCJzHcRA","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"dSnQTUJC0tCHadU1AGzvrw","stars":5,"date":"2015-02-13","text":"One of my favorite places to get a drink and a great meal largely because you can't bet the beautiful and relaxing atmosphere! You can sit right next to the golf course while watching the sun set over the mountains and service is always fast and friendly","useful":0,"funny":0,"cool":0},
{"review_id":"U5_1pvL1sO27LMfEVhgsgg","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"VuIIfIAEtGFXcAcXCvK-1g","stars":5,"date":"2017-03-30","text":"Service and atmosphere was really great and had a fun twist on decor. Food came out quickly and the portion size was large. Got the la vaca loca that had the steak. Flavoring was great, but ordered with the green sauce and I didn't really taste or see it in the burrito so maybe it was forgotten? So instead I loaded it with the side of salsa given and side of guacamole that I ordered and omg so good! Salsa and guac was awesome and so fresh. Definitely will be going back for a nice quick lunch","useful":0,"funny":0,"cool":0},
{"review_id":"v2LE8OeTOS-wvhjW34Dmhw","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"i43yZtGjLh2TG9h7qnlrqg","stars":5,"date":"2016-05-16","text":"This place is absolutely amazing and service outstanding! The atmosphere is relaxing with stunning views which makes this place one I keep coming back to again and again. Prices are completely reasonable and I believe a little cheaper when compared to the other high end spas in the area. The restorative organic massage is my favorite since it uses hot towels to massage your back and includes a scalp massage and foot scrub!","useful":1,"funny":0,"cool":0},
{"review_id":"n0qdoqUMdrOzJ5CJcJNAhQ","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"QlJztL2aGEXgejgi5JM9Xg","stars":5,"date":"2016-03-09","text":"Of course the food and drinks were perfect like always! Cocktails are a must and you can't go wrong with any one (especially their Mai Tai). We always do a full meal of appetizer, entree (the snapper, steak salad, or fish tacos are my favorites) and dessert when we go because everything is just so good! Hands down my favorite restaurant in the Scottsdale area; you just can't pass up a beach paradise atmosphere in the desert.","useful":0,"funny":0,"cool":0},
{"review_id":"gUXVzIoXADXLCmzRCKnh9A","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"wCZDFjbSbSjd0CbDSZ6nEg","stars":5,"date":"2017-04-05","text":"After shopping around for cushion replacement not only did I get the best price and customer service here, but Valerie even came to my home at no additional charge to measure everything. She even offered to discard the old ones for me & if they're in good enough condition they donate them to dog shelters to be used as beds which is such an amazing idea! They had the best selection of fabrics from different manufactures including Sunbrella, Tommy Bahama, Outdura, and Pindler. Valerie was also really helpful to narrow down choices that helped me stay in budget, but as she mentioned you can start here and the sky's the limit!","useful":0,"funny":0,"cool":0},
{"review_id":"V63BNnG12ZwePjQG7USPoQ","user_id":"78ozwVVXXg1GX8rfmJu5ow","business_id":"utIA0LyQmwP-9DRyxUe6qQ","stars":3,"date":"2016-03-09","text":"Loved the loose leaf tea. Meal wasn't my favorite, but I got an egg dish and apparently they are more known for sweet breakfast dishes such as pancakes etc. The two people I went with both got pancakes and they enjoyed them","useful":0,"funny":0,"cool":0},
{"review_id":"7lAq38kMwk81v6jxTNyQng","user_id":"1bXT6ARpZMe18P2RJMe56w","business_id":"7QOprctB3pj4WqBOlEe4MA","stars":1,"date":"2013-07-12","text":"I had such high high hopes for this place. Truly. I too toured the facility and I like Marc T was in awe of the facility and the cleanliness everything was so new and properly stored, I felt like if I had to put my baby somewhere this is what I would want.  I did in fact enroll my child for the summer program the rates are high but I figured someone has to pay for the amazing aquarium that was mentioned in the previous review and it included snacks and 'breakfast & lunch' so I dove in!! \n\nWith MUCH push my husband finally agreed to let me pay the fees which included a enrollment fee of 150 plus the first week, (you are charged weekly on Fridays) I chose to put my child on an easy-pay system where they would pull out weekly for his tuition Mistake 1. The first week they charged us our normal tuition plus enrollment fee (183 for 3 days mon, wed, fri & 150 enrollment) then no less than 3 days later they charged us again! This being our first week my husband and I were a little taken aback but we figured eh maybe a fluke,  after addressing the issue with  Kaylee we were told \"no worries, well note your account and we just wont charge you for next week\" great I thought lets move forward then 3 days later ANOTHER charge now I was getting a little annoyed.\n\nI don't know your financial situation but the tuition is high so these accidental charges were starting to hurt after the 3rd accidental charge. Again I went to the office and spoke with Angela the finance director and I told her we were a little concerned we had only been attending one week and already had been charged for 3 weeks plus enrollment. I kindly asked for a refund as I didn't mind waiting for the first accidental charge to catch up, I was more than a little peeved about the other charges. I talked to Selena and she told me that I needed to bring in my credit card statement that showed the charges...Lol I wasn't lying. Don't they keep records of what they are charging peoples cards!!\nAngela tells me SUUUUURE you can have a refund in 6-8 weeks!!!! 6-8 weeks because your finance department cant keep its records straight? I snatched up my easy pay document so fast she had a paper cut!!! \n\nSo I let it go AGAIN (really didn't have a choice we were 3 weeks in on charges) I continued to bring my son. When I would pick up my son the room was so hot I could smell the children's sweat but this is AZ heat so I figured man the AC must be working hard to keep this place cool and I would bring him at 8 so maybe they had just turned it on. \nOne of my biggest concerns was the child to teacher ratio, were talking 15 KIDS TO EVERY ONE TEACHER!!!! Why? because that's the minimum that the state will allow wouldn't you want your child to go to place that goes above a beyond the bare minimum? It was a ZOO when I would have to get him early. There was no less than 35 kids in the class at any given time. Great! I thought a great way for him to socialize with children his age. They called me less then 1 hour into his class saying that my son had attacked a little boy, when I went to get him thinking my son had mauled a little boy I was very upset he had never hit before, when I walked in he was sitting alone (I assume time out) which I am okay with but when I asked if the little boy was okay I looked he had a scratch the size of a sewing needle, not downplaying what my son did he should never hit but they are 5!!! They are learning they are going to get into scuffs.  My son came home on the 3rd day with a large scratch on his forehead I didn't say anything because I get it, they have scuffs and boys can be a little rough. After the 2nd time I chose to remove him from the program, just in time in my opinion I just got a letter saying they needed another 150  for supplies. Lol\nAcross the hall from my sons class was the infant room, my heart would break to see the infants crying with no one trying to console them. As a mother I know that some have no choice but to put their child in daycare and work but would you want your baby to be screaming because they aren't required to have more teachers in the class?. It just made me so sad to see this daily.   \n\nThe staff is SUPER UNFRIENDLY I actually stopped smiling to them because you know that feeling when you smile at someone and they look a you like you have gone mad smiling at them!!\n\nIn conclusion if you feel the need to enroll you must be okay with the following:\n\n1. Your child must NEVER make a mistake like get a little rough with another kid, if you work plan to miss a few days because you will be asked to come and get him\n\n2. Have an endless supply of money because they will need it. 150 enrollment, 150 for 'supplies' ( must be for the starbucks) plus tuition \n3. must be okay with unfriendly staff drop your kid and leave. \n4.Must be able to figure out their plans they don't tell you crap till day of!\n\nUPDATE: The school asked that I remove this post.....ugh I think not!!!!","useful":95,"funny":7,"cool":4},
{"review_id":"tsSqmOBEarX77lsjRfm09w","user_id":"xg9PJEgX8ARHjitU1dgP_w","business_id":"EXlUUDk3d7jDFgrvvZ5YtA","stars":1,"date":"2016-12-15","text":"I've been taking route 57 - Courtney Park for the past 6 years and it's been a disaster. This route operates only every half an hour during rush hours and even that is with lots of problems. \n\n- sometime one bus doesn't show up AT ALL\n- there is never any action taken to accommodate for the problems on the route or with the bus breaks down \n- the bus stops, either in terminal or even enroute have no shelter and waiting so long in cold winters is not fun!","useful":5,"funny":1,"cool":1},
{"review_id":"t0OkYMxZPKFlDSx7MmN9pA","user_id":"zRftf6yjt4LsaN469CFyFg","business_id":"Gc-HJ7FQ6_tFBmwZ5Pm-wQ","stars":1,"date":"2016-04-11","text":"The water for the shower was not hot enough. The rooms are pretty old and our refrigerator was faulty. Not the best place to stay.","useful":0,"funny":0,"cool":0},
{"review_id":"-MdaLtTGWryNDkKzJG6Auw","user_id":"QaTWzVQrV-NOeIK9YkBxsg","business_id":"ndzT1maiVwpz-7VFFzAb5Q","stars":1,"date":"2017-03-10","text":"The service throughout the night was inconsistent.  I asked how the shrimp was prepared.  The server said, \"medium, we prepare all of our fish medium.\" Uncooked shrimp? No thanks.  We ordered two appetizers, a salad, steaks, and a side dish.  The oysters were placed on the table without explanation of the accompanying sauces.  The salad was good, tomatoes were fresh.  The lobster mashed potatoes had so much butter that it was pooling around the edges of the bowl.  One steak was overcooked, came out medium well instead of medium rare.  The server took it back and the manager quickly came over to apologize and offered to even cook both steaks again so we could eat together.  We felt it was handled appropriately and would easily have returned for future meals after this.  However, the steak never came out.  I asked the server after a long while to see if it may be ready.  She came back from the kitchen frazzled and said, \"it will be out but I don't have a time to give you.\"  Then a kitchen manager brought a piece of meat, set it down, did not wait for me to cut it open and quickly left. It was very fatty and appeared to be NOT the cut of meat (filet) that I had ordered.  It was over cooked, again.  The server happened to walk over and said, \"yes, I thought that it didn't look right.\"  I left without eating dinner.  She brought the check over and said, \"I'm sure you guys don't want dessert, so I brought the check.\"  The manager never followed up to see if I had received the new steak.  The issues could've easily been solved had someone not dropped the ball and given up on following through.  They did credit the check for two steaks, but really that was not the issue.  Unfortunately, this restaurant was a big let down.","useful":1,"funny":0,"cool":0},
{"review_id":"xczaWzd3tMgL7btH3H5gow","user_id":"QaTWzVQrV-NOeIK9YkBxsg","business_id":"HZRTSC7R0JWThNTCqVLnsQ","stars":5,"date":"2016-11-24","text":"Had the Giglio pasta tonight. It was AMAZING! I usually don't write reviews, but I felt this dish exceeded expectations. Service was excellent!! Appreciate the attentiveness to our two children present as well. Thanks for making it a nice night out!","useful":1,"funny":0,"cool":0},
{"review_id":"uHiUFtpz80uMWxu8bGWZNg","user_id":"7XucHwQSdN_5-8LBpIvCUQ","business_id":"xwIJGDiwUz5aorokYKfxIQ","stars":5,"date":"2016-10-18","text":"Learned about the establishment by chance.  I went to the Craig location and was blown away by the quality of the poke.  I was so stoked when I learned that they have a South location. The customer service is superb and you can sample all the different poke. Personally I like the spicy ahi poke, salmon with special sauce. This is definite must try","useful":0,"funny":0,"cool":0},
{"review_id":"97c672k4eUCN3qGMw7TXpA","user_id":"7XucHwQSdN_5-8LBpIvCUQ","business_id":"RJLwZQETZ6K_0BsDVSJykQ","stars":5,"date":"2017-04-28","text":"Recently I have been searching for a window cleaning service for my new business.  Out of all the companies I called, this was the only one who answered their phone.  As scheduled he came on time got the job done very quickly.  I was suprised at the difference in appearance after getting our windows cleaned.  To top it all off, he was very affordable.  Highly recommended.","useful":0,"funny":0,"cool":0},
{"review_id":"rtUz24fd7RimXLFqwBcgqg","user_id":"7XucHwQSdN_5-8LBpIvCUQ","business_id":"XsSgv3vBOyOBXn3Co8EVIg","stars":5,"date":"2016-01-30","text":"Great service.... The food is phenomenal they have a restaurant connected to it so you get restaurant quality food. Only caveat is to make sure you make reservation early since the place can be packed","useful":1,"funny":1,"cool":1},
{"review_id":"0h4pYbFtZSLTJ511afiNtQ","user_id":"HjFNEyVxVr0v64ByghoDOQ","business_id":"ljuT-1vsT3PcRUGwphPYoQ","stars":5,"date":"2017-11-17","text":"Great service, reasonable prices, could not be happier with Robert and his services!","useful":0,"funny":0,"cool":0},
{"review_id":"5rkG-PQvv67POYHytJ_3Lg","user_id":"HjFNEyVxVr0v64ByghoDOQ","business_id":"Ej0sTcCOsvjsamtvdeGlOA","stars":5,"date":"2016-08-31","text":"We are extremely happy with the timeliness and the quality of the service Chris provided.","useful":1,"funny":0,"cool":0},
{"review_id":"o2n1fpH2MJizCqYP9bWTxA","user_id":"HjFNEyVxVr0v64ByghoDOQ","business_id":"v6HIAGRoLv3sZnv9pcWlGA","stars":5,"date":"2017-10-29","text":"Needed a \"Schedule B\" service on my 2014 E350....knew the dealer would be expensive but would probably get the job done with minimal hassle.  More than pleasantly surprised with the quality and timeliness of the work.  But what compelled me to give a five star rating was the final bill.  When I picked up the car I was told I needed a new \"pollen filter\" and a new \"air filter\".  I was hoping it would be just an oil and oil filter change, but Carlos told me they needed to be changed.  I was shocked when he handed me the bill and it was at the estimated price. I asked about the filters, and he told me they were able to change them and honor the original estimated price.  This has never happened to me at a car service place ever.  Never ever.  I am a very satisfied customer.  They did the work at a fair price, and well under the dealer price.  Could not have asked for more.","useful":0,"funny":0,"cool":0},
{"review_id":"f0GLg18mQ5Q3tR70A7CBhg","user_id":"HjFNEyVxVr0v64ByghoDOQ","business_id":"FiXuDGt0rOqHCJncWEnQSA","stars":5,"date":"2017-05-02","text":"Second trip to Frank's, and it is always a very good experience.  Frank is beyond fair, the work is top-notch, and both times the car was delivered on-time as promised.  They get my highest recommendation as getting your car repaired is not the most pleasant task in the world, but Frank makes it as painless as possible.  Everybody in the shop has a great attitude.","useful":0,"funny":0,"cool":0},
{"review_id":"alrXi5Zmsc1W2lq0OHWMLw","user_id":"3UTrKHzEfh16TXMaokObcg","business_id":"bivY4IG4zyvMakJ9UQdSdw","stars":5,"date":"2016-06-05","text":"I love the lemon pepper chicken with fried okra and feta spinach. Yum yum yum! I wish it were open more hours.","useful":0,"funny":1,"cool":0},
{"review_id":"GOznKkym_lN65np3nmDofw","user_id":"3UTrKHzEfh16TXMaokObcg","business_id":"klQnFvxN7stIgYAvRylY0Q","stars":2,"date":"2016-02-26","text":"Not delicious. I wanted it to be but it wasn't. Firecracker shrimp didn't have good flavor. Looked like some college guy's sad first attempt at stir fry. I'll never eat here again.","useful":0,"funny":0,"cool":0},
{"review_id":"IIQkjUqghEgJ0mnBymtEOA","user_id":"SopkFrK7bO7VqLsPyokHxw","business_id":"JIfSollg32ifUzTw2K4PDQ","stars":5,"date":"2017-02-28","text":"This place is beyond amazing. My boyfriend took me here for the first time a month ago. By far the best tacos ever...","useful":0,"funny":0,"cool":0},
{"review_id":"FO2tw_h8Bw2o0uppTsUnhw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"RJNAeNA-209sctUO0dmwuA","stars":4,"date":"2013-07-07","text":"Great place right on the Capitol Square. Very good food and good beer selection. Pretty good prices as well. Expect to pay anywhere from $8-$10 for a sandwich\/burger with side. Didn't end up having the fried cheese curds like other people recommend but they did look delicious!\n\nOnly gripes for this place are that you can expect to wait a while for a table and they do not take reservations. Second, when it gets busy the service can be slightly spotty and it seemed to take a while to get our food.\n\nIt's such a great place though that's probably why it's so busy!","useful":0,"funny":0,"cool":0},
{"review_id":"D3RS7nKmU_TveOArTyNBmQ","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"L772e6l2Yd0DJEyCBxBNng","stars":4,"date":"2013-07-07","text":"Another great staple of Madison that is a must try. Food is very good and beer is of course good. You can get free popcorn for the table. Order food and drinks at the bar and they bring it out to you.\n\nThe outside seating area is awesome too in both summer and fall. A must try if you are going through Madison.","useful":0,"funny":0,"cool":1},
{"review_id":"A2K9InLMRkhNnzWI6pjdVg","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"LxXgO4DTj78L5--V-8TGrA","stars":4,"date":"2015-01-21","text":"Came here in the winter (January) and still had a lovely time! Walked around the outside areas where we were told the things to see included grasses and bark.....\n\nWho doesn't love a conservatory in winter? Nice steamy walk through an area teeming with life! Great variety of plants and trees to see along with some birds (mostly quail). For some reason I'm a sucker for pitcher plants, for which there were a number for me to see around the conservatory. Would definitely like to come back in spring\/summer.","useful":0,"funny":0,"cool":0},
{"review_id":"SJ_FkWA9GZEn1YvmJOO2NQ","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"VHYdRWV4krjQ-HWWXpN2Jw","stars":4,"date":"2015-07-21","text":"This is a fun place in Madison to come hang out especially on Fridays or weekends. Was pretty packed this past Friday when I went and at first was kind of too much craziness. Luckily we had reserved seats and people seemed to settle down after the first couple innings as lines for beer and food shortened considerably.\n\nLove the beer that they have here. Lots of Great Dane brews and more common craft brews. Food is pretty good with burgers, brats, pulled pork, chicken, fries, slaw, potato salad all available.\n\nWould recommend paying the $5 for the reserved seating in advance though the only drawback is that this is not like a picnic table so it is a bit hard to have a group there in reserved seats and all be comingling unless you are getting up a lot. Regardless, this is still a fun time and it shows by how packed it gets.","useful":0,"funny":0,"cool":0},
{"review_id":"GCgUJTpbrcaPeGC76wZJpw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"Bdpol3l4pXm9FPfHaBqtbg","stars":4,"date":"2015-05-24","text":"It is pricey for the average golfer but if you are an avid one who appreciates good golf courses and experiences, this is a great choice. Played the Desert and Canyon courses which were both in very good shape. Cool layouts with some challenges including some tight holes. Overall though this is a very beautiful course on SE side of Camelback Mountain. \n\nOnly criticism is that we got out early on the Desert course and played pretty quickly only to get stuck behind a whole bunch of groups at the turn going to the Canyon course. The ranger\/time starter guys couldn't exactly explain why that happened.\n\nOverall though this is a great course with nice amenities. Grass tees. GPS in cart. Would definitely come play again.","useful":2,"funny":0,"cool":1},
{"review_id":"PflxNu9c5UL8WLddFgIYdg","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"mYZth87kJbyWwmTmVsvKcw","stars":4,"date":"2012-12-30","text":"Course was in great shape and is reasonably priced for a TPC course. This is a fun course to play but is very tight! Great location right at the Marriott in Scottsdale and is convenient to get to from most places.\n\nThe people were friendly except for one guy in the pro shop. Interestingly the 18th hole is the only one where there were some quality issues as the fairway and green were not in as good of shape as the rest of the course.\n\nAll in all though, I would definitely return.","useful":1,"funny":1,"cool":1},
{"review_id":"zomIGnSmCDWM6Ud9lLaX4g","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"Um1RlhIOjamlkF4YoAj_8w","stars":5,"date":"2012-12-29","text":"The only knock I have on this course is that it is a bit pricey (which is a common complain of mine). But overall this was a great course and a great experience.\n\nWe played in late December so there was a frost delay but once we got off it was sunny and not very cold. The group in front of us was playing a bit slow from the outset and by the third hole the ranger was on them to speed up (which they did).\n\nCourse is playable for many skill levels. My group played the tips and are above average golfers and we enjoyed our experience a lot. It was not an overly challenging course but still required skill. Very professionally run course with 3 separate nines (we played Ironhead and Acacia). \n\nCourse was in good shape and greens rolled true. Only additional complaint would be that the restaurant was under construction and not open for another month or so and when we went to the only other shop which had food they were out of some different beers and other items (which they had on display and made it seem like they did have them available).\n\nI would return.","useful":2,"funny":0,"cool":0},
{"review_id":"WDHVhfsADJNdu-5Wd9zTNA","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"XxnQKE9jTD0bTE3LZ5NOtQ","stars":4,"date":"2015-01-21","text":"Not much to complain about here. Good food on the east side of Madison with a good beer and drinks menu. I had the bison burger which was fantastic and got the side of cucumber cilantro quinoa. People I was with had skirt steak (again delicious) with garlic mashed potatoes (you guessed it....delicious). \n\nVery nice wait staff and good homey kind of place. If I lived in Madison I would definitely come back to this place as a staple.","useful":0,"funny":0,"cool":0},
{"review_id":"C8TbA1WEfXWjHKzifQ4Yjw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"GKtVASxg9ZafsNEQnFsipQ","stars":4,"date":"2015-05-24","text":"This course is on the less expensive end of the scale for Scottsdale which still means fairly pricey (I believe it was around $80-$90 per person in prime season in end of March?). There is no driving range but we went to one of the courses nearby beforehand which wasn't very far away.\n\nOverall though thought the course was pretty solid with a nice layout. Greens in good shape. Course had some challenges but also had an overall layout that seemed to keep the ball findable because everything sloped inward. Got out at 8:45 or so and played pretty quickly. Would definitely come back for more.","useful":3,"funny":0,"cool":1},
{"review_id":"TbfeWsbxIRVBAyT8Nk3gAA","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"7T2Dx26gYKPMFmAWwHgnOA","stars":5,"date":"2012-12-31","text":"Found this place on Yelp while I was on vacation in Scottsdale so figured we would try it out and it was wonderful!\n\nThe service was great and there wasn't really anyone else there when we went so Arturo stopped by and offered us some of the Habanero Tequila (apparently he makes it). WOW it was hot. Not really for me but very interesting and awfully cool of him to come out and offer us some.\n\nFood was great! I had three different tacos (Calimarii, Blackened Fish, and Carnitas) and all were awesome!. Other people in my party got blackened fish entree, the carnitas entree, the carne asada entree. Everyone was happy!\n\nFriendly people and great food. Pricing was very reasonable too. My tacos were $2.50\/$2.99 each and most entrees were in the $6-$9.50 range.\n\nWould definitely return!","useful":0,"funny":0,"cool":0},
{"review_id":"zyCkXpwh92wS70wID4Fslg","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"MpWkXcBH1sSVcjReplDB3A","stars":4,"date":"2013-07-07","text":"Cool distillery\/bar east of Madison. Didn't really see a lot of the distillery but mainly there is a drinking room. They have a menu of different cocktails. Was there on a Saturday around 6 and it was fairly busy.\n\nPricing is pretty good - generally $6 per mixed drink. Try the Honey-Cap!","useful":0,"funny":0,"cool":0},
{"review_id":"Dt-A-Pm1wHviLPI_-nPm6A","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"MPNZs5BCc9zF1yG16MCVIg","stars":4,"date":"2015-05-24","text":"Always hard to judge how strenuous a hike is from reading reviews cause you don't know people's fitness levels. This will definitely present a challenge for people that don't exercise much as the first part is fairly steep and continues for probably about 30-45 minutes. We took the trail up to Tom's Thumb and back which took at least 2 hours round trip. We started early like some recommended to take advantage of shade on the first part of the trail at that time of day and it was a great idea. \n\nThe trail itself though is very nice aesthetically with great views and an interesting path. The trail to Tom's Thumb is pretty well marked. The view from Tom's Thumb is great and you marvel at seeing the trailhead parking lot off in the distance, seeing where you started from.","useful":3,"funny":0,"cool":1},
{"review_id":"8aseofzW4xTEwWDDHbrUkA","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"kOUnvmGamiw90BfmthoQGg","stars":5,"date":"2013-07-07","text":"Great Mexican place in downtown Madison just off State Street. This place strikes you as very authentic (perhaps it was something about the luchador fights on TV in the restaurant with the Spanish commentary).\n\nFood was awesome. Had tostadas and gorditas which were both fantastic (chorizo, steak, pastor (pork) - can't go wrong!). You can buy individual tostadas or gorditas for $3.50\/$3 each though there are lots more options. Also had this amazing drink that was like milk with cinnamon toast crunch flavoring. Definitely check that out.","useful":0,"funny":0,"cool":0},
{"review_id":"slyLW324PBZb8DRoCGBaMg","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"FEH0i7SnTH81k451ZadKIQ","stars":5,"date":"2013-07-07","text":"Been to the Dane County Farmer's Market more times than I can count over the years. What an awesome event every Saturday. Atmosphere is wonderful. The market extends around all 4 sides of the Capitol. \n\nHighlights of the market are the wonderful fresh food, trying all the awesome cheese samples (curds, fried cheese, aged cheese, etc.). Doesn't get much better than the fried cheese. Great pastries\/bakery items too - hot and spicy cheese break, donuts, muffins, scones, etc. I've also bought vegetable plants from the market and they've seemed to turn out better than ones you buy from home depot or somewhere like that.\n\nTruly an awesome place. Lots of people though and if you get there after 10 it is pretty crazy busy. More like a crawl around the Capitol.","useful":0,"funny":0,"cool":0},
{"review_id":"PaAhCPNps4JWpMZwcqHLAw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"7Tp53xZh1ypd2wbudP6Qcw","stars":4,"date":"2012-08-28","text":"I'm always surprised at how hard it is to find good Pad Thai but this was always good. Service was usually good. I would do both sit down and carry out and had good experiences with both.\n\nMainly remember this place for the solid Pad Thai. Nice people. Cash only.","useful":0,"funny":0,"cool":0},
{"review_id":"U0X075Kt8oxWPxo4-b3dIw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"zuVvDYJkKAbXQTTBauAqJQ","stars":4,"date":"2012-12-30","text":"Saw this place on Diners, Drive-Ins, and Dives and had to come try the brioche french toast. We went on a week day and it wasn't very crowded. Everyone seemed to enjoy their food that I was with (people got omelet, the Wolfpack (hash browns with eggs and bacon in between more hash browns) though noone thought it was outstanding.\n\nThe brioche french toast I had came with caramelized bananas and pecans and I had to ask for more bananas because I literally was brought 3-4 small slices of banana on top of my french toast and the pecans were all bits and pieces. To their credit, they brought me out a lot more bananas and they were caramelized and in the caramel sauce.\n\nI would definitely return.","useful":1,"funny":1,"cool":1},
{"review_id":"WdyMjsAyvmRwBOJvNwvZxw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"LTywGqbbdAlZr7R5vodlPw","stars":3,"date":"2012-12-30","text":"This place is nice but nothing outstanding. If you are looking for a place to go and get pampered this is not the place for you. The pool is nice and the hot tub is pretty large and awesome.  \n\nThe only restaurant on the premises is a small snack shop by the pool which has sandwiches and such. The rooms have kitchens which provide what you need if you want to make your own food while you are there. There is a breakfast provided from 8-8:45 two days a week which is nice but isn't out for long after the 8:45 end time. During that time you are presented different activities and excursion type stuff you can do in the area.\n\nThe concierge is definitely helpful as they recommended a good breakfast place (though there are others) and helped us get a tee time at a discounted rate at a nice course nearby.\n\nAssuming you have a car, going to Sedona is a must and is a pretty drive up there. Also interesting if you are adventurous and are comfortable driving on unpaved roads in the mountains is driving the Apache Trail which goes out to Tonto National Forest and Roosevelt Lake.\n\nI would likely go somewhere else if I went back to Scottsdale as I wasn't blown away by the place, but it depends what type of vacation you are looking for. The place was clean but the maid service didn't really do much.","useful":6,"funny":0,"cool":0},
{"review_id":"Bp7fEbRXhjYQpGvHCTlRaQ","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"IpLvJEjb4AN8eWq5NE2TVA","stars":5,"date":"2012-08-28","text":"Oh! This place is soooooo gooooooooood. Brunch buffet is absolutely ridiculous - prime rib on Sunday, every kind of breakfast food you can imagine, for a little extra you get all you can drink mimosas, cinnamon rolls are awesome.\n\nFor dinner I was a huge fan of the cheddar burger (you get a ton of shredded cheddar on top) and the prosciutto pizza. Beer was great too.\n\nService is typical. Decent prices. Food is fricking awesome.","useful":1,"funny":0,"cool":0},
{"review_id":"izoGsnF1RIfouhBroVksxw","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"-rLP6lfoQmOO_5Pf2bTkqg","stars":5,"date":"2015-01-21","text":"This place rocks. Would come here very often if I still lived in Madison. Everything from the food, to the setup, to the dcor is awesome. Not been to many places where you go to find more seating upstairs and it basically feels like you just got home. There are tables and then a whole loft-style area with couches and comfy chairs where people can hang out. But in an authentic way, not the forced Starbucks kind of way.\n\nThe food is stellar. Got the chorizo skillet which was amazing. My part also indulged in blueberry and raspberry scones which were awesome (taking cues from the other recommendations). I enjoyed a nice hazelnut coffee and then got the free refill! Also loved how you can take jars of preservatives\/jam to your table to which were also delicious.","useful":2,"funny":0,"cool":1},
{"review_id":"JGO8m4vQqXoHzQdKKiswhQ","user_id":"IKChsSm17dLG0mTHjFiDLg","business_id":"c0p3hFgBo5tGxqncNRN9Eg","stars":4,"date":"2013-07-07","text":"Went for the tour and drinking on a summer Saturday. Pretty nice little Saturday! Tour is $5 and they just take you through the warehouse and some of the brewing area. It isn't anything overly special. If you've been on other brewery tours before it is a pretty standard one.\n\nBeer I great though. With the $5 tour you get a small tasting glass and three different tastings. They have the staples along with more seasonal and experimental type brews. Pretty reasonable prices too if you want beers\/pitchers also (which you will). Pitchers are generally around $11.","useful":2,"funny":0,"cool":0},
{"review_id":"I_GE8a4C5FTS6XEulq6lLg","user_id":"RPRcMY6gHDKSX1RlmeZgbg","business_id":"HudCKBs3crW5mjaD7Y89gQ","stars":2,"date":"2013-03-25","text":"worst cup cakes ever - my husband and i tried the salted caramel and the peanut butter and chocolate and they were both very dry and heavy. There was no hint of salt with the salted caramel cupcake.","useful":0,"funny":0,"cool":0},
{"review_id":"lIE9-jRlix5ac5RrHdkwFQ","user_id":"vD8eGYQNF0A8iIlEogaaJQ","business_id":"XXCDAqG0iwIWWuKOtnre0w","stars":5,"date":"2017-02-28","text":"Excellent service and results. Always prompt and we receive a call from our regular provider Dean the day before he comes to ensure the time is convenient.","useful":1,"funny":0,"cool":0},
{"review_id":"y__v7cc2SEfEn1Z9NWxF_A","user_id":"1_vUWGAJJnIrb7LzYuQPMg","business_id":"xT2uoooO9YHIR0xN9szbSw","stars":5,"date":"2016-07-16","text":"So, after my walk from whalburger, which is in an earlier review, also amazing, we headed to the fuel bar.  Professional flaretenders.  Sooshey and the guys throw up a mean cocktail with some sick tricks to go with it.  I have been to places where flare was the theme but the drinks tasted like sweaty nut water, but here, the drinks were amaze balls!!! I suggest getting the Moscow mule, and try to find the bogo coupons they have floating around.","useful":0,"funny":0,"cool":0},
{"review_id":"gKmkOVwpnxU4A8Mp6oggTQ","user_id":"1_vUWGAJJnIrb7LzYuQPMg","business_id":"ysv6yhVYOoH9Pf7PlMyD0g","stars":5,"date":"2016-07-16","text":"Wow, best dang burger!!! Get the beast, omergerd!!! This is the pot of gold at the end of a dark and contaminated rainbow.  After a long night of being humped and grinded on by degenerate girls full of plastic and daddy issues, this was my nirvana.  It tasted better than the silicon titty that was in my mouth the night before. I only wish it were in Dallas.","useful":0,"funny":0,"cool":0},
{"review_id":"FeYCURv6pO0IPfbOgejgNw","user_id":"0FJbbY865TdxboeHRyfgAQ","business_id":"JJAwT9R6Fp2yyWHtWFA8uQ","stars":5,"date":"2015-11-08","text":"Hands down the BEST sushi I have ever had with a lot of great options to choose from, and the customer service to match it... but you will pay for it","useful":0,"funny":0,"cool":0},
{"review_id":"5Q7w_ksDJWE-dbP3d5kIqg","user_id":"BFRFt-rUyriu7NfUQmpSXg","business_id":"2ktKjN5z8EcqmUv6EDiDgA","stars":1,"date":"2013-11-15","text":"Got $1000 worth of tires today. They told me it would be a long wait & they'd call me when done. I waited from noon till 3pm. The tires were done @ 1:45 pm. They said they were too busy to call. 3hrs for the guy in front of me for a flat tire fix. When he complained Erick his service guy said \"Thank you\" with a smirk and walk away. Don't recommend them. The change in staff since the last few tire sets I purchased is quite noticeable. They need customer service training.","useful":2,"funny":0,"cool":0},
{"review_id":"yjgm1_GMxV0ioIXfqISIkQ","user_id":"Bl-cBFv_uFvLAwaPEDwlZQ","business_id":"ZpRt2D9ME9NpLuYU9tmOtQ","stars":4,"date":"2016-08-30","text":"I was kind of hesitant when I seen that a Thrift Boutique was coming to the neighborhood. But when I chose to stop in; it was a pleasurable experience; very upper class. They have clothing (men, woman, children) some sporting, kitchen, baby items. Great condition, some prices could be lower, but over all not too bad.\nI've been in twice; looking forward to going back to see what is new.","useful":0,"funny":0,"cool":0},
{"review_id":"pKM06pwDNSWBxoITUkTT0g","user_id":"Bl-cBFv_uFvLAwaPEDwlZQ","business_id":"v6HIAGRoLv3sZnv9pcWlGA","stars":5,"date":"2017-03-20","text":"I recently moved to the area and was looking to get my oil changed on my vehicles. Walked in and spoke to Carlos.......he was very helpful and polite. Made an appointment for both my vehicles. Got everything I needed and was updated on when and how often I needed to do further maintenance. Carlos shared with me what type of oil to use, spark plugs ect...........NO one had ever done that before. I was actually treated like a person and not a female who didn't know anything. This was a GREAT experience; will highly recommend. Oh, and something else I didn't expect............I now have an online garage where I can keep track of my maintenance and they offer coupons too! WOW!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"33hP4MrYb0xDykxPNERcJQ","user_id":"OEhGkOZzU1Zz9rMoXlbHiw","business_id":"2-9wu090DJutG_MPUgPWQw","stars":4,"date":"2014-08-02","text":"Nice atmosphere, good service, and quality food at a great price. I know this sounds really gimmicky, but I'm a real customer. I'm just getting straight to the point!","useful":0,"funny":0,"cool":0},
{"review_id":"YZ-18xeXPACWT8XSpC5vpw","user_id":"OEhGkOZzU1Zz9rMoXlbHiw","business_id":"dQwjYLmQXb06CpMPIpm5-g","stars":1,"date":"2014-04-21","text":"I thought maybe this was a hidden gem, not at all! Food was okay, space is very dank, service was horrible! My dinner counterpart did not like her meal, the waitress' response: Sorry. After asking the item to be removed from the bill the waitress and owner literally argued with us since she had taken a few bites (how else can you tell you do\/don't like something). A few days later, I'm noticing they ran my debit card twice. NEVER AGAIN!","useful":0,"funny":0,"cool":1},
{"review_id":"e0NxyPeWMhnxu_LKIDUgpA","user_id":"OEhGkOZzU1Zz9rMoXlbHiw","business_id":"6nrmLizifFSiPhNgfUCn2w","stars":5,"date":"2014-08-03","text":"This place is true to its name. I agree with some of the other ratings I've read about the friendly staff, good machines, and comfortable environment. Only downfalls are that the WIFI doesn't always connect to my PC and that they don't do alterations w\/ dry cleaning. I can def overlook those things, however. Oh, and I LOVE that the machines accept debit\/credit cards: note that it'll automatically take about $15 dollars out though, then comp the difference afterwards.","useful":1,"funny":0,"cool":0},
{"review_id":"Mw-jId89JYkQJK27kyE84Q","user_id":"ToKtEUjEFAcuVvk0nFULpw","business_id":"ATKC7O3KXK-CXVG5P0fkiA","stars":4,"date":"2016-09-30","text":"TR Lawing handled my business very professionally. The only recommendation would be to improve contact accessibility. Thank you.","useful":0,"funny":0,"cool":0},
{"review_id":"PK9p3TI4FlGJP3bGnRpbkQ","user_id":"IcofZ-GryR3NFqQtieH-kQ","business_id":"fYISBJhVMef0wOqX8JUxlQ","stars":5,"date":"2015-04-25","text":"I went here with my wife for a spur of the moment date night. The club itself is very nice and the staff was great. We shared the pickle fries and spinach artichoke dip, which were both very good. We even got to witness someone literally spit their entire drink up from laughing so hard. Overall a great place to hang out and laugh your ass off","useful":0,"funny":0,"cool":0},
{"review_id":"t_THKBXiQAwlD413e5YyaA","user_id":"_VO_XW9fSnpqLFd0zbU03w","business_id":"jCR-xC4NqoEajjmstqX8sA","stars":2,"date":"2015-11-01","text":"Cheap prices but I'd rather pay full price for decent food.\n\nCalamari was greas instead of crispy, served on a bed of tomato sauce rather than dipping sauce. \n\nPrime rib sliders tasted like the meat had spent the last week in the refrigerator before being served. \n\nLast was the tenderloin skewers , my wife ate them as I had lost my appetite...she said the best part was the sauteed spinach they were served on. Ya, they shoved a wooden skewer into 3 chunks of random shaped  over cooked salty meat.\n\nWaitress was very nice and was sure to remind me how cheap the bill was, I guess so I would't stiff on the tip.\n\nMy beer was nice & cold ...I should have stopped there.","useful":0,"funny":1,"cool":0},
{"review_id":"rWCnSQs1Rho9wIuFM1ISWA","user_id":"OB7Jr1Z4llMO1fxlgV3hdQ","business_id":"C2mqIEnUWeo1UOcW00nWtA","stars":5,"date":"2017-07-08","text":"Excellent food, a wide variety of different pasta, seafood, steaks.  The etouffee was delicious with plenty of sauce to rice ratio.  The chicken alfredo was more than enough for a hungry 7 year old. The finale was the chocolate mouse cake!  The service was excellent thanks to the waitress Melissa!  Great date place with table cloths and cloth napkins and a chilled fork for your salad.","useful":1,"funny":0,"cool":0},
{"review_id":"DSBfDSF8gRoC2gqaf99rGg","user_id":"OB7Jr1Z4llMO1fxlgV3hdQ","business_id":"JrrP9JcYwMMsxFK4ZsP6ug","stars":5,"date":"2017-09-24","text":"Was very helpful.  We had a session on finaces and preparing for future retirement.  The consultent\/coach encouraged me where needed, and gave good advice.  Please try out the services!","useful":0,"funny":0,"cool":0},
{"review_id":"Dm5tU_e86c6K0hbBrw_Ldw","user_id":"gmr8Rl17Zh_xCwdl2bN_2g","business_id":"k2b3niokS_tosjah_rzCPw","stars":1,"date":"2017-04-21","text":"I should have checked the box before I got home. I ordered for pickup. I understand this is a pizza place but I paid over $10 for 5 burnt chicken fingers and 10 burnt fries. I LITERALLY counted 10 fries. How was that acceptable to serve on a plate as a cook and then as a cashier how could you let someone walk out with that? I was so hungry and too pissed to go back when I got home. Extremely disappointed with the sky pointe location.","useful":0,"funny":0,"cool":0},
{"review_id":"PyTApFwPL9yjep29MhTa5w","user_id":"gmr8Rl17Zh_xCwdl2bN_2g","business_id":"xDl6ZZmfvVCnEAk6WQGouA","stars":5,"date":"2016-07-02","text":"Keith was my sales rep he was awesome. I had to take care of a busted iPhone 6plus screen and decided to just ditch the iPhone all together. I was totally prepared to turn the iPhone in and get the 80$ credit so I wouldn't have to deal with fixing it. Keith explained ALL of my options and I had a clear understanding of what I was getting. I switched from Verizon, WAS VERY IMPORTANT I KEEP MY NUMBER.. he transferred my  contacts(offered to transfer photos if needed), had the screen protector put on my phone. The best part is he did all of this in 20 MINUTES. \n\nEveryone at this store was extremely professional and friendly. Keith understood what I needed and I felt comfortable about making the switch from Verizon after 14 years!!! Nicholas and Robbi (sp?) were knowledgeable and professional as well.\n\nThanks again. I left the store feeling like I got exactly what I needed and was looking for.\n\n If you're looking for an EFFICIENT FAST professional you can trust, I would go to this location.","useful":0,"funny":0,"cool":0},
{"review_id":"5C6fAk8p27ouZuByPPi0CQ","user_id":"xyfxqz_nkxjPkqFJpT5wow","business_id":"egLYFnycp8ktxMCvilFdLw","stars":5,"date":"2012-11-29","text":"This was honestly the best time I've ever had getting my photo taken!\n\nMy last passport photo was taken at a Black's, and was so bad that customs agents actually laughed every time they saw it.\n\nIn comparison, I actually look so much better in this photo than I do in real life! John (the owner) absolutely adores what he does. From the second I walked in, he had nothing but compliments for me. He gives you the option to choose from multiple poses, and then takes the best one and does some slight Photoshop magic to make it even better. He then prints it while you wait.\n\nCash only - all in, it cost $7.90 for 2 passport photos with the official stamp, and he threw in an additional one \"for my mom\". \n\nOverall, it took 10 minutes for the whole \"experience\", but it also never felt rushed. I'm tempted to go back to get other random photos taken, just because he made me feel so good about myself! Be sure to ask him about the time he was in a movie with Mark Wahlberg - he has the photos to prove it!","useful":0,"funny":0,"cool":0},
{"review_id":"PDU0uu6XG5S7H1XgJSUPyg","user_id":"TjBK0uMx9c2qEiDmDdDPsQ","business_id":"_t8B7bb-Q7kmn50kvGEKzw","stars":5,"date":"2017-01-11","text":"The food was good and our bartender Rob made excellent drinks. Everything was made well and the prices were even better! Rob was also very friendly. Great bartender.","useful":0,"funny":0,"cool":0},
{"review_id":"BjpVFGMPlubN07Ob0Ekw1w","user_id":"TjBK0uMx9c2qEiDmDdDPsQ","business_id":"iocG2xLxxHDmjsnGz9oikQ","stars":5,"date":"2017-08-16","text":"I made my husband try some Jell-O shots and he was buzzed off of just a few of them. Great little place for booze!","useful":0,"funny":1,"cool":0},
{"review_id":"MConJEiPRN81X5duunLCnA","user_id":"TjBK0uMx9c2qEiDmDdDPsQ","business_id":"dc6sPg9kNliz_Cy2yX19tw","stars":5,"date":"2017-01-23","text":"We have been coming here for years for sushi. Andy is a sushi master and we love him! Sit at the sushi bar and he will make you something custom based on what you like or dislike. He is incredible!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"L-lV_kfVkupUom8k6DbqCw","user_id":"TjBK0uMx9c2qEiDmDdDPsQ","business_id":"cHdJXLlKNWixBXpDwEGb_A","stars":5,"date":"2016-02-27","text":"Their black beans are to die for! I could live off of them. I recommend just getting take out because the seating area isn't the greatest. It is cafeteria style.","useful":0,"funny":0,"cool":0},
{"review_id":"sArWqzoR03SBz1OGfa6RaA","user_id":"AmgTNaSHCZy8dlqDsobKOg","business_id":"mUVAMNN7BCQ9HGA9w_7C1g","stars":5,"date":"2014-02-24","text":"Love the atmosphere here! Shattered chips are delicious, we took our leftovers of them home and added buffalo sauce and they were even better! The chef came outside and asked how our meal was and the manager also stopped by. You never see this at smaller restaurants so that was a great perk! WE had the Paris Texas Burger and the chicken sandwich, both amazing! Would recommend to everyone!","useful":0,"funny":0,"cool":0},
{"review_id":"PghtfKDZVlhFlQvnjmBWzQ","user_id":"AmgTNaSHCZy8dlqDsobKOg","business_id":"D3dAx-QW_uuClz4MambeHA","stars":5,"date":"2015-07-22","text":"Can't say enough good things about this place...food is fabulous, staff is fabulous! I can't get enough of their peanut butter cookies and Thai chicken salad...yum!!!","useful":0,"funny":0,"cool":1},
{"review_id":"gplIFzWFOh1SZQiDDXectQ","user_id":"AmgTNaSHCZy8dlqDsobKOg","business_id":"Ap17p-tA4Ipzy1s35DfCfg","stars":5,"date":"2015-10-17","text":"Had dinner there last night and everything was spectacular. The ambiance and architecture of the restaurant is super hip. Looking forward to sitting on the patio too. Our server Joy was very helpful and knowledgeable about the menu and helped us pair our drinks with the food we ordered. We had some oysters, the Avocado salad, Salmon and the Radio Milano pasta dish and it all tasted delicious. Their cocktail list is really inventive and yummy! This is definitely going to be the new hot spot in Arcadia!!! Can't wait to go back and try more of the food and drinks!","useful":5,"funny":0,"cool":3},
{"review_id":"cFh79ovm4gnQ7ulWMKRMYg","user_id":"AmgTNaSHCZy8dlqDsobKOg","business_id":"9a3DrZvpYxVs3k_qwlCNSw","stars":1,"date":"2014-10-30","text":"We have visited this place multiple times over the past few years and when I found out they had a private room for me and my guests I was so excited! At first they were very accommodating, they let us see the room and discuss how we were going to set it up for our party and went over the menu's with us. It came as a big surprise to me when we showed up and had to wait over an hour and a half for our first course to come out! Everything just went downhill from there. We complained to our server multiple times (we had 1 server for a party of 40) that the room was extra hot and there was nothing done about it. I had about 10 guests having to get up to try and cool down outside, fanning themselves and sweating throughout the dinner. Then when half of our guests left I realized they never sent out dessert and we had to ask for it! I was then told we should have requested dessert to come out, what kind of restaurant waits 45 minutes to bring dessert after a meal is finished?\n\nMy BIGGEST disappointment was how the catering manager, Michelle, handled everything after I sent her an email. I understand that she is the owner's wife but I've had teenagers talk to me nicer than she did. She was brash and offensive. Not only did she not take blame for anything she blamed our party for all of the issues. You can count on the fact that I will NEVER recommend this place to anyone and will have negative things to say when asked; which is unfortunate because I work downtown and a lot of people always ask me for recommendations. I sure hope the lack of customer service turns people off from dining here, you are better off going to Cheesecake Factory!","useful":1,"funny":0,"cool":0},
{"review_id":"CNpQ9A9peEdVkhwzEghdjw","user_id":"-BNGmuN2OwtswhazjPXmTw","business_id":"JEQaPs7jNT1M2os9lJDlUA","stars":5,"date":"2014-07-29","text":"We tried the Coronado Cafe last night, and it exceeded our expectations.  The ambience was lovely, service excellent, and the food was fabulous.  Their meatloaf (this is NOT your mother's meatloaf) has to be the best on the planet.  We will definitely return.","useful":0,"funny":0,"cool":0},
{"review_id":"41T5LjDnNe_M6ANOgmD_Xg","user_id":"Lj4RyhGENeqqyt5tuYFxQA","business_id":"okgI89cCzqz-M_TUPCeBew","stars":5,"date":"2016-09-01","text":"They responded to my inquiry promptly and were friendly and accommodating. Excellent service. Brittany was great and did her utmost to find a time for my wife to be tattooed by Sausage. While that sentence out of context sounds odd, we are looking forward to it in the future, but maybe in 2018.","useful":0,"funny":0,"cool":0},
{"review_id":"AN7nMubhX-Zv0CeUb5Qm-A","user_id":"1cd1TjQEynOjhBT-3Qnsjg","business_id":"-3zffZUHoY8bQjGfPSoBKQ","stars":5,"date":"2011-07-13","text":"While it's been nearly a year since I had a fabulous dinner at Michael Mina, I still think about the amazing meal I had.\n\nIt was my first trip to Las Vegas and my boyfriend wanted to impress. By taking me here, he definitely did as well as enjoyed the food himself.\n\nWe were recommended to try the Chef's menu and also followed it with the wine pairings. We both enjoyed the Ahi tuna tartar, LOVED the lobster pot pie, which got the pie to innards content right (I like a little breadness with each bite), and both of us were in awe of the Kobe with sear foie on top. I don't know if they still do that, but both of us just melted a little inside with each bit. It's in our top 2 of steaks...and trust me, we eat a lot of steak. I don't even remember the dessert, that's how mind blowing the steak was. I'm sure it was tasty and delightful because my dinner at Michael Mina was nothing but excellent.\n\nService was impeccable, and they dealt well with my constant requests for their delicious bread. The wine pairings were done well, but I was happy I was staying in the Bellagio after dinner because that was a significant amount of alcohol in one sitting. The atmosphere was elegant without pretension or \"over-styling.\" Probably the most comfortable restaurant I went to in Vegas. Most people were well dressed (i.e. slacks and dresses) but no need for anything over the top. I wore a little black dress and my boyfriend wore a nice sports coat with dark slacks. While we were probably the youngest ones there, the servers didn't treat us like we didn't belong there, which sometimes happens in upscale restaurants. Big plus for that.\n\nI'd love to go back, but this time, I'd probably order something different just so I could try other things...but I'd get the Kobe again. For sure.\n\nIt's worth the pennies to go, and try the chef's menu!","useful":0,"funny":0,"cool":0},
{"review_id":"0T4wp2BcFUJXPtMPhXLBOQ","user_id":"1cd1TjQEynOjhBT-3Qnsjg","business_id":"7fxebHYUwIF6CakxSr70iQ","stars":3,"date":"2011-07-13","text":"Carnevino is definitely a meat-lovers joy - but maybe a little over-priced for what you get.\n\nMy boyfriend is a carnivore and steak-addict, to the point where his friends recommended he come here.\n\nWe started with the Beef Tasting Menu, and while the crudo was well done, my issue was so many places seem to do a raw Kobe appetizer. Something a little more creative (with same meat!) would have been lovely. I will say I really loved the beef-cheek ravioli - I stole my boyfriends because I felt my portion needed to have more in it. Personally, the wet and dry aged beef were good and \"beefy and meaty,\" but my preferences run towards melty and buttery type of steak. I preferred the dry aged to the wet...the wet aged just seemed a little bland in comparison. \n\nWe veered off course a bit - my boyfriend wanted MORE meat and we ordered the dry-aged bone in Rib-Eye for 2. I didn't eat much as my boyfriend devoured it, but the meat was flavorful for sure...just not my style. Ending with the tasting menu desert, which I can't remember because it was so generic. I think creativity could have been a lot better.\n\nService was good and they helped us find wines to pair with our dinner well. Our server was so excited we wanted more steak - but maybe he just wanted the bigger tip resulting from the massive bill? The worst part of the meal was being seated in an area that looked out onto the casino\/hotel walkway. I prefer people not staring at me or my meals when I eat. \n\nLastly, the price. While the cuts of meat were good, I just don't feel the costs justified what was done in the meal. The creativity was lacking and maybe it's because it's such a meat-BASED restaurant...but I feel like it could have been more creative. \n\nIf you liked dry-aged steak and big, bold Italian reds, this is the place for your. But I prefer my steak to melt like butter in my mouth and this isn't the place for it. I will tell you my boyfriend enjoyed it far more than I did. Otherwise, maybe try another, more diverse restaurant in the Palazzo\/Venetian Restaurant row.","useful":4,"funny":1,"cool":1},
{"review_id":"VWL34PtdPAIeB8LmwJ3r9w","user_id":"1cd1TjQEynOjhBT-3Qnsjg","business_id":"J4CATH00YZrq8Bne2S4_cw","stars":4,"date":"2011-07-12","text":"Amazing steak and other food, but be prepared for a slight bit of wallet shock.\n\nI made reservations at CUT back in May while visiting LV, but due to an unfortunate bout of illness (DO NOT EAT DUCK FRIED RICE FROM THE BELLAGIO POKER ROOM)  that required hospitalization, I was forced to give my reservations to my friends. The next day, visiting me in the hospital, they raved about the quality of the steaks, being from overseas. I knew that next time I was in Las Vegas, I would need to go.\n\nWhat luck that several weeks later my boyfriend did extremely well in a WSOP event, and we returned to Las Vegas and made another reservation at CUT for mid June.\n\nWe were seated a booth with a leather tables and service was quick and prompt. We knew we wanted steak, but my boyfriend and I have very different tastes in wine, so the sommelier came over to help us with the (very) awkward iPad wine list. She helped us pick just the right wine that met our desires. \n\nAfter ordering our wine, we got down to business. For appetizers, we had the Kobe sashimi and the Roasted Beets with goat cheese. They actually balanced quite nicely, as we knew we had a lot of meat ahead of us. \n\nFor our main courses, I chose the American Wagyu filet, normally 6 oz, and added an extra 2 oz for extra. I love Kobe filet for it's melting butter like quality, and this cut was no exception. It was cooked perfectly (medium rare) and it was the quality and taste I would expect for a $130 steak. My boyfriend chose the New York Sirloin tasting that consisted of the dry aged American sirloin, American Wagyu, and NZ Wagyu. He ordered it rare and it came slightly over rare (which is acceptable, because these cuts were THICK) and they were epic. Just meaty and buttery at the same time. My steak-loving boyfriend was in heaven. \n\nFor sides, we had the mac & cheese, and spring peas with bacon. To be honest, we didn't eat much of those as we focused primarily on the steak, but both were good - also rich and bacony! \n\nAfter some excessive meat consumption, I saw a souffle float by to another table. I had to dig deep down, but I never regretted the chocolate souffle. It was rich but airy at the same time. I didn't even look at the other desserts, but it was one of the best I've had. The small little cookies and tarts were a nice little treat we had wrapped up to-go that went nicely with our coffee for breakfast the next morning.\n\nThe service was extremely attentive and water refills\/bread requests came quickly and discretely. (Yes, the bread was that good too). My one disappointment is the overall atmosphere. The overly slick design and mirrors everywhere made me feel like I was in an HGTV show instead of a restaurant.  When I think steakhouse, I think a little more comfortable and a little less \"sleek.\" That said, I also deplored the amount of  people taking pictures...man people, don't use flash in a restaurant, I like to eat my food without blinding. If you're so consumed by where you are, please avoid me at all costs.\n\nOverall, I recommend CUT if you have money to splurge but you'll be sure to enjoy your meal.","useful":0,"funny":0,"cool":0},
{"review_id":"g657l_BmTVOwkE2QXFs66A","user_id":"1cd1TjQEynOjhBT-3Qnsjg","business_id":"-sAr-LA9TsIdl37UjwBlvg","stars":4,"date":"2014-01-16","text":"Great hotel with fabulous services and restaurant - just what Phoenix needs!\n\nWe stayed here for a few days after trying to find a place to stay in Phoenix that WASN'T a chain or a massive resort for a decent price and were very pleased to find the Clarendon Hotel.\n\nThe room we stayed in was CLEAN, large and comfortable, and the bed was fantastic. The Keurig in the room was a great plus along with the provided robes. My only complaint about the room was the tiiiiiiny bathroom. However, the great pool and hot-tub in the main courtyard really made the stay even better and we enjoyed chatting with other guests while enjoying a cocktail or beer from Gallo Blanco (which incidentally, is also fantastic!).\n\nMy biggest issue was the \"resort fee.\" I really deplore the addition of the resort fee tacked on after you check in - PLEASE just include this in the regular price of a room when you check in...but also, this isn't reaaaaaaally a resort, so why such an outrageous \"resort fee?\" Still, fee and all, the Clarendon Hotel is worth it, and provided us with a great place to stay in Phoenix.","useful":0,"funny":0,"cool":0},
{"review_id":"Q6RiVtAINLhMIE-7wRST4w","user_id":"Te1y5afUMwaTe62ZiB8Igg","business_id":"TCWMgOiV0PxQkWE1SyBIWQ","stars":3,"date":"2011-05-19","text":"This was the place I was most looking forward to eating at in Vegas. I'm sad to say I was disappointed. \n\nThe food was amazing, but the atomosphere and service were way below the the prices they charge. It felt like a cheap club with fantastic food. Very disconnected. Our server was condecending. She seemed annoyed we didn't order \"enough\" (she'd recommended 2-3 cold dishes, 2-3 hot dishes, and 2 sushi rolls) but that was our choice. We'd had a late lunch. \n\nIf you just want good food, I'd recommend saving your money and going elsewhere. If you're a 20 or 30-something and want a party atmosphere and don't care about the bill, this could be fun for you.","useful":2,"funny":0,"cool":0},
{"review_id":"KYZjc6reW1sHm38753ZpQA","user_id":"Te1y5afUMwaTe62ZiB8Igg","business_id":"xkVMIk_Vqh17f48ZQ_6b0w","stars":5,"date":"2011-05-19","text":"I had high hopes for Craftsteak, and it definitely delivered. Fantastic food in a classy yet unpretentious environment, and amazing service. \n\nSome notes: \n-We ordered the cheaper steaks on the menu, and they were AMAZING. Melt in your mouth. Hard to imagine how good the Waygu and other pricey ones would be. But don't feel like you'll be shortchanged by ordering the cheaper ones. \n-Don't skip salads. The fava bean salad was the best thing I ate. Who knew a salad could be so good. \n-Sit at the bar before dinner if you have time. Our reservation was running a bit late, so we had a drink. The bartenders make the most delicious, strong drinks. \n\nIf you love steak and want a classy dinner in Vegas, go here! You won't be disappointed.","useful":1,"funny":0,"cool":1},
{"review_id":"h9y-jgYduS-bffPLxZdLnA","user_id":"Te1y5afUMwaTe62ZiB8Igg","business_id":"GJ_bXUPv672YwNg4TneJog","stars":5,"date":"2011-05-19","text":"Ate at China Poblano when I was in Vegas last week and hadn't looked at any Yelp reviews prior. I'm surprised to find it only has 3 stars on here. I thought it was AMAZING. Most importanly, it was priced appropriately, unlike so many places in Vegas.\n\nSome notes:\n\n-The atmosphere was fun (decor is amazing!)\n-Service was great\n-Food was creative and delicious\n-A few dishes were a miss (a noodle soup with the word \"ugly\" in the name), but most were spot on. \n-Mexican food was slightly better than the Chinese, but that makes sense given Jose's backgound. \n-The salt-air margaritas are genius.","useful":0,"funny":0,"cool":0},
{"review_id":"wpIcWB-OJ-p_WXq0o3f3BA","user_id":"6T_eQVaDFL4TqdLNQZL1wQ","business_id":"P9pBzaqo9m6QIhlRRSqoMA","stars":1,"date":"2014-04-01","text":"Worst chiropractor ever I have a pending lawsuit for an injury that was aggravated by this man. Please see your regular doctor to avoid injury from this fraudulent man.","useful":0,"funny":2,"cool":0},
{"review_id":"a5ol67pRj7r0ChwImRtmhA","user_id":"eHgBIO0ZHX_gXZV-rPJLMA","business_id":"i8G0Zh_yUb8zj7CG_Op63w","stars":2,"date":"2017-06-15","text":"My boyfriend & I went to Jozo yesterday after the gym and thought to check this place out since we've been seeing a lot of hype. The place is nice and quiet. Menu has a good variety of options from boba to coffee to smoothies. \n\nWe ordered two drinks which was the Classic Taiwanese Milk Tea and the Signature Thai Tea. Milk tea was alright, it wasn't as sweet nor milky as most boba places. Thai tea was just like your regular Thai tea that you get at restaurants. And the boba was unusually smaller than your regular boba which was surprising coming from a boba place.\n\nWhat was really disappointing was the amount of ice that was in the drink! My boyfriend and I took two sips of the milk tea to try the flavor and noticed that the cup was pretty much ice! The 12oz cup (not even the bottle) was filled with 2\/3 ice & 1\/3 tea. I know it's being nit picky but I feel like I got gypped paying $4.50. Mind you, they were out of their cool bottles which comes standard with their drinks and still payed for the same price for a plain regular plastic cup - no name or anything. \n\nOverall, I think Jozo is jumping in with the trend of hipster branding but is lacking quality on the flavor. Wish I had a better experience!","useful":6,"funny":0,"cool":0},
{"review_id":"GfdKfG40XkD5nyzQXLY_LA","user_id":"oaWZttKGDP9cvlawarF0Ww","business_id":"T4xwy5NVY__Emc0UHdlACA","stars":5,"date":"2016-04-10","text":"This family owned gym is a wonderful part of the community and its owners are salt of the earth. Joe Karstadt promotes good citizenship and respectful competitiveness in his students. I recommend JSK to students young and old.","useful":2,"funny":0,"cool":1},
{"review_id":"W84zEK5imj5Eb-kfxrHrMA","user_id":"oaWZttKGDP9cvlawarF0Ww","business_id":"d67gEYHd6c9-8KhSDhAm0g","stars":5,"date":"2017-01-15","text":"This is the second time I've come to Just Brakes for an oil change. Fast professional service. Very pleased.","useful":0,"funny":0,"cool":0},
{"review_id":"BSJW4VValeqp0KiedleHzA","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"YO8sWa0wYChH6DQWnE6NFg","stars":4,"date":"2011-09-05","text":"You're not gonna find a much better breakfast in this city ... or anywhere really. Breakfast is breakfast, but they do it right and its delicious every time.\n\nGet the lyonnaise potatoes with your meal. They're delicious. My personal favorite is the Tex Mex omelette. Guacamole at breakfast time never fails.\n\nThe boardgames on the walls are cute too. :)","useful":0,"funny":0,"cool":0},
{"review_id":"3ElX230d6vyueqgvOIP47Q","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"iKG3BfTNOg4xy-agnV-eaA","stars":2,"date":"2012-08-13","text":"Although the staff are very nice and the facility can accomodate a lot of people at once (ease of appointment times), I must say I was not thrilled by this place. The physical therapists are helpful, but compared to other places, are not attentive enough because they are often seeing many patients at once. I thought the service was very good until I visited other physical therapists that give much more one-on-one time and assess your progress much more closely.\n\nExample: I was often left to do my stretches with the therapists mostly coming back to give me something else to do. Besides asking how I felt from time to time, they did not reassess my abilities to walk or stretch as other therapists have. How do they know what is working if they don't assess your progress?","useful":8,"funny":0,"cool":1},
{"review_id":"Oe1DjRsXAU-y67ZdWTU9Mg","user_id":"djSJ6a9gsLSdj-7BoyNNQA","business_id":"Fpm3WvqtrAg2ueh_4pz7iA","stars":4,"date":"2011-08-02","text":"I have both eaten in and taken out with a positive experience. \n\nFrom walking by, it doesn't look like the greatest place, but they have an interesting menu with different asian\/asian fusion dishes so there's a little bit for everyone from the exotic to the simple.\n\nThe Malaysian Sate, which I had with beef, was delicious and came in a more than adequately sized portion. The Pad Thai is also a delicious meal. All of the appetizers and other dishes I tried were more than satisfactory. \n\nFor a student on a budget, this place is both delicious and relatively inexpensive. I would recommend it to anyone who likes interesting tastes of Asia.","useful":2,"funny":0,"cool":0}]