[{"review_id":"w_5k_KgI6NmCeIXuPsCMDQ","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"MX5LoEtx8ljYGc8ByhE5wg","stars":4,"date":"2010-08-04","text":"Only went there once, but I really thought the large servings of fish and chips and chicken tenders were *excellent.*  They were hearty and tasted great-- with excellent ratio of breading to chicken\/fish.  The clothes they made the women wear were a bit suspect, almost Hooter-ish.  Nevertheless, check out the chicken strips.","useful":0,"funny":0,"cool":0},
{"review_id":"WVfZYU5Z7UL8p7AKyzIUIw","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"L8F6AZVC2JNuYJjB-DnEqA","stars":5,"date":"2011-01-07","text":"Here's the deal: You get the resources of a major university, the coziness of a small liberal arts college, and great weather\/atmosphere, with SUPER profs.  It beats Tempe everyday.","useful":8,"funny":0,"cool":1},
{"review_id":"dURjOtFlcVUYM_IpxDCHdg","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"G8vA6pq4p8KslaURm-q65Q","stars":5,"date":"2011-01-15","text":"This place's Pastrami is as amazing as anything in NYC.  The canoli was also loved my girlfriend.","useful":0,"funny":0,"cool":0},
{"review_id":"cScw7GVfx3qFg7ge10CJSQ","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"Mh2syFX0bG-7vylKY9DE4g","stars":4,"date":"2010-08-04","text":"Gotta be a stoner man who loves Cheech and Chong to really appreciate the atmosphere, but if you like toasty subs with a great flavor, awesome iced tea, homemade brownies, and great mac salad, you can still show up if you're an uptight honkey.  I always find the people here super friendly, and it's funny to watch all the young punks and skateboarders stumble in and out.","useful":0,"funny":0,"cool":0},
{"review_id":"xpHL-__3sm9f6MP2AC5xVw","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"KMxOoHyRKP74PgosuRkkdg","stars":5,"date":"2017-06-12","text":"This place is a little glitzy for a taco joint but the ribeye tacos are out of the world great.  Would eat them everyday if I had a choice.","useful":0,"funny":0,"cool":0},
{"review_id":"z0Qc99qAEkHXvh44-JhCGA","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"Gq3OgSd5KflKuwNJmuWt7Q","stars":1,"date":"2011-01-07","text":"You know you're in trouble when you walk into a Mexican restaurant and there's ketchup on the table rather than hot sauce.  We went for some food at this lame ass joint (my gf had a gift certificate) and the place was totally empty during the lunch hour, but I admired the large screen tvs and access to nonstop ESPN in hi-def if you like that sort of thing.  But then it all went downhill.  The seats were uncomfortable.  The staff seemed confused by everything.  The food was abysmal.  If we could give less than one star, we would!\n\nLet me describe in more detail: literally every bite of food was sub-par, and we ordered four courses.  The fancy quesadilla was literally a big basic tortilla with pre-shredded American cheese.  I could have done better at home easily.  The \"burro\" had some major problems--chewy meat, crispy tortilla in the wrong way (dry), and beans that will immediately send you into salt overload.  The flautas were so greasy and unappetizing that we just said no.  I've never seen her send food back in my life.  Dessert was lame.\n\nAvoid this place at ALL cost. . Seriously Taco Bell will do you better.  Go to a real Mexican joint and boycott this monstrosity of \"Mexican\" food.","useful":3,"funny":1,"cool":0},
{"review_id":"nWFdTTAdEqSJ8JoRmN3cTQ","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"eSENXDnnNSo-MLLkWJQ8Vg","stars":5,"date":"2014-09-21","text":"Yes. Yes. Yes.  Anybody who does not give this restaurant a 5 is a food critic who's just trying to take down one of the best taco shops in America!  We were so excited when this place moved over to the west side closer to our house.  Try to quesadillas and the horchata.","useful":1,"funny":0,"cool":1},
{"review_id":"MKIURzlMnKxA189KJsuOWw","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"xlz4aHKAPT_jHMIUpxXmUg","stars":5,"date":"2014-09-21","text":"We love this place so much that we used them as our wedding cake, and it was a HUGE hit.  People kept asking us where we got the \"specially made tiny bundt cakes\" and we just smiled knowingly.  They were easy to work with (and even the catering staff gobbled up loads of them during the party).  Hit this place up.  You will be SO glad you did.","useful":1,"funny":0,"cool":1},
{"review_id":"iZDSJh6E3bWI0Px3A_VpJg","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"a8sW8A49tyY0bzvN0b6bgw","stars":4,"date":"2010-08-04","text":"With a name like Earls, you'd expect some greasy diner, but instead you get a somewhat upscale restaurant with an eclectic list of meal options.  Although the place is fairly pricey, the food is awesome.  We tried the shrimp rolls with the crunchy center (excellent), the cajun chicken (which reminded me of the Louisiana that I just visited), and the creme brulee (a don't miss, with its real vanilla beans--which drives my gf wild).  The service is friendly and they'll good care of you.","useful":1,"funny":0,"cool":0},
{"review_id":"ITRAfJBOlnxOZnNA6f5IpA","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"YGaowC1J4GfkQYyYLYWnQQ","stars":4,"date":"2009-06-20","text":"After a long day in Tempe, I luckily found this place in my Entertainment Book (coupon book) so we thought we'd give it a shot.  When we walked inside, they asked us if we were there for the dancing or the food--they were having salsa classes!  We said the food and I'm glad we did because it was excellent Mexican food.  The fajitas were marinated in lime and the carne asada was also generous.  The beans were excellent, as were the tortillas.  Give this place a try.","useful":0,"funny":1,"cool":0},
{"review_id":"PChENRxr8qjIn3YbupiLMQ","user_id":"8Rze3PzRB8zummKDqDky8A","business_id":"FwuSvfRx_xkWV61VnCy9ug","stars":4,"date":"2010-08-04","text":"When driving up off of Glendale Ave, you get to see very lively but campy murals and 3 massive parking lots before you enter the back door (the main entrance-don't try the door at the front or you'll never get in).  The food is just like you'd want from a traditional, homestyle, local, family owned joint-- excellent rice and beans (all homemade), great enchilada and tamale sauces, excellent tortillas, fresh chips and sweet tomato salsa.  The prices were excellent-- lunch specials for 5 bucks, dinner platters for 1-2 people 9.50.  Give this place a try.  It's a real down home place.","useful":0,"funny":1,"cool":0},
{"review_id":"S2ei-XTTS5G7nsVrTQxp9g","user_id":"LOrhiD8zEpIWDMJMbR5riw","business_id":"rEpwjEw_aV978Iz2wYCiHA","stars":5,"date":"2017-08-22","text":"I can't say more about the customer service and kindness from staff here. I purchased a significant amount of gear from this location with both a trade in Mac book pro and upgraded ram on my existing iMac. The staff were helpful, knowledgeable and turned my equipment around quickly and professionally saving me valuable time. I returned today, months later with a faulty charger and they honored their new one year warranty with a new charger for free. Forget the 15 minute rushed Genius Bar at the overcrowded apple stores and come here. It's worth your time and money.","useful":0,"funny":0,"cool":0},
{"review_id":"tpdPwAiRvu0NXf37xhgHUw","user_id":"LOrhiD8zEpIWDMJMbR5riw","business_id":"0odAupWjDV8gwhaLqyh1-A","stars":1,"date":"2016-01-17","text":"After waiting 25 minutes in line and watching over 10 people turn away, the final arrival to the counter to see the food or lack there of was not only a let down but disgusting. The food was run low, meats were empty or dried to bottom of bins, and there was no salsa, chips, or guacamole. We were instructed that we would need to wait five minutes for the new freshly baked chips which actually took 20 minutes. A total of 40 minutes up to this point and we are still waiting for the manager to speak with us. Avoid this location at all costs if you're looking for a fresh meal and competent service from staff or management.","useful":1,"funny":1,"cool":1},
{"review_id":"1Jm57WDlqlRGObSDb8wLMQ","user_id":"LOrhiD8zEpIWDMJMbR5riw","business_id":"XuSMd5XwU8w54s2D5Z7pMw","stars":5,"date":"2016-08-24","text":"Finding an honest, knowledgable and friendly mechanic can often be difficult in any city, however Scott Johnson at Johnson Automotive is truly one of the best in the country and we are lucky to have him here in Vegas. I grew up in a family that owned a car restoration business and understand the dynamic between people and their cars and the folks they trust to work on them. \n\nScott and his team don't just plug your car into a computer and hope for the best, they take the time to diagnose, investigate and methodically find the problem and fix it. I have two German sports cars and Scott is the only one who touches them for basic service or more significant problems. \n\nScott's passion is cars. His attention to detail and love for what he does insures that no car leaves without being done right.","useful":0,"funny":0,"cool":2},
{"review_id":"X2PdT71cQZh_jKrU3nO2Dg","user_id":"LOrhiD8zEpIWDMJMbR5riw","business_id":"IrHAhdmL9QH9g3NscAIsWA","stars":2,"date":"2016-04-16","text":"I have had the opportunity to stay at a few Omni properties around the world and this hotel in Charlotte is worn and truly subpar in both service and physical condition. The rooms are tired and outdated, not particularly clean and bathroom show signs of mildew, cracking in paint and tub caulking. During my 4 night stay I was surprised to see room service trays left out almost all day smelling up the halls. I had an urgent package sent overnight and the front desk never notified me of its arrival. It wasn't until the night of check in that they happened to notice it in the back under my name. This hotels location is ideal for central uptown CLT activities but it's in desperate need of renovation and front desk training.","useful":0,"funny":0,"cool":0},
{"review_id":"MiYiTnfW9Y1fB16zzSQibA","user_id":"LOrhiD8zEpIWDMJMbR5riw","business_id":"q2GzUNQj998GSC8IhkN9hg","stars":5,"date":"2017-10-03","text":"What a great find! This cute fast casual restaurant is a healthy alternative and welcomed here to our community. Informative staff and tasty food make for a great choice up in this neck of the woods. Try the spicy humans or the classic Baba G (eggplant) base in either a wrap or a bowl. The lamb is flavorful and fresh veggies are fantastic. We will be back soon.","useful":0,"funny":0,"cool":0},
{"review_id":"EywNvT_am0lMOo72-Pb8KQ","user_id":"2GYxM85tRiCxfbKgZKjZng","business_id":"0EUohlWGBPnIgzCULyWl7g","stars":1,"date":"2011-04-06","text":"Can I press zero stars on here?\nDon't go there, its not worth it !!!!! They make you stand  in the line for ever. However, when you get inside  there's no one in the club...  \nThe dance floor is really  tiny. The drinks are too expensive.  The bouncers are very rude and extremely anal about everything. I mean \"get over yourselves!\"  They treat their customers as if they were in jail .... Don't stand here! .... Don't dance here! .....  \nThey are particularly obsessed about the bathroom.  They have strict rules about where their customers should  stand to wait in line and which bathroom unisex stall they should use. Especially the bouncer whose eyes were popping out of his head.  I guess he really wants  to advance to a  bathroom manager.","useful":4,"funny":4,"cool":3},
{"review_id":"n7xf-zgvaSphO088iNshqQ","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"iXbjlUTqxlurMNAy58lYnQ","stars":5,"date":"2016-08-14","text":"This movie theater is the best for a matinee showing. $5, it's never crowded so you Can get a good seat, the sound quality is great, the seats are comfortable and the snacks aren't super overpriced! This is definitely mine and the wife's go to for a Sunday afternoon movie date.","useful":0,"funny":0,"cool":0},
{"review_id":"ba2DebWBrKWI-2sLD_XA7A","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"BToSTEiaK94G3h5_XROEcA","stars":5,"date":"2017-02-25","text":"This is my favorite Mexican restaurant! The staff are amazing, they are so nice and attentive; the food is delicious, their super nachos (vegetarian style) are the best!!; and their drinks are strong and amazing. This is mine and the wife's go to restaurant when we want to stay local. They also have Mariachi Band Friday's and Salsa Saturday's!","useful":0,"funny":0,"cool":0},
{"review_id":"-XLTtrIKT3jzPo3DCpokKQ","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"qnCvznXnG_9zOs4xr7nHFw","stars":5,"date":"2016-08-13","text":"This place is great! The bartenders are awesome, the locals are nice and the beer selection on tap is enormous! And bonus, they have my all time favorite beer!!  I will definitely be coming back here as soon as my favorite beer is on tap vs. in the bottle in the coming weeks! Can't wait!!  I definitely recommend coming here for a chill afternoon or evening and a game of corn hole.","useful":0,"funny":0,"cool":0},
{"review_id":"BZkqKjFdBnKK2H25YZDTWg","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"MQEpDvkdL39hh1N0We3Vaw","stars":5,"date":"2016-09-15","text":"Taco Tuesday's are amazing! $2 tacos and margaritas! It's really unbeatable. The tacos are delicious, the margaritas are good (if there's too much mixer, they will make it stronger) and the staff are great! It does get VERY busy! We had to wait over an hour to get seated for a group of 6 when we went on 9\/13. But you can get drinks from the bar and take them outside, so that made the time pass a little faster.  I definitely recommend Hot Taco for Taco Tuesday!","useful":0,"funny":0,"cool":0},
{"review_id":"9sl6NiNDgAB6rTRqLPfBoA","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"vLJvRGuZ8BMSL9o5xOTlvg","stars":5,"date":"2016-09-03","text":"Love this place and so does our dog! The bartenders are great, live music, Trivia, karaoke, and good beer selection.","useful":1,"funny":0,"cool":3},
{"review_id":"Rg-lyFHL00clnjvOKzz2Xg","user_id":"7sE_NMhHfDp2KDLLLIR-lA","business_id":"s8OLoPfOpB0FbK5frI3CkQ","stars":2,"date":"2016-09-15","text":"I was pretty disappointed with the Peculiar Rabbit. I can definitely say that I will not be back. The food was decent, the drinks were ok--over priced, the staff were nice enough, but the wait!! We went for brunch with a group of 10 and we had to wait close to 1.5-2 hours for our food to come out after ordering--no they were not busy. Then to top it, they brought 2 orders out 45minutes before they brought the rest of the food out. It was a mess to say the least. They were pretty responsive to our complaint of the food taking so long and them bringing out 2 orders WAY before the others by comping us 3 desserts, which we shared between all of us, and comping us one of the orders that came out early.","useful":0,"funny":0,"cool":0},
{"review_id":"XSztnN9k_iqAfVRz3Zdkdg","user_id":"ddgqkQFYSkt7EBYERqRCrg","business_id":"3g8zzg_5__kXMUM-8F6V1w","stars":1,"date":"2007-05-08","text":"One of the highlights of the bachelor party that I organized was meant to be a VIP table at the PlayBoy Club.  Despite the emailed confirmation from Jillian Parrish at the hotel, $1200 hold on a credit card and assurances that the Palms would charge us if we did not turn up,  they did not actually HAVE a table for us when we arrived.  The door staff were rude and were more interested in looking cool than actually helping customers with legitimate beefs.  Our door guy Jevan, was focused on finding pretty girls and giving them access rather than getting our VIP table sorted.   He finally consented to let us in with no charge - VERY generous considering the Palms almost ruined the bachelor party highlight. no apology for the f*ck up, let alone a free drink was offered.  I was simply told that I was the fourth VIP table that they'd been unable to accommodate so far that night.   Do not bother.  Try Pure instead...or if you are at a bachelor party  - head over to Sapphires.","useful":3,"funny":0,"cool":0},
{"review_id":"aOD0q4DX_V74UzN3GKAerA","user_id":"kE-kwkJkIY72LrVhjcLbFw","business_id":"O-uIEuv7JLUHajkemx_sVw","stars":4,"date":"2016-06-29","text":"An upscale yet casual and chill bar with a fun, retro atmosphere on King St. \nOverall great food and huge selection of beers! Their beers, mussels, and Belgian frites are really popular. We loved the Spicy Beef Tacos and Belgian White Mussels. The Bistro Salad was good, nothing special. The Lamb Shortloin tasted okay and is overpriced, as there was much more of the chickpea salad than lamb pieces. \nOur server was fantastic- unfortunately I didn't catch her name :\/ She was super attentive and helpful taking our orders, recommending and offering us tasters of different draft beers.","useful":0,"funny":0,"cool":0},
{"review_id":"SrBmW7_WSRy2Xvh0-uXc2w","user_id":"qOZ7yzfMXqAsfXyu_DcvCw","business_id":"_dPqk61nObB0HQ8GFkWv9Q","stars":4,"date":"2017-07-26","text":"We moved to Fort Mill not long ago and really like Fort Mill Prep. We were attracted to their natural playground and farm animals, and like the staff.","useful":0,"funny":0,"cool":0},
{"review_id":"FQMGZUzx_3Z_GeYEpowgxQ","user_id":"6qquS9PvBHYkpLlfK4RUCA","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":1,"date":"2017-06-15","text":"I am a big Triple D fan and was excited to try Guy's restaurant while visiting in Las Vegas.  My wife ordered the brisket nachos and I ordered the French Dip.  \nThe nachos were made with processed cheese out of a can, not even fresh shredded cheddar.  They were heated just warm canned cheese which made the nachos soggy.  I could get better at 7-11.  Such a disappointment.\nMy french dip was very large and looked good but the cut of meat was very poor and chewy.  Not like a prime rib dip.  Another disappointment.\nI had such high expectations but now I realize he has never visited his restaurant but always somebody other than his.  I was so disappointed and would say maybe the burgers were the bomb but not what we ordered.  \nWe won't be going back.","useful":0,"funny":0,"cool":0},
{"review_id":"ifUWuCb2QaYeO3tGqu5iGA","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"eaiv4-X0JhNGP_2UmFmhGw","stars":1,"date":"2017-04-07","text":"Got the chicken cutlet wanted curry sauce nope I got a salty thick gravy .... Cutlet was so over cook the meat looked plastic. Threw it away after 3 bites. Waste of money & time","useful":0,"funny":0,"cool":0},
{"review_id":"2h3crOlPtiB51Bk1IhuUSQ","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"R0ukZ5FgY_2Pn96Go5mftA","stars":1,"date":"2015-12-30","text":"Worst service ever from Little girls at the register, I don't know how they got that job or any job.. because they have no customer service experience seems like. Just talking and hanging out. If your ordering out They don't care if your food has been done they won't tell you. You have to go get it, but they will cater to the young men and give them their food. Doesn't even deserve 1 star","useful":0,"funny":0,"cool":0},
{"review_id":"58IE0-Vtm9G2K46jP6wxkQ","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"zXR-C_clfbCksI0cIDrl4g","stars":1,"date":"2014-10-26","text":"Gross!!!!! Not even worth 1 star.. horrible.. taste- bland really really bland my kids didnt even like it & they love Chinese food.. disgraced their culture(&im part Chinese, i eat A LOT of Chinese food) they should do everyone a favor & close it Eewwwww!!!! They are still open because Southern Highlands has very limited asian cuisine. GROSS!! WASTE OF MONEY.. people that like this & gave them more then 1 star has NO taste buds. Matter of fact hasn't has REAL Chinese food.. China a go go has to really GO GO GET OUTTA HERE! GROSS CHEF'S SHOULD BE FIRED. DISGRACE EWWW","useful":2,"funny":2,"cool":1},
{"review_id":"gDcvAvNzXhFyRWxQsSFNkg","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"uGvf-Hfrgz0jPa8JX5pZVQ","stars":1,"date":"2017-05-19","text":"Probably the worst Sallys to go to. I've been in the retail industry for 15years, licensed cosmetologist, even worked for Sallys for 4 years. So I know how everything goes, very basic. I go here for last min basic items. hands down the worst service here everytime I go, I let it go all the time, I am always charged extra.  Make sure to check your receipts before you leave! especially when they run a buy 1 get 1 or buy 2 get 1. These workers at this location can't compute basic math..wait let me specify Dulce can't compute basic math. I was charged extra for buy 2 get 1 last time I was there I didn't get 1 free. I go in there multiple times to fix the situation & these guys do not understand they charged me extra, they couldn't even take out a calculator maybe they don't even know how to use it... her name is \"Dulce\" .... I can't...the name makes it worse, but She will argue & argue with the customer because I guess she believes she is always right & not the customer, won't even take the time to calculate on a calculator...super smart girl....not. Its Sallys .. They probably hate their life , she sure look & act that way...but she always right.. Anyway I return items ... Get this she returns it the right way buy 2 get 1 but remember i was charged for 3 she doesnt return the 3. She returns it b 2 get1  wtf I thought you had to graduate high school at least to get a job at sallys. I show her why does it look like this now? (the right way) I'm trying to show her the 2 receipts & how different they look when its suppose to be a return ...    She obviously didnt get it...once again...over it I go to another sallys location. Check the receipt & it was correct, looked way different from blue diamond location.. They need more training in here. I died laughing one day I asked a girl there what is the base of this color? It doesnt say on the box, is it on the bottle....she replies...20 volume....what? The base girl the base not what volume peroxide to use with it..","useful":0,"funny":0,"cool":0},
{"review_id":"7R2K31tIPvY6STmWYbev1w","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"mAIPUQPJiWXudRbOaBX33g","stars":1,"date":"2016-08-16","text":"You want the deal on tv? Well they don't honor that at this location & also your chicken will not be hot which means not fresh. $10 to the trash. What morons hired these morons? They need to quit & hire people that will do the job right.","useful":0,"funny":0,"cool":0},
{"review_id":"wToms23qY_ZvSMgfVnpT0g","user_id":"qjnwrcZPOIXnJWLznQkhTg","business_id":"eiTWTVThkHr-DKXxIysbgA","stars":1,"date":"2017-03-20","text":"Got the ahi tuna with shoyu sesame sauce, seaweed salad & ginger.....way too sweet for my pallet & defeated the \"healthiness\" of the bowl..hurt my stomach a little. Regret not taking that drive to poke express instead. Well at least now I know.","useful":0,"funny":1,"cool":0},
{"review_id":"GsDpdMMPt1EERzAF67PT1w","user_id":"erUHOmdVweMgZCCBmcIO2g","business_id":"oZtSUdWsbTTbxw3pql7d4w","stars":1,"date":"2014-01-03","text":"Worst Ever! Do they even want customers?? They charged me $140 for \"Premium Seats\" im in the 20sumthing row and middle seat of 3?? The charges didnt even show until they sent me my final flight plans...once it was too late to change without, surprise, another fee! I didnt even pick that and would never pay extra to sit in the middle...theres a reason those are the LAST seats to fill up everytime. Ive been trying to call and get ahold of them to make the changes for over 8hrs now and all I get is a automated attendant who after 5-6menus tells me nobody is available to help and to call back later, then it hangs up on me. Ive never had this issue with any other airlines!","useful":5,"funny":0,"cool":0},
{"review_id":"uDGVxymqrwxJ-g3Dd7MgHg","user_id":"kZcAQJJghB_aje3_Cc8dIQ","business_id":"YJ1PGq1ahDEMZY0U8sVC9g","stars":5,"date":"2017-10-15","text":"Great big thanks to our tour guide, really made the tour. The tour guide is a wealth of Vegas information that we would have never know. Saw Counts Kustoms, Vamps, Welder up, and Shelby's also stopped at the Las Vegas sign. Almost forgot we ended up at the Counts Tattoo shop at the Rio. Very cool!! Loved it all. Well worth it even though we didn't get to see any of the guys at Counts. We booked the tour since we watch the show and was hoping to meet some of them. We did get vouchers for a great lunch at Vamps and items at the  gift shop  which was very appreciated. \nShelby was a true surprise, we totally loved it and hope to visit it again when we come to Vegas and spend more time. Be sure to bring cash to tip the driver. Would be nice to get better directions to the meet up spot at the Rio but we called Annie and they helped us right away.\nDon't miss it, the best.","useful":0,"funny":0,"cool":0},
{"review_id":"-ubD_rmQAINijRT3h3eoCA","user_id":"534j6IK91B3GUWIvdwz1xg","business_id":"ktclOQRIjfn7v01NW-xM8Q","stars":5,"date":"2013-08-09","text":"I love the Pampered Pinkie, especially since  Shanna works there! I have been going to Shanna for five years and she does amazing work. She always knows what I want and what looks best. I trust her completely with my hair, she's never done wrong. She is very knowledgeable in her job, love going to her an  would never go anywhere else!! My mom also goes to her we love her. We recommend  her hands down. You will leave extremely satisfied!","useful":0,"funny":0,"cool":0},
{"review_id":"Q3EfH5IbwAqFPjF8RMBnKQ","user_id":"usDFtYLo1iyy9OooMUbbXA","business_id":"J4CATH00YZrq8Bne2S4_cw","stars":5,"date":"2011-11-18","text":"Wow! Where do I begin. I left Vegas days ago and I'm still raving about this place. The 16oz rib eye I had was the best tasting steak I have ever had in my life. it was tender and tasty, like nothing I have ever eaten before. They give you a few different sauces to try, but all you need is a little bit of sea salt and you're good to go. It doesn't come with sides, but you don't really need them. Also, the service was excellent. We had a few different people waiting on us, bring us bread and drinks. Kind of pricey, but very well worth it and a good place to take a date.","useful":0,"funny":0,"cool":0},
{"review_id":"DV0FVXzHbdEXEs53exKLRQ","user_id":"0L0GdQgBpkfEqA7T8Mr6dQ","business_id":"A7i_H252XydtrK7BUTvoog","stars":4,"date":"2014-08-11","text":"I love the food! Especially the whole fried chicken wings! Our server, Cee Cee was amazing! I ordered late but she made sure that my food came out the same time as my friends'! She was also very bubbly and very patient while waiting for me to make an order cuz there was a lot to choose from!;-) Amazing place and service!;-)","useful":0,"funny":0,"cool":0},
{"review_id":"oVgv6TpDiqhLFoCWr_U4Jw","user_id":"BMyhOciwQ0F47JzlNsrMkQ","business_id":"9Jo1pu0y2zU6ktiwQm6gNA","stars":5,"date":"2016-10-03","text":"Some of the best fish tacos you will ever have! We used to have to drive up to the  Scottsdale location so very happy they opened here!!","useful":0,"funny":0,"cool":0},
{"review_id":"cftAU0X55A0WKxpXNQT--g","user_id":"OSTKH-GK_DVsQtIAW-R9KQ","business_id":"NgQmlTGtYUQHJbzUBBHvfA","stars":5,"date":"2014-07-17","text":"Come here regularly. Chip truck quality fries throughout the day and great made-to-order hamburgers.","useful":0,"funny":0,"cool":0},
{"review_id":"5_JkUlMTsAc_d6gE9m6HOw","user_id":"CPJQFt7ktoNAMs7mBhIIxQ","business_id":"aLlREPOEtt3JzeDCagHytA","stars":1,"date":"2013-07-23","text":"Went here for my bachelor's party on 5\/31. Had a mediocre time and one of the servers got into a nasty exchange with one of my friends. My friend left and we talked to the server to make sure he was OK, all we got in return was an attitude.\n\nAnyways, left a $1400 tab and fast forward two months, I was charged for the SAME transaction AGAIN!! This is credit card fraud. I reported them to my credit card company and will retaliate with any legal means possible.","useful":3,"funny":1,"cool":0},
{"review_id":"HPDjopdSzNoWOw5Jp2KgoA","user_id":"_IVw73h5SAgENCFsAHPTlg","business_id":"QmWR-xog8pScB-MWwYEqHg","stars":5,"date":"2016-06-17","text":"Need car work done, come here ! \n\nOnce I came here to get a second opinion about my brakes , turns out the place I used to go to ( Fletcher ) had lied to me ... Advance Auto let me know there was no issues and didn't charge me a penny !\n\nNow I take my both of my cars here now . They always try to get you in as soon as possible and even help you find coupons .\n\nMichael called me and let me know my car was ready when I got my oil change, and when I got there he had a prepared envelope with all the paper work filled out for my rebate coupon ! All I needed was a stamp! \n\nGreat service Every Time !!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"JYYl83BilxsEpeNze7FteQ","user_id":"_IVw73h5SAgENCFsAHPTlg","business_id":"I_a74zmgR-X03LsKISWPcg","stars":5,"date":"2015-09-04","text":"One of my favorite dessert spots. Unique decor and yummy treats! Awesome central location and fast service. I would recommend the Sesame Street snoh treat. Magically delicious.","useful":0,"funny":0,"cool":0},
{"review_id":"UGedzod9iRVVIjRfJzPO4Q","user_id":"_IVw73h5SAgENCFsAHPTlg","business_id":"Ks13abA-KZWAA6FMQagQmg","stars":5,"date":"2016-08-26","text":"Excellent and friendly service !! The store is so unique and makes you want to explore the many varieties of Italian foods !! Not to mention the food is sooooo yummy ! We will be back !!!","useful":0,"funny":0,"cool":0},
{"review_id":"AToi1ANDp6CmL6eGcsN6jA","user_id":"Ij-Vi1Q1QU0xDZMwD13zKA","business_id":"WZ33VrvFDH-zZX6S7hg3Tg","stars":5,"date":"2014-08-26","text":"Wow! Great first time experience. I walked in the store not knowing anything about e-cigs and left with my first kit and a wealth of knowledge. Jian was great explaining the different types of e-cigs and made sure I left with a customized e-cig tailored to my needs. \n\nI will definitely be visiting this shop again for my next purchase!","useful":4,"funny":0,"cool":0},
{"review_id":"oAXQJJcDQDrf_TNGd4hBQA","user_id":"-0qGTY-Su4EvzEmYrx2ewA","business_id":"gsb62HgT3PbfMgunS8zJPQ","stars":5,"date":"2013-07-24","text":"Awesome store! My best friend loves Star Wars and loved this store. Lots of Star Wars collection!! Staff was very friendly and helpful. I will be back again soon!","useful":1,"funny":0,"cool":1},
{"review_id":"bEA1rznaUleAGG060gQ3-Q","user_id":"1PfU26ZFMJXTu6oWZf7SOw","business_id":"Rt4IuaC8ivZUrimcZMOW_w","stars":5,"date":"2015-09-16","text":"These guys are great.  I had some leaking problems and they showed me right away the problems involved.  They know their stuff and they weren't super expensive like the other guys I had over.  They were quick and did what they said when they said it would be done.  Great job guys!","useful":0,"funny":0,"cool":0},
{"review_id":"w4lCgCqZrP5_Cd13vcCshA","user_id":"vUafkDHsgupPfJfub5DvVw","business_id":"Dsr33WiRGtR60LGzN7LI_Q","stars":1,"date":"2014-12-11","text":"Horrible lash tech\nDoesn't  know what she was doing. \nDidn't have me sign a liability waiver\nWhich as a certified lash technician it is against the law to put chemicals near people's eyes without first signing a liability waiver.  \nEyes were puffy and red the next day she added for lashes to a single lash which if you've ever had your lashes done you know that's very painful. I called her and complained she told me to come in the next day that she would give me my money back when I came in the next day she was not there and is now refusing to give me my money back.\nDo not use her for lashes.","useful":1,"funny":0,"cool":0},
{"review_id":"VHFyS4H9CRRtyzL1Ke-3QQ","user_id":"a9rlHJsBY6V2frjeqRs4Sg","business_id":"YrqQWT5wzBUumklE4B_XfA","stars":2,"date":"2015-01-02","text":"Im a burrito boys veteran and let me tell you this place is terrible, its like they serve completely different burritos compared to the other burrito boys locations. If you're going to eat at burrito boys go to other locations and stay away from this one. The portions are small, the chicken is chewy.. like u have to spit it out..ughh. ALL other locations are 5 star and are the best burritos ive tried in the city","useful":0,"funny":0,"cool":0},
{"review_id":"5q_uTmRPIZMYFdI-RytPrA","user_id":"kQyCsK0ZIG7Ve-3y7lifUQ","business_id":"YqhhwTqRdLsf7V4yKA33-A","stars":4,"date":"2015-07-05","text":"I was craving steak and eggs - the $10.99 special is pretty good! My steak was cooked to my liking, the eggs were a little too runny but tasted great on my toast though.  I'd come back for something quick.","useful":0,"funny":0,"cool":0},
{"review_id":"yfahb0XQl5rAhXEYEJc20g","user_id":"HSK75auJ5HO6u9-4eZgHbg","business_id":"7a9Z2AFYvN_yeSBvtIzeQQ","stars":1,"date":"2012-06-13","text":"This property just lost a customer, and everybody we tell about our stay.  Do not fall for the free breakfast bit.  We booked through Priceline, which indicates a free breakfast.  We had a sub-par breakfast -which would have been fine if it were included.  However, we were charged almost $30.00 for two.  When we told the front desk Priceline indicates the breakfast was free, they referred us to the small print.  I asked \"what can you do for us?\"  The reply was, \"nothing.\"  Small print or no small print, a property that is unwilling to comp a breakfast to save a customer - when they certainly have the ability to do so - is not going to get my business.  What was supposed to be a short one-night getaway for a weary mom and dad of young children ended on a very sour note.","useful":4,"funny":0,"cool":0},
{"review_id":"RmQb6bEbPZUAXhITgzgm8w","user_id":"HSK75auJ5HO6u9-4eZgHbg","business_id":"W9y-Bl9030-rmfxSTmUD_g","stars":5,"date":"2016-12-24","text":"Best pho and yellow curry on the planet - bar none.  When I travel I can no longer order yellow curry because I know I will only be disappointed.  Everything else Ive tried on the menu is also superior.  Give the Singapore noodles a whirl - addictive.  Ask for Diane - her sparkling personality and passion for her work will make your day.","useful":0,"funny":0,"cool":0},
{"review_id":"69_8RGM-Bf42_-cojVU7tw","user_id":"a-3qWtHY-X8D9kocRwOdDg","business_id":"qz_ITBt4T5nOSXgUjiOgkA","stars":1,"date":"2016-06-29","text":"I would not recommend this service to my worst enemy. They quoted us a price over the phone at $225. The person who answered the phone said that a man would call us to set an appointment for services to be rendered. About two days later the technician calls and sets the appointment for about four days later. He gets to the house looks around and leaves without doing anything, saying he may be able to fit us in on Wednesday (two days later). After repeatedly calling and leaving messages we finally tried calling from a different number and got the operator to tell us that the handy man would be getting us an estimate as soon as possible. So a couple of days after that we received an estimate of nearly three times what we were originally quoted. Because as he said via text message \"we also have more customers that have being waiting.\" So after waiting a week we learned that homer the handy man has far too many similarities with one homer j Simpson. Our advice to homer would be stop overbooking your sham company in attempt to see who will pay triple what they were quoted at. This is textbook bait and switch at its worst.","useful":2,"funny":0,"cool":0},
{"review_id":"wRCNLThEIqJYEWRcJZAWhw","user_id":"a-3qWtHY-X8D9kocRwOdDg","business_id":"PvHjX1JBeoThJaZV0pfBPw","stars":4,"date":"2016-06-30","text":"This is one automotive center that chooses to do right by its customers. Thank u Ted and everyone else at Ted Wiens","useful":0,"funny":0,"cool":0},
{"review_id":"rPzd_dqWrMtnloWqTSyhtA","user_id":"a-3qWtHY-X8D9kocRwOdDg","business_id":"ViwjR6a_0Ytbk7MUnK19ag","stars":5,"date":"2016-06-18","text":"We have used this company twice. The first time was perfect. The second time we had a minor issue and the owner personally called us and immediately dispatched a technician. We highly recommend this company. Thank you again","useful":0,"funny":0,"cool":0},
{"review_id":"qCdn2NHTdPMlrb-jpVcBsA","user_id":"a-3qWtHY-X8D9kocRwOdDg","business_id":"pNVRNptxW2u_WhQ0Fs-g9A","stars":1,"date":"2017-11-26","text":"When this place opened it was wonderful. It slowly declined to the point at which we gave up on them. In the spirit of nostalgia we finally ordered again. We ordered a pepperoni and extra cheese pizza. On a smallish large pizza we got 17 pepperonis and shuddered to think about the amount of cheese that the people that didn't ask for extra cheese got. When we called and spoke to the manager she succinctly told us that all toppings are standardized and pepperonis max out at 20 per pie. That's 2&1\/2 per slice. That's far too few. This company's M.O. is the same which dictates how many pickles and how much ketchup McDonald's puts on a hamburger. SAVE YOUR MONEY!!! BUY PIZZA HUT OR GRUBHUB METRO PIZZA!!!","useful":0,"funny":0,"cool":0},
{"review_id":"M3hS98MXB2fL7AoKHSZIIA","user_id":"a-3qWtHY-X8D9kocRwOdDg","business_id":"TFlBSkmgXnpKHKctVcUAaA","stars":5,"date":"2016-07-08","text":"Dr landerville is a miracle worker. We brought our son in about four months ago when his vision in his left eye was 20\/400. Since starting therapy his vision has improved to 20\/80. With his most recent prescription his abilities on the baseball field have grown exponentially. Not to be hyperbolic but what this doctor has done is truly miraculous. If your child has an amblyopia (doubt I used the word correctly) you will not be able to thank her enough. Thank u doc, thank u, thank u, thank u.","useful":0,"funny":0,"cool":1},
{"review_id":"Ujs1qlAlLw0FLV15tT7Lfg","user_id":"B9P7Jy2d2FoEMbIx6A9SiA","business_id":"bjSC_jbrypke0l-bXXBmwQ","stars":5,"date":"2013-07-01","text":"Best Steak house, went there for Father's day dinner, all of the food from appetizers and  salads,  to main course and side dishes were all amazing. The service was superb, our waiter went out of his way to make sure everything was perfect .  Also, the bar makes you any drink that you want! Highly recommend this place!","useful":0,"funny":0,"cool":0},
{"review_id":"7EGvTZ3PKz7wz_-dzVxkVA","user_id":"9IfXhE-8VvNxpYrIDZcbuw","business_id":"z2JTN5PXemCRGtGbKiOvZw","stars":3,"date":"2015-10-03","text":"This place was recomended by friends. Decided to try it out and Jenny did a good job. I recommend her and her husband who are the owners of the salon. Only problem is that Jenny is the most wanted and if you walk in she usually is busy and she has a lot of clients waiting for her. The best way to get her is by appointment only. The place is decent. I love how my nails came out. I showed her a picture of how i wanted them n they looked identical!! I would recommend the salon but if possible try to get your nails done with Jenny.","useful":0,"funny":0,"cool":0},
{"review_id":"NX1ubhZ8svrehq3P0-Rx-A","user_id":"3bxAzqqf2AMZ9yM8OOmQoQ","business_id":"U9NToT0l6YQFBJzncOLGBg","stars":2,"date":"2014-08-16","text":"I went a couple of years ago to do a cover up of my small tattoo on my lower back. The process up to was fine, emailing sketches to me for approval, tweaking and stuff. I felt good going in. Her artwork was great and she is talented. However, when she put the stencil on my body I did not like the fact that some of the petals, vines and filigree flowed below my butt crack line. She said she would make the petals closer to that area smaller no problem. I repeated myself sternly because I wanted to make sure petals werent going to end up in my butt crack or too far down. She said ok she would tweak it on my body. My issue was that I didn't want the vines to go all the way from my left hip, to all the way my right. So I understand she tried to make it flow from top left to bottom right. I sat in the chair for five hours no breaks. Because of the detail and shading, and the fact the cover up grew significantly larger in size, I definitely was in pain. You can tell the artist was getting antsy and annoyed, to the point where she was rolling her eyes... which I find extremely rude. Finished product; beautiful work, but the only thing I didn't want? She ended up doing. The petals flowed lower than I wanted, and the filigree flowed onto my right ass cheek. When I saw it, I didn't even know what to say.... I was so pissed I just paid gave a cold shoulder thanks and left.. I mean what can I really do now anyway? When I wear jeans, two inches of my tattoo detail is covered. If I had known it was going to flow so low, I would have just made the vines completely symmetrical. I was mad that I was mislead. IF she had told me no, those petals need to match the other sizes of petals or for whatever reason it'd still end up under my butt line, I honestly would have just made it symmetrical. I'd advise you to find another place that treats your customers with respect. And a place that actually CARES and listens about what you want.","useful":7,"funny":2,"cool":2},
{"review_id":"A_q1J24NLXI0y3RnW4ACUw","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"frCxZS7lPhEnQRJ3UY6m7A","stars":5,"date":"2012-06-19","text":"Amazing place wish i lived in Phx so i could have this EVERYDAY!","useful":5,"funny":0,"cool":5},
{"review_id":"4aL9cI8LVshFaFs1bbE4mA","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"OMm3KPJkkbfq3SMXqhZ0uQ","stars":4,"date":"2011-07-14","text":"Cheese steaks are pretty good,  but omg the sweet and tangy wings I need them in my mouth!","useful":0,"funny":1,"cool":0},
{"review_id":"oKcHPkQsb9Qnz3xB1-kncQ","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"u2q_84hHvKGl5hKnAE7zNw","stars":5,"date":"2012-06-14","text":"Best sushi place in Gilbert.\n\nyes even over Otaku and Blue Wasabi","useful":2,"funny":1,"cool":0},
{"review_id":"dGqPj8LmewF7tissRWg4Aw","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"vUlM7MSLYsLLiWIAY7MRLg","stars":5,"date":"2015-01-04","text":"Working with Brandon from Renters Warehouse was an awesome experience. It was really great to have all of the headache taken off of my hands. He handled all of the phone calls, got the documents sent over very quickly and efficiently and was able to help me find a tenant in just a week! He was always available by phone and email. Next year, we will definitely use Brandon again if we are in the market for another tenant! Thanks Brandon & Renter's Warehouse!","useful":0,"funny":0,"cool":1},
{"review_id":"dzLq6qv9MzixwDWj_ysnBw","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"-H3L511nPmzOiLaL2HmDsA","stars":5,"date":"2015-12-23","text":"I have been coming to Jay for a couple months now and been getting the best haircuts from him! he does amazing work. Jay is always fun and the space is awesome  Anyone looking for a great haircut, come here- for sure!","useful":1,"funny":1,"cool":1},
{"review_id":"HFGwiyIRq_2deTBAUsQzEw","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"EBnv9_03eNqxQqRQJH4SUw","stars":5,"date":"2015-05-09","text":"Waited months to try this place due to the previous reviews. Was not disappointed with the food or the atmosphere. No wait, fast service and delicious food. Everyone should give it a try and disregard previous reviews. -#yolololos","useful":1,"funny":0,"cool":0},
{"review_id":"rrpxPoPzGm4nmMohgBUy-w","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"jZSYtIPqaqVuUfVwHNXcqg","stars":5,"date":"2014-06-13","text":"Using my husbands account! \n\nThis was the best nail experience I've had in my life! Jimmy is fast, and amazing at what he does! Prices are super affordable and I was in and out in under an hour for a full set. Usually I leave with a nick here or there on my nails, but this time, they are perfection!","useful":1,"funny":0,"cool":1},
{"review_id":"OLAT87Th5z56-MmanNWb9Q","user_id":"CvObejfve_V9XCyaAISMtg","business_id":"W9y-Bl9030-rmfxSTmUD_g","stars":5,"date":"2015-01-18","text":"My wife and I have lived in Gilbert for years and we have never found an Asian place like Simis! It is truly a must try, especially in the Gilbert\/Mesa area where every restaurant is a chain. The staff is attentive and make great recommendations! The food is fresh, tasty and always served fast and exactly as ordered. We have definitely found a new place! Highly recommended dishes: Orange chicken, Kung Pao chicken and house chow mein!","useful":1,"funny":0,"cool":0},
{"review_id":"yuJKyYPu9V8Pc1shxBckuA","user_id":"xhELgz_mQcZiVc1sifXiYQ","business_id":"t18eAYCZ9Z2ntbJwAR7DOQ","stars":5,"date":"2015-08-05","text":"My personal experience with this office has been very positive.  I've been very pleased with all the work I've had done which has included replacing some old bothersome fillings (the new white ones look SO much better), a root canal and repairing two teeth I had chipped rather badly.  The staff has always been friendly, professional and helpful.  \n\nThe thing about dental work is that it's expensive no matter where you go; and unless you have fabulous employer-paid insurance, it's money none of us want to shell out.  I have purchased an insurance program that Perfect Teeth offers so the fees are reduced, and my husband got a CareCredit card so that we could pay for his dental work over time without paying interest.","useful":1,"funny":0,"cool":0},
{"review_id":"b6wgF2XnsXNQy6HwrdMX0g","user_id":"ZrQ8YnOeKwzXnCTc1dxg7A","business_id":"7GaakwraLxsSN-N_D37FpA","stars":3,"date":"2015-08-12","text":"This is a liquidation type of store.  Sometimes you get great bargains in towels, sheets, rugs, curtains and lots of other miscellaneous things.  I like the fact that although they have some  base products that you will always find there are often nice surprises.  It's not a \"pretty\" place but it is kept clean and they try to keep the shelves neat even on crazy weekends when people tend to be messy.  Like any liquidation place everything is final sale and buying electronics is a gamble.  If you want mid level stuff at decent prices and don't mind the warehouse feel I suggest you check it out.","useful":2,"funny":2,"cool":1},
{"review_id":"EOKMRPxrIfiapH9JV5l7jg","user_id":"ZrQ8YnOeKwzXnCTc1dxg7A","business_id":"H8cHCLyu_eegqud5xwtkpg","stars":1,"date":"2016-07-11","text":"I wish I could give zero stars.\nPretty good prices but lousy customer service.  \n\nToday  I went there for the 4th and last time.  I gave them the benefit of the doubt at first but every time I went there and was either standing in line waiting to pay or waiting to get fabric cut they ignored me and took a south asian person first.  When I spoke up and said \"excuse me I have been waiting and was next\" they rolled their eyes at me and started speaking in their language to the other ladies there.  My parents taught me to treat elders with respect so I left my potential purchases and walked out.  \nNEVER AGAIN!!!\n\nIf they don't want non south asians in their store they shouldn't have half their store selling West African style fabric.    Last weekend I wore some dresses that I had made with the fabric I had bought there previously and got a lot of people asking me where I got the cloth from.  I had to be honest and let them know how I had been treated. They have lost at least 40 potential customer... not that they care.","useful":1,"funny":0,"cool":0},
{"review_id":"yqX42915KsW23osZELNSjw","user_id":"zWdpCEIg-u7Lr3L9pzlS0w","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":5,"date":"2014-07-02","text":"my favorite breakfast spot on the strip! A perfect view with a perfect breakfast. NOMZ","useful":0,"funny":0,"cool":0},
{"review_id":"WQvEeVGu6KQicoBRJ2cH7g","user_id":"csF47op_Xg24j9l5YtWCXw","business_id":"TMsq0zE6AXioad988gnMFQ","stars":5,"date":"2017-04-21","text":"Came through after visit to local hospital. Hands down best omelette I have ever had. Nice atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"NobmYe0zPLFA5zN1ZfTgfw","user_id":"csF47op_Xg24j9l5YtWCXw","business_id":"_3bK16Td4ykpKaAIKxSphg","stars":1,"date":"2017-04-23","text":"The guy who greeted us Friday talked so much we couldn't even explain what we wanted. All he did was follow us and bad mouth every other company without cause. \nIf they have a good product or great prices I will never know because after being attacked by mr pushy we left after a very short walk around the messy store.","useful":3,"funny":0,"cool":0},
{"review_id":"faXbchNax0UBhpE_V-pOtA","user_id":"3JGD60_k4TPO37W2SnbBMw","business_id":"MngIoRvkDxrePOVZNg_06g","stars":2,"date":"2016-12-13","text":"I received this catalog and thought this would be a great way to eat on Christmas without being stuck in the kitchen. We ordered a lot, 2 of the \"large\" sausage and cheese samplers, the loaves of bread and creme spreads, jerky sampler, petit fours mix, salted caramel petit fours, Brownie Cups, butter cookies, brie wheel, cranberry chipotle cheese, cheddar cheese, the butter cheese (Can't remember the exact name) cheese curds, and that flat fried cheese that looks like the Greek dish called Saganaki. So this was not a small 1st order, really, I was stupid for ordering so much without having any experience with them, and let me tell you why:\n\nFirst off, I live in Tucson, AZ and while it is December, the days still get well into 80 degree temps. This arrived through USPS, everything was in its own separate shipping box, (One box completely crushed, but luckily no damage, but that is on USPS, not the Cheeseman) and I do mean EVERYTHING was in separately addressed shipping boxes! It was about 10 shipping boxes all stacked together and wrapped in a sort of plastic, and then 3 or 4 loose boxes. For all being in different shipping containers, I received 3 ice packs total for the entire order, which were completely melted and not even cool anymore upon arrival. My brie wheel was a floppy mess! All cheeses were at that stage just before melting, very, very, very soft. I didn't have the heart to look at the chocolate, but I probably should. I just know if I open those Petits or brownie cups, they will get eaten long before Christmas day...lol \nI just don't understand why they have all that packaging but hardly any ice packs for such a large order going to the desert. If they don't pay attention to where they are shipping in order to pack appropriately, they should. You wouldn't pack an order destined for Michigan, right next door to Wisconsin and much cooler, in the same way that you would to the desert in Arizona. Not only does it take longer to arrive here, but it will face different temps and heat in the mail trucks than the one going to Michigan or what have you.\n\nOkay, so we start opening boxes and I come to the loaves of bread and creme spreads. All I could do was laugh; I buy on eBay a lot and a huge issue I have is ordering something and when it arrives it is either gigantic or tiny compared to what I thought I bought. Yes, I check measurements, but for some reason this still happens. So anyways, I was \"ebayed\" on the bread loaves. These loaves are about an inch and a half to 2 inches wide by 3 inches long. Hardly a loaf, perhaps a loaf for an 18 inch doll, but not full size humans. I would feel like a doofus serving someone thee tiniest slice of bread ever. The loaf itself is about one serving. Just a fair warning. The \"large\" sausage and cheese packs were the same way, maybe an inch and a half in diameter by 3 inches long? I knew they wouldn't be full sized amounts, they never are in sampler packs, but even so, I was shocked at the price to size ratio.\n\nGranted, the only thing I have opened and tried were the butter cookies and they're okay. (I think Royal Dansk are better, honestly. I really wish I had gone for the baklava instead, but it threw me off the way it said it was made with a honey flavored syrup, not actual honey. Why? Why not real honey? Anyway,  these issues still stand even if this food is the yummiest I've ever had once we eat it. That is why I didn't wait until eating it to review. I know a lot of people got that catalog last week and I hope this helps someone before Christmas. I will update with the food part after Christmas.","useful":1,"funny":0,"cool":0},
{"review_id":"n4kSDIb-cfXZIHUQHzy8ww","user_id":"dR7-2dFTSDt5rFppvDcdlg","business_id":"yP-6hIA3qGWbIz0p9zSaoA","stars":5,"date":"2017-01-03","text":"Our company held a party of over 90 people over the holidays. We were very pleased with Crave Grill House. They offered a good selection of foods at a reasonable price and they were very well done. \nThe staff were very professional and accommodating. The manager was great to work with, he made the party planning much easier.","useful":0,"funny":0,"cool":0},
{"review_id":"CADvthQISnWJ_ddlc0Pw5w","user_id":"dR7-2dFTSDt5rFppvDcdlg","business_id":"kiZl4fwzycsogX60drGY2w","stars":5,"date":"2016-06-10","text":"Great food, friendly service! I often frequent Tamam's for lunch and they never dissappoint. The Lahmacun is a personal favourite","useful":0,"funny":0,"cool":0},
{"review_id":"8dzV4GAl87fmowIhB4zDJA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"J3FUxMAHfCl-WFo86u5DqA","stars":5,"date":"2008-10-03","text":"a great show..we got our tickets through the half price ticket booth at fashion show mall..the seats they gave us were in the third row but right against the wall..so we asked the usher if we could move, the usher got the manager and we were moved to the aisle in the middle immediately. great service..great show.","useful":1,"funny":0,"cool":0},
{"review_id":"PYWnPK3ce3a8-Kafg3zhsA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"-JFVxwdVQfX207554dx1nw","stars":2,"date":"2008-11-01","text":"Two stars cause the salad was crisp. The chicken was terrible. They should use a higher quality of meat. The service was horrible. Somebody please tell me where i can get a good chicken bowl","useful":0,"funny":0,"cool":0},
{"review_id":"5KF74jVHE-oKL5sjdlOEvQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"1Vvxx-9AoINg8TJXOZgEHg","stars":5,"date":"2008-08-15","text":"Excellent enchiladas, especially for being on the strip. Drinks were strong and delicious. I kinda laughed though when the waitor made the \"fresh\" guacamole in front of us. I dont really think that was necessary...but the hostess was amazingly hot and there are a few good people watching tables in the restaurant","useful":0,"funny":0,"cool":0},
{"review_id":"_ozSY2QBMrXSrZFPxGHuGw","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"Z5eukYH32_nFljOTC2DJ0g","stars":3,"date":"2008-08-15","text":"It really isnt as good as locals will tell you before you go. I think its the kinda place were you really gotta get lucky with the person working the oven that day. It also seems like if you dont order any of the ingredients that they offer \"extra\" for, it isnt as good, making a simple pie get a little pricey.","useful":1,"funny":0,"cool":0},
{"review_id":"mybitME3j8bHxLpJDE4RxA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"RhEvP5flF6KoPriMHmVYGg","stars":5,"date":"2008-10-03","text":"i LOVE the red rock. its so nice and its never really that crowded. there STANDARD rooms are nicer than some \"upgraded\" rooms on the strip. they have great dining choices, a ton of penny slots,  and even an IMAX theater. i have no prob driving the 30 minutes from south vegas over there rather than dealing with going to the strip and parking there","useful":1,"funny":0,"cool":0},
{"review_id":"KKrCp2NlUZXPmBXfDXTNFQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"XZbuPXdyA0ZtTu3AzqtQhg","stars":4,"date":"2008-11-01","text":"After a year of being a vegas resident i found it necessary to pay some dues to bob flay and hit up mesa grill for my birthday dinner. It was good, but I am left wanting more. The apps were good, smaller portions than I was hoping for. The margaritas were amazing, i dont care what color the cactus pear margarita is I am drinking it (its pink). But my entree is what left me wanting more. I had the bone in rib eye and it really didnt have that much flavor. It tasted like a steak, which is good of course cause it is a steak, but a steak from mesa grill should have had more of a kick to it.","useful":0,"funny":0,"cool":0},
{"review_id":"RdOfUCd-FNqvA4bCFLCpeA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"I4Nr-MVc26qWr08-S3Q1ow","stars":1,"date":"2008-10-03","text":"absolutely terrible service. either a) they didnt know there was a line out the door or b) they did know but didnt care\n\nif you dont like your job..STOP WORKING THERE!","useful":0,"funny":0,"cool":0},
{"review_id":"FknC8WjpirteydHuXL0dlw","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"IImZFNzX4cP84rFsyb-9mQ","stars":3,"date":"2008-08-15","text":"Fine for tourists, but locals gotta go to china town for this stuff","useful":0,"funny":0,"cool":0},
{"review_id":"YovbCBbhpg1UDVNBvsJzWA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"grx2VIhIT7LpK0-kthPHzQ","stars":2,"date":"2008-09-06","text":"im just confused on what the hell this place is trying to be..it looks all cool and modern on the outside..but the menu has low end sandwiches and then high priced steaks? The atmosphere inside is that of a fancy restaurant but it seems like an overdone chili's or applebees. The couscous was decent and their bread pudding is what made me give it the second star since it was made with croissants","useful":0,"funny":0,"cool":0},
{"review_id":"RnPUQLgBK5ZsgPmA39FdDw","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"7fxebHYUwIF6CakxSr70iQ","stars":5,"date":"2008-09-06","text":"It was worth every penny. The ambience was excellent (for the main side which we were on) Caprese was delcious, our tasting portion of the sausage orchiette was perfectly al dente, my osso bucco was very good and my girlfriends filet mignon was fantastic (even for medium-well). I think that since this is a Celebrity Chef restaurant inside of one of the top 3 hotels on the vegas strip, the prices could have been higher! Honestly! Yes it is all al a carte, but the sides are only $9 when they could be $12 like other steakhouses. The petite filet was about $10 less than it is at other steakhouses, i think its one of the best bargain celebrity upscale restaurants in vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"RkjRT9W-zejyxvWnIKJWgw","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"Fi-2ruy5x600SX4avnrFuA","stars":4,"date":"2008-08-19","text":"Came here for dinner, and didnt run into a long wait at all. Food was pretty good, atmosphere was also pretty good. I was happy they actually had a middle eastern station and even more pleased with how good it was. It ended up being the only thing i ate! with the exception of fresh cut fruit and shrimp cocktail :)","useful":0,"funny":0,"cool":0},
{"review_id":"_IrC0XtAbIO6hUNWK3tefQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"ECOkEVUodMLUxvI0PMI4gQ","stars":4,"date":"2008-11-10","text":"If i can walk right past the line with a big group of girls like i did this weekend then i can safely give it 4 stars. holding off on the 5th star cause i STILL had to pay $20 and the music was horrible..and i thought the dance floor was small.","useful":0,"funny":0,"cool":0},
{"review_id":"aSwRzsMinExWLjOlSVTYGQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"N0apJkxIem2E8irTBRKnHw","stars":5,"date":"2008-08-15","text":"Im a big fan of this place, its simple, but perfectly executed. The sausage pizza is great. Anytime friends and family come to visit I always take them here. Its a safe choice","useful":0,"funny":0,"cool":0},
{"review_id":"1SyI0XndoSyh0hxc8ilUhQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"PDIh1lVtKlUqPJROXYJQvQ","stars":2,"date":"2008-10-18","text":"I am so surprised to see that this place has an average rating of 4 stars..i thought the atmosphere was terrible, the menu was overpriced, and the service is better at the DMV. I dont understand how some of these girls in vegas get these waitressing jobs and make a boat load of tips, yet be so stupid! We saw our waitress 3 times, once to take our drink order, once to take our food order, and then to drop off the check. \n\nTake your business elsewhere","useful":0,"funny":0,"cool":0},
{"review_id":"niUttZsfQWwDnfP-UtCjyg","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"Rb2s2-2kIvbPXnPEuM_OBg","stars":4,"date":"2008-11-10","text":"40+ buy one get one free drink coupons was what brought us here. the drinks were awesome and they were at good prices. location sucks and the food wasnt great so thats why im holding off the 5th star. only go if you have coupons","useful":0,"funny":0,"cool":0},
{"review_id":"QScUbztZh5Smqs7OKYnv2Q","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"aLlREPOEtt3JzeDCagHytA","stars":1,"date":"2008-11-10","text":"what a joke of a nightclub. they dont know how to work their line(s) at all in the front and once you finally get in you there isnt even room to dance let alone move. terrible guy-girl ratio too.","useful":0,"funny":0,"cool":0},
{"review_id":"UOisgHGTBqzQtYozvaIgTQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"03hgFWEcDg205hOCnswwiQ","stars":1,"date":"2008-08-15","text":"I really want to give this place a 3 strikes and you're out chance, but after getting sick after both times so far, i'm done with this place.","useful":2,"funny":2,"cool":2},
{"review_id":"5njDTvIo4eTO5kiWausnkQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"A5Rkh7UymKm0_Rxm9K2PJw","stars":4,"date":"2008-08-15","text":"Pretty good place, a classier alternative to an applebees or chilis. Quite a diverse menu, surprisingly the more elaborate entrees they offer are actually quite good, and priced well for the portions you get. I'm pretty sure they have 900,000 beers on tap. Pretty loud but if you are in the mood it can be a good time.","useful":0,"funny":0,"cool":0},
{"review_id":"sqMwxQBpge8QGXQ1HJmw0A","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"2weQS-RnoOBhb1KsHKyoSQ","stars":5,"date":"2008-08-15","text":"Came here for a sunday brunch. Took one hour from when we got in line to being seated at a table but thank god it was worth it. Cleanest and tastiest buffet in vegas. I think the orange juice might actually be fresh squeezed. Great chilled shrimp. Every piece of cut melon is at the perfect ripeness. COME HUNGRY!","useful":0,"funny":0,"cool":0},
{"review_id":"oBz8lqLSBTOj7voC5sw3Dg","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"7ibuDLfx8gEhESAufYIySw","stars":5,"date":"2008-08-15","text":"How lucky am I that this place gave me my first sushi experience ever!!! We come here once a week, and yes, almost everytime around dinner time there is a wait. BUT IT IS SO WORTH IT. Plus they are really good with their to-go orders. Not the greatest place for large parties who want to sit and socialize alot, but perfect for a quick, healthy bite. Try the tiger roll, it is by far the best.","useful":0,"funny":0,"cool":0},
{"review_id":"Zd65z7gr1YcGhdaDzu6PMw","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"V6RwJ9NzBFt9HOyx-VSLIg","stars":4,"date":"2008-10-03","text":"it was a great show..a little too long and played out..but those performers are very talented. its a little cheaper than most shows on the strip and it is worth the money","useful":0,"funny":0,"cool":0},
{"review_id":"4l36m9x1GNW2pRsfKkkrCQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"PYe_FDw6QTbTf66WcGE_tw","stars":5,"date":"2008-11-01","text":"We grabbed a few drinks at this bar and I am giving it 5 stars because of how friendly and how good the bartender was. He greeted us immediately, and we had drinks in our hand in an instant. Props to you mr. bartender","useful":0,"funny":0,"cool":0},
{"review_id":"Ftd8gd2wgle7MasT_71q6A","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"Oto60yDwk1z72WmfWEYrjg","stars":4,"date":"2009-01-05","text":"We actually had a decent meal here at baja miguel's the other day. They have a daily lunch special from 11-3 daily that includes a frozen margarita, fideo soup, and your choice of two items to make up your entree that comes with rice and beans. The chips and salsa also come with bean dip and guac. I think its actually a pretty good deal if you are close by and especially since the special is seven days a week.","useful":0,"funny":0,"cool":0},
{"review_id":"HVpEaYgi_M2sDLrJ1hj-DQ","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"0ldxjei8v4q95fApIei3Lg","stars":5,"date":"2008-10-03","text":"best bbq ive had in vegas so far (ive had famous daves, and memphis champ.) I love the brisket and mac and cheese here. I also think the fries are good and my girlfriend loves the ribs. I think its a little pricey though compared to the other bbq places in town but its worth it. Service is decent, there seems to always be a wait but come hungry!","useful":0,"funny":0,"cool":0},
{"review_id":"7i-4xPy5-dzlLBcSk2uecg","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"pDSl9xdKJCdN4vu8z26cEA","stars":1,"date":"2008-11-10","text":"this place is horrible. go if you are 40+ years old and want to do something that you think your spouse would be jealous of, cause i swear that is all the kind of people that were there. the bouncers were douche bags and though the majority of the girls who worked there were attractive, only one was super hot; but they were all cocky as shit","useful":0,"funny":0,"cool":0},
{"review_id":"ed9eUaL7a0pWpbbpbgGosA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"UYh1N1xQhOh-a7nX92xPzQ","stars":3,"date":"2008-09-29","text":"Weird servers. I dont know how else to say it. We have been there 4 times with 4 different servers and 3 of them have just been some of the weirdest people I have ever had to deal with. I think my waitor I had last time used to be a mime because of the way he was using his hands. The food is the only reason why we come back because its pretty good and we always know what to expect.","useful":0,"funny":0,"cool":0},
{"review_id":"Xae6Q68bs7iwoaoZqChQ9w","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"_3FxLxdg1unUQc3QqIgJuA","stars":5,"date":"2008-10-03","text":"been here twice now and its been great both times. the service the atmosphere the food, everything is worth your money. the baked sweet potatoes are amazing. the steakhouse salad is incredible and very filling i might add. Ive had the filet and the burger and man i have never had a beef patty that had so much flavor.","useful":1,"funny":0,"cool":0},
{"review_id":"LvhNuzU3j4C8TVaebTIPVA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"KXITXbKuE60WSUDs7NZVLQ","stars":3,"date":"2008-09-29","text":"The best rolls I have ever had, but that was about it. I had the chicken with vegetable couscous and it wasnt anything special. I was part of a party of 5 and none of us were too happy with our entrees. The Calamari tasted like it should have been in a mexican restaurant and the pork inside of the spring rolls was way too hard, probably cause it was old.","useful":0,"funny":0,"cool":0},
{"review_id":"H-sqdABrQLF3EPVNFPce6g","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"0ahghcpWQVkm4lEFwx-peA","stars":2,"date":"2008-10-03","text":"i cant bash this place since i am persian, but it really needs some help. they need to be on kitchen nightmares with gordan ramsey haha. i liked the food, it wasnt how my dad and his friends make but its still pretty decent","useful":3,"funny":6,"cool":0},
{"review_id":"8AxKhS_eOSB22sk2D4ekiA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"pLMPpaJ7whp86uL_3ezwMg","stars":2,"date":"2008-08-15","text":"Nothing special, definitely dont wanna eat and then go walking around on the strip, could be bad news, haha","useful":0,"funny":0,"cool":0},
{"review_id":"t3B6DJMkY09Aiy8Py9HMjA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"dPbvWt-6YVxtGkeh7f9JpQ","stars":4,"date":"2008-08-15","text":"I've been here a bunch of times and if you are looking for a good meatball sub, come here, but, YOU MUST ORDER THE EXTRA CHEESE, or you are missing out. The new sweet and spicy meatball is good too, has a smoky flavor","useful":1,"funny":0,"cool":0},
{"review_id":"BGN212HMWz38Z2B0-apDXA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"ZIUs7gncPOX0OXr1ZYviAQ","stars":2,"date":"2008-10-16","text":"2 stars = Meh. I've experienced better.\n\nSo i have to give it two stars cause i've experienced better. Long story short I dont really think it was worth the price. My vegetables and rice were cold and I wish I would have walked over to Ethel's for dessert.","useful":0,"funny":0,"cool":0},
{"review_id":"Hr3wOgHfOCuOxYPnOuYLBA","user_id":"TuAuPTDZEldXkOt0a-n4Xg","business_id":"rTS8LsUmNIiXsXydE49tPA","stars":4,"date":"2008-08-15","text":"Hit and miss..hope to god you dont get seated under an a\/c vent cause you will freeze! haha. the food is ok...ive had the chicken sandwich which was one of the best i have ever had, then ordered it again on a later visit and was very disappointed. The crab dip is really good, very cheesy. The best thing about this place is that if you order a drink and you dont like it, they happily swap it out with something else for you","useful":0,"funny":0,"cool":0},
{"review_id":"a_7nNgH7shWaHB_Fiso9RQ","user_id":"5M53qj25kMQFi3paZHHTSQ","business_id":"22LyWivLY_y_b3ohASfP2Q","stars":2,"date":"2016-11-08","text":"After years of hype on the radio, the Brady sauce was ehh. 630pm and they were out of brisket, ehh. Too much hype, too much a money grab by shameless Brady.","useful":0,"funny":0,"cool":0},
{"review_id":"j1qDphakZx9NDhqkhrnmxA","user_id":"5M53qj25kMQFi3paZHHTSQ","business_id":"muH2Nv5f7j8TRoBlqqJxYA","stars":5,"date":"2017-12-14","text":"Had a heater that would turn on, but not run long enough to heat out AZ home. Guys were on time and the fees were far more than reasonable for the work that had to be done. A great job! Thanks Gents, will definately use you again.","useful":1,"funny":0,"cool":0},
{"review_id":"2Dp57PgHny8oTaA50FX4qg","user_id":"5M53qj25kMQFi3paZHHTSQ","business_id":"Ws2l3kBWPzqaLdQVtZxIZg","stars":5,"date":"2015-10-19","text":"I've know Rich personally, professionally and militarily for nearly 20 years. I trusted him with my life in the military and having nothing but the most respect for him now. His dedication to his craft presents itself with your first bite. It doesn't matter what you're chowin' on, you will not be disappointed. PERIOD!\n\nHe has catered two work events and my wedding. Never late, never disappointing and I have never passed on any leftovers.","useful":0,"funny":0,"cool":0},
{"review_id":"riZZ88lEBbGLx89_k6uokw","user_id":"MKyQ0CCZ8aqKN2DJmT4HAA","business_id":"vTQtnaCpuB1mVNnn0OuTow","stars":5,"date":"2011-07-25","text":"Great place!!  Always friendly and more than willing to fit in a walk in.  Even last minute appointments have been accommodated.  My kids love the stylist and I'm happy with the service and prices!\n\nFYI... They are at a new location. Southeast corner of Gilbert Rd and Chandler Blvd.","useful":0,"funny":0,"cool":1},
{"review_id":"H0-Gcq7Qqn1xjNh_J3JJgQ","user_id":"MKyQ0CCZ8aqKN2DJmT4HAA","business_id":"J__5TVwnEtNNAWOndZtJig","stars":5,"date":"2009-08-31","text":"I happen to see Scotts clean trailer set up driving down the street and was impressed by it so I wrote down his number.  I called him to detail my husbands old, dirty, camping truck.  This 01 Dodge truck had deep Arizona pin striping and dust in EVERY crack and crevasse.  He was super flexible to meet my scheduling needs and then even showed up on time!  He did an amazing job on the Dodge.  Above what I thought would be possible.  We ended up having him detail our Titan and as a gift to my father, had him detail his truck as well.  My dad was picky about using a buffer on his paint job.  Scott talked to him at length and fully explained how safe it was.  Scott was completely willing to do it by hand but my dad gave in and was VERY pleased with the outcome.  I would recommend Scott and will continue to use his detail services.  THANKS SCOTT!","useful":0,"funny":0,"cool":0},
{"review_id":"q6l5eVfuqIH5vSslevuM8g","user_id":"TNbFeX4-6tI2MtlEV4ubgg","business_id":"rsWSdtHfGDT5thc7aDN6PA","stars":1,"date":"2016-07-12","text":"So disappointed... Show up as a walk-in and get asked to come back \"tomorrow\" because apparently the only person that can do fills is not available....","useful":0,"funny":0,"cool":0},
{"review_id":"Hh7sOXUcSxPjPOaBbcVcCQ","user_id":"jnHvEb5Ab2fnH5qypQk5HQ","business_id":"AV6weBrZFFBfRGCbcRGO4g","stars":4,"date":"2013-07-26","text":"Very satisfied.  Try to stay in the renovated section of the hotel.  If you play your cards right you will have a great time at the Luxor!","useful":0,"funny":0,"cool":0},
{"review_id":"DOJmaH3sznpwKS28xtMlYg","user_id":"Hzc1AxRRwp6bpTOmlrl73A","business_id":"4JNXUYY8wbaaDmk3BPzlWw","stars":4,"date":"2014-05-15","text":"We have been to Mon Ami Gabe ' 5 times now.That should say something. The food is above good and the service is always great. See you next year.","useful":0,"funny":0,"cool":0},
{"review_id":"M0N_TwoDmnNlPO17hvhhFg","user_id":"Hzc1AxRRwp6bpTOmlrl73A","business_id":"OETh78qcgDltvHULowwhJg","stars":3,"date":"2014-05-14","text":"1st impression, very good bar service, good vibe.  Once seated all down hill. Our server was a putz, food was good but expected better. Mon ami Gabe is much better save your $.","useful":0,"funny":1,"cool":1},
{"review_id":"jC-Fw6sRNyCop5v7Kx1oCw","user_id":"SULbPNyWZPVve1_iuUsmhA","business_id":"XXW_OFaYQkkGOGniujZFHg","stars":4,"date":"2011-12-30","text":"Came here after reading some yelp reviews.  We were staying at the Stratosphere so it was close by and a much better choice than IHOP.  Rather pricey for a diner but when reviewers said the dishes were large, they weren't kidding.  There were 5 of us, we ordered 4 breakfast entrees and would have had plenty of food with 3.  The Ambrosia french toast was as good as it looks in the picture.  Tons of fresh fruit.","useful":0,"funny":0,"cool":0},
{"review_id":"eNwdm8ZOCPEuLCfi8PA5FA","user_id":"SULbPNyWZPVve1_iuUsmhA","business_id":"R3TC2oq8fQK9c9BNMZ-ynA","stars":4,"date":"2011-12-30","text":"We came during happy hour and it was definitely worth it.  The sushi and rolls were about half the regular price. Not sure if we would have come otherwise.\n\nQuality of the sushi was good - don't quite understand all the negative reviews.\nThe Viva Las Vegas roll looked and tasted great.  My husband really liked the tuna.  Salmon was OK, I've had better.","useful":0,"funny":0,"cool":0},
{"review_id":"fdVJVRlJ6vP-u9eKBMYeSA","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"p6EUf6c9GCfG7seS_wfFyA","stars":5,"date":"2013-09-26","text":"Really tasty burgers, great selection, affordable price, clean place and good service","useful":0,"funny":0,"cool":0},
{"review_id":"zZ9vGSbd3BBVX0lcn4i9Ig","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"q-wEmUkrysnfQF8W80yZ3A","stars":1,"date":"2013-02-08","text":"I Brought my car to Penske Rapid Repair\/ Auto Glass to get the windshield repair, as they also own Porsche North Scottsdale. Biggest mistake I ever made. When I got the car back it had adhesive and fingerprints all over the fenders and doors, as well as a chip in the drivers door. Unfortunately that was just the beginning. A few weeks later I was cleaning the inside of the windshield and noticed something odd on the passenger side of the windshield. So I brought my vehicle to the Porsche dealer to have them look at it. They told me that they Penske Auto Glass had torn, and broken the windshield antenna ribbon when they installed the new windshield, and that the windshield would have to be replaced once again. I did not trust Penske to replace the windshield again so I had another company (Ever Ready Auto Glass) replace it for me. Upon removal of the incorrectly and damaged Penske windshield the Ever Ready installer pointed out to me that there were tool marks left on my rear view mirror from the last install. Yet more damage to my vehicle from Penske Auto Glass. \n\nMY ADVICE IS TO STAY FAR AWAY FROM PENSKE AUTO GLASS.\n\nIn response to Lindsey C's comment from Penske.\n \nI asked and I sent them the estimate for the repair of the chip they put on my door for $511.38, I also asked them to replace the rear view mirror their installer damaged with tool marks and sent them a picture of that damage. Lastly I asked for just $250 for loss of income and my time since I have had to take hours of my own time to bring the car to be repaired, and for estimates as well as hours of additional time I have spent dealing with all of this nonsense that They Penske Rapid Repair has caused. \n\nI addition have emails from Penske stating that they had not and would not bill my insurance for  the bad windshield repair. Here is the then actual quote from Jan 2 2013 ( \"Geico has not and will not be billed for the work performed.\" ) as sent from Tabitha Wall, Operations Manager. \nYet they did bill Geico,  and were paid for the work they said they would not bill for.  \n\nSo much for being true to their word.\n\nFurther more Lindsay C from Penske in her comment stated \"We have refunded the entire amount for the work performed to his insurer \" , but as of today Feb 14th 2013 according to Geico they have not yet done so. \nAgain it seems that they have made another false statement of truth.\n\nLindsay C also makes this statement that they \"have politely declined repeated requests for monetary compensation for his dissatisfaction\" \nThe only single email request for compensation I have made was an email sent to Tabitha Wall at Penske to compensate me for the repair of my vehicle, that They Penske have damaged, and to recoup a small amount of money for all of the time I have had to take off, and spend rectifying the damage they caused to my car. I have not been unreasonable in any way. \n\nSo I paid for my new windshield out of my own pocket $952.19, and have yet to be reimbursed from my insurer because as my insurance company has informed me that they have yet to be reimbursed from Penske, and since they consider this a warranty issue because of the damage Penske admitted them they caused, they can not pay me until Penske pays them back. \n\nI also have recorded phone conversations with a Penske rep Tabitha Wall taking responsibly for my door chip, yet they have refused to pay for the repair, or provide me with a replacement rear view mirror. \n\nSo one should ask themselves this. \n\nWhat kind of business would damage your vehicle, admit that they did it, and then tell you that they would not bill your insurance , and then turn around and bill them anyway, Refuse to pay for the damage they caused, and then try to make you look like your the unreasonable one with a reply to your opinions and statement on yelp of what they Penske have been putting you through, and then also try to imply that they are perhaps the victim here and you are wrong. \n\nAnswer: Penske Rapid Repair. \n\nPENSKE RADIP REPAIR STOP YOUR NONSENSE, AND DO THE RIGHT THING AND PAY FOR MY REPAIRS FOR THE DAMAGE YOU CUASED TO MY CAR. \n\n\nI will post a link here soon to all the recored phone conversations, photo's and emails.","useful":7,"funny":2,"cool":0},
{"review_id":"10qINAoNNZfQqdFdeAOmNA","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"5HiBIzs8SDUE7rHF5rQqJA","stars":5,"date":"2013-02-08","text":"Had them replace a windshield in my vehicle that Penske Auto Glass screwed up. They took their time, were very professional, and did a great job. They also pointed out additional damage Penske Auto Glass did to my rearview mirror. \n\nYou want to defiantly use Ever-Ready for your Auto Glass they were Awesome","useful":0,"funny":0,"cool":0},
{"review_id":"oWe1Fps5GEer2Q6V39AE4A","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"ArmAaGCdCVAlkhdtaT6RzQ","stars":2,"date":"2014-10-10","text":"If you like a meatloaf burger then this is the place for you, but not for me. \n\nIts kinda pricey for what you get. \n\nAs far as flavor and taste nothing to rave about. \nService was ok also nothing to rave about. \n\nSo what are you to expect ? \n\nA burger packed so dense its like a brick meatloaf. Above average cost, with average Taste, Flavor, and Service.\n\nBottom line is you can do much better for the buck elsewhere.","useful":1,"funny":0,"cool":1},
{"review_id":"bmp0bNi0E6M2GeljDknr6Q","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"oPcWayqZRnMb2s7C9agCpw","stars":5,"date":"2012-12-03","text":"Took my vehicle there to get repaired on a relatives recommendation. They did a fantastic job on my repair and I just could not be happier. I would definitely recommend them to anyone.","useful":3,"funny":0,"cool":0},
{"review_id":"LdOaxR8kEoptqs531ifJ2w","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"9Cv6nCZ8v2jFMx-pbCwkzQ","stars":4,"date":"2013-09-26","text":"Never been before, gave it a shot and was not disappointed, Really good tasting burgers and fries, plus really good tasting onion rings, all at a good price.","useful":0,"funny":0,"cool":0},
{"review_id":"8TaA58-zPKuFaM3usBtAUA","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"SNJi8rgm_YUX2_iOcfDycw","stars":1,"date":"2015-08-16","text":"The smallest most expensive, barley average tasting pizza I ever had. \n\n$18 for a little small pie was a joke. They handed me this small box and I opened it up and I just started laughing. \n\nI think they should be a little less greedy and a little more humble on their pricing and portions.\n\nMy advise don't waste your time or your money. There are so many better pizza joints and this is just not one of them","useful":1,"funny":0,"cool":0},
{"review_id":"ZNE66BU3LGJoPTANYMRn5Q","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"v2tjswIV3e0c8o7_7MwYmg","stars":1,"date":"2013-11-25","text":"West Coast Pizza. Lot's of dough, no flavor that lays like a rock in your stomach. \nNever ever had a calzone that did not have Ricotta Cheese in it before. Here it is just lots of Dough, low quality Cheese and crappy Sauce. That is not a Calzone.\nThey must have been smoking the Mushrooms when they made this recipe and called it a Calzone.","useful":1,"funny":0,"cool":0},
{"review_id":"lkYiwbVnvZ2Uu3vI1CAUDw","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"5BKP0DY4K79h9sd7THpeBw","stars":1,"date":"2016-03-05","text":"So I call to order a Salad and some Meatballs for take out. \n\nWell for more than 45min I try to call, and at first no answer what so ever, just rings and rings, then it just starts going to voicemail immediately. I call and I call and I call. Nothing no one answer but voicemail\n\nI mean WT@, what kind of restaurant does not answer their phone during business hours. \n\nThe ironic and even sadder thing is that on their voicemail they tell you if your calling for takeout don't leave a message, call back and talk to someone to place your order. \n\nlol\n\nAre you kidding me! \n\nTalk to someone??? \n\nMaybe I would if someone would answer the phone. \n\nObviously they know this is an issue otherwise why leave that message about take out.\n\nI guess they just don't care\n\nSo I call my wife to tell her that I have been unable to get through, as she is already on her way  there because she naturally thought the order would have been placed by now, she tells me she will just place the order when she gets there. \n\nWell guess what?\n\nShe gets there to place the order and they tell her that it will be more than an hour wait. \nAn hour wait for Salad and Meatball's? \n\nWhat a JOKE! \n\nTell me how does it take an hour to make salad and stick some already cooked meatballs in a to-go container with some sauce and get you on your way???\n\nI WILL NEVER SPEND ANOTHER DIME IN THIS PLACE EVER. \n\nHAVE A NICE DAY! Lamp Pizzeria","useful":4,"funny":2,"cool":1},
{"review_id":"MciWYQbgIc3PDPow9tFlTA","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"ZfMUFpWaC-DHksEeJSYnAw","stars":1,"date":"2013-09-26","text":"I lived their for more than a year and I can tell you this, It;s noisy, dirty, dog poop everywhere, kids from the trailer park across the street where always riding their bikes in the hallways and running up and down them screaming. people always screaming or playing loud music in the middle of the night. Entry gates that break and take forever to get fixed. I could not tell you how many times cars parked outside got broken into also.  The grills never had any propane in them. Management was awful, and Mark Taylor is a joke. \n\nThere is so much more I could go on about, but let me just use this example to put it all in perspective. \n\nThe review from Scott M on this page, well you have to pay $25 extra for the trash pick up at your door and its not optional they make you pay for it, plus you also have to pay for the trash disposal fees on top of that.\n\nSo why would he leave that out of his review?\n\nWell maybe its because his wife Michelle M is the property manager for Pietra.\n\nAlso I found his review of Pietra when I followed his profile link from the one star review he made on Raintree Auto body in Scottsdale. \n\nA shop that did an awesome job on repairing my car, and a review that he gives that I believe as much as his review on Pietra.\n\n\n\n***Update*** \n\nThe only five star review made by Scott M, Who's wife is Pietra's property manager is now missing. Imagine that. \n\nSincerity Definition: the quality of being free from pretense, deceit, or hypocrisy\n\nYet Pietra's property Manager, and Mark Taylor employee Michelle M did not address the fact  that her Husband Scott M made a glowing 5 star review of Pietra were he compared Pietra to a resort. \n\nA clear violation of Yelps Content Guidelines as I listed the relevant section below.\n\n(Conflicts of interest: Your contributions should be unbiased and objective. For example, you shouldn't write reviews of your own business or employer, your friends' or relatives' business, or businesses in your networking group.)\n \nNo she instead thanked me for my feedback and then attempts to make one think that it is better, when little to nothing has changed besides new motors for the entry gates. \n\nI think yelp readers would rather have a sincere explanation and an apology instead. \n\nInstead she just ignored the issue, and then tried to provided more reasons why Pietra is so nice. \n\nTo me that says it all. \n\nNow\n\nAs far as a Security Patrol.\n\nWell Michelle M the property manager states \"we have made a lot of improvements here at Pietra.\"  in an attempt to make it sound like it is a new service, but that was there when I lived there, and is more of an on call service as they are not on property all night long. They were slow to respond and and almost never on property. \nThat would be the reason in Michelle M's response she states ( \"We have a courtesy patrol service that is AVAILABLE after hours\") \n\nAVAILABLE in that statement being the key word.\n\nSounds to me to be misleading.\n\nAs far as increasing the number of dog waste containers.\n\nBig deal as it does not change the fact that people still have to have the desire to clean up after their dogs, and management needs to do a better job in both enforcement and clean up. \n\nNow for what they call Valet Waste Disposal. \n\nMichelle M may have tried to make it look so affordable at just .83 cents per day in her response, but that still does not change the fact that they make you use the option for an additional $25 fee as you can not opt out. Plus again you still have an additional waste disposal feel as well to take the combined trash away in the dumpsters. \n\nOh and that reminds me about how so often the residents dirty smelly trash would get piled high up outside the dumpsters. It looked so nice every time you had to drive by it.\n\nBottom line is that my advice is to stay away from Pietra and any Mark Taylor managed property\n\n\nThese are of course my opinions based on my experiences with Mark Taylor and Pietra.","useful":15,"funny":2,"cool":0},
{"review_id":"gXDs791NaQ5FMSR9JkhOjA","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"QuYAh94UZzHuy9McaeovKg","stars":1,"date":"2016-11-07","text":"Had an Appointment with service to get my vehicle looked at. Talked to the service writer for less than sixty seconds and recorded the whole conversation. \n\nI explained the problem I was having with the car, he told me that since the car was lowered\/modified it would not be covered under warranty. \n\nThen as soon as he heard me say Magnuson-Moss Warranty Act and Attorney he walked away and told me he could no longer talk to me.\n \nSo let me explain the law. \n\nA dealer can not refuse to repair your vehicle under warranty without first inspecting and then proving that the modification itself caused the part to fail.\n \nIt is that simple and it is the law.\n \nLarry Miller Fiat Avondale never inspected the car, but rather just took the position that because it was modified it would not be covered under the warranty. \n\nA clear Violation of Federal Law 15 U.S.C.  2301.","useful":0,"funny":0,"cool":0},
{"review_id":"9RvaatwGG9Du_3FoOeOa3g","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"Kq2fw7SAKOLOmiJyVCbeFA","stars":5,"date":"2015-08-13","text":"Great happy hour menu, drinks and atmosphere. Had a Burger and I have to say it was very good, and only $8. Don't pass this place by. Definitely go check it out.","useful":1,"funny":0,"cool":0},
{"review_id":"ks-T3RZ_55l7HGz5MBlfMw","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"89Eqssb01O4-3-btGyvXoQ","stars":5,"date":"2013-11-25","text":"Awesome Greek food. Friendly staff and service, well priced and nice sized portions. Try the Greek Fries they are fantastic.","useful":0,"funny":0,"cool":0},
{"review_id":"iuJOQuX5On1vtIAmc3xqRw","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"7S5iOI5Xb9cTUQLmBwCeXw","stars":1,"date":"2013-09-26","text":"Terrible tasting Italian. You want to know why the Italian is skinny? because the food there is so bad even the italian won't eat it.","useful":0,"funny":0,"cool":0},
{"review_id":"o-VS5aGplPmzatDYFKAxTg","user_id":"Zj_jtU6B2d6rHaOE7LYmQA","business_id":"x4aHNNo1osWNCB75q_PijQ","stars":5,"date":"2015-08-16","text":"Always consistent, high quality, delicious pizza and service. Don't pass this place up.","useful":0,"funny":0,"cool":0},
{"review_id":"InwQt5_0IZvm5pubUsgkhQ","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"5kUA_k-ua1wO68jZ1Yo74Q","stars":4,"date":"2012-07-07","text":"Tamari is a great little restaurant: engaged, friendly service, generous wine servings,\ninteresting menu selections and wonderful execution.","useful":0,"funny":0,"cool":0},
{"review_id":"7sZilnGiYELtaTcFqWrf_A","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"pIDc5WPZGhFll6sE6nVvwg","stars":1,"date":"2010-12-22","text":"The pedicures at DeStefinos  are a complete rip-off. IMO\n\nWhen I booked the $53 pedicure, I was told\n(1) it would last an hour ,  and would\n(2) include  a foot massage   \n\nNot true:  the manicurist was done in 45 minutes.  and \nThe advertised  foot massage consisted of a quick rub of my feet and lower leg, finished in two minutes or less.  \n\nWhen the manicurist was done, I complained that\nmy feet were still rough.  \"You can't possibly expect your feet\nto be smooth after only one pedicure.\"\n\nExcuse me?  and why not?  Every other pedicure I've had\n(for much less money) got my feet smooth,","useful":3,"funny":0,"cool":0},
{"review_id":"4d3dpuQcB-XVnazXVwE-tw","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"pajvV_6xebKIE7GBh4Z1xA","stars":4,"date":"2010-11-27","text":"Braddock's American Brasserie is an attractively decorated restaurant, with good acoustics, a well-priced  menu and hearty portions.\nThree of us had  the salad topped with a good sized crab cake; \nthe side order of french fries was delicious!  the steak with frites also good.\n\nThe one downside: the wait staff worked hard but at times  seemed distracted or inexperienced, at one point  forgetting a plate and then  neglecting to ask if anyone wanted dessert or coffee before presenting the bill.","useful":0,"funny":0,"cool":0},
{"review_id":"zdbhtgDq2b6QUfrc_Zvz9Q","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"-aB6x1uPyKW-o11T8Ou2LQ","stars":5,"date":"2011-02-25","text":"The service and quality of work at Kinkos at 210 Grant Street, Pittsburgh \nis Excellent.  I emailed my order and Chrystina did a superb job of executing it.\nOn another job earlier in the week Justin also did a great job.","useful":0,"funny":0,"cool":0},
{"review_id":"ymZEp9PH6twJWsl1O6qefw","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"749lGtWM9PsrWonlVY4W2w","stars":2,"date":"2016-12-07","text":"Years ago I routinely went to Bangkok Balcony for lunch.  Food was delicious and well priced.  \nUnfortunately, If my meal today is any indicator,  Bangkok Balcony has gone to the dogs.\n\nMy luncheon special of noodles and pork with egg and some other things was more than disappointing.  From 1 to 10 (ten being the hottest) I asked for 7.   Now that's pretty hot, right?\nWell,  the meal not only wasn't hot,  it had no taste.  \n\nThe egg roll appetizer had been CRISPED to death.   It too had no flavor.   The soup was passable; it tasted just like Swanson's canned chicken broth.\n(I sent my meal back and we were not charged.)  \n\nI hate to see a formerly nice restaurant decline like this.  Hopefully the chef will right the situation and return Bangkok Balcony to its former glory.","useful":0,"funny":0,"cool":0},
{"review_id":"yz7HCX4IotIyv7OW_XiCVw","user_id":"yg_rVx7-vIuOFi3cVrb0QA","business_id":"Mv7N0bU56dhtoDP-m2JOow","stars":1,"date":"2010-10-04","text":"Dinner on Sunday night was a disaster.  \nThe  butter plates on our table were dirty. (yuck) \nBoth of the Moroccan lamb ravioli dishes arrived cold, twice!  \n\nThe lid on the coffee pot fell off and the waitress poured coffee on the table and on my husband's jacket.  No apologies,\nA bus boy dropped a huge tray of dirty dishes next to our table.   \n\nI would describe our dining experience as surreal.\nDoubt we'll ever return certainly not for dinner.  \nIMO management needs to better train the entire kitchen and dining room staff,  \n\n(The price of one of the ravioli dishes was taken off our bill,)","useful":0,"funny":0,"cool":0},
{"review_id":"mkpPY61kYCUMLF3hnPL-ow","user_id":"o9wX2MevcGKSDWW7kwShgw","business_id":"pTbkdBDDKxNVjKUZ_6RAug","stars":5,"date":"2016-11-19","text":"First time here. Can't believe we didn't know about this place until now. Very clean, very nice ambience and very friendly staff. Food is awesome with a lot of flavour. Their upside down pineapple cake and baklava are delicious!..  we are definitely coming back here to try the other menu items...","useful":0,"funny":0,"cool":0},
{"review_id":"c23NduULK0YxUdso2aYsXA","user_id":"o9wX2MevcGKSDWW7kwShgw","business_id":"Z0_qLqeFwOQGhBd_aC9s6w","stars":5,"date":"2016-09-25","text":"Food is excellent..  definitely one of the best Hakka restaurants in town...love the Bombay chicken, red beef with coconut curry, hakka chicken noodle..  you will be hooked!...","useful":0,"funny":0,"cool":0},
{"review_id":"fVeJYFAuj_-fWcA47Y7yOA","user_id":"64NjKz-9JQIqMJ7m6GSfTg","business_id":"evdJO0v9rvVixieNEnaeJg","stars":5,"date":"2017-01-17","text":"This is the best sushi in AZ.. I call it sugar fish because it's the only sushi that can even come close to sugy on LA","useful":0,"funny":0,"cool":0},
{"review_id":"RnzggBaciwQP_0__5zeQZg","user_id":"SEhhwkRlFwbXDa34MRsPPg","business_id":"APTiouqg0vmMznY_UoJ6MA","stars":5,"date":"2014-12-02","text":"Called them with some questions about their banners, and I got friendly and prompt service. Came in the next week, ordered 3 banners, and business was taken care of in a timely manner. The experience was well done.","useful":0,"funny":0,"cool":0},
{"review_id":"WBukCAP1wLKI0aGNeAZgqw","user_id":"d9Zh6WwADXXE4BxXkwC9Mw","business_id":"8UBOqmp97HzYB15PfKsChw","stars":5,"date":"2016-03-01","text":"Regina, Ala\nI flew all the way from Alabama to purchase  a 2014 Audi .  JASON my salesperson  was AWESOME picked my husband an I up from Airport  like Royalty an treated us like King an Queen services. Everything  I was told over the phone was true an honest price, miles, uniqueness an beautiful car.  It only took mins to sign  paper work ready.  He also  protect  an made sure my car was  safely kept until my transport picked it up.  Thank U Jason for an awesome  experience.  Go buy your car today from Jason. \nRegina Chambers","useful":0,"funny":0,"cool":0},
{"review_id":"psTArUh0hb4ut2_ievO5hQ","user_id":"_axI96Khutqsy4GSVuk6PA","business_id":"ebL8hN0iieaa3rClnDfLlw","stars":2,"date":"2017-11-23","text":"Love the food but hate the wait. I ordered the drunken noodles....it's been 30 minutes already and I was told at least 10 more. 40 minutes for 1 order is ridiculous! Higley location needs to get its act together.","useful":0,"funny":0,"cool":0},
{"review_id":"odJ6d_PqhZrXlDJJI-JWbA","user_id":"3UTVWyZPf6ad1i4hSRGkVA","business_id":"xzt1RgmcAgw3xkcxAAVJEw","stars":5,"date":"2017-09-03","text":"Cathy & the whole staff here are amazing!! They are super efficient & I have never had to wait, even with a walk in. My nails come out perfect every single time & the environment here is so friendly & welcoming. Cathy went away for a few months but since she's been back, I couldn't ask for a better experience! I highly recommend everyone check this place out! They also have a HUGE selection of colors to choose from!","useful":0,"funny":0,"cool":0},
{"review_id":"k2qD7aBJr29DQ2b4Uu6-qg","user_id":"GjRlnzDiqG1boQ1wSJbfLw","business_id":"0iqOSFmTNvANWyHVWZfAag","stars":1,"date":"2017-05-22","text":"I was a long time customer of MyPublisher before Shutterfly bought them and absorbed them, so I was more than willing to give Shutterfly a try. But I did have a number of questions about certain MyPublisher features that I was hoping Shutterfly would adopt. I have now tried and failed THREE times to get answers to my questions:\n\nAttempt #1: Questions submitted through Shutterfly customer service webpage. No response at all.\n\nAttempt #2: Live online chat with a pleasant person who had no idea what the answers were and no inclination to ask someone else.\n\nAttempt #3: Another submittal through the customer service webpage. It got automatically redirected to MyPublisher, whose response was \"We're not in business any more. Please contact Shutterfly.\"\n\nThree strikes and you're out. I will not be using Shutterfly for my photo books. Atrocious customer service.","useful":1,"funny":0,"cool":0},
{"review_id":"aoZfMGSWeFRWL6tw8Ur06w","user_id":"GkH6PveI0_lUgxy0m7rSgQ","business_id":"eoJfl5vG7X87QhcKb0nt5Q","stars":1,"date":"2015-09-22","text":"Sunday afternoon, around 4:30, I walked in with a group of 4 people.  We were sat right away by a very nice hostess. And we sat, and sat, and sat...for 15 mins we waited for a server that never came. We ended up walking out and heading home. I had high hopes for the Hofbrauhaus, and would have forgiven a wait if they had been packed, but the place was maybe 25% full. I don't know if I'll be in a hurry to head back.","useful":1,"funny":0,"cool":0},
{"review_id":"baxX0vwPfPyPucGHO5isbw","user_id":"GkH6PveI0_lUgxy0m7rSgQ","business_id":"-Eu04UHRqmGGyvYRDY8-tg","stars":5,"date":"2015-09-22","text":"The WSM is the crown jewel of Cleveland. A working market that is a must see for visitors and a must shop for local food lovers. All that makes Cleveland great can be found on the grounds of the WSM.","useful":0,"funny":0,"cool":0},
{"review_id":"XDcEKnQlJaLIAefgOXVa2w","user_id":"GkH6PveI0_lUgxy0m7rSgQ","business_id":"TbyDa8oe-RO68kGJRqGs1Q","stars":5,"date":"2016-09-21","text":"Kamm's Corner Auto Body was the preferred shop for repairs by the insurance company I was dealing with after my car was hit. Having never used them before I was nervous, but the work was done quickly and quality was top notch.  Where they really shine is customer service, though. They went above and beyond to make the process as painless as possible.","useful":1,"funny":1,"cool":1},
{"review_id":"p_8X3HfrDq_jiV9kE_FVKg","user_id":"GkH6PveI0_lUgxy0m7rSgQ","business_id":"hAN9gVT1a1i_YRdt74HapA","stars":3,"date":"2015-09-22","text":"Being a fan of sushi, I couldn't wait for this place to open. I've eaten there twice now, once in the restaurant and once ordering take away and I have to say the food is delicious. The sushi is anything but 'traditional', so if you're looking for the authentic sushi bar experience this isn't it. That said the rolls are large and flavorful, so there is value behind the higher than average per roll price. The drinks are also fun and inventive. The server on our visit was competent, and the food was brought in a timely fashion. I'd eat here again, though I prefer a more traditional take on sushi.\n\nOverall, I'm over the whole Nouveau Asian Fusion trend. But if Asian Fusion 2.0 is what you're looking for, Voodoo Tuna is the place for you!","useful":3,"funny":0,"cool":0},
{"review_id":"05l3rdB0DBViwAubq7LjoA","user_id":"LGhI86Z4yI4XvNe0HXi_jw","business_id":"ruFgApclJ4Mo3qEUwcklyA","stars":1,"date":"2014-02-13","text":"***WARNING***PLEASE RECONSIDER USING THIS COMPANY, THEY WILL RIP YOU OFF.  PROMISE TO REFUND PART OF YOUR MONEY AND NEVER DO. STEER CLEAR OF WEST COAST MOVERS OF LAS VEGAS.\n\nWe were looking to have a stress free move from Henderson, NV to North Carolina as promised by Britany at West Coast Movers in Las Vegas. What a disaster it turned out to be. Britany came out and did a walk thru estimate which we thought was a bit high but our least expensive estimate so we went with West Coast. She is a charming lady who makes you feel so at ease. Don't buy the act! The day of our move, the packers had very little to do since I had boxed and packed most everything. Britany had bragged about me doing all the hard work and so did the moving foreman, I think his name was TJ. Anyway, the packers could not speak a word of English, when you spoke to them they just smiled. TJ had to translate some of the important things that I wanted them to do. The furniture was wrapped real quickly and we thought fairly professional. TJ gave us papers to sign on all the inventory of our furniture and boxes and said that the price may change a little but it shouldn't be that much, that he had a pretty good eye about these things. What a joke! They won't actually give you an exact figure until everything is loaded on the truck so you are at their mercy. Once the truck was completely loaded the price of our move increased by $2300.00. I don't know about you but for us; we are on a fixed income, that was like slitting our throats. After finding out this new amount, we literally had to borrow money from others to be able to get our furniture across country to our new home. Cost up front is half by cash or personal check. At your destination, you must pay cash or Postal Money Order; which means you have to buy about 3 money orders because the post office doesn't sell money orders over $1000.00.\n\nWhen Britany took our deposit, she tells us that she would make certain that our furniture would arrive as close to our move in date as possible. When your furniture is already loaded on the truck, the foreman tells you it could take up to 5 weeks, no guarantee on the delivery date. Just another way of making your move more stressful.\n\nWe got to NC on the 21st of January. We stayed in a motel and at my sisters a few nights then tried sleeping on the floor at the new house. We called West Coast Movers for several days and left messages. No one called us back until finally I left an email message letting Britany know how unhappy we were with West Coast Movers. The truck driver called us and told us when we should expect them, then Britany called and wouldn't let me get a word in edgewise. I finally said would you please stop and let me talk. She was telling me that she was brought up right and that she wouldn't work for a company that she didn't believe in. Please!\n\nOur furniture arrived and even though our driveway is about 3-4 times the length of the tracker trailer, the driver said he couldn't bring it into our driveway. First that he couldn't get it in our driveway, second the DOT wouldn't allow him to bring it on our driveway that it might cause damage. His helper said we could sign a waver but the driver said no. He wanted to charge us extra to bring it up to the house. I told him we weren't paying an extra dime that it wasn't our fault that he couldn't and wouldn't park in our driveway. After getting heated over this, both myself and the driver, he said that they would carry the stuff 75 feet and drop it there and refused to go any farther. I told him that they weren't getting their money and he said you don't get your belongings. I called West Coast Movers in Nevada and spoke with Ashley who was really kind and seemed to care about our situation.  She spoke to the driver and asked that they wave the charge of  the extra steps to get to the house and move the contents into the house and set it up as we had paid for. The driver wasn't happy at all but they started to move the furniture and boxes into the house. As they began, I noticed how horribly packed the stuff was in the truck so I went out and started taking pictures. The driver immediately stopped working and called West Coast and said my husband was helping unload the truck and that I was taking pictures. Ashley called me after that conversation and said that wasn't acceptable and my husband needed to stop and wanted to know why I was taking pictures. I explained my reason and she said that they couldn't stop me from taking the pictures but not to worry, they were working to get us a refund on our move due to our experience being so unpleasant. Up to that point the experience with West Coast had been horrible and you would think it couldn't get any worse. It did! We had to sign the paper saying we received all our goods; which at that point we had no idea since it was about 9:00 at night and we were exhausted after such a long day.\n\nCan't finish too many characters for Yelp.","useful":6,"funny":0,"cool":0},
{"review_id":"6R3zAfGrei5-P8FI1m35Gw","user_id":"mrlXWowhUvkbb5hSPiC7ww","business_id":"jYF7PNnYcn3fWejv0ZE1-w","stars":4,"date":"2013-02-11","text":"excellent food, a little spendy. Don't sit in the tables next to the bar. The kitchen door open sand close conactantly","useful":0,"funny":0,"cool":0},
{"review_id":"c3KHm9JN4GMyc-sbmqBVBg","user_id":"mrlXWowhUvkbb5hSPiC7ww","business_id":"Y-hmtitiRfg7vmc3N-lTww","stars":5,"date":"2015-07-26","text":"No better place to dine. Owners are fantastic.  Food is top notch deserts are out of this world. Pork shanks tenderloin all very good.","useful":1,"funny":0,"cool":0},
{"review_id":"3sP63aA8UjH0MIgHoPGRyw","user_id":"h3NxyZxxNkm9AXR6hWotoA","business_id":"-6U5r96gk6gQJLgipOn1ug","stars":5,"date":"2016-06-15","text":"Best Toyota Dealer in the State!  2nd new Toyota For are family from Toyota of Surprise.  We make the drive because we love the staff and love the Service here.  Thank you Toyota of Surprise!!!!!","useful":0,"funny":0,"cool":0},
{"review_id":"pHQVDnwAX9ng97G55TdXPw","user_id":"QAbheAG078VDTisOZtrr6A","business_id":"iw9p7E4bMe1YW-APcFGjgQ","stars":1,"date":"2016-09-07","text":"Me and my girlfriend went to go eat there for lunch on a Wednesday. We sat down in the bar area. There was maybe 10 customers in the whole place. For about 7 to 10 min no one said hi, or anything. They made eye contact and would walk right by you. Just poor customer service. I could understand if it was busy but it was a ghost town and I could see the workers on there phone.","useful":2,"funny":0,"cool":0},
{"review_id":"Y0S3TVXpaMGujyc4ZgHJKA","user_id":"jeKOgYoqtPy3N1U9ZrTClQ","business_id":"fVbZptKCH2lIRS56M1zc6g","stars":1,"date":"2016-12-29","text":"I went to have buffet for lunch on Dec 28 .. there was nothing to eat.. so I was sitting there for 20 minutes and scrounging for leftover.  That's not a way to serve food when you are charging full money ! Left there disgusted and pissed with these people ! It shouldn't take 20 minutes to refill buffet ... poor and lousy service and very average food !!","useful":0,"funny":0,"cool":0},
{"review_id":"85FeUfVa83d_grARDlo3Rg","user_id":"rd6JBY8cici1_eim1bmIYQ","business_id":"dpoRtBwG02ETFm6gml9Pjg","stars":5,"date":"2015-11-19","text":"I was so thrilled with the service Caliber provided me with. Chris called me twice a week with updates as to what was going on with my vehicle. Which is great because I didn't have to wonder or go out of MY way to see what was going on. The girl at the front desk, Brandy, was also just a pleasure and delight to speak with. I would recommend Caliber to everyone I know. They really did an amazing job with my car and my peace of mind. Thank you again, guys!","useful":0,"funny":1,"cool":0},
{"review_id":"NwaIX49j2PFDCf4k1AalBA","user_id":"Dyu93s1LuLbJPx4VOim8JA","business_id":"e0CTLPxTnFEQSqQ1FJUqog","stars":1,"date":"2014-02-18","text":"Expedia was wrong, this location is not on site with the airport. I didn't mind, but it would have been nice to know that and not be surprised and confused after landing at LAS and wondering where the rental car co was.            \n\nPrice was quoted correctly, they do charge a $150 deposit, we're still waiting for it to be refunded. It's not just authorized, it's actually charged. The counter help was nice, George. \n\nWe had no problems until we left, I left my expensive sunglasses in a large case in the car; it was dark and there was no dome light in the car. We were rushed to catch the shuttle- I noticed my glasses were missing by the time were arrived at LAS. Luckily, we had time to catch more shuttles to return to Fox rental, where also luckily our car was still in the lot. Guess what? No glasses. We talked to the manager, who supposedly went and asked the car detailers, and they didn't have them. At this point we had to get on the shuttles AGAIN to catch our flight. The 1-800 number on the receipt is wrong- it doesn't connect anywhere. I googled and found another one, and had to call twice to get connected to a call center. After 3 passings around by operators, I got the HR office and left a message. \n2 days later (today) I received a call in the morning from HR who told me they didn't have them (duh). I'm certain a detailer took them. HR told me she'd call me back same day and didn't. \n\nI realize my mistake was misplacing them, but it's pretty obvious someone took them, and that disappoints me. Won't be using them next time we go to Vegas.\n\nETA: 10 days later and they never called me back. Lame.","useful":0,"funny":0,"cool":0},
{"review_id":"clK0H-4kwh4IJKgW3Ec6sA","user_id":"D8bik-vtH4fSS5WqquGz2A","business_id":"n5Bu0WBhCiQ5umCE5EzSjg","stars":1,"date":"2013-09-28","text":"I can't speak for the sales department, but the service deparment is horrible! I have never been treated the callus way in which I have been treated here in all my years owning a Mercedes. People are extremely rude and the only smiling face you will ever see is the guy standing outside, who really has nothing to do with the service itself. If I could give it negative stars I would.","useful":5,"funny":1,"cool":1},
{"review_id":"Q4MHGm6igYECKgqov5Qqgw","user_id":"V4OwsnGh-zUL8shILhl-DA","business_id":"vNQkym5qZ-E-4AJ4IQ5JEg","stars":5,"date":"2013-03-19","text":"Had dinner last night.  Amazing flavors, the sauces are wonderful.  Like the other reviews, a wonderful dining experience.  A little pricey, but well worth it.  Be prepared for large portions.  The staff is super friendly and well informed.  Nothing here is \"normal\".  It is truly a unique Italian dining experience.","useful":0,"funny":0,"cool":0},
{"review_id":"opvlf3l6s2f2bENVXKnpDQ","user_id":"Y1uhdl_dmBPgXUAif_jW3A","business_id":"uaFhlzoJbiqlnkUgfSjpdA","stars":1,"date":"2015-08-13","text":"Fuck the place because their food is like sheet it looks like they make white their feet and the costumer service is so bad that they took like 25:00 mint to take the food","useful":4,"funny":0,"cool":0},
{"review_id":"1SI6F7EJbdugcib6HF8rew","user_id":"Ef1CzdDxyiwehq_y762wzw","business_id":"GmABUMBJOAxQz4BFaCP2UQ","stars":5,"date":"2012-09-05","text":"I moved to Vegas from a city that had amazing public transportation and even though I had a valid license, I had not legitimately been behind the wheel of a car more than five times.  I called Rich after my first panic attack behind the wheel and he signed me up for the six hour course.  He was cheering me on the whole time, keeping me relaxed, while also pointing out things to be aware of in my surroundings.  Just two months later I have purchased my  own car and I love driving everywhere.  Thanks Rich!  This really changed my life.","useful":4,"funny":0,"cool":0},
{"review_id":"K9DzB1FtsAFCpWeIaHzGlA","user_id":"4pdKpqnqWcbaJY4nF48jPw","business_id":"3N9U549Zse8UP-MwKZAjAQ","stars":2,"date":"2017-02-26","text":"First time to the Market. It was ok. I would have rated this higher except for a couple of glitches. Wife & I shared the sausage pizza, roasted beet salad, I added a cup of minestrone and we had a couple of beers. The soup came out first, per my request. Good with a bit of pesto on top, just not hot enough. I would say it was lukewarm. The roasted beet salad was great. Nothing wrong there. I was surprised and frankly disappointed with the pizza. It looked great, tasted good, but the crust was soft. I was expecting a crust with a crunch, not the soft crust that I got. Maybe that is how the crust comes out of their oven, but with a 900 degree wood fired oven I have always gotten a crunch on the crust. \nP.S. Make sure your pizza cook wears his gloves when handling ready to eat food","useful":0,"funny":0,"cool":0},
{"review_id":"WcuaPvPwU119VsFPGPGmFQ","user_id":"4pdKpqnqWcbaJY4nF48jPw","business_id":"4p6Wce7Ed707QS2-yQkvZw","stars":2,"date":"2016-03-27","text":"Second visit. First time in was during happy hour. Ordered off the happy hour menu and was very pleased with the entire visit and I would have given 4 stars at that time. Today was a different story. Had to wait 10 minutes for a table, ok if busy, but restaraunt was basically empty, but was told we had to wait to see if people who made reservations would show up. Finally seated and were given water by a waitress who was over the top perky. I appreciate upbeat people, but dont talk to me like I am a child at the doctors office, you come off as fake and irritating. Two of the water glasses had black stuff at the bottom. Showed to waitress she commented that it was probably fruit flies. It looked like cracked black pepper or small bits of charcoal to me. Glasses were removed.\nFood was ordered and arrived in a short amount of time. Appetizers were ok, but the dipping sauce for both the pretzles and chips were  bland..Ordered a firebrand chicken sandwich, was told the the bread was a flatbread, their version of pita bread. Turned out that it was served on a pretzle bread\/roll, which tasted ok, just not what was advertised. I had their black angus burger. Dissapointing to say the least. The smallest 1\/3 pound burger I have ever seen. Small plain bun, two pickle chips, two limp red onion rings, no lettuce or tomato, and a petite amount of ketchup that was not enough for the burger, let alone the fries. Asked for more ketchup and mustard, another petite portion arrived. I am a big boy, I can handle a ketchup bottle, I promise not to waste or make a mess. The flavor of the burger was the dealbreaker. It had a intense chemical taste, at first I thought a gas grill flavor, but the more I ate the more it tasted like charcoal lighter fluid.I did not finish. \nI have no problem paying top dollar for my food, but I expect to get what I pay for. (see Becketts Table) I will be back for half price happy hour food , but will likely not be ordering off the full price menu again","useful":0,"funny":0,"cool":0},
{"review_id":"8_z_y8wKjUFKWhuJOo7g7w","user_id":"4pdKpqnqWcbaJY4nF48jPw","business_id":"6g-ufVkF3gQjqfBjEzWPJw","stars":2,"date":"2017-02-26","text":"Went in to the store for the 1st time last night. Ordered the two board specials, 1\/2 slab & two sides and pulled pork sammy with one side. First thing I noticed were the extremely dirty heat lamps over the meat station. Not good. Ordered beans and mac and cheese for the sides. Sorry, but we are out of both, almost closing time. The person in charge handled things as well as he could, he comped the entire meal. That being said, the meats were just ok. Bottom line, better choices out there. I wont be back.","useful":1,"funny":0,"cool":0},
{"review_id":"oqsWaME5_re2RcZRStGHMg","user_id":"B2lrahV2Xq3BP0_pdxRNJw","business_id":"9yESUcIVarhYEabIMj844Q","stars":5,"date":"2017-04-11","text":"I have been visiting Culinary Dropout on 7th Street for a few years now and absolutely love the restaurant, food, staff, and overall atmosphere. The food is always spot on; very fresh, made in house, and their main entrees are definitely my favorite part of the menu. Whether I sit at the bar with or sit at a table I always receive great service, both in and outside of peak rush hours. Their happy hour has great specials both for drinks and food but their regular menu has great pricing as well for the quality and quantity that you receive. \n\nI have made friends with several servers and bartenders while visiting: William, Jeffrey, Wyatt, and Chase are the best in business and I won't sit anywhere else except in their sections or at the bar while they are working. They always go above and beyond to take care of me as a regular and I enjoy watching them interact and entertain heir first time customers as well.\n\nThis is one of my favorite restaurants to hang out at and I hope everyone gets to experience the same wonderful atmosphere and customer service that I do!","useful":0,"funny":0,"cool":0},
{"review_id":"G2Lqui-MtHA5UTGd6aAUxA","user_id":"2JmJwurQvDAwnU41WJ8VwQ","business_id":"OC3PUomMpn_QisIM1H-7Wg","stars":1,"date":"2015-12-10","text":"I will never shop here!!!! Their mark up is 75%!!! They offered me less then 20 dollars for a Barbie dream house a riding truck, and many very good shaped toys!!! Take your business elsewhere. I've been a shopper here for years! Not anymore!!!","useful":0,"funny":0,"cool":0},
{"review_id":"Qjp4wY2YRxYfILGNJLe_sA","user_id":"6Frid_WIiDszcp85qP9Yeg","business_id":"4Z2fwlNilt04OMVCjLkhPw","stars":5,"date":"2017-05-24","text":"We have used Gibson air for all our HVAC needs in the condos we own in Las Vegas. Our latest experience today with their tech Paul reinforced our already high opinion of this company. As always their tech was prompt, professional and courteous. There is no reason to use anyone else but Gibson for your air conditioning needs.\n\nJanet & Mike V.","useful":0,"funny":0,"cool":0},
{"review_id":"P0oFc2uBn8uMHwZ05Sps8Q","user_id":"CKgtZjD-rDiyKIyiH1puOQ","business_id":"GOEfVyMMcIrcdXxfLUo_5w","stars":1,"date":"2017-07-27","text":"I'm so livid about this companies inability to properly schedule a service call, I could only imagine what their quality of work would be like. I would highly discourage anyone from using them and I'm going to call my home warranty company and make sure they take them off as a recommended service provider. I put in an emergency service request on Friday, I had to call their office to follow up on even getting an appointment. Wednesday was the earliest they could schedule me. I set up the appointment for 2p-6p. Wednesday comes and I get a text at 7:53a saying the tech is on his way to my house and will be there in 24 minutes. I'm FURIOUS because I don't have a way to get to my house in that amount of time. I send my mom over, she gets to my house at 8:20 and there is already a note on my door saying that we need to reschedule because no one was home. It was time stamped for 8:07. I tried calling the company at 8:25 15 times and I only got voicemail. They never returned my call. DO NOT USE THEM!!!","useful":9,"funny":1,"cool":0},
{"review_id":"V0WIzvlZja7AVOCj4uTn1w","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"EU3DE9JD5kFcgchB_P4LNw","stars":5,"date":"2014-11-16","text":"I just wanted to take a moment to write a review for Alan and Kevin. We went into the store to look for a bed after having a sleep number and returning it. This was a wonderful experience compared to anything we have ever encountered. The \"sales\" associates were very personable, relatable, knowledgable, and honest. My boyfriend and I mostly dealt with Alan, but they were both wonderful. We let them know our price, and they steered us to things that were only in that price range and helped us to pick the best one while giving us the space we needed. Buying a bed as a couple can be confusing and stressful at times especially with a sales person breathing down your back so it was wonderful that were given flexibility and privacy. We got to know our sales person on a very personal level and spent about two hours making a decision  and never once felt rushed or pressured. It was seriously one of the best experiences we ever had especially because we are often overly critical. We love our bed and will never forget the experience we had with the Best Mattress Centennial team especially Alan. He gave us respect, and we will always trust him for that. We are even considering returning for our guest bedroom. We are grateful for the courtesy he gave us as well as helping with the price and the bed frame.","useful":0,"funny":0,"cool":0},
{"review_id":"hDzUilNU09rbn00Ua5q_IA","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"NuT1ejKruFnBFQWC6Xg82w","stars":5,"date":"2016-04-01","text":"We have went to several Papa Murphy's around the valley, but this one by far has the best service. The staff was friendly and fast. The manager even shook our hands and thanked us for our service. It was very clean and all ingredients were fresh. They even gave us new coupons to replace the ones we just used. We will never go to another Papa Murphy's again.","useful":1,"funny":0,"cool":0},
{"review_id":"E_74QTG8v7ESMCVVsmVEcg","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"nF1-0uiqIS_c9J6RtJGnKw","stars":5,"date":"2014-06-14","text":"I took my little cousin for her first tattoo as well as one for myself this Friday the 13th. They had the biggest selection and not a terrible wait time.\nThe whole shop was busy and all the artists were in a great mood even on a day that can be a bit stressful and a cut in pay for them. Daniel San was our tattoo artist. He was very professional, and had a beautiful machine! I even asked him to rework a little area and he did without hesitation or complaint. Our work is perfect for my 11th and her first!! \nMy cousin and I are very happy with the experience we had there as well as with our tattoos. I will definitely be returning for custom work. Thanks again Living Dead and Daniel.","useful":0,"funny":0,"cool":0},
{"review_id":"vfVoNi_hEEYaJyUGvXhQBw","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"e7MJ8xgzWv74zQQanREZkw","stars":1,"date":"2013-05-09","text":"If I could give the Smoke Ranch location a negative 5 I would. I could not believe the service I received there. The office staff was completely unprofessional. They mocked my mother as she stepped outside to take a phone call. When I complained that they would behave in such a way, they moved my chart to the back. In doing so, I had to wait for two additional people to go in front of me resulting in an over 45 minute wait until they decided to move my chart back to the front. And to top it all off, when I called back to ask about a referral that was supposedly sent (the other office has no record of the referral) the receptionist very rudely and with a raised voice said \"that department is closed for the day\" and then proceeded to hang up on me. This was at 4pm. The office does not close until 5.\n\nDr. Sikand and Ear Nose and Throat Consultants of Nevada should be ASHAMED at the quality of people they have working for them. It is a disgrace. I cannot believe it.\n\n\nPlease do not EVER go to the Smoke Ranch location. Save yourself the trouble!","useful":2,"funny":0,"cool":0},
{"review_id":"fr_mgu6so_IkL0s-bXADgg","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"xrBQKZbhJMCtaZxeJ0tzTQ","stars":3,"date":"2014-07-31","text":"The sushi was awesome we tried the Philadelphia, Rainbow, flying Jason, and black jack roll. All were great. The only reason they got a three is halfway through all of the waiters in the entire restaurant disappeared for 15 minutes. The sushi chef finally called them after we looked around several times. Also the waitress was very rushed and pushy when taking\/waiting for your order but then never comes back. Go for good sushi, not service.","useful":0,"funny":0,"cool":0},
{"review_id":"40ilXPkiJZDRawqWfbvzWg","user_id":"umd0lZaX5-NQTYcCKN3otA","business_id":"N6MzDoao6s68nAIW8vS9dQ","stars":5,"date":"2015-09-14","text":"We love their Hawaiian Pizza. Its nothing like any other pizza place. Their delivery time is somewhat lengthy but that is my only complaint.","useful":0,"funny":0,"cool":0},
{"review_id":"vadOpmDlESyIex1ErcuJZA","user_id":"U7BvTZXJt25hogl0Xdpvzg","business_id":"HmeRzfULqmvcx_3TRe_tBw","stars":2,"date":"2017-04-21","text":"Food is really good but wouldn't recommend on take out orders for they're smaller portions than dining in","useful":1,"funny":0,"cool":0},
{"review_id":"cwXO_qsCJuLvGF-IhusEdg","user_id":"yKH8YAom8gsIuQpBFqopnQ","business_id":"A4r4hnmJTeTlTjFlV6vnkQ","stars":1,"date":"2016-06-03","text":"\"Paperthin walls, creaky halls, towel rack falling off wall, no sleep!\"\n\n1 of 5 stars Reviewed 3 weeks ago   \n\nThis place is horrible. They upgraded the lobby floors for photos and so people would not turn around running while checking in. You can hear everything- even when the neighbors are talking normal levels. You hear the reception phone ring- every time. The lobby TV like it is in your room. Old towels were in our bathroom upon arrival with hair on them. The towel rack was coming out of the wall. The hallways creaked and the second floor was just as bad. We could not get any sleep and had to travel the next day so we checkout out after 3 hours and drove downtown to another hotel. Being backed by WYNDHAM as they advertise is false advertising- being a DAYS INN is false advertising for this dump. For $100 a night...The place needs to be condemned. \n\n\nStayed April 2016\n\n*UPDATE:  I sent a demand letter for a refund. I got a call from the manager who said that she would refund my money IF I took down my review on Trip Advisor.  I asked her if she received my certified mail yet regarding a refund, she said no.  I told her I would speak with her when she does.  3 weeks later and after a few emails and phone calls, they decided to not honor the demand letter... but yet, would have refunded my money to not publically share my experience.  I say this, to properly inform the public about this place is worth the loss of a refund.\n\nhttps:\/\/www.tripadvisor.com\/ShowUserReviews-g50532-d122185-r371771517-Days_Inn_Cleveland_Lakewood-Lakewood_Ohio.html#","useful":0,"funny":0,"cool":0},
{"review_id":"glFOksU2tfqbs31pwy91hQ","user_id":"-vT2vrqtBSWE64P6S2kCFw","business_id":"lTTMoqmGr3QQX9ne7CxuaA","stars":1,"date":"2014-10-22","text":"Run the other way, not only do they do a crummy job, they won't honor prepaid coupons after Dec 31st. As we spend 6 months in the US, I ,m out $120, they can't wash cars properly and have no idea of honesty or service, great location, other than that, FUBAR","useful":1,"funny":0,"cool":0},
{"review_id":"lUMy8X1BShdlvDlkG4sF7w","user_id":"-vT2vrqtBSWE64P6S2kCFw","business_id":"0Zxeuxnutzsfe6V_VC5-wQ","stars":5,"date":"2015-07-31","text":"Just got my car back today and wanted to express how pleased I was with the service and results.\nCraig is a joy to deal with, a man of his word ( uses them sparingly!), the repairs were done on time and on estimate, he also kept me current with how the work was going.\nIn a world where I really hate having to deal with service providers, must say this was an exceptionally good encounter, would highly recommend you check them out, save yourself a lot of grief and worry!","useful":0,"funny":0,"cool":0},
{"review_id":"WZ1cZzg4RQ19h4Yyi8dS1A","user_id":"-vT2vrqtBSWE64P6S2kCFw","business_id":"xmJPKzn8ANMHV_ojFn5Kpw","stars":5,"date":"2014-06-29","text":"Really impressed, came in, fixed all our PC problems, got us some new equipment in less than a week, got it all up and running as well. Friendly, professional, easy going and doesn't,make you feel like you're an idiot!","useful":2,"funny":1,"cool":0},
{"review_id":"ha3Mfd2hsFkmODene7scBg","user_id":"iDCdxSBFG_xWREah4uvc3A","business_id":"fFClJbyFz-_Edv9lNy6fkQ","stars":1,"date":"2015-09-11","text":"Please do not go to this place it took all my money $3k and totally didnt fix my problem and still kept asking me to pay more. here my story to tell guy named tony took my car in shop and ask me bout $3k too repair the rear damage and coolant system. after it my car been repaired same day I picked up my car the coolant level light popped out I took back to the autospec they said no problem you can still drive everywhere if I listen to him and drive I b dying now. this place is completely bullshit overpriced mindgame playing. he even ask me another $500 to fix the coolant system since he made a wrong decision to replace the water bump?not even sure he replaced it or just say so?\nnever leave your car here to repair well if you still think here is the place to repair your car good luck my friend. take your car to another place will be a better choice.","useful":1,"funny":0,"cool":0},
{"review_id":"AHPWBbpXih8LpgxHezDBQg","user_id":"69kPGynD2-RD0Tk1FEgBhA","business_id":"zDKH2ua2DauqiWOAP9yz7g","stars":4,"date":"2015-10-24","text":"We came up from Florida to visit our friends here in Fort Mill. So of course when visiting another state we like to venture out from your normal chain restaurants. Did a little research, and the reviews were awesome so we decided to give it a shot. An low and behold it was fantastic, I did build your own burger and my husband did the T-Money; both burgers were phenomenal! The staff and environment were perfect!","useful":0,"funny":0,"cool":0},
{"review_id":"kQuX1VN7hmDkro_lNkgiOQ","user_id":"Q0eTSJUMNGCQL6Ihg5C8CQ","business_id":"Qm4YxHnCPH5zc0kLjwSoCA","stars":1,"date":"2014-08-01","text":"There is no one to greet you at the front and no one to seat you unless you insist on being seated. This is probably due to the fact that they are absolutely understaffed with one person working the tables, front etc. Once seated we were not even served water, absolutely nothing until we asked ourselves to order. I feel bad for the one waitress who has to do everything so it is not her fault, just unbelievable they have one person doing everything. Once we ordered we did not receive drinks until we once again asked for them,  or appetizers for 30  minutes. #1 rule = food quality is irrelevant with horrible service. I really hope this place gets it together because it's in a great location and looks great as well. Honestly worst service I have ever seen.","useful":0,"funny":0,"cool":0},
{"review_id":"yKu7ZQ9AhYpPYBzIH6vRCA","user_id":"f2q8B7L-t82SvQyqVvfPdA","business_id":"rUfZp5C_j7NxQZxrjyMrvQ","stars":5,"date":"2013-01-13","text":"A halmark of delicious mexican food, if you haven't had it, you owe it to yourself to try try it!!","useful":0,"funny":0,"cool":0},
{"review_id":"KDQjG_YrMaHweMWED0eRcA","user_id":"f2q8B7L-t82SvQyqVvfPdA","business_id":"6_lNZXYsz0SIOakNyBF0zQ","stars":5,"date":"2013-01-13","text":"love this place, lots of love for the owner. very chill atmosphere, very cool, I hope they keep it open!","useful":0,"funny":0,"cool":0},
{"review_id":"cG_TzBCzMydBfdsx0FKsfg","user_id":"f2q8B7L-t82SvQyqVvfPdA","business_id":"drIFrAyZnyismS1ArZlmAg","stars":4,"date":"2013-01-13","text":"pretty good vegetarian food, though I wish they'd expand their menu to more natural foods as that goes hand it hand for me in regard to eating healthy.\n\noverall though, I'd recommend em","useful":0,"funny":0,"cool":0},
{"review_id":"tds6EOI7AB1z5PDLjRHasQ","user_id":"f2q8B7L-t82SvQyqVvfPdA","business_id":"A3uAsxaZ0w-9A2r99Q5FpQ","stars":5,"date":"2013-09-19","text":"I Brought in some shorts to be altered here- the owner is a sweetheart, was accommodating and nice.\nNot to mention she's located close to ASU so it's great for students like me to get any thing done they need to their clothes.\n\nThe most important thing- good vibes.\n\nIgnore the negative reviews- I'm sure if they were in even a slightly good mood they would appreciate the obvious experience and welcomingness of the store - not to mention I'm sure the owner would have fixed anything had they simply kindly asked.\n\n\nThank you ill be back for my alteration needs!","useful":4,"funny":1,"cool":2},
{"review_id":"iGUCAUAU69zjFdnNJif0ow","user_id":"yy7mJh2iuDZeUmJBjVTLww","business_id":"0mM_smCpKeKaL0MPMKOLFg","stars":1,"date":"2015-03-15","text":"Terrible service\n\nCame in with a group and most of the people at my table were done eating before I even got my food. Then I had to eat alone while 7 people stared awkwardly at me.\n\nWould not recommend.","useful":0,"funny":1,"cool":0},
{"review_id":"59KXwR424VU4aECkfRUC4A","user_id":"yy7mJh2iuDZeUmJBjVTLww","business_id":"mBOIef7a4hONEbSi_ai8Bw","stars":3,"date":"2014-05-23","text":"The food is great, the prices are great, BUT there's a serious ventilation issue.\n\nI've been here twice and If you eat here prepare to launder \/ wash \/ dry clean everything you own because its going to smell like a deep fryer. And you wont be able to just air it out either, it's going to need a full wash. \n\nLeave your suits and dresses at home people.\n\nAs always, when it comes to $1 oysters, expect many shell fragments =(","useful":0,"funny":0,"cool":0},
{"review_id":"NBXdfpCbfCTmyUlmQ9y4vg","user_id":"yy7mJh2iuDZeUmJBjVTLww","business_id":"ki-RGkYGJNJSzXsZIPyobA","stars":1,"date":"2014-05-23","text":"The staff here is extremely snooty and unhelpful. \n\nI came here looking for a retirement gift for my dad from my family and was pretty put off by the pretentiousness that I just left without getting what I was looking for. \n\nI mean you are goddamn sales people! Not CEOs. Don't act like you don't have time to talk to me because I'm not wearing a three piece suit. \n\nWhile I was there I asked if they do repair work on lower end watches and their staff said \"NO. you go to SEARS!\" \n\nYeah, that actually happened.","useful":3,"funny":0,"cool":0},
{"review_id":"Af2-e7TYVa6PDlpwxV-qrw","user_id":"yy7mJh2iuDZeUmJBjVTLww","business_id":"0XZkaHXjxHAhJc_jPtoJCA","stars":1,"date":"2014-05-23","text":"I went here for brunch. The food was decent but the service was the worst I've ever had. \n\nThey forgot half the things we ordered. \n\nThe server never showed up again after taking our order so we had to flag down the food runner to let him know what was missing and he came back with our bill 20 minutes later.","useful":0,"funny":0,"cool":0},
{"review_id":"No2VnDhAtf70gS-6RPkgrg","user_id":"yy7mJh2iuDZeUmJBjVTLww","business_id":"z5ilKN0dw-q6GL5ha8jkJg","stars":5,"date":"2014-09-11","text":"This place is definitely one of the most unique sushi places in Toronto. \n\nIt's a bit pricier than other places but you get what you pay for. Everything was well prepared, well presented, and delicious. \n\nI especially liked the steak sushi, lobster roll, and beef short rib. \n\nIf you're tired of those rancid cream cheese rolls at pretty much every other sushi place, check this one out.","useful":3,"funny":0,"cool":0},
{"review_id":"wDtDo9EN4se1t1wdKCLm9Q","user_id":"3bWo03mZTFfR1ubkjFifkA","business_id":"Aeg__6qMf9-1Fo7TZ1RkHA","stars":1,"date":"2016-12-18","text":"Not a great place for game day. Don't hire enough waitresses. Ashly works her ass off. Drinks run empty and over hour wait for food. Group of 7 and all got meal delivered at different times 45 minutes apart.   Owner doesn't appreciate Sunday business enough to show up. Losing ton of money not serving drinks and no more repeat business.","useful":1,"funny":0,"cool":0},
{"review_id":"7BLLcMV9sgKIYwvyq7etbw","user_id":"Npnq8-Y2RbDemDiA-VlDuQ","business_id":"_OHKWBpmnQPTL3LouExL7g","stars":5,"date":"2017-02-02","text":"My friend and I went to the show and absolutely loved it. I was not familiar with Matt Franco before the show and never thought of myself as a person who enjoys magic shows. Matt shares his story which is inspiring and reminds us that dreams do come true. His tricks were very entertaining and we laughed a lot. Thanks Matt for a great night out!","useful":0,"funny":0,"cool":0},
{"review_id":"93kyt2u2WbfTzjZWaOV_HA","user_id":"J_FU9nbqkuOoqkoZrB6ZGw","business_id":"VH_3-FUgJwOptryFLtj3tQ","stars":5,"date":"2016-04-29","text":"This is the cleanest looking Lee's liquor in the area, especially compared to the Craig and Rancho store. They have a huge beer cooler with more craft beers than I can even count and a decent sized selection of wine compared to many of the other locations around town. The staff here is excellent and he management has gone out of their way to brig in a case or two of special orders for myself and other people I've seen there. Plus this place is cheaper than smiths right next door to it, so it's a no brainier to shop here for all your alcohol needs!!","useful":0,"funny":0,"cool":0},
{"review_id":"Z52LqG6R9rkDXoVkj47xSA","user_id":"J_FU9nbqkuOoqkoZrB6ZGw","business_id":"N8D-5-fW7EkBdKjNYGhu0A","stars":5,"date":"2016-03-01","text":"Best tapas spot in Vegas. Just go. Enjoy. I've gone about ten times now and I have never had bad service or a bad dish there. The prosciutto with fig jam is amazing. Crab cakes are bomb. Plus if you sit on the patio outside the seclusion adds a nice effect to the meal. Perfect for date night. Don't change a thing guys.","useful":0,"funny":0,"cool":0}]