[{"review_id":"FCv2iSM3EH6NQO66lo8Akw","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"tIX6o1jkLrrmsJIdGUjA5A","stars":5,"date":"2012-07-02","text":"Couldn't be happier with their work or prices. Just got my car done and will definitely be going back for my windshield and my wife's car.","useful":2,"funny":0,"cool":1},
{"review_id":"zB9EmI-TPfEqREzo7SUMXw","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"J0rx5BsejdRTXU8UB-MJSA","stars":3,"date":"2014-01-14","text":"If you are after food court quality pizza than this is the place to go. They have other options outside of pizza which I don't have an opinion on as I only tries the pizza, but I can't imagine the quality to be much higher. Interior is hot and not very clean.","useful":1,"funny":0,"cool":0},
{"review_id":"PY50T_1QFBAbnW4FmyZpSA","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"ak0_aSHZEPdRkpAAtyzrAw","stars":5,"date":"2014-01-14","text":"Installation was exceptional, as was the customer service. I often find it difficult trusting my home to anyone, but the way the handle themselves, understand their product and offer advice put me at ease. I would recommend their services to anyone in need of quality work and products.","useful":0,"funny":0,"cool":0},
{"review_id":"i99Mxi3y1H_cRQuDbr95Zw","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"D3tXmFzqLD3mGzYnp5vp7w","stars":4,"date":"2014-01-14","text":"Wasn't expecting anything spectacular here, but I was pleasantly surprised. It's a build your own roll place with pretty good quality. With the selections you can only produce the rolls you may find in a grocery store, but at a better price. Definitely a great quick meal place.","useful":1,"funny":0,"cool":0},
{"review_id":"xbs8OeAAzFQCzIuIYHDrng","user_id":"2hESE1gvZl3Ttqc5zFmkcg","business_id":"Gd2OE3FIWzv5boI99bM6Iw","stars":3,"date":"2014-05-12","text":"Attempted to enjoy this restaurant twice when it was Extreme Sushi and was disappointed both times. With the change in ownership and name I thought it was time to try again. I had high hopes, but again they were not met. The service was ok, but nothing exceptional. The selection on the menu was good, but the actual food was disappointing. The rolls were creative, but piece size and ingredient distribution were inconsistent. The Sushi pieces were small and the rice didn't hold together. Maybe I set my expectations too high, but I expect perfection when it comes to sushi and only one place has met that expectation... Kobe Sushi on the 215 and Rainbow.","useful":2,"funny":2,"cool":3},
{"review_id":"SeJ1iqA7rXSbJ6WNCUQrQQ","user_id":"xaPm1Ng9wGnw02jzfRntTA","business_id":"fI9ErCUGY8rXRPBbatcxMA","stars":4,"date":"2017-04-18","text":"A little pricey but definitely great\/interesting food.  They especially found great options for me during pregnancy.  Great location for a foodie experience.","useful":0,"funny":0,"cool":0},
{"review_id":"PvamFfV7mLdP9QLLqD4RPQ","user_id":"OZVNK0138TFXmXLSpcPclQ","business_id":"wWhq9cKLCrZHcp-ezp-hPQ","stars":5,"date":"2017-04-02","text":"Everyone who loves music, and especially exploring other cultures through their music, should set aside a half day to visit this Treasure, with a capital \"T\".  THEN, plan on coming back again, because you just can't experience all this museum has to offer during one trip.","useful":0,"funny":0,"cool":0},
{"review_id":"2zH8mmlmBMD6zd5O3Np8lg","user_id":"4zRsDqF-gASVB3-dEWDo7A","business_id":"Ht-_i0UAq7YDBaqJwcQMdQ","stars":5,"date":"2009-02-11","text":"Expensive ($90 CDN per head), but really well executed french food. I especially liked my foie gras poêlé. See photos.\n\nDon't know if I can call this place romantic. It was dark, alright...\n\nHaven't had much french food that can quite compare, but I live 3000 miles away (cry)","useful":1,"funny":0,"cool":0},
{"review_id":"0cHY_VQuKyFwZOACkL6H8Q","user_id":"YXgQTLAt2jIpdVHTW94txg","business_id":"_dU7qM44fhBNNwWbMNoxxQ","stars":5,"date":"2013-09-25","text":"I am so thankful to have found this great mover. Jim is great and so are their men. They were on time, early in fact and provided fast service and at great prices. Moving is so stressful but they made the experience a breeze. I will definitely use them again.\nThanks so much","useful":0,"funny":0,"cool":0},
{"review_id":"tk1Bf8JozJV-amySJ18MGg","user_id":"YXgQTLAt2jIpdVHTW94txg","business_id":"Omxh9YOmShTHfXn5EBRxdw","stars":1,"date":"2013-08-12","text":"the owner who took over this business was so rude I would never do business with them. After having consigned about about 20 items with the original owner, whom I was very satisfied with, she was so awful to work with. I had a few items left that had not sold including my dining room set and she would not look for my table pads and told me to look myself. AWFUL PLACE !!!!!!!!","useful":2,"funny":0,"cool":0},
{"review_id":"XesU-0VrdKTA1b29Hc8FnQ","user_id":"YXgQTLAt2jIpdVHTW94txg","business_id":"XeUm1QS078kgjwONhul0ng","stars":5,"date":"2013-12-17","text":"This pizza is the best ever. I am from Boston and love my pizza and this place does not disappoint. Not only for pizza, the salads are huge and fresh and fabulous!!!. The pasta dishes are also great, with lots of garlic and fresh basil. Don't forget to try the lasagna.... the best.","useful":0,"funny":0,"cool":1},
{"review_id":"Uy8V_7L_bffe-Z6gUOpkDA","user_id":"KWeMXZv2sL1UtAlbfVZLmg","business_id":"SN6mvy2vbXL0F_CYFkx8zg","stars":4,"date":"2010-06-11","text":"Don't let your cab driver talk you out of going here.  Mine tried to, something about the recession and \"old\" food and bad neighborhoods and and and.  I think he was just OCD or something.  \n\nThis little Italian place has very good food, the prices are reasonable for Las Vegas and a lot less than what you would pay for a comparable meal on the strip.  The bruschetta appetizer was light, flavorful, and on a piece bread toasted just right.  My ribeye steak with a reduced balsamic sauce was cooked just right and I would definitely have it again.\n\nSo the what are the downsides?  Well it is located off of the strip in the lobby of an apartment building between a Papa John's pizza and a massage parlor.  Sounds worse than it really is.  Its Vegas.  There a A LOT of massage parlors around!  The Caesar salad was a bit bland for my taste, but still pretty good.  The restaurant was also not as busy as I would like.  There were only three parties in the place on a Thursday night during the peak dinner hour.  I have no idea why this place is not busier, but it does make for a nice quiet atmosphere and great service.  Go figure.","useful":1,"funny":0,"cool":1},
{"review_id":"_wvORHOt13HT0Mb02COlog","user_id":"7jtVGDObTkWCgXSaoX2kEg","business_id":"SkSkWld_ijmWVEDo9_ztKw","stars":5,"date":"2015-06-29","text":"Staying at the Westin Lake Las Vegas for our annual summer trip when we craved some pizza. So I yelped pizza and Bistro came up with the best reviews so we decided to give it a try. \n\nThe pizza was so good with the most perfect crust. My husband had their spaghetti \/meatballs and  really enjoyed it. The food was good and so was the service. The young guys behind the counter were really nice and just friendly.... Had to find in chain restaurants nowadays. \n\nWill definitely go back when we're in town.","useful":0,"funny":0,"cool":0},
{"review_id":"aAsRhOpXaE7E-kcddQdn2A","user_id":"pry1hVT4j05xwN59am3Rxg","business_id":"CB8HrynUWR4Odnj-XTY-Ew","stars":5,"date":"2017-11-01","text":"Just came here with some friends and couldn't leave without writing a review. Ordered the Assorted Plate (pork skirt, pork butt, pork jowl, pork belly with and without skin) and the quality of the meat is fresh - which can explain the $59.99 price tag for the plate. The servers are very attentive even though it got a little busy. The decor is very quaint and has an elementary school theme and I'm glad we tried it out. We will definitely be coming back!","useful":0,"funny":0,"cool":0},
{"review_id":"ji8xSamgmO9uUjtGWZsaYQ","user_id":"pry1hVT4j05xwN59am3Rxg","business_id":"pmOlcFQg9Vs3ONHpVNNXjA","stars":5,"date":"2017-08-19","text":"I have been to this place multiple times with my girlfriend and each time the fish has been perfect and the fries are great! The prices are reasonable, especially because of the sheer amount of food you get. $20 for the halibut and chips, but it's definitely worth it! \n\nPlace looks old fashioned, but you're not coming here for that! The service is fantastic as they are always friendly and attentive. Best fish and chips I've had in Toronto!","useful":0,"funny":0,"cool":0},
{"review_id":"DcTCIe9_N0HxdLIpidLACw","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"eJPckkV1k7gn0V2awA1pzA","stars":5,"date":"2016-10-04","text":"Great food, excellent service.  The portions are generous.  There is always a long line but it goes surprisingly fast.  I've tried several other of these sushi burrito\/poke places as they open... this is the best and the only one I return to again and again.","useful":0,"funny":0,"cool":0},
{"review_id":"2h86zI-XjxXsPRajj-0Sww","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"iD_gLlDiIi0zfMkn8Z6aJg","stars":1,"date":"2016-10-04","text":"Went to the office on Tenaya one time.  That was one time too many.  The PA that met with me was rude and arrogant.  I wanted to discuss a skin condition I had to explore my options, she walked in and said \"What do you want to do?\"  When I told her I though that's why I was there she said \"well your insurance won't pay of it\" and never any discussion.  I left frustrated, and upset with myself that I didn't ask to see someone else.  I waited 6 weeks for the appointment.  Wasted so much of my time!","useful":1,"funny":0,"cool":0},
{"review_id":"s6wEt5Sf58xKS9VfRnDDJQ","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"p5PRvPUhJrA-QHhm5xOU7Q","stars":5,"date":"2017-12-05","text":"This is my happy place!  Discovered it about 3 weeks ago and I've been here 6 times.  My husband and I have tried the philly, gyro and burger. For me... I can't stay away from that Philly... the perfect ratio of mushroom, onion cheese and juicy meat.  It all blends together to a perfect, almost creamy bite every time.  Everything is made to order so it's really hot and fresh.  I love the steak fries that are always well seasoned.  The restaurant itself is very clean and the staff are very nice and polite.\n\nI keep telling myself I'm going to try the gyro salad but I'll save that for after the new year when I get on the scale after the holidays.  For now I'm blissfully happy just thinking about this hidden gem.","useful":0,"funny":1,"cool":0},
{"review_id":"UcaEhmHD7qKnQavt-iqmkA","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"CauQnqZ5eowyrr7oWF_p3Q","stars":5,"date":"2016-10-04","text":"Love this place.  My favorite is the brisket but we always get a variety of meats and sides.  Also the butcher shop is great. I love to go during the holidays, the lines are long and the place is packed to the gills but it is now my holiday tradition.  The best place to get a whole skin on pork belly!!!","useful":0,"funny":0,"cool":0},
{"review_id":"TTRIs9DtR9U8QB4nqpynlw","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"Y-j6rMW97usezKAs9Usuew","stars":1,"date":"2016-06-02","text":"I've eaten downtown and enjoyed my meal so I was excited when it opened at Suncoast.   I really should have read the Yelp reviews before I came.  Zucchini sticks were bland and cold in the center.  Pot pie tasted like celery and there was 4 small pieces of chicken, also cold.  The meatloaf is the worst thing I ever eat, cold and hard... No amount of pasty gravy made it edible.     Then the check came and I was so angry that I wasted that amount of money on worthless food!","useful":1,"funny":0,"cool":0},
{"review_id":"C4r9RDtwlG_uQIiepvVWNQ","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"vbVJzKDhHlhMnKRpES5QzQ","stars":5,"date":"2017-12-17","text":"This has restaurant has been on my bucket list for a while and since eating there last night it has earned a spot in my regular rotation.  Arrived about 6:30 pm and waited about 30 minutes.  Service was very fast and definitely adequate, we received a carafe of water and pot of hot tea which was all we really needed.\n\nThe food was outstanding. I was a little nervous it would be dangerously spicy after looking at some of the reviews but it was spot on!  My nose ran a little which for me is a good thing when eating Sichuan.   Everything is highly seasoned and perfectly flavorful.  \n\nThe menu is extensive and includes pictures (helpful). We had the jelly noodle appetizer, toothpick lamb, tan tan noodles and special fried rice.   This was a lot of food for two people but we never mind leftovers.  In fact, I got up early this morning to eat them before my husband woke up!\n\nThe place is loud (in a good way).  We had a large boisterous party of about 12 next to us but as soon as the food came they got very quiet.   I'm planning my next visit already.","useful":1,"funny":0,"cool":1},
{"review_id":"-IqbkL_6x8ZAGZZUFR6x5w","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"Kn8nZztS41bKfSOHedqX3g","stars":5,"date":"2017-12-17","text":"If you have only been at Halloween time I think you are missing out.  The true farm\/orchard experience is on a regular non-holiday weekend, you can wander the orchard and scarcely see another person, pick veggies and not wait it line!\n\nTrue, you can't get apple cider donuts but the peace and serenity is worth the trade off .   On those weekends you will absolutely forget you are in Las Vegas.","useful":0,"funny":0,"cool":0},
{"review_id":"aIv1lENM4ufO-lg1AvY2yQ","user_id":"wEY8mnSM6P1v0PAwNcN_GQ","business_id":"W6s1BQa6N3mU6UBTv_KqSw","stars":5,"date":"2017-04-29","text":"Great food and service!  Come last night right when they were closing (accidentally). We were standing outside the door because we thought we were too late.  The cashier saw us and waived us in with a big smile.   The cashier was beyond knowledgeable and helpful with the menu.  We received out food very quickly and it was cooked and seasoned to perfection.  The Cherry Popper Burger was outstanding and the truffle fries are addicting.   One of the very best burgers in town. All the staff were friendly and happy and we never felt rushed, even though we were the last ones there.  This was my third time there and the food just keeps getting better and better.  I'm looking forward to my next visit.","useful":0,"funny":0,"cool":0},
{"review_id":"30xmXTzJwHPcqt0uvSLQhQ","user_id":"uNHEnP28MMmVy96ZSJKaMA","business_id":"RESDUcs7fIiihp38-d6_6g","stars":3,"date":"2017-12-22","text":"One star knocked off for the cold air conditioning and 1 star knocked off for the loud music and the food was good so it will be only 3 stars.","useful":0,"funny":0,"cool":0},
{"review_id":"NTbsgL5lGKIpcFjIrCcd2A","user_id":"uNHEnP28MMmVy96ZSJKaMA","business_id":"Uxm9N6jwmJybOv1NcBbnRw","stars":4,"date":"2017-12-27","text":"Outstanding bulgogi bento box and Bun! They give you free edamame. Happy hour prices for appetizers was a welcome surprise! I also liked the laid back vibe.","useful":0,"funny":0,"cool":0},
{"review_id":"NXN-NdvLTabMvpWVD2GH7w","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"7Xw_vv-ekUL2sTqipnKT0g","stars":1,"date":"2016-11-06","text":"If you ever want to call this particular BWW for event information. Just look at your self in the mirror and say, \"f*ck off\" . That's equivalent to the type of answer you get from the people that work there.","useful":1,"funny":1,"cool":1},
{"review_id":"OKsngWwQqkldf819Jgjx8w","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"g-vuRyYyVDUryFZlhhrZQA","stars":1,"date":"2016-11-19","text":"Came here to to meet with some coworkers and I asked if they could change one of the back televisions to the Ducks game. Not a hard request for a sports bar. Then this jerk off of a manager told me he couldn't change the channel cause he only plays Kings games. There is like a hundred TVs and you are going to deny a customer cause you like the Kings that much.  They suck ass anyway just like this bar. I can't even really decide which I want more to fail, the Kings or American  In a perfect world, both.","useful":3,"funny":1,"cool":0},
{"review_id":"lZjS8ueHSwjxM7UCvDY6xw","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"UMqfeCItzQ2glr4d9apGlA","stars":5,"date":"2011-06-14","text":"I was introduced to Sunrise Coffee by a friend of mine. We'll just call him Shmorey Smurratt.  The most hipstering, skinny jean wearin, never heard of his music havin, indie book readin, fingerless glove using, riding a bike to school, taking close up pictures in weird angles, film school student being, messy hair and beard having, thrift store shoppin and super elitist i know.\n\nWell, he told me this place was good. I tried it. He was right.","useful":3,"funny":6,"cool":3},
{"review_id":"G8rV2aoco3pI71BYzIcLlQ","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"I-KFzdnJcqbUHOAdO2I7Ig","stars":1,"date":"2011-06-03","text":"One word to describe this place, balls! The service was one of the worst I've ever experienced. It took them 45 minutes to bring our food out. They had 1 server and one sushi chef working and there were 7 tables seated just at the patio alone\n\nThe guy that seated us didn't look like he worked there. The only xtreme thing about this place was the dude's shirt. The waitress didn't even thank us after. The sushi was decent. Definitely not worth the service. Balls I tell you, balls!!","useful":3,"funny":4,"cool":1},
{"review_id":"LgvIu7shmwty6hnWn5iwVw","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"YavRvjbLsvh4DYDJPAfJIA","stars":4,"date":"2011-06-29","text":"There are a lot of pho restaurants in this town. This one is my favorite for 3 reasons. \n\nReason #1 - It's got the word \"pho\" in the name, so you know it's good.\n\nReason #2 - They are from \"Saigon\", where pho was invented, so you know they know what they are doing here.\n\nReason #3 - The number \"8\" is a very humbling number to give ones self. It's better then 5 and not as douchey as 10.  So you know they've got class.\n\nYup, the humblest, most authenticest, phoiest restaurant on Eastern. Much better than Pho Saigon 7 and less pretentious then Pho Saigon 9.  \n\nTill next Tuesday Pho Saigon 8, when my parents will pay for my dinner again!!","useful":0,"funny":4,"cool":0},
{"review_id":"WqXn7zy0LybQhpyoftVE-A","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"d8WZtx4dZUvT9Sg9NXGb3Q","stars":5,"date":"2016-05-16","text":"Best place to get a smog! Ron is awesome and the friendliest smog dude I've been to. Highly recommended.","useful":1,"funny":0,"cool":0},
{"review_id":"3MLi65q3JfZwW6pEOWrETw","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"iPM8BXV6vEVEci8ttsOObQ","stars":2,"date":"2015-05-21","text":"So they raise their prices but the pho tastes like onion water. Onion water, people. We are probably still going to come back cause its the closest pho place to us and Annie pho gave us food poisoning.","useful":0,"funny":2,"cool":0},
{"review_id":"DqwKJw_hETm-gxwri6mJdw","user_id":"1DKYCvYf_ec7msT-lL6fOA","business_id":"prPOsr3aS9IStGdBil9l5A","stars":3,"date":"2015-07-24","text":"Called  Prima like 10 times today and no one picked up.  I'm still gonna give you guys like 3 stars cause this is my first review of this place and the past service has been good. Still, not picking during dinner time is not cool Prima. Now I have to eat a mayonnaise sandwich.","useful":1,"funny":3,"cool":1},
{"review_id":"tyGC4bJZ1LjEzzRVX0pcCw","user_id":"rlf7po2tbzuTqbxB6nwbbg","business_id":"Kq2fw7SAKOLOmiJyVCbeFA","stars":3,"date":"2015-06-07","text":"Decided to use our mailer for the buy one get one free Delmonico steak for my husbands birthday dinner.  While the food was very good, the service needs some work.  I had ordered my steak with blue cheese and despite asking for it three times, it was never brought to me!  Our water glasses remained empty throughout our entire meal as well.  And, while they brought us a complimentary birthday cake, they never asked if we'd like coffee or an after dinner drink!  In addition, the table next to ours had to send their steak back as it was served rare and he had ordered it well done. I certainly hope service improves as its nice to have options.","useful":5,"funny":0,"cool":0},
{"review_id":"zjrytD3fnbInZuUu_4jhFQ","user_id":"IIX6_jISx1jQkJaxIlM3zg","business_id":"QkVax7-Gva6wUmVWbZMCSQ","stars":5,"date":"2015-08-30","text":"Cheikh is by far the best in the transportation business.  We were staying at the planet Hollywood hotel, and wanted to pick up our family from Ohio (whom have never been to Vegas before) in style. We were taking to limo services when Cheikh THANKFULLY intercepted us. He was nearly the same price as a dinky 6 seater limo, but he was a HUGH, sound-system hooked up, music video synced party bus. He and his company we're the highlight of our company.","useful":0,"funny":0,"cool":1},
{"review_id":"dysgTO0tBDIdXdUqxJcdUw","user_id":"yYaUxDAEUreRKTTvcudoYg","business_id":"BcW7Z9lPmOB_8eS2lEuOqQ","stars":4,"date":"2016-02-03","text":"This is by far the best Teppanyaki grill I've ever been to, the food is good, they give you plenty of it,and had a great Chef by the name of \"Yung\",he was professional and funny.!","useful":1,"funny":0,"cool":0},
{"review_id":"pL6AnWlbAKE7BEH0SIqoBQ","user_id":"yYaUxDAEUreRKTTvcudoYg","business_id":"jrE4M9HlYp2AZZ7iQCSIRw","stars":1,"date":"2016-04-01","text":"I use to go to this place every time I came to LasVegas but,I went there on March 29th,and got the Salt Pepper Lobster,and the waiter brought a parcel lobster and tried to pass it off as a whole lobster!\nWhen I question him on the rest of the lobster,naturally he got upset because I caught him trying to scam us!\nNeedless to say we will not go back to this place again!","useful":1,"funny":1,"cool":0},
{"review_id":"XHgHKV3cCPD6jaTSfghXGQ","user_id":"yYaUxDAEUreRKTTvcudoYg","business_id":"qVDRb-CZPXnO09csSuNK2Q","stars":5,"date":"2016-04-30","text":"Me and my wife relocated from California,and we found LV Furniture after bad experiences with other furniture companies.\nThere was an employee name Julie that helped us find what we were looking for,which was,and Bedroom set,nice stands,dresser,Bar stools,coffee table,end table,and a nice vanity for my wife.\nI would do business with them again!","useful":2,"funny":1,"cool":1},
{"review_id":"y3gHKtw2p0rSSYB0UZgTsg","user_id":"yYaUxDAEUreRKTTvcudoYg","business_id":"odr7wuHWQeA0r9iUWZml8w","stars":5,"date":"2016-04-30","text":"I'm new to the Las Vegas area,and needed some assistance on mounting 2 TV'S to the wall.I called E-Z mounting and they sent out 2 guys,Joe and an assistant,they mounted my TV'S and also did the wire work for my Laser disc,Fire Stick ,and a DVD player.\nI have nothing but but good things to say about this company,and if needed, I would use them again!","useful":3,"funny":0,"cool":0},
{"review_id":"IZDNy-bwf7AbyO6zgs5EGg","user_id":"yYaUxDAEUreRKTTvcudoYg","business_id":"XfpwVRxN2yxV0k_N11GNsw","stars":5,"date":"2016-04-17","text":"I have nothing but good things to say about Keith!\nVery prompt,fast and professional.He did an A-1 job and I will be calling him again!","useful":1,"funny":0,"cool":0},
{"review_id":"Z1u7OmLi288HdwvkwBfKBw","user_id":"Ds_Z6p651JahD67iMf_crg","business_id":"-6tvduBzjLI1ISfs3F_qTg","stars":5,"date":"2014-11-23","text":"Great nachos!  They're big.  Great grilled Mahi tacos and the house made vanilla pudding is the bomb! Atmosphere on a Sunday afternoon was relaxed and the service is at the top.  We'll definitely will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"YQ9J9tW5GJ27y83hBuUAMg","user_id":"pHR4RkPF0GZcy5FumX7PXw","business_id":"bRR4gsjHv0F_RnRGjQBqlg","stars":5,"date":"2015-08-06","text":"I just absolutely love this place! Always great service.The employees are always friendly and the custard is so good. I totally recommend this place.","useful":0,"funny":0,"cool":0},
{"review_id":"F23v5FFe5exliFIGBRRNAQ","user_id":"pHR4RkPF0GZcy5FumX7PXw","business_id":"qJd4qx1QsBZ3q8F8t3Sapg","stars":1,"date":"2015-07-23","text":"I was just in there today, and I had a coupon for $10 off of $40 or more. Now, I shop this CVS store all the time and use my coupons all the time. Normally the staff in there is so nice and always honor my coupons. Not today..I was  $0.69 away from the $40, and she would not honor my coupon...I wish I got her name..I only got the SM name, and his name is Mike...I'm very upset..I'll be making my way back there to return everything I bought, and I'll be shopping Walgreens from now on...","useful":2,"funny":3,"cool":0},
{"review_id":"bXhe0JvGTen0cjIeybgUbA","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"htiB-auOhxa6YTp9bAb6lw","stars":4,"date":"2014-12-10","text":"I had shrimp on angel hair pasta. It was really delicious. My husband had the closer. A fried chicken burger. He said it wasn't what he expected and it was too much breading. My 2 boys both enjoyed their meals. The waitress was attentive and friendly. It was not crowded for a Sat.","useful":0,"funny":0,"cool":0},
{"review_id":"F05ZnwjaJJcJ9CDNi52uRg","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"6u-x45q0ETB7SQTAAuKSHw","stars":4,"date":"2015-08-24","text":"My hummus appetizer was huge and delicious. I wanted to eat all of it but it really is better for sharing. I love lamb so I had the 8oz lamb chops. Really good I wish there had been more. My potatoes were good but nothing to write home about. The rice was nicely spiced. The lamb was served with tzatziki which really added to the flavour. Nice atmosphere and beautiful outdoor patio. Service was friendly and quick.","useful":0,"funny":0,"cool":0},
{"review_id":"KQK1ZKOlMpJ0W3oA55X5TQ","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"EWP6pxAwnyQcBug6jchWNA","stars":5,"date":"2014-09-28","text":"We have been here several times and it has been remarkable each time! We live out of town but it is worth the drive! We saw the Toronto Symphony orchestra perform Beethoven's 9th symphony.","useful":0,"funny":0,"cool":0},
{"review_id":"N-kHCkgvj7GaMT9saS4U-A","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"3xUoXuEgJhHlSgBsSfKeCQ","stars":4,"date":"2015-07-20","text":"It looks tiny from the outside but inside the burgers are big! The lamb burger was perfectly cooked and I had it with chipotle mayo, mustard, lettuce and tomato. The fries are skinny and really good. There are a wide variety of burgers including turkey, Kobe beef, grilled chicken, bison, as well as salmon and tilapia. Not in the mood for a burger? You can get a steak, fish and chips or several types of salad. Sides include fries, sweet potato fries or rings. The only downside was the table next to ours was very noisy and made it difficult to talk but the food more than made up for it. There is an outside patio and it looks like they are expanding.","useful":1,"funny":0,"cool":0},
{"review_id":"BkxXyvY9idG1BEV7mQ_vMQ","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"AUv2UoAAi7VASJ6VK5lOlw","stars":5,"date":"2015-08-12","text":"I am not from the Toronto area and this is my first time here. We had lunch at Top Gun steak. All of their items are named for characters from the movie. I had the iceman, a steak burger with lettuce tomatoes roasted peppers and garlic mayo. The fries are homemade served with aioli sauce. Really delicious! The stores and booths are unique, vintage and full of exotic and local items. There is live music provided by corner musicians with homemade instruments. We didn't have time to see everything and plan to return soon! Definitely a must see when in Toronto!","useful":2,"funny":1,"cool":1},
{"review_id":"0LuEy6NfgwsyCMh08jsvhw","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"hR3xCRVCSsFrCUJpmy6vWg","stars":4,"date":"2015-06-16","text":"I haven't been to Swiss Chalet in a while and was surprised by how the menu has changed! The 'usual' fare is near the back of the menu and some of the new items are Cheesy Bacon chicken Penne, Pesto chicken Penne, Chicken Parmesgan sandwich and perogies! I had the Pesto Penne and it had big chunks of chicken and it was delicious! my son had the cheesy bacon penne and really liked it! This particular restaurant was clean and not too busy. The service was fast and friendly. I was happy overall with our meals and will return again when I am in the Mississauga area!","useful":0,"funny":0,"cool":0},
{"review_id":"-TCFijAMXHiqKt8QmOHGQg","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"HOmaC1T2bm4T7LzFQ-dTCw","stars":5,"date":"2015-08-09","text":"My son is here recovering after major surgery. There have been complications and the nurses and doctors have been amazing!! They are allowing us to stay with him all day and have answered all of our questions honestly and patiently. Dr. Stephen Lewis his surgeon has gone out of his way to make my son's recovery as easy as possible. He visited my son on his day off! I was so thankful for that. It's still early in the process but we are extremely happy with the care we have been shown here. Wonderful hospital!","useful":7,"funny":0,"cool":0},
{"review_id":"vfr4RpYpQJ8HbtiX8-1B1A","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"arpBUwgiaE8iqfNGMQ_hgg","stars":3,"date":"2015-08-16","text":"I loved the decor but my burrito was underwhelming. The chicken was nice but the refried beans and rice were just boring. Nothing to help it stand apart from other burritos. My husband ordered the spicy and said that maybe it had once rubbed up against a jalapeno. No spice at all. I've had better burritos at Quesada!","useful":1,"funny":0,"cool":0},
{"review_id":"tufEvhRjql7Qc_PEhuQWcQ","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"XHrPQKUTJXJGPH9etKUYUw","stars":4,"date":"2015-07-21","text":"We've stayed here twice because of it's location to Western Hospital. My son had an appt. there and the hotel is only a few minutes away. It is conveniently located close to restaurants and the subway. The rooms are nice and the beds comfortable. However, while we were there one of the main elevators stopped working and the phone in our room was not working either. The staff is very friendly and more than helpful. There is a Starbucks and bar in the lobby and a small snack shop with typical snack fare as well as any toiletries you may need. The rooms have coffee makers but no fridges. The TV was HD and offered a nice variety of channels. The hotel needs an update but for a short stay it is nice. Also has complimentary WIFI.","useful":0,"funny":0,"cool":0},
{"review_id":"fhzAtq2PHG25wosZfpOB1Q","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"ivbMuKOwwX2B70gFggzT-g","stars":5,"date":"2014-09-27","text":"They held our table even though we were late. The honey butter and bread was so good! We all had the Caesar salad and being garlic lovers we were not disappointed! My mushroom steak was tender and delicious! The mashed potatoes were creamy and so good! Definitely worth the 3 hour drive!","useful":0,"funny":0,"cool":0},
{"review_id":"lR4kGtY_Jz-iEHvagw71dQ","user_id":"Gcr2xLgfVlQBx6kabt2k_A","business_id":"-L88B-PrtzwujhLuYc2k_g","stars":5,"date":"2014-11-05","text":"We were in Toronto for a show and went here for dinner. The veal marsala was amazing! It melted in my mouth. My son had the venison and it was also amazing good! We were disappointed they were out of the wild boar lasagna. I assume it's because it is also very good. The restaurant is very big inside and decorated like an old Italian piazza. The wait staff was friendly and attentive. Our water glasses were never empty. I love Italian and was blown away with the food here.","useful":0,"funny":0,"cool":0},
{"review_id":"mm6vTYKXbU9-Wx3D1O_Fsg","user_id":"ytnmBzn1NOA4G-Ol_SdZqw","business_id":"L08kNgYgxXVanzHVtVTQgA","stars":5,"date":"2014-01-28","text":"I moved from NYC to Toronto last year. I had the top EXTENTIONS \"great lengths\" done at a top Madison ave salon many times. I had no idea where to go when in Toronto so I called great lengths canada and asked who they would recommend. Deville was one of their favourites as well as a couple of other salons. So off I went with moderate expectations. WOW! Best EXTENTIONS I have ever had. Perfectly blended bonds so invisible not the least bit chunky. Can't rec'd this salon enough, oh and the prices are half that I was paying in NY yet another plus. Parking is free and in the rear couldn't be a more easy solution. This is now my hair \"go to\" in Toronto! Run don't walk!! And let me just say I'm a Yorkville girl who is VERY picky!!!","useful":0,"funny":0,"cool":0},
{"review_id":"2iuNGigwC2EMU0Cka-pXKg","user_id":"LVjbgxwYGAeCXlaUY6Myew","business_id":"D1BrHyiZON7u_ef-qt4_Uw","stars":4,"date":"2011-08-31","text":"Friendly servers. Melt-in-your-mouth Tender cuts of beef to grill at your table. Prime Kalbi was so yummy. We ordered a combo that included a little of everything and added an order of prime Kalbi. Plenty of delicious food for 3 adults with moderate appetites. The portions aren't huge because of the amazing quality of meat they serve so if you have a lumber jack appetite, plan on spending a little more. Used a Groupon for the whole meal that would have cost around $50-$60 (not including drinks)\n5 Stars for food\n4 Stars for price (without the help of a Groupon of course)\nAnd FYI to wheelchair-bound patrons, the seating is all booths. Unless you can transfer to the booth, don't plan on getting under the table. The design of the table doesnt allow a chair to pull in at the end. Plan on bringing a laptray to eat off of. A little inconvenient but so worth it.","useful":0,"funny":0,"cool":0},
{"review_id":"sRYXvaH5jn6VJ0p53U9z1Q","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"UAilrqMxp5N9etpwezsR2A","stars":5,"date":"2015-07-22","text":"I have been going to Shear Excellence for years.  I have to tell you the experience is awesome.  First, the decor is very tasteful and comfortable, not uptight. Second, they offer you a beer or drink when you arrive. Last but not least, the service is out of this world.  Stephanie is my stylist and I am amazed every time I walk out. I might be the hairiest man alive and somehow she makes me look like a gentlemen.  In fact, she has become a good friend who happens to cut my hair. Good people, straight up.","useful":0,"funny":0,"cool":0},
{"review_id":"3CvjN3R_eTIT1JcOvJvDog","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"NI3xvN6p0qhvUkKirbKokA","stars":4,"date":"2009-08-18","text":"I have to say it's worth the wait.\n\nI showed up and had to wait 20 mins. for breakfast on a Sunday (which really isnt bad).  OPH does a good job moving people in and out.\n\nI had the corned beef hash and it was great.  I was very pleased to find out that it's homemade and NOT canned.  Needless to say the taste was out of this world.  There was so many choices I need to to keep going back.  Next on the list: crepes.\n\nWonderful place - excellent quality food and kind staff.","useful":4,"funny":0,"cool":1},
{"review_id":"hYNm4HNymBerShLw9Zu3Cg","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"Fxgvku1h-G2UnNMdFBhWbw","stars":3,"date":"2009-07-27","text":"I agree with most of the other reviewers except for the comment about \"The South.\"  I think that was flat out rude. \n\nAnyway, the Skyland restaurant will not blow you away.  The food is good, cheap and somewhat fast.  It's your typical diner, kind of weak coffee, overcooked sausage and thin white bread.  I typically get the Skyland Special.  Try the pancakes, I think they are perfect - not too fluffy and not too heavy.  \n\nThe atmospehere is eactly what any diner is - a bit loud if the the wrong people are there and eccelctic.  \n\nGo there as an alternative to a chain breakfast restaurant and you will be happy.  Go there expecting crepes and you will not.","useful":0,"funny":0,"cool":0},
{"review_id":"Y02tziKX-895TJYfHwIzvA","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"Okm4L-vcrZkWJ7GB-auhFQ","stars":1,"date":"2014-04-17","text":"Don't go if you are not Hispanic. You will be ignored. I sat there with another white guy and a black guy, we all sat there as others just walked in and jumped in the chair. Lame way to do business.","useful":2,"funny":0,"cool":0},
{"review_id":"_xMBHv9tQcAFVPVfbCmkuA","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"FBSWwaE6gR7KAOyG1QhakQ","stars":3,"date":"2013-04-05","text":"My group of four visited tonight for the first time.  I have to say it was just ok.  I love the concept and the atmosphere but the service was lacking.  To be more specific, it wasnt our waiter, he was great.  Insead, it was the kitchen staff and their mistakes.  First, we immediately got a table (yay) and we ordered our drinks and apps, the apps arrived before the drinks.  Ok, not that big of a deal but there was more.  Second, we ordered our meals and two of the four dishes arrived before the other two.  Both dishes were cold and the other  two did not arrive until the waiter noticed and had to go to the kitchen and start all over.  The food comes back and was incorrect and the cold meals originally delivered were simply reheated.  Have you ever had reheated duck?  I don't recommend it.","useful":2,"funny":1,"cool":1},
{"review_id":"3ey4sZzEDN3dHcq9-debxw","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"HEUl15BCeXAMmtp7TX40rg","stars":5,"date":"2009-07-27","text":"I love St. Francis.  The staff there is very friendly and kind.  Recently, my dog cut her eye open and I called several \"Emergency\" hospitals.  Not one hospital was willing to see my dog right away.  Instead, I called St. Francis (my usual vet) and they saw here right away and did surgery.  Also, I have found that they will beat any price found on petmeds.com or others on flea and tick medications.  Lastly, they are extremely reasonable and I have never questioned a bill or their methods.  \n\nYou will become a raving fan like me.","useful":8,"funny":0,"cool":0},
{"review_id":"lxpEAGAMLLhC5VveLrfQ5w","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"ZGaW5a7wxXxUgGTtbFqNxg","stars":3,"date":"2009-07-19","text":"The Mad Greek will not wow you from the outside.  When you pull up you will undoubtedly think the place is going out of business.  However, they just opened up and the decor reminds you of an old diner.  I mean a really old diner.  \n\nEnough of the aesthetics.  The food is good.  I had the gyro sandwich with fries.  The gyro was STACKED with meat and the veggies were fresh.  I must also say the pita was fresh and hot.  The tzatki sauce was good.  I prefer a little more garlic in my sauce but this was good regardless.  My wife had the Philly Cheesteak and it was great.  \n\nAgain, the decor is weird, the parking lot looks run down, but the food is good.  Try it - you will be surprised just as I was.","useful":3,"funny":0,"cool":1},
{"review_id":"SfiBK0xZ8OZFAKXv3rH4Jg","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"ICUCAzUZFiWkYs7iCtNCQg","stars":2,"date":"2009-07-15","text":"I gave it two stars because they try too hard and the flavors are forced.  By that I mean, I dont think the flavors are genuine.  \n\nThis was my first time to Copper.  Upon entering you are greeted by a very warm and friendly staff.  The decor is a not at all \"modern\" as some have described (I guess those people think modern is anything that's not painted beige).  I do agree seating is tight especially if you get a table in the corner by the windows.  The music is contemporary indian.  \n\nThe food was just ok.  I visited during restaurant week and there was a limited menu.  However, you are fee to order off the regular menu as well.  I ordered the cucumber avocado soup, the chicken, and the mango kulfi for dessert.  The avocado soup was not good.  I found it to be bland and the texture off.  The chicken was dry and needed more sauce to get by.  The mango kulfi was ridiculous and had deep flavor.  \n\nIf you are looking for a serious Indian restaurant - this is not the place for you.  If you are interested in trying something a little different and an enjoyable atmosphere go try Copper.","useful":2,"funny":2,"cool":1},
{"review_id":"_4q3CixBlSl51xTbPmncYw","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"GhGYQ5WI4LdH53591fUMMA","stars":4,"date":"2009-07-26","text":"I agree with previous reviews, the place was a ghost town.  However, I never let that deter me from trying things out.  I must say I was a little skeptical at first - but now I am a fan.  \n\nI had the miso soup, rice vegetable spring rolls and chicken and steak teriyaki with mixed vegetables.  First, the soup was flavorful and had a  little fire to it which I loved.  Second, the spring rolls were fresh with a nice assortment of fresh veggies that came with a sweet peanut sauce.  Lastly, the chicken and steak teeriyaki was great.  Many places you go (especially at this price point) will simply throw some veggies down and mix in the teriyaki sause.  Not here.  Instead, I found a great mix of broccoli, peppers, onions, mushrooms etc.  And yes, the mushrooms were big as another reviewer stated.  However, who complains that their mushrooms were too big?  The chicken was full plump pieces and the steak was just ok.  The rice was delicious and not doused in soy sauce.  The only drawback - I found things a little too salty.  \n\nIf you are looking to recreate your trip to Asia, this is not the place for you.  If you want fresh ingredients, nice flavor and decent prices - try WAM.","useful":0,"funny":0,"cool":0},
{"review_id":"doRI5KdDxVs9lXJefSE-xA","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"csf6o4VOiXk0oZaoyMiCww","stars":4,"date":"2009-07-27","text":"I stumbled upon this bar after a friends birthday party and it was a hell of alot of fun.  This place is all cinder blocks, pool tables and tall boys.  There was a little DJ action in the corner and the tunes were great.  I think I reember tall boys being $3 - I say I think I remember because I had WAY too much fun to recall.\n\nGo there - it's a great place to people watch as well.","useful":2,"funny":1,"cool":0},
{"review_id":"bTpSLLY72GYyivU_UT0gfA","user_id":"4dUg_rIh2Pk4Qye18TCe_g","business_id":"QCUjHPu7OF_bqfjnehlQaQ","stars":3,"date":"2009-08-18","text":"Just ok.\n\nI waws there a few nights ago and had the spaghetti and meatballs.  My wife had the spinach pie.  It took a good while for someone to recognize we were there - but after that it was fine.  In fact, our waiter was very knowledgeable of the menu and had great descriptions of the meals.  However, the food was just ok - not to say he over promised, he didn't.  The food was just ordinary.  The meatballs were a little overcooked and the sauce was average.  I did try my wife's spinach pie and it was simply spankopita in huge portion.  \n\nI recommend this place if you simply want a drink and an appetizer.  It's just average at best.","useful":2,"funny":0,"cool":0},
{"review_id":"f9J6U0ZoGXaXpjclmeH3NA","user_id":"vmFs4WWLzfWQX7f7DZZPqw","business_id":"0AQnRQw34IQW9-1gJkYnMA","stars":4,"date":"2014-06-29","text":"It was a great place to see the night life on the strip. It was loud and a party atmosphere with all kinds of people celebrating different things. The corn appy was unique and tasty and my fajita's came with a lettuce wrap option that I really liked. Great food and I would recommend it!","useful":0,"funny":0,"cool":0},
{"review_id":"cVYGrjhZRNuxc0vMs4M1Ww","user_id":"vmFs4WWLzfWQX7f7DZZPqw","business_id":"4v5ZLpmNn13Mze1w_XfWHw","stars":2,"date":"2014-06-29","text":"Mediocre food and lack of service ended with the waitress giving herself an 18% tip. While I have no issue with tipping I think:\n\n1. They should try to earn the tip- she didn't. She brought one platter from the kitchen to the table and didn't even bother to refill out drinks as well as took 15 min to come back to collect my CC after she dumped the bill on the table. I asked if I could pay someone else and the staff told me no, I had to sit and wait for her to come back.\n\n2. Because of the above, this was not a tip but a surcharge. The HD Cafe should warn that they charge 18% to have their servers bring you food.\n\nWon't go back.\n\nOn top of that, the bathroom was filthy.","useful":0,"funny":0,"cool":0},
{"review_id":"oL8-mvRt5CrdGgRd3l9seQ","user_id":"vmFs4WWLzfWQX7f7DZZPqw","business_id":"-Le6cwbZL4tDZwNHwipfKg","stars":4,"date":"2014-06-29","text":"Great ambiance with good food. The staff was attentive and professional. The accommodated a group of 14 with ease and a peanut allergy. We almost double tipped them but the staff was so professional , they pointed out our error and enabled us to reimburse the family member who covered the bill. We would recommend this place to anyone.","useful":0,"funny":0,"cool":0},
{"review_id":"U8DKmermpd2miGUXP8y66A","user_id":"vmFs4WWLzfWQX7f7DZZPqw","business_id":"HhVmDybpU7L50Kb5A0jXTg","stars":5,"date":"2014-06-29","text":"Service was amazing, the ambiance excellent and the food was off the charts. Best Prime rib dip I have ever had and the teams that served were tight and knowledgeable. Management was out and about ensuring everyone was happy and enjoying the menu to the max. We loved what we ordered and rubbernecked a ton of other yummy sights we saw go to other tables. Will go back and try other things! Go! You will not be disappointed!","useful":0,"funny":0,"cool":0},
{"review_id":"6ghRu8bo2I4Y_tQSTpv0cw","user_id":"AyLrGKsgaQLwPs1qpVfGLQ","business_id":"3p9q6p4PckNOq-oXMiP22A","stars":3,"date":"2015-05-16","text":"Foods decent. But they had us wait for a good 15 minutes before we even got our food. And their freezer broke and could've advised people that they did my have \"breaded\" things. Half our meal was \"breaded\" things and Our server was Vanessa","useful":0,"funny":0,"cool":0},
{"review_id":"U7vHhKmmDJ-I-L0ggs2YqA","user_id":"OFeoJD8IQ8glUGc-3teTzQ","business_id":"9IFvZw83W8qKpEEJrhXpgg","stars":5,"date":"2017-01-15","text":"I have been hearing about this place on the radio for years but I live in the far west valley so it's a drive. Finally got there and couldn't get enough of the sweet BBQ sauce. Amazing on everything I had. The fried pickles were a bit too salty for my taste but the appetizer quesadilla was amazing! I could have had that for an entree. The green chili burrito was PACKED with meat and a definite get again. The combo meat sandwich was also an excellent base for more of that sweet BBQ sauce. I would go again with no hesitation, if ever on that side of town.","useful":0,"funny":0,"cool":0},
{"review_id":"d_kfL-dmQ-iPXYGuGnkjKA","user_id":"OFeoJD8IQ8glUGc-3teTzQ","business_id":"4Oq-eDBdcm1pR4tO9cQQiQ","stars":5,"date":"2016-11-14","text":"Excellent Hawaiian plate lunch! Mac salad always my favorite! Been to Hawaii several times and this place gives me the opportunity to revisit cheaper than a flight.","useful":0,"funny":0,"cool":0},
{"review_id":"itSrf5U2DwXPGttNfE4tmQ","user_id":"OFeoJD8IQ8glUGc-3teTzQ","business_id":"RZdrNayqoUjovdoJ4GWe-Q","stars":2,"date":"2016-11-20","text":"First time going and feel no urge for a return visit. It was 6:30 on a Friday night and they didn't seem busy but still took 25 minutes to give me my order as I waited alone in the lobby. 10 minutes of it was looking at my order sitting on the rack with the single employee playing on his phone. He eventually looked up and checked in with me even after he was the one who took my order and handed me the bag. I ordered the Italian beef, fries and cannelloni. The sandwich was not impressive and the fries over cooked. The cannelloni was however very good and the crust still crunchy.","useful":0,"funny":0,"cool":0},
{"review_id":"e4NIxY_c_WgKCB-CMqtsRg","user_id":"CnXkSNLuewsXop5TLgAu4Q","business_id":"bjwzcwoddutV2aAEImhFxA","stars":5,"date":"2013-05-15","text":"You MUST go to the Lifetime SPA & SALON at the Goodyear location and see ANTHONY! My 6 year old daughter and I go there and Anthony is the undoubtedly the VERY BEST! I have been to many hair stylists and I have been unhappy with the results; however, I had a superb experience with Anthony! He is the best of the best; he is very thorough and takes his time from the very beginning with the consultation down to the very end. He offers the best hair care advice and tips for your specific hair!! Simply AMAZING! There is no doubt I have finally found my hair stylist and will be coming back!!!! I recommend him to everyone I know, he is AWESOME!!","useful":0,"funny":0,"cool":0},
{"review_id":"tIxn4eGevWIApdDRhiZSgA","user_id":"V9V6kky4vrTefLCpAM5aDg","business_id":"eoHdUeQDNgQ6WYEnP2aiRw","stars":5,"date":"2016-05-22","text":"6 of us had breakfast here yesterday and everyone got something different. From the Hangover Omelet to the strawberries and cream waffles, everything was delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"L7d8-QbOXbJRONBwH3DXMg","user_id":"7-GUgWQeHiXY71t2XJKr7w","business_id":"Qgi_Q6PkF5D489t45vU_8g","stars":4,"date":"2015-06-07","text":"Went here off a suggestion from a family member. Definitely some of the best ice cream I've had. When I arrived there was only one worker behind the counter, a little frazzled but kept her cool despite the line forming. I ordered a scoop of Roasted Marshmallow and a scoop of Bailey's. The roasted marshmallow was delicious; it tasted like a campfire in the best way possible. I was a little disappointed in the Bailey's because I couldn't taste it, but the ice cream was still delicious. Definitely recommend checking this place out!","useful":0,"funny":0,"cool":0},
{"review_id":"sxgOYsNF_HMuSXtDZugYKw","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"4hf8Iqe-7qKlt2jIS5l1SA","stars":4,"date":"2010-02-27","text":"Service was great.  Dropped off on Friday and they were ready by Tuesday, I had two pairs of pants hemmed.  I don't often have things hemmed or taken in, so I don't know if they were a good price, but I think a little pricey.  $28 for two pairs.  Over all friendly and would return.","useful":3,"funny":0,"cool":0},
{"review_id":"MtakdI1gY89-yKegU-RiDA","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"wKHQ3YLPOhBQNeKZhM9TgQ","stars":1,"date":"2010-02-27","text":"This place is a DUMP. I've stayed in holiday inn expresses that were nicer. Our room is like a dungeon. Also, the woman who checked us in laughed at our last name (it's a common Irish name. There is even a famous author with the same name).  We wanted to use the shuttle.  We had to call three times to finally get an answer and then person was beyond rude.  On the second day, they just never picked up the phone and we had to call a cab.  \n\nWe called and complained and they offered us a free night at the same hotel - why would I ever go back ???\n\nDon't stay here under any circumstances.","useful":2,"funny":0,"cool":0},
{"review_id":"CDth0mQjbsXGKCf65EQimQ","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"KTPRYqiFdLowAUEAnN7e3g","stars":5,"date":"2011-05-11","text":"Went here with a party of four last night, and we had a great time!  It wasn't where I expected to find it; sandwiched between a TJ Maxx and a Marshalls, but it lived up to the reviews.  Got there around 7:30 and told there was a twenty to thirty minute wait which was fine with me because I can always shop, but we were seated within ten minutes.  No one was super starving, so we skipped on appetizers.  Solid beer selection which pleased our group.  They also have alcoholic milkshakes.  One person ordered the granddad.  Holy booze - this shake was delicious, but there big and strong so be careful!!\n\nBURGERs:  You can choose from organic, free range beef, bison, chicken breast or a veggie burger for all of the burgers.  I don't eat a lot of red meat, so when I go all in when I get a burger!  Two of us got the Monty; peppercorn rub, horseradish cheese with a Cabernet sauce and onions... SO GOOD.  Ordered medium rare and they were perfect.  Other side of the table did the custom burgers and they were extremely happy as well.  Burgers come with homemade potato chips, but you can also substitute fries and coleslaw too.  Chips were great, and the fries were good too (they had some kind of rosemary seasoning).  By the end of dinner, everyone's plate was empty.  Service was great too!\n\nBottom line: Check it out.","useful":0,"funny":0,"cool":0},
{"review_id":"_fs2nzsnf-7s8zkfQIK_Pw","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"JLbgvGM4FXh9zNP4O5ZWjQ","stars":1,"date":"2013-06-30","text":"Went here for a nice dinner before a show. The bartender decided he knew girls better than we knew ourselves and insisted on making us fruity martinis rather than the dry martini we requested. Finally he agreed, and he made the two worst martinis ever. When we didn't drink them and ordered wine, he made fun of us for not liking our drinks.  He was the most annoying bartender I've ever experienced. Then our Red wine came in HOT milk glasses.  It was gross.  And the food? Mediocre is too generous of a description.","useful":0,"funny":1,"cool":0},
{"review_id":"zsWPtFSRkrQYMP1NUWcMqw","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"BBkQ99cFPNJ5op-7IVqWNA","stars":1,"date":"2012-06-21","text":"I have been to elements three times; the first time was excellent, the second time was good enough, and the third time was so awful I feel the need to ward off anyone else from visiting this restaurant.\n\nWe had two good experiences with elements, so when we saw a groupon for a four-course tasting menu, we bought it without hesitation.  Side note: our first excellent experience included the tasting menu. He ordered the four course, while I ordered a salad and entree.  His four courses were full of delicious food that was enough to feed us both.  Neither of us were able to finish our meals, and we left full and happy!  But tonight, our tasting menu options and delivery were beyond disappointing.\n\nWe decided to sit at the bar tonight.  When we sat down we were eyed down by the female bartender who reluctantly took our order.  She didn't bother to tell us the specials, which we later overheard her share with other customers, and she didn't ask if we were interested in any food.  Before we were finished with our drinks, she brought over our check; were we being rushed out of this NOT crowded bar?  I had a bad feeling, and I wish I would have trusted my gut to leave.  We asked her for another round and let her know we were going to order dinner and had a groupon.\n\nOur service was bad before we told her we had a groupon, and it only spiraled down from there.  But bad service I can handle, it was the food that made me jump onto yelp!  The tasting menu was for family style service so we had to pick the same four items for dinner.  Family style?  This is different than last time, I thought.... Our first course was a variety of meats, cheeses, and olives.  It was a much smaller portion than he had during our first visit to elements, but who needs to over eat meat and cheese anyway?  The second course was a beat and goat cheese salad.  The salad was large and more than enough for two people (aka filler).  When our entree arrived I almost fell off of my barstool.  There was one filet of salmon for the two of us to share.  It wasn't a monstrous sized salmon as big as my head, it wasn't two of my fists, it was a small piece of salmon meant to feed both of us.  I am mortified that I didn't call attention to this at the restaurant, but I couldn't believe that I had been served a 'family style' portion of salmon that included only one piece of fish.  WHAT?  Dessert wasn't memorable, but what I do remember is not being asked if I wanted coffee to accompany it either.\n\nI'm not even mentioning in detail the bartender's awkward comments that we cleaned our plates during our meal or that another bartender knocked over my glass of wine. Please, don't go to elements.  There are too many better restaurants in Pittsburgh to waste anymore thought on this dump.\n\n\nNote to restaurants: If you don't like people who use groupons, then please don't invite us into your restaurant only to treat us poorly. Like I said earlier, this was our third visit to Elements.  We bought the groupon because we were repeat customers, we liked the restaurant, and now we will never go back.\n\n**UPDATE**\nI followed up with Groupon and Elements.  Groupon refunded our money with no problem at all.  When I called Elements, they said the owner wanted to speak to me after reading my review on yelp, but he wasn't available.  He called me back once, and I returned the call.  I haven't heard back anything.","useful":0,"funny":0,"cool":0},
{"review_id":"_uC1vvLygJLrzFjaRkDz0w","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"j37Z4LIXTH9j6KOq9aX8DQ","stars":3,"date":"2010-08-20","text":"Yes! This is a fantastic bar! Our bartender was awesome & very knowledgeable about beer, the food was good, and they have a great variety of beer. Very nice, relaxed setting. If you're debating where to go, go here.\n\n\n... Since my first review I've been back twice.  Both times the services was really really bad.  This makes me sad, but I've crossed them off my list; service is too hit or miss.","useful":0,"funny":0,"cool":0},
{"review_id":"gpaj1IZk0FJoa7etBI4rhw","user_id":"nZpcyQaEQzvUpnbjK0cQIg","business_id":"3BBkhChwKTEx9l83bIl1ng","stars":1,"date":"2011-05-02","text":"I almost feel bad giving Dean's such a bad review because they try to be a nice salon, but it just isn't.  They're great with coupons; you'll almost never pay full price for a haircut.  This explains why I got my haircut there so many times.  Each visit was more bizarre than the time before.  The last time that I went to Dean's, two of the stylists lectured me on the 'bad' product that I used on my hair (a bumble and bumble product...).  \n\nOverall, my haircuts were never good.  Mehh at best.  I've been to three different stylists there and only one of them spoke to me while cutting my hair.  That can be an awkward hour long hair cut... And the salon is dirty.  Maybe my standards are too high, but if I'm getting my eyebrows waxed, I believe that the hair should be wiped off of the chair.  Or that there shouldn't be noticeable dust bunnies all over the salon.  There are just so many better salons in Pittsburgh (MCN), please don't waste your money here.","useful":0,"funny":0,"cool":0},
{"review_id":"ls8jTizNbLh1gaVfFRpORA","user_id":"nmnVCrVjS5mwOen0lCZ6Eg","business_id":"xUgt16DZ-gq67E2C9VbYgQ","stars":5,"date":"2017-05-25","text":"I brought a Dominican with me along with and 2 other gringos. I have studied in DR and know the food pretty good. Food here was amazing and no issues with service, like some of the other posts said. We will definitely return.","useful":1,"funny":1,"cool":1},
{"review_id":"307ciWN4po9tNVFRcetc-Q","user_id":"MCOUx4H_9BVQW0wtLsTqKg","business_id":"6U5QlK84UmPUgoJAwAcL9Q","stars":4,"date":"2012-02-19","text":"Burritos and quesadillas were fantastic. Chicken was perfectly cooked. Agree with others that the guacamole was not the best, although not horrible either. Staff was very friendly.  They also deliver in the area with a $15 minimum which is an added bonus if you live nearby.","useful":0,"funny":0,"cool":0},
{"review_id":"C9n7vAqXBm668O7PfsqH0A","user_id":"MCOUx4H_9BVQW0wtLsTqKg","business_id":"OwGCYIwyIHPMfLVOT_7-1g","stars":5,"date":"2015-01-12","text":"This place is a hidden gem. Food is delicious and delivery by the owner himself. We had the hummus, baba ghanoush, grape leaves (healthy options platter) and a combo (the stuffed cabbage was really good). In this area we don't have a lot of diverse food options and this place is top notch","useful":2,"funny":0,"cool":0},
{"review_id":"zS0N85-bnkDuMrouA7xj6w","user_id":"MCOUx4H_9BVQW0wtLsTqKg","business_id":"6V8D6uCQ-ChFap59Fc-ZoA","stars":5,"date":"2013-09-03","text":"If you haven't tried Coach's yet, you're missing out. Great casual atmosphere, lots of beer, great specials, and the food is REALLY good. The nachos are amazing. They use pita chips (a spin on traditional bar nachos) and you can get beef, chicken, or pork on top. They also serve different flavors of fries such as cajun, garlic, and sweet potato. All are really yummy! Save room for dessert because they have a trained pastry chef & he doesn't disappoint. \n\nHaven't tried it yet, but they're adding brunch on the weekends; I'll certainly be checking that out soon","useful":0,"funny":0,"cool":0},
{"review_id":"SL3mC9dDu-V11tyOHXqPCw","user_id":"J5ba_qUczyli3O3Tk_P-mg","business_id":"z0cjTX7o6gJsXm2hWHaKGw","stars":5,"date":"2017-09-19","text":"I'm from the Bay Area, CA where there are just several coffee shops that value crafting coffee actually well. But it seems the bay is actually one of the top places to more likely find such coffee shops, where a cappuccino is actually a cappuccino.\n\nSo here's this awesome spot in Las Vegas I've personally found, the first so far in this city.  It was worth walking past a few Starbucks shops on the way here! It is literally written on their walls how they value making coffee right here (there's cool chalk drawings of the differences between different types of orders, TVs showing the farming process, etc). \n\nThe shop is really clean and rather spacious. It's a nice place to even study, have a conversation, or just meet, with outdoor seating as well if you really wanna. It's currently nicely air conditioned indoors, well furnished with tables, and for the jusr 3 times I've been around they've played a nice variety of music.\n\nAfter all I've said about crafting a cup of coffee well, I'll say it was amusing watching another customer complain outloud, asking what was going on today, and how her \"furtado isn't even hot enough\" ^_^ ... What is to note though is how they handled it. They were generous enough to make another one, and just maintained courteous service pretty much. Besides that they've just been the nicest people so far, nice to talk to.\n\nBonus support: Bruxie is pretty close by, if you want a more filling waffle & chicken meal first. Mmm.","useful":0,"funny":0,"cool":0},
{"review_id":"54Q2reAkaA6PJq-8gQiMRA","user_id":"v527c7C9im2fLOGVEacB4w","business_id":"-ucQnELMVRIUOi3-Kv5r0Q","stars":5,"date":"2017-06-20","text":"I rented a Triumph Tiger for 5 days from this dealership. The bike performed flawlessly for the entire trip. The bike was ready for me when I arrived early. Everything was explained carefully and the guys at the dealership were very accommodating. Dylllan in particular was very helpful. The whole rental experience was seamless and I would rent from them again in a heart beat. Planning next years trip now, in fact.","useful":1,"funny":0,"cool":0},
{"review_id":"lUV1KEm4cl4mluSEFharFQ","user_id":"NW6gHZ8PlYl1STK1A1Ixeg","business_id":"e13SEvJud_vgeDR_doL4sQ","stars":4,"date":"2013-03-01","text":"We loved the food. The service was good and we were grateful to be seated right away. We have eaten Mexican and TexMex food while living and visiting in Texas.  The food was very good and authentic.","useful":0,"funny":0,"cool":0},
{"review_id":"tt0b8AJntVN1qo1toskhgA","user_id":"hHSwkgnFY5loMKtOHmmBJw","business_id":"vkQrIXyeAn4GrCnrk2haRw","stars":5,"date":"2016-05-09","text":"Cutter was extremely professional and made sure to find out about my tortoise to make sure he was providing the service I needed and to keep my pet safe.","useful":0,"funny":0,"cool":0},
{"review_id":"aR1fPJR_AKBikvftRJtvxQ","user_id":"hHSwkgnFY5loMKtOHmmBJw","business_id":"vlJsF5tTfplbo1D5kbUPmQ","stars":1,"date":"2010-09-14","text":"If it wasn't for the Groupon I had purchased I would have walked out the door before I sat down.  \n\nThey sell pizza out the back door but refuse to serve it in their restaurant. When asked to be served the pizza I was told by the owner that \"it wasn't a pizza parlor\". So rather than serve me what I wanted I ate an overpriced and bland meal. \n\nMy advice: Spend your money at a restaurant that will accommodate your needs.","useful":1,"funny":1,"cool":0},
{"review_id":"NwTTYm-oVe7GzVsJu0qt9w","user_id":"hHSwkgnFY5loMKtOHmmBJw","business_id":"GwoMn_2-RbapQD_Fuyd3uA","stars":5,"date":"2011-03-02","text":"Eric gives a great massage and I always leave his studio feeling great.  His prices are very reasonable and always tries to fit me in for those last minute requests.  Need a little pampering...give him a shot.","useful":0,"funny":0,"cool":0},
{"review_id":"Y4csu2bbvYcQyIsaKEyf8w","user_id":"q8U1dGxFJ9fQy-NMOFUCJA","business_id":"j3SHAiF8OIlY3kUPnAAlKw","stars":4,"date":"2010-02-02","text":"I love the food at House of Leng.  it's a great bargain at lunch... quck service and huge portions.  The dinner menu is more pricey and the portions are slightly bigger, but lunch is the strong point here.\n\nI've tried almost everything on teh menu and I love it all!","useful":1,"funny":0,"cool":0},
{"review_id":"OVG9oppv5HhI4psZVwAJLg","user_id":"q8U1dGxFJ9fQy-NMOFUCJA","business_id":"kWgdj5qr5WWvn7kAO8Wr1w","stars":5,"date":"2015-09-25","text":"Great service and selection. Have used Munchees several times for party supplies.","useful":0,"funny":0,"cool":0},
{"review_id":"pHREo9PJA8BMp0HpCJLEeQ","user_id":"nKQk9WXdqS5rkgEd8gEGwA","business_id":"FrOMEmctp35zTTDSulyOxg","stars":2,"date":"2017-10-09","text":"Promise discount but did no give , when I got frame home I noticed chipped frame.  Not good service, more money oriented than quality","useful":0,"funny":0,"cool":0},
{"review_id":"IZF-gh6GPahC5pmOy7BGuQ","user_id":"nKQk9WXdqS5rkgEd8gEGwA","business_id":"TCEOq0IoCW76Z7J9jwED9g","stars":1,"date":"2017-10-21","text":"Deseret carpet cleaning- horrible dishonest company!!!!Everyone please stay away from this company.  They promise to clean my custom made curtain took money and returned curtain in even worse shape that was given to them! Refused to give refund, refused to give company address and supervisors name.  Unbelievable.   I don't know where to go or speak with.   Tel # they provided calling center #.   They steal your money and run.","useful":0,"funny":0,"cool":0},
{"review_id":"sqdaBDIbGAQfvB9-mF9ALw","user_id":"nKQk9WXdqS5rkgEd8gEGwA","business_id":"3JgHBYltzNEHwpA6h9ekTg","stars":5,"date":"2017-05-06","text":"Great place. You will not be sorry to have your nails done there.  Prices more on a higher end but you pay for quality.  Recommend!","useful":0,"funny":0,"cool":0},
{"review_id":"JWVJp4TqsdWHb-eIAi7lqg","user_id":"nKQk9WXdqS5rkgEd8gEGwA","business_id":"M_p9elAcRjl2ZrVzItA1BQ","stars":1,"date":"2017-11-03","text":"Stay away from this place!   This place been recommended me by the Costco.  brought my professional loops to repair the frame arm , they fix the arm but broke the glass in the frame.   My loops cost 1600$    They offer to repair and repaired was poorly made.  I ask them sent it to the company who made the loops.  They refused.  Gloria the receptionist and the owner was sweet in the beginning until they made mistake and then She became  rude !!! and unprofessional     Once again due to neglect and poor skills of the repair guy I would not recommend this place     75$ repair cost a lot of stress and now I have to spend thousand dollars to get new glasses.   If you are looking for good quality this is Not! The place","useful":1,"funny":0,"cool":0},
{"review_id":"-b_kIJxLvqYpb39SMAPKTw","user_id":"DZYGeWwBRKHgLUSk12sCvA","business_id":"XwV2-lISDp_5Acy72bA8Qg","stars":5,"date":"2011-01-03","text":"Pros:\n+  Pet friendlly (we did our homework and found only 4 other hotels near the strip that allow dogs, 2 are extremely expensive).\n+  Huge suites!!  Ours was 1,000+ s.f.\n+  Heated indoor\/outdoor swimming pool & lounge area (the pool was so warm even though it was xmas time) and open long hours (8am to 11pm)\n+  Kitchen - very convenient, full size fridge, range, and dishwasher (they even have dish washing liquids, just bring your own sponge)\n+  Washer\/dryer in the bigger suite\n+  Free internet!!  Although their website says you need to pay, at check-in we asked them if they had free internet and they gave us the complimentary login and password.  awesomeness!\n+  Big bathroom\n+  Non-smoking, non-casino hotel, very peaceful\n+  Only about 10 mins. walk to the center of the strip, faster than driving!\n\nCons:\n-  Dusty!  Not sure if it's all of Vegas but I had never noticed so much dust in my room at other hotels before.  \n-  Valet parking: kinda inconvenient when you need to get something from your car\n-  Sofabed is extremely flimsy, if you have more than 2 people, insist on 2 queen beds.  the sofa cushions are much more comfortable.\n\nOther points:\n*  Should call ahead of time to make sure your room have the # of beds you requested when you booked.  (We didn't get our 2 queen beds although we checked in at 2pm.  They were nice enough to switch us to a slightly bigger suite with washer\/dryer.)\n*  Hotel lobby is extremely small!\n*  In-room food service was overpriced (and food was only so-so).  Ask the front desk for a nearby delivery restaurant.  We ordered from there our 2nd night and got a ton of food for 1\/2 the price we paid room service!\n*  Don't go to the 7-11, it's shady.  You can shop at the am\/pm or the Shell food mart across the street.\n\nOverall, it was a good experience for the price we paid ($98).  I would definitely return to this hotel.  I give it a 4.5 stars.","useful":3,"funny":0,"cool":0},
{"review_id":"-fwDwy-iw6aqYRknXsoYDQ","user_id":"WrOumGq1dZ1CiBtz5DAtkg","business_id":"cNx3qzQ55JXpjZEt4lc7Tg","stars":5,"date":"2017-04-19","text":"If you're looking for a place to have a refreshing dessert. Look no further. Cool neat spot!! FREE Wifi! Feeling lazy to drive?? They deliver with postmates. I don't really know how that would work though. Had the Johnny Appleseed, green tea + sour apple Italian ice w\/ aloe. Very refreshing. TRY it!","useful":0,"funny":0,"cool":0},
{"review_id":"OnarpB_zWCd1ZlkCGICJhA","user_id":"WrOumGq1dZ1CiBtz5DAtkg","business_id":"yzmvsG3Vo-2_F3_0wHzJdA","stars":5,"date":"2017-05-09","text":"A spontaneous trip to Metro Diner. My partner and I wanted pancakes so she yelped what was closest to us and this place came up. \nThe place has seating capacity of 91 so it's pretty big for a local breakfast joint. They also have seating outside. \nI ordered the corned beef hash with poached eggs and my partner ordered Yo Hala on the square. My dish was good but I've had better. The Yo Hala is a different story, it was my first time trying something like it so I didn't have anything to compare it to. All I know is it was the bomb!!! \nJessica was our server and she was very attentive. We will definitely go back and try other stuff.","useful":0,"funny":0,"cool":1},
{"review_id":"MmuyrnmcTqzUntvJlMustw","user_id":"WrOumGq1dZ1CiBtz5DAtkg","business_id":"LHXisknIbUy_XtdEQc7x9w","stars":5,"date":"2016-10-16","text":"First time customer here. Rented a car with no reservations and it was a breeze. Ms. Fujiama was very helpful and straightforward. I had a reservation with Payless but when I got to there, Payless had a very long line. Although it was expected since Payless was the cheapest you can get online. So I decided to just try to get a quote from Advantage right there and then and got a cheaper deal. Was upgraded to a Rav4 as well. Their vehicles are recent models. Great car rental experience. Will definitely use the company again. Every rental company is different. Advantage will require you to provide the following: Valid Driver's license of course, Credit card, and a proof of car insurance(even if you're buying their insurance). I don't know if you can rent from them if you don't have a car insurance. They never asked for utility bills though like other rental companies do.","useful":1,"funny":0,"cool":0},
{"review_id":"Lav3eOBnH3RMhgTa_GpQfA","user_id":"WrOumGq1dZ1CiBtz5DAtkg","business_id":"aD0EslPREWGDlSpD0RMlEg","stars":5,"date":"2017-04-19","text":"First, I have to comment about how CLEAN this place is!!! It's weird!!! Coming from the service industry, I always look at the cleanliness of the place and this place exceeds my expectations! I was in awe how clean their cutting board was! lol. This place will make you feel like you're not in Vegas. The food made me reminisce that time when I was at the night market in Kowloon! A place I definitely will frequent more often. I tried the BBQ duck with rice and washed it down with a Thai tea. I will recommend both! CLEANEST Asian restaurant I've been to!!! You gotta try it just for that reason!","useful":0,"funny":0,"cool":0},
{"review_id":"kb4wVyAkSugN7lC5JI2BTg","user_id":"WrOumGq1dZ1CiBtz5DAtkg","business_id":"DHUAQ4pzH9KKzGZDm1jZLg","stars":5,"date":"2017-04-26","text":"Was greeted with a FREE freshly made donut! I can't really say anything about Krispy Kreme since every single human being loves this awesome place! Thanks for being a part of our lives!!! Doctors should prescribe Krispy Kreme for patients with depression since every bite of their donut gives you joy! Thanks to Dawn & Deanna for their hospitable service! Great crew!","useful":1,"funny":0,"cool":0},
{"review_id":"ZRCuRMykVUSGxVjU7ovX4Q","user_id":"AHqllFSymH4TK5BkedTIZg","business_id":"CzWTjbjzvTndiiE-wGzsSg","stars":5,"date":"2013-01-25","text":"La plus meilleur tarte meringue-citron sur Masson!","useful":0,"funny":0,"cool":1},
{"review_id":"XK64pKiGORD7cRHUPQTdfw","user_id":"AHqllFSymH4TK5BkedTIZg","business_id":"Akhq4AKxKRDPa6BHpiSEVQ","stars":5,"date":"2015-10-15","text":"Bon concept. Bon prix. Bonne ambiance.","useful":1,"funny":1,"cool":1},
{"review_id":"Dgr1Kb4igsi_y_VSHYnUcw","user_id":"5w9Dqx7MhbCDBeNE4pNBdw","business_id":"_Ahg3MfDXfKrh36NUadNbA","stars":2,"date":"2013-11-26","text":"Atmosphere: weird, it kind of felt like a Perkins that hadn't been updated in several decades. \n\nService: questionable, server seemed untrained and uncertain of how to do the job\n\nFood: acceptable, but the menu was oddly limited and had nothing in the way of sandwiches or other medium-sized meals\n\nPricing: not totally out of line, but a little high for what you get","useful":1,"funny":0,"cool":0},
{"review_id":"w4LQeYXn38xENE6pFoHuFw","user_id":"_Q37LYD2ZIaVmwJQZb9EZw","business_id":"fvau2MPO14S62-Ul8mNTwg","stars":5,"date":"2011-04-20","text":"I LOVE Roscoe's.  Fantastic Food, wonderful service.  The cornbread is delectable, the sauce is amazing, and I can't help ordering their homemade potato chips.  Deeeelish!","useful":0,"funny":0,"cool":0},
{"review_id":"1AKl9h0JQAX5tvnnpi7BvQ","user_id":"2K2o6EvDr2j0DKZ5xBT93g","business_id":"xy5dOJcJ3HfBmtSH3gQGQQ","stars":5,"date":"2015-08-12","text":"Wow! Jennaya is a sassy little number with the skills to  pay dem bills. She rocks my cuts. I'm 35 and she is beyond a doubt, the best I've had. Doesn't matter if I got time to shot the breeze or if I'm running behind. Jennaya gives me the same service in no time at all..... She doesn't know if she'll ever understand the man's mind, but she understands how his hair is suppose to lay on it.... Thanks Neya. This one's for you!!!","useful":1,"funny":0,"cool":0},
{"review_id":"CY89CHhlwEUfSuqkHubLyw","user_id":"kZVXlQ1SJB3PeqaUjn-jRA","business_id":"H_AEozeQfFrn6VJGDJEcKA","stars":5,"date":"2017-03-21","text":"I recently spent my first ER visit at Southern Hills Hospital. Having been in many hospitals throughout the country,  the service I received at Southern Hills was excellent.","useful":0,"funny":0,"cool":0},
{"review_id":"nGjlrDWXYaledNCwKe1t2Q","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"9Ltfy9Hgizai-OT9LoD4HA","stars":4,"date":"2013-05-13","text":"Another small gem in Queen West. Great tasting food (you have to try the Koubideh), relaxed yet original atmosphere, good service. All round good times.","useful":0,"funny":0,"cool":0},
{"review_id":"goG2EQn2FsaDFDi50xFDKA","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"qy4WKXTBkqD4zX0rohYF8Q","stars":4,"date":"2013-04-24","text":"Wonderful place tucked away on Adelaide West, seems small when you enter, but has some great space in the back to relax. It has a very cozy feel to it and is well decorated, ideal for a relax working spot. Although it was a bit warm when I was here.\n\nHalf coffee shop, half kitchen\/house store. You only get one selection of coffee (columbian). Unfortunately, the Batista wasn't very knowledgeable and wasn't able to tell me if if the beans were from a single origin. Espresso was good, not outstanding.","useful":0,"funny":0,"cool":0},
{"review_id":"iVLy_4z_CzfqUzlQmqpgZQ","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"OpYcHzNmEcsQ8vvk-ojDPw","stars":4,"date":"2013-06-24","text":"I'm a fan. A fresh selection of local and seasonal foods with a menu that changes very regularly.\nService was great, Robert our waiter was very accommodating, friendly, and fun.\nThe food was delicious, and I was lucky enough to get a grass-fed beef sirloin steak - quite rare to find.","useful":0,"funny":0,"cool":0},
{"review_id":"78z6_zY2FuLlb5a8qr7NJQ","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"kGOr_D-LNpgZ2M9N8TT4QQ","stars":3,"date":"2012-11-14","text":"Decent food, nothing spectacular.\nThe place is loud.","useful":0,"funny":0,"cool":0},
{"review_id":"DwiZ4wmSRuU2Oy9e4d9k1g","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"ZumOnWbstgsIE6bJlxw0_Q","stars":4,"date":"2013-05-13","text":"One of the better steakhouses I've been to in Toronto, great selection of beef with some good seafood pairings. This is a very upscale restaurant, and service is great. I definitely recommend the ceaser salad, completely made in front of you (even the mayo!).","useful":0,"funny":0,"cool":0},
{"review_id":"ehlsZ3mxgyVIee1hNaNaTg","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"hLThl4NxoJmHadtb6vLNsw","stars":4,"date":"2012-11-13","text":"Great food, great presentation, very knowledge accommodating and friendly waiters, slow service","useful":0,"funny":0,"cool":0},
{"review_id":"IunSxAgG97p9nVMqwRuo-Q","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"K3NW8TEu4QRQvFvHer8v4A","stars":5,"date":"2013-04-30","text":"Hands down the best seafood I've had in Toronto, and I've grown on the Mediterranean with an abundance of freshly caught seafood. Seafood is cooked very simply, the way it's supposed to be (no fancy dressings, etc.)\nDecoration is funky, and adds a fun touch to the experience. Apparently, the owner's dad was the artist that brought \"the breast\" to Toronto (the women's breast that is). Check it out!","useful":1,"funny":0,"cool":0},
{"review_id":"Rh93FXW1txY8xSc3oht21A","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"gZ4VtOCDgK5jkPoE79RVEg","stars":3,"date":"2013-04-24","text":"Ambience is great with live music (tam tam and piano when I was there), well decorated slightly upscale place. Unfortunately, food was ok, menu items were interesting but taste was a bit disappointing. Overall, worth a shot if you don't expect great food.","useful":0,"funny":0,"cool":0},
{"review_id":"GFYCAMzuu5w6oVvfqf7lpg","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"5EMadlOW4sta6CEtJHf9uQ","stars":4,"date":"2013-05-08","text":"Wonderful aboriginal-inspired restaurant at the edge of queen west. \nA great (but short) menu that offers a great selection of seasonal and wild ingredients. The menu is changed monthly.\nFood is meant to be shared, tapas-style, and even though portions are on the small side almost every meal I've tried is good to great (I tried 9 items, out of ~15)","useful":0,"funny":0,"cool":0},
{"review_id":"8StEKEjLWFSyfcOo8WXMPA","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"By2DQwaG2EiOxsuHnS8FoA","stars":4,"date":"2013-04-24","text":"Great food with a fresh small selection of seafood, nice and knowledgeable staff,","useful":0,"funny":0,"cool":0},
{"review_id":"9uM2pekGdp8WEcvWEKkyiQ","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"zrYpLdnGKA_EmOhgRCy_vg","stars":3,"date":"2013-05-13","text":"Lovely small place with great decoration\/ambience, sadly the food is very mediocre, the prices do make up for it somewhat.","useful":0,"funny":0,"cool":0},
{"review_id":"D8JZ8ZJMTdxDZOkwx7bAiA","user_id":"mR79x9r4o02BrTOOzXa-jg","business_id":"1pE3hc4Y13X2wCjhhi1e-g","stars":5,"date":"2012-11-20","text":"Fresh and tasty food, great selection, very friendly staff, nice environment. Line do get long at peak times.","useful":0,"funny":0,"cool":0},
{"review_id":"pE6BNYU3mEi9y1pS5fnPpQ","user_id":"06LACu59TbIHOXYn14CkPA","business_id":"yADOyFmSlHuixlQ4MtHhcQ","stars":5,"date":"2017-10-05","text":"The servers in this place are great they all know what they're doing and are very nice. The food is great and the atmosphere is very relaxed. And the food comes fairly fast. I love this place definitely recommend","useful":0,"funny":0,"cool":0},
{"review_id":"oKDGOblyFODJssOZxNlWtw","user_id":"PUZepJ4M1jTCrYM6gmYKfQ","business_id":"4IEt7Yucgh3LF_0jcAnD5w","stars":5,"date":"2016-10-10","text":"My favorite furniture store in Las Vegas is Nest Featherings, hands down. They have timeless, quality pieces, and can custom order anything you'd like. We just purchased a 12X12' leather sectional and I could not be happier. The designers are friendly, helpful and knowledgeable, and I always like supporting family owned and operated businesses.","useful":2,"funny":0,"cool":0},
{"review_id":"8Jy-Kg876PbgO3dCKz9B0g","user_id":"YQAB77GMyeH8SLRirg9zJA","business_id":"gUzbSum6xL94XrtIZrE2Hg","stars":5,"date":"2013-12-21","text":"Great service, very courteous and knowledgeable. Installed color conversion kit for my iPhone flawlessly. Highly recommend!","useful":1,"funny":0,"cool":1},
{"review_id":"8l9bParuSPuVdNguIyFmWw","user_id":"sm532xNx-vSRO9CMcfqVZw","business_id":"ePENUZsGmPzT2NSJAjQhlQ","stars":2,"date":"2016-11-02","text":"Very long wait to be given prescriptions for back pain. Over a two hour wait with no one in the waiting room. Once the Dr. Came in had to wait again for the actual prescription. There should be more Drs on staff and the wait should be told up front to give pet owners options to go elsewhere.","useful":0,"funny":0,"cool":0},
{"review_id":"l99GA70EnRFVUd4WXQkyYA","user_id":"sm532xNx-vSRO9CMcfqVZw","business_id":"_58iFj9Hj5NMVECaAkLjog","stars":5,"date":"2016-05-26","text":"I purchased a groupon for a 90 minute massage. Although my therapist was running late for my appointment she gave an excellent massage and I rebooked with olena.","useful":2,"funny":0,"cool":1},
{"review_id":"lr5blFSZWDqTLHuSyQtmsA","user_id":"sm532xNx-vSRO9CMcfqVZw","business_id":"Yemfgx9S_UzK9Rbqpbl6nA","stars":1,"date":"2013-08-20","text":"My husband and I found this business at the Arizona home show.  The owner was very nice and the company was licensed and bonded so we thought we were in good hands.  We had the owner come and look at our brand new home and give us an estimate of painting the inside of our home.  The price was reasonable and being that we found this company at the home show and because the company was licensed and bonded we hired them to do the job.  We were told the job would take 4 days and we checked on the progress every day.  Again this is our brand new never lived in home, on the last day of painting we checked on the progress only to find the painting was completed along with major damage to our brand new shower.  The owner did not call us when the damage occured and when we contacted him he fessed up and apologized that one of his workers had fallen off a ladder and broke an entire slab of stone in our shower and promised to take care of the damage.  When we asked why we were not told when it happened the owner said he was trying to come up with a solution first.  Seemed odd to us we werent told immediately but let it go.  We then had to get the original stone installers to our new home for an estimate and provided the estimate to the painter.  The owner of the company did send us a check for the difference of what we owed him and the damage to our stone which is still not yet fixed as it had to be ordered so we have been without a shower now for over two weeks.\n\nWe thought this would all be behind us and that it was just an unfortunate accident that wasnt handled very well.  That was until we found further damage to the outside of our home.  It was obvious more damage was done by the companies workers!  They had dragged a pallet of paint from our gate to our back door in our backyard.  The pallet was left in our backyard and we were able to trace the lines the pallet made all the way to its last ending point.  Based on the tracks it appears the workers pushed the pallet around the corner of our house and pulled so hard it removed the stucco and paint from the side of our BRAND NEW house.  \n\nI was never advised of this damage either and when we emailed the owner of the company we never received a response.  We are beyond dissatisfied with this company based on the damage they did to our home not once, but twice and how it was handled.  We have never written a review on a company before and have never been so dissatisfied and wanted to warn others of our experience with this company.  Our suggestion although the price may be reasonable choose another company for any painting needs BEWARE OF THIS COMPANY!","useful":3,"funny":3,"cool":1},
{"review_id":"i0sTmmleUIGrtWJSSht0Xw","user_id":"sm532xNx-vSRO9CMcfqVZw","business_id":"wnuBO-iMfdVjEncqoSyOCA","stars":5,"date":"2014-08-23","text":"4 paws does a great job grooming! We only take our dog here to be groomed.  They take great care of our dog and are always professional and courteous.","useful":2,"funny":0,"cool":0},
{"review_id":"qrlPU5jb_IRftbMj3rmCUg","user_id":"sm532xNx-vSRO9CMcfqVZw","business_id":"IuOFGmsMOKUhkJNMvJewRQ","stars":5,"date":"2015-08-18","text":"I just went to the Mesa location and was very pleased with the service.  I had been at the Glendale location a few years ago and was happy with my laser results. I would recommend AZ laser. Rebecca at the Mesa location was fantastic!","useful":0,"funny":0,"cool":0},
{"review_id":"6pQAl9-T3BV28qa1vQY8fw","user_id":"sv4Qz5-0DK6dQDsBjzG3OA","business_id":"BeRtYRSfyZgL1MWgcEx_IQ","stars":4,"date":"2016-06-02","text":"Purchased a car from Preston at McCoy Motors.  They were very nice and very helpful.  Process was smooth and we left with the car we wanted and the payment we asked for.","useful":0,"funny":0,"cool":0},
{"review_id":"jXNH34lJ9J97LnjPG76iKQ","user_id":"h0mL0eKqsK1urMXhXWDzcw","business_id":"x2kGa_XkRy00cYotdlfmag","stars":1,"date":"2013-06-24","text":"Quite possibly the worst food I've ever eaten in my entire life. Literally. We ordered the chili beef, garlic chicken, and masala noodles. The chili beef was just spicy. It had absolutely no flavour. The garlic chicken was too sweet. And the masala noodles were the most horrific food I have probably ever eaten. They were extremely dry and there was so much \"masala\" powder on them that brining the fork two inches from my lips caused me to gag. If you're near Markham and Steeles and are craving Hakka food, make the drive up to 14th and eat at Fredericks!.","useful":0,"funny":0,"cool":0},
{"review_id":"-rHh7ZtOVHkOUaLQRL7ePg","user_id":"KlqjF1807bm09Qt2oGocDQ","business_id":"NLWOiFwHn2PlWrjC6UhJSg","stars":3,"date":"2014-02-21","text":"Spiffy place, definitely a social setting. I enjoyed the concept of the bar not to mention the staff especially Taylar who was extremely helpful and informative. Taylar made the experience amazing keeping a smile on her face throughout the entire time. I do think the drinks could be a little stronger, I could barely taste the alcohol. Overall it was a cool experience.","useful":0,"funny":0,"cool":0},
{"review_id":"2mKlodmyv4kIq-Rj7HY-Sg","user_id":"MkLaM0Np_e46GAYn7kJulA","business_id":"USleI8g1UVN9-9jm-b4uIg","stars":5,"date":"2011-10-06","text":"Rivals my experiences at Napa valley restaurants.  Very unique menu. Interesting appetizers, excellent well prepared fish dishes.  The wine list was excellent and prices were moderate. The restored Lucas house provided an intimate experience with excellent service by Ty.","useful":0,"funny":0,"cool":0},
{"review_id":"GZr8wcSbNk1_qtKmwAyKmg","user_id":"MkLaM0Np_e46GAYn7kJulA","business_id":"61Gcb01LdGskyOidVSAmWg","stars":3,"date":"2011-10-06","text":"Not great but just ok.  Backed oysters were above average but the yellowfin tuna was unremarkable.  New York steak was not as tender as it should have been.  I think they did not serve Choice cuts.","useful":0,"funny":0,"cool":0},
{"review_id":"2aAECrbppf9W9dbnRCekxA","user_id":"MkLaM0Np_e46GAYn7kJulA","business_id":"1MvR4NJQbHy0i7ME1IoYpw","stars":4,"date":"2013-04-29","text":"If you have been to Morton's and other pretentious steakhouses, you are in for a treat.  This place is very retro steakhouse, almost corny.  I love it. Steaks are great salads are build you own with ingredients delivered to the table.  The outside looks like a windowless bar but the inside is warm and inviting.  Is that Bogart in the corner with a martini?","useful":1,"funny":0,"cool":0},
{"review_id":"ZVYZZmb4n0VfUd8IlUsAnA","user_id":"8NTgvv8rTmF7T1wU2XC-ug","business_id":"hgc-YJELr_899ExB92z6jw","stars":2,"date":"2016-12-28","text":"We came here for a full dinner but left after our drinks so this review does not grade the steak but the lackluster service. \n\nFrom the moment you walk in, you are (or should be) tempted to leave. The \"hostess\" doesn't smile or greet you, but hastily takes you to a table. Then the waitress comes with the same attitude and lack of knowledge of the food, wine or beer. She couldn't answer even what beers they had or what was different about them. After saying we were ready to place our order she disappeared. After a long duration she returned, at which time we decided we had enough. \n\nI may give Longhorn another try, but not at this location.","useful":2,"funny":0,"cool":0},
{"review_id":"atjLGu58AreVtvwkyt90rA","user_id":"8NTgvv8rTmF7T1wU2XC-ug","business_id":"wfxmuA7LbKZKVLV58EiWBw","stars":3,"date":"2016-12-28","text":"The atmosphere is pleasant in that it feels rather cozy and the servers are extremely good here. \n\nHowever, the letdown for me is the food itself. \n\nThe filet mignon I ordered looked like it was pan fried and it was the thinnest filet I have ever seen. It was a good cut, though being nice and lean and cooked as requested. \n\nBut... I couldn't taste the steak. All I could taste was their salt \/ seasoning salt. It was completely overbearing. I also ordered a baked potato with nothing on it and steamed broccoli. Well, you guessed it, all it tasted of was salt. I drank so much water afterwards trying to get rid of the salty taste but it just didn't work. Honestly, it was a terrible feeling for what could have been a good meal with pleasant service.","useful":1,"funny":0,"cool":0},
{"review_id":"azjbEiBrRBGTebMFsSwSZw","user_id":"8NTgvv8rTmF7T1wU2XC-ug","business_id":"BqnxN4hHahZ-zZGXDDGLsg","stars":1,"date":"2011-12-28","text":"We were staying at the Camelback for Christmas and decided to go to BLT for Christmas Dinner as they had a special menu. We could not have been more disappointed. \n\nThe initial toasted bread and pate was very good and all seemed promising. But this was then followed by a salty greasy puffy bread. \n\nThe snails and the salad was quite good if almost too large as the salad was absolutely huge, but that's not really a negative. \n\nThen came the moment of truth - turkey dinner. It was dry, small, and mine had lots of skin and cartilage in one of the slices. Very unpleasant. Plus, the sides were very unorthodox. A chicken pot pie with gravy and dark meat. Not good. The brussel sprouts - a $10 side - were cooked with bacon and ham and all you could taste was salt and smoke. The sweet potato - another $10 side - was blended with marshmallow on top. Yes - marshmallow. We tried digging for the sweet potato but we couldn't find it beneath the marshmallow. \n\nThe service wasn't bad, but the food lacked any subtle flavors and everything was overdone.\n\nThere are much better choices out there as we discovered during the rest of our stay.","useful":0,"funny":1,"cool":0},
{"review_id":"PozbovkjtUP8Gsw03qlglw","user_id":"UuhXs5GmOx9BEdLGJUXyEA","business_id":"vkQrIXyeAn4GrCnrk2haRw","stars":5,"date":"2016-06-01","text":"Always on-time and professional! The technicians care about the quality of their work and to solving the problem...aka scorpions. Adam did a great job today. Thank you!","useful":0,"funny":0,"cool":0},
{"review_id":"s3jmKZ9VCaGIuZXUQqyqyQ","user_id":"UuhXs5GmOx9BEdLGJUXyEA","business_id":"vGDhK2Lc4Np5iZYZ7FG0QA","stars":5,"date":"2015-11-18","text":"Fantastic! Great new neighborhood restaurant under wonderful ownership. Carnitas and enchiladas were winners. We are definitely coming back...again this week! Thank you!","useful":0,"funny":0,"cool":0},
{"review_id":"mbogEx4x2f548R22gbPKQg","user_id":"EOZh96wAXim06lQHuNyejA","business_id":"3wGsvZj5-_YtM-4D4JndDQ","stars":5,"date":"2012-07-10","text":"I was very surprised. Went in to check it out and the gyro was amazing. Also ordered a grilled chicken sandwich and was surprised how big it was. My new favorite spot.","useful":2,"funny":0,"cool":0},
{"review_id":"5OLScdlCyat5BIT6VIIPsQ","user_id":"EOZh96wAXim06lQHuNyejA","business_id":"PRbIMseOwPCCRv5C4SfTDQ","stars":1,"date":"2012-07-10","text":"The service was slow. The food is pricey but average tasting. The catfish was undercooked and the chicken overdone. Won't go back.","useful":0,"funny":0,"cool":0},
{"review_id":"dFFVT6jFbbEz-4ccvFroOg","user_id":"scUeSBEVCd2_VovIo63ngg","business_id":"Bf2fuqWbHd3L-X69FSMvmg","stars":4,"date":"2015-03-05","text":"Went on a weeknight and was treated to great service and delicious food.\n\ntiny and really packed, but we were served quickly. the margaritas were great with not too much tequila, and the fish tacos were awesome! fresh and filling considering there were only two and they were quite small.\n\ni definitely plan on coming back soon!","useful":0,"funny":0,"cool":0},
{"review_id":"WwAJhNhUfyOi_LqJjSyE8g","user_id":"MML6NN1uHL1xxOnp46m2lw","business_id":"29dIXUeStU7flMUV-630Uw","stars":3,"date":"2015-09-07","text":"Sushi was nice, fresh fish of a good quality, but, a bit pricey and the service was a little hit and miss. Took about 20 minutes to bring our drinks which was rather long when we calculated about one server for every table ! All in all though, perfectly fine for a quick meal if you are near by, but I wouldn't go out of your way.","useful":0,"funny":0,"cool":0},
{"review_id":"_2IyJlLaUz10Tbah5Vb0NQ","user_id":"wfXNfLhTOhKBxPFZDgaPNg","business_id":"N5B7OBTyNGgwU_Y2fwNcyw","stars":5,"date":"2013-12-15","text":"Such a cute restaurant! Went there for breakfast - good coffee and their new potatoes were amazing.","useful":0,"funny":0,"cool":0},
{"review_id":"-9SndZXf480E329AB0auLw","user_id":"5rX5NZApPTfeVv_eqd8qWA","business_id":"lmxA0dJM0XsPCIHPXhEQ-g","stars":5,"date":"2016-12-06","text":"The place was fully booked and we didn't make reservations, so we sat at the full service bar. The bar tender Annahita, took wonderful care of us! Drinks were creative and paired well with the food, and holy crap the food! I recommend the tuna tataki as a small plate and the 49th state roll. By far some of the most creative and tasty sushi we've had in a while!","useful":3,"funny":0,"cool":2},
{"review_id":"5KavdVruoZPuAorV0Dj_9A","user_id":"8eODUKOnFxal0OAF-vHg3g","business_id":"qDl34ITEzEQNypLSJzTJTw","stars":3,"date":"2016-08-08","text":"This location has great service and as always the food is great. The only thing is the play area. I have been here on so many different occasions that I'm disappointed to have to say that time and time again the play equipment is disgusting. The room always has a nasty urine odor to it. But it's the actual climbing equipment that has made me not allow my kids to come and play anymore. Every time they start climbing their hands, knees and feet end up black from grime. The slide is so gross and sticky you can't even slide down it. I'm not sure what the cleaning requirements are for these types of areas but something desperately needs to be reevaluated and fixed. I understand that lots of kids play throughout the day, but it is just unacceptable to have such a filthy play area.  \nI hope they can get higher standards of cleanliness established as soon as possible.","useful":0,"funny":0,"cool":0},
{"review_id":"JEq5gASwZOAOaHxOmY9mlA","user_id":"8eODUKOnFxal0OAF-vHg3g","business_id":"5AzcNTr0kPAspT_v-TWTIw","stars":5,"date":"2016-08-23","text":"My husband I and both have been seeing Alisha for four months and I cannot say enough great things about her as a stylist and colorist. She is meticulous and thorough. Every hair cut has been fantastic. And her skills at doing color are better than any I've ever had. She always checks the costs before you have any services done, and I feel the prices are very fair for what you get. I'm a Chicagoan so I've had many many extremely expensive hair services done in the past and Modern Salon is less expensive than what I've had before and offers better service as well. \nEveryone is very friendly, polite and goes out of their way to assist you. I would recommend Modern Salon to anyone but mostly I would say book with Alisha. She is such a great stylist and a wonderfully warm person as well.","useful":0,"funny":0,"cool":0},
{"review_id":"Bt7KojjX6JL3t7u50IPSAA","user_id":"dXbakFge5FirzLTTejpbjA","business_id":"JIETwXSEGIHMNyxZVEnNKQ","stars":3,"date":"2015-05-30","text":"Stopped in here for a quick brunch one Sunday morning. Had the sprouted bagel sandwich and lemonade. Meal was delicious and would recommend it. \nOnly negative was the service we got at the counter - guy was borderline rude and I paid for the meal feeling like I needed to apologize for something given his attitude.","useful":1,"funny":0,"cool":0},
{"review_id":"KqQwNyfoFiJOw911mrULIg","user_id":"NJxaA7q9BhqaDrFpfR2Jeg","business_id":"t0T_4MM4EUHbCzBTF11FHA","stars":5,"date":"2016-08-14","text":"Great little restaurant. Not to many tables and its byob, which is awesome. We had the Pad Thai and the coconut curry noodles and it was absolutely fantastic. I would absolutely recommend this on a cool day when you want to warm up!","useful":0,"funny":0,"cool":0},
{"review_id":"BiRgooUf9nF5yEfikwhIQQ","user_id":"NJxaA7q9BhqaDrFpfR2Jeg","business_id":"973nneT7EUq8p2JU5bQjsQ","stars":5,"date":"2016-05-09","text":"I had a great experience when I came in for a routine cleaning last week. I will absolutely be coming back! The reception desk was fast and friendly. I didn't not have to wait more than 5 minutes to get taken back. My hygienist was lovely she really explained everything she was going to do and was very friendly. Great place :)","useful":1,"funny":0,"cool":2},
{"review_id":"XN0f2ZdoLt1nVGu9rUXAaA","user_id":"VAr4kL1VphCBFZmyF_9WKA","business_id":"9ba2odSWsMCDqTogoqGcqQ","stars":1,"date":"2014-06-10","text":"I want to rate this company as a negative 5 star company. I don't have the energy to  write a detailed review because for the last year and a half, my energy has gone into playing phone tag and  complaining about  the lack of service from my usual tech. The day I received my keys for my house a year and a half ago, I checked out the condition of the pool. The pool was clean but the vacuum was very slow. I called to let them know it's not working properly an was told that I need to turn it on.  That was their attitude towards the situation. My reason for calling that day was to avoid what actually ended up happening....which is a pump replacement. For the last year and a half I have been calling to say that, basically, the pool is constantly dirty and green because it's not working and have asked if someone can check it out. Usually, my request is ignored. If, somehow magical forces collided, and the tech actually does take a look, I have been told that the issue is an o-ring replacement or a diaphragm replacement.  I have paid for parts multiple times but I am not sure if the parts were actually replaced because the issues continued. Again, my concerns were ignored until just recently they told me I need a new pump. I am irritated because they are sayin I let the pool get too dirty and that's why the pump has gone out. I  have tried to complain about the tech letting the pool stay green during the winter months but nothing was done about it. Their response was that the tech never mentioned anything about it. Of course not! He would be snitching on himself for not doing anything about it. They tried to tell me that the pump went out because I never had the cleaning service done. I never did because why would I have them brush the steps and tile when I do that myself and I do not trust them enough to take care of the other comps ta of their cleaning service because they rob me already by not doin anything when they see the pool needs to be backwashed and when the pool is green. Plus, they never said the cleaning service is needed for the pool to function properly. They were only trying to up sell this service. \n\nAlso, this company will try to sell a service to lower yor calcium level. Don't fall for it. They will call and email you about it...DO NOT fall for it. Many pool companies try to sell this service but it's bullshit. My bottom of my pool contained a lot of dirt because the vacuum wasn't working and it was green for months but the tech never took the initiative to fix it but yet I'm getting calls AND emails about my calcium levels. Really? The tech will report that but NOT a green pool? I do t think so.\nPlus, while speaking with an overly defensive customer service representative today, this individual read through all of the notes and NOT ONCE did he mention the calcium levels were high. That's because it's all fake.\n\nThe only reason why I am a customer is because of the salt pump.","useful":5,"funny":1,"cool":0},
{"review_id":"IZn1bjzBNrHH9M9-8e3eTA","user_id":"VAr4kL1VphCBFZmyF_9WKA","business_id":"dlxUmYs7WEMuZweAx6x-rw","stars":5,"date":"2014-06-16","text":"Wow! The employees and owner all live up to the name and their mission. The owner came by to check out my situation the next day after I contacted Honest Pool Care. He was very eager to check it out, as he was concerned about the problem becoming worse if we waited too long. He was very thorough during his visit. He wasn't there for the full hour. Therefore, he had no interest in charging me for the full hour visit. He gladly reduced the price for me. Awesome! He could have very easily charged me full price as he was there for more than 30 minutes. He told me what he thinks might be the root of the issue but stressed he would talk it over with some repair techs to be sure and to avoid unnecessary costs and repairs. After discussing with his crew, he called me to inform me of their findings the following day. I love that this company is on top of things! Regretfully, I was a former Poolman customer. Dealing with that company is like pulling teeth. It takes a week just to talk about an issue with that awful company.  He was honest and told me what he had initially thought was the issue, no longer seems to be an issue at all. He explained to me what was going on and offered me options to fix this problem.  I appreciate that as well because he could have easily taken advantage and  only offer one solution...one where his company would profit. Experiencing this level of great customer service helps to ease my nervous attitude toward this situation. Also, I must note that I live in South Phoenix. I called multiple pool companies that claim they service Phoenix and surrounding areas. However, none of them were willing to come this far south. Honest Pool Care, according to this site, services Tempe and surrounding areas. This company is willing to come to this area. Also, they could use horrible business tactics and \"tax me\" in a way for the drive but, thankfully, they did not. I absolutely love this company.","useful":2,"funny":1,"cool":0},
{"review_id":"GBcjB0WGtwrgaOFdGiBqMQ","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"thlAnPN1ApoNxSnok_fcvA","stars":5,"date":"2015-07-17","text":"Huge breakfast, really creamy, tasty waffle & pancakes! We could have fed another person with all the food served, we will be back!","useful":0,"funny":0,"cool":0},
{"review_id":"qVwNMo_SPF7budzBjJApVw","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"bBYRKQHUEdpVLTXHV_jHyA","stars":5,"date":"2016-08-07","text":"I've been going to Maura for a few years now and find her very professional, convenient and love the online booking. Maura listens to concerns and will work with her client's to get the most out of your massage. Will continue to schedule with Maura in future!","useful":0,"funny":0,"cool":1},
{"review_id":"TtyHMDeRmIJuEhlASowjQw","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"UGthfmx9buqD-SAJZiIlOw","stars":5,"date":"2015-11-21","text":"Great job! My first time using Embroidme and it's been great!  Needed jackets ordered and embroidered quickly for Christmas for employees and Larry came through. \n\nLarry guided me with ordering, colors, etc. and jackets came in quick and the embroidery is perfect! I will be using this store for uniforms and promotional items again!","useful":0,"funny":0,"cool":0},
{"review_id":"wBFdZNE3a5wKNnWjFUU_pA","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"Iq7NqQD-sESu3vr9iEGuTA","stars":5,"date":"2015-11-01","text":"Wow are we glad we found Butters! Was searching for a new breakfast place and happened on Butters. Nice neighborhood spot, family friendly, clean restaurant with seating inside and outside patio with umbrellas. Greeted by friendly hostess and seated pretty quick, wonderful friendly waitress! Awesome coffee, including coffee barista for special drinks, fresh squeezed orange juice. We had delicious fresh blueberry pancakes and a great fresh ingredient California scrambler. We will be back to try more of their beautifully prepared breakfasts!","useful":3,"funny":1,"cool":2},
{"review_id":"cVp6_YfLNPvJ91APhCysjA","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"yz66FIUPDKGhILDWzRLeKg","stars":5,"date":"2017-10-27","text":"Great New Mexican food! Being from New Mexico we are picky and hadn't found a great place to find our loved Hatch green chili. Yes, really like the food here, give it a try!","useful":2,"funny":0,"cool":0},
{"review_id":"kK_ldQOJG10HOE1XiZhwzQ","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"CX8pfLn7Bk9o2-8yDMp_2w","stars":4,"date":"2016-09-03","text":"UPS store has been under new management for many years and they are much better than before! Give them a chance as they are very customer service oriented, friendly, efficient and helpful. Am a small business owner with a mailbox at this location, so I am there every day. Certain things are expensive but that's what you pay for, the convenience! Overall, the mailbox service is great and worth one-stop Mail and package service!","useful":0,"funny":0,"cool":0},
{"review_id":"uiD3b_bcsjuroYBQ_dbctg","user_id":"8Go8Su7wk1XBztSpJ1qI1A","business_id":"9t9n0QsonQDYrT4vJuugXg","stars":5,"date":"2017-10-24","text":"What a great surprise this restaurant was! Go to Sonoran Salon monthly, but hadn't given the Grotto Cafe a try for anything more than ice tea & great lattes. Today went for lunch with husband and throughly enjoyed our yummy grilled sandwiches. Welcomed and encouraged back to try breakfast by a gracious manager. Yes, we will be back!!","useful":0,"funny":0,"cool":0},
{"review_id":"7CpyKMVdKxb0lCLKySc89A","user_id":"XlY6Fm8ercC8yo1r_aqiEA","business_id":"VTxsR3s6uTlJ1_Vep_bx2g","stars":5,"date":"2010-10-12","text":"Very tasty food for a good price...Israeli\/Middle-Eastern menu...something worth trying; hummus with hot mushrooms and rainbow trout.","useful":0,"funny":0,"cool":0},
{"review_id":"Mmbxv1SIZp2nQniivcfbYg","user_id":"XlY6Fm8ercC8yo1r_aqiEA","business_id":"a8ECAeXMEEUeCidS7vvCyg","stars":1,"date":"2010-10-14","text":"I was happy to see that  this mall has this restaurant because it is one of my favorite places to eat. I usually go to the Promenade location....and very happy there but Vaughn Mills its a totally differrnt story....\nI am walking in with   my husband and two kids. Right at the front they tell me i have to leave my stroller behind...are you kidding me... no restaurant has ever ask me to do that before...what if one of my kids was sleeping? i actually  try to time it that way so i can eat a meal in peace.\n\nSince we were all hungry i figured ok lets just stay in.I asked for a booth because it is easier to manage my 3 yr old in there.The waitress gave me a weird look and said that a booth is not available and we can  sit at a regular tabe...why...i do not know...the restaurant wasn't even that busy\n\n.ok so i am getting pretty irritaded by now...i insisted of getting that booth...she gave it to us but with an attitude. I figured it can not get any worst than this lets just enjoy our meal.\n\nAs i am getting the menu i ask for the high chair...the waitress tells me she can not give me the high chair because we are sitting in a booth...what?!..i always get a high chair sitting in a booth and it is never a problem and maybe if you didn't take my stroller away i would be able to put my younger child in there.\n\nAt this point i asked for a  manager. She tells me how it is dangerous for my son to sit there because it is blocking the waitress to serve the food to our table  and the food is hot...and they are concerned about safety...believe me there was more than enough space \n\n\nI was quite upset at this point so she brings me a high chair...the one that you are supposed to strap in to a chair...hello...i can not strap this to anything we are sitting in a booth...am i supposed to sit my 1 yr old child in a high chair that is not straped in into anything...i think that it is pretty dangerous!\n\nDon't ask why but we stayed anyway with me and my child sitting on my lap.\n\nBUT I TOLD MYSELF I WILL NEVER COME HERE AGAIN ...EVER!\n\nIt is a waste of a good restaurant...poor management!\n\nI would highly recommend the Promenade location. They have very friendly stuff...stroller no problem...you can sit whetever you like...with a proper high chair...really i have nothing bad to say except that.i am always very pleased with their service and of course that they have yummy yummy food at a reasonable price.","useful":3,"funny":1,"cool":2},
{"review_id":"rq84EMQ_k4hw0ZqZyuaEoQ","user_id":"4bRDMA-67JfE6QHU44rXyw","business_id":"p83NqJF3CNuiGhn-4XjAHg","stars":5,"date":"2017-08-03","text":"Wow! Delicious Moroccan Fine Food, Amazing people will serve you! Very clean place and the decor will bring you to Casablanca! I do recommend to try the Chicken Tajine!","useful":1,"funny":0,"cool":1},
{"review_id":"jjP-a0RBTjEPKVs6lAzZyQ","user_id":"4bRDMA-67JfE6QHU44rXyw","business_id":"MOEcuFtyIsoLgSCUOOzTcA","stars":5,"date":"2017-08-14","text":"Best place to eat with a group of friends or family, don't expect a quiet and intimate dinner. If you're a foody and love to share and taste to everything it's the perfect restaurant for you! The staff is friendly and simple type of environment. I do recommend this place, it's top notched!","useful":0,"funny":0,"cool":0},
{"review_id":"eOihcDP1KhMA2XCW7P9mfg","user_id":"4bRDMA-67JfE6QHU44rXyw","business_id":"GHUHWAaVjKDn74r50EKKMA","stars":4,"date":"2017-08-14","text":"Good raw food, fast service, clean location. I would of like to get little more salmon instead of rice for a large bottle that will cost you 20$ with something to drink","useful":1,"funny":0,"cool":1},
{"review_id":"VTnQ4E9jOMHzWuuvekDC6Q","user_id":"4bRDMA-67JfE6QHU44rXyw","business_id":"I_eCXujGAbl1JKrye_419w","stars":5,"date":"2017-08-14","text":"Tiny place full of flavours! Clean & delicious! Staff is very friendly and you will get your order super fast","useful":0,"funny":0,"cool":0},
{"review_id":"9-SJMJowsaAO1_YQ4Eoumg","user_id":"hOLjJqI-FUaBx3WcE9uxQQ","business_id":"xFkUn2tIJY0vkcm1Hl5m_A","stars":1,"date":"2014-11-14","text":"Had the Thanksgiving turkey burger. Burger didn't taste fresh. In fact, the burger came out in record time which further makes me believe it wasn't fresh. There was very little sauce and stuffing in the burger. The sweet potato tots weren't cooked thoroughly either. In conclusion, there are better options in the city for the price point that Wahlburgers is in.","useful":2,"funny":2,"cool":1},
{"review_id":"tFc-jn0LaJttnQrq3eVd9g","user_id":"0GJRB6qsnAmRTCNFlDAuAw","business_id":"cKgUCzMGuRgkbKXUsgeXUw","stars":4,"date":"2012-12-19","text":"My boyfriend and I are visiting Scottsdale from NJ and we just happened upon BQ one afternoon while exploring.  What drew us in was the sign outside announcing their $3 tacos and $3 margaritas during happy hour.  This was a great find.  We had a few tacos, 2 of which were the happy hour special that day and one extra -- one was salmon & mango which my bf said was amazing, another had cactus in it, and mine was pulled pork if I remember correctly.  Both the food and margs were amazing.  The bartenders were extremely friendly, one even gave us a bunch of recommendations of bars to check out while we were in town.  The only reason it doesnt get 5 stars from me is because it closes so early.  It seems like so many restaurants in this area close by like 9 or 10pm, which is crazy to me because Im used to not even going out to dinner until 830 or 9pm.  Regardless, we're going to try and stop in again before we leave.","useful":1,"funny":1,"cool":1},
{"review_id":"-CGxoDDhs8f7w20zUTrPRw","user_id":"cf1T06U56QgYCuk6yXRF3g","business_id":"EAwh1OmG6t6p3nRaZOW_AA","stars":4,"date":"2011-12-03","text":"We got a great deal at Bally's for a totally adequate room.  After quickly losing $40 (I'm a big gambler ;-) on their slots we went to Ellis for the BBQ dinner.  Told the wait would be 1 1\/2 hours we got called in about 45 minutes.  Chicken and ribs were very good.  Wife did not like the beans which were watery (but I thought tasty).  We were given plastic fork, knife & spoon which made eating difficult.  (Try slicing meat with a plastic knife.)  Corn was pretty bad.\n\nWe ended up going back there for 2 breakfasts (mid-week BTW) and had no trouble getting in.  My wife was very happy with hers.   I had omelets both times and 1st was good and 2nd was passable.  Good toast (no small thing) and breakfast potatoes.\n\nWe did play slots there quite a bit.  My wife ended up breaking even (including losses at the big casinos) and I didn't lose too much with several hours of play.\n\nEllis is a 1 (Vegas) block walk from Bally's by a less than delightful fenced off, abandoned parking lot.  A couple of street people (junkies?) seem to sit out by the 7-11, but no trouble.  My wife was glad I was with her.\n\nNot really busy while we were there so smoke was not a problem, but it's one thing I hate about casinos.  I wonder why non-smokers have so few (or no) options?  Do smokers lose more???\n\nWe only went there during the day.  If I went at night I would want to drive.","useful":0,"funny":0,"cool":0},
{"review_id":"0Z7Sr1YRklwYxjPHVhcQeA","user_id":"43EpcZApmhG7SdaFJSzidA","business_id":"uQavb7YPhMo89AjwZcjb0w","stars":5,"date":"2009-08-12","text":"i dont know why anyone bothers to go to any other korean restaurants when in vegas. this place has the best menu, uses the best ingredients, food and ban chan taste amazing, with excellent service.\n\nthis is my go to restaurant everytime i go to vegas.\n\nbeing 24 hours doesnt hurt either. lol.","useful":0,"funny":0,"cool":0},
{"review_id":"jHg7tqIjjNSLlRs-TaM-wQ","user_id":"uLeXBaoNdoR-jc1u4DIbfg","business_id":"-WfpxcNbp-kgrfOUG6xVvg","stars":5,"date":"2015-09-21","text":"I am something of a burger connoisseur and these burgers are AMAZING! My husband and I eat here for $13 total and we are always super satisfied. The owners take pride in making everything fresh and presentable, and the care that goes into their cooking can't be beat. I do not understand why people complain about the wait or ambiance and let that negatively affect the score- it's the FOOD that matters, and the food is incredible for the price.","useful":0,"funny":0,"cool":1},
{"review_id":"EvzGVRzZFyI20LnRffbomA","user_id":"BHWSZHUdqf-66ob10JGlcQ","business_id":"T419Y3fiJW9EuFDkFougVA","stars":1,"date":"2015-12-05","text":"Worst service and meal I have ever had. 1 hr 20 minutes. Only got a salad. Actually at 1 hr 30 minutes we left. Sorry. I would never recommend anyone eat here. Absolutely ruined an evening.","useful":0,"funny":0,"cool":0},
{"review_id":"to7IXgbxLyo5wf22lqQdpQ","user_id":"AMYX3MZ8Wc6YWhA1r-HMAw","business_id":"yXen_RJZZHQWMg-20-Uqiw","stars":1,"date":"2013-11-06","text":"Good luck trying to get in contact with someone here. It's next to impossible. The phone only goes to a voice message, and I'm pretty sure any emails you send go straight to the trash folder.","useful":1,"funny":0,"cool":0},
{"review_id":"o0zR6SxMu_aSLjxN370Mdg","user_id":"WWCSpbDRWUDhcKJNueyRKg","business_id":"Qihead6oTtWCwde3TBqlGg","stars":3,"date":"2013-05-13","text":"I was finally able to try Du-Par's and their \"famous\" pancakes. Well, they were good but not as amazing as I was hoping they would be.  I ordered a short stack which was still too much to finish. I am glad I tried them but am certainly in no rush to go back.","useful":0,"funny":0,"cool":0},
{"review_id":"hc-1Bpxo-0qtcXw603GRuA","user_id":"WWCSpbDRWUDhcKJNueyRKg","business_id":"f6CTsNX30XmC8siHWYV2bA","stars":5,"date":"2013-05-29","text":"I've been to several foot massage places and this one is now my favorite. You cannot beat the price and the guy that I had was great! I will definitely being going back.","useful":1,"funny":1,"cool":1},
{"review_id":"UcsgRzGDkaclq_BrU1PBjQ","user_id":"BgE56p7zwmdYVT2VM0IPlQ","business_id":"l8LYK3kqDBrqgVyvd2MoHQ","stars":5,"date":"2017-03-11","text":"great cappuccino with seating along the promenade. cheaper than the big coffee chain store across the way (and 10x better)","useful":0,"funny":0,"cool":0},
{"review_id":"CW6wfIA6MUXPKc3YulpEng","user_id":"7KUq9cgMy4YkmUdr5CJVFw","business_id":"VXS6YHFNzjOjlVEHdTJPXg","stars":1,"date":"2013-09-30","text":"Spent 15 minutes arguing with the woman who did my intake paperwork about whether insurance for domestic partners \"is legal\" in the state of Arizona.  She came just short of accusing me of insurance fraud.  I finally had to insist she call the insurance provider and confirm my coverage.  What a narrow-minded, unprofessional office.","useful":4,"funny":0,"cool":0},
{"review_id":"4BRPHR7JT3P1SYayBf_PuQ","user_id":"7KUq9cgMy4YkmUdr5CJVFw","business_id":"ccyOw-16ifw8gA-ZCFas6g","stars":2,"date":"2011-06-20","text":"I had a mixed experience with this company. I am currently 29 weeks pregnant.  We hired them to pack and move me out of a 3-bedroom rental into our new place. In part, I blame myself for contracting with the on nothing more than an email quoting an hourly rate for packing and the move. If they quote you an hourly rate, I _highly_ recommend getting them to commit to a maximum time-frame for your project and have them provide a price list for any packing materials to be used.\n\nThe two men I had for the packing were courteous and relatively efficient. I was shocked, however, at what we ended up being charged for boxes and packing material. Especially, when asked, they could not provide us any sort of itemization for what was used. \n\nThe next day for the move, we had one of the same people and a new person who seemed to be about 20 with very little experience moving. Again, they were courteous and very careful in the handling of our furniture. But they were the slowest movers I've ever used. \n\nIt took just short of eight hours for them to move a three-bedroom house. There was a great deal of chatting between the two movers and hanging out in the truck. The \"greener\" of the two movers also frequently hovered around seeming uncertain of what needed to be done next.  I was literally standing over them in the 110 degree heat by the end of it trying to get them to finish. It then took them close to another hour to get hold of the main office and try to figure out the paperwork. \n\nWe had planned to also use this company for my partner's move in two weeks but, based on our experience, we will be using another company.","useful":4,"funny":1,"cool":0},
{"review_id":"6AkcldKFbwe5ItyIJ3rijg","user_id":"7KUq9cgMy4YkmUdr5CJVFw","business_id":"pHpU8lnnxMuPWRHOysuMIQ","stars":5,"date":"2015-12-20","text":"Great food and service. Wish they wouldn't blast 80's music at teeth rattling volumes on the patio.","useful":2,"funny":0,"cool":2},
{"review_id":"Y6RlcJy-xpt7o-LjMZ1eoQ","user_id":"QoDP81Xnvcl_EQ_Lut2AXA","business_id":"qy4WKXTBkqD4zX0rohYF8Q","stars":5,"date":"2017-03-26","text":"Have driven past this place for over a year and finally made my first visit today! Cutest little cafe. The front of the cafe is quaint and cozy, boosting some lovely kitchen & misc house ware items for sale. As you make you're way through the cafe there is another area showcasing various items and then additional small tables in a semi-private room. I can see it being a really good spot for meeting a study group or something of that nature. The menu is small, with the focus on speciality lattes. I indulged in a Nutella latte and it was delicious. I think I'll try the toasted almond latte next! I also grabbed a peanut butter cookie and it was the perfect amount of soft and crunchy. I'm glad I finally got to check this place out and look forward to my next visit :)","useful":0,"funny":0,"cool":0},
{"review_id":"W4TXSsNhd6T6mga1g_In4Q","user_id":"QoDP81Xnvcl_EQ_Lut2AXA","business_id":"mm2wLW24ESxNIEL2bjseaQ","stars":5,"date":"2015-08-24","text":"Where do I begin? Custom poutine has never looked so good. I opted for a regular sized poutine of the vegetarian variety, with tomatoes, roasted red pepper, goat cheese, sour cream and of course gravy. It was a little soupier than I had anticipated, but I can only blame myself for choosing so many sauces\/cheeses. I just couldn't pass any of those up nor do I regret my decision. My boyfriend got a large poutine, which was basically enough to feed a family of four. And he topped his with gravy, sauteed onions, mushrooms and chicken. We were unable to finish his so we packed it up and enjoyed the rest later that night. And it was delicious! I should also note that the service at this location was impeccable, my boyfriend forgot to check off which gravy he wanted, he left that box blank, so when they brought us our dishes they also brought a soup bowl full of gravy for him, just in case, without us even asking. I just thought that was really intuitive and great customer service! All in all, I will definitely go back to this location next time I'm in Montreal.","useful":1,"funny":0,"cool":0},
{"review_id":"eDnweUFyeVaZ86hH9FB5fA","user_id":"DFkmpM9OXw_7DVhaKfCnrQ","business_id":"5OZS7Sz7oX6XBL7KZE0G1Q","stars":5,"date":"2014-12-15","text":"As newbies to Phoenix, we have been looking for a great Thai restaurant for dine in and take out. After eating at Jasmine Thai we are confident that this will be our spot! \n\nThe restaurant is clean, service was speedy and the staff very friendly.","useful":6,"funny":2,"cool":3},
{"review_id":"-2hSAUuQGVlDh6_cJVrxHQ","user_id":"DFkmpM9OXw_7DVhaKfCnrQ","business_id":"sAEFh7e7fY-W2gMWSbIAWQ","stars":4,"date":"2017-04-09","text":"My salad, The Don Quixote with chicken, was delicious as always!\n\nThe difference between 4 and 5 stars is cleanliness. The dining room is littered with empty bowls, cups and dis-shoveled chairs. The fountain drink and silverware counters could use a wiping down.","useful":0,"funny":0,"cool":1},
{"review_id":"x6i9FrJfBLQO0GtQ3vZr8g","user_id":"DFkmpM9OXw_7DVhaKfCnrQ","business_id":"5Ktv5ZmJI0CN4L0KxDWJvw","stars":4,"date":"2012-04-28","text":"Phoenix City Grill is a great lunch spot!! However, the presentation of food is much better when dining in. The to-go boxes and packing is not as nice as one would expect.","useful":2,"funny":0,"cool":0},
{"review_id":"lRN56_O2Cg5WRWcMIIDk8g","user_id":"owvHx28kxFFXTZGL7yKYUQ","business_id":"W98fZXdlQIUBRjWah7U-ng","stars":1,"date":"2017-12-08","text":"It is unfortunate that a pet insurance company has chosen to deceive pet owners.  Read the fine print.  They take your premiums (not clarify what is not covered, auto-renew) but do not pay the claims.  I am not sure what other pet insurers do, but the industry seems like a scam as for $600 for a healthy pet, one would be better off putting it into a savings account.","useful":4,"funny":0,"cool":0},
{"review_id":"h7Hg3XcfkOcWGIhlO0oslw","user_id":"cubfQ6KwlxyB11JFUex6_Q","business_id":"WTqjgwHlXbSFevF32_DJVw","stars":1,"date":"2014-06-04","text":"Justin Philipp was the only dentist out of 5 dentists I saw said that I needed crowns because I had cracks (which I found out that I didn't have cracks). He didn't even show me where I had cracks. It took 6 hours to prep my teeth for 3 crowns because he had to see 10 other patients at the same time. He didn't bother to explain what he is about to do or what he is doing or how much of tooth structure will be drilled away. Almost all the work was done by his incompetent assistant who kept dropping the temporaries on the floor and didn't even bother to clean up and said that she couldn't tell which temporary goes to which teeth since they look the same! The only thing this dentist did was 'drill' and didn't put the thread around the prepped teeth or temporaries.\nI had a lot of pain with the temporaries but the dentist couldn't be bothered. Instead of figuring out what's happening, they hurried to put the permanent crowns on without asking me if I am satisfied with them. I had TMJ for a month along with other pain but the dentist was ready to send me to the Endodontist when it was a bite issue. I asked him to take an xray to verify the post work but he refused. So I went to see another dentist and found out that these crowns have 'OVERHANGS' and he graded this work as a 'C'. This will lead to tooth decay and bone loss. \nI really wish I hadn't gone to see him. I went to see him because he was on TV and awarded on the magazine which I found out that you can pay them to be on. He over treated my teeth that didn't need any treatment and went to extreme measure (crowns). Now I lost all the good healthy teeth because this dentist was greedy, don't care about patients' health, and incompetent!","useful":18,"funny":1,"cool":1},
{"review_id":"SgKoIxqHnRQUO0i6lqHX7g","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"1C7mPT-9mFihyZq8-qLxgw","stars":4,"date":"2009-06-08","text":"The closest good sushi you'll find downtown. I've been going to Ichi Ban for a couple of years and have to say that its the best sushi you can find in downtown. They have a lot of specialty rolls such as the phoenix suns roll, spicy Tuna with unagi on the top with dressing. Pretty tasty. Their sashimi is fresh and made to order. The only bad thing about this restaurant is when your eating and it's not busy, they seem to be spying on you and makes it a lil uncomfortable for  you peeps that can't stand that the staff is looking at your every move. For me, I just want goo sushi and this place definitely hits the spot.","useful":1,"funny":0,"cool":0},
{"review_id":"d74gcWi3fnj0OaZ3Ao3LRg","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"ujnkGDJvDHiq7hT4tl8xxQ","stars":4,"date":"2009-06-12","text":"This place rocks all over the place. I'll keep this review short and vague, promise. I spent the best 100$ in my life shopping here over the weekend, enough to feed me for a month.  I know if they decide to lock me in the supermarket overnight, I would definitely not starve to death. \nThis place is filled with pure awesome-ness. stop by if you can.","useful":3,"funny":1,"cool":2},
{"review_id":"tM-6b25d5OdiJmDYBC0VLg","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"rNNVuA-xq1SVEQaLzrK4bw","stars":3,"date":"2014-01-30","text":"Greasy, fresh, should make you feel better \" buzzed food\" to absorb all the alcohol. \nSimilar to Federico's, filibertos, Ramiro's, Etc.... Fast and friendly and pretty decent.","useful":0,"funny":0,"cool":0},
{"review_id":"G8snc2fNJSrhpt-IEcA6HA","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"5--3bqBkUMJZzvgfdp4AMw","stars":1,"date":"2014-04-04","text":"I'm typically a very patient guy and don't like to bash any business but since I'm still stuck here, I might as well make my time useful. Do NOT, and I mean DO NOT come here for an oil change or any service. As soon as I pulled my truck in, I noticed two gentlemen sitting in their stalls doing paperwork. Both just sort of looked at me like a lost little child or soul, trying to find their parents and without the tendency to come out and just say we will be with you shortly. So I waited 10 minutes and just as soon as I was about to hope back in my truck and drive off, a gentlemen comes out and asks me sorry about the wait but what can I do for you. ? I want an oil change how long please? About 1-1.5 hours. Okay long story short, there were others in the waiting area bitching and nagging about the super long wait and Never again will they come here.  After about a 99.5 minute wait I go outside and ask my advisor, do you know how long until my car is ready. It's been over 1.5 hours? Let me check... Waited another 15 mins till my 100% charged IPhone had about 20% left . Finally went back outside and this time I walked into the auto area and saw my truck just sitting there. I go and let him know what's my truck doing there?  Looking puzzled, he goes to the back yells out a name and said bring the truck up! Then he looks at me and said I guess you don't have time for the free car wash eh? Paid and left.  That's how my experience went.  You've been warned","useful":4,"funny":0,"cool":0},
{"review_id":"RJzKZUKQn33LeumSztC6HQ","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"Qb1amWCBTeBQQzQyrkyNAg","stars":4,"date":"2009-06-09","text":"Middle Eastern Bakery and Deli is one of my favorite places to eat. I use to go a lot back then, when the owner Alex somehow disappearred to the Middle East ( maybe finally getting married ).  They use to stack their portions with a lot of meat. Since new ownership, they are cut back on the protons but the food is awesome as usual. Their mix grill and chicken kabobs are a must try. With the aromatic smell of their rice along with a side salad with greek dressing, it compliments the meat very well. Their homemade lemonade was very tasty and the owner is very nice along with his staff. Kinda like home cooking except when they get super busy, be prepared to wait awhile, but well worth it.","useful":2,"funny":1,"cool":0},
{"review_id":"0KppNZyoU7rm-41f9DVpNQ","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"xzj6q131hJE59tBkhe3Gag","stars":1,"date":"2016-03-26","text":"Arrived at 8:20 pm and was told they were closing in a few minutes and we would do a to go order just for you. Seriously, you had 3-4 table still dining and your establishment always closed at 9 pm. Been a loyal customer but sorry you may have just lost one. Good luck with wanting to leave home early for a Friday night.","useful":2,"funny":1,"cool":0},
{"review_id":"ozZ2CU2SCcYgSTZXRtJ11w","user_id":"gRZVWuFFg7oyx1e8zsUvVA","business_id":"TQxMhEar6--Wj4Du8nRQsw","stars":3,"date":"2009-06-01","text":"Just had lunch at Thai Hut with my fellow co worker who insisted on trying a new place. Got to Thai Hut, menu was pretty simple to choose from.  We got our food pretty quick.  I had the yellow curry chicken. It was mediocre at best. My colleague's Beef panang tasted pretty bland. Chicken was prepared probably in advance as it was not as hot as we had hoped. Prices for downtown is reasonable and the service is fast.","useful":1,"funny":0,"cool":1},
{"review_id":"XTfp5z1Z4edfZqqVK8x5Zg","user_id":"whMmiaxbeK3TaMn-n1fELg","business_id":"xyYeBQrMuTqpKnRHj_YnUA","stars":3,"date":"2015-09-27","text":"We stayed for one night. It is a standard older hotel that has been updated. Rooms are still small but modern. Staff are friendly and helpful. We stayed in a room by the elevator and ice machine. So it was not the best room. All night we heard a knocking in the wall. We think it is a loose water pipe. It was weird, it sounded like someone knocking on our door. Overall it is a nice clean place,nothing special.","useful":0,"funny":0,"cool":0},
{"review_id":"NE_N_vzHKBt3u4GgCOUrkQ","user_id":"whMmiaxbeK3TaMn-n1fELg","business_id":"Z7nGSKvjmHNRkXtoMxA3Jw","stars":2,"date":"2016-02-28","text":"I expect more from a chain restaurant. The hostess was chomping gum and seemed annoyed that she had to stop texting when she had to seat us. About an hour before close the servers were sweeping up the peanuts and moving tables. We all felt rushed. It didn't help that the beer was warm. Problem from restocking and not rotating. We won't be back.","useful":0,"funny":0,"cool":0},
{"review_id":"eALRg5V_880GDGNP2z24ww","user_id":"3WPfBrxtQ6JIIMc651QwUA","business_id":"QrKjK2pzY85D0WgY8GzWXg","stars":5,"date":"2014-08-30","text":"we used to live in western Virginia with the nearest comedy club being Improv in DC and overall enjoy the comics here just as much as we did in DC.  Plus the costs at Madison's is much cheaper and the food better!    The venue at Madisons is a little different sort of like comedy in a long trailer but then the DC Improv would stuff people in like sardines so for us no problem.  Anyway we love it especially from what we had in Virginia","useful":0,"funny":0,"cool":0}]