[{"review_id":"-hndYoKp06XMJe3EQGqtHA","user_id":"X3nYQKm_zLsPB2-l8ntf2g","business_id":"_sh6mIBWZis66mAjkjN8Qg","stars":5,"date":"2016-12-08","text":"The service & food is always phenomenal. Thank you so much! I love coming here with my friends for a good meal.","useful":0,"funny":0,"cool":0},
{"review_id":"C-TpkrLXQHHq130w2TXuKQ","user_id":"X3nYQKm_zLsPB2-l8ntf2g","business_id":"n8Zqqhff-2cxzWt_nwhU2Q","stars":5,"date":"2016-04-12","text":"Great service . Courtney was lovely and cute :) will return for the steak and Mac cheese .","useful":0,"funny":0,"cool":0},
{"review_id":"d8G87g4e1xA2QpZTGHPYJw","user_id":"RGYVAucoUl24T2M2INAMXQ","business_id":"l-D0uS-tgmhkFpHKBXvPQA","stars":4,"date":"2014-08-31","text":"The food is definitely different! It a fusion of Mexican and Asian, and depending on what you get, it's amazing! They also serve beer!","useful":0,"funny":0,"cool":0},
{"review_id":"PMrWafclbjb_Z_Gvn0PTRw","user_id":"u-6yXrj1PM_Lei3PT2JaLw","business_id":"148BlXeNBxjHyOGw4BxmkQ","stars":5,"date":"2015-03-04","text":"If you're looking for a facial, Brandi is the girl to see!  She recommended a product months ago that has worked to clear up my skin and I got the pleasure of having her give me a facial.  She's knowledgeable, kind, and overall a great resource for skin on this side of town!  I already scheduled my next appointment :)","useful":0,"funny":0,"cool":0},
{"review_id":"Kk5CNMbQF1V9O0LOXdCoaw","user_id":"u-6yXrj1PM_Lei3PT2JaLw","business_id":"SmMB0kdFRx8VGoO4jufKiQ","stars":5,"date":"2015-03-12","text":"I just had the best hair experience with Katie.  She was attentive, honest, and very easy to talk to.  I moved to Arizona 5 years ago and kept getting my hair done by sub-par stylists.  More recently, I had a hair disaster (at an unnamed salon) that Katie fixed for me and I couldn't be happier.  She asked me to scheduled a consultation and she explained exactly what she could do.  She did not make false promises.  She was honest and I appreciate that. I love my hair and although this Dolce is a bit out of my way, I will be a regular client.","useful":0,"funny":0,"cool":0},
{"review_id":"Gm1bO_cRFbaRHZe1WOELnw","user_id":"sRcBAkBbSvYtDHIDWpbULQ","business_id":"VoXUt6TIJWyIf_lihbN5xQ","stars":4,"date":"2017-06-14","text":"I visit S&V quite often. Mostly for take out of pizza. Thin and crispy and light. Good toppings. Occasionally on the dry side but if you like \"neapolitan\" style then you'll be a fan. Great portabella mushroom panini sandwich and kale salad!","useful":0,"funny":0,"cool":0},
{"review_id":"AZW2vJ5DByq8lCVldcrbbw","user_id":"sRcBAkBbSvYtDHIDWpbULQ","business_id":"x4aHNNo1osWNCB75q_PijQ","stars":5,"date":"2016-04-20","text":"After visiting Naples, Italy and experiencing true Neopolitan pizza, i can say Pomo's is the closest thing you will find to this amazing style of pizza. I've been to many pizza places in the scottsdale\/phoenix area and by far this is the best and most authentic. If you have a chance, also try their mushroom soup - very good!","useful":0,"funny":0,"cool":0},
{"review_id":"rD3SzaR2BPflA4Ja2hIZ6g","user_id":"FWO8yo40ipS6eXeXtkIDBQ","business_id":"qZcKRWui7oUfVJoGl0AIyg","stars":5,"date":"2017-12-12","text":"Superior Tire handles all oil changes and services for my vehicles.  They offer great pricing, all work is done in a timely fashion and the staff is very knowledgeable as well as helpful.  They work on all makes and models, and provide very reliable workmanship.  Stephen, the Store Manager, is always there, always friendly and always willing to beat anyone's prices!  Ask for Jameson when it's time to make an appointment or have any questions - he has the answers and is happy to help!  I highly recommend Superior for all your vehicle service needs!","useful":0,"funny":0,"cool":0},
{"review_id":"4dKT29CqKE730zlsmCRiCQ","user_id":"VvL46e4bK2DIOqZQZ6vUyA","business_id":"K7lWdNUhCbcnEvI0NhGewg","stars":5,"date":"2017-07-08","text":"Best Buffet, I ever had. I would absolutely recommend to all friends traveling to Vegas. The food is very fresh and delicious and the customer service is great.","useful":0,"funny":0,"cool":0},
{"review_id":"D51XRlqyTREWOOjEjFhMPQ","user_id":"VvL46e4bK2DIOqZQZ6vUyA","business_id":"uanCi4OGc1mHLGl_AT4JhQ","stars":1,"date":"2017-07-08","text":"Customer service is terrible. I had a reservation for non smoker room-at the check in, I was told they had only smoker room and all rooms are booked. I stayed in this Hotel from 06\/29 to 07\/04, i would not recommend this Hotel\/casino for non smoker. The hotel should train its from desk\/check in employee to listen to the customers because the hotel has lost me as a customer.","useful":0,"funny":0,"cool":1},
{"review_id":"CyYv--_6Wvak6infKMl-oQ","user_id":"NIbWyB3CiutviPOv0EGFOg","business_id":"IIUK1lz_1upqYtHu8ZuClA","stars":5,"date":"2016-07-13","text":"Delicious food that is prepared quickly. We were visiting Charlotte from the DC area and needed something fast before heading to the airport to catch our flight. Right after we ordered I filled up my cup with some freshly brewed ice tea (sweet and unsweet) and by the time I walked outside to claim a table the food was ready. Fortunately they don't have that Gold Peak ( aka gold piss) crap that a lot of restaurants have in Maryland. I love brewed tea.... So we ate outside at one of the tables. There are only about 3-4 tables out front so most people just grab their food and go. Overall, a great place for gyros that is affordable and ready in a snap. I suspect other items on the menu are also tasty but I can only comment on what I ate and it was delicious!","useful":0,"funny":0,"cool":0},
{"review_id":"_QpdOVQZow_mq1DqEbLFbA","user_id":"NIbWyB3CiutviPOv0EGFOg","business_id":"bfVpHvjir2G2Z9wVeddw4w","stars":5,"date":"2016-07-09","text":"Review is based primarily on the beer and atmosphere. This truly is one of the best places to enjoy quality beer in a really impressive outdoor environment within the city limits. I stuck to a liquid diet for the evening as consumption of fine beer was my #1 objective. I appreciate that OMB brews according to the 1516 Bavarian Law of Purity....Unfortunately, a thunderstorm came through so we went inside and the facility inside is also quite nice. Overall, a great place to enjoy quality beer.","useful":0,"funny":0,"cool":0},
{"review_id":"JmE8LhEH-1r9S8D_EYTbtg","user_id":"IWggb9f5F_hYKHiq9rY6aQ","business_id":"frCxZS7lPhEnQRJ3UY6m7A","stars":5,"date":"2015-07-05","text":"Everything was really good. We loved the salsa bar with all the interesting choices.  Carne asada tacos were great. Can't wait to come back and try the fish tacos.","useful":0,"funny":0,"cool":1},
{"review_id":"Up2vBZ72Sg_9iAwzmvB-KQ","user_id":"IWggb9f5F_hYKHiq9rY6aQ","business_id":"NXN_rVXsvJJVgm47k99Gtw","stars":5,"date":"2017-05-27","text":"The best creole in town!  Gotta come see Tippa.  She will rock your world. We loved the Creole and the pan roast!","useful":0,"funny":0,"cool":0},
{"review_id":"WInkToSxqRVvneM7JYAwyQ","user_id":"EkDllUzJXHtqte-QtBFzMA","business_id":"iBvF9Oy9UdOrXvTlxNHyqw","stars":5,"date":"2016-07-24","text":"Awesome bright interior, fantastic service, vegetarian friendly and good atmosphere. I came with a friend for dinner and was definitely impressed. There was even a man playing guitar and singing Spanish love songs. The margs have real fruit and are definitely worth trying. Will be back.","useful":0,"funny":0,"cool":0},
{"review_id":"h57MVgkD30FgBJYHEUYOcw","user_id":"EkDllUzJXHtqte-QtBFzMA","business_id":"abcogBFg3-AlUHNf2NG3_w","stars":5,"date":"2015-11-19","text":"Regency is a great school to grow in. The educators are very down to earth, and Studio Luma gives you opportunity to get on the salon floor as soon as you start. Great for any DIY-ers who want to take the step to become a pro.","useful":1,"funny":0,"cool":0},
{"review_id":"JBBbY3zYTvvAf9k_JoJLWQ","user_id":"EkDllUzJXHtqte-QtBFzMA","business_id":"wOi0qhQrWGivPn4fOCVFRg","stars":5,"date":"2016-07-30","text":"I ordered some jewelry and there was a bit of a mix up, but Rob went out of his way to make sure I got my jewelry and even offered a discount. The piercers are friendly and professional. High quality beautiful jewelry. Definitely worth going put of the way for.","useful":4,"funny":0,"cool":0},
{"review_id":"RIP6HA9pQ-yhJgbgDMzDfw","user_id":"pna3KEJ4EXwvoYwdfUzOlA","business_id":"2k-ki66QUs1xJcPqG4SqbQ","stars":5,"date":"2016-02-08","text":"I can't recommend Haulin' Goats enough.  The day before the goats came out, Heather stopped by and we showed her the area we want the goats to weed.  It was very easy and took very little time.  The next day the goats came over and went to work.  \n\nThe area the goats were weeding for us was overgrown with poison ivy, making it impossible for us to get in and weed ourselves.  The goats absolutely tore through the poison ivy.  In fact, the poison ivy seemed to be there favorite, because they ate it first.  Because it was a big area that was very overgrown, it took a 2-3 days, but the goats absolutely cleared everything out.  \n\nThe goats can't clear everything out like weed killer, but the most they left were a few small weeds sticking a few inches out of the ground.  We were very surprised how well it worked.  \n\nAlso, the area where the goats were focused was along the bank of a lake and we weren't sure how the goats would do, because a lot of the poison ivy was very close to the water.  But, the goats took care of everything.  \n\nWe were blown away with how well the goats worked out.  If you're looking for a non-chemical method to get rid of poison ivy\/weeds, I can't recommend Haulin' Goats enough.  The process was easy and pain free and the kids in the neighborhood loved coming over to see the goats.","useful":0,"funny":0,"cool":0},
{"review_id":"5H-QFJu26KgMxfvsSvHVrg","user_id":"tDJi9i7MErAgy7AUN_9uEQ","business_id":"WqimEEptZwgkfZztkTrbAA","stars":5,"date":"2017-03-20","text":"I have been to this fine Gun Shop three times now. While they have a limited inventory of Bolt Action and wood stock rifles. How ever they do have a few good deals for Old School guys like me.\n\n  Bottom line - Harlan was willing to work with this Visitor from California. In order to buy a rifle and have it legally shipped to the Peoples Republic of California.","useful":1,"funny":0,"cool":0},
{"review_id":"ygBFXuf0ZyR1aYrILjS64g","user_id":"tDJi9i7MErAgy7AUN_9uEQ","business_id":"5wfEgNqbyOSb9agPkors9w","stars":5,"date":"2014-03-28","text":"I came into town a week ago and was told to check this place out. Doing so I was very pleasantly surprised as they did not have the usual bad attitude of some gun shops that I have been to. ( I.E. \"You do not know what the hell you are talking about\". Or \"Either buy something or get the F**k out of here\")\n Instead they were very friendly and professional  to me and my wife. So I bought some parts for one of my guns and had them shipped to the Peoples Republic  of California. Today they showed up today in a flawless manner. So Well Done to all Hands. It was a very refreshing experience!\n \nPS The Hot Dog place next door is also worth to looking into for a great Chicago Dog!","useful":2,"funny":1,"cool":2},
{"review_id":"9gb3-crNUKFFSYFteJprig","user_id":"tDJi9i7MErAgy7AUN_9uEQ","business_id":"_GSmCvoVEpQG1heudjMNZQ","stars":5,"date":"2017-03-20","text":"I have now been to this great Gun Shop about 5 times. When ever I get into the Phoenix Area. I make a Bee Line to it. As a Californian, I have found these fine folks are willing to work with me. So that I can legally buy and ship a fire arm to the Peoples Republic.\n\n  Bottom line I wish the Gun Shops in the Greater LA area would take a lesson from these folks.","useful":0,"funny":0,"cool":0},
{"review_id":"c0EgsPRrXPlVmfc4fTGAfQ","user_id":"tDJi9i7MErAgy7AUN_9uEQ","business_id":"igcuOefaL4fmAi9Evgoprg","stars":5,"date":"2017-03-20","text":"Another extremely good Gun Shop! I have been here several times when I am in the Phoenix area. These Folks really have their Sh*t together. \n\nEspecially since I hail from the Peoples Republic of California. They are very willing to work with you so that you can legally get a fire arm back to the Motherland.\n\n  They also have a huge and very reasonably priced inventory to boot. Time spent here usually is very well spent! Major Kudos to all hands involved!","useful":0,"funny":0,"cool":0},
{"review_id":"X2GYbZ0-CU6Dwo07jMaecg","user_id":"gpbGRW0SvwwZP1fln2sYHA","business_id":"ReyjVKUEVKZHmlrBxu_h2A","stars":5,"date":"2016-02-15","text":"Very friendly folks. Really Clean. Bathroom was spotless. Food was outstanding. Crispy pork belly delicious. Will be back thank you.","useful":1,"funny":0,"cool":2},
{"review_id":"eK5ITTtuj73rMHp2UY491A","user_id":"gpbGRW0SvwwZP1fln2sYHA","business_id":"fKlr9qNoV37WQJwQ826POg","stars":5,"date":"2016-04-23","text":"Brilliant Just Brilliant. This is not just a restaurant it is a gastronomic experience. The Gauchos are exceptional. Thank You for a wonderful experience.","useful":0,"funny":0,"cool":0},
{"review_id":"s7HbnDY6z8ywWORCIN8M3g","user_id":"gpbGRW0SvwwZP1fln2sYHA","business_id":"u5wmbtWjMyaiJpAbP2xoEw","stars":3,"date":"2014-11-19","text":"Good food but oh my gosh the service,...... So Slow. Half of the  guests at our table are plastered. To slow and the folks are drinking to much","useful":0,"funny":1,"cool":1},
{"review_id":"N5t7gcnMT3QqHKlfFy88Jg","user_id":"tPjamzYbQxysE03MsvI7Ew","business_id":"WOj8nPos3R9IIf0Pyttd8g","stars":5,"date":"2015-03-22","text":"Don't be deterred by the unassuming exterior! We came here for Saturday brunch and it was great! I had the eggs Benedict and my DH had something simple like eggs and sausage. We both also had the morning fries. We enjoyed every bite of our meals, along with the pitcher of mimosa that they have on special during Saturday brunch.","useful":0,"funny":0,"cool":0},
{"review_id":"U83CtRTtS8YcSX7WEp1rWg","user_id":"nnz-WnN019FWQHbyQjlw9Q","business_id":"DdrEM9s_OdSyryeFWqr6zg","stars":1,"date":"2013-06-11","text":"My car wasn't even turn on in my parking lot, i thought it might be dead battery. After i googled on yelp i found this guy with a nice tittle ( save money towing) i thought to myself this can be a good choice. I called him and he said it cost 75$ to tow my car, and i said ok. He didn't show up at the time he gave me and it was like two hours later. \nHe was so on rush at the time i was talking to mechanic and he kept saying \"you killing me man\" every single minute, as if he is doing a favor to me and it's all free. He ask me for 5$ more after i said i pay by debit card. This is exactly what i experience with him. i give him one star cuz i think he needs to be patient and respect the customer. He is not running a hotel he should know that his customer is in rough situation and he should help customer instead of making more stress on him or her.","useful":0,"funny":1,"cool":1},
{"review_id":"xPa_f5ZuD7fMjKOoXpGVVQ","user_id":"nnz-WnN019FWQHbyQjlw9Q","business_id":"a2S-Rr7RQGrpkYH_ia9vnw","stars":4,"date":"2013-06-11","text":"This guy is so friendly. And he knows what he's doing. He copied my car keys so fast. I recommend him to everyone.","useful":0,"funny":0,"cool":0},
{"review_id":"G2aPqyUwNHs1Pqvvynch_Q","user_id":"zGiwvVokj3DfWcJGN6hZ-g","business_id":"UjKOk1J45MWP6xm_nPmpMg","stars":5,"date":"2015-07-23","text":"Seriously amazing service! Gerry was so helpful and accommodating. He responded to my emails within the hour. \n\nTheir price for rental cars is insanely good. \n\nI rented from here twice in the past couple of weeks and each time I had a cute little Mazda 2, perfect for tricky Toronto traffic. \n\nConvenient central location in Kensington Market.\n\nIf I need to rent a car in the future it will be from here for sure.","useful":2,"funny":0,"cool":0},
{"review_id":"xRk-wHHkdBZdJJg0WNvQxQ","user_id":"bnrG4s6AOP21RXdtCz89rA","business_id":"POJL-N7Smw1UZMP_xldFwg","stars":5,"date":"2014-10-08","text":"My wife and I love this restaurant! This is our favorite restaurant in the area..really love the location as it's super convenient for us!  Great simple food at great prices!  Would definitely recommend!","useful":2,"funny":0,"cool":0},
{"review_id":"Z8YgMZpltF2_3-jvX7JTSw","user_id":"bnrG4s6AOP21RXdtCz89rA","business_id":"TaTjCuAu6digyuZNBo0fag","stars":5,"date":"2017-06-08","text":"Great food at a great price! We really enjoyed the margherita pizza and mandarin almond salad! The place also has a very nice ambience - modern but comfortable! Would definitely recommend and well be back for Sure!","useful":0,"funny":0,"cool":0},
{"review_id":"SnuaNT55nomofEXt86z5_g","user_id":"FvR1NNh1BhzZSE4kyBdc4Q","business_id":"CFtZH4Skp9z3o4ToSywI4w","stars":4,"date":"2017-02-19","text":"Service was a bit slow.. We waited for a little bit to be seated.. We sit near the open window which was really nice.. Ordered drinks that took a while to get.. Our waitress didnt introduce herself which I can't stand when you have to ask for it.. The food was great though! Burgers were delicious.. Very well seasoned! Inside the restaurant wasn't nothing too special.. The food was worth the wait!","useful":0,"funny":0,"cool":0},
{"review_id":"VMtJsbN84WEpNo8bUWW2Zw","user_id":"FvR1NNh1BhzZSE4kyBdc4Q","business_id":"0f_Ndu0Dg_1I75Suz55KHQ","stars":4,"date":"2017-05-17","text":"Kindercare is an awesoms daycare.. The secured building.. The staff loves their students.. They are all around great.. A cook for breakfast and lunch.. I never had no issues with this daycare at all..However.. You get what you pay for.. They charge an inital enrollment fee and a weekly fee.. This is even on top of any childcare assistance you may or may not get. Also, they charge expensively for summer camp programs. Overall, awesome daycare but if you want to pay out some money then it's a money pit! I only gave it a 4 star and not a 5 because I did not expect all these expenses.","useful":1,"funny":0,"cool":0},
{"review_id":"HQMLw4letb39HHkXo7jwzQ","user_id":"wFJm_MSDxkDQAVjnkiwNyg","business_id":"3nRaWjtgTxoqtpHKJy5u4g","stars":1,"date":"2015-12-04","text":"SLOOOOOWEST Bojangles ever!!! Been stuck in the drive-thru for over 20 mins now and there's no way to back out. Save yourself the struggle and go across the street to Zaxby's if you want fast food chicken.","useful":0,"funny":0,"cool":0},
{"review_id":"8j_26hN7ROpVF1QY6d03Nw","user_id":"wFJm_MSDxkDQAVjnkiwNyg","business_id":"LrbLZKu1zMY_HDJsL2e6VQ","stars":5,"date":"2016-03-20","text":"Nicole is the only person I trust to do my hair and makeup! She's always up-to-date on current styles and trends and always makes me feel beautiful! Highly recommended and definitely worth the hour drive it takes to get there from my house! :-)","useful":0,"funny":0,"cool":0},
{"review_id":"n-by2YFtDvg7zs41gsXO4w","user_id":"EQEEGIiHZI5GyujdcDTz2g","business_id":"NIepcNSKopCiennUfPDkNQ","stars":1,"date":"2013-02-18","text":"very poor service, never ever pay first. being very dishonest.they are not gonna give you your order. I remind to get my f dessert every time. just very disappointing. sexist and racist. firstly forgot to make my sandwiches, then gave away my sandwiches to others. welcome to facebook... never ever visited again even for convenience. I would like to see them close.","useful":1,"funny":0,"cool":0},
{"review_id":"atbjvb8wK7ge1dhB4rW3qg","user_id":"EQEEGIiHZI5GyujdcDTz2g","business_id":"aLcFhMe6DDJ430zelCpd2A","stars":2,"date":"2013-10-29","text":"The pork with rice was tasty but I got it as take out last time and it was my first time there. The second time was quite disappointed, it was so loud inside, barely heard my frd talking plus the wait time. I would hv gone sth better. Just the Pad Thai is pretty disappointing, from what I remember I just remembered nothing but the loudness and the long wait","useful":0,"funny":0,"cool":0},
{"review_id":"AKU0OtpHlZ2AnZlzhl8d6g","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"gUl8wa-czuoDWFxAA5KLog","stars":4,"date":"2015-08-06","text":"One of the cleaner and better organized Goodwill stores. Their prices seem to keep going up, but hey, that's how you make $, right??","useful":0,"funny":0,"cool":0},
{"review_id":"L-fXcMIP0DbvqYza8nF5bA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"ptCUU6vlRV2F8bwElxDCZA","stars":4,"date":"2014-01-13","text":"While we have always received good service from the medical staff we always wait forever in the waiting room to be called into a room and then we wait even longer for the doctor once we get there. The staff is nice and the facility is clean.","useful":0,"funny":0,"cool":0},
{"review_id":"hSWEsLyvLflpWBNmP75gqw","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"_reykENmCBh03iczpFAufg","stars":3,"date":"2015-07-07","text":"I have to agree with my fellow Yelpers.....the food is awesome, but the service is terrible. The waitresses lack basic serving skills. The price is right for the amount of food you get. We had a table of 4 adults and our sushi bill came out to $100.","useful":0,"funny":0,"cool":0},
{"review_id":"gZq-tsiHoz2siL82-iMz8Q","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"qpcZSHPLb8gTCI2T0XSYsA","stars":4,"date":"2014-01-06","text":"Large portions, quick & friendly service, and clean bathrooms. The egg rolls are amazing and the prices are great too. This is only the 2nd time we have had pho and it was really good!","useful":0,"funny":0,"cool":0},
{"review_id":"2ZouX8qF6iLXESB9VkOqzA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"pSQFynH1VxkfSmehRXlZWw","stars":4,"date":"2015-10-25","text":"Had to wait 1.5 hours to get a table for 2, but it was worth it. The food is fantastic! It's a very small, dark, loud establishment with a very historic feel. The staff is friendly and our server(s) were attentive.","useful":0,"funny":0,"cool":0},
{"review_id":"EYs19yFHd9ZneTcwVPHamw","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"boYDu57rLihB0HyVUpLk0Q","stars":5,"date":"2014-01-11","text":"Totally bummed that this location had closed. The frozen custard was way yummy and the grinder sandwiches were awesome. There is another location in Mesa on the NW corner of Gilbert & Southern (different owners though)!","useful":0,"funny":0,"cool":0},
{"review_id":"3ebM8HtSzJXjJV462XgcKQ","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"RzLlGTOFQZyoFgEpk0Ik0Q","stars":3,"date":"2014-04-14","text":"Came in looking for new bedroom furniture and was quite surprised at the prices. Very expensive for a thrift store. They did have a lot of really near collectible antiques, but they were way out of my price range. I will probably come back again if I am in this part of town but I won't be going out of my way to make a stop here.","useful":0,"funny":0,"cool":0},
{"review_id":"6spspfjTfJrjV6UnZon_Ww","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"zb_NGc44E6XjNxU4uOsPjA","stars":4,"date":"2014-01-15","text":"In the 2 years that my grandmother has lived at Springdale she has enjoyed it. The staff is helpful and the facility is clean. There have been a couple of 'hiccups' along the way that we were able to get worked out and overall it had been a mostly positive experience.","useful":0,"funny":0,"cool":0},
{"review_id":"4i_nofN3utan_w6qmaIgnQ","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"3DgPtOe-FKRH0bFE3ptzxA","stars":5,"date":"2016-11-25","text":"My favorite little breakfast place with Midwest style down home cooking and great prices! My husband and I visit at least once per week. Service is quick, atmosphere is welcoming and the owners are wonderful!","useful":0,"funny":0,"cool":0},
{"review_id":"oDHO7Xa3meYEnNL6uh318g","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"jWpTckAGWMWEffl2D7NhCA","stars":4,"date":"2015-08-06","text":"Clean restaurant with sufficient amount of seating as long as you don't come during lunch time when the line is almost out the door. The food is great and the price is fair.","useful":0,"funny":0,"cool":0},
{"review_id":"JTBjXiUGPK2CQee9fE8u1Q","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"UVaRGEMPViXT4ENxXg2EJA","stars":4,"date":"2015-02-25","text":"Clean store. Well organized. Helpful staff, just not enough of them. Seems like I can never find any help when I need it.","useful":0,"funny":0,"cool":0},
{"review_id":"MHf-Sly6kP7Ay0cqqn7Tng","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"Nz9Tk-YjE6RHQBOExYbNng","stars":5,"date":"2014-01-11","text":"Love me some fresh frozen custard, especially from Nielsen's! The hot pastrami grinder sandwiches are awesome too!! It's a bit pricey but the employees are nice, the restaurant is clean and they have quick service. Definitely worth trying if you haven't yet!","useful":0,"funny":0,"cool":0},
{"review_id":"i5p53EfvpshFiCRhiz9o5A","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"nvuMlUxjxJF5GPr6De6UlQ","stars":5,"date":"2015-07-26","text":"I have been taking my kids here for years and they really like it! They really enjoy open gym every other Saturday night from 6-8:30pm.","useful":0,"funny":0,"cool":0},
{"review_id":"XY87D9jLOuRia3l9rSKUKQ","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"MCShtFPb8Kh6-57ZnKo_ZA","stars":3,"date":"2015-07-27","text":"Not the friendliest people I've ever met, but I guess I wouldn't be that pleasant either after working outside all day in the summer heat. The lobby is cool and clean with a selection of men only related magazines. Convenient location and fair pricing.","useful":1,"funny":0,"cool":0},
{"review_id":"nHxxZ-G71QbdMp_lkocDbg","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"oM_iooopkwnS7XnVS5kqlQ","stars":5,"date":"2015-03-02","text":"Always a good dining experience. The food is great, prices are reasonable and the place is clean. It's not very up to date seating wise...very old chairs and tables that could stand to be replaced.","useful":0,"funny":0,"cool":0},
{"review_id":"kI5ZeeCJyv7AAQEoeRMNaQ","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"_nB8HNT2IDRhlAoY9TPYew","stars":5,"date":"2016-01-04","text":"Amazing sushi at a good price. They have affordable lunch specials and a small, quiet environment. The service is slow, but the quality of food makes up for it. Will definitely dine here on a regular basis.","useful":0,"funny":0,"cool":0},
{"review_id":"WFZuVSx45pr9z29sc3cLqA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"bWucOPNoIjd8ECdiDyVq9Q","stars":5,"date":"2017-08-17","text":"Very clean Asian restaurant with usual Asian dishes. Lunch specials are affordable ($6-$12 each, includes soup) and they have a large drink selection.","useful":0,"funny":0,"cool":0},
{"review_id":"LmN0QZLOI89zh-BXYjwV1Q","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"ayvdoDcFZg9a9sQqN7VPhQ","stars":5,"date":"2015-02-27","text":"Convenient location, friendly staff and darn good coffee. This is my favorite DD location. They get my order right every time. A clean lobby and free wifi are a bonus.","useful":0,"funny":0,"cool":0},
{"review_id":"8ZpTPUz0br-hLkgJGXeKIA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"Pwn3UOiHDYq_UTOcpjgZcA","stars":4,"date":"2014-10-13","text":"A quick car wash at an affordable price. Convenient location and good hours of operation.","useful":0,"funny":0,"cool":0},
{"review_id":"rmHeVyDEg1Hob2QU4n3GOA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"nCcgzTaajDGgrZpFZaq8Ug","stars":4,"date":"2015-10-25","text":"Nice clean room with a large bathroom, free wi-fi and cable tv. Within walking distance to Talking Stick Arena, where we attended a concert late at night. Unfortunately it's not in a great part of town, but the area is getting cleaned up with time.","useful":0,"funny":0,"cool":0},
{"review_id":"H1i7ibFVyCLUB8OfWCG6Mg","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"T3y7m50JXsf8HI66L4f72w","stars":4,"date":"2014-04-14","text":"I must admit, I was really nervous coming here for the first time and not really knowing what to expect. The facility was clean and inviting and my waxer, Billie (a female), was wonderful. She cut right to the chase and had me undress and hop on on the table the moment I got in to the wax room. She was friendly, personable and did a great job explaining the process and what she was going to do. It wasn't nearly as painful as I thought it was going to be and I liked it enough to schedule another appointment when I checked out. The prices are reasonable and I look forward to coming back in 3 weeks.","useful":0,"funny":0,"cool":0},
{"review_id":"rZdGrcaSFyrfRIZasoDv7A","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"2KWkeOk1KaH50Es_A-8cnA","stars":3,"date":"2016-04-22","text":"Good food, terrible service. Very loud indoor atmosphere and poorly shaded outdoor eating area. The waitress never checked back with us after taking our order and our glasses sat empty on our table for the duration of our meal.","useful":0,"funny":0,"cool":0},
{"review_id":"29TInmgPA1czo1cbcs1j-A","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"J8GuDrqeLH1xMpSpeEixYA","stars":3,"date":"2016-02-11","text":"Stopped in for breakfast because our regular breakfast spot was closed. The food was good, the waitress was really friendly and the restaurant was clean & quiet. It was nice to have have free local newspapers to read by the front door and there was plenty of easily accessible parking.","useful":0,"funny":0,"cool":0},
{"review_id":"OFu_ZfveuZl8sAItVvrJQA","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"RIPS917yIZ84FLXsjz-cYA","stars":5,"date":"2015-07-07","text":"The teachers are wonderful and my children really enjoy attending daycare. The facility is clean, the staff is personable and they provide bus transportation after school. The location is convenient and secure.","useful":1,"funny":0,"cool":0},
{"review_id":"D2DAin7NLhjgCgoUKFwkng","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"y973FDy4JV5N7tZ7rswdwA","stars":5,"date":"2014-04-09","text":"I have taken my vehicles to many mechanics over the years and these guys seem honest and straight forward. Prices are reasonable for a franchise company and all the work is done in a timely manner. The guys at the front desk are very personable and location is very easy to find.","useful":0,"funny":0,"cool":0},
{"review_id":"BITuwcESZSfFof-pYX0fGw","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"qRqd8bXyAhjYAxisl5e8UQ","stars":4,"date":"2015-02-25","text":"Have never ordered anything off of the Schlotzsky's menu here. I come here for Cinnabon. Restaurant is decent and clean, not immaculate. The staff is ok. Cinnabon is pricey, but that's nothing new. Way yummy though!","useful":0,"funny":0,"cool":0},
{"review_id":"KrXg1m4f_knI7mqb46sC9A","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"9ibMbke1qYbmhJ2Qf3tWfA","stars":5,"date":"2014-04-09","text":"Friendly staff that speaks English clearly, quick service and very yummy food. Prices are very reasonable and the restaurant is clean.","useful":0,"funny":0,"cool":0},
{"review_id":"sp88t0j2ZVKPeRSBDxLj8w","user_id":"6IhssoagVtfNMnNjU71Q1A","business_id":"l0GGUA_ry05IS9WIRwcP-A","stars":3,"date":"2015-07-07","text":"Inexpensive tools and supplies when you're in a pinch. Definitely not quality products, but they will do.","useful":0,"funny":0,"cool":1},
{"review_id":"v1X50vmUCYIPsOosRCvnRg","user_id":"f9NVh1UWkW6DTnckfOuwEA","business_id":"Vg4N2DsGrzzoam9jS1L3Wg","stars":4,"date":"2015-10-17","text":"At 3.80 for a burger this place is great. Minus  one star for lack of toppings and no mayo but the essentials are there also for the price i understand. I recommend","useful":1,"funny":0,"cool":0},
{"review_id":"6IsC3q3ZULUWcbme0SdZYQ","user_id":"f9NVh1UWkW6DTnckfOuwEA","business_id":"YJ05ntGlszxACOD5zn1YjA","stars":4,"date":"2015-10-17","text":"Had a cheese burger and fries was really expensive for what i got. Greasy patty and fresh fluffy bun it was OK","useful":0,"funny":0,"cool":0},
{"review_id":"zItk9yIBMsmYJA-72fF42w","user_id":"f9NVh1UWkW6DTnckfOuwEA","business_id":"xFkUn2tIJY0vkcm1Hl5m_A","stars":3,"date":"2015-10-17","text":"So the first time i eat here i got just a cheese burger as i normally  dont care for these \"designer burgers\" and the bill came to 19.00 for a burger and taters ,  drink\nWhich they said the tater where famous lol tasted like macain frozen  tater to me. The cheese burger was meh so i said I would never go back for a 20 dollar burger that was meh. Then a friend at work told me to try the thanksgiving day burger. A well seasoned turkey sandwiched between STUFFING and MASHED SWEET PATATOES AND CRANBERRY JELLY  amazing also again almost 20 bucks but worth every bite . But due to price of a regular  cheese burger  i will only come back for the \"Thanksgiving day\"  if you are going to eat here you better have deep pockets like a movie star","useful":0,"funny":0,"cool":1},
{"review_id":"yCA7OfyDeaRRENdKQtc71A","user_id":"f9NVh1UWkW6DTnckfOuwEA","business_id":"SFfPGiq4B0TtpWkLhdCpjA","stars":5,"date":"2015-01-14","text":"This place is the spot for burritos not just in Scarborough but toronto. Price is amazing and ingredients are always fresh, I recommend this place to anyone","useful":0,"funny":0,"cool":0},
{"review_id":"RfIRHUuTcu8AUHlenIg2rg","user_id":"BlOnCyq4GZoTz-uFgCMx6A","business_id":"_ypwtK0_ilVZNlsP1z3jBg","stars":2,"date":"2011-11-30","text":"Have stayed here on numerous occasions and the quailty continually declines.  I was stuck on the main level with a parking lot view, which was very depressing.  The room was old and quite dated.  I requested that I be moved, but I received the \"we're overbooked and this is all we have left\" speech.  I will consider other hotels in the area before this one in the future.  It just isn't the same place and this is post renovation.  Before check out on my last day, no cold water, only hot.  Told the staff upon check out and received 10% off my last night's rate.  Whoopie!","useful":0,"funny":0,"cool":0},
{"review_id":"WGgtkSQGH264qlYGiRHkKA","user_id":"XvnujWCL1k5thTpmYJMlmQ","business_id":"qUcdv_IREg2KnhqZZB96ug","stars":5,"date":"2017-11-22","text":"Rickie Parvin was extremely helpful with my situation. I called the office and she asked where I would like to be transferred, but Instead of transferring me, she helped me out immediately and promptly with the information and paperwork I needed. Thanks Rickie!!!","useful":0,"funny":0,"cool":0},
{"review_id":"kwXpEp2kbzFW00B8NtBt-g","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"77h11eWv6HKJAgojLx8G4w","stars":5,"date":"2017-09-11","text":"Get here early and be prepared to wait . It's worth it , different in the sense that it's almost like a fast food spot but better. The line moves along fast with everyone anticipating a chance to eat . Your able to view everything being made which adds to the anticipation . Flavor and fulfilling to the last drop ! Tip bring your own beverages hahahaha . Good to the last drop. Must try","useful":0,"funny":0,"cool":0},
{"review_id":"FCwObCkDWAWWgIUpr9gytw","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"PjEls_NCOQ0m4tJPvcTY8w","stars":5,"date":"2015-10-13","text":"Nice to start your Tuesday off at Fat Tuesday . Yard for me with the a couple of extra 1.00 shots !! Bargain , oh yea be sure to save your cup for refills","useful":0,"funny":0,"cool":0},
{"review_id":"nVrXJh4WtOHqpCUX-dF0bA","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"U-zsJM-VN89i3PbaIbKmJw","stars":3,"date":"2015-09-16","text":"Went to this place on Monday night football. Walking in looked like a nice place to cheer and get your grub on !! I was there for the happy Hour so I ask the waitress about sitting on the comfy chairs up front. Her reply was it's not a 1st come , 1st served and we would have to charge your party of 5 a 150$ I was like just to sit or is that how much food and drink we needed to order . Her reply was \" just to sit. \" we started laughing , not high rollers at all. We gently walked ourselves over to the bar stools . Hahahaha.                                                    Over all experience was cool, not a bad seat In the house . Good choices for beers if that's your thing. The Yard was a good look, we ordered up all the appetizers and felt the jack Daniels wings were a hit too. Will be looking for another sports bar upon returning to Vegas . Oh yea our bill came to 155$ and all I could do is laugh because the comfy sofa couches didn't even fill up.","useful":0,"funny":0,"cool":0},
{"review_id":"0bErtfZ9bEEGNtDUzclMnQ","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"1iZJlc1b6FfRsWa3FHm4lw","stars":5,"date":"2017-09-18","text":"What a way to start your morning or day off !! Definitely clean , healthy to kick start your body. Wide variety of drinks and cleanses. Can be overwhelming your 1st time but you can sample any of them that catches your eye. It's one of those places where you go and feel good about trying the different flavors. Staff are friendly and knowledgeable of the product. Hey and if you want to get a little alcohol in your healthy drink that's an option too.","useful":0,"funny":0,"cool":0},
{"review_id":"gkcPdbblTvZDMSwx8nVEKw","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"RESDUcs7fIiihp38-d6_6g","stars":5,"date":"2015-09-16","text":"Got here early on football Sunday 7:30am as I wanted to start the day off right. Heard this was the best buffet in town besides Bally's hotel . So upon entering the buffet there was no line or wait. Hostess was nice giving us the once around tour because it was our 1st time. The food looked incredible and my mouth was salivating to try it all. I'm the type of person that my first go round is to try it phase then the next time , and the next time I Attack !! Steak and eggs were bomb , omelet was on hit too. Red velvet pancakes yum . Had problems with the country fried potatoes but the onion rings made up for it.                                             Not a big fan of the champagne and orange juice so I instead opted to order the bottomless beer  Yeee !! Sea food was incredible and made sure I did damaged there also. Made a pit stop for the food truck type tacos . Brought it home with the desserts ! Well rounded buffet really , really enjoyed it . Some yelpers I see complained about $$ it's well wort it !! Will come back !!","useful":0,"funny":0,"cool":0},
{"review_id":"Eb8pLyneW1NymZpU_O3O1Q","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"f4x1YBxkLrZg652xt2KR5g","stars":4,"date":"2014-09-08","text":"Had to try the chicken and waffles because that's what people talk about. Impressed !! It's definently a shared meal unless your starving . Atmosphere is nice , waiters polite and sociable . Only knock I had was we were waiting on people from our party that was down stairs parking and they didn't sit us until everyone came . It's the policy . Must try tho when in Vegas .","useful":1,"funny":1,"cool":1},
{"review_id":"rtvjwWRtbxM-ZSh425fbDQ","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"64A4CTvJ2uRQVPkJ5E91ag","stars":5,"date":"2014-09-09","text":"If I could give more stars I would !! Shout out to Johnny R. For making my sons 21st BDay  tha bomb !! Had us in the club with a VIP experience like no other . We partied and closed down the place . The vibe was good , music was good and jus Dancing and partying on the Roof top is like no other. Shout out to Johnny again we had a ball!! Ps our waitress and security was on point too.","useful":0,"funny":0,"cool":0},
{"review_id":"7Nydn1NwZ8Gxab9VasDcjw","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"WYw3Uf56DT5IwpaLNnCH5Q","stars":4,"date":"2017-09-17","text":"Just stayed at this lovely hotel !! The reason for 4stars is that they need to tell you it is back off the strip and a hike to get to any of the other hotels beside the Bellagio Hotel. It was bad jus getting around and trying to navigate a way out of there period. Now to the good part , the rooms are spectacular because there all suites ( with a door bell  ) Beautiful view of the strip and water show ( if your so lucky to get panoramic view). We were lucky !! Good service friendly staff . If you want to relax and not have the hustle and bustle of the strip it is recommended . Also remember to bring up the groceries for the full kitchen .","useful":0,"funny":0,"cool":0},
{"review_id":"Wt1wNaBwXa20kV6Hrf5KVw","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"QJatAcxYgK1Zp9BRZMAx7g","stars":1,"date":"2015-09-16","text":"I went to shake shack the other night as it was on my list of places to try in Vegas . Easy access this time because I stayed at the MGM Hotel. Not impressed at all, actually disappointed in the place . Pricey and lacking burger !! After ordering the double bacon burger and milk shake , mouth was waiting for explosion . Total flop after opening up the bag to see this small ass burger. Needless to say this place was a dud to me IMO . Oh yea the shake was also a bust for me . Never to return !! Glad there was no line when I went.","useful":0,"funny":0,"cool":0},
{"review_id":"R1Ij3P8oGhAPNKjP4N9cRA","user_id":"SKteB5rgDlkkUa1Zxe1N0Q","business_id":"xTOX8D1Tavoi9vPWL-nWdQ","stars":4,"date":"2015-09-17","text":"Hit up the Monte Carlo to treat my mom and wife for there 1st time here. They were dressed in the all white of course . I've been to the other bar at Mandalay Bay so this is the same layout for me . Kind of small and quaint inside . My mom and wife really enjoyed  themselves and we stayed in ther for 30 min. Having 2 drinks and some good conversation about this experience . Nice bonding,  something unique and different that's for sure a  good time out , kind of pricey but well worth it for 1st timers !","useful":0,"funny":0,"cool":0},
{"review_id":"Mael5lR7i0aB2in4SZe5Aw","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"8-Ht3meyFzpGqJ0j2x-8Wg","stars":1,"date":"2017-01-03","text":"Bad customer service. I waited in lobby for 25 minutes and no one even came out to help me.","useful":0,"funny":0,"cool":0},
{"review_id":"1VD6N64hVkMyzyKfAZXmwA","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"ExtP8z3SVyut_RICc9i_DA","stars":5,"date":"2016-08-27","text":"This place has the best falafels! We have dinner here probably once a week and the food and service is always top notch! Everything we have tried on their menu is always good, the chicken special sand which is also another favorite and must try!","useful":0,"funny":0,"cool":0},
{"review_id":"wM229qQisw3nJu-UO_zjmQ","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"yesClkCZlpLGTYZROkx4SA","stars":1,"date":"2016-06-15","text":"I was really excited to visit this place because of its funky look and DDD. But it was a total let down. We went on a Sunday afternoon and it just us and like a couple of other tables so they were not busy at all and the service was so incredibly slow and bad. Our appetizer and the kids meal we ordered came out pretty fast but then we literally waited for like 30 minutes for our food which we learned later was just sitting under the heat lamps for like 15 minutes. There were like 3 servers hanging around not busy while our food just sat there. And our server was hanging out at a table sitting with them for like 10 minutes when our food was just sitting there. Finally we got up and asked where our food was and it still took another 5 or so minutes for someone to bring it. The tacos were soggy by this time and not good. Aside from the bad service the food was just a total let down. The kids meal was gross and our tacos were soggy and it seems the oil was old because everything fried had a bad taste to it. This was a bummer because this was a place we were excited to visit and we left not even enjoying or completing our meal.","useful":0,"funny":0,"cool":0},
{"review_id":"mxbYkPLTSzyHwobxAo7Xfw","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"oMwtznLyeM5fO5kEIqSGYg","stars":1,"date":"2016-10-02","text":"This place is so dirty and really bad customer service. And the worst thing is that on my last visit there and it will definitely be my last, the employee had a  CAT in the back of the kitchen running around. Which is so incredibly unsanitary especially around the food.","useful":1,"funny":0,"cool":0},
{"review_id":"p3P7EtPFexolKYonxvC41A","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"BNtQD_aXWOA_Ip99grNMLw","stars":1,"date":"2016-06-15","text":"Me and a group of friends went to this place one night when they had live music. We had a very bad experiance and ended up leaving because of the rude service. We were a small group and we are obviously different looking than the crowd in the restaurant. The servers at the bar where very rude and no one offered to take our order or seat us. Then there was an open booth near the front and we asked to sit at that table and one of the servers told us that it was taken even though no one was sitting there. Like 10 minutes later a white couple came in and they offered the booth to them. We finally realized that there was a back room with empty tables and we went and seated ourselves and literally waited for 15 minutes before anyone even walked over to our table to ask for our drinks. They saw us seat ourselves which is why we finally got the hint that we were not welcome and got up and left. I think unless your a local in the neighborhood I would not visit this place. Very rude and unwelcoming atmosphere.","useful":0,"funny":0,"cool":0},
{"review_id":"0_MLaqWz9uDrrLEcr65TxA","user_id":"RiIOfGbdkS5zJAnfDlVwnQ","business_id":"iAD5r5vNOzc1AP6UA5yFiQ","stars":1,"date":"2016-08-11","text":"This place has a serious problem with unwelcoming and rude servers. We have been back a few times because the food is pretty good but each time the servers are always rude and not friendly at all! And the service is slow because they hangout in the back behind counter and talk.","useful":1,"funny":0,"cool":0},
{"review_id":"KhQsGSlQKXjI58zLqqLwVg","user_id":"uq_N4rZOBhARKQmvskEk-Q","business_id":"Y3CERs904rCDR1atLi1DCQ","stars":5,"date":"2017-02-28","text":"I met Ms. Roxana Valeton at the Rio Hotel Convention  Center during the Community Wellness and Resource  Fair. She was so sweet,  friendly  and accommodating. She told me about A New Day Community  Center and since I was new in town and looking for a doctor, I called for an appointment. \nThe clinic had a friendly  atmosphere.  I found the staff extremely helpful and courteous.  My doctor, Dr. Mostafa Sheta, was very knowledgeable and professional. To top it all, they gave me samples of some of my medications. \nI have nothing but praises for this health center, go check it out!!!","useful":1,"funny":0,"cool":0},
{"review_id":"DkB1U132ZDPnjN1EbknROg","user_id":"OIlRPZMGzRVjsujbCtJEIA","business_id":"pHsoinSUwG09PgGdgn33og","stars":5,"date":"2015-08-08","text":"She's located 2 seconds from my house inside of the Sports Cuts salon I somehow managed to bypass for 10 years. Today was my first time ever coming to Shabi and it really felt like the thousandth! Right away she was so sweet and and treated me like a personal friend. I have no idea how, but she managed to work with what little brows I had and made them look amazing!! She is so precise and really knows what she's doing. I read all her reviews on yelp before deciding to go here and i'm so glad I did. I'm going to recommend her to everyone!!","useful":0,"funny":0,"cool":0},
{"review_id":"NmHSnV4pDK3oX768T1bxhw","user_id":"vkHzMbYUWQRnHbC9vKGjQg","business_id":"vDhifJNAtVFGjqJM5hFQkg","stars":2,"date":"2015-03-22","text":"I gave this hotel 2 stars because I did not see any mice, roaches or bed bugs in my room.\n\nThe key to staying at this hotel is have your paperwork in order if you don't they will double charge you....that's just the way it is. I booked this hotel through priceline made sure not to give my credit card to the hotel.\n\nDo not give these people your credit card. \n\nI wanted an early check-in but they wanted to charge me an additional $14.95 resort fee for checking in before 11am. The resort fee is an additional $14.95 per night. I waited until 11am to check in.\n\nThe resort fee is for internet service in your room supposedly...I believe it's just a way for the hotel to make more money.\n\nWhen I did check in the woman at the front desk tried to charge me for 5 night resort fee when I only paid for 4 nights through price line. I had to correct her by showing her my price line paperwork.\n\nI used cash for $100 refundable incidental deposit and the 3 night resort fee which was slightly under $60.\n\nThey tried to put me in a handicapped room (don't know why) but I requested a regular room instead.\n\nDuring check in if you don't correct these people early they will double charge you or give you a terrible room. I still ended up with a really bad room.\n\nThe room I had was in the basement the window view was an outside wall. The bathtub was clogged with hair an green slimy stuff. I tried to pour bleach in it to unclog it but that did not work. The bathroom sink had hair in it. The carpet looked old dingy and dirty.\n\nThe entire room reeked of cigarette smoke.\n\nThe buffet was bad.....for some reason it looked like the food had been sitting out all day without being stirred or freshened up or replace and it was not cheap.  Dinner cost $12. \n\nI didn't complain to management about my experience at the hotel I didn't think they would do anything about it......according to the other reviews I read.\n\nIt's a cheap ran down smelly hotel.....at least I wasn't double charged. It's not the maid fault that the rooms are ran down.","useful":1,"funny":0,"cool":1},
{"review_id":"geLzz_pahSmm_7CznvqlBw","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"WD64Zr_LUXITJVAOFnT5Aw","stars":3,"date":"2013-03-24","text":"The food there is really good. Service was not that great but not terrible either. They have 1,000,000 TVs for watching sports.  the place itself is really big great for big crowds.","useful":0,"funny":1,"cool":0},
{"review_id":"nbXpWZWTOog4Zuumb1DJtQ","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"b7pkopqvDr7A7S7hlqp6cw","stars":5,"date":"2013-03-10","text":"Food is so good! They have a new menu out with new pasta dishes and pizza's. Service is great they deliver also. Their food is like having a restaurant like olive garden deliver to you. The average delivery time for them is about 35 minutes pick up is 12 minutes.","useful":1,"funny":0,"cool":0},
{"review_id":"e56WFRusxi3EePgeLKQMyQ","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"Ya9FMj-MWMkeMcog06N5bQ","stars":5,"date":"2013-03-24","text":"This place is wonderful I had my wedding reception there in the basement VIP section. Service was great food is very decently priced. Wednesday night drinks are only 1 bucks","useful":0,"funny":1,"cool":0},
{"review_id":"jnSDGSArqQYJ1vHLIExkyw","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"NTKxxbg2l55sdKD1UmBiBw","stars":3,"date":"2013-03-10","text":"I go there probably 2 or 3 * a week for the last year and nothing's really changed. Monday night is the best night to go beer is 2 dollars and mixed drinks are 2.50. Other than Monday they are very expensive for the location and the service you receive. They have 1 or 2 great bartenders and the rest are either drunk on the job or too busy caring on conversations with their friends to get you a beer. They do have a great setup for watching sports and a lot of space. Food is pretty decent too and fairly priced. To be a mom and pops bar it's pretty decent. On Monday night thats the night to go good crowd too","useful":2,"funny":0,"cool":0},
{"review_id":"vUqHvbp-Q6ICUdwfoMSlSg","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"aTFmU9dCoGGmvzDSsa5lhA","stars":1,"date":"2014-12-06","text":"If I could leave stars blank I would!!!! This place was gross, don't get me wrong great server n food was good for bar food. But after finding a fruit fly in a beer I was grossed out. I asked for the beer to be removed from my tab, the manager would not allow it. she made us pay for it!!! I don't complain much as my perffesion is a general manager in the food industry. We even killed two more at our table before she came to speak to us. Her excuse was that it's the end of summer and this happens. TODAY IS DECEMBER 5TH in Ohio.  never been so offended in intellegence and sheer customer service. Will never go back. They gave me a cup of bugs and told me to deal with it wow.","useful":2,"funny":0,"cool":0},
{"review_id":"o9kd-SAqumPrsudYFBxvsA","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"f6swKoBMy4v5X6UR6YadYA","stars":4,"date":"2013-03-09","text":"This place is great all beer and mixed drinks are only 2 dollars. Inside the place is huge and every Friday and Saturday they are packed. They play good music and the servers are really fast. Only problem I have and I warn you be careful if you pay with your credit card they make mistakes sometimes and overcharge. The other night my tab was 18 dollars but the next day when I check my bank account there were 2 charges from them. Other than that great place to hang out friendly people.","useful":0,"funny":0,"cool":0},
{"review_id":"ygUlJd1js_bu-a3U1kP9jA","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"kJHrgtkkXDNrP7gu4OTXCQ","stars":5,"date":"2013-03-07","text":"This restaurant was very classy. Me and my wife brought a bottle of wine a appetizer and 2 dinners and the bill was only 62 bucks. The food was amazing so much flavor!! The staff was very polite and fast.","useful":1,"funny":0,"cool":0},
{"review_id":"XoEGsMpiTmqRk7G0mQpb-g","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"aAVydRJ23okd1AHi2AS4Mw","stars":1,"date":"2015-09-09","text":"Me and my 5 year old son stopped at this place for lunch. First time we have ever been there. I walk in immediately start looking at the menu on the wall. Young lady asked me what I liked was very helpful. I brought two corn beef sandwiches. I noticed that they had chairs where you can sit down, so me and my son sat down and waited on our food. When we received the food I figured hey let's just stay here and eat. I started to pull my food out to give my son his sandwich and a rude Nigerian or Jamaican guy! So not politely told me how there's a sign by the door stating if its pick up you must leave. Then after embarrassing me in front of the entire restaurant he proceeded to yell out to a crew member put a bigger sign up.  I'm pretty shocked at the way the customer service in this restaurant. Most restaurants would have let something as simple as me deciding to change my mind from pick up to dine in GO. Especially when I spent about $20 on two sandwiches. pretty sure I won't ever go back there again. Besides they gave me a cold cornbeef sandwich. The Swiss cheese was not even melted, and the worst part about it all they don't put mustard on the sandwich. It could have been handled better. At least offer me the option to pay the Dollar to dine instead of just throwing me out.","useful":2,"funny":0,"cool":0},
{"review_id":"ItgnZXFHPxWJICFoLZtIog","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"bWI9t-tXQG7FCRCaVd5YRg","stars":4,"date":"2013-03-10","text":"I think this place is great all around. I like the location in north Olmsted better because it's bigger and there's a more attentive larger staff as well. But who can argue with 2 dollar drinks and decent service. Beer cheese soup AMAZING!!!","useful":0,"funny":0,"cool":0},
{"review_id":"YuaNzxaC2wrxWn7WOKnePA","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"DaxEPd4fQNCksMy3xzBraA","stars":4,"date":"2013-03-24","text":"Very fast service. But the place is so nice you'll feel like 1 burger will cost you 20 dollars but it's only McDonald's","useful":1,"funny":1,"cool":0},
{"review_id":"5QNdDqYtpySykhZyrlkGsQ","user_id":"PwOYstqW_MVUbV4qWonCEQ","business_id":"bNt_GCxZjWZne1odwDicLg","stars":4,"date":"2013-03-24","text":"This place is pretty cool good service. A little pricey but not that bad. Great outdoor patio set up for the summer. Worth going to and they have daily specials.","useful":0,"funny":1,"cool":0},
{"review_id":"nkPCFLK0aUkMhbL96kBsYQ","user_id":"f3SyEOsbhwupPkUki-tNGg","business_id":"CqAfATa4bN_VD5BuY82TRQ","stars":1,"date":"2009-11-17","text":"His show in Paris Casino isn't worth its high price.  I paid for it and was disappointed from the moment that I walked into the venue, which was about the size of a large conference.  It's a cheap production and should have been priced in line with other hynotist shows.  Go see the video next the venue to see the show's highlights but don't expect more from his show.  You can expect boobs (on video), raunchy expletives, and simulated sex.","useful":0,"funny":0,"cool":0},
{"review_id":"_28NJR0zf06sKIBvaa_NfA","user_id":"f6muwLWMyYvBXmUR3NFY5A","business_id":"EjBZKPyq_G9WMO01N8DnDw","stars":5,"date":"2016-03-13","text":"I was here before an event at the arena and had a blast.  The Beer Cheese Dip was the BEST I have had in years.  The staff was fast and efficient.  I will stop here again the next time I am in town.  Overall, the section was outstanding.  Prices were low.","useful":0,"funny":0,"cool":0},
{"review_id":"eaoLDo2Jc1SNLqO4ltEoPA","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"gqdqnFg2lYeSyS20q2ZK_Q","stars":3,"date":"2014-12-18","text":"Like a few reviewers before, I'm somewhat conflicted on how I feel about this place. It's a great addition to those who live in the SW side of town, and they do have tasty pastries. I guess I'm biased because I had really high expectations on coming here from all the reviews, and it's been in my bookmarks for some time now. It's clean, and good compared to other asian pastry shops here in town, but if you ever travel outside of Vegas, you'll see that there are places that can execute the balance of flavors a little better. If I could give it 3.5, I would. We tried the coffee jelly, tiramisu, and green tea cream puff. They're all fine, but I didn't finish any of them, which is unusual for me. Even though I'm only giving it 3 stars for now, I do encourage you to give it a try to taste something different here in Vegas!","useful":0,"funny":0,"cool":0},
{"review_id":"ez6k7MoxHz2pixT_hkBUrQ","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"dEAk-gE-5Q95a7p91gNn8A","stars":3,"date":"2014-06-29","text":"Quality of the sushi and food is good.  Didn't care much for the rice - it was a little hard.  The server was nice, but the place got really busy, and I felt like we waited around an awful lot.  Then later on the place smelled like something was burning. Not sure if I'd come back again for lunch, because if you have plans after - you won't make your schedule. Maybe ok for dinner?","useful":0,"funny":0,"cool":0},
{"review_id":"NiNi02Qr2zteMROtupFVYg","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"gx2yPrOJSwF1ApJYdGBWIw","stars":3,"date":"2014-09-13","text":"It's funny, another yelper mentioned a great ambiance - but I guess it's not to my taste. I don't need silence when eating my ramen, but the music was way too loud. It's not really enjoyable when you server has to yell at you, and you have to yell back for them to hear you. To make matters worse, there was awkwardness at the communal table between the random couples (yes I've sat at communal tables before without issue). Thank goodness the food was better than I expected! If it was just based on food, I'd have given it 4\/4.5 stars.","useful":0,"funny":0,"cool":0},
{"review_id":"NSddNtCMcYmDVgLa5Ah1qQ","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"Y1LB0uDuJQ1jP5usRdsZZg","stars":5,"date":"2014-10-01","text":"We enjoyed an incredible dinner here tonight - having dined at Michelin star rated chef's restaurants in Tokyo, Japan, I can assure you - this is the real deal!  You get to enjoy an artfully presented, well balanced tasting menu that leaves you full, but not stuffed.  Truly a great experience, and one not to be missed!! :)","useful":2,"funny":0,"cool":2},
{"review_id":"fBpCN3nyuo5tTfsbNtoyBw","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"O3OH5IEFMPtz7mPKakPZ3Q","stars":5,"date":"2014-12-18","text":"Enjoyable happy hour menu - it was a great way to try everything! We will be back again, and are getting the truffle edamame and black cod lettuce wrap again for sure :)\n...so I made the cardinal mistake of posting before I finished my meal with dessert - the green tea tiramisu was amazing!  I'm a big fan of the milk tea ice cream too. Also, I was really impressed by how knowledgable our server was about the menu. She described everything perfectly. And you always have to appreciate it when the chef takes the time to come out of the kitchen to touch (greet) every table!","useful":1,"funny":0,"cool":0},
{"review_id":"1ZcmZ2Ln-0z2I4Hd2Gw77g","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"Tk7qCou7aYv_Z-K3a7NhhA","stars":3,"date":"2014-09-01","text":"Dined there last night with friends, and while the food would definitely merit a 5 out of 5 stars, the service was probably one of the worst I've had. I understand they were very busy, and had a lot of things going on (large party in the other room), large parties in the main room - but there's a way to be busy, and gracious, without so much...tension? It was outright awkward. One person in the party didn't get their food, then another guest was accused of taking that dish - but I guess the server didn't punch in the order correctly for the ticket? It was just weird and uncomfortable. Another guest asked for help in getting drinks ordered, and no one would respond. I'd have typically given it 1 star, but hopefully I came here on an atypical night, and would like to give them the benefit of the doubt...or maybe suggest take-out to fellow yelpers? :)","useful":0,"funny":0,"cool":0},
{"review_id":"qhLs2cOFyLYT_m2PKPxKJg","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"dm6sO_Y8JdKTE1ZM955yug","stars":5,"date":"2014-06-30","text":"What a surprise! Came here from a recommendation by a friend, and it lived up to it's rep. It's got a nice, trendy, modern sort of atmosphere, and combined with tasty Thai fusion (I don't know if I'd call it 100% traditional) - it's a definite hit!  We'll be back again","useful":0,"funny":0,"cool":0},
{"review_id":"Okb9rOyRonnT1KVGs6gCww","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"K-7aLt6tzin1azgV61IdRg","stars":5,"date":"2014-06-28","text":"After asking a friend of mine of where to go - I took my SUV down to Island Auto for an oil change and a check engine light that was on in my car.  The owner was really nice and honest - he didn't give me the run-around or try to overcharge me.  My car was repaired well, and for a much better price than what the dealership wanted to charge me.  Will be back again!","useful":3,"funny":0,"cool":0},
{"review_id":"nuEuQ7Rw4QqZ8FBVaMq47w","user_id":"dl69uaA2E0Ee2x7kyhNWQA","business_id":"JXS5uSc0lMPMl_JOkJq6Kg","stars":5,"date":"2014-06-28","text":"I have to be honest - I feel for the girls who had a poor experience at this David's Bridal...but I personally had the complete opposite experience.  I walked in one day on the spur of the moment with my fianc, and made an appointment for later in the week (when he wouldn't be there).  When I arrived with my mom that morning, I was greeted promptly by the friendly girl at the desk.  She got basic info from me on what I was looking for\/budget\/etc.  We then were led to the fitting area with my consultant, Tatiana.  After reviewing what I was looking for, she started to pull a few dresses at a time for me to try on.  She took the time to ask me what I liked and didn't like from each of my dresses.  She was really sweet, professional, and genuine.  I told myself I wasn't going to buy a dress at my first appointment ever...but after 3 hours of trying on dresses, and trying my favorites back on a second time...I selected the gown of my dreams!  Not only was I never rushed, or ever made to feel like I was just a sale, my consultant Tatiana made me feel like an instant friend for the day.  She didn't try to blow through my budget and bring me dresses that were on the high end of my budget - she really did try her best to make me feel amazing and beautiful.  I ended up picking a dress that wasn't even what I had in mind - and I'm so glad for it!  The manager was also very polite and my mom and I were happy she took the time to introduce herself to us.  Yes the store had other brides, and yes there were others looking in the mirrors, and yes my consultant had to split her time...but it's such an exciting moment - I didn't realize how much time was passing, and it took some pressure off to not have her there standing by me the whole time, allowing me to talk to my mom about each dress.  As someone who also works in guest service, I can tell you Tatiana was great at multi-tasking - she gave me all the time I needed, and when she was working with me, she had her focus completely on me.  When I came back to the store a few weeks later to pick up my ordered sash, I had another great experience!  The lady at the desk this time also greeted me, and helped me find the headpieces (since I now wanted to try them on too)!  A consultant who was in the area was really kind, and he asked me if I needed help, and offered suggestions for what I was looking for.  When I finally made my way to the counter an pick up what I was actually there to get (my order), the manager and consultant there were both great...I am honestly blown away with it all, because I know it's rare to find that level of incredible service from a large chain.  Thank you, Tatiana, and the whole crew at this David's Bridal location!  I'll be sure to come back and get all my bridesmaid dresses \/ accessories very soon.  :)","useful":1,"funny":0,"cool":0},
{"review_id":"t31CKdnpC_tGUI2BrDo_XQ","user_id":"Ogwl4MO6XdJCRAqRbjAMMA","business_id":"lKq4Qsz13FDcAVgp49uukQ","stars":5,"date":"2014-03-29","text":"My husband and I went there last night once we landed in las vegas, and I am happy we did. The slices are huge, and delicious. \n\nI did however, just get the basic cheese pizza.. kind of hard to screw up. But I have no complaints.\n\nI will definitely be going back for another slice before I go home.","useful":0,"funny":0,"cool":0},
{"review_id":"M22Nx6kzmqL_dMWD-FAwEA","user_id":"Ogwl4MO6XdJCRAqRbjAMMA","business_id":"MAuSh7NKoT__CQ4BumoayA","stars":5,"date":"2014-03-29","text":"I went here for lunch today and it was great. I first walked by the place yesterday and couldn't stop thinking how good it probably is.. and turns out, I was correct.  \n\nI got a strawberry margarita, guacamole,  and beef burrito.  The drink was strong,  guac was fresh, and the shredded beef burrito was so flavourful and filling. I was only able to eat about half of it. \n\nThe service was awesome, it was happy hour and our waiter was very attentive with our drinks and the food was out within 15 mins. \n\nI would recommend this place to any Mexican food lovers. Mmmm.","useful":0,"funny":0,"cool":0},
{"review_id":"orJUJJMes6ehBzfJA0fttw","user_id":"zg-_GZh0hFAnPqUyepPeIg","business_id":"YakO7e9dxaYk5WrkNyRVFQ","stars":1,"date":"2017-03-05","text":"Not only was my vehicle towed for no explicable reason, but attaining it was an extremely frustrating situation. Their website states that they are open DAILY from 8 am to 6:30 pm. Upon calling them, the rude woman on the telephone told me that they had indeed closed at 12 pm that day, but for an extra 40$ fee they could have a driver come release my vehicle to me in no less than 45 mins. Let's just say I've been waiting for over 2 hours, have called them several times and have still not gotten my vehicle. I'm extremely dissatisfied with their poor customer service and value for the time of others.","useful":0,"funny":1,"cool":0},
{"review_id":"3_CJFwV7QyHuyGW10bPg9A","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"UOtoOybZ5vAB4aXBLc57vA","stars":3,"date":"2014-02-09","text":"When we first arrived here, I thought this place would be a 5 star experience. Their bacon board and apple pie moonshine is out of this world.\n\nAfter we had the bacon board, my husband and I took our server's suggestion and ordered their short ribs, which our server said were phenomenal. The short ribs come with fried coleslaw and we asked the server if we could sub asparagus and not get the fried coleslaw. So, the short ribs and asparagus come out. The short ribs were tough, small, and didn't have much flavor.\n\nThen, when our bill came we were charged the full amount of the short ribs and coleslaw, and an additional $4 for our asparagus, which clearly shows that it's $4 on it's own. So, why did we have to pay full price to sub them and then not get a side that was supposed to come with our meal? So, we basically paid full price to not receive a side, and paid an extra four dollars for asparagus that would have been $4 regardless if it was subbed or not. \n\nWe also experienced some issues splitting our bill and my husband and I were charged $30 more than we were supposed to be, even after telling our server that some of the items on our receipt weren't ours before she swiped our card. We were still overcharged and had to cancel one tab, but still be recharged for the other.\n\nThis place started out a wonderful experience but it seemed to get worse and worse as the night when on.\n\nI will definitely go back, but only for the bacon board and moonshine, not the entrees.","useful":2,"funny":0,"cool":0},
{"review_id":"17MmKs-QW6-mbQcmQX84uA","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"ld-foUbIqtcYTihGZkGsTw","stars":1,"date":"2012-05-16","text":"Big 2 Toyota is one of the worst auto dealers in Arizona. If you want a new car, save yourself time and money by going to Power Toyota in Tempe. A year ago my boyfriend and I bought a brand new four runner from Big 2. They seemed nice when we were there but our payments were outrageous. A year later we decided we needed to trade our vehicle in because the payments were so high. We went to Power and they asked for our contract. We gave them all our paperwork Big 2 had given us and came to find out they never gave us a copy of the contract. They also told us our payments were so high because almost $8,000 of stuff was added on to our contract that we didn't need. They even added a life insurance policy for over 3,000...guess what...I was 21 at that time and my bf was 24. We had no idea that we had agreed to all that stuff and felt so stupid that we let them take advantage of us. Power Toyota pulled some major strings to help us because we had so much negative equity. Now, Big 2 owes us a lot of money in cancellation refunds and when I called to find out the status of our refund they said they'd call me back and never did. I even left a voicemail for the finance director, Brian, and never heard from him. My boyfriend went through the same thing. Today, after pulling some strings we finally got them to call us back and we find out they lost our paperwork. Horrible business full of deceitful, uncaring, unprofessional people. Toyota is a wonderful company and Big 2 completely hurts their image. Once I get my refund I will never do business with them again and tell all my friends and family to avoid them and go to Power where they are not looked at as a number but as a person.","useful":14,"funny":1,"cool":0},
{"review_id":"koJNQHkOXJAYnM1xGizX7Q","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"80H8EnyShhq6_ZENH7aV3A","stars":5,"date":"2014-01-24","text":"We had this place for the first time tonight. They have great prices and some of the best thai food I've ever had. I was very impressed with their Tom Yum soup and the quality of the food is amazing. We have definitely found our new Thai spot.","useful":2,"funny":0,"cool":1},
{"review_id":"QNu4nQEvJbV7DOsOXjpOew","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"7Gn0NmZIagfY7JlfwuEJnw","stars":5,"date":"2014-01-24","text":"The Great Pho King. If their name alone doesn't make your stomach dance with the joy and excitement of needing a Pho King fix, then you may have a serious problem. These days it can be tough to find unique food that is delicious and mouth-watering, but The Great Pho King's combination of Vietnamese and French food does just that. The best part about this place is that it doesn't matter where in the east valley you are, because they are portable and make stops all over. If you're used to boring foods and want something that will awaken your taste buds, 'Like' this place on Facebook and follow them to their next food stop. You won't be disappointed!! I pho king love The Great Pho King, and you will too!","useful":1,"funny":1,"cool":1},
{"review_id":"HB6shmrQG_CIbccTvqrHWw","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"wZukjLaf1V2dLRQap_Zriw","stars":5,"date":"2013-04-20","text":"$5 wines and beer 11-5 every day. We love their bruschetta, one order is enough to fill up my fianc and I.","useful":0,"funny":0,"cool":0},
{"review_id":"0k1sMarrjmlu1nLlBwV8-w","user_id":"yR8zRyc7GQ4PQQOgP5a0IQ","business_id":"6P-JmU0VW-qhYq7It1wowg","stars":5,"date":"2013-12-15","text":"We get their pho at least once a week. Everyone who works here is very friendly, especially the owner. Pho 68 also has the best pho broth in the east valley--I personally love #222 made spicy.","useful":0,"funny":0,"cool":0}]